{"organizations": ["University of Leicester Students' Union", "European Union", "University of Leicester", "EU", "Leicester University", "Students' Union", "Leicester University X  Copy"], "uuid": "ba5ade143c9a4acda06e047fbd10858a30d00fea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/29307215/14351709.jpg", "site_section": "http://www.thisisleicestershire.co.uk/generalelection2010/rss.html?chid=182803", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/Comedian-Eddie-Izzard-visit-Leicester-University/story-29307215-detail/story.html", "country": "GB", "title": "fdryden published Comedian Eddie Izzard to visit Leicester University", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "fdryden published Comedian Eddie Izzard to visit Leicester University", "spam_score": 0.0, "site_type": "news", "published": "2016-05-23T14:05:00.000+03:00", "replies_count": 0, "uuid": "ba5ade143c9a4acda06e047fbd10858a30d00fea"}, "author": "fdryden", "url": "http://www.leicestermercury.co.uk/Comedian-Eddie-Izzard-visit-Leicester-University/story-29307215-detail/story.html", "ord_in_thread": 0, "title": "fdryden published Comedian Eddie Izzard to visit Leicester University", "locations": ["Leicester", "UK", "EU", "Europe"], "entities": {"persons": [{"name": "eddie izzard", "sentiment": "none"}, {"name": "rachel holland", "sentiment": "none"}, {"name": "paul boyle", "sentiment": "none"}, {"name": "peter williams", "sentiment": "none"}], "locations": [{"name": "leicester", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}], "organizations": [{"name": "university of leicester students' union", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "university of leicester", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "leicester university", "sentiment": "none"}, {"name": "students' union", "sentiment": "none"}, {"name": "leicester university x  copy", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["Eddie Izzard", "Rachel Holland", "Paul Boyle", "Peter Williams"], "text": "Comedian Eddie Izzard to visit Leicester University By fdryden | Posted: May 23, 2016 Comedian Eddie Izzard will be speaking at the University of Leicester Comedian Eddie Izzard to visit Leicester University X \nCopy link to paste in your message / Comments (0) \nComedian Eddie Izzard is dropping into The University of Leicester in a bid to get as many young people as possible to register for the EU referendum. \nHis visit on June 16 is part of a 31 city tour he is making to encourage people to vote to stay in the European Union. \nHe will be speaking about his views in the Peter Williams Lecture Theatre, Fielding Johnson South Wing, between 5pm and 6.15pm on the day. \nSpeaking ahead of this, he said: \"We know the overwhelming majority of young people want to stay in Europe because of the opportunities it presents to work, to study and to travel. I share their positive view of Europe – I am a British European who has performed in German, French and Spanish. \n\"But if they are not registered, they can't vote and those opportunities will be taken away without them getting to have their say. It only takes two minutes to register on a smartphone and it must be done by June 7.\" \nHowever, those campaigning for the \"Brexit\" campaign to leave the EU believe it will enable the UK take back control and spend money on its priorities. \nEducation bosses at the University of Leicester have also highlighted how important it is for students to cast a vote - no matter what their political preference. \nThe University of Leicester and its Students' Union have spearheaded campaigns to highlight the importance of students registering to vote, including registration in social areas of the Union, direct communications with students about the EU referendum vote, social media campaigns and letters being placed in every study bedroom in the university. \nProfessor Paul Boyle, president and vice-chancellor of the University of Leicester, said: \"Students in Leicester, together with others up and down the country, could play a decisive role in the EU referendum on June 23. \n\"The referendum is a once in a generation decision, so it's all the more vital that young people have their say. I wouldn't want any of our students to lose out on their chance to vote because they were not registered or registered to vote in the wrong place.\" \nRachel Holland, President of the University of Leicester Students' Union, said: \"We're really pleased to be welcoming Eddie Izzard to our University next month. It's vital that students and young people exercise their democratic right to vote on June 23 and regardless of which way the vote goes, it is young people who are going to be impacted the most by the result.\" \nIf students aren't sure which address they'll be at, they can register at both their term-time and home address – although they can only vote once. If students aren't sure where they'll be at either location, if they will be on holiday or if they can't get to their polling station for any reason, they should consider registering for a postal or proxy vote.", "external_links": [], "published": "2016-05-23T14:05:00.000+03:00", "crawled": "2016-05-23T14:16:13.187+03:00", "highlightTitle": ""}