{"organizations": ["Readings Property Group", "EU"], "uuid": "e504d65ab07f2ef98b450967c325e634b1cd11a1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/29337278/14420881.jpg", "site_section": "http://www.thisisleicestershire.co.uk/weathernews/rss.html?chid=182806", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/OPINION-stay/story-29337278-detail/story.html", "country": "GB", "title": "Leicester Mercury published OPINION: Should we stay?", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "Leicester Mercury published OPINION: Should we stay?", "spam_score": 0.0, "site_type": "news", "published": "2016-05-30T14:18:00.000+03:00", "replies_count": 0, "uuid": "e504d65ab07f2ef98b450967c325e634b1cd11a1"}, "author": "Leicester Mercury", "url": "http://www.leicestermercury.co.uk/OPINION-stay/story-29337278-detail/story.html", "ord_in_thread": 0, "title": "Leicester Mercury published OPINION: Should we stay?", "locations": ["Leicester", "Brexit", "UK", "Leicester Mercury"], "entities": {"persons": [{"name": "james court", "sentiment": "none"}, {"name": "court", "sentiment": "none"}, {"name": "mr court", "sentiment": "none"}], "locations": [{"name": "leicester", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "leicester mercury", "sentiment": "none"}], "organizations": [{"name": "readings property group", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["James Court", "Court", "Mr Court"], "text": "Comments (0) \nThe choice is yours in the decision to move home, but might be determined by the whole nation should we ultimately decide to quit the EU.The impact of this vital, forthcoming referendum for the nation on June 23 will take the property market into uncharted waters should the Brexit camp get its way.Until the vote is decided, the property market remains in a jittery state, with people loath to put their home up for sale until the picture is clarified.Asking local agents to venture an opinion is a tricky business, as no one can really predict what a leave vote would do to a property market, which has recently been growing, although somewhat shakily in the current economic climate. \nJames Court, director at Leicester's Readings Property Group, bravely sets out his views, albeit with a warning rider.\"It is almost impossible at present to obtain a non-partisan opinion on the impact of staying in or leaving the EU, but one thing is absolutely certain: markets do not like uncertainty.\"We saw transaction levels drop significantly during 2015 before the General Election, with many owner-occupiers and investors delaying their decision-making.\"Post-election, things very quickly returned to normal, with an uplift in transaction levels due to that previously pent up demand.\"Mr Court believes this is a route we are retracing with the EU referendum.\"We are seeing a reluctance from people to place their properties on the market for fear of the impact of a Brexit decision,\" he says. \"Notwithstanding this uncertainty, the UK market is currently characterised by a general lack of supply of available housing in any case.\"Sentiment from the domestic market is such that people are keeping their powder dry to await the results on June 23.\"April saw a dramatic reduction in transaction levels, following on from bumper March, fuelled by investors wishing to beat the increase in second home stamp duty rises. \"One school of thought is that if we leave the EU, the pound will weaken,\" says Mr Court. \"This will put pressure on interest rates, which in turn will affect consumer confidence and high street spending.\"Imports will become cheaper, which will put further pressure on our manufacturing industries and could lead to job losses.\"Clearly this will adversely impact the housing market and forecasts have suggested that our economy could take as long as two to three years to restore balance. I have heard figures as high as an 18 per cent drop in average house prices mentioned in some quarters. \"If the country's decision is to stay in the EU, the owner-occupier market is likely to be business as usual and the lost ground of the late spring will be made up during June and July, months that typically herald a slowdown in activity levels.\"", "external_links": [], "published": "2016-05-30T14:18:00.000+03:00", "crawled": "2016-05-30T15:51:22.570+03:00", "highlightTitle": ""}