{"organizations": ["Labour", "Sunday Times", "Leicester Mercury", "Maxwell House"], "uuid": "fc732af151ed8a91615ca36c51b6c7c6a5419669", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/29306754/14349602.jpg", "site_section": "http://www.thisisleicestershire.co.uk/specialolympics/rss.html?chid=181121", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/Fred-Leicester/story-29306754-detail/story.html", "country": "GB", "title": "Leicester Mercury published Fred Leicester: I'm still working class - despite the 5 types of...", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "Leicester Mercury published Fred Leicester: I'm still working class - despite the 5 types of...", "spam_score": 0.0, "site_type": "news", "published": "2016-05-23T11:45:00.000+03:00", "replies_count": 0, "uuid": "fc732af151ed8a91615ca36c51b6c7c6a5419669"}, "author": "Leicester Mercury", "url": "http://www.leicestermercury.co.uk/Fred-Leicester/story-29306754-detail/story.html", "ord_in_thread": 0, "title": "Leicester Mercury published Fred Leicester: I'm still working class - despite the 5 types of...", "locations": ["Britain", "Leicester", "Pontins", "Brexit", "UK", "London"], "entities": {"persons": [{"name": "robert peston", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "john", "sentiment": "none"}, {"name": "fred leicester", "sentiment": "none"}, {"name": "john prescott", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "pontins", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "none"}, {"name": "sunday times", "sentiment": "none"}, {"name": "leicester mercury", "sentiment": "none"}, {"name": "maxwell house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["Robert Peston", "Jeremy Corbyn", "Corbyn", "John", "Fred Leicester", "John Prescott"], "text": "Comments (1) \nThe big question arrived at the fag end of the interview, as the Labour leader Jeremy Corbyn sat back in his chair, mentally switching off, relieved it was almost over. \n\"Do you think of yourself as middle class?\" asked Robert Peston, almost as an afterthought, unaware this was The One that would stump the Labour leader. \"Oh Gawd,\" said Corbyn, reeling. \"I dunno.\" \nAnd he uhmmed and he arrhed and explained that he lived in a house with a mortgage but because he was an MP he may well be middle class but he represented the poor and the down trodden so maybe he wasn't. But he didn't know. Not really. \nAnd there we are. Britain in a nutshell, where the articulate leader of the opposition, the tweed and cord-wearing epitome of a north London metropolitan socialist, a politician who can fend off complicated political questions about the economy and Brexit and austerity but come unstuck when a man asks him to define his very essence. \nBecause social class, still, is tricky in the UK. It shouldn't be. But it is. \nI reckon most sensible people can pinpoint a specific moment they went off John Prescott, the bumbling buffoon with the extra portion of face and brass neck who was, lest we forget, the Deputy Prime Minister of this country. \nThere's a few to chose from. The two Jags. The astonishing adultery. The croquet. The casual violence. The rambling sentences which made no sense. \nFor me, although all of those are valid, it was the time he said we were \" all middle class now. \" No thanks, John. You might think you are. But you don't speak for me. \nI'd rather have an over-earnest, middle class Labour leader struggling with his bourgeois status than an obvious working class Labour deputy leader insisting he's not. Because that doesn't feel like understandable class confusion to me. It feels like betrayal. \nI've reined myself in on this front. With age, comes wisdom and temperance. I used to feel so strongly about this there were times when I barely spoke of anything else. I banged my working class drum so loudly and so often I gave myself a headache. In the end, I bored myself with it. God only knows what it did to everyone else. I feel bad about that. \nI sort of understand why I did, though. The 80s and 90s were full of people talking excitedly about aspiration.It was the golden era of aspiration. Aspiration, aspiration, aspiration seemed more important than education, education, education. \nIn the shadow of this much sought after aspiration was a rush of working class people declaring themselves middle class. I never quite got that. Mainly because I don't think there's anything wrong with being working class. \nYou might think I'm middle class. I'm a journalist. I have five different kinds of pasta in my cupboard and four different kinds of olive oil by the hob. I have the Sunday Times. I watch Newsnight. I have bread in the cupboard with sawdust-like bits in it. I sometimes eat fish that isn't battered and a few years ago I moved from Maxwell House coffee to something in a silver tin which is much better. I recommend it. \nBut I'm not middle class. You can say I am, if you like, but you'd be wrong. Because you don't define my class. I do. \nI am working class. I'm the son of a hard-working, decent man who made his living with his hands. It might say Columnist of the Year above this page - well, I'm writing this on Thursday, this year's award were on Friday. I won't win it again (Editor's note - He didn't, the let down) – but I'm not fit to lace his boots. He's a proper man. \nWe went to Pontins on holiday when we were kids and I was raised in the bosom of a big, funny, brilliant extended working class family full of strong women who kept the show on the road and good men who would play football with you in the park and mended your bike chain when it broke and all seemed lost. \nI loved them then, as a kid, who knew nothing else, and I love them now, as an adult, who knows a little bit more. \nI like football and pubs. I can whistle, loudly, through my fingers. Pie is still reliably my favourite tea of the week (and it's tea, not dinner). Most of my friends have ridiculous nicknames, even though they're in their 40s. And if I was to give you directions to anywhere in Leicester, I would do so not by landmarks or street names but pubs, or pubs that once were there. \"Yes mate, it's just by what used to be the Pump and Tap, doyouknowworrimean? \"Etc, etc. \nYes please. \nBut it doesn't matter does it? It used to irk me when lads I went to school with, lads I played football with down the field until the sun went down, started saying they were middle class because they had a company car. But it's not up to me to define them is it? Just like it's not up to anyone else to define me.You are what you think you are. That's all that matters. \nToday I'm raising a couple of kids who, at 15 and 12 , already talk about going to university. They like bread with sawdust bits in and they're totally unmoved by The Dukes of Hazzard. They're middle class in a way I can never be. \nBut they know where they're from. They know what their granddad did and their granddad before him. And they know what that means. \nBecause I think that's important.", "external_links": [], "published": "2016-05-23T11:45:00.000+03:00", "crawled": "2016-05-23T14:00:29.275+03:00", "highlightTitle": ""}