{"organizations": ["European Union", "Times", "EU"], "uuid": "8da7ba4e0b8cbe7b403434e875d2211f19b8c230", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article11392180.ece/ALTERNATES/s1200/JS90851654.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-opinion/scares-lies-false-indignation-eu-11392181", "country": "GB", "domain_rank": 21960, "title": "Scares, lies and false indignation: the EU referendum debate is getting worse", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Scares, lies and false indignation: the EU referendum debate is getting worse", "spam_score": 0.0, "site_type": "news", "published": "2016-05-26T22:38:00.000+03:00", "replies_count": 0, "uuid": "8da7ba4e0b8cbe7b403434e875d2211f19b8c230"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-opinion/scares-lies-false-indignation-eu-11392181", "ord_in_thread": 0, "title": "Scares, lies and false indignation: the EU referendum debate is getting worse", "locations": ["Britain", "Castle Combe", "Brussels", "Wiltshire", "Brexit", "England", "Europe", "EU", "London"], "entities": {"persons": [{"name": "graeme whitfield", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "zac goldsmith", "sentiment": "none"}, {"name": "cameron", "sentiment": "none"}, {"name": "boris johnson", "sentiment": "none"}, {"name": "mr pot", "sentiment": "none"}, {"name": "boris", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "castle combe", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "wiltshire", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "european union", "sentiment": "none"}, {"name": "times", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["Graeme Whitfield", "Brexit", "Zac Goldsmith", "Cameron", "Boris Johnson", "Mr Pot", "Boris"], "text": "Journal business editor Graeme Whitfield on how the negative EU debate is setting a worrying precedent Shares Get business news by email Matt Cardy/Getty Images Graffiti calling for an out vote adorns a poster calling support for a vote to remain in the European Union in the referendum being held on June 23 that is displayed on a field gate on March 23, 2016 near Castle Combe, Wiltshire, England \nA few weeks ago I wrote about the depressingly poor standard of the EU referendum debate, and, if nothing else, events since then have proved that no one takes a blind bit of notice of me. \nThe public is being given a choice between being scared witless about the economy or being scared witless about foreigners. People are desperate for facts, but because there aren’t any – no one can know what life would be like after Brexit, so the best anyone can do is an educated guess – scaremongering has taken over. \nThe campaign has raised some chuckles, at least, in causing the tabloid press to froth at the mouth about EU scaremongering, something they had assumed they had cornered the market in for many years. \nIt is hard not to wonder too whether Mr Pot has been introduced to Mr Kettle when you see Boris Johnson, a man who has fibbed his way through his adult life, complaining about the Remain side’s tactics. \nThe former mayor of London, having been sacked by The Times for fabricating a quote, became The Telegraph’s Brussels correspondent in the 1990s and spent a number of years making up stories about the EU. Why anyone would listen to a single word he says on Europe now is beyond me. \nIt seems reasonably clear that if your vote in the EU referendum is based on the economics of Brexit, any sensible person would vote to Remain. The vast majority of studies, including many by people with no axe to grind, show that leaving the EU would cost us jobs and reduce incomes. \nThere are other factors that could decide people’s votes, of course, and that is fine. \nWhat is concerning – with still nearly a month to go and the polls suggesting a close race – is how negative both campaigns are getting. \nHaving won the Scottish referendum and last year’s General Election by prophesying doom if the other side won, Cameron is returning to his favourite tactic. The Leave side are running much the same game plan, all but predicting an invasion of Mongol maurauders if we stay in the EU. \n(It’s interesting that Project Fear failed to work in the London mayoral election, though my guess is that that failure was mostly down to the cackhanded nature of Zac Goldsmith’s dog whistle campaign, aided and abetted by that man Boris). \nWith four weeks of campaigning to go, it would be refreshing for politicians to present a positive vision of what remaining or leaving the EU would mean for Britain. But I’m not holding my breath. \nGraeme Whitfield is business editor of The Journal", "external_links": [], "published": "2016-05-26T22:38:00.000+03:00", "crawled": "2016-05-26T22:56:35.537+03:00", "highlightTitle": ""}