{"organizations": [], "uuid": "d0383f310eeb8557cba1f7b1b1750c79f9664ec5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article10013925.ece/ALTERNATES/s1200/JS71237427.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/growing-demands-government-come-clean-12180548", "country": "GB", "domain_rank": 21960, "title": "Growing demands on Government to 'come clean' over Nissan deal", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Growing demands on Government to 'come clean' over Nissan deal", "spam_score": 0.0, "site_type": "news", "published": "2016-11-16T04:00:00.000+02:00", "replies_count": 0, "uuid": "d0383f310eeb8557cba1f7b1b1750c79f9664ec5"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/growing-demands-government-come-clean-12180548", "ord_in_thread": 0, "title": "Growing demands on Government to 'come clean' over Nissan deal", "locations": [], "entities": {"persons": [{"name": "philip hammond", "sentiment": "negative"}, {"name": "tyrie", "sentiment": "none"}, {"name": "owen humphreys/pa wire", "sentiment": "none"}, {"name": "greg clark", "sentiment": "none"}, {"name": "andrew tyrie", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "clark", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "america", "sentiment": "none"}, {"name": "qashqai", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "lord mayor’s banquet", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "wales", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}], "organizations": [{"name": "nissan", "sentiment": "negative"}, {"name": "cabinet committee", "sentiment": "none"}, {"name": "journal", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "treasury select committee", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Growing demands on Government to 'come clean' over Nissan deal Chancellor Philip Hammond must reveal whether Nissan was promised public money, says senior MP Andrew Tyrie Share Workers at Nissan working on the Qashqai in Sunderland (Photo: Owen Humphreys/PA Wire)   chair of the prestigious Treasury Select Committee has demanded the Government reveal more about the assurances it offered to Nissan. \nAndrew Tyrie, one of the most senior backbenchers in the House of Commons, told Chancellor Philip Hammond that the Government must reveal whether any promises were made that could involve providing government funds. \nIt comes three weeks after the Japanese carmaker announced it was building the next Qashqai and X-Trail models at its Sunderland factory, safeguarding more than 7,000 jobs. \nThe decision ended fears that the decision to leave the EU could lead to Nissan cutting off investment to the North East. \nAnd it followed intervention from Business Secretary Greg Clark, who met Nissan bosses in Japan and wrote a letter offering reassurances. \nMr Clark has insisted there was “no cheque book” involved in the promises given to Nissan. Instead, he said the Government had promised continued support for the competitiveness of the car industry, bringing more of the supply chain into the UK, backing for research and development, and seeking “unencumbered” trade. \nBut he has refused to publish the letter. The Nissan logo (Photo: Owen Humphreys/PA Wire) \nMr Tyrie has now written to the Chancellor to ask for further information. \nHe said: “The Government has not yet clarified whether any form financial assistance has been discussed with Nissan to persuade it to stay in Sunderland. If it has made commitments that could lead to a call on public funds, the Government would have a duty to inform Parliament about them now. So I have written to the Chancellor to ask for clarification.” \nThe Government says it is refusing to give a “running commentary” about Brexit but Mr Tyrie said this “sits oddly” with the commitments on tariffs and protection from bureaucracy apparently made by the Business Secretary. Read More Nissan takes crown as the North East's largest company in Journal's Top 200 event \n“A running commentary for a few firms, but not the rest of UK business, would be both unacceptable and counter-productive. \n“The Government can and should set out its objectives for the negotiations, and sooner rather than later. By doing so it can allay concerns – fuelled by periodic leaks from Cabinet Committee meetings and by today’s memo – that it is still unsure about them.” \nThe letter asks the Chancellor whether Treasury consent has been given, provisionally or otherwise, for Government assistance to be provided to Nissan under the Industrial Development Act 1982. Chancellor Philip Hammond \nThis Act allows the Government to provide assistance to industry, up to a specified limit. But the Act states that the provision of such assistance requires the consent of the Treasury, and if a Minister were to offer assistance to Nissan without Treasury consent, they would be making a commitment that they may not be able to honour. \nThe letter also asks the Chancellor whether the support offered to Nissan involves any commitment to the future use of public funds. \nFinally, the letter asks the Chancellor whether the Treasury has been consulted by either Number 10 or the Department for Business, Enterprise and Industrial Strategy, about the compatibility of the assurances offered to Nissan with EU state aid and World Trade Organisation rules. \nPrime Minister Theresa May claimed on Monday night the Government’s success in convincing Nissan to continue investing in the North East proves the UK can still be a global leader after Brexit. \nIn a speech at the Lord Mayor’s Banquet in London, she said: “We will do everything we can to make the UK outside the EU the most attractive place for businesses to invest and grow. \n“Already by showing our commitment to the UK’s future competitiveness, we have secured a new deal with Nissan in the North East and a ground-breaking agreement with America that Wales will not just be the European hub, but rather the global hub for maintaining, repairing, overhauling and upgrading the F35 fighter aircraft.” Read More", "external_links": [], "published": "2016-11-16T04:00:00.000+02:00", "crawled": "2016-11-15T23:23:34.317+02:00", "highlightTitle": ""}