{"organizations": [], "uuid": "3ff3f5939484974f64b5e43828040e8dfae34ec4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12121191.ece/ALTERNATES/s1200/Tyne-Bridge-and-Swing-Bridge.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-opinion/britain-needs-investment-infrastructure-grow-12149095", "country": "GB", "domain_rank": 21960, "title": "Britain needs investment in infrastructure to grow in a post-Brexit world", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Britain needs investment in infrastructure to grow in a post-Brexit world", "spam_score": 0.0, "site_type": "news", "published": "2016-11-09T16:59:00.000+02:00", "replies_count": 0, "uuid": "3ff3f5939484974f64b5e43828040e8dfae34ec4"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-opinion/britain-needs-investment-infrastructure-grow-12149095", "ord_in_thread": 0, "title": "Britain needs investment in infrastructure to grow in a post-Brexit world", "locations": [], "entities": {"persons": [{"name": "philip hammond", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "tyne bridge", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "heathrow", "sentiment": "none"}, {"name": "gateshead millennium bridge", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}], "organizations": [{"name": "newcastle upon tyne share", "sentiment": "negative"}, {"name": "j&b recycling", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "invalid email  newcastle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The Tyne Bridge and Swing Bridge, Quayside, Newcastle Upon Tyne Share Get business updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nNewcastle is a city that celebrates infrastructure – for proof, just look to the bridges. \nThe Tyne Bridge and Gateshead Millennium Bridge, opened over 70 years apart, represent the city. One grand and green, the other sleek and modern, both show that we are – and always have been – confident in ourselves. \nHowever, we must maintain this level of ambition. Nationally, Britain needs significant investment in its infrastructure to maintain and grow its stature in a post-Brexit world. The upcoming Autumn Statement is the perfect opportunity to make this happen. \nPhilip Hammond has made a tentative commitment to this, ruling out a ‘splurge’ but signalling investment in ‘productivity-enhancing infrastructure’. Elsewhere, the Heathrow announcement shows a country serious about infrastructure. \nFor Newcastle residents, investment in infrastructure is likely to be less glamorous and could mean the dualling of the A1 from here to Scotland. Nevertheless, such a commitment could be transformative for the city, and not just when it’s completed. \nDuring construction, projects like this provide a huge boost to service suppliers who are contracted to help with construction and delivery. Often, the temptation can be to choose big international names for these jobs, helping a few select companies cement their position at the top. \nInstead, we need confidence in ourselves and in our businesses. There are scores of small and mid-sized British firms with the potential to deliver the services that these projects need, from highly technical manufacturing through to big construction. \nThese companies deserve to win contracts from the government and should be given confidence in their ability to scale up and deliver them. This can transform not just businesses but their local communities. \nAt BGF, we have recently reached £1bn of investment in British business, something achieved after only five years of operation. We have invested £215m of this in the North because we know that the region is rich in high-potential companies. \nI have seen how high-potential companies have grown thanks to government contracts. These projects help companies invest in new talent and technology, enabling them to have a significant, positive impact on their local economy and community. \nThis creates a virtuous cycle. Companies are able to ‘scale up’, meaning that they can service ever larger and more complex contracts from both the private and public sector. What’s more, they are given kudos and respect for working on renowned local government projects, which helps to grow a company’s reputation and attract more business. \nOf course, small and medium sized businesses need support, which is why confidence is so important. These companies do not have the back-office functions of larger corporations, they need support in how to bid for, service and price a large contract – but believing in them does pay off. \nLocally, I look to the likes of J&B Recycling, a waste recycling company which we invested £7.5m in. The company could play a key role in providing effective waste management to infrastructure development, increasing a project’s sustainability and delivering local investment. Today the business employs 175 people and has a turnover circa £10m – imagine those numbers if J&B won new infrastructure contracts. \nIf we are serious about Britain’s role in the world outside the EU then we need to support our infrastructure and, even more importantly, we need to back our small and medium sized businesses to deliver it. Share", "external_links": [], "published": "2016-11-09T16:59:00.000+02:00", "crawled": "2016-11-09T12:44:29.924+02:00", "highlightTitle": ""}