{"organizations": [], "uuid": "ba692f68847c40d0aa2a7b73392db07228d45e7f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12214888.ece/ALTERNATES/s1200/Chancellor-launches-cyber-security-strategy.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/autumn-statement-chancellor-announce-pay-12214891", "country": "GB", "domain_rank": 21960, "title": "Autumn statement: Chancellor to announce pay rise for thousands of North East workers", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Autumn statement: Chancellor to announce pay rise for thousands of North East workers", "spam_score": 0.0, "site_type": "news", "published": "2016-11-23T12:00:00.000+02:00", "replies_count": 0, "uuid": "ba692f68847c40d0aa2a7b73392db07228d45e7f"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/autumn-statement-chancellor-announce-pay-12214891", "ord_in_thread": 0, "title": "Autumn statement: Chancellor to announce pay rise for thousands of North East workers", "locations": [], "entities": {"persons": [{"name": "philip hammond", "sentiment": "negative"}, {"name": "george osborne", "sentiment": "none"}, {"name": "hammond", "sentiment": "none"}, {"name": "chris", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north-east", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "newcastle-upon-tyne", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "north tyneside", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "south east", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}], "organizations": [{"name": "micosoft", "sentiment": "negative"}, {"name": "great north air ambulance trust", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}, {"name": "resolution foundation", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Chancellor Philip Hammond speaking at Micosoft's Future Decoded Conference at ExCel in London (Photo: Chris Radburn/PA Wire) Share Get   Thank you for subscribing!   \nChancellor Philip Hammond will announce a pay rise for thousands of North East workers in his Autumn Statement today. \nHe will announce that the compulsory living wage is to increase to £7.50 an hour from April 2017. \nIt’s an inflation-busting increase of four per cent higher than the current living wage of £7.20. Around one in five Birmingham workers are receiving the living wage. \nThe Government’s living wage is the minimum wage for workers aged 25 and over. It is separate to the living wage used by many local councils - which is higher - but it is compulsory for every employer. \nMr Hammond will say that his Autumn Statement is designed to improve the living standards of ordinary working class people and their families. \nHe will also announce a new crack-down on employers who underpay their staff. \nOther announcements include: A 1.4 billion cash injection to help build 40,000 new homes. A ban on letting agent fees, to save people money when they rent privately Billions on research and development, which the Government says will help create higher skilled, higher wage, jobs \nAs expected, Mr Hammond will also confirm that he is watering down cuts to benefits announced by the previous Chancellor, George Osborne - but many families will still lose money as a result of a freeze to working tax credits. Read More 'Tenant tax' which would have been costly for 11,000 North East families is scrapped by Government \nThink tank the Resolution Foundation says that people benefiting most from the introduction of the Government’s living wage are those living outside London and the South East, where wages are already relatively high. \nResearch shows that 25% of employees in Northumberland, one in four, and 21% in County Durham , one in five, receive the Government’s living wage. \nIn North Tyneside and in Sunderland the figure is 18%. \nIn Gateshead and Newcastle-upon-Tyne it is 17%. \nBut Mr Hammond is also likely to to be forced to admit that the country is still running up massive debts, partly as a result of Brexit. \nThe Treasury had expected to run a surplus in 2019-20, but Mr Hammond will say that the UK is now expected to run a sizeable deficit in that year, which means the Government will still be spending more than it receives in taxes, with borrowing making up the difference. \nReports suggest mediocre economic growth, higher inflation and a lack of business investment is set to cost the Treasury £100bn. Read More 'Keep your promise to the North East' - MP's message to Government ahead of Autumn Statement \nThe Chancellor is also expected to announce that life-saving charity the Great North Air Ambulance Trust is set to get £1 million of government money to build a new operations centre. \nThis will allow the organisation to move to better facilities to support its three aircraft which look after patients across the whole of the North East of England. \nAlongside an operations centre, the organisation also intends to use some of the funding to create a centre of medical excellence in the North-East, boosting training and research functions. \nThe money to support this essential work comes from a share of Libor funds, which are raised through fines levied on banks, and then distributed to charities and organisations that demonstrate and represent the best of causes. Like us on Facebook", "external_links": [], "published": "2016-11-23T12:00:00.000+02:00", "crawled": "2016-11-23T07:20:46.553+02:00", "highlightTitle": ""}