{"organizations": [], "uuid": "9153047b35ac09ccfabd7136adcb2819f07413bd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12188395.ece/ALTERNATES/s1200/CFR_NJL_171116maldron_01.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/business-breakfast-live-lanchester-group-12183121", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: New 4-star hotel plan announced for Newcastle city centre, plus latest news", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast LIVE: New 4-star hotel plan announced for Newcastle city centre, plus latest news", "spam_score": 0.0, "site_type": "news", "published": "2016-11-17T15:20:00.000+02:00", "replies_count": 0, "uuid": "9153047b35ac09ccfabd7136adcb2819f07413bd"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/business-breakfast-live-lanchester-group-12183121", "ord_in_thread": 0, "title": "Business Breakfast LIVE: New 4-star hotel plan announced for Newcastle city centre, plus latest news", "locations": [], "entities": {"persons": [{"name": "coreena ford", "sentiment": "negative"}, {"name": "dermot crowley", "sentiment": "none"}, {"name": "tony cleary", "sentiment": "none"}, {"name": "dalata", "sentiment": "none"}, {"name": "andrew hodgson", "sentiment": "none"}, {"name": "hayley smith", "sentiment": "none"}, {"name": "moya greene", "sentiment": "none"}, {"name": "marc carter", "sentiment": "none"}, {"name": "ross", "sentiment": "none"}, {"name": "gormley", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "marc", "sentiment": "none"}, {"name": "dominic lipinski/pa wire", "sentiment": "none"}, {"name": "neil wilson", "sentiment": "none"}, {"name": "richard branson", "sentiment": "none"}, {"name": "jeremie", "sentiment": "none"}, {"name": "mcaleer", "sentiment": "none"}, {"name": "ben carter", "sentiment": "none"}, {"name": "spicer", "sentiment": "none"}, {"name": "tommee tippee", "sentiment": "none"}, {"name": "clayton", "sentiment": "none"}, {"name": "rowan gormley", "sentiment": "none"}, {"name": "chris", "sentiment": "none"}, {"name": "coreena ford tommee tippee", "sentiment": "none"}, {"name": "wilbur ross", "sentiment": "none"}, {"name": "ben", "sentiment": "none"}, {"name": "rushe", "sentiment": "none"}, {"name": "stephen surphlis", "sentiment": "none"}], "locations": [{"name": "newcastle", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "dalata", "sentiment": "none"}, {"name": "newgate street", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "lanchester wines", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "newgate centre", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}, {"name": "virgin money", "sentiment": "none"}, {"name": "north shields", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "maldron hotel", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "greencroft bottling share", "sentiment": "none"}, {"name": "stanley", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east fund", "sentiment": "none"}, {"name": "wallsend", "sentiment": "none"}], "organizations": [{"name": "mcaleer & rushe", "sentiment": "none"}, {"name": "etx capital", "sentiment": "none"}, {"name": "newgate centre", "sentiment": "none"}, {"name": "coreena ford craft yourself silly", "sentiment": "none"}, {"name": "virgin money", "sentiment": "none"}, {"name": "european investment bank", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "lanchester gifts", "sentiment": "none"}, {"name": "general logistics systems", "sentiment": "none"}, {"name": "a&e", "sentiment": "none"}, {"name": "maldron hotel", "sentiment": "none"}, {"name": "unite group plc", "sentiment": "none"}, {"name": "local authorities", "sentiment": "none"}, {"name": "journal", "sentiment": "none"}, {"name": "lanchester energy", "sentiment": "none"}, {"name": "eib", "sentiment": "none"}, {"name": "coreena ford royal mail", "sentiment": "none"}, {"name": "smd ltd.", "sentiment": "none"}, {"name": "coreena ford", "sentiment": "none"}, {"name": "lanchester properties", "sentiment": "none"}, {"name": "mayborn group", "sentiment": "none"}, {"name": "goldman sachs international", "sentiment": "none"}, {"name": "tommee tippee", "sentiment": "none"}, {"name": "north east england chamber of commerce", "sentiment": "none"}, {"name": "erdf", "sentiment": "none"}, {"name": "local government", "sentiment": "none"}, {"name": "european regional development fund", "sentiment": "none"}, {"name": "dalata hotel group", "sentiment": "none"}, {"name": "business development and finance", "sentiment": "none"}, {"name": "craft yourself silly", "sentiment": "none"}, {"name": "bank of america merrill lynch", "sentiment": "none"}, {"name": "royal mail", "sentiment": "none"}, {"name": "wl ross & co", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford That's all folks... \nThat’s all for the blog, but I intend to be in Property Tale Heaven today.... keep an eye on the site people. \nSee you back here tomorrow morning. 9.27 Coreena Ford Cyber attacks warning to online retailers \nFraudsters will launch nearly one million cyber attacks a day on UK online retailers during a key shopping week in the run-up to Christmas. \nAnalysts believe criminals will focus on buying consumer electronics including games consoles and mobile technology as the number of internet shoppers surges over so-called Black Friday and Cyber Monday. \nThe consumer bonanza is an American trend that has spread to the UK, with Black Friday, now Britain’s biggest shopping day, falling the day after Thanksgiving. \nThe following Monday has been branded Cyber Monday, when online deals take centre stage. \nBlack Friday is on November 25 this year, while Cyber Monday is on November 28. \nCybercrime prevention company ThreatMetrix is predicting 6.5 million cyber attacks on UK retailers during that week. \nBritain broadly experiences around 13% of global attacks on online retailers, and there are predicted to be around 50 million worldwide that week. In the same period in 2014 globally there were 11.4 million attacks, and in that week in 2015 there were 30 million, and experts believe they will see a rise to 50 million this year. \nDuring the final three months of 2016 there are expected to be around 20 million attacks on UK shopping websites, up from 16.5 million between July and September. \nWorldwide, there were 76 million blocked online transactions in those three months, a 60% rise on the same period in 2015. (Photo: Dominic Lipinski/PA Wire) Coreena Ford £145m North East fund that could create 3,500 jobs is signed \nA £145m European fund that could help North East businesses create up to 3,500 jobs will go live early next year after an agreement was finally signed. \nFormerly known as Jeremie 2, the North East Fund will offer different types of equity investments and loans to companies to speech up local growth, investment and job creation in the region. \nThe announcement has been heralded as a milestone in public sector support for regional business growth and will be a catalyst to access significant European Investment Bank (EIB) investment. \nThe agreement has been signed by the seven Local Authorities in the North East, North East (SPV) Limited and the Department for Communities and Local Government (DCLG) which has responsibility for the European Regional Development Fund (ERDF) in England. \nOver the next five years, the North East Fund will pump loan, equity and mezzanine funding into new and existing fast-growing businesses across a wide range of sectors which will spearhead new regional economic growth. \nIt is estimated that some 600 businesses could be supported by the fund, which will also help create around 2,500 jobs in the next five years and a further 1,000 jobs throughout the life of the fund – and deliver a legacy fund of up to £80m over the next decade for further financial support to companies. Andrew Hodgson of SMD Ltd. in Wallsend 9.15 Coreena Ford Majestic Wine at 'tipping point' \nMajestic Wine swung into the red with half-year losses of £4.4m, but said it was at a “tipping point” in its return to profit growth. \nThe warehouse wine retailer first issued a profit warning in September after taking a hit from a failed marketing campaign for its Naked Wines business in America and weak sales to business customers. \nThe £4.4m loss for the six months to September 26 compares with a bottom-line pre-tax profit of £4.3m a year earlier. But Majestic Wine cheered a 10.6% rise in underlying sales growth at £205.6m. Chief executive Rowan Gormley sought to reassure investors that the company was heading for growth. \nHe said: “We are at the tipping point. \n“From now on we are confident that future sales growth will translate to profit growth, because the step-change in fixed-cost growth is complete (and) we are aiming for, and look like we are achieving, sustainable sales growth.” \nHe added that the company has reinstated its dividend at 1.5p per share and is on track to notch up £500m sales by 2019. \nThe company has embarked on a three-year turnaround plan aimed at expanding and retaining its customer base, slowing down branch network expansion, and acquiring new customers for Naked Wines. \nIt has seen Majestic spend more money on media, staff training, and its IT and digital marketing teams. Despite setbacks, the firm said it intends to stick to plans to invest in growing Naked Wines and transforming its retail business. \nMr Gormley said: “Our plan is working. We said that we would deliver sustainable growth, not by opening more stores, but by investing in better customer service and better customer retention.” \nNeil Wilson, a markets analyst at ETX Capital, warned that Majestic needs to get profits on track quickly. \nHe said: “Chief executive Rowan Gormley may insist that the plan is working ... but this massive growth splurge has to turn into sustainable profits soon.” Majestic Wine's chief executive Rowan Gormley 9.00 KEY EVENT BREAKING - new hotel announced for Newcastle city centre \nA new hotel will open in less than two years at the redeveloped Newgate Centre, we can reveal. \nDalata Hotel Group plc has signed a 35 year lease with Northern Ireland based developer McAleer & Rushe, which will being a new four-star Maldron Hotel to Newcastle city centre. \nThe new 100,000 sq.ft, six-storey hotel is strategically located on Newgate Street and will be developed by McAleer & Rushe, who have worked closely with Dalata on a wide range of projects throughout the UK and Ireland. \nThe hotel, which is expected to open in summer 2018, will offer 226 air-conditioned bedrooms, a bar, restaurant and business centre facilities. \nAlongside the flagship hotel, the redevelopment of the former Newgate Centre comprises 185,000 sq.ft of student accommodation operated by the Unite Group Plc to deliver 575 beds, as well as 20,000 sq.ft of modern retail and leisure space, making it a truly mixed-use scheme with all the associated long-term economic and employment benefits for the city. \nStephen Surphlis, property director at McAleer & Rushe, added: “The addition of this quality hotel brand reflects the wider importance of this entire mixed-use development and will be a major asset to the city as a whole, as well as attracting business and leisure travellers to Newcastle. We look forward to working alongside Dalata, for whom we have previously delivered numerous projects”. \nDermot Crowley, Deputy CEO Business Development and Finance at Dalata, said: “This development provides us with an exciting opportunity to launch our Maldron brand in the English market, in line with our strategy of rolling out our Clayton and Maldron brands in the large regional UK cities. \n“We are delighted to be working on this project with our development partner, McAleer & Rushe, and look forward to opening in Newcastle in summer 2018”. A CGI of how the Maldron Hotel will look in Newcastle 8.55 Coreena Ford Royal Mail earnings fall after Brexit vote hits marketing mail \nRoyal Mail has posted a fall in half-year earnings and said it was keeping a close eye on the economy after the Brexit vote hit marketing mail. \nThe group said uncertainty surrounding the referendum saw marketing activity reined in across the UK, with revenues from advertising mail down 8% in its first half. \nThis contributed to an 11% tumble in underlying earnings across its letters and parcels business, to £247m in the six months to September 25. \nBut it saw a better performance in its European parcels business, General Logistics Systems (GLS), where operating profits leapt 25% to £89m. \nGroup-wide underlying earnings fell 5% to £320m in the first half, but chief executive Moya Greene said it was a “resilient performance against a backdrop of low inflation and highly competitive markets”. \nRoyal Mail also announced plans to ramp up cost savings, with a new target of £600 million a year, up from £500 million previously. \nIt added: “As always, our performance for the full year will be dependent on the important Christmas period.” Plans for the festive surge in mailings include hiring another 19,000 temporary staff and opening nine temporary parcel sorting centres. \nRoyal Mail said letter mailings - in particular advertising letters - were closely linked to the performance of the wider economy. “We are monitoring developments in the UK economy closely as we have already seen some impact of the softer economic conditions on our marketing mail revenue,” it said. Royal Mail saw the numbers of addressed letter mailings across the UK fall 4% in its first half, which it said was within its expectations for a drop of between 4% and 6% over the year. \nLetter revenues fell 3%, but turnover from parcel deliveries lifted 3%. \nIt said it was still being hit by last year’s rollout of Amazon’s delivery network, but was beginning to replace the lost revenues by boosting its business-to-business account parcels offering. A post box outside a Royal Mail sorting office 8.50 Coreena Ford Craft Yourself Silly wins national award for exporting proggy mats \nA company that has turned a traditional North East art form into an international bestseller has scooped a top national award. \nNorth Shields-based Craft Yourself Silly - which designs and manufactures proggy mats - has won the New Exporter of the Year prize at the National Business Awards. \nThe firm was praised by judges as an “excellent example of the best of British design, successful thanks to its unrelenting determination and energy to make its overseas foray a success”. \nThe prize is the latest success for company which won the new exporter category at the North East Exporters’ Awards organised by The Journal and the North East England Chamber of Commerce earlier this year. \nDirector Hayley Smith said: “Never in a million years did we think we would win, so it’s absolutely amazing. \n“This is for more than businesses in North Shields, it’s businesses in the North East. We’re really keen to keep everything manufatured in the North East and produced in the North East as much as we can.” Hayley Smith, Director at Craft Yourself Silly, with the national business award 8.49 FTSE and pound latest \nThe FTSE-100 index at 8:15am was up 0.44 at 6750.16. \nThe pound at 8am was 1.2453 dollars compared to 1.2450 dollars at the previous close. The euro at 8am was 0.8608 pounds compared to 0.8593 pounds at the previous close. 8.44 Coreena Ford Tommee Tippee steps in to help desperate dad in search for c \nThe campaign to help a desperate dad find a very specific cup for his severely autistic teenager is gaining momentum, having already gone viral at the start of this week. \nCramlington-based Mayborn Group, makers of the Tommee Tippee brand, joined the search after dad Marc Carter issued a plea on Twitter for people to search for a blue Tommee Tippee cup for his son Ben, the only cup he will use to drink. \nThe 13-year-old has severe autism and will only drink out of the two-handle cup which is no longer manufactured by Northumberland-based Tommee Tippee. \nThe appeal said: “Ben is 14 and has severe autism, he’s non-verbal and has very limited understanding. Since the age of two he has drunk exclusively from a little blue Tommee Tippee two-handled cup. \n“Fortunately about three years ago we managed to replace this very old and disintegrating cup with a newer one - cup part first, lid a few weeks later. He was suspicious but we survived. \n“No big deal, right? We can just get something else! You’d think, eh. Ben hasn’t drunk at school since the age of five, he doesn’t drink outside of the house so we can’t go anywhere. People say he will drink when he’s thirsty, but two emergency trips to A&E with severe dehydration say otherwise.” \nIn steps The Internet. And 17,500 shares later Marc is overwhelmed by global support, and has a couple of cups on the way to him. \nMessages are still coming through thick and fast, and that’s when Tommee Tippee got involved, having found one of the cups in its cupboards. \nThe social media team here in the North East is now fielding the numerous posts and asking for anyone who thinks they have the very specific blue cup to contact them directly through their Twitter handle @tommeetippee_UK, while also monitoring the #CupForBen. The team will then deal with each offer directly, to make sure it’s the exact cup Ben needs, and arrange for it to be sent to the family. \nMeanwhile, the firm is still looking across its global business to see if it has old samples of the cup to send directly to Ben. \nA quick look on Twitter shows the social media team are being kept very busy, with lots of tweets like the one below to sift through. \nIsn’t the power of the internet a wonderful thing sometimes? Ben Carter, whose dad is looking for a Tommee Tippee cup for him 8.35 US billionaire sells off Virgin Money stake for £171.5m \nAmerican billionaire Wilbur Ross has offloaded his remaining stake in lender Virgin Money for £171.5m. \nIt was almost double the shares his private equity firm WL Ross & Co had previously planned to sell. \nThe investment group said: “Following strong demand, WL Ross decided to upsize the transaction. \nOn completion of the placing, WL Ross will not hold any shares in Virgin Money.” \nThe firm said it increased its sale from 27 million shares to 53.6 million shares, which it sold at 320p each. \nThe sale comes after Virgin Money shares have risen nearly 65% since being battered in the immediate fallout of the Brexit vote, but are still trading lower than their pre-referendum high of 366p. \nVirgin Money, backed by Sir Richard Branson, was valued at £1.25bn when it floated on the London market in 2014. Bank of America Merrill Lynch and Goldman Sachs International were joint bookrunners in the WL Ross placing. (Photo: Chris Radburn/PA Wire ) KEY EVENT Lanchester group fit for future growth after year of heavy investments \nThe Lanchester group of companies has posted turnover of £75.5m and in increase of £15m in the value of its asset base after a year of solid investments. \nHeadquartered near Stanley in County Durham, the group of companies includes Lanchester Wines, Greencroft Bottling, Lanchester Gifts, Lanchester Energy, Lanchester Properties and Spicer’s of Hythe. \nAccounts for the year ending June 30 2016 show the group of companies’ profits at £3.7m - down on 2015’s profit of £5m, and the turnover figure was also 1.9% down on the previous year’s £77m. \nThe firm said the profit figure was offset by the group’s continuing investment in infrastructure, including property and further renewable energy generation. \nTony Cleary, managing director of the Lanchester group of companies, said: \nWhile other businesses are standing still, we’ve taken the conscious decision over the last 24 months to look closely at what we need in order to grow and invest inwardly. \nWhile this has directly affected our operating profits this financial year, it provides us with a sound platform to develop the business into the future. \nAnd, we’ve been incredibly forward thinking with our investments. \nWhere we’ve purchased property or land, we’ve invested significantly to ensure these facilities are improved upon to the highest standard. We’ve integrated leading-edge renewable energy technology to not only provide for our sites, but also create income streams for each property. Bottling facilities at Greencroft Bottling Share", "external_links": [], "published": "2016-11-17T15:20:00.000+02:00", "crawled": "2016-11-17T12:32:29.415+02:00", "highlightTitle": ""}