{"organizations": [], "uuid": "129701ca0fa5541392222c3f70e3a1ef785b5a98", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12059971.ece/ALTERNATES/s1200/JS102683203.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/north-east-mps-divided-over-12124464", "country": "GB", "domain_rank": 21960, "title": "North East MPs divided over historic High Court ruling on Brexit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "North East MPs divided over historic High Court ruling on Brexit", "spam_score": 0.0, "site_type": "news", "published": "2016-11-04T02:20:00.000+02:00", "replies_count": 0, "uuid": "129701ca0fa5541392222c3f70e3a1ef785b5a98"}, "author": "Dan O'Donoghue", "url": "http://www.chroniclelive.co.uk/news/north-east-news/north-east-mps-divided-over-12124464", "ord_in_thread": 0, "title": "North East MPs divided over historic High Court ruling on Brexit", "locations": [], "entities": {"persons": [{"name": "anne-marie trevelyan", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "dave anderson", "sentiment": "none"}, {"name": "jonathan arnott", "sentiment": "none"}, {"name": "christopher", "sentiment": "none"}, {"name": "catherine mckinnell", "sentiment": "none"}, {"name": "thomas", "sentiment": "none"}, {"name": "david davis", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}, {"name": "suzanne evans", "sentiment": "none"}, {"name": "jean-claude juncker", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "juncker", "sentiment": "none"}, {"name": "catherine mckinnell  newcastle north", "sentiment": "none"}, {"name": "daniel", "sentiment": "none"}, {"name": "blaydon", "sentiment": "none"}], "locations": [{"name": "brussels", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}], "organizations": [{"name": "high court", "sentiment": "negative"}, {"name": "brexit news north east mps", "sentiment": "negative"}, {"name": "parliament share a european union", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "berwick anne-marie trevelyan  conservative", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "house", "sentiment": "none"}, {"name": "european commission", "sentiment": "none"}, {"name": "supreme court", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News North East MPs divided over historic High Court ruling on Brexit The Government was dealt a blow as the High Court ruled the two-year Brexit process could not be triggered without the consent of Parliament Share A European Union flag in front of Big Ben (Photo: Daniel Leal-Olivas/PA Wire) Share Get daily   Thank you for subscribing!   \nThe North East has been divided once again over Europe - as the High Court ruled Parliament needed to consent before Brexit could move forward. \nThe historic ruling came on Thursday and the region’s MPs were quick to offer praise or damnation depending on their political persuasion. \nThe ruling, agreed unanimously by three judges, means that Prime Minister Theresa May does not have the power to bypass MPs and begin the two-year period of divorce negotiations with the 27 other countries in the EU bloc. \nThe Lord Chief Justice, Lord Thomas, said to do so would be contrary to “the fundamental constitutional principles of the sovereignty of Parliament”. \nThe court rejected the Government argument that prerogative powers were a legitimate way to give effect “to the will of the people” who voted by a clear majority to leave the European Union in the June referendum. Conservative MP for Berwick Anne-Marie Trevelyan \nConservative MP for Berwick-upon-Tweed Anne-Marie Trevelyan said that while she was disappointed she was confident Parliament would reflect the will of the people. \nShe said: “I am disappointed by the Court’s judgment. The country, and indeed the North East voted very clearly to leave the European Union in a referendum approved by Act of Parliament. The Government is determined to respect the result of the referendum and will appeal this judgment. Read More High Court rules Parliament must be consulted on Brexit \n“However, if the triggering of Article 50 does have to go to a vote in Parliament, I am confident colleagues from all sides of the House and indeed from all sides of the EU debate will vote to carry out the will of the country and their constituents.” \nBlaydon MP Dave Anderson took an opposing view however and said that Parliament had a duty in getting the best deal for the British people. \nHe said: “I think it is good news, people voted to bring sovereignty to Parliament not to the Government, so we should have a say, we will not stop Brexit happening but there is to be a debate. \n“We accept the policy but this is about the process, its about how we leave. I want to see the best possible deal for people that protects workers rights and human rights.” Catherine Mckinnell \nNewcastle North MP Catherine McKinnell also welcomed today’s decision, she said: “ by Regardless of how people voted in the referendum on leaving the European Union, it is vital that the Government is open and transparent with the British public – and their democratically elected representatives – about its negotiating stance on this critical issue.” \nJonathan Arnott, UKIP MEP for the North East, warned that his party would be taking many more seats if MPs stood in the way of Brexit. \nHe said: “Any MP who attempts to block Brexit will frustrate the will of the people. UKIP will be taking your seat from you at the next General Election.” \nThe pound rose sharply after the judgment, but the Government swiftly announced it is to appeal to the highest court in the land. \nIt is widely expected that 11 Supreme Court justices will sit before Christmas to hear one of the most important constitutional cases in generations. A European Union flag, with a hole cut in the middle (Photo: Christopher Furlong/Getty Images) \nBrexit Secretary David Davis, who defended the Government’s case in court, said ministers would be forced to produce a full Act of Parliament in order to trigger Article 50 unless the High Court ruling is overturned. \nMPs have suggested that Mrs May could call a snap general election next year to ensure she has enough supportive MPs to get her Brexit plan through the House of Commons. \nMrs May’s spokeswoman said it was still the Government’s plan to invoke Article 50 by the end of March. \nThe Prime Minister will, at her request, discuss the Brexit process with European Commission president Jean-Claude Juncker on Friday, Mr Juncker’s spokesman told reporters in Brussels. \nThe spokesman said all the other members of the EU would like to see a “swift” notification of Article 50 to begin the Brexit process. \nAfter the judgement on Thursday Brexiteers began calling for reform of the way judges are appointed. \nUkip leadership candidate Suzanne Evans condemned “activist judges” and suggested a mechanism should be created to allow them to be dismissed. Read More", "external_links": [], "published": "2016-11-04T02:20:00.000+02:00", "crawled": "2016-11-03T21:42:28.127+02:00", "highlightTitle": ""}