{"organizations": [], "uuid": "cf15c95aa48e22815b304b7756380407bf7f4dea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/29940969/15714409.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/former-one-man-band-now-bowling-over-qatari-royalty/story-29940969-detail/story.html", "country": "US", "domain_rank": 48128, "title": "Former one-man band now bowling over Qatari royalty | Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "Former one-man band now bowling over Qatari royalty | Leicester Mercury", "spam_score": 0.776, "site_type": "news", "published": "2016-11-30T13:00:00.000+02:00", "replies_count": 0, "uuid": "cf15c95aa48e22815b304b7756380407bf7f4dea"}, "author": "Leicester Mercury", "url": "http://www.leicestermercury.co.uk/former-one-man-band-now-bowling-over-qatari-royalty/story-29940969-detail/story.html", "ord_in_thread": 0, "title": "Former one-man band now bowling over Qatari royalty | Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "mick ven", "sentiment": "negative"}, {"name": "mick ventola", "sentiment": "none"}, {"name": "mick", "sentiment": "none"}, {"name": "anstey", "sentiment": "none"}, {"name": "ventola", "sentiment": "none"}, {"name": "al thani", "sentiment": "none"}], "locations": [{"name": "california", "sentiment": "none"}, {"name": "middle east raising", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "essex", "sentiment": "none"}, {"name": "doha", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "kuwait", "sentiment": "none"}, {"name": "oakham", "sentiment": "none"}, {"name": "holland", "sentiment": "none"}, {"name": "nevada", "sentiment": "none"}, {"name": "states", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}], "organizations": [{"name": "aida leisure", "sentiment": "none"}, {"name": "quaker meeting house", "sentiment": "none"}, {"name": "ventola projects", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Former one-man band now bowling over Qatari royalty X \nCopy link to paste in your message / Mick Ventola Raising their profile: Ventola's projects have included bowling alleys and royal palaces in the Middle East Raising their profile: Ventola's projects have included bowling alleys and royal palaces in the Middle East Comments (0) \nMick Ventola has been rushed off his feet lately, overseeing projects up and down the country and abroad. \nHis Anstey company Ventola Projects has had a busy 2016 and is now gearing up to win even more contracts in 2017. \nThe business is a specialist in electrical installations and LED lighting, in particular spot and effects lights and energy saving lights. \nIt also does shop fitting and building maintenance as well as metal and acrylic fabrication. \nThe past year has seen Mick and his team carry out a number of prestigious lighting projects, such as work on bowling alleys – an area it has built a reputation in – for Qatari royalty. \nRight now he is setting his sights on building the amount of work he does in the Middle East, breaking into the States and building contracts closer to home. \nVentola has 12 full and part time staff, supported by a big team of sub-contractors and distributors. \nOver the years it has developed its own VAvR light brand, with the lights it sells and fits put together in the UK. \nIt is also an authorised UK distributor for Dutch LED brand CLS, which is a growing part of turnover. \nEarlier this year, Aida Leisure, a facility at the royal palace of Sheikh Al Thani in Doha, brought Ventola Projects on board to design, manufacture and install lighting systems from its VAvR range – including inside a bowling alley. \nOn home turf, Ventola Projects has spent time in Essex working with a bowling facility called Rollerball, to transform one of its function rooms, again using the VAvR lights. \nVentola also took on the task of re-wiring and installing electrical fittings to one of Oakham's oldest buildings – the Friends Quaker Meeting House. \nMick said: \"It's not bad for a one-man band that started in 1989. \n\"There have been a hell of a lot of changes over the past year, and there's potentially lots more happening in the next 12 months. \n\"We have a distributor in the Middle East and we've just secured a job in Kuwait which has been on the back burner for 12 months. That's a large lighting project at a big leisure centre complex. \n\"We are being asked to look at more projects at the moment – if anything that's more for our professional opinion rather than our final products. \n\"For instance, the forthcoming projects in the Middle East – if they all come off – will probably be 60 per cent products and 40 per cent professional services. \n\"Elsewhere, we are rolling out products and services in the US this year, and really need to be able to put 100 per cent into it. \n\"So I've got the ball rolling and got some interest out there and we're doing due diligence with some people. \n\"That's something I'll really want to pursue next year. That would be 80 per cent product led, carried out by distributors under contract. \n\"The contacts I've got right now are in California, Texas and Nevada, which just seem to be more affluent markets and more in tune with the products and services we supply. \n\"At the same time we're marketing ourselves a hell of a lot more in the UK. \n\"In fact we've shrunk in size a little bit more this year as I've been putting a lot of my time into overseas markets and have become the face of the firm. \n\"This has been an investment year and turnover is probably £500-600,000. Hopefully next year we will hit the £1 million mark.\" \nHe said the recent drop in sterling also had the potential to be good for overseas deals. \n\"Brexit speeded up the Kuwait deal. I'm hoping to see that elsewhere because enquiries have gone up since the Brexit vote. \n\"It means we offer 10 per cent better value than we offered a year ago and I'm using that as my selling point to the guys in the US to try and sign them up sooner rather than later. \n\"Likewise with Holland, we've not actually seen a change because the Dutch lights are mainly for architectural design work, so it's mid to high end business – if an architect has put that into their designs the marketplace will still want the product.\" \nThe 48-year-old, who recently collected the best business prize at the 2016 English Italian Awards, is also a proud supporter of the Leicester Mercury Business Awards – sponsoring the small business category – and Leicester Mercury Sports Awards. \nHe said: \"This year will certainly be going down in Ventola history. I am extremely pleased with the progress we have made, and the phenomenal projects we have achieved. \n\"The Doha project is a great compliment to the business and has heightened our international reputation. My hopes are high that 2017 will even outdo 2016 as far as workload goes.\" ", "external_links": [], "published": "2016-11-30T13:00:00.000+02:00", "crawled": "2016-11-30T17:10:41.684+02:00", "highlightTitle": ""}