{"organizations": [], "uuid": "f12c4b008b5ccaaa852331f4baf59b65717f3fc0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12174301.ece/ALTERNATES/s1200/ECP_NEC_080514pwc_10JPG.jpg", "site_section": "http://www.thejournal.co.uk/business/?service=rss", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-economy-recovering-well-12174158", "country": "GB", "domain_rank": 21960, "title": "North East economy recovering well but problems await, surveys say", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "North East economy recovering well but problems await, surveys say", "spam_score": 0.0, "site_type": "news", "published": "2016-11-15T07:01:00.000+02:00", "replies_count": 0, "uuid": "f12c4b008b5ccaaa852331f4baf59b65717f3fc0"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-economy-recovering-well-12174158", "ord_in_thread": 0, "title": "North East economy recovering well but problems await, surveys say", "locations": [], "entities": {"persons": [{"name": "tyne", "sentiment": "none"}, {"name": "leigh taylor", "sentiment": "none"}, {"name": "bill macleod", "sentiment": "none"}, {"name": "bill macleod", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "tees valley", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "lloyds bank", "sentiment": "negative"}, {"name": "pwc", "sentiment": "none"}, {"name": "pwc", "sentiment": "none"}, {"name": "newcastle upon tyne share", "sentiment": "none"}, {"name": "yorkshire & humberside", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "pmi", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "lloyds bank commercial banking", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "North East economy recovering well but problems await, surveys say Surveys from PwC and Lloyds Bank highlight strong recent performance but warn of dangers for 2017 Share Bill Macleod, Senior Partner of PWC, Newcastle Upon Tyne Share Get business updates   \nSurveys of the North East business community have given cautious cause for optimism over the state of the regional economy - but raised concerns for the year ahead. \nA report from accountancy giants PwC found that the North East economic recovery has continued with GDP growth of 1.7% in 2016 and positive employment growth also predicted. \nThat report follows similar research from Lloyds Bank, which found that companies in the North East have reported the biggest increase in business activity in more than a year, though concerns have risen about growing costs. \nPwC’s report projects GDP growth in the region of around 1.7% in 2016, revised up slightly from the 1.3% projected in July, and though growth is expected to decelerate in all regions in 2017, the North East is not expected to into recession as the UK begins to feel the effects of the vote to leave the EU. \nThe report also forecasts the North East to have the third highest rise in employment next year, behind London and Yorkshire & Humberside. \nBill MacLeod, PwC’s Newcastle office senior partner, said: “A decline in business investment is likely to be the main reason for the slowdown in real GDP growth next year, driven in particular by uncertainty about the UK’s future trading relationships with the EU. But we expect Brexit to exert a long, slow drag on growth, rather than giving the economy a short, sharp shock. \n“Businesses should therefore not be complacent about the impacts of Brexit just because the initial effect has been less negative than some had expected. However, this also gives companies more time to adjust their strategies to mitigate the risks associated with leaving the EU, while also seizing the opportunities that exist in the world beyond Europe.” \nMeanwhile, the monthly PMI report from Lloyds Bank registered 53.8 in October, with a reading of above 50 signifying expansion in business activity. \nThe figure represents the strongest rate of expansion in 14 months, though the weakness of the pound resulted in a surge in costs for the region’s firms, with average input prices - including critical resources such as raw materials and labour – rising at the fastest rate in over five years. \nLeigh Taylor, regional director for the North East at Lloyds Bank Commercial Banking, said: “The North East economy continued to grow in October, overcoming any EU Referendum-related concerns. \n“The region was slightly off the pace seen elsewhere in the UK, but it is moving in the right direction. The strong increase in new work seen during the month should help firms to recover some of the ground lost in July, maintaining the local economy’s recent growth spell.” \nThe PMI is based on responses from manufacturers and services businesses about the volume of goods and services produced during October compared with a month earlier. The findings for the North East are based on a range of questions posed to businesses across Northumberland, County Durham, Tyne and Wear and the Tees Valley. Share", "external_links": [], "published": "2016-11-15T07:01:00.000+02:00", "crawled": "2016-11-15T02:15:07.933+02:00", "highlightTitle": ""}