{"organizations": [], "uuid": "1b5db151c42c975f191e1cef72bc4eb93131c2df", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12243398.ece/ALTERNATES/s1200/Ukip-leadership-contest.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/ukip-can-take-labour-north-12243268", "country": "GB", "domain_rank": 21960, "title": "UKIP can take on Labour in North East under new leader Paul Nuttall it is claimed", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "UKIP can take on Labour in North East under new leader Paul Nuttall it is claimed", "spam_score": 0.0, "site_type": "news", "published": "2016-11-29T00:18:00.000+02:00", "replies_count": 0, "uuid": "1b5db151c42c975f191e1cef72bc4eb93131c2df"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/ukip-can-take-labour-north-12243268", "ord_in_thread": 0, "title": "UKIP can take on Labour in North East under new leader Paul Nuttall it is claimed", "locations": [], "entities": {"persons": [{"name": "paul nuttall", "sentiment": "negative"}, {"name": "john rees-evans", "sentiment": "none"}, {"name": "nuttall", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "stefan rousseau/pa wire", "sentiment": "none"}, {"name": "farage", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "suzanne evans", "sentiment": "none"}, {"name": "stefan", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "mr nuttall", "sentiment": "none"}, {"name": "jonathan arnott", "sentiment": "none"}, {"name": "ms evans", "sentiment": "none"}, {"name": "nigel farage", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "usa", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}, {"name": "emmanuel centre", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "north east ukip", "sentiment": "none"}, {"name": "midlands", "sentiment": "none"}, {"name": "north-west england", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "westminster", "sentiment": "none"}], "organizations": [{"name": "ukip", "sentiment": "negative"}, {"name": "labour", "sentiment": "negative"}, {"name": "european parliament", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "UKIP can take on Labour in North East under new leader Paul Nuttall it is claimed UKIP can win but must avoid banging on about immigration, says UKIP's North East MEP Jonathan Arnott Share Paul Nuttall is announced as the new Ukip leader at the Emmanuel Centre in Westminster, London (Photo: Stefan Rousseau/PA Wire) Share Get daily   Thank you for subscribing!   \nUKIP can win seats in the North East under new leader Paul Nuttall as long as it remains united and doesn’t become obsessed with immigration, it is claimed. \nMr Nuttall has promised to “replace” Labour as the voice of the working class after being elected by a landslide as Nigel Farage’s successor. \nThe North-West England MEP took 62.6% of the vote, easily beating former deputy chairwoman Suzanne Evans on 19.3% and ex-soldier John Rees-Evans on 18.1%. \nAnd the result was welcomed by North East UKIP MEP Jonathan Arnott, who said the party could win Parliamentary seats in the region as long as the party remained united. \nBut he also warned that UKIP had to talk about a range of issues which concern local people, such as crime and increasing low pay, and avoid focusing too much on immigration. Paul Nuttall is announced as the new Ukip leader at the Emmanuel Centre in Westminster, London (Photo: Stefan Rousseau/PA Wire) \nHe said: “We have always felt we have a chance of winning some Parliamentary seats, as long as everyone who is saying they care about unity really mean it. \n“Our party has a lot of potential in the North East.” \nHe said he believed voters in the region would not be attracted to Labour while Jeremy Corbyn was the party’s leader. \n“Down to earth, working class people here aren’t where Jeremy Corbyn is.” \nBut he added: “We do need to broaden our base and ensure we are talking about the issues that matter to people, like crime and low wages, and not just European immigration.” \nMr Nuttall set his sights are on poaching votes from Labour, arguing that the party under Mr Corbyn was more interested in “dinner party” topics like climate change and fair trade than the interests of their working class voters, such as immigration and social mobility. \n“I want to replace the Labour Party and make UKIP the voice of patriotic Britain,” he said in a speech after being named the new leader at an event in Westminster. \n“UKIP’s future is bright, but for it to be so, UKIP must unite. Today’s result has ensured that it will.” Paul Nuttall (L) is congratulated by former UKIP leader Nigel Farage after being named as the new party leader \nMerseyside-born former history lecturer Mr Nuttall dismissed suggestions that the Eurosceptic party had fulfilled its mission in securing a Leave vote in June’s referendum on European Union membership. \n“The country needs a strong UKIP more now than ever before, for if UKIP ceases to be an electoral force, there will be no impetus on Theresa May and her Government to give us real Brexit and we will end up with some mealy-mouthed, backsliding version,” he said. \n“This will be a betrayal of the British people and a united UKIP under my leadership will never, ever allow that to happen.” \nMr Farage agreed that UKIP should push for support in the Midlands and North of England, where many pro-EU Labour MPs were at odds with their traditional supporters, more than half of whom voted for Brexit. \n“Old Labour voters have absolutely nowhere else to go other than to come to UKIP,” said the outgoing leader. \nMr Farage promised not to be “a back seat driver” but promised he would be available to offer support to the new leader if asked. \nHe said he would serve out his term in the European Parliament until 2019. \nBut more imminently, he was this week “going off to the USA - but, you will understand, purely as a tourist”. \nIn a move to restore unity after a summer of rifts, infighting and resignations, Mr Nuttall appointed figures from across the spectrum of UKIP factions to senior positions - and indicated he would be offering a role to defeated leadership rival Ms Evans. Like us on Facebook", "external_links": [], "published": "2016-11-29T00:18:00.000+02:00", "crawled": "2016-11-28T19:58:21.522+02:00", "highlightTitle": ""}