{"organizations": [], "uuid": "bffc0d31d6836bab6ae356228158b9bb0de935fc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12127261.ece/ALTERNATES/s1200/CFR_NJL_041116manu_01.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-bosses-richard-swart-12126975", "country": "GB", "domain_rank": 21960, "title": "North East bosses Richard Swart and Matt Boyle named in Top 100 league", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "North East bosses Richard Swart and Matt Boyle named in Top 100 league", "spam_score": 0.0, "site_type": "news", "published": "2016-11-04T19:48:00.000+02:00", "replies_count": 0, "uuid": "bffc0d31d6836bab6ae356228158b9bb0de935fc"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-bosses-richard-swart-12126975", "ord_in_thread": 0, "title": "North East bosses Richard Swart and Matt Boyle named in Top 100 league", "locations": [], "entities": {"persons": [{"name": "matt boyle", "sentiment": "negative"}, {"name": "ma", "sentiment": "negative"}, {"name": "richard swart", "sentiment": "negative"}, {"name": "boyle", "sentiment": "none"}, {"name": "berger", "sentiment": "none"}, {"name": "swart", "sentiment": "none"}, {"name": "matt", "sentiment": "none"}, {"name": "max roberts", "sentiment": "none"}, {"name": "richard", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "birmingham museum", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "great britain", "sentiment": "none"}, {"name": "art gallery", "sentiment": "none"}, {"name": "north east england", "sentiment": "none"}], "organizations": [{"name": "manufacturer", "sentiment": "none"}, {"name": "skills group", "sentiment": "none"}, {"name": "berger group europe", "sentiment": "none"}, {"name": "chamber of commerce", "sentiment": "none"}, {"name": "north east automotive alliance", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business North East bosses Richard Swart and Matt Boyle named in Top 100 league Richard Swart and Matt Boyle are now in the elite list of the Top 100 manufacturing leaders in the country Share Richard Swart and Matt Boyle with their Manufacturer’s Top 100 awards (Photo: Manufacturer’s Top 100)   \nInspiring company leaders from the North East are among the top 100 manufacturing leaders in the country after being nominated for awards by their industry peers. \nRichard Swart, global sales director and UK managing director of Berger Group Europe, which has a base in Durham , and Matt Boyle, who is president and CEO of Gateshead -based low carbon vehicle innovators Sevcon, have been named in The Manufacturer’s Top 100 report. \nSouth African-born Richard has supported the global export ambitions of hundreds of businesses and is a committed ambassador for his adopted North East. He is chairman of international trade with the North East England Chamber of Commerce and has been instrumental in improving the fortunes of German-owned stock-listed Berger. \nMatt Boyle joined Sevcon in 1996 as chief operating officer and was made CEO a year later. \nThe Gateshead company designs and manufactures high quality motor controllers and system components for all kinds of hybrid and electric vehicles with partners ranging from super car makers to fork lift truck, bus and electric motorcycle manufacturers. The company is also a founder member of the North East Automotive Alliance and Matt is chairman of its Skills Group. \nThe Manufacturer Top 100 report is published by The Manufacturer magazine every year and was set up two years ago to improve the image of manufacturing and provide a platform to publicly identify dynamic leaders and innovators in the industry. The awards were announced during a drinks reception at Birmingham Museum and Art Gallery. Read More Who are the most influential people in North East business in 2016? \nMr Swart said: “I’m delighted with the nomination, it means a great deal as it’s voted for by my peers and I’m in very good company. \n“The challenge for UK manufacturing and the country as a whole is immense given the pending Brexit negotiations and it is vital that businesses use whatever limited influence they may have to strive for the best possible outcome, ensuring also that Great Britain remains great, and the United Kingdom remains united.” \nMr Boyle said: “This award is testament to the efforts of the Sevcon team. We’re a business with a proud history of innovation and manufacturing excellence. \n“Our focus is fixed firmly on the future and the global electrification transition. We are at the forefront of this ongoing shift from the internal combustion engine to electric vehicles and our exciting future plans aim to ensure we maintain our market-leading position.” \nMax Roberts, vice president of salesforce and a TM Top 100 judge said: “The individuals showcased in The Manufacturer Top 100 are changing the face of British manufacturing and redefining the industrial landscape as we know it. \n“Their innovation is pioneering new ways of engagement, and together with these visionaries, we can provide the tools required to write our future. Share", "external_links": [], "published": "2016-11-04T19:48:00.000+02:00", "crawled": "2016-11-04T15:28:36.670+02:00", "highlightTitle": ""}