{"organizations": [], "uuid": "e539687c6994fdd9b4d9a2028b0d53001d475e99", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article11619331.ece/ALTERNATES/s1200/JS84641070.jpg", "site_section": "http://www.thejournal.co.uk/sport/?service=rss", "section_title": "nechronicle - Sport", "url": "http://www.chroniclelive.co.uk/sport/football/football-news/vito-mannone-costel-pantilimon-who-12164406", "country": "GB", "domain_rank": 21960, "title": "Vito Mannone or Jordan Pickford? Who should be Sunderland's first-choice goalkeeper?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Vito Mannone or Jordan Pickford? Who should be Sunderland's first-choice goalkeeper?", "spam_score": 0.0, "site_type": "news", "published": "2016-11-12T04:00:00.000+02:00", "replies_count": 0, "uuid": "e539687c6994fdd9b4d9a2028b0d53001d475e99"}, "author": "Stuart Rayner", "url": "http://www.chroniclelive.co.uk/sport/football/football-news/vito-mannone-costel-pantilimon-who-12164406", "ord_in_thread": 0, "title": "Vito Mannone or Jordan Pickford? Who should be Sunderland's first-choice goalkeeper?", "locations": [], "entities": {"persons": [{"name": "jordan pickford", "sentiment": "neutral"}, {"name": "vito mannone", "sentiment": "neutral"}, {"name": "jordan henderson", "sentiment": "none"}, {"name": "costel pantilimon", "sentiment": "none"}, {"name": "mika", "sentiment": "none"}, {"name": "sam allardyce", "sentiment": "none"}, {"name": "gareth southgate", "sentiment": "none"}, {"name": "mannone", "sentiment": "none"}, {"name": "ricardo alvarez", "sentiment": "none"}, {"name": "joe hart", "sentiment": "none"}, {"name": "pickford", "sentiment": "none"}, {"name": "david moyes", "sentiment": "none"}, {"name": "pantilimon", "sentiment": "none"}, {"name": "vito mannone  vito mannone", "sentiment": "none"}], "locations": [{"name": "wearside", "sentiment": "none"}, {"name": "notts county", "sentiment": "none"}, {"name": "slovenia", "sentiment": "none"}, {"name": "southampton", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "atalanta", "sentiment": "none"}, {"name": "mannone", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "jordan", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "manchester city", "sentiment": "none"}, {"name": "watford", "sentiment": "none"}, {"name": "birtley boxing gym  there", "sentiment": "none"}], "organizations": [{"name": "sunderland afc", "sentiment": "negative"}, {"name": "sunderland", "sentiment": "neutral"}, {"name": "hull city", "sentiment": "none"}, {"name": "black cats", "sentiment": "none"}, {"name": "mannone sunderland", "sentiment": "none"}, {"name": "pickford sunderland", "sentiment": "none"}, {"name": "inter milan", "sentiment": "none"}, {"name": "barnsley", "sentiment": "none"}, {"name": "arsenal", "sentiment": "none"}, {"name": "premier league", "sentiment": "none"}, {"name": "court of arbitration for sport", "sentiment": "none"}, {"name": "invalid email  sunderland", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Vito Mannone and Jordan Pickford in training last season (Photo: 2016 Sunderland AFC) Share Get Sunderland AFC updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nSunderland’s 2016 is drawing to a close with the same dilemma as 2015 ended with – who should be the club’s first-choice goalkeeper? \nLast year Vito Mannone emerged as the answer. \nThe suspicion, never confirmed, was that Mannone came out on top partly because of a clause in Costel Pantilimon’s contract which would have obliged Sunderland to make an extra payment to Manchester City if the Romanian played for them again. He was sold to Watford in January. \nRegardless of the reasons, the Italian completely justified the decision, putting in some excellent performances in the second half of the season to keep Sunderland in the Premier League. \nNow Mannone is on the prowl again. \nAugust’s fractured elbow cost him his place in the side but as soon as he returned to fitness a month or more ahead of schedule, playing 90 minutes in Wednesday’s Football League Trophy win over Notts County, he declared: “Now I’m back, I can push and hopefully get my place back and prove to the manager I am still No 1.” \nBefore he got injured, Mannone was the club’s undisputed first choice, but since Jordan Pickford has emerged as a goalkeeper of real quality – just as pretty much everyone at the club thought he would. \nSo who should be their first-choice goalkeeper? THE CASE FOR MANNONE Sunderland keeper Vito Mannone \nVito Mannone started the season as Sunderland’s first-choice goalkeeper, and has done nothing since to suggest he should not be. \nThe Italian was excellent for the Black Cats at times last season, pulling off some fantastic saves to keep his team in games. \nIn a youthful Sunderland team, Mannone is the elder statesman of the two goalkeepers, but at 28-years-old the former Atalanta, Arsenal, Barnsley and Hull City player is certainly not old. \nAs someone still learning the game, Pickford is perhaps more prone to the odd mistake than Mannone – the error he made at Southampton being a case in point. \nWhen he lost his place to Pantilimon, Mannone took a step back without complaint – he had no grounds to after the poor form which did for him – and got on with proving himself again. To lose out now might be harder to take, and could even prompt him to consider his Stadium of Light future. \nPerhaps the strongest argument for going with Mannone revolves around the failings of others, though. \nIf they are to avoid relegation once more, Sunderland need to strengthen their squad in January, but the funds to do so are likely to be hard to come by. The Black Cats, vocal supporters of financial fair play, are £140m in debt. On December 9, the Court of Arbitration for Sport could rule they owe Inter Milan millions of pounds over the transfer that never was, when Ricardo Alvarez was supposed to move to Wearside permanently after an unsuccessful season-long loan, but Sunderland argued he was not fit enough to do so. \nSelling Pickford might not be especially palatable, but with big English clubs having kept tabs on the 22-year-old, they could raise enough money to bring in three or four news players without losing too much in terms of quality between the sticks. Having signed Mika in September, they would not even have to bring in a back-up goalkeeper. THE CASE FOR PICKFORD Sunderland keeper Jordan Pickford at Birtley Boxing Gym \nThere is an argument to say that at this stage of their careers, there is not a massive amount to choose between Mannone and Pickford. Both are excellent shot-stoppers, though Pickford is better at distributing the ball and perhaps more commanding on crosses. \nWhatever your assessment of the pair now, there is little doubt the Washington-born man will be the better goalkeeper in time. \nPickford is the choice if the club want to move forward, Mannone if they want to hold on to what they have. \nThe direction Sunderland tried to go in when they replaced Sam Allardyce was to think long-term and look for stability. Sticking with the 22-year-old is in keeping with that way of thinking. \nThat was the logic behind David Moyes’ decision not to sign Joe Hart on loan when Mannone was injured. “I had to think of Jordan’s progression too and he hasn’t let us down,” said the Scot. That same argument would surely dictate that he stick with him now. \nPickford will not be at the Stadium of Light forever – there is every chance he will outgrow the place as Jordan Henderson did before him. Gareth Southgate, previously his England Under-21 manager, has already let the genie out of the lamp by calling Pickford up as injury cover for the senior squads to take on Slovenia, Scotland and Spain. \nEnglish players are a valuable commodity in the Premier League, and may become more so depending on how the work permit rules change post-Brexit. But homegrown players, products of your own academy who supported the club as a boy are priceless, and the Wearsiders would be well advised to hang onto theirs for as long as possible. \nHow long that is will probably depend on how much they can improve as he does. Vito Mannone of Sunderland in action \nYes, Sunderland could replace Mannone’s goalkeeping but they do not have anyone ready to step into his shoes as a homegrown mainstay of the side. \nSelling him now would also send out a terrible message about the club’s stomach for the relegation battle ahead. \nFor years now Sunderland have not brought through anything like as many players as they ought to. For Pickford to be a success does not just give supporters a fillip, it will stand as a beacon of hope to every promising youngster in the club’s academy. Drop him to the bench at the first opportunity, and it could tell them that if they want to be a success in football, they are best moving somewhere else. \nBesides, Pickford is actually more experienced than Mannone. When it comes to league starts, his numerous loan spells mean he has played 127 times to Mannone’s 106 (the Italian has come off the bench twice too). poll loading Who is Sunderland's No 1 goalkeeper? 0+ VOTES SO FAR", "external_links": [], "published": "2016-11-12T04:00:00.000+02:00", "crawled": "2016-11-11T23:32:02.392+02:00", "highlightTitle": ""}