{"organizations": [], "uuid": "2fadf4e04c9567f262e98185d4c5a84f69ee61f8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12166825.ece/ALTERNATES/s1200/JS97907905.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/common-factor-between-trumps-victory-12200874", "country": "GB", "domain_rank": 21960, "title": "The common factor between Trump's victory and the Brexit vote: Being intentionally inaccurate", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "The common factor between Trump's victory and the Brexit vote: Being intentionally inaccurate", "spam_score": 0.0, "site_type": "news", "published": "2016-11-19T20:19:00.000+02:00", "replies_count": 0, "uuid": "2fadf4e04c9567f262e98185d4c5a84f69ee61f8"}, "author": "Thom Brooks", "url": "http://www.chroniclelive.co.uk/news/north-east-news/common-factor-between-trumps-victory-12200874", "ord_in_thread": 0, "title": "The common factor between Trump's victory and the Brexit vote: Being intentionally inaccurate", "locations": [], "entities": {"persons": [{"name": "nigel farage", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "trump", "sentiment": "negative"}, {"name": "john mccain", "sentiment": "none"}, {"name": "clinton", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "thom brooks", "sentiment": "none"}, {"name": "bernie sanders", "sentiment": "none"}, {"name": "james comey", "sentiment": "none"}, {"name": "mitt romney", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "comey", "sentiment": "none"}, {"name": "sanders", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "vermont", "sentiment": "none"}], "organizations": [{"name": "fbi", "sentiment": "none"}, {"name": "republican party", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "isis", "sentiment": "none"}, {"name": "justice department", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "durham law school", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Opinion Donald Trump, right, invites ex-UKIP leader Nigel Farage to speak during a campaign rally (Photo: 2016 Getty Images) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nDonald Trump is the new President-elect of the United States. Almost no one saw it coming beyond the planet sized self-confidence of Trump himself. We all seemed to get it so wrong. Or did we? \nThe numbers seemed certain right up to the end. Slightly more than half of all US voters are women – and they really did not like Trump. To be fair, he gave plenty of reasons to dislike him including it seems a long litany of inappropriate, if not offensive, comments about women in particular and more generally for months. \nA sizeable, growing part of the population are African-Americans and Latinos. These groups disliked Trump even more than women did – and again Trump’s controversial statements did little to dent this. Not unlike most other pundits, I saw the longstanding lead of Hillary Clinton over Trump in light of significant chunks of the electorate like women and ethnic minorities with disapproval ratings of 65% or higher and believed it must be curtains for Trump campaign. We now know this didn’t happen. How could so many political experts get it so badly wrong? \nThere were certainly no shortage of twists and turns in what was surely the most negative campaign – by both sides – that I have witnessed at any time anywhere. Almost every day led to more eye rolling revelations of one kind or another from Clinton’s health or her emails to Trump’s remarks or lack of tax records. \nOne notable surprise was the decision by FBI Director James Comey to reopen a potentially-criminal investigation into Clinton’s use of emails after voting had started. This was as extraordinary as it sounds. Comey had been advised by the Justice Department to do no such thing. Clinton had been exonerated by the FBI only a few months ago. Comey’s public foray into the election campaign was so short lived – he changed his mind exonerating Clinton a second time within days – that it led many to believe it was politically motivated. Few will be surprised to learn in this most partisan of elections that, yes, Comey was a Republican Party activist until becoming independent before taking over at the FBI. Comey had campaigned for both John McCain and Mitt Romney to become President – some believe his re-opening the email case for a few days was his way of campaigning for a third Republican, Trump, to win but this time it worked. There is little doubt that this will attract close attention into whether it made any difference. The jury is still out on this for now. Read More Donald Trump presidency will not wreck planet, North East experts say \nIn my last column, I called it for Clinton but said while she had the numbers she lacked for inspiration. Her big sell to voters was that she was not Trump. This proved too poor a pitch and seemed to cost her what should have been an easy victory. So I was right, or at least about the real threat to the Clinton campaign that proved her undoing. \nClinton had trouble from the start. In a grueling primary struggle against Vermont Senator Bernie Sanders, Clinton failed to win over the youth vote or movement politics that Sanders embodies for the American left. Her success came from a better organization – none come more polished and targeted – and more trained boots on the ground. \nClinton likewise won the ground war against Trump with an army many times the size of his across all 50 states. She earned more from fundraising and outspent him on advertising. Yet still she lost because she had what she could buy, but too little what she had to earn – inspiration. Handout photo of Donald Trump and Nigel Farage \nWhen the dust settles, I would be unsurprised if it turned out the pollsters did not do that badly. They saw a close race with Clinton ahead, but in a margin of error meaning that Trump was in with a chance – however much few wanted to believe it would happen. It is true that there are ‘shy’ Trump supporters who probably told pollsters they supported a different candidate or were undecided because they wanted to hide their endorsement of this most unconventional of American presidential candidates. But I doubt it was statistically significant. \nWhat lost it for Clinton, and Remain during the Brexit vote, was the failure to motivate their side to vote. In a democracy, it’s not the majority that rules but the largest group that turns out to vote under the rules. If Clinton and Remain supporters are more numerous, but Trump and Brexit backers turn out in greater numbers at the polls then the latter win every time. The mystery is solved. Trump surprised the world because his supporters were more keen to see him win than Clinton’s team was to see him lose. Read More UKIP doesn't love Donald Trump as much as Nigel Farage says it North East MEP \nThere have been many parallels drawn to Brexit, but let me identify the one I think most accurate: being intentionally inaccurate. The Brexit campaign made three key pledges. First there would be £350m per week to the NHS. Now we know there will actually be cuts. Second there would be a points-based immigration system. Now we know that won’t happen. Third we were told Parliament would take back control. But now we see the Government trying to silence and bypass Parliament to trigger Brexit as it likes and when it wants clearly floating the UK’s constitutional arrangements so rightly pointed out by the High Court. Brexit was won on promises that won’t be delivered. \nLikewise, enter Trump. He claimed he ‘has a plan’ and ‘it’s foolproof’ to defeat Isis in his first term. When asked for what it is, he said he could not tell anyone because then the enemy would find out. Trump said he’ll make the economy double and make Mexico build a wall on America’s southern border while he restricts any Muslim from travelling to America. Don’t hold your breath for any of this to happen – it won’t. \nThe big problem with all of this is much more than any single election. When candidates for public office knowingly and avoidably mislead the public in order to win, they reduce a contest about the public good to a mere political game demeaning our common endeavor. \nThey damage the institutions they seek to represent and shape by providing false hopes that breed further mistrust in our public officials. I’m not half as disappointed with the immediate election results as I am with the damage the election conduct has done for results to follow. \nPolitics is about something bigger and greater than any one person’s ego or career plans. It must be more than about just wanting to teach a lesson, but to provide for a common future with prosperity. Those that see the trees but not the forest are not our heroes but pose a risk to all that we’ve built together for the wrong reasons. \nThe public deserves better – even in Trump’s America. \nThom Brooks is Head of Durham Law School and author of Becoming British \n(Biteback, 2016)", "external_links": [], "published": "2016-11-19T20:19:00.000+02:00", "crawled": "2016-11-19T16:07:58.920+02:00", "highlightTitle": ""}