{"organizations": [], "uuid": "66741fd66ac1bf2d5432137a232e594f2b5aa860", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12131477.ece/ALTERNATES/s1200/CFR_NJL_041116brexit_01JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/brexit-takes-170000-bite-out-12129618", "country": "GB", "domain_rank": 21960, "title": "Brexit takes £170,000 bite out of North East workwear business", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Brexit takes £170,000 bite out of North East workwear business", "spam_score": 0.0, "site_type": "news", "published": "2016-11-06T20:00:00.000+02:00", "replies_count": 0, "uuid": "66741fd66ac1bf2d5432137a232e594f2b5aa860"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/brexit-takes-170000-bite-out-12129618", "ord_in_thread": 0, "title": "Brexit takes £170,000 bite out of North East workwear business", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "negative"}, {"name": "ingham", "sentiment": "none"}, {"name": "alex ingham", "sentiment": "none"}, {"name": "lidl", "sentiment": "none"}, {"name": "barbour", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}], "organizations": [{"name": "business brexit", "sentiment": "negative"}, {"name": "aldi", "sentiment": "none"}, {"name": "m.i. supplies", "sentiment": "none"}, {"name": "sainsbury", "sentiment": "none"}, {"name": "royal mail", "sentiment": "none"}, {"name": "mi supplies", "sentiment": "none"}, {"name": "willows court on teesside industrial estate", "sentiment": "none"}, {"name": "mercedes", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Brexit takes £170,000 bite out of North East workwear business The boss of M.I. Supplies says the vote to leave the EU is affecting profits but that the business is strong enough to deal with the loss Share Alex Ingham of MI Supplies (Photo: MI Supplies) Share Get business   Thank you for subscribing!   \nThe director of a North East workwear manufacturer has revealed the Brexit vote has already impacted his business due to rising costs of imports. \nAlex Ingham, managing director of Thornaby-based M.I. Supplies, says the company will lose approximately £170,000 this year due through an increase in importing materials, as a direct result of the falling pound - a loss equating to around a tenth of the its costs base. \nHowever, Mr Ingham says he has already absorbed the price hikes so that he doesn’t pass it on to his customersmand that the company’s strong performance of recent years has put it in good shape to deal with the challenge. \nHe said: “Since the end of June and the Brexit vote, we’ve generally had price increases from virtually every supplier, averaging 9% to 10%, when normally it would be 2% to 3% every couple of years. \n“Every single day we get a letter or email from one of our main suppliers, advising their prices are going up due to Brexit. If there is no negotiation and we need to get our goods, then it does make it difficult. \n“They’re all putting it down to the weakness of the pound, and the majority of product that comes into us from abroad is bought in dollars or Euros, so I can see why it’s causing many firms a lot of problems. \n“I think it’s going to cause quite a lot of heartache in the UK over the next six months or so. Prices are going to keep on rising, and it’s going to make it quite challenging for a lot of companies. The 10% increase is a major deal – a lot of companies are barely making 10% profit on their sales as it is. \n“We haven’t passed anything on to our customers yet, and we’re trying not to. Instead, we’re looking for efficiencies in other areas – utilities, courier charges and anything that takes costs out of the business so we don’t have to pass it on to the customer.” Read More Plans to float stake in Sunderland firm have been abandoned because of Brexit \nM.I. Supplies has been supplying a wide range of workwear clothing and accessories for more than a decade after celebrating its 10th year in business in 2015. \nIt has a growing client base consisting of more than 250 business customers including the fire brigade, local councils, engineering firms and charities, while more than 26,000 customers have ordered supplies from the company’s website, and brands supplied by M.I. include Sainsbury’s, Barbour, Aldi, Lidl, Royal Mail and Mercedes. \nThe firm has enjoyed a 205% growth in the last five years and expects to achieve another record turnover this year, up to £2.5m from £2.25m in 2015. \nThe company, which moved from 3,000 sq ft units to a new 8,000 sq ft unit at Willows Court on Teesside Industrial Estate in February last year, recently signed a new three-year deal with European supermarket giant Aldi, worth more than £3m. \nMr Ingham said M.I. Supplies’ offer of giving clients a two-year fixed-price guarantee will affect his profits. \nHe said: “Whenever we take on a new customer, we guarantee to fix their prices for two years. \n“In fact, one major client has had 13 years of fixed prices from us, which is unheard of in our industry. We’ve taken a bit of a gamble on that over the years but we’re still in a strong position which enables us to do that.” Share", "external_links": [], "published": "2016-11-06T20:00:00.000+02:00", "crawled": "2016-11-06T15:14:52.834+02:00", "highlightTitle": ""}