{"organizations": [], "uuid": "f56cf76a5caf4e057afec2b33282daef2f862efc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12139518.ece/ALTERNATES/s1200/JS104349627.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/chronicle-us-five-things-you-12139514", "country": "GB", "domain_rank": 21960, "title": "Chronicle in the US: Five things you didn't know about the US Presidential election", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Chronicle in the US: Five things you didn't know about the US Presidential election", "spam_score": 0.0, "site_type": "news", "published": "2016-11-07T23:00:00.000+02:00", "replies_count": 0, "uuid": "f56cf76a5caf4e057afec2b33282daef2f862efc"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/chronicle-us-five-things-you-12139514", "ord_in_thread": 0, "title": "Chronicle in the US: Five things you didn't know about the US Presidential election", "locations": [], "entities": {"persons": [{"name": "hillary clinton", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "george bush", "sentiment": "none"}, {"name": "al gore", "sentiment": "none"}, {"name": "jesus", "sentiment": "none"}, {"name": "jonathan walker", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "pittsburgh international airport", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "virginia", "sentiment": "none"}, {"name": "philadelphia", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "pennsylvania", "sentiment": "none"}, {"name": "henrico", "sentiment": "none"}], "organizations": [{"name": "congress", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "imperial", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nChronicle Political Editor Jonathan Walker has spent the past two weeks in America covering the Presidential election . Here are five things he has learned that he didn’t know before. 1) The rules governing who is allowed to vote are extremely tough - and some people think they discriminate against minority groups. \nIn the state of Virginia, one in five African Americans of voting age are banned from voting. That’s because you can’t vote if you’ve ever committed a serious crime, known as a felony, unless the State’s Governor personally writes you a letter saying he’s restored voting rights. \nBut crimes classed as felonies include things some of us might regard as fairly offences, such as the simple possession of marijuana. 2) You don’t need to get the most votes to be elected President. Republican presidential candidate, Donald Trump concludes a plane-side rally in a hanger at Pittsburgh International Airport in Imperial, Pennsylvania \nBecause of the complex voting system, it’s possible to come a close second and actually get elected President . \nThis is what happened to George Bush when he became President in 2000. His opponent, Al Gore, actually got the most votes. 3) Americans aren’t just voting for a President. \nThey’re also voting for Senators and Representatives who will sit in Congress. This is the equivalent of our MPs who sit in Parliament. \nAnd in some places, they are also voting in local referendums where they are asked to give an opinion on a complex topic. For example, Virginia is having a referendum on whether the wives or husbands of emergency service personnel killed in the line of duty should be exempt from certain taxes. 4) You don’t necessarily need to vote for the candidates who are standing. Democratic presidential nominee Hillary Clinton in Philadelphia, Pennsylvania \nIn some states, the ballot paper has a space where you can write in the name of anyone you think should do the job - whether that’s being a local Senator or being President. Read More Chronicle in the US: Donald Trump promises supporters a 'Brexit Plus' victory \nThe Registrar in the County of Henrico, Virginia - the person responsible for overseeing elections - told me that voters sometimes write in “Jesus” as their preferred candidate. He once had to make a ruling as to whether Jesus could indeed be elected, but decided that as he was disqualified because he wasn’t registered to vote in the county. 5) Although election day is Tuesday November 8, voting has already begun. \nAmerica has postal voting like the UK, but in many places it also opens up polling stations days early. \nThere is a tradition in some parts of the African American community of voting on Sunday, after church. They call it “souls to the polls”. Share", "external_links": [], "published": "2016-11-07T23:00:00.000+02:00", "crawled": "2016-11-07T18:32:47.143+02:00", "highlightTitle": ""}