{"organizations": [], "uuid": "26fa04000b8ec2de1ad42db2c176ee3ba1065ece", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12225548.ece/ALTERNATES/s1200/Brexit.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/could-nigel-farage-heading-new-12225370", "country": "GB", "domain_rank": 21960, "title": "Could Nigel Farage be heading for a new life in Washington?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Could Nigel Farage be heading for a new life in Washington?", "spam_score": 0.0, "site_type": "news", "published": "2016-11-26T18:00:00.000+02:00", "replies_count": 0, "uuid": "26fa04000b8ec2de1ad42db2c176ee3ba1065ece"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/could-nigel-farage-heading-new-12225370", "ord_in_thread": 0, "title": "Could Nigel Farage be heading for a new life in Washington?", "locations": [], "entities": {"persons": [{"name": "nigel farage", "sentiment": "neutral"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "kim darroch", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "farage", "sentiment": "none"}, {"name": "arnott", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "mr farage", "sentiment": "none"}, {"name": "nigel", "sentiment": "none"}, {"name": "jonathan arnott", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "kent", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "downe", "sentiment": "none"}, {"name": "trump tower", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "great britain", "sentiment": "none"}], "organizations": [{"name": "ukip", "sentiment": "neutral"}, {"name": "european union", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "house of lords", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Could Nigel Farage be heading for a new life in Washington? The outgoing UKIP leader has more to offer, but will it be in the House of Lords or in the US? Share Nigel Farage (Photo: Yui Mok/PA Wire) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nNigel Farage could still make a major contribution to British politics - as a member of the House of Lords, according to a UKIP MEP. \nNorth East MEP Jonathan Arnott said it was about time UKIP was offered the opportunity to appoint members to the House of Lords. \nBut he also said it remained to be seen if Mr Farage would accept a place if it was offered to him. \nBecause there are reports that the UKIP leader could abandon the UK entirely, in favour of a new life in the United States. \nMr Farage is due finally to stand down as head of UKIP once the party selects a new leader on Monday November 28. \nBut he seems keen to continue playing a role in politics, despite achieving his goal of winning a referendum to get the UK out of the European Union. \nHe has offered his services as a go-between to US President Donald Trump, his friend and political ally. \nMr Farage wrote a website article insisting: “I have known several of the Trump team for years and I am in a good position with the president-elect’s support to help.” \nMr Arnott said that UKIP should be offered the chance to nominate people for peerages, just like other parties. \nHe said: “Somebody who has done as much as he has in politics, whatever political party they’re in, people who have that type of track record would tend to get a peerage.” \nHe added: “The question here is why has UKIP not been offered any peerages? Given that we got nearly 13 per cent of the vote at the last general election, that should be represented in the House of Lords as other parties are. \n“It’s strange that the Lib Dems got 8% and have hundreds of peers, while we have never been offered a single peer.” Read More \nThere have been UKIP peers, but these are politicians who were already in the Lords and defected to UKIP from other parties. \nThe standard procedure in Parliament is that parties are allowed to nominate who they wish. \nBut Mr Arnott said: “If UKIP were offered peerages, I’m sure Nigel would be top of the list - if he actually wanted it.” \nMr Farage offered to help build relations between the UK and Mr Trump after the President-elect, who takes over in the White House next year, tweeted: “Many people would like to see Nigel Farage represent Great Britain as their ambassador to the United States. He would do a great job!” \nNumber 10 rejected the idea, and Prime Minister Theresa May’s spokesman said there was “no vacancy” because the current person in the job, Sir Kim Darroch, was “an excellent ambassador”. \nBut there’s no doubt that Mr Farage’s connections with Mr Trump are strong. Read More Nigel Farage says Northern voters won EU referendum for Leave \nHe advised the businessman during the presidential campaign - and Mr Trump repeatedly compared his bid for the White House to the successful Brexit campaign in June’s referendum. \nOnce the votes were counted and Mr Trump beat Democrat challenger Hillary Clinton, Mr Farage was the first UK politician to congratulate him in person. \nThe pair met in New York and posed for a photograph outside a golden door at Trump Tower in New York, a 68-storey luxury building. \nBut even if he doesn’t end up working with the new President in some form, Mr Farage may be keen to quit the UK. \nHe’s said to find life at home difficult, and now rarely goes out in public with his family after thugs chased his wife and daughters out of the Queen’s Head pub in Downe, Kent, where Mr Farage and his family were having Sunday lunch. Like us on Facebook", "external_links": [], "published": "2016-11-26T18:00:00.000+02:00", "crawled": "2016-11-26T13:19:39.822+02:00", "highlightTitle": ""}