{"organizations": [], "uuid": "05db9f4d024cbb1e2964e50676987ed4c1e37b02", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article6925332.ece/ALTERNATES/s1200/JS31774355.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/newcastle-should-first-city-tell-12150554", "country": "GB", "domain_rank": 21960, "title": "Newcastle should be the first city to tell Donald Trump 'he's not welcome' councillor claims", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Newcastle should be the first city to tell Donald Trump 'he's not welcome' councillor claims", "spam_score": 0.0, "site_type": "news", "published": "2016-11-09T20:00:00.000+02:00", "replies_count": 0, "uuid": "05db9f4d024cbb1e2964e50676987ed4c1e37b02"}, "author": "Hannah Graham", "url": "http://www.chroniclelive.co.uk/news/north-east-news/newcastle-should-first-city-tell-12150554", "ord_in_thread": 0, "title": "Newcastle should be the first city to tell Donald Trump 'he's not welcome' councillor claims", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "negative"}, {"name": "dipu ahad", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "reince priebus", "sentiment": "none"}, {"name": "elswick", "sentiment": "none"}, {"name": "pu ahad", "sentiment": "none"}, {"name": "coun ahad", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "usa", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "new york hilton midtown", "sentiment": "none"}, {"name": "islamaphobia", "sentiment": "none"}], "organizations": [{"name": "news newcastle", "sentiment": "negative"}, {"name": "newcastle", "sentiment": "negative"}, {"name": "republican", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "republican national committee", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Newcastle should be the first city to tell Donald Trump 'he's not welcome' councillor claims Dipu Ahad, of Elswick, is standing by his claim that the new President of the USA should not be allowed to visit the city Share Click to play Tap to play The video will start in 8 Cancel Play now Donald Trump's acceptance speech in full after historic win Share this video Get daily     \n“You’re not welcome,” is the message an outspoken councilllor is sending to Donald Trump . \nLast year Elswick councillor Dipu Ahad urged the city to “ban” Republican candidate Donald Trump from visiting because of his extreme views on minorities, women and immigrants. \nNow, waking up to the news of Trump’s shock victory, Coun Ahad says he still believes the city should take a stand against the right-wing president. \nHe said: “When I said he should be banned from the city, there was a bit of a backlash, and I do think in a democracy we probably don’t have the power to actually ban someone like him, but we should come out and say, he isn’t welcome. \n“Remember who this guy is: forget about the Islamaphobia, forget about the racism, forget what he’s said about immigrants and Mexicans, just think about how he talks about women. \n“Think about how he belittles women, some of his ongoing cases against women. \n“As a city, we should be making a statement. He may be president of the United States, but he shouldn’t be welcome here.” Republican president-elect Donald Trump and Reince Priebus, chairman of the Republican National Committee, embrace during his election night event at the New York Hilton Midtown in the early morning hours \nCoun Ahad believes Newcastle should become the first of many cities to publicly take a stand against the new US leader. \nMr Trump caused outcry across the world with a string of outlandish statements. \nEarlier in the year he called for “a total and complete shutdown of Muslims entering the United States”. Read More US Election 2016 LIVE: Donald Trump is elected president of the United States \nHe said he wanted to build a physical wall between Mexico and America to slow immigration. He has been hit with allegations of sexual assault from more than a dozen women, which he denies, and he has threatened to sue the complainants once the election is over. \nCoun Ahad said: “If Newcastle says that, no, you’re not welcome in our city, I think others will say it too. \n“Just because America has chosen you as president, that doesn’t mean the rest of the Western world has to follow and support you.” \nAnd the councillor fears that the Republican victory could lead to a surge far-right politics across the world. \nHe said: “We’re living in a sad world where bigotry has become normal. \n“The sort of thing Trump says, it’s not freedom of speech, it is an expression of hatred, and the far-right are going to love that he’s won. \n“It will give bigots a ticket — just as they did after the Brexit vote, many will feel they have the right to make verbal and physical assaults on minority groups.” Read More", "external_links": [], "published": "2016-11-09T20:00:00.000+02:00", "crawled": "2016-11-09T15:29:03.385+02:00", "highlightTitle": ""}