{"organizations": [], "uuid": "9a8fc46a1a11646a67da0fe9bf8c2eb1cf0d5f0c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12089615.ece/ALTERNATES/s1200/JS103145051.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-opinion/goverments-deal-nissan-great-lets-12124061", "country": "GB", "domain_rank": 21960, "title": "The Goverment's deal with Nissan is great, but let's find out what it means", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "The Goverment's deal with Nissan is great, but let's find out what it means", "spam_score": 0.0, "site_type": "news", "published": "2016-11-04T01:00:00.000+02:00", "replies_count": 0, "uuid": "9a8fc46a1a11646a67da0fe9bf8c2eb1cf0d5f0c"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-opinion/goverments-deal-nissan-great-lets-12124061", "ord_in_thread": 0, "title": "The Goverment's deal with Nissan is great, but let's find out what it means", "locations": [], "entities": {"persons": [{"name": "kenichi ohmae", "sentiment": "none"}, {"name": "graeme whitfield", "sentiment": "none"}, {"name": "greg clark", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "kevan jones", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "nissan", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "nissan share work", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Opinion The Goverment's deal with Nissan is great, but let's find out what it means Journal business editor Graeme Whitfield on why it is right that people keep asking questions on the Government's deal with Nissan Share Work begins on a new production line at Nissan Share Get   \nWhen you are very big and very successful – and I say this despite being neither – people tend to watch what you do very closely. \nGiven the choice, I dare say Nissan would probably prefer to get on with making cars and creating jobs in the North East, both of which it is rather good at. \nBut being very big and very successful, people are interested in everything Nissan does and its decision to produce two new models at Sunderland is inevitably being placed under the microscope. \nThere has been much discussion about what the Government did to ease Nissan’s concerns about the UK leaving the EU , and now there a backlash again that discussion which goes something along the lines of: “Why can’t we just be happy?” \nWhile I understand that frustration, and that it must be vexing for Nissan to be dragged into political discussions with every decision it makes, the notion that we should just celebrate the Nissan announcement and not ask what it means for the rest of the economy is surely nitwitted. \nKenichi Ohmae, who helped bring Nissan to Sunderland in the 1980s, is probably overstating matters when he describes last week’s announcement as a “very very minor one-company decision.” \nBut it is certainly right that Nissan is just one company, and that hundreds of other firms will want to know what help they might also get to ease Brexit-related concerns concerns. \nIf the Government has decided to make Nissan a special case, and said it will do whatever it takes to keep its well-paying, highly-skilled jobs in a deprived part of the country, I would applaud that. \nBut Ministers needs to be honest about what promises they have made to Nissan because other employers in similar situations will want the same treatment. Again, I would not oppose that, but we need to know the sort of bill the country is racking up. \nThe danger is that it will be big businesses like Nissan - those who can get a meeting with Theresa May and clear Business Secretary Greg Clark’s diary - that get Government support while smaller firms are left to suffer the very problems Nissan has highlighted. \nI have not heard a single person ask the Government for more information on its Nissan talks without first welcoming the firm’s commitment to the North East. It’s possible to do both. (As Durham MP Kevan Jones said: “If you have done a special deal for Nissan, good. I just look forward to many more for North East companies who rely on exports.”) \nA bit more detail on the Nissan deal Would also dispel any doubts that the Government might not entirely have a plan for Brexit and is making it up as it goes along. \nGraeme Whitfield is business editor of The Journal Read More", "external_links": [], "published": "2016-11-04T01:00:00.000+02:00", "crawled": "2016-11-03T20:32:23.960+02:00", "highlightTitle": ""}