{"organizations": [], "uuid": "e38833791957459fbe9ae4cfb889a3fa3bb731ba", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12126614.ece/ALTERNATES/s1200/JS104129548.jpg", "site_section": "", "section_title": "", "url": "http://www.chroniclelive.co.uk/news/north-east-news/brexit-legal-challenge-mean-stay-12126599", "country": "IE", "domain_rank": 21960, "title": "Does Brexit legal challenge mean we stay in the EU and will there be an early general election? - Chronicle Live", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 0, "title_full": "Does Brexit legal challenge mean we stay in the EU and will there be an early general election? - Chronicle Live", "spam_score": 0.119, "site_type": "news", "published": "2016-11-04T18:51:00.000+02:00", "replies_count": 0, "uuid": "e38833791957459fbe9ae4cfb889a3fa3bb731ba"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/brexit-legal-challenge-mean-stay-12126599", "ord_in_thread": 0, "title": "Does Brexit legal challenge mean we stay in the EU and will there be an early general election? - Chronicle Live", "locations": [], "entities": {"persons": [{"name": "john walton/pa wire", "sentiment": "none"}, {"name": "winston churchill", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "ben birchall/pa wire", "sentiment": "none"}, {"name": "gina miller", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "frankfurt", "sentiment": "none"}], "organizations": [{"name": "scm private llp", "sentiment": "none"}, {"name": "european central bank", "sentiment": "none"}, {"name": "snp", "sentiment": "none"}, {"name": "daily express", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "high court", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Does Brexit legal challenge mean we stay in the EU and will there be an early general election? We explain what happens now after the High Court ruling that means Brexit goes to parliament before Article 50 can be triggered Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nDoes the UK faces its gravest crisis since the dark days when Winston Churchill vowed we would fight them on the beaches as the Daily Express would suggest, or is the just the end of the beginning of the Brexit phoney war? \nWe answer your questions on what the decision by the High Court that the Government does not have the power to trigger Article 50 for this country to leave the European Union without consulting parliament means to you. So, exactly what has happened? Founding partner of SCM Private LLP Gina Miller speaks after the High Court decides that the Prime Minister cannot trigger Brexit without the approval of the MP's (Photo: Dan Kitwood/Getty Images) \nBusinesswoman and philanthropist Gina Miller launched a legal challenge to the Prime Minister’s power to trigger Article 50, the clause that formally begins Brexit. The High Court decided in her favour and that the UK can’t leave the EU without consulting parliament. \nWhy are so many people getting hot under the collar about what seems to be Government being asked to govern? \nPrime Minister Theresa May’ s position was the decision to leave the EU was taken by the public in the referendum and that its executive powers, under the royal prerogative, were enough to give notice to the EU on behalf of the cabinet. So did the right wing Brexit favouring press who are characterising the High Court decision as yet another attempt by the Liberal Metropolitan elite to undermine the voice of the people. Will the Government appeal? \nMore than likely but some are counselling not to as the court’s ruling was so comprehensively in favour of parliament and against invoking Article 50 using prerogative powers and see an appeal as just delaying the inevitable. However the hysterical reaction of the right wing press will more than likely force Mrs May’s hand. Does it mean there will be no Brexit? The European Central Bank in Frankfurt, Germany (Photo: John Walton/PA Wire) \nNo, it’s impossible to see how there will be no Brexit as that was the decision of the EU referendum. It just might put the Government’s March timetable of triggering Article 50 back, which some say isn’t such a bad thing. If the High Court ruling stands, how will things proceed in parliament? \nThat’s an interesting one. An option is a straight ‘yes’ or ‘no’ vote, a sort of parliamentary referendum. However if the Government goes down that road it would leave it open to another possible legal action. Why is that? \nThe people who brought the case argued that it would be constitutionally impossible to change the law of Britain - which leaving the EU would - without an act of parliament. The alternative is? Prime Minister Theresa May (Photo: Ben Birchall/PA Wire) \nThe judges appeared to suggest legislation was needed which means a whole new bill going through the House of Commons and Lords stage by stage, which will take time. Does it make an early general election more likely? \nIt does, as ‘sources close to Mrs May’ have been quoted as saying they would not have their hands tied by opposition attempts to amend the legislation. \nHowever it would take a two-thirds majority in the Commons to trigger an early election under the Fixed Term Parliaments Act. As such the vote would need the backing of either Labour or the SNP to get through. It will inevitably become the ‘Brexit election’ and with many Labour MPs, a number in the North East, having seen the majority of their constituents vote Leave, they might be less than keen for an election. Read More ", "external_links": [], "published": "2016-11-04T18:51:00.000+02:00", "crawled": "2016-11-04T13:57:55.616+02:00", "highlightTitle": ""}