{"organizations": [], "uuid": "1663a520785a9f2557ee25a6c555f8d514467288", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12214864.ece/ALTERNATES/s1200/Chancellor-of-the-Exchequers-Autumn-Statement.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/tenant-tax-would-been-costly-12214811", "country": "GB", "domain_rank": 21960, "title": "'Tenant tax' which would have been costly for 11,000 North East families is scrapped by Government", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "'Tenant tax' which would have been costly for 11,000 North East families is scrapped by Government", "spam_score": 0.0, "site_type": "news", "published": "2016-11-23T01:00:00.000+02:00", "replies_count": 0, "uuid": "1663a520785a9f2557ee25a6c555f8d514467288"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/tenant-tax-would-been-costly-12214811", "ord_in_thread": 0, "title": "'Tenant tax' which would have been costly for 11,000 North East families is scrapped by Government", "locations": [], "entities": {"persons": [{"name": "lord beecham", "sentiment": "none"}, {"name": "gavin barwell", "sentiment": "none"}, {"name": "barwell", "sentiment": "none"}, {"name": "philip hammond", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "george osborne", "sentiment": "none"}, {"name": "osborne", "sentiment": "none"}, {"name": "hammond", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "none"}, {"name": "universal credit", "sentiment": "none"}, {"name": "newcastle city council", "sentiment": "none"}, {"name": "local government association", "sentiment": "none"}, {"name": "labour shadow housing", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "children’s society", "sentiment": "none"}, {"name": "house of lords", "sentiment": "none"}, {"name": "local government", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "'Tenant tax' which would have been costly for 11,000 North East families is scrapped by Government Prime Minister Theresa May scraps policies which would have cost working families thousands of pounds Share Chancellor of the Exchequer Philip Hammond (Photo: Stefan Rousseau/PA Wire) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nPlans to impose rent hikes on more than 11,000 North East households have been axed in a Government u-turn. \nAnd in a second apparent u-turn, Ministers were reported to be planning to water down cuts in benefits. \nIt comes as Chancellor Philip Hammond prepares to deliver his first Autumn Statement to the Commons, one of the two major financial statements produced by the Government each year. \nPrime Minister Theresa May has called for the statement to include measures to help people who are “just about managing”, and the Government appears to be going back on some of the measures announced by previous Chancellor George Osborne which would hit this group. \nHowever, a series of other changes are still to go ahead. \nThese include freezing working tax credits, which campaigners say will mean incomes are cut for some working families, and introducing fixed term tenancies for council housing, which could result in people being evicted from their council house if they receive a pay rise. \nHousing Minister Gavin Barwell has announced the Department for Communities and Local Government is scrapping plans to force councils to introduce an income-based rents policy - which is known as a “tenant tax” by Labour and other opponents of the scheme. \nIt would have forced councils to put up rents for tenants in council homes where the total family income is £30,000. They would have been told to pay the full market rent for the property, and experts say this will would mean up to £3,000 extra a year. \nResearch by the Local Government Association found that 11,227 households in the North East are set to be affected by the policy when it comes into effect in April next year, leaving them with a choice between paying higher rents or exercising the right to buy their home. \nBut Mr Barwell admitted the policy was flawed, in a statement to the Commons. \nHe said: “The Government remains committed to delivering its objective of ensuring social housing is occupied by those who need it most. But we need to do so in a way that supports those ordinary working class families who can struggle to get by, and in a way which delivers real savings to the taxpayer. The policy as previously envisaged did not meet those aims.” \nAnd he promised: “For most existing tenants, social housing represents a home for life at a rent well below market levels. The Government remains committed to ensuring it goes to those who need it most.” \nHowever, he said the Government was pressing ahead with plans to force councils to put new tenants on fixed-term contracts. It means local authorities will “review tenancies at the end of each fixed term to ensure that tenants still need a socially rented home.” Read More 'Keep your promise to the North East' - MP's message to Government ahead of Autumn Statement \nIn practice, it means people whose income has increased could find they are kicked out. And while councils will no longer be forced to increase rents, they will still have this option. \nAt the same time, Mr Hammond is set to soften the blow of cuts to Universal Credit, according to reports. \nUp to three million people were set to lose around £1,000 a year because of cuts announced by Mr Osborne to the work allowance element of Universal Credit - which replaces a range of old benefits including tax credits. \nBut ministers also fear that working people on lower wages are set to suffer as a result of rising inflation, caused partly by the pound falling in value after the Brexit vote. \nIt means that their incomes may fall anyway, as wages are expected to rise more slowly than inflation. Read More \nMr Hammond will announce changes to the “taper rate”, which determines how much people can earn before they lose benefits, according to reports. \nHowever, other cuts could still affect thousands of households. \nAnd analysis from campaigning charity the Children’s Society shows that 118,000 working families in the North East live in households affected by the government’s decision to freeze benefits, including tax credits paid to working people on lower incomes. \nThis was introduced in April and is due to last four years. It means the impact will grow over time because of inflation. \nWhile the impact is different for everyone depending on their circumstances, the charity estimates that a working mum with a salary of £22,000 and two children, renting a home, could be worse off by £239 per month. \nLabour Shadow Housing Minister Lord Beecham, a former leader of Newcastle City Council , led opposition to the “tenant tax” in the House of Lords. \nHe said: “I’m glad that they’ve belatedly listened to the opposition to this move. \n“I hope they take a similar attitude to other things. \n“And in particular, the fact that councils will be forced to offer fixed-term tenancies now.” Like us on Facebook", "external_links": [], "published": "2016-11-23T01:00:00.000+02:00", "crawled": "2016-11-22T20:34:52.560+02:00", "highlightTitle": ""}