{"organizations": [], "uuid": "bb620f3aecf3afbac604a3a68df36c0727a4f47b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article11086082.ece/ALTERNATES/s1200/QuantuMDx.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/newcastle-tech-firm-aims-save-12142328", "country": "GB", "domain_rank": 21960, "title": "Newcastle tech firm aims to save lives in India as it joins Prime Minister's trade visit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Newcastle tech firm aims to save lives in India as it joins Prime Minister's trade visit", "spam_score": 0.0, "site_type": "news", "published": "2016-11-08T03:12:00.000+02:00", "replies_count": 0, "uuid": "bb620f3aecf3afbac604a3a68df36c0727a4f47b"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/newcastle-tech-firm-aims-save-12142328", "ord_in_thread": 0, "title": "Newcastle tech firm aims to save lives in India as it joins Prime Minister's trade visit", "locations": [], "entities": {"persons": [{"name": "qu", "sentiment": "negative"}, {"name": "mrs may", "sentiment": "none"}, {"name": "warburton", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "modi", "sentiment": "none"}, {"name": "elaine warburton", "sentiment": "none"}, {"name": "narendra modi", "sentiment": "none"}], "locations": [{"name": "india", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "hyderabad house", "sentiment": "none"}, {"name": "usa", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "new delhi", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "business newcastle", "sentiment": "negative"}, {"name": "invalid email", "sentiment": "none"}, {"name": "the world health organisation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Newcastle tech firm aims to save lives in India as it joins Prime Minister's trade visit QuantumDX has produced a handheld device for diagnosing diseases like TB, which is a huge problem in India Share Elaine Warburton from QuantuMDx with the Q-Poc diagnostic tool developed by QuantuMDx (Photo: PR Agency) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nA North East technology firm is hoping to transform lives in India after joining Prime Minister Theresa May on a trade mission to the country. \nElaine Warburton, from Newcastle medical devices firm QuantumDX, was selected to join the mission where Mrs May is aiming to boost British trade in new markets as the UK readies itself for Brexit. \nQuantumDX makes handheld devices that can diagnose diseases in the developing world, with its Q-Poc device being hotly-tipped as an important weapon in the fight against malaria, tuberculosis and sexually transmitted diseases. \nMs Warburton said she hoped the trip would open new relationships with health ministries, hospitals and both public and private laboratories in India, where it is carrying out small-scale trials with a genotyping device. \nThe trip is QuantumDX’s third overseas trade mission, following trips to USA and Japan, but the first accompanying a Prime Minister. \nMs Warburton said: “QuantuMDx has grown from a team of three entrepreneurs working out of a makeshift garage lab to a life sciences company with over 70 staff that is now recognised for its innovations on the global stage. \n“The environment provided by the North East has undoubtly contributed to our success, providing the perfect mix of industry, universities, and scientific facilities to help catalyse our growth. Looking to the future, we are excited to be partnered with a number of high-profile organisations enabling us to ramp-up the development of our world-changing handheld diagnostic device Q-POC. \n“The World Health Organisation has identified India as the country with the highest burden of tuberculosis, for this reason it is an incredibly important market for us. In 2013, India accounted for 1m of the 3m TB cases missed by healthcare systems globally. British Prime Minister Theresa May and her Indian counterpart, Narendra Modi, meet at Hyderabad House, the Indian Prime Minister's offices \n“Part of the problem is that roughly 67% of India’s population lives in rural areas, where healthcare facilities are difficult to access or simply non-existent. Our handheld diagnostic device Q-POC is battery-powered and portable, bringing the power of precision medicine to health professionals even in the most remote areas – ultimately helping to tackle the huge TB burden India is currently experiencing.” \nElsewhere on the trade mission, Theresa May offered a deal with India which could see more visas for the country’s nationals to come to the UK in return for an increase in the number of illegal migrants sent back. \nThe Prime Minister’s offer came during extended discussions with Indian counterpart Narendra Modi, who has been putting pressure on Mrs May to open the door for more Indian students and skilled workers. \nFollowing talks between the two leaders at Hyderabad House in New Delhi, Mrs May made clear that any further liberalisation of the visa regime must be linked to Indian readiness to take back nationals who overstay their permission to remain in Britain. \nAs part of a new “strategic dialogue” on home affairs issues, the UK “will consider further improvements to our visa offer if at the same time we can step up the speed and volume of returns of Indians with no right to remain in the UK”, said Mrs May. \n“And the UK will continue to welcome the brightest and best Indian students, with the latest figures showing that nine out of 10 applications are granted.” \nUK officials were delighted that Mr Modi granted Mrs May an unusually lengthy 90-minute one-on-one private discussion in talks which formed the centrepiece of her three-day trade mission to the country. Share", "external_links": [], "published": "2016-11-08T03:12:00.000+02:00", "crawled": "2016-11-07T22:39:14.045+02:00", "highlightTitle": ""}