{"organizations": [], "uuid": "71f255018ff52555d7516e49c121d3f87b22150f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12225256.ece/ALTERNATES/s1200/CFR_NJL_241116gradon_01.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/gradon-architectures-grand-designs-london-12224922", "country": "GB", "domain_rank": 21960, "title": "Gradon Architecture's grand designs for London after four city contract wins", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Gradon Architecture's grand designs for London after four city contract wins", "spam_score": 0.0, "site_type": "news", "published": "2016-11-24T21:51:00.000+02:00", "replies_count": 0, "uuid": "71f255018ff52555d7516e49c121d3f87b22150f"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/gradon-architectures-grand-designs-london-12224922", "ord_in_thread": 0, "title": "Gradon Architecture's grand designs for London after four city contract wins", "locations": [], "entities": {"persons": [{"name": "sean furey", "sentiment": "none"}, {"name": "mcdarby", "sentiment": "none"}, {"name": "liam nelis", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "graham mcdarby", "sentiment": "none"}], "locations": [{"name": "gateshead", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "mongolia", "sentiment": "none"}, {"name": "ryton", "sentiment": "none"}, {"name": "harrow", "sentiment": "none"}, {"name": "dubai", "sentiment": "none"}, {"name": "st john’s road", "sentiment": "none"}, {"name": "dakota", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "north west london", "sentiment": "none"}, {"name": "st james’s park", "sentiment": "none"}, {"name": "harley street", "sentiment": "none"}, {"name": "gradon", "sentiment": "none"}, {"name": "derry", "sentiment": "none"}], "organizations": [{"name": "northpoint", "sentiment": "none"}, {"name": "ulan bator", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Gradon Architecture's grand designs for London after four city contract wins The Gateshead firm is working on an upmarket cosmetic surgery for a Dubai firm in its first steps into London Share L-R: Sean Furey, Graham McDarby, Liam Nelis of Gradon Architecture (Photo: Gradon Architecture) Share Get business   \nA growing North East architecture practice has secured four projects in London in its first foray into the capital. \nGateshead-headquartered Gradon Architecture is currently working on two residential projects, an upmarket healthcare clinic and an office conversion in London after taking its first steps into the city having already opened studios in Derry, Northern Ireland, and Ulan Bator in Mongolia, on the back of demand in those areas. \nThe firm has been appointed by Dubai-based cosmetic surgery clinic CosmeSurge to work on its flagship London premises in Harley Street, involving a £2m renovation to create the exclusive aesthetic medicine chain’s first venture into the UK. \nThe surgery design combines the demands of a cosmetic procedure practice, including specialist lighting, flooring and medical equipment, with detailed design features to create a calming yet contemporary environment for patients. \nArchitectural director Sean Furey, who has managed the project on site, said: “This project marks a hugely exciting time for Gradon Architecture. Not only is it one of our first projects in London, it is a flagship space on one of the capital’s most famous streets. \n“Through the renovation process we have created a functional, contemporary medical practice complete with all the high-spec equipment required of the business. At the same time as creating a practical workspace, we have brought in creative design elements to create an environment that patients and practitioners alike will enjoy spending time in.” \nThe practice has also secured another two additional projects in Harrow, North West London, redeveloping two apartment blocks in the region’s St John’s Road area. Read More North East architects Northpoint appointed to £8.4bn London project \nA fourth project for the firm in the capital is the reworking of an office space in the heart of Piccadilly. \nThe listed building, which faces on to St James’s Park, will be converted into a flexible office and meeting space. \nGraham McDarby, founder and managing director of Gradon, said the firm has gone from strength to strength since opening in Ryton, Gateshead, in 2009. \nThe business has picked up large-scale contracts in Mongolia and recent recruitment in the Derry studio has seen the team increase to 22 people across all locations, with further recruitment planned. Read More Newcastle's Dakota designers up for international award for Swiss bar project \nMr McDarby said: “Securing these four London projects shows just how far we have come over the last few years. \n“We’re delighted at the achievement and excited to bring our brand of personal and hands on approach to architecture to projects in the capital. \n“In these increasingly difficult times for the industry, a few have cited Brexit as a downturn in their fortunes. \n“From our perspective, there are huge opportunities out there to be had. Our flexibility and ability to respond to ever changing markets, which has already taken us to Northern Ireland, has now brought us to London. \n“The capital now presents unlimited opportunities for us, which we are hugely excited about.” Like us on Facebook", "external_links": [], "published": "2016-11-24T21:51:00.000+02:00", "crawled": "2016-11-24T17:05:03.241+02:00", "highlightTitle": ""}