{"organizations": [], "uuid": "0c9b7451155f5e7b382e49c62179e90d18f7916b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12148597.ece/ALTERNATES/s1200/JS104503727.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/business-breakfast-live-trump-victory-12148689", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast Live: Donald Trump's shock election causes markets to plummet", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast Live: Donald Trump's shock election causes markets to plummet", "spam_score": 0.0, "site_type": "news", "published": "2016-11-09T15:45:00.000+02:00", "replies_count": 0, "uuid": "0c9b7451155f5e7b382e49c62179e90d18f7916b"}, "author": "Tom Eden", "url": "http://www.chroniclelive.co.uk/business/business-news/business-breakfast-live-trump-victory-12148689", "ord_in_thread": 0, "title": "Business Breakfast Live: Donald Trump's shock election causes markets to plummet", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "negative"}, {"name": "trevor charsley", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "jesmond", "sentiment": "none"}, {"name": "hillary clinton.japan", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "cradlewell", "sentiment": "none"}, {"name": "north carolina", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}], "organizations": [{"name": "s&p", "sentiment": "none"}, {"name": "heineken", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KEY EVENT Pound rises against the dollar \nMeanwhile the pound rose 1.2% against the dollar at 1.2529 and the euro was up 2.1% at 1.1259 on two-day figures.AFEX currency specialist Trevor Charsley said: \n“The dollar is getting slammed as the market prices in the latest 73% probability of a Trump presidency. \n“EURUSD has gained 2% from its lows but the Mexican peso has lost 10% in three hours. \n“The US asset markets have slumped as well with the S&P future falling 5% as well. \n“The atmosphere in trading rooms is reminiscent of the Brexit vote.” 09:05 KEY EVENT Markets plummet after Trump's election \nMarkets have reacted feverishly to the prospect of a Donald Trump presidency grows, sending the dollar sliding and investors fleeing for safe havens.In scenes likened to the aftermath of the Brexit vote, share benchmarks across Asia tumbled and the Mexican peso nose-dived as the battle to win in Florida, a battleground state, went down to the wire before being seized by the Republican.The tycoon scooped further key electoral college votes in North Carolina and Ohio and his bid for the White House appeared to be gaining momentum, sweeping away pollsters’ predictions of a comfortable win for Democratic nominee Hillary Clinton.Japan’s Nikkei 225 index dropped 4% to 16,498.17 as the US dollar slumped 3.3% against the Japanese yen, potentially spelling trouble for Japanese exporters. 09:04 KEY EVENT What does Trump's victory mean? \nAmerican ascendancy or blue-collar betrayal, a disaster for the global economy or a golden opportunity for post-Brexit Britain, experts are divided on what a Donald Trump presidency could bring. (Photo: Getty Images North America) 09:01 Newcastle pub to re-open after major makeover \nA historic pub that has been empty since last year is set to be restored and re-opened in a Newcastle suburb following a major makeover by new owners. \nThe Punch Bowl in Cradlewell, Jesmond , had operated as a pub for almost 160 years until it closed its doors last year - the second to shut in the vicinity following the loss of neighbouring hostelry The Cradlewell, which is now residential flats. \nNow new owners Star Pubs and Bars – the leased pub division of Heineken – is ploughing significant investment into the 1870s building which will see it re-open next year, creating 10 new jobs. \nThe firm has submitted proposals to build a two-storey extension to the rear and to create a terrace in the car park, while also making alterations including replacement windows and stone repairs. \nWork is hoped to start in the new year, with plans to open from 8am to serve breakfasts and teas and coffees, before going on to serve throughout the day. 08:50 Welcome to our business live blog \nGood morning and welcome to the business live blog, running in the wake of Trump’s shock victory. \nThe UK’s blue-chip index plunged on opening as Donald Trump’s victory in the US presidential election spooked markets, before paring back losses. \nFor newcomers to the blog (including me - this is my first time at the helm) every weekday morning we cover the latest big stories from the region’s business community, as well as national news, FTSE updates and stock exchange announcements from the Journal region’s listed companies and national firms - essentially anything and everything from the world of business. Share", "external_links": [], "published": "2016-11-09T15:45:00.000+02:00", "crawled": "2016-11-09T11:07:52.066+02:00", "highlightTitle": ""}