{"organizations": [], "uuid": "7e35731f800f70426477c310a966a28dc88598dc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12172836.ece/ALTERNATES/s1200/JS104917470.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/tanks-lot-petrol-prices-north-12172798", "country": "GB", "domain_rank": 21960, "title": "Tanks a lot - petrol prices in North East set to drop as Asda kicks off a price war", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Tanks a lot - petrol prices in North East set to drop as Asda kicks off a price war", "spam_score": 0.0, "site_type": "news", "published": "2016-11-14T20:00:00.000+02:00", "replies_count": 0, "uuid": "7e35731f800f70426477c310a966a28dc88598dc"}, "author": "Ian Robson", "url": "http://www.chroniclelive.co.uk/news/north-east-news/tanks-lot-petrol-prices-north-12172798", "ord_in_thread": 0, "title": "Tanks a lot - petrol prices in North East set to drop as Asda kicks off a price war", "locations": [], "entities": {"persons": [{"name": "nick ansell/pa wire", "sentiment": "negative"}, {"name": "edmund king", "sentiment": "none"}, {"name": "petrol andy peake", "sentiment": "none"}, {"name": "benton", "sentiment": "none"}, {"name": "simon williams", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "gosforth", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}], "organizations": [{"name": "asda", "sentiment": "negative"}, {"name": "brexit", "sentiment": "none"}, {"name": "rac", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "A person using an Asda petrol pump (Photo: Nick Ansell/PA Wire) Share Get daily   Could   \nThere is good news for North East motorists - the price of fuel is going down. \nSupermarket chain Asda has sparked a price war by reducing the cost of filling up at the pumps. \nThe price drop, due to come into force on Tuesday, is likely to lead to other supermarkets following suit. \nAsda, which has petrol stations across the North East including at Gosforth , Gateshead and Benton, will cut 3p per litre at its 294 filling stations across the country. \nThey say the new cost will be 110.7p per litre on unleaded and 112.7p per litre on diesel. \nAsda Senior Director for Petrol Andy Peake said: “Today’s latest move shows that Asda is once again leading the way in reducing the price at the pumps to help the millions of motorists across the UK. \n“Our new national price cap of 110.7ppl on unleaded and 112.7ppl on diesel will be welcomed by the millions of drivers who have seen fuel prices rise since Brexit”. \nThe move was made possible by reduced wholesale prices. \nIt follows a steady rise in prices when wholesale prices were higher. \nThe fuel cut will be welcomed by the millions of drivers who have seen fuel prices rise since Brexit due to the sharp fall in the pound. Read More Recaro child car seats recalled over safety fears - here's how to check if yours is safe \nAsda’s latest income tracker for September shows that year on year, fuel prices have increased by 1.4%. \nThe company said it is the first time in over three years that the data has shown an increase in vehicle fuel prices from the previous year. \nThey said this was one of the contributing factors to the plateau in weekly disposable income for families across the UK. \nAA president Edmund King said: “Asda’s price cut will take some of the sting out of the high pump prices that followed the crash in the value of the pound. \n“Yo-yo oil prices mean that we may see costs reverse yet again but the AA very much welcomes Asda’s policy of passing on savings when they can. Other retailers should take note.” \nThe RAC said prices should drop even further. \nThe RAC said supermarkets should have cut prices in October when wholesale prices started to fall. \nSimon Williams, the motoring organisation’s fuel spokesman, said: “Retailers should have reduced their prices then rather than making one bigger headline-grabbing cut now. \n“This will sadly undermine motorists’ trust in fuel retailers and it’s hard not to see it as them taking advantage of the current climate, which has led people to think that higher fuel prices are an inevitability simply because of the weaker pound and talk of the rising cost of goods. \n“In fact there is still scope to reduce pump prices further.” Share", "external_links": [], "published": "2016-11-14T20:00:00.000+02:00", "crawled": "2016-11-14T16:09:20.265+02:00", "highlightTitle": ""}