{"organizations": [], "uuid": "80c87ae24580aa29be6ac403d0b19b448380461a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article11989734.ece/ALTERNATES/s1200/JS56236342.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/ukip-flourish-north-post-brexit-12168050", "country": "GB", "domain_rank": 21960, "title": "Will UKIP flourish in the North post-Brexit and post-Nigel Farage?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Will UKIP flourish in the North post-Brexit and post-Nigel Farage?", "spam_score": 0.0, "site_type": "news", "published": "2016-11-13T18:37:00.000+02:00", "replies_count": 0, "uuid": "80c87ae24580aa29be6ac403d0b19b448380461a"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/ukip-flourish-north-post-brexit-12168050", "ord_in_thread": 0, "title": "Will UKIP flourish in the North post-Brexit and post-Nigel Farage?", "locations": [], "entities": {"persons": [{"name": "jonathan arnott", "sentiment": "neutral"}, {"name": "paul", "sentiment": "none"}, {"name": "diane james", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "getty", "sentiment": "none"}, {"name": "nigel farage", "sentiment": "none"}, {"name": "paul nuttall", "sentiment": "none"}, {"name": "nuttall", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "farage", "sentiment": "none"}, {"name": "arnott", "sentiment": "none"}, {"name": "suzanne evans", "sentiment": "none"}, {"name": "andrew marr show", "sentiment": "none"}], "locations": [{"name": "hartlepool", "sentiment": "none"}, {"name": "borough hall", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "blyth valley", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "leeds", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "north", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "none"}, {"name": "bbc", "sentiment": "none"}, {"name": "hartlepool", "sentiment": "none"}, {"name": "national front", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathan Arnott UKIP North East MEP at the conference held at Borough Hall in Hartlepool Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe North East is at the heart of the future of UKIP and will be one of its chief battlegrounds at the next general election, it has been claimed. \nSome political pundits believe the party will flounder following the Brexit vote and when current leader Nigel Farage stands down later this month. \nAnd the fact that in October it was left humiliated when Farage’s original successor, Diane James, quit just 18 days after being voted in to replace him did little to dispel the notion. \nHowever its North East MEP Jonathan Arnott is confident the party will bounce back and grow under a new leader who he hopes will be Paul Nuttall. \nAnd he predicted it would at least take Hartlepool at the next general election, while a number of other seats in the region are also ‘winnable’, he claimed. Read More UKIP doesn't love Donald Trump as much as Nigel Farage says it North East MEP \nMr Arnott, who will find himself out of a job after the UK leaves Europe, said: “I think it’s been obvious there have been problems in UKIP over the last few months. \n“There have been difficult times but Paul is the person more than anybody else to sort the party out, somebody with great experience. \n“He understands the internal side of things and would be good at bringing people together.” \nMr Arnott said that, policy wise, under Mr Nuttall if he is selected on November 28, the party might not just concentrate on immigration. \n“I think he’d make crime more of a focus but the immigration is issue is pretty much tied into the Brexit negotiations.” UKIP leadership hopefuls Suzanne Evans and Paul Nuttall share a joke before The UKIP leadership hustings on November 8, 2016 in Leeds (Photo: Getty) \nMr Arnott said the North would be one his party’s chief battlegrounds because of the electoral gains it has made in the region in recent years. \nHe said: “I think at the general election, all things being equal, we will win Hartlepool. You look at the last general election and see that we need a 4% swing to win Hartlepool. \n“Given the unpopularity of Jeremy Corbyn’s Labour party and how we’re doing locally there - at the last council by-election we won by a landslide - we should win. So long as the national party does its job, I’m sure the local party will deliver.” \nHe said it had a lot of other targets in the region, including Blyth Valley in Northumberland and seats in Sunderland. \n“A lot of seats show massive potential. The difference between saying we’re expected to win this and we’ve the potential to win, that’s where the difference is with Hartlepool. We expect to win there, if everything stays the same.” \nOn Sunday, Labour leader Jeremy Corbyn accused UKIP of the same “nasty” brand of politics as France’s far-right National Front. \nSpeaking on BBC’s Andrew Marr Show, he said: “They both attempt the same shallow populist nasty appeal.” Video Loading Click to play Tap to play The video will start in 8 Cancel Play now", "external_links": [], "published": "2016-11-13T18:37:00.000+02:00", "crawled": "2016-11-13T15:56:50.245+02:00", "highlightTitle": ""}