{"organizations": [], "uuid": "81ded7723d20cf6fd9c7d4b73388e07651e4315b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12088483.ece/ALTERNATES/s1200/JS103417714.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/governments-deal-nissan-break-eu-12139000", "country": "GB", "domain_rank": 21960, "title": "Did the Government's deal with Nissan break EU rules?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Did the Government's deal with Nissan break EU rules?", "spam_score": 0.0, "site_type": "news", "published": "2016-11-07T19:48:00.000+02:00", "replies_count": 0, "uuid": "81ded7723d20cf6fd9c7d4b73388e07651e4315b"}, "author": "Dan O'Donoghue", "url": "http://www.chroniclelive.co.uk/news/north-east-news/governments-deal-nissan-break-eu-12139000", "ord_in_thread": 0, "title": "Did the Government's deal with Nissan break EU rules?", "locations": [], "entities": {"persons": [{"name": "jeremy corbyn", "sentiment": "none"}, {"name": "ghosn", "sentiment": "none"}, {"name": "greg clark", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "clark", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "carlos ghosn", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "qashqai", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "neutral"}, {"name": "nissan", "sentiment": "neutral"}, {"name": "labour", "sentiment": "none"}, {"name": "safc", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "european commission", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Did the Government's deal with Nissan break EU rules? The deal agreed last month secured thousands of jobs at the firm's Sunderland plant - but it is now in doubt Share Workers at Nissan working on the Qashqai in Sunderland, as the car giant has decided to build its next Qashqai SUV at the factory, securing thousands of jobs (Photo: Owen Humphreys/PA Wire) Share Get daily updates   Thank you for subscribing! Could   \nA secret 'sweetheart deal' between car giant Nissan and the Government is set to be reviewed by the European commission. \nOfficials in Brussels have made contact with the UK government to find out what promises the business secretary, Greg Clark, made to the Japanese carmaker to keep its business in the UK. \nThe firm’s Wearside plant is one of the region’s biggest employers with around 7,000 staff, while tens of thousands more work for companies that provide components and parts for it. \nThe deal agreed on October 30 in a Downing Street meeting with Nissan chief executive Carlos Ghosn was seen as a welcome boost following the uncertainty caused by Brexit. \nDetails of the deal remain scant but Mr Ghosn had previously stated that the company would need compensation for tax barriers that might result from Britain leaving the EU. \nMany MPs and businesses were left unhappy about the behind closed doors nature of the agreement and now the European Commission will review what was agreed. \nUnder EU rules the UK is not allowed to offer state aid, such as financial assistance, and is prevented from propping up companies and industries to the disadvantage of competitors from fellow member states. The Commission can fine member states and force the company that has benefited to return any money. Read More Excitement at Nissan's Sunderland factory workers and SAFC stars drop in for a visit \nMr Clark has refused to publish a letter he sent to Nissan containing assurances as to the government’s intentions with regard to Brexit, because it contains sensitive commercial details. \nHe reportedly gave a “last-minute written promise” to Nissan to protect the company from the consequences of Brexit, including tariffs on exports from the UK. \nSpeaking on BBC1’s Question Time last month, Clark indicated that there had been no offer of financial compensation or state aid. “There’s no chequebook. I don’t have a chequebook,” he said. \nA European Commission spokesman said: “We have seen press reports regarding this issue. As a result, the commission at services level is in contact with the UK authorities. Such exchanges of information are common. \n“In this specific case, the UK authorities have not notified any support to Nissan for assessment under EU state aid rules. We have not taken any formal views on the matter.” Read More Nissan investment: Government will not publish letter sent to Sunderland car giant \nThe building of the Qashqai and the X-Trail in Sunderland had been in doubt following the Brexit vote on 23 June. The agreement with Nissan was regarded as a major political success. \nTheresa May hailed the carmaker’s decision as “fantastic news” and a vote of confidence in the UK at the time of the announcement. \nJeremy Corbyn, the Labour leader, has said he is pleased there will be continued investment in Sunderland, but said concerns remained about any secret deal between the government and the carmaker. \n“If there are any inducements that have been offered, and quite obviously if you are offering big inducements to one industry or one manufacturer, then all the others will quite reasonably say: ‘Well, what about us?’” he said. Read More", "external_links": [], "published": "2016-11-07T19:48:00.000+02:00", "crawled": "2016-11-07T15:18:33.238+02:00", "highlightTitle": ""}