{"organizations": [], "uuid": "3a9bdc6d0fdacdd3b646013035c41e093c67087d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12200923.ece/ALTERNATES/s1200/Chancellor-launches-cyber-security-strategy.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/autumn-statement-2016-what-north-12200504", "country": "GB", "domain_rank": 21960, "title": "Autumn Statement 2016: What the North East can expect", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Autumn Statement 2016: What the North East can expect", "spam_score": 0.0, "site_type": "news", "published": "2016-11-20T12:00:00.000+02:00", "replies_count": 0, "uuid": "3a9bdc6d0fdacdd3b646013035c41e093c67087d"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/autumn-statement-2016-what-north-12200504", "ord_in_thread": 0, "title": "Autumn Statement 2016: What the North East can expect", "locations": [], "entities": {"persons": [{"name": "philip hammond", "sentiment": "negative"}, {"name": "theresa may", "sentiment": "none"}, {"name": "hammond", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "downing street", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "newcastle airport", "sentiment": "none"}, {"name": "sterling", "sentiment": "none"}], "organizations": [{"name": "institute for fiscal studies", "sentiment": "none"}, {"name": "office for budget responsibility", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}, {"name": "british airways", "sentiment": "none"}, {"name": "shell", "sentiment": "none"}, {"name": "whitehall", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Chancellor Philip Hammond (Photo: Chris Radburn/PA Wire) Share Get   Thank you for subscribing!   \nChancellor Philip Hammond is to deliver his first Autumn Statement to the House of Commons on Wednesday, November 23. \nAnd it’s particularly important for two reasons. First, it’s the first major financial statement since the Brexit vote. \nSecond, it’s not just a milestone for Mr Hammond but also for Prime Minister Theresa May, because it’s the first such statement since she took over at Number 10. \nSo what can we expect? A Shell logo on a petrol pump Fuel \nWe don’t know what exactly will be announced, but it is expected at Whitehall that policies will include continuing to freeze fuel duty for motorists, which may be welcomed by motorists in rural parts of the North East such as County Durham and Northumberland. Income tax and childcare \nThe Government is also expected to increase the income tax threshold, which effectively means cutting income tax for many working people. \nHowever, the threshold is already £11,000 - and from April next year, you will pay no tax on incomes up to £11,500. \nAny further increase will only benefit people with incomes above £11,500. It won’t help people on salaries lower than this (though the minimum wage means all adults should be earning this much if they have a full time job with paid holidays). \nThere may also be more free or subsidised childcare, and extra incentives for low-income families to save. A British Airways plane Holidays post-Brexit \nThere is speculation that Mr Hammond will announce a cut to air passenger duty to help families with the cost of a foreign holiday. \nNewcastle Airport will be keen to see the Government how it plans to ensure English regional airports can compete with Scotland - where the Scottish Government has announced plans to cut air passenger duty by half by 2021, and eventually to abolish it. \nThe fear is that this will encourage airlines to choose Scottish airports to run services from, unless similar cuts are introduced in England. Read More Hopes that £7.5 billion contract to build giant high speed trains may come to North East Housing \nMinisters have already announced a £3bn housing fund to “get Britain building”, and Mr Hammond is likely to stress the Government’s support for people who want to buy a home. An elderly woman (Photo: John Stillwell/PA Wire) Fraud crackdown \nThere will be a ban on pensions cold calling, designed to protect vulnerable people from being tricked into handing over their life savings. \nThe announcements, if they come as expected, are part of Mrs May’s campaign to help people who are “just about managing”. \nThis stems from her belief that the Government needs to support working people who struggle with the cost of living. \nShe set out her philosophy in a speech outside Downing Street when she became Prime Minister, saying: “If you’re from an ordinary working class family, life is much harder than many people in Westminster realise. \n“You have a job but you don’t always have job security. You have your own home, but you worry about paying a mortgage. You can just about manage but you worry about the cost of living and getting your kids into a good school.” \nThe Chancellor is also likely to announce help for business, including spending on hi-tech research. \nBut the Autumn Statement isn’t just a chance for the Government to announce ways of helping people. \nIt’s also when the Office for Budget Responsibility (OBR), the Government’s fiscal watchdog, reveals its latest forecasts for growth, unemployment and inflation. \nAnd these may be dire. \nThink tank the Institute for Fiscal Studies has warned that the UK is heading for a £14.9bn deficit in 2019-20. \nGrowth is slowing down and inflation could rise to above 2% by the middle of next year - thanks to the post-Brexit fall in the value of Sterling, which makes exports more expensive. \nIf wages don’t rise as quickly as inflation then standards of living may fall. \nAnd Labour will be calling on the Government to reverse planned welfare cuts, including a £30-a-week cut to Employment and Support Allowance which is paid to some people with disabilities. \nSome Conservative MPs have also spoken and voted against this planned cut. Like us on Facebook", "external_links": [], "published": "2016-11-20T12:00:00.000+02:00", "crawled": "2016-11-20T08:36:48.452+02:00", "highlightTitle": ""}