{"organizations": [], "uuid": "46761c46989b48fbca6aa697c9ed51caed3e6485", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/29880401/15672310.jpg", "site_section": "http://www.thisisleicestershire.co.uk/generalelection2010/rss.html?chid=182803", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/donald-trump-elected-us-president-leicester-businesses-react/story-29880401-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "TomPegden published Donald Trump elected US president: Leicester businesses react", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "TomPegden published Donald Trump elected US president: Leicester businesses react", "spam_score": 0.0, "site_type": "news", "published": "2016-11-09T17:09:00.000+02:00", "replies_count": 0, "uuid": "46761c46989b48fbca6aa697c9ed51caed3e6485"}, "author": "TomPegden", "url": "http://www.leicestermercury.co.uk/donald-trump-elected-us-president-leicester-businesses-react/story-29880401-detail/story.html", "ord_in_thread": 0, "title": "TomPegden published Donald Trump elected US president: Leicester businesses react", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "negative"}, {"name": "tompegden", "sentiment": "negative"}, {"name": "trump", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "gareth john", "sentiment": "none"}, {"name": "kevin buchanan", "sentiment": "none"}, {"name": "mike pole", "sentiment": "none"}, {"name": "ben wattam", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "grove park", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "north west leicestershire", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "enderby", "sentiment": "none"}, {"name": "westminster", "sentiment": "none"}, {"name": "gateley", "sentiment": "none"}], "organizations": [{"name": "leicestershire business voice", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "mattioli woods", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Comments (0) \nDonald Trump's election has left the business community scratching their heads about what happens next. \nThe billionaire/reality TV star's election to the most powerful position on earth failed to send the markets into meltdown this morning, though some warned things could change when the US markets open at 2.30pm our time. \nMany compared it to the anti-establishment vote in the EU referendum. \nBen Wattam, investment manager at wealth management firm Mattioli Woods in Grove Park, Enderby, said: \"The outcome markets feared has materialised and equity markets are feeling the immediate brunt of the sell-off in risk assets. \n\"As before, currencies are also in the spotlight, none more so than the peso, which has tumbled to all-time lows against the US dollar. \n\"Though still early days, we feel the dollar may strengthen as it constitutes a safe haven currency and Treasuries should be in demand in a time of elevated stress. \n\"The anti-globalisation rhetoric of Mr Trump in the campaign has not helped Asian markets this morning, likewise Europe – these markets could be especially damaged by his election as investors have to be nervous of a more economically isolationist United States.\" \nGareth John, senior partner at the Leicester office of Gateley law firm and chairman of the Leicestershire Business Voice pressure group, said there were obvious parallels with Brexit. \nHe said: \"It's perhaps a case of people in power not having listened enough to the man on the street. \n\"Maybe both Brexit and last night can in some ways get politicians focussed on what is now right for people in their lives and in their jobs. \n\"We are getting what we deserve in some ways – politicians have taken their eyes off the ball completely and there has been a disconnect between people who sit in places like Washington and Westminster and the rest of us. \n\"I'm sorry to say this, but I think the media have whipped everything up into a frenzy and that actually while the president does have powers, there are so many checks and balances written into the constitution that what he does will have to be moderated and go through due process. \n\"I do not think we are in for a nuclear war or a recession.\" \nKevin Buchanan, group managing director of north west Leicestershire haulage giant Pall-Ex, said it was very early to draw a true picture of the consequences. \nBut he said: \"Trump is a bit of a showman so how much he actually means and how much he can do is yet to be seen. \n\"It is an anti-establishment vote and from a global point of view will not help the economies of the world.\" \nWealth management specialist Mike Pole, of Pole Arnold in Enderby, said Trump would create uncertainty, something the money markets obviously hated. \nBut he also hoped the US constitution would prevent Trump making too many blunders. \nHe said: \"We will have to wait and see what happens, but we expect markets to be volatile before settling down. \n\"The most unsettling thing is that he says just what he wants which might not be good for international relations. \n\"I am surprised the European markets are not showing more of a loss this morning, but maybe they will be looking for a lead at 2.30pm when the US markets open.\"", "external_links": [], "published": "2016-11-09T17:09:00.000+02:00", "crawled": "2016-11-09T13:26:58.615+02:00", "highlightTitle": ""}