{"organizations": [], "uuid": "63f619137bbd7fbf9c08ee61114d640c77ad6059", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12226756.ece/ALTERNATES/s1200/CFR_NJL_241116gibbon_02JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/newcastle-tech-firm-whispering-gibbon-12226577", "country": "GB", "domain_rank": 21960, "title": "Newcastle tech firm Whispering Gibbon gets starring role in national campaign", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Newcastle tech firm Whispering Gibbon gets starring role in national campaign", "spam_score": 0.0, "site_type": "news", "published": "2016-11-25T01:00:00.000+02:00", "replies_count": 0, "uuid": "63f619137bbd7fbf9c08ee61114d640c77ad6059"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/newcastle-tech-firm-whispering-gibbon-12226577", "ord_in_thread": 0, "title": "Newcastle tech firm Whispering Gibbon gets starring role in national campaign", "locations": [], "entities": {"persons": [{"name": "gibbon", "sentiment": "negative"}, {"name": "stevens", "sentiment": "none"}, {"name": "caroline norbury", "sentiment": "none"}, {"name": "alex rose", "sentiment": "none"}, {"name": "joe stevens", "sentiment": "none"}, {"name": "steven huckle", "sentiment": "none"}, {"name": "alex rose games", "sentiment": "none"}, {"name": "simon bird", "sentiment": "none"}, {"name": "barry ryan", "sentiment": "none"}, {"name": "joel kemp", "sentiment": "none"}], "locations": [{"name": "england", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "creative england", "sentiment": "none"}], "organizations": [{"name": "whispering gibbon", "sentiment": "negative"}, {"name": "newcastle", "sentiment": "negative"}, {"name": "candle & bell", "sentiment": "none"}, {"name": "lockwood publishing", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "warp films", "sentiment": "none"}, {"name": "shark infested custard", "sentiment": "none"}, {"name": "creative england", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Newcastle tech firm Whispering Gibbon gets starring role in national campaign The 3D printing firm's founder Joe Stevens features in Creative England's campaign to inspire the next generation Share The team at Whispering Gibbon Share Get business updates   Thank you for subscribing!   \nA Newcastle tech company has been given a starring role in a campaign designed to shine a light on the the nation’s thriving creative industry. \nCreative England, a not-for-profit company which accelerates talent and ideas across tech, games, TV and film, has launched #EnglandIsCreative – a brand marketing campaign which aims to throw the spotlight on the creative and tech future leaders it champions. \nA host of inspiring company founders feature in four films, each telling their stories, including Joe Stevens, founder and chief executive officer of 3D printing firm Whispering Gibbon. \nEarlier this year the company was one of three Newcastle firms – alongside film company Hook Pictures and digital agency Orange Bus – to be included in the Creative England 50, the list highlighting the individuals and businesses which have turned innovative ideas into commercial successes. \nWhispering Gibbon’s patent-pending technology enables the creation of 3D print-ready versions of digital content, which can then be merchandised as physical items. \nMr Stevens, a games industry veteran with 15 years of experience, wants to place the firm at the forefront of the growing demand for 3D content. \nHe said Creative England have been fully supportive of the business, so didn’t hesitate to take part in the video campaign, in which he tells viewers about the company. \n“Creative England have supported the company from its early days as a start-up to where we are now launching cutting-edge 3D technology,” he said. \n“It’s good to be involved in a campaign which highlights the creativity of UK companies and in particular the north east as the regions are often underestimated. \n“Having worked across the globe I think that it’s the creativity and entrepreneurship of England which really sets it apart.” Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nThe #EnglandIsCreative campaign celebrates Creative England’s success to date, having invested £27.7m into 1,066 ventures, including tech, digital and film businesses, games developers and film makers. \nIn addition 560 jobs have been created and £25m leveraged in private funding. The work has lead to 37 original games being created, 205 feature films developed, and 80 industry awards won. \nThe first of the four films tells the Creative England story, and the following three films sum up each of the three sectors it works in – gaming, tv and film, and tech. \nThe films, which are available online, allow entrepreneurs like Mr Stevens to speak directly to the next generation of creative talent, and inspire them to start their own journey. \nThe campaign also features content generated by filmmakers including Simon Bird, of The Inbetweeners, and Barry Ryan of Warp Films; from the gaming industry Alex Rose of Alex Rose Games, Joel Kemp of Lockwood Publishing, and Steven Huckle of Shark Infested Custard. Read More Film production business Candle & Bell to make first feature film \nCaroline Norbury, CEO of Creative England said: “The UK’s creative industries are worth an incredible £87bn and generate £10m an hour to our economy. It is Creative England’s mission to ensure this continues and grows. \n“We find and nurture the best and most innovative new creative and tech talent, give them the support they need grow and scale, which in turn builds England’s economy, something completely imperative post-Brexit. \n“The inspiration for #EnglandIsCreative is to seek out new talent, whilst further promoting the future creative and tech leaders we’ve already had huge success with.” \nThe films are being released via Creative England’s social media platforms. Like us on Facebook", "external_links": [], "published": "2016-11-25T01:00:00.000+02:00", "crawled": "2016-11-24T21:17:54.387+02:00", "highlightTitle": ""}