{"organizations": [], "uuid": "41c3363a25cccf0c6acb51eb6e2f7bd723666685", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/29924937/15699631.jpg", "site_section": "http://www.thisisleicestershire.co.uk/specialolympics/rss.html?chid=181121", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/llep-boss-has-huge-ambitions-for-city-and-county/story-29924937-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "Lauren_Mills published LLEP boss has huge ambitions for city and county", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "Lauren_Mills published LLEP boss has huge ambitions for city and county", "spam_score": 0.0, "site_type": "news", "published": "2016-11-22T21:48:00.000+02:00", "replies_count": 0, "uuid": "41c3363a25cccf0c6acb51eb6e2f7bd723666685"}, "author": "Lauren_Mills", "url": "http://www.leicestermercury.co.uk/llep-boss-has-huge-ambitions-for-city-and-county/story-29924937-detail/story.html", "ord_in_thread": 0, "title": "Lauren_Mills published LLEP boss has huge ambitions for city and county", "locations": [], "entities": {"persons": [{"name": "mandip rai", "sentiment": "negative"}, {"name": "phillip hammond", "sentiment": "none"}, {"name": "sajid javid", "sentiment": "none"}, {"name": "rai", "sentiment": "none"}, {"name": "hammond", "sentiment": "none"}], "locations": [{"name": "loughborough", "sentiment": "none"}, {"name": "loughborough science park", "sentiment": "none"}, {"name": "hinckley", "sentiment": "none"}, {"name": "city hall", "sentiment": "none"}, {"name": "charnwood campus", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}, {"name": "pioneer park", "sentiment": "none"}, {"name": "charles street", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}], "organizations": [{"name": "loughborough", "sentiment": "none"}, {"name": "green belle", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}, {"name": "leicestershire enterprise partnership", "sentiment": "none"}, {"name": "erdf", "sentiment": "none"}, {"name": "local government", "sentiment": "none"}, {"name": "lep", "sentiment": "none"}, {"name": "european regional development fund", "sentiment": "none"}, {"name": "astra zeneca", "sentiment": "none"}, {"name": "llep", "sentiment": "none"}, {"name": "motor industry research association", "sentiment": "none"}, {"name": "manufacturing growth programme", "sentiment": "none"}, {"name": "gva", "sentiment": "none"}, {"name": "mira", "sentiment": "none"}, {"name": "leicester energy agency", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Comments (0) \nMandip Rai has an exceptionally good head for facts and figures. \nThe new chief executive of the Leicester and Leicestershire Enterprise Partnership can reel off anything you want to know about the organisation without referring to notes or consulting colleagues. \nThis is pretty impressive given the size of the LLEP's remit and the funding challenges it faces in the wake of the Brexit vote. We meet in a small, bare room up on the third floor of City Hall in Charles Street, Leicester. \nAs I flick through pages of carefully prepared questions, he fires off detailed answers so quickly and precisely it is difficult to keep up. \nFormerly the LLEP's head of strategy and engagement, Mr Rai was appointed to the top job in mid-October. \nThe LLEP was formed as part of a Government policy in 2011. It is a partnership between the city and county's public sector and business leaders and its mission is to shape the future of the local economy. \nMr Rai said: \"My prime objective is for the LLEP to bring as much investment into Leicester and Leicestershire as we can. \n\"It is a competitive world, I am a competitive person, and we are competing against 37 other LEPs to attract investment. \n\"It is very much about listening to businesses, understanding their needs and what challenges they are facing and responding to what they say. \n\"It is also about raising the profile of Leicester and Leicestershire nationally and globally to attract overseas investment. \n\"I am also committed to supporting the LLEP board. \n\"It is private sector led and I have never seen it so strong in Leicester – we have political leaders and business leaders who all have a common goal and it is down to us to make sure we are a prosperous city and county.\" \nMr Rai's vision for our city and county is, without doubt, hugely ambitious. \nBut the LLEP can already boast a host of successes. \nThese include the regeneration of Leicester's former rundown industrial riverside area, and MIRA (Motor Industry Research Association) enterprise zone near Hinckley, which achieved EZ status in 2012. \nMr Rai said: \"MIRA is regarded as one of the most successful enterprise zones in the country. \n\"It's created 250 jobs over three years and attracted key inward investment. It's an exemplar nationally.\" \nLLEP has also created thousands of new jobs in the city and county. It has managed this with a core team of 25 and annual running costs of £1 million. \nThe LLEP is funded by central Government, the nine local authorities it encompasses, Europe and private investment. \nEarly this month, it received confirmation from central Government it will benefit from £50.3 million of European funding despite the Brexit vote. \nSajid Javid, Secretary of State for Communities and Local Government, wrote to local enterprise partnerships across the UK assuring them that European Structural Investment Funds (ESIF) projects will continue to receive the money from the European Regional Development Fund (ERDF), which is part of ESIF. \nSome of the projects set to benefit from the funding include the LLEP's Business Gateway, which offers Leicester and Leicestershire businesses support. \nOthers include the Manufacturing Growth Programme, which provides support to growth-focused manufacturing SMEs such as textile firms and the Green BELLE initiative by Leicester Energy Agency, which aims to reduce CO2 emis - sions in Leicester by 50 per cent by 2025. \nThe funding programme began in 2014 and will run until 2020. \nIn Leicestershire, funding will be spread across four areas. Around £8.7 million will fund innovation projects within Leicestershire, £4.7 million will go towards developing information and communications technology, products, services and ecommerce, £21.4 million will help SMEs grow their businesses and provide business support and £15.5 million will help advance the low carbon economy. \nMr Rai's focus now is securing the LLEP's third round funding bid for £144 million. \nIt is a huge amount and he will find out if the LLEP's bid has been successful when Chancellor Phillip Hammond delivers his Autumn Statement tomorrow. \nMr Rai is also hoping Mr Hammond will confirm the LLEP's second enterprise zone, incorporating Pioneer Park in the city, Loughborough Science Park and Charnwood Campus, the former Astra Zeneca facility near Loughborough . \nThe site, stretching from Leicester to Loughborough, was given the go-ahead in March subject to the LLEP proving a business case for EZ status. \nMr Rai is cautiously optimistic of achieving both the funding and the enterprise zone. \nThis is understandable. In 2013, the LLEP's strategic economic plan set an ambitious growth target to increase gross value added to its region from £19 billion to £25 billion by 2020, to create 45,000 new jobs and to lever in significant new investment. \nMr Rai said: \"According to the latest statistics, our GVA was £23 billion in 2016 so our productivity has increased and we will exceed our original targets by 2020.\" \nThe LLEP has also done well as far as job creation is concerned. \n\"During the recession Leicester and Leicestershire lost 20,000 jobs. We've got those back now and in our last review we've got 20,000 more jobs in 2016 than we had in 2011. \n\"So we are halfway there in terms of the target to create 45,000 jobs. \n\"Of course this isn't all down to the LLEP. Clearly, there are external factors affecting it, but it is testament to the success of public and private partners working together for a common goal in Leicester and Leicestershire.\" \nMr Rai said LLEP's biggest challenge now is to move up the league table in terms of gross value added per head. \n\"The LEP network publishes various measures and metrics to measure LEPs' performance and we are still among the lowest in the country for GVA per head. \n\"We have to create jobs for people of all abilities. Now it's about higher value jobs, retaining graduates and supporting our businesses to exploit the commercial opportunity of working with our universities. \n\"There is scope to create high value jobs and that's exactly what's happened at MIRA. The average package for a graduate with two to three years' experience is £40,000 to £50,000. \n\"But we recognise we also need to create jobs for people who want to take a vocational or apprenticeship route so they have another route to a degree level qualification while they are working.\" \nMr Rai is \"confident and positive\" about LLEP's chances of achieving its current goals and objectives despite the inevitable uncertainty in the wake of the Brexit vote. \nHe said: \"European funding will disappear, but the national government has reassured that there will continue to be some sort of growth fund nationally for LEPs. \n\"I think there is an argument that the UK doesn't get back as much as it puts in [to the EU] so it is in a positive position going forward, in that the UK government will have control to do what it likes with the funds it put into ESIF, so there could be more funding being invested in the UK in skills.\"", "external_links": [], "published": "2016-11-22T21:48:00.000+02:00", "crawled": "2016-11-22T17:41:00.551+02:00", "highlightTitle": ""}