{"organizations": [], "uuid": "825938b8036b47bc736ac75865a25d6d7831a3aa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article11309212.ece/ALTERNATES/s1200/JS89404081.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/cuts-roads-jobs-andsoundproofing-five-12221862", "country": "GB", "domain_rank": 21960, "title": "Cuts, roads, jobs and...soundproofing: five things we learned from Sunderland City Council cabinet", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Cuts, roads, jobs and...soundproofing: five things we learned from Sunderland City Council cabinet", "spam_score": 0.0, "site_type": "news", "published": "2016-11-24T12:00:00.000+02:00", "replies_count": 0, "uuid": "825938b8036b47bc736ac75865a25d6d7831a3aa"}, "author": "Sean Seddon", "url": "http://www.chroniclelive.co.uk/news/north-east-news/cuts-roads-jobs-andsoundproofing-five-12221862", "ord_in_thread": 0, "title": "Cuts, roads, jobs and...soundproofing: five things we learned from Sunderland City Council cabinet", "locations": [], "entities": {"persons": [{"name": "coun michael mordey", "sentiment": "none"}, {"name": "philip hammond", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "coun harry trueman", "sentiment": "none"}, {"name": "mel speding", "sentiment": "none"}, {"name": "coun celia gofton", "sentiment": "none"}, {"name": "coun mel spedding", "sentiment": "none"}], "locations": [{"name": "new wear crossing", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "washington arts centre", "sentiment": "none"}], "organizations": [{"name": "sunderland city council", "sentiment": "negative"}, {"name": "sunderland city", "sentiment": "negative"}, {"name": "cabinet", "sentiment": "none"}, {"name": "sunderland council", "sentiment": "none"}, {"name": "harry trueman  cabinet", "sentiment": "none"}, {"name": "sunderland strategic transport corridor", "sentiment": "none"}, {"name": "st. mary", "sentiment": "none"}, {"name": "nissan  councillors", "sentiment": "none"}, {"name": "south tyneside council", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}, {"name": "iamp", "sentiment": "none"}, {"name": "exchequer", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "sunderland council coun", "sentiment": "none"}, {"name": "planning and highways and economic prosperity scrutiny committee", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "A computer generated image of how the New Wear Crossing will look Share Get daily   \nSunderland City Council cabinet met on Wednesday to vote on a number of key decisions for the area. \nAmong the topics were cuts to the council’s budget, issues arising from the re-development of part of the city and plans for a massive news business park to sit alongside Nissan . \nMost people don’t have the time - or desire - to go through the 372 page document which was under consideration. \nSo, here are the five things you need to know about what was discussed: 1. There are no two ways around it - front line services are going to be cut \nOn the day of the Autumn Statement, Sunderland Council cabinet discussed “Armageddon”. \nThe anger at continuing cuts in local authority budgets was laid bare as the council approved a budget consultation document. \nThe council is required to find an additional £74m in savings by 2020. \nCouncillor Mel Speding hinted that council tax rises would have to be considered as part of the final budget. \nHe added: “The cuts over the last seven years mean we are simply not able to fund the front-line services we want to.” \nRemarking that before the meeting he had received an email from Washington Arts Centre about an event themed around Armageddon, he followed his reading of the report by saying “maybe Armageddon is appropriate”. \nCouncillors then took turns to round on the government for what they view as the imposition of unreasonable financial restrictions on the council. \nCoun Harry Trueman said: “We keep slipping into this talk of ‘savings’ - these are not savings, they are cuts. \n“We are not trying to save - we never got the money in the first place and people need to realise this.” \nCoun Michael Mordey said: “We sat here last year considering pretty much the same report but this year it’s continuing at the same pace and it’s going to be hitting front line services hard. \n“Unfortunately, the people of this city are going to have to live with the reality of a government which doesn’t care.” \nCoun Celia Gofton said: “I agree to this reluctantly, only because we have to. We’ve got no choice.” 2. Sunderland is gearing up for the next stage of the road revolution Deputy Leader of Sunderland Council Coun. Harry Trueman \nCabinet approved the layout for the third phase of the ‘Sunderland Strategic Transport Corridor’. \nThe massive project has been underway for years - phase 1, the revamp of St. Mary’s way is complete and phase 2, the New Wear Crossing, is under construction. \nBut phase 3 is the one which holds the whole thing together. \nStretching from the new bridge to the centre of the city, it will form the spine of a dual carriageway which will eventually stretch from the port to the A19. \nThe council project it could be complete by winter 2019. \nImproving connectivity and accessibility to key sites and businesses around Sunderland, it could have a potentially transformative effect on the city’s economy. \nSpeaking of which... 3. The IAMP is a 15 year mega-plan which could be as big as Nissan \nCouncillors approved a revised plan for the ‘International Advanced Manufacturing Park’ which will be presented to the government next year. \nThe IAMP is a huge business development which will expand on the massive success of the North East’s car industry. \nThe joint proposal with South Tyneside Council would see the region become home to a giant hub for the automotive, manufacturing and tech industry. \nLocated just north of the Nissan, the IAMP would meet the supply chain demand created by the car super-plant. \nAt over 260,000 square miles, the vast site would accommodate several businesses and factories and initially employ an estimated 5,200 people. \nOn top of that, the government have already confirmed that 25 hectares of the site will be designated as an enterprise zone. \nThat means tax cuts for businesses operating there - and that means it won’t be short of applicants. \nThere will be a public consultation in the coming months before the Planning Inspector runs the rule over the plans. \nThe decision taken by the council today was a small step - but the IAMP could eventually be a giant leap for the region. 4. The transformation of the Minster Quarter is happening - but not before plenty of soft padding is installed \nPlans to transform a historic area of Sunderland received a thorough going over by the Planning and Highways and Economic Prosperity Scrutiny Committee. \nTheir findings were presented to cabinet and the response was positive. \nBut they did find that the council still has work to do to address some concerns. \nChief among these was ensuring that public transport links were up to scratch and that there is sufficient car parking to match increased demand in the area. \nThey also flagged up concerns about reassuring present and future residents about noise in the area. \nIf, as is intended, the area becomes a hub for socialising and live music, there’s going to need to be some serious soundproofing put in place. 5. A mournful discussion of EU funding by a cash-strapped council Read More From the A19 to the coast: Everything you need to know about new Sunderland dual carriageway \nCabinet received a timely reminder of the financial uncertainty the electorate in Sunderland opted to dive into. \nThe council today had to appoint itself as the body responsible for delivering the Community Led Local Development programme - no other applicants for the position came forward. \nIn short, the programme, which will receive more than £3m in EU funding, aims to foster social and economic development in deprived areas. \nIt aims to tackle problems being faced by communities which aren’t being reached by the economic growth opportunities popping up in the region. \nThe project, which will run up to 2022, will train 2,200 in employment skills and help put them into paid work. \nSunderland is a net beneficiary of EU funding but that revenue source will soon no longer be available to the city. \nThe council can safely press ahead with this project because Philip Hammond, the Chancellor of the Exchequer, has assured councils that any EU projects agreed before the referendum will be financially backed by the government after Brexit. \nAs Coun Mel Spedding put it, it felt “strange” to hear this good news presented to cabinet knowing full well that these funding avenues will soon be a thing of the past. Like us on Facebook", "external_links": [], "published": "2016-11-24T12:00:00.000+02:00", "crawled": "2016-11-24T07:46:20.359+02:00", "highlightTitle": ""}