{"organizations": [], "uuid": "539dcdd0e7f6f1e61d0571abb55a8c72b11f07e2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12208808.ece/ALTERNATES/s1200/CBI-Annual-Conference.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/plea-theresa-bring-2bn-science-12208725", "country": "GB", "domain_rank": 21960, "title": "Plea to Theresa May to bring £2bn science fund to the North East", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Plea to Theresa May to bring £2bn science fund to the North East", "spam_score": 0.0, "site_type": "news", "published": "2016-11-22T12:00:00.000+02:00", "replies_count": 0, "uuid": "539dcdd0e7f6f1e61d0571abb55a8c72b11f07e2"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/plea-theresa-bring-2bn-science-12208725", "ord_in_thread": 0, "title": "Plea to Theresa May to bring £2bn science fund to the North East", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "mrs may", "sentiment": "none"}, {"name": "luke raikes", "sentiment": "none"}, {"name": "philip hammond", "sentiment": "none"}, {"name": "greg clark", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "chris", "sentiment": "none"}, {"name": "jonathan brady/pa wire", "sentiment": "none"}], "locations": [{"name": "north east leading", "sentiment": "none"}, {"name": "north east plea", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "cheshire", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "north", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "newcastle science central", "sentiment": "none"}, {"name": "institute for ageing", "sentiment": "none"}, {"name": "cbi", "sentiment": "none"}, {"name": "ippr north", "sentiment": "none"}, {"name": "cbi annual conference", "sentiment": "none"}, {"name": "confederation of british industry", "sentiment": "none"}, {"name": "iipr", "sentiment": "none"}, {"name": "newcastle university", "sentiment": "none"}, {"name": "ippr", "sentiment": "none"}, {"name": "liverpool", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Plea to Theresa May to bring £2bn science fund to the North East Leading think tank says research cash can boost the North East as Government announces £1bn funding Share Prime Minister Theresa May speaking to the Confederation of British Industry (CBI) annual conference in London (Photo: Jonathan Brady/PA Wire) Share   \nPrime Minister Theresa May has announced an extra £2 billion-a-year for research in fields such as artificial intelligence, robotics and biotechnology, as part of the Government’s “industrial strategy”. \nMinisters believe the strategy, overseen by business secretary Greg Clark, is designed to help grow the economy and create jobs in every region of the country. \nIn her first speech to the CBI Annual Conference, Mrs May launched what she called the Industrial Strategy Challenge Fund to boost research and development in fields where the UK has the potential to become a global leader. \nAnd she announced a review of tax incentives for research and development. \nShe said: “Britain has firms and researchers leading in some of the most exciting fields of human discovery. We need to back them and turn research strengths into commercial success.” \nThe Government will launch a consultation on how the fund can best support emerging fields such as robotics and artificial intelligence, industrial biotechnology and medical technology, satellites, advanced materials manufacturing and other areas where the UK has a proven scientific strength and there is a significant economic opportunity for commercialisation. \nBut think tank IPPR North has urged ministers to ensure at least a fifth of research funding goes to the north of England. \nIt says that investment in life sciences, such as the Institute for Ageing at Newcastle University , can help close the North-South economic divide, and improve health in the north. Newcastle University campus \nAn IIPR report published today says the North has a thriving life sciences and health sector, employing almost 600,000 people. \nFor instance, the North East is a world-leading hub for ageing and innovation while the North West combines Manchester’s cancer research, Liverpool’s school of tropical medicine, and Cheshire’s innovative private sector. Read More Newcastle Science Central shortlisted for top national award \nLuke Raikes, senior research fellow at IPPR North, said: “The health sciences sector is a true northern asset. Its innovation will help close the North-South health gap and grow the northern economy. This is even more important as we move toward Brexit. \n“The government should take note of the level of private sector investment in the North, and use a fifth of its research pot to give the North the catch-up cash it needs.” Chancellor Philip Hammond (Photo: Chris Radburn/PA Wire) \nChancellor Philip Hammond is also set to announce more than £1 billion of investment to provide super-fast broadband services to millions of people. \nAt least two million more homes and businesses could get access to gold standard ‘full-fibre’ broadband, which has the capacity to reach speeds of more than 1Gbps. \nTo put this into perspective, this speed could allow users to download an entire series of Game of Thrones in less than a minute. \nThe Chancellor is expected to announce in the Autumn Statement hat the Government is investing £400 million into a new Digital Infrastructure Investment Fund to boost commercial finance for emerging fibre broadband providers looking to scale up. \nThe UK is already a world leader in superfast broadband coverage, but the country is falling behind on the rollout of full-fibre. Only 2% of the country’s premises currently have access to full-fibre connections. \nIn addition, the Chancellor is expected to announce funding for further rollout of fibre broadband networks, in partnership with local areas across the UK. \nAnd he will announce new programme of 5G trials, giving faster data services for mobile phones. Read More", "external_links": [], "published": "2016-11-22T12:00:00.000+02:00", "crawled": "2016-11-22T07:34:20.196+02:00", "highlightTitle": ""}