{"organizations": [], "uuid": "d639c46f324c3eca27cb0c8eed6378e6ec848593", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12241933.ece/ALTERNATES/s1200/HSR_NEC_290316Virgin_06.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/virgin-money-ceo-jayne-anne-12241911", "country": "GB", "domain_rank": 21960, "title": "Virgin Money CEO Jayne-Anne Gadhia appointed to national business advisory board", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Virgin Money CEO Jayne-Anne Gadhia appointed to national business advisory board", "spam_score": 0.0, "site_type": "news", "published": "2016-11-28T23:00:00.000+02:00", "replies_count": 0, "uuid": "d639c46f324c3eca27cb0c8eed6378e6ec848593"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/virgin-money-ceo-jayne-anne-12241911", "ord_in_thread": 0, "title": "Virgin Money CEO Jayne-Anne Gadhia appointed to national business advisory board", "locations": [], "entities": {"persons": [{"name": "jayne-anne gadhia", "sentiment": "negative"}, {"name": "nicola mendelsohn", "sentiment": "none"}, {"name": "nikhil rathi", "sentiment": "none"}, {"name": "mrs gadhia", "sentiment": "none"}, {"name": "patisserie valerie", "sentiment": "none"}, {"name": "paul may", "sentiment": "none"}, {"name": "khan", "sentiment": "none"}, {"name": "sadiq khan", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "european union", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}, {"name": "european economic area", "sentiment": "none"}, {"name": "emea of facebook", "sentiment": "none"}, {"name": "london stock exchange group", "sentiment": "none"}, {"name": "virgin money", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "bloomberg", "sentiment": "none"}, {"name": "business advisory board", "sentiment": "none"}, {"name": "london stock exchange", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Virgin Money Chief Executive Jayne-Anne Gadhia Share Get business   Thank you for subscribing!   \nThe leader of North East challenger bank Virgin Money is among a raft of high-flying executives appointed by the Mayor of London to a new business advisory group. \nJayne-Anne Gadhia, chief executive of Virgin Money, joins a line-up including Nicola Mendelsohn, vice president EMEA of Facebook , and Paul May, chief executive of cake chain Patisserie Valerie, on the group which has been formed to help shield the capital’s economy from the impact of Brexit. \nSadiq Khan has called on bosses from the world of technology, finance and retail to outline fresh ideas for driving growth amid fears that London could endure economic upheaval if Britain leaves the European single market. \nMr Khan said he had handed 10 of the 16 roles to women to challenge the under-representation of businesswomen in senior positions. \nMrs Gadhia’s appointment also comes less than a month after she was appointed by the Treasury as an official Women in Finance Champion, in the drive to tackle gender inequality in the workplace. \nSpeaking at Bloomberg’s UK investment summit, he said: “My high-quality Business Advisory Board will bring great insight, innovation and creativity to bear on developing ideas that increase our competitiveness and prosperity, and spread the opportunity that brings to all Londoners. \n“London business is still coming to terms with the recent vote to leave the European Union and I am looking forward to working with the Business Advisory Board to strengthen London’s shield against the expected blows from Brexit and to seize the opportunities to show how London is open to jobs, growth and investment.” \nThere have been mounting fears that London’s status as a global financial centre could be diminished in the wake of Brexit if firms shift operations to rival cities to maintain close trading ties with Europe. \nIndustry concerns have centred on whether London’s heavyweight financial firms will continue to have access to the bank passporting system, which allows them to sell their products to any country within the European Economic Area. Read More Sports Direct to be probed by financial reporting watchdog \nAccording to TheCityUK, a so-called “hard Brexit” - where Britain leaves the single market in order to take a tighter grip on immigration - could cost the City of London 75,000 jobs. \nNikhil Rathi, chief executive of the London Stock Exchange, said: “Being at the heart of London’s financial community, London Stock Exchange Group is committed to supporting access to funding for British and international entrepreneurs and businesses. \n“I look forward to being part of the mayor’s Business Advisory Board, as it champions London’s vibrant business and entrepreneurial community, supporting London’s status as a world leading global financial centre and a dynamic place to do business.” \nThe Business Advisory Board will meet four times a year, with Mr Khan chairing the sessions. Like us on Facebook", "external_links": [], "published": "2016-11-28T23:00:00.000+02:00", "crawled": "2016-11-28T19:58:36.702+02:00", "highlightTitle": ""}