{"organizations": [], "uuid": "ad0f851631f2958a298651ae1d1e32a120d1a32e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12147003.ece/ALTERNATES/s1200/HGR_NEC_081116profjpeg.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/hillary-should-win-comfortably--12146978", "country": "GB", "domain_rank": 21960, "title": "'Hillary should win comfortably — but nothing is certain' says Northumbria University US expert", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "'Hillary should win comfortably — but nothing is certain' says Northumbria University US expert", "spam_score": 0.0, "site_type": "news", "published": "2016-11-09T00:11:00.000+02:00", "replies_count": 0, "uuid": "ad0f851631f2958a298651ae1d1e32a120d1a32e"}, "author": "Hannah Graham", "url": "http://www.chroniclelive.co.uk/news/north-east-news/hillary-should-win-comfortably--12146978", "ord_in_thread": 0, "title": "'Hillary should win comfortably — but nothing is certain' says Northumbria University US expert", "locations": [], "entities": {"persons": [{"name": "hillary", "sentiment": "negative"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "prof cullinane", "sentiment": "none"}, {"name": "prof culliane", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "hilary clinton", "sentiment": "none"}, {"name": "michael cullinane", "sentiment": "none"}, {"name": "cullinane", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "north east of england", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "new jersey", "sentiment": "none"}], "organizations": [{"name": "northumbria university", "sentiment": "negative"}, {"name": "pa wire", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "'Hillary should win comfortably — but nothing is certain' says Northumbria University US expert Professor Michael Cullinane, reader in US history at Northumbria University, gives his view on the upcoming result Share Click to play Tap to play The video will start in 8 Cancel Play now Get   Thank you for subscribing!   \nA Northumbria University expert says he’s ‘pretty sure’ Hillary Clinton will win a comfortable victory in tonight’s US election — but with the shock of Brexit still on his mind, nothing is certain. \nProfessor Michael Cullinane has both an academic and a personal interest in the election result. \nA reader in US History at Northumbria University, he’s also an American citizen, originally from New Jersey. \nHe’ll be staying up late to watch the results roll in, and says it will be a nerve-wracking wait. \nHe said: “It’s been two years in the making, if not longer — Hilary Clinton declared her candidacy 27 months ago — so I’m relieved in some ways that it’s over. \n“And in some ways, I’m also terrified. The thought of having someone like Donald Trump as President is terrifying.” Hillary Clinton and Donald Trump, as one of the most divisive and bitterly fought elections in modern American history nears its climax (Photo: PA Wire) \nHe doesn’t think that’s likely to happen — but in 2016, it seems anything is possible. \nHe said: “I think Hillary is going to win by a sizeable margin. \n“The way the electoral college system is means she has a huge advantage. \n“But I remember staying up to watch the Brexit result — I couldn’t believe what I was seeing as it was happening. \n“That could happen again — I don’t think it will, but I don’t want to say for certain.” \nThe rise of Trump, seen for a long time as the anti-candidate, the outsider, has been a shock to many. \nProf Cullinane said: “It’s been a big surprise for everyone, the most common reaction you hear is ‘I didn’t think it would go on this long.’ \n“But on reflection, you can see some of where this came from, and how we got here. \n“This sort of rhetoric, this ‘post-truth politics’, it’s a global phenomenon, you’ve seen that in the UK with the EU referendum as well. \n“There was that elusive £350m figure that was supposed to go to the NHS — everyone knew that wasn’t quite right, but it didn’t seem to matter.” Read More US Election 2016 LIVE: Updates as voters chose Donald Trump or Hillary Clinton as next American president \nAccording to Prof Cullinane, Trump’s supporters don’t really care whether or not what he says is true — they’ll still vote for him, and his emotive rhetoric, picking their hearts over their brains. \nAll this means that if Trump were to pull off a surprise victory, it’s hard to predict what impact that would have, either on America or the rest of the world, because it’s hard to pin down exactly what the Republican candidate plans to do. \n“The biggest problem we have there is an absence of detail, we don’t really know what he stands for,” Prof Cullinane said. \n“A lot of the rhetoric he uses, the emotive language which appeal to people, doesn’t line up with any actual policy. \n“So when he talks about establishing new trade links with the UK, there’s really no clear idea of what that would look like.” \nProf Cullinane believes that Trump’s appeal, and the huge success of the leave campaign in the UK. have similar origins, and that they’re both rooted in this ‘post-truth politics’. \nHe said: “There is a group of people in America, and in Britain, that was left behind after the economic crisis in 2008. \n“They are frustrated, this group feels like they are being overlooked. They don’t trust experts, or the establishment, anymore. \n“In the states, these are mostly young, unskilled white men, and I don’t think it’s that different in the UK.” \nThis lack of faith in the usual order may have its closest origins in the crash of 2008, but Prof Culliane says it can be traced back a little further, towards the 80s and 90s. \nThen, the experience in the North East of England mirrored that in much of America, when traditional ‘blue collar’, skilled, industrial and manufacturing jobs were lost, replaced with a focus in both countries on the service industry. \nIn the American mind, the democratic candidate is particularly tied to this difficult time, as her husband was President through much of it. Share", "external_links": [], "published": "2016-11-09T00:11:00.000+02:00", "crawled": "2016-11-08T19:40:43.093+02:00", "highlightTitle": ""}