{"organizations": [], "uuid": "196ce032e42e00060ed274417529bb2d0dc8a0bd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12194385.ece/ALTERNATES/s1200/JS105282764.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/business-breakfast-live-tyneside-development-12188872", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast RECAP: Tyneside development creates 300 jobs, plus latest news", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast RECAP: Tyneside development creates 300 jobs, plus latest news", "spam_score": 0.0, "site_type": "news", "published": "2016-11-18T15:20:00.000+02:00", "replies_count": 0, "uuid": "196ce032e42e00060ed274417529bb2d0dc8a0bd"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/business-breakfast-live-tyneside-development-12188872", "ord_in_thread": 0, "title": "Business Breakfast RECAP: Tyneside development creates 300 jobs, plus latest news", "locations": [], "entities": {"persons": [{"name": "nicky atkinson", "sentiment": "none"}, {"name": "david mcnew/getty", "sentiment": "none"}, {"name": "dalata", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "eric dodd", "sentiment": "none"}, {"name": "marc carter", "sentiment": "none"}, {"name": "carter", "sentiment": "none"}, {"name": "kate lampard", "sentiment": "none"}, {"name": "karen grant", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "sarah scott", "sentiment": "none"}, {"name": "marc", "sentiment": "none"}, {"name": "coreena ford", "sentiment": "none"}, {"name": "joe garner", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "mcaleer", "sentiment": "none"}, {"name": "tommee tippee", "sentiment": "none"}, {"name": "alan harkness", "sentiment": "none"}, {"name": "neil milburn", "sentiment": "none"}, {"name": "nigel farage", "sentiment": "none"}, {"name": "clayton", "sentiment": "none"}, {"name": "barratt share", "sentiment": "none"}, {"name": "graeme whitfield", "sentiment": "none"}, {"name": "ben", "sentiment": "none"}, {"name": "rushe", "sentiment": "none"}, {"name": "hillary", "sentiment": "none"}, {"name": "barratt", "sentiment": "none"}, {"name": "sintons", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "dalata", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "maldron hotel", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "maldron", "sentiment": "none"}, {"name": "clayton street", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "tommee tippee", "sentiment": "none"}, {"name": "baker perkins", "sentiment": "none"}, {"name": "cardiff", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "cramlington", "sentiment": "none"}, {"name": "tyneside", "sentiment": "none"}, {"name": "hebburn", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}, {"name": "south tyneside", "sentiment": "none"}, {"name": "barratt", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}], "organizations": [{"name": "bedewell court", "sentiment": "none"}, {"name": "wm coulthard", "sentiment": "none"}, {"name": "tees valley catalyst fund", "sentiment": "none"}, {"name": "coreena ford northumberland", "sentiment": "none"}, {"name": "newgate shopping centre", "sentiment": "none"}, {"name": "coreena ford gambling", "sentiment": "none"}, {"name": "newgate centre", "sentiment": "none"}, {"name": "tommee tippee", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "bank of england", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "maldron hotel", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "unite group plc", "sentiment": "none"}, {"name": "barratt homes north east", "sentiment": "none"}, {"name": "responsible gambling trust", "sentiment": "none"}, {"name": "dalata hotel group", "sentiment": "none"}, {"name": "coreena ford nationwide", "sentiment": "none"}, {"name": "wm coulthard", "sentiment": "none"}, {"name": "barclays", "sentiment": "none"}, {"name": "fw capital", "sentiment": "none"}, {"name": "barratt", "sentiment": "none"}, {"name": "sintons", "sentiment": "none"}, {"name": "dalata group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Happy Friday folks....see you back here in just over a week. 9.23 Coreena Ford The big cities voted for Hillary and vote for Labour: it's the towns that don't \nRecent election results in both America and the UK tell us something interesting (I think) about cities, writes Business Editor Graeme Whitfield. \nIt surprised me to learn, for example, that Hillary Clinton won the vote in nine of the 10 largest cities in the US, some of them by a pretty large margin. \nA similar pattern can be seen here, where Labour holds power in London, Birmingham, Manchester and all of the major cities of England, but is, by most estimations, unlikely to take power on a national level any time soon. \nOn one level this tells us something fairly simple: lots of people might live in our big cities, but lots more people don’t. The combined population of smaller towns is a lot bigger than many of us imagine. \nWhat it also reveals is the big differences between the population of our big cities and people in other parts of the country. Donald Trump (and here, Nigel Farage in the EU referendum) have exploited this difference by harnessing a backlash against what they often call the “metropolitan elite”. \nNow if Trump and Farage are against the metropolitan elite, I pretty much want to be part of it. \nBut there is a paradox here, in which those left-leaning people in big cities are often the most opposed to inequality, and yet they are probably the ones benefiting most from the inequalities in our economic system. \nThat paradox is pretty evident in the North East. Walk around Newcastle city centre and you are in a modern, cosmopolitan city. There are cranes on the skyline marking new developments, people sit at pavement cafes drinking overpriced coffee and there is a thriving professional services sector. \nBut you only need to drive a mile or two in either direction to find communities where the economic picture is entirely different. Life in the former coalfield communities in both Northumberland and County Durham is still pretty tough. \nMy guess is that it is people in places like this who turned their back on Labour at the EU referendum, while similar communities in the US voted for Trump. \nThat is a major challenge for the Democrats, Labour and those who back a more progressive agenda, but it is also a major challenge for those who want a more united country. Thousands of protesters march in reaction to the upset election of Republican Donald Trump over Democrat Hillary Clinton in the race for President of the United States (Photo: David McNew/Getty Images) 9.08 Coreena Ford Gambling industry urged to support services for problem punters \nA charity has called on all organisations that profit from gambling to help fund support services for problem punters after figures showed just 3% are receiving help. \nGambleAware, formerly known as the Responsible Gambling Trust, said advertisers, lotteries and professional sports clubs as well as the industry itself should contribute to research, education and treatment services. \nThe total number of problem gamblers in the UK is estimated at around 250,000, but figures suggest the national network of providers who treat them are only reaching 3% of these, the charity said. \nThe charity raised £7.6m over the last year and received donations from more than 80% of British-licensed gambling operators. But it said an industry-wide contribution of 0.1% of gross gambling yield would amount to around £11m, and it would be “working hard to encourage other sectors” such as professional sports and media to support its work financially. \nFigures suggested the rates of problem gambling had remained broadly stable, and low as a percentage, in spite of the continued growth of the gambling industry, extensive advertising and easier access, particularly through mobile technology. \nHowever the low level of problem gambling across the population masked much higher levels among those who gamble regularly, and within particularly vulnerable groups such as the homeless, ex-military and those in the criminal justice system. \nThe charity’s new chairwoman of trustees, Kate Lampard, said: “Our number one priority is protecting the vulnerable. The most important thing to us is to be able to provide treatment, preventative education and research to minimise the harm caused by gambling. “Our new strategy makes clear that we hope to work with the gambling industry but we are prepared, when necessary, to challenge the industry in pursuit of our objectives.” 9.00 Irish hotel operators opening new venue in Newcastle \nIn case you missed it, this is currently our most-read business tale. \nHotel group Dalata is opening its first hotel under the Maldron brand outside of Ireland in Newcastle - and it will be open within two years. \nWork has started on flattening the former Newgate Shopping Centre in a far-reaching scheme to replace it with a multi-million pound student flats, hotel and shopping scheme. \nNow it has emerged that Dalata Hotel Group – Ireland’s largest hotel operator – is set to open a luxury Maldron hotel at the site, its first under the brand in the UK. \nDalata has signed a 35-year lease with McAleer and Rushe, the Northern Ireland-based developerleading the project, for a new four-star Maldron Hotel, their eighth under the upmarket brand. \nThe 100,000 sqft, six-storey hotel will be developed by McAleer and Rushe, which has worked closely with Dalata on a wide range of projects throughout the UK and Ireland. \nIt is believed at least 100 jobs will be created once the hotel is complete. \nThe hotel, which is expected to open in summer 2018, will have 226 air-conditioned bedrooms, a bar, restaurant and business centre facilities. \nAlongside the flagship hotel, the redevelopment of the former Newgate Centre comprises 185,000 sqft of student accommodation operated by the Unite Group Plc to deliver 575 beds, as well as 20,000 sqft of modern retail and leisure space. \nIncidentally, the Dalata Group also own and operate the Clayton hotel brand - and several are in operation around the UK, including the Cardiff hotel which converted from Maldron to Clayton. With the hotel being built on the corner of Clayton Street in Newcastle maybe opening under the Clayton name would have seemed too obvious? \nEither way it’s great to have a new entrant heading to the region - and later this morning I’m getting some photos to show what it will look like. A CGI of how the Maldron Hotel will look in Newcastle 8.51 KEY EVENT Tommee Tippee's cup search comes to the rescue for other families \nThe search for a specific “little blue cup” for a severely autistic boy has led to Northumberland company Tommee Tippee coming to the aid of several families in similar predicaments. \nThe Cramlington firm joined a global search for one of its products after Marc Carter, the father of autistic teenager Ben, posted an appeal on Twitter in a bid to track some replacements down. \nMr Carter said his son Ben would only drink out of the two-handled blue cup, which is no longer manufactured by Tommee Tippee, and his plea went viral. \nThe search was buoyed by Tommee Tippee’s 614,000 followers on Facebook and another 20,000 on Twitter . Their use of the #CupForBen hashtag brought thousands of responses from as far away as Australia. \nOverwhelmed by the response, Tommee Tippee stepped in to help Mr Carter by tasking its social media team to field responses from people who think they have a cup to send to Ben. \nThe team is monitoring numerous posts on Twitter, as well as hundreds of messages posed on their own Facebook page. \nThey have been directing anyone who thinks they have the exact blue cup to contact them directly and, after cross-checking photos sent in, are arranging for the cups to be sent to the Carter family through a freepost address. \nAnd in the course of its search, the team has unearthed other old models of Tommee Tippee cups, which can be sent to other families who are in similar situations. \nWe asked Tommee Tippee how the search has been going and Sarah Scott, global head of consumer experience said the team has so far responded to 300 messages - and counting, by all accounts. \nShe said: \nOur Tommee Tippee social media team has been very busy responding to over 300 messages on Twitter and Facebook since we offered to help Marc. \nLots of people have offered to send Ben cups they’ve found in their cupboards and that’s great news. \nBut we know it has to be the exact cup, so we’ve been asking people to DM us with photos of their cups and if it looks like they have the right one, we’ve arranged for them to send their cups to us here at Tommee Tippee. \nOnce all the cups arrive, we’ll check them ourselves to make sure they’re definitely the right ones and we’ll send them all in a parcel to Ben. \nWe know Marc and his family have been overwhelmed with the response on social media and appreciate the great support they’ve received, so we’ll post an update on Twitter and Facebook next week to let everyone know how many cups are on their way. \nOn our thorough search for Ben’s cup, we have come across all different types of older cups. We’ll be happy to offer the same freepost service. Sarah Scott, global head of consumer experience 8.44 Coreena Ford Northumberland company WM Coulthard wins contracts \nOne of the North East’s longest-established firms has won a number of key contracts after help from a regional loan guarantee scheme. \nWm Coulthard, which was founded in 1888, has just repaid a six-figure advanced payment guarantee loan from the Tees Valley Catalyst Fund, managed by FW Capital, which allowed it to successfully bid on three contracts worth more than £2.2m and safeguard jobs at its base in Cramlington, Northumberland. \nThe company designs and manufactures bespoke industrial lubrication systems for a variety of clients. \nManaging director Eric Dodd said: “Thanks to FW Capital, we were able to secure a number of high profile contracts. \n“The boost given by the Tees Valley Catalyst Fund loan helped us win these contracts, which were for leading international customers supplying rotary equipment to the oil and gas industry. This has safeguarded a number of jobs in 2015-16.” \nFW Capital investment executive Nicky Atkinson, who brokered the deal, said: “Wm Coulthard is a well-established company with ambitious growth plans. They had a great business plan and successfully tendered for three substantial contracts with our assistance.” \nThe £10m Tees Valley Catalyst Fund offers short term investments of between £100,000 and £2m to North East businesses to fund warranty bonds, performance bonds and advanced payment guarantees. (from left) Eric Dodd, Karen Grant from Barclays and FW Capital’s Nicky Atkinson 8.38 Coreena Ford FTSE and pound latest \nThe pound at 8am was 1.2399 dollars compared to 1.2448 dollars at the previous close. The euro at 8am was 0.8549 pounds compared to 0.8556 pounds at the previous close. \nThe FTSE-100 index at 8:15am was down 13.06 at 6781.65. 8.36 Coreena Ford Nationwide profits slump following interest rate changes \nNationwide has seen profits slip 13% as it grapples with low interest rates and its decision to pass on the base rate cut to its members. \nThe building society said statutory pre-tax profits hit £696m in the six months to September 30, down from £802m over the same period last year. \nHowever, it said trading was “strong” for the half-year, with gross mortgage lending jumping 17% to £17.5m. \nChief executive Joe Garner, who took the top job in April, said: “We have made a number of pledges to help our savers and borrowers. \n“These include protecting selected savings rates to minimise the impact of the base rate change and helping our members with variable rate mortgages by passing on the base rate decrease in full. \n“These conscious decisions and those taken over recent years have contributed to a reduction in profits in the first half of the year in line with expectations, demonstrating our commitment to putting members’ interests at the heart of everything we do.” \nNet mortgage lending notched up its “best ever” performance, rising 46% to £6bn over the period, while the number of current accounts opened climbed 36% to a record high of 377,000. \nHowever, total underlying income also edged lower, dropping 2% to £1.642bn for the half year from £1.683bn in 2015. \nOn Brexit, it said demand and supply in the housing market was “well-matched”, but there had been a modest slowdown in activity since the EU referendum on June 23. \nIt said the “less certain economic outlook may soften demand but prices will continue to be supported by low interest rates and limited supply of new homes”. The Bank of England kept interest rates on hold at 0.25% in November after cutting them from 0.5% in August. A Nationwide branch KEY EVENT Jobs boost as Tyneside residential development gets under way \nWork is starting on a new residential development on South Tyneside by housebuilder Barratt which will create or sustain more than 300 jobs. \nConstruction work is starting on Bedewell Court in Hebburn, a significant scheme which will contribute a predicted £100m to the local economy. \nThe 20-acre site will be transformed over the coming weeks as the project gets underway to create 335 new homes , set to be built over the next six years. Infrastructure work is now well underway to allow the scheme to progress. \nThe development, on a reclaimed former industrial site which was once home to the town’s Baker Perkins factory, is the Newcastle division of housebuilder Barratt’s first site in its native North East to use its 2016 house styles. \nThe firm has calculated that Bedewell Court will inject investment of around £100m into South Tyneside - £40m directly and around £60m indirectly – and the scheme will also sustain or help create around 335 jobs. \nAlthough the properties have not yet been marketed, Barratt said it has already seen “very significant” levels of interest in Bedewell Court, which features the new design of house types developed as a result of customer feedback. \nLaw firm Sintons handled the site acquisition on behalf of Barratt, with development specialist Alan Harkness leading the work. \nNeil Milburn, development director at Barratt Homes North East, said: “We have worked closely with South Tyneside Council for many months on the planning and development of Bedewell Court, and now we are almost ready for construction work to begin on site. \n“This is a very sizeable development and a significant one for South Tyneside, bringing new life to a site which has so much industrial heritage. It will contribute significantly to the local economy in terms of both investment and jobs. \n“The new homes market is currently very good, and interest in Bedewell Court has been high even before we have begun marketing the site, so there are strong indications that this will be another successful Barratt development. \nAlan Harkness, consultant in the real estate team at Newcastle-based Sintons, said: “This is a very exciting new residential scheme for South Tyneside, which not only regenerates a huge site which has lain derelict for some years, but also brings significant new investment to the area.” Alan Harkness of Sintons with Neil Milburn of Barratt Share", "external_links": [], "published": "2016-11-18T15:20:00.000+02:00", "crawled": "2016-11-18T12:04:16.964+02:00", "highlightTitle": ""}