{"organizations": [], "uuid": "0a4b1775c8f03ae761b3f87646b80d709b56c03e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12131919.ece/ALTERNATES/s1200/EU-referendum.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/dumping-brexit-would-keep-lights-12131910", "country": "GB", "domain_rank": 21960, "title": "Why dumping Brexit would keep the lights on in Britain", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Why dumping Brexit would keep the lights on in Britain", "spam_score": 0.0, "site_type": "news", "published": "2016-11-05T23:00:00.000+02:00", "replies_count": 0, "uuid": "0a4b1775c8f03ae761b3f87646b80d709b56c03e"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/dumping-brexit-would-keep-lights-12131910", "ord_in_thread": 0, "title": "Why dumping Brexit would keep the lights on in Britain", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "negative"}, {"name": "churchill", "sentiment": "none"}, {"name": "wikileaks", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "john thomas", "sentiment": "none"}, {"name": "abu hamza", "sentiment": "none"}, {"name": "terence etherton", "sentiment": "none"}, {"name": "nigel farage", "sentiment": "none"}, {"name": "gina miller", "sentiment": "none"}, {"name": "paul mccartney/heather mills", "sentiment": "none"}, {"name": "dominic lipinski/pa wire", "sentiment": "none"}, {"name": "julian assange", "sentiment": "none"}, {"name": "daniel", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "strasbourg", "sentiment": "none"}, {"name": "moscow", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "afghanistan", "sentiment": "none"}, {"name": "great britain", "sentiment": "none"}, {"name": "sweden", "sentiment": "none"}], "organizations": [{"name": "britain high court", "sentiment": "negative"}, {"name": "european union", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "daily express", "sentiment": "none"}, {"name": "daily mail", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Why dumping Brexit would keep the lights on in Britain High Court ruling has sparked such outrage it could become a renewable energy source Share A European Union flag in front of Big Ben (Photo: Daniel Leal-Olivas/PA Wire) Share Get daily   \nIf only we could call off Brexit there’d be no need for a new nuclear power plant built by the French and financed by the Chinese to keep the lights on in the newly sovereign Great Britain. \nThere has been so much hot air and poisonous fumes emitted from the anti-EU brigade who wanted to reclaim our country, we could redirect the foreign financed shale gas gatherers coming to a country idyll near you soon to instead stick their probes up the backsides of the Brexiteers to tap into an energy source that renews with each perceived slight of the Liberal Metropolitan elite. \nThink of it as an enema of the people. \nIt was the usual suspects who lined up to slam the High Court judges who ruled that article 50 can only be triggered to officially start the process of leaving the EU after a parliamentary debate. \nThey did not say there should be no Brexit, nor that the June 23 referendum vote was invalid, neither did they ask for Nigel Farage to abandon his place next to Donald Trump on the US presidential campaign trail to return to the UK to lambast foreigners for interfering in British politics. \nBut all are the end result of the wilful misinterpretation of the decision which has resulted in a tsunami of bile. To give a flavour... \nThis from the Daily Express: “Today this country faces a crisis as grave as anything since the dark days when Churchill vowed we would fight them on the beaches”. Gina Miller speaks to the media (Photo: Dominic Lipinski/PA Wire) \nThis from the Daily Mail describing the judges: “Enemies of the people”. \nThe Mail also told us one of the judges - Master of the Rolls, Sir Terence Etherton - was ‘openly gay’ and a fencing champ who qualified to represent GB at the 1980s Moscow Olympics but boycotted it because of Russian’s invasion of Afghanistan (the swine!). \nThen there’s the head of the panel, Lord Chief Justice John Thomas. Apparently, say the Mail, he has spoken out in favour of Parliament’s right to decide which crimes were so serious an offender should never go free – and criticised Strasbourg judges for saying such sentences breached the European Convention on Human Rights. \nAnd as a High Court judge, he refused Wikileaks head Julian Assange’s appeal against extradition to Sweden and radical cleric Abu Hamza’s attempt to avoid extradition to the US. Read More Does Brexit legal challenge mean we stay in the EU and will there be an early general election? \nEnemy of the people? Really? \nAll that’s happened is that instead of article 50 being triggered by Prime Minister Theresa May using the Royal prerogative which comes to her via our unelected Queen, parliament, which was elected, gets to debate it. \nThe UK voted to leave the EU, that’s not in dispute. It’s the technical part that follows which, as anyone who has ever gone through a divorce, is far from straightforward and will be very painful. \nAnd it seems the Brexit break up will make the Paul McCartney/Heather Mills split look like a love-in. Share", "external_links": [], "published": "2016-11-05T23:00:00.000+02:00", "crawled": "2016-11-05T18:25:57.633+02:00", "highlightTitle": ""}