{"organizations": [], "uuid": "12b0a0ac4742367d52c33dc6570a6b1a83291ebe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12125356.ece/ALTERNATES/s1200/JS104111170.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/business-breakfast-live-dyson-university-12120267", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Billionaire Dyson inventor to open skills university, plus latest news", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast LIVE: Billionaire Dyson inventor to open skills university, plus latest news", "spam_score": 0.0, "site_type": "news", "published": "2016-11-04T15:20:00.000+02:00", "replies_count": 0, "uuid": "12b0a0ac4742367d52c33dc6570a6b1a83291ebe"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/business-breakfast-live-dyson-university-12120267", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Billionaire Dyson inventor to open skills university, plus latest news", "locations": [], "entities": {"persons": [{"name": "dyson", "sentiment": "negative"}, {"name": "richard davies", "sentiment": "none"}, {"name": "robert cornell", "sentiment": "none"}, {"name": "breon corcoran", "sentiment": "none"}, {"name": "barry ross", "sentiment": "none"}, {"name": "macwhirter", "sentiment": "none"}, {"name": "mr cornell", "sentiment": "none"}, {"name": "james dyson", "sentiment": "none"}, {"name": "john macwhirter", "sentiment": "none"}, {"name": "richard", "sentiment": "none"}, {"name": "nick forbes", "sentiment": "none"}, {"name": "berger", "sentiment": "none"}, {"name": "graeme whitfield", "sentiment": "none"}, {"name": "kenichi ohmae", "sentiment": "none"}, {"name": "bill hartshorne", "sentiment": "none"}, {"name": "matt", "sentiment": "none"}, {"name": "richard swart", "sentiment": "none"}, {"name": "matt boyle", "sentiment": "none"}, {"name": "nigel king", "sentiment": "none"}, {"name": "jane siddle", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "amble", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "ashington", "sentiment": "none"}, {"name": "north east england", "sentiment": "none"}, {"name": "great britain", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "tedco", "sentiment": "none"}, {"name": "paddy power betfair", "sentiment": "none"}, {"name": "skills group", "sentiment": "none"}, {"name": "university’s urban sciences building", "sentiment": "none"}, {"name": "satcom ltd", "sentiment": "none"}, {"name": "chamber of commerce", "sentiment": "none"}, {"name": "newcastle university", "sentiment": "none"}, {"name": "local government chronicle", "sentiment": "none"}, {"name": "coreena ford paddy power betfair", "sentiment": "none"}, {"name": "coreena ford newcastle", "sentiment": "none"}, {"name": "newcastle science central", "sentiment": "none"}, {"name": "paddy power", "sentiment": "none"}, {"name": "betfair", "sentiment": "none"}, {"name": "leda transport", "sentiment": "none"}, {"name": "north east automotive alliance", "sentiment": "none"}, {"name": "a-belco group", "sentiment": "none"}, {"name": "newcastle science central 8.47 coreena ford", "sentiment": "none"}, {"name": "coreena ford", "sentiment": "none"}, {"name": "newcastle laboratory", "sentiment": "none"}, {"name": "general capital", "sentiment": "none"}, {"name": "crest photography", "sentiment": "none"}, {"name": "berger group europe", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "questuav ltd", "sentiment": "none"}, {"name": "former armed forces", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}, {"name": "newcastle city council", "sentiment": "none"}, {"name": "school of computing science", "sentiment": "none"}, {"name": "two newcastle", "sentiment": "none"}, {"name": "leda transport solutions", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KEY EVENT North East manufacturing bosses awarded Top 100 status \nMore award news now - and two of the region’ inspiring company bosses are among the top 100 manufacturing leaders in the country, having been nominated for awards by peers in their industry. \nRichard Swart, global sales director and UK managing director of Berger Group Europe, which has a base in Durham, and Matt Boyle, who is president and CEO of Gateshead-based low carbon innovators Sevcon, have been named in The Manufacturer’s Top 100 report. \nSouth African-born Richard has supported the global export ambitions of hundreds of businesses and is a committed ambassador for his adopted North East. He is chairman of international trade with the North East England Chamber of Commerce and has been instrumental in improving the fortunes of German-owned stock-listed Berger. \nMatt, meanwhile, joined Sevcon in 1996 as chief operating officer and was made CEO a year later. The Gateshead company designs and manufactures high quality motor controllers and system components for all kinds of hybrid and electric vehicles with partners ranging from super car makers to fork lift truck, bus and electric motorcycle manufacturers. The company is also a founder member of the North East Automotive Alliance and Matt is chairman of its Skills Group. \nRichard said: \nThe challenge for UK manufacturing and the country as a whole is immense given the pending Brexit negotiations and it is vital that businesses use whatever limited influence they may have to strive for the best possible outcome, ensuring also that Great Britain remains great, and the United Kingdom remains united. \nMatt said: \nThis award is testament to the efforts of the Sevcon team. We’re a business with a proud history of innovation and manufacturing excellence. Our focus is fixed firmly on the future and the global electrification transition. We are at the forefront of this ongoing shift from the internal combustion engine to electric vehicles and our exciting future plans aim to ensure we maintain our market-leading position. Matt Boyle, President and Chief Executive Officer of the electric vehicle control manufacturer Sevcon 9.16 Coreena Ford The Goverment's deal with Nissan is great... but let's find out what it means \nJournal business editor Graeme Whitfield has pondering why it is right that people keep asking questions on the Government’s deal with Nissan, in his column this week. \nHe says: \nWhen you are very big and very successful – and I say this despite being neither – people tend to watch what you do very closely. \nGiven the choice, I dare say Nissan would probably prefer to get on with making cars and creating jobs in the North East, both of which it is rather good at. \nBut being very big and very successful, people are interested in everything Nissan does and its decision to produce two new models at Sunderland is inevitably being placed under the microscope. \nThere has been much discussion about what the Government did to ease Nissan’s concerns about the UK leaving the EU , and now there a backlash again that discussion which goes something along the lines of: “Why can’t we just be happy?” \nWhile I understand that frustration, and that it must be vexing for Nissan to be dragged into political discussions with every decision it makes, the notion that we should just celebrate the Nissan announcement and not ask what it means for the rest of the economy is surely nitwitted. \nKenichi Ohmae, who helped bring Nissan to Sunderland in the 1980s, is probably overstating matters when he describes last week’s announcement as a “very very minor one-company decision.” \nBut it is certainly right that Nissan is just one company, and that hundreds of other firms will want to know what help they might also get to ease Brexit-related concerns concerns. \nRead the full column here . Work begins on a new production line at Nissan 9.07 Coreena Ford Newcastle entrepreneurs set up inovative logistics firm \nTwo Newcastle entrepreneurs have set up a logistics firm which aims to pick up a parcel anywhere in the EU within one hour. \nJohn MacWhirter, 36, and Robert Cornell, 26, have launched LEDA Transport Solutions to compete on an international level with established delivery firms. \nAnd rather than operating a fleet of their own vehicles, they say they can pick up packages by using empty vehicles already on the road from a global network of partners. \nThe duo launched LEDA Transport after Mr MacWhirter accepted a redundancy offer from his previous employer and saw a gap in the market for affordable, reliable and fast-track delivery services for business in the North East and beyond. \nHe contacted former colleague Mr Cornell and the two took the plunge to set up the international supply and logistics firm, specialising in providing same day deliveries in the UK as well as express transports throughout Europe, including the management of hazardous or specialist materials. \nThe new venture has been helped by two business support groups in the North East and has received a Government-backed business loan from Virgin StartUp. (l-r) Robert Cornell, Bill Hartshorne from TEDCO and John MacWhirter (Photo: WWW.IANMACPHOTOS.CO.UK) 9.02 Coreena Ford Future of A-Belco Group to be decided \nThe future of an award-winning North East company will be decided in the next 24 hours as it battles to recover from debt racked up in one of its divisions. \nAshington’s A-Belco Group, which has a number of divisions operating in engineering and construction sectors, has been plunged into financial difficulties after its construction division MEP Solutions incurred large debts from a major contract in Scotland. \nThe company - which won the overall prize at the North East Exporters’ Awards in 2014 and was on the Fastest 50 list of the region’s quickest growing companies as recently as 2015 - diverted funding from other divisions to keep that contract going, but that led to the rest of the business falling into difficulties, being unable to pay key suppliers and then finding it couldn’t fulfill contracts. \nThe downward spiral will come to a head today, when the company’s shareholders either agree to re-finance the business or it is placed in administration. A-Belco, Ashington KEY EVENT Newcastle Science Central shortlisted for top award \nCongratulations to Newcastle Science Central, the 24-acre mixed-use development in the heart of Newcastle city centre, which has been shortlisted in the LGC (Local Government Chronicle) Awards. \nThe development has been recognised in the Driving Growth category, which looks at the council’s ambitions for the future of its economy and how they are working with local partners to achieve this. \nCouncillor Nick Forbes, Leader of Newcastle City Council said: \nWe’re delighted that Science Central has been recognised for such a prestigious award. The development has seen significant change over the last couple of years and to be recognised for the work done to date as well as our ambitions for the future is a great achievement. \nRecent developments include The Key, Newcastle University’s revolutionary ‘building as a lab’ which opened in February 2015, and the University’s Urban Sciences Building, which is rapidly taking shape on its construction site in preparation for housing its world-leading School of Computing Science. \nPlans are also under way for the Newcastle Laboratory, the Learning and Teaching Centre and two new office blocks, built in partnership with Legal and General Capital. \nProfessor Richard Davies, Pro-Vice-Chancellor, Engagement and Internationalisation for Newcastle University, added: \nTen years ago, Science Central was a vision – a belief that we could work together to create an exemplar of a city re-engineering itself. Bringing together academia, the public sector, communities, business and industry our aim was to create a living laboratory that would be an example for others to follow. \nA decade later and we are well on our way to achieving that vision and this nomination is testament to the hard work of everyone who has been involved in this project. The Core at Newcastle Science Central 8.47 Coreena Ford Satellite company to create jobs in the North East \nWhile Sir James Dyson digs in his pockets for a new skills university I haven’t got enough hours in the day to write about all the innovation taking place in the North East. The skills gap certainly does exist, but the region is an absolute hive of activity - and I’ve just written about two firms that have been, and are going to, create skilled jobs in very technical sectors. \nFirst up is e2E Satcom Ltd, which has plans to create up to 19 jobs here in the region over the next three years, jobs it hopes to fill with skilled North East, as it moves towards launching its NEATaccess satellite communications technology to the market. \nThe firm’s technology has been designed to support satellite communications from smaller airborne platforms, also taking equipment to the size of a credit card, rather than the lap-top sized alternatives on the market today - and before the decade is out it’ll have launched its own satellites. \nAnd we also have QuestUAV Ltd in Amble , which has been around before drones became common parlance. \nFormer Armed Forces helicopter pilot Nigel King set up Quest UAV years ago, after making his own UAVs (unmanned airborne vehicles) for his former aerial photography firm, but he soon learned they were in demand for many other humanitarian causes. \nNow his camera-equipped drones are used all over the world, to safeguard, enhance and protect the environment, after the firm tapped into the growing need for UAVs in a range of sectors. \nQuest UAV’s latest deal sees them soar into China, tying up a partnership with a Beijing firm which will see the firm sell them into the Chinese market, Jane Siddle of NEL with Barry Ross of e2E (Photo: Crest Photography) 8.39 FTSE and pound latest \nThe FTSE-100 index at 8:15am was down 50.49 at 6740.02. \nThe pound at 8am was 1.2467 dollars compared to 1.2454 dollars at the previous close. The euro at 8am was 0.8900 pounds compared to 0.8910 pounds at the previous close. 8.38 Coreena Ford Paddy Power Betfair boosted by weak pound \nPaddy Power Betfair has raised its full-year profit forecast after it was boosted by the collapse in sterling and the Euro 2016 football championships in the third quarter. \nThe company, born out of a merger between Paddy Power and Betfair, saw revenue rise 25% to £404 million in the three months to September 30. Paddy Power Betfair said it benefited to the tune of £28 million from the translation of non-UK revenues due to the weakness of sterling. \nOn a constant currency basis, turnover grew 15%. \nUnderlying earnings were up 53% to £113 million in the quarter and the group said it now expects underlying earnings for the full year to come in between £390 million and £405 million, against previous expectations of £365 million to £385 million. \nChief executive Breon Corcoran said: “This was another good quarter for Paddy Power Betfair. We are continuing to focus on building a stronger combined operation by exploiting the unique assets and capabilities of each legacy business, and on using our scale to better serve our customers. \n“Work is under way to combine the best of Betfair and Paddy Power’s technology into a multi-brand, multi-channel, multi-jurisdictional platform that will start to unlock the full potential of the group’s scale and will lead to increased pace of development and faster roll out of new products.” Paddy Power Betfair logo", "external_links": [], "published": "2016-11-04T15:20:00.000+02:00", "crawled": "2016-11-04T11:29:48.666+02:00", "highlightTitle": ""}