{"organizations": [], "uuid": "9a97da8495eaeb4005b22cbebc956bae52511b5d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.birminghammail.co.uk/incoming/article12142534.ece/ALTERNATES/s1200/JS104335604.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/who-won-election-president-12148320", "country": "GB", "domain_rank": 21960, "title": "Who won the US election for President?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Who won the US election for President?", "spam_score": 0.0, "site_type": "news", "published": "2016-11-09T12:52:00.000+02:00", "replies_count": 0, "uuid": "9a97da8495eaeb4005b22cbebc956bae52511b5d"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/who-won-election-president-12148320", "ord_in_thread": 0, "title": "Who won the US election for President?", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "neutral"}, {"name": "clinton", "sentiment": "none"}, {"name": "george washington", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "george w bush", "sentiment": "none"}, {"name": "bush", "sentiment": "none"}, {"name": "barack obama", "sentiment": "none"}, {"name": "ronald reagan", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "bill clinton", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "new york city", "sentiment": "none"}, {"name": "usa", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "new york hilton midtown", "sentiment": "none"}, {"name": "north carolina", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "michigan", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}], "organizations": [{"name": "ap photo/seth wenig", "sentiment": "none"}, {"name": "fox news", "sentiment": "none"}, {"name": "american democratic party", "sentiment": "none"}, {"name": "new york times", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Who won the US election for President? Donald Trump may be on course to win the US Presidential election Share Republican presidential candidate Donald Trump gestures to the audience at a campaign rally in Michigan Share Get daily   \nDonald Trump might have beaten the odds and proved the experts wrong by winning the election to become President of the United States , it seems. \nAs votes were being counted, Mr Trump appeared to have won a number of the key \"swing states\" which decide where the election. \nThe businessman and television celebrity appeared to be on course to give America it's own \"Brexit\" shock by winning the US Presidential election, beating Democrat candidate Hillary Clinton. \nIt would make him the 44th President of the United States, following in the footsteps of George Washington, Ronald Reagan, Barack Obama and her husband, Bill Clinton. The winner becomes President in January \nMr Trump or Mrs Clinton will be sworn in on Friday, January 20, 2017, also known as Inauguration Day. The current President, Barack Obama, stays in the job until then. \nUS Presidential Election: Contest reveals US to be a racist and divided nation \nMr Trump had promised supporters that he would deliver “Brexit plus” by winning the election even though the media and pundits predicted he could never do it, just as the “leave” camapign won the Brexit referendum despite polling suggesting they would lose. An exciting night as votes were counted American Democratic Party supporters react to projections for Donald Trump winning multiple states at the Democrats Abroad election night party in London. \nMr Trump needed to win a number of “swing states” - the American equivalent of marginal seats - to be victorious. \nAs votes were counted, it began to look like he would do it. Trump and Clinton were neck and neck in Florida, as the votes were counted, until Mr Trump inched ahead. Read More \nAt around 3.30am in the UK, US television news channels reported that they believed Trump had won in Ohio. This is a key swing state, and whoever wins in Ohio has often gone on to win the Presidency. \nTrump also won Florida and North Carolina. It follows a tense and divisive presidential election Supporters of Republican presidential nominee Donald Trump cheer during the election night event at the New York Hilton Midtown on November 8, 2016 in New York City. \nMr Trump has alienated many Americans, even including Republicans. \nThe New York Times reported that even George W Bush - the last Republican to be President - refused to vote for Trump, and instead simply failed to vote for a President at all. Former President Bush did vote for Republicans in other elections taking place on the same day, the New York Times reported. Read More \nMr Trump’s campaign focused on plans to build a wall between the USA and Mexico, to stop US jobs going overseas and to prevent Syrian refugees coming in to the USA. Trump had claimed the election was rigged (Photo: AP Photo/Seth Wenig) \nEarly on Tuesday, the day of the election, Mr Trump complained that the vote was rigged against him. He told Fox News there reports of votes being switched from Republican to Democrat by electronic voting machines, saying: “There are reports that when people vote for Republicans, the entire ticket switches over to Democrats. You’ve seen that, it’s happening at various places today, it’s been reported. Share", "external_links": [], "published": "2016-11-09T12:52:00.000+02:00", "crawled": "2016-11-09T08:27:54.314+02:00", "highlightTitle": ""}