{"organizations": [], "uuid": "08ae4d9e874cbf934ab9a4e1dbc4787c9adf726d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12096617.ece/ALTERNATES/s1200/JS103582348.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/sport/football/transfer-news/sunderland-afc-transfers-everton-west-12150808", "country": "GB", "domain_rank": 21960, "title": "Sunderland AFC transfers: Everton and West Ham United interest in Lamine Kone could be good news", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Sunderland AFC transfers: Everton and West Ham United interest in Lamine Kone could be good news", "spam_score": 0.0, "site_type": "news", "published": "2016-11-09T20:13:00.000+02:00", "replies_count": 0, "uuid": "08ae4d9e874cbf934ab9a4e1dbc4787c9adf726d"}, "author": "Stuart Rayner", "url": "http://www.chroniclelive.co.uk/sport/football/transfer-news/sunderland-afc-transfers-everton-west-12150808", "ord_in_thread": 0, "title": "Sunderland AFC transfers: Everton and West Ham United interest in Lamine Kone could be good news", "locations": [], "entities": {"persons": [{"name": "alexis sanchez", "sentiment": "negative"}, {"name": "getty imag", "sentiment": "negative"}, {"name": "lamine kone", "sentiment": "negative"}, {"name": "moyes", "sentiment": "none"}, {"name": "papy djilobodji", "sentiment": "none"}, {"name": "sam allardyce", "sentiment": "none"}, {"name": "ashley williams", "sentiment": "none"}, {"name": "allardyce", "sentiment": "none"}, {"name": "kone", "sentiment": "none"}, {"name": "jermain defoe", "sentiment": "none"}, {"name": "domagoj vida", "sentiment": "none"}, {"name": "ricardo alvarez", "sentiment": "none"}, {"name": "david moyes", "sentiment": "none"}, {"name": "jordan pickford", "sentiment": "none"}, {"name": "fraser forster", "sentiment": "none"}, {"name": "ronald koeman", "sentiment": "none"}, {"name": "vito mannone", "sentiment": "none"}, {"name": "alvarez", "sentiment": "none"}, {"name": "ellis short", "sentiment": "none"}], "locations": [{"name": "west ham", "sentiment": "none"}, {"name": "ivory coast", "sentiment": "none"}, {"name": "southampton", "sentiment": "none"}, {"name": "swansea", "sentiment": "none"}, {"name": "senegal", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "lausanne", "sentiment": "none"}], "organizations": [{"name": "west ham united", "sentiment": "negative"}, {"name": "sunderland afc", "sentiment": "negative"}, {"name": "everton", "sentiment": "negative"}, {"name": "sunderland", "sentiment": "negative"}, {"name": "inter", "sentiment": "none"}, {"name": "notts county", "sentiment": "none"}, {"name": "dynamo kiev", "sentiment": "none"}, {"name": "vida", "sentiment": "none"}, {"name": "player registration committee", "sentiment": "none"}, {"name": "inter milan", "sentiment": "none"}, {"name": "sampdoria", "sentiment": "none"}, {"name": "premier league", "sentiment": "none"}, {"name": "chelsea", "sentiment": "none"}, {"name": "black cats", "sentiment": "none"}, {"name": "fifa", "sentiment": "none"}, {"name": "court of arbitration for sport", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Alexis Sanchez of Arsenal and Lamine Kone of Sunderland compete for the ball (Photo: 2016 Getty Images) Share Get Sunderland AFC   Thank you for subscribing!   \nEverton and West Ham United are reportedly ready to revive their interest in Lamine Kone in January. \nIt was a major boost for Sunderland morale when they were able to see off interest in the Ivory Coast international in the summer and persuade him to sign a new four-year contract weeks after handing in a transfer request but since then the standard of Kone’s performances have come in for heavy criticism. \nThe Black Cats are likely to have to raise money in January if they are to strengthen \n091116Sunderland Kone a squad which has won just one match all season. \nThey are around £140m in debt, and could be faced with another big bill on December 9 if the Court of Arbitration for Sport rules against them in their dispute over Ricardo Alvarez. \nChairman Ellis Short is a high-profile supporter of financial fair play in the Premier League, so even if he wanted to fund any new signings in January, it is unlikely he would feel able to do so. Instead, David Moyes may have to raise funds himself or look to squeeze more from the squad he has. \nKone is one of Sunderland’s few saleable assets. Even their best player, Jermain Defoe, is of limited value because he is 33 years-old. \nWashington-born goalkeeper Jordan Pickford, who was this week called into the England squad as cover for the injured Fraser Forster, is in demand and with Vito Mannone expected to return from a fractured elbow in the Football League Trophy game against Notts County, selling him is an option they will have to consider, but losing such a talented local player will be one they are reluctant to take. \nKone only joined Sunderland in January, but his no-nonsense performances in the second half of last season were a huge reason why the Black Cats were able to avoid relegation under Sam Allardyce. Even though the 28-year-old wore the captain’s armband at Southampton in the League Cup, he has cut a distracted and lacklustre figure since, his defending littered with the sort of defensive mistakes he simply was not making under Allardyce. poll loading Would you sell Lamine Kone in January? 0+ VOTES SO FAR YES NO \nDespite his poor form, centre-back Kone is likely to miss a significant chunk of January and February on African Cup of Nations duty. Fellow centre-back Papy Djilobodji is a Senegal international, but he is currently out of favour with his country. \nMoyes has identified Domagoj Vida as a potential replacement for Kone. \nSunderland showed an interest in the Croatian in the summer, but were put off by Dynamo Kiev’s asking price. That is now expected to drop with Vida in the final two years of his contract. \nEverton bought Ashley Williams from Swansea in August when Kone agreed to stay on Wearside, but Saturday’s 5-0 defeat to Chelsea showed Ronald Koeman still has work to do to strengthen his team defensively. West Ham, meanwhile, have had a poor start to the season and have recently started playing with an extra central defender in an attempt to do something about it. \nAlvarez spent the 2014-15 season on loan at Sunderland from Inter Milan. The agreement included a clause which promised the Black Cats would buy the Argentinian if they avoided relegation. \nThey did this, but tried to argue the clause was invalid because of the playmaker’s problems with knee injuries. Alvarez started only eight games for the Wearsiders, scoring once. \nAlthough this has never been confirmed, Fifa’s Player Registration Committee reportedly found in Inter’s favour, wit Sunderland taking the case to Lausanne. \nThe pre-agreed fee has actually risen to £10m since 2014 as it was fixed in Euros at a time before Brexit when the pound was much stronger. \nNeither Sunderland nor Inter wanted the player back, and he was eventually allowed to join Sampdoria as a free agent but the issue of what money if any Inter are owed is still to be resolved. Share", "external_links": [], "published": "2016-11-09T20:13:00.000+02:00", "crawled": "2016-11-09T15:34:29.701+02:00", "highlightTitle": ""}