{"organizations": [], "uuid": "6d495198142e38b0a38670010959e5e24d051ac0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12130076.ece/ALTERNATES/s1200/JS104152455.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/schools-midnight-text-warns-children-12129842", "country": "GB", "domain_rank": 21960, "title": "School's midnight text warns children not to skip class on day Football Manager 2017 game released", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "School's midnight text warns children not to skip class on day Football Manager 2017 game released", "spam_score": 0.0, "site_type": "news", "published": "2016-11-05T00:32:00.000+02:00", "replies_count": 0, "uuid": "6d495198142e38b0a38670010959e5e24d051ac0"}, "author": "Tom Eden", "url": "http://www.chroniclelive.co.uk/news/north-east-news/schools-midnight-text-warns-children-12129842", "ord_in_thread": 0, "title": "School's midnight text warns children not to skip class on day Football Manager 2017 game released", "locations": [], "entities": {"persons": [{"name": "sarah holmes-carne", "sentiment": "none"}, {"name": "miles jacobson", "sentiment": "none"}, {"name": "kenton", "sentiment": "none"}, {"name": "mrs holmes-carne", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "great britain", "sentiment": "none"}], "organizations": [{"name": "news school", "sentiment": "negative"}, {"name": "european union", "sentiment": "none"}, {"name": "kenton school  school", "sentiment": "none"}, {"name": "kenton school", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News School's midnight text warns children not to skip class on day Football Manager 2017 game released Kenton School in Newcastle sent a text to parents to coincide with the launch of the addictive Football Manager 2017 Share The text sent to parents from Kenton School Share Get   Thank you for subscribing!   \nA midnight text warning parents to make sure their children attend school was sent out by teachers - on the day the new Football Manger game was released. \nThe release of the massively popular game prompted staff at Kenton School in Newcastle to post the text, ensuring pupils didn’t swap a day in the classroom for a day on the console. \nPrincipal of the school Sarah Holmes-Carne said the texts were part of their ongoing work to improve attendance at school. Sarah Holmes-Carne, head teacher at Kenton School \nSchool research into absences shows higher numbers of pupils missing school the day after popular games are released. So, with the latest instalment in the Football Manager series coming out on Friday morning, the school feared some keen gamers would prefer to practice their gaming skills rather than their classroom ones. \nMrs Holmes-Carne said: “Kenton School has had a huge focus on attendance and this is an area we have greatly improved; our school now stands above the national average. \n“We have studied the data looking at pupil absences and it just so happens that one of the things that impacts on attendance is the release of a new computer game.” \nShe adds that “a problem across all schools seems to be lower attendance on Friday than any other day”, so the school decided to put out the message to coincide with the release of Football Manager at midnight on Thursday. Football Manager 2017 (Photo: Sports Interactive) \nMrs Holmes-Carne explained that co-operation with parents has been key to improving the school’s attendance record, but that didn’t stop some grumbles about the latest communication, with one recipient of the 12.13am message commenting: “They have woken everyone up with this stupid text.” \nThe school’s message read: ‘We are aware that a new computer game is launched at midnight tonight and this will affect the minority of students. \n‘However, we expect all students to attend school as normal tomorrow. Any absence tomorrow will be unauthorised unless supported by medical evidence.’ Read More \nSports Interactive’s hit management simulation game - which allows you to take the reigns of a football team and all the responsibilities that entails - is so addictive that it has reportedly been cited in 35 cases. \nAnd remarkably, this years’s game includes Brexit in its storyline. \nMiles Jacobson, the man behind the popular game, has revealed that the Great Britain’s controversial decision to vote out of the European Union will feature in the game. \nWhile Britain is yet to trigger Article 50, players will face different consequences of the UK leaving Europe based on various in-game scenarios. Share", "external_links": [], "published": "2016-11-05T00:32:00.000+02:00", "crawled": "2016-11-04T20:09:48.695+02:00", "highlightTitle": ""}