{"organizations": [], "uuid": "59d86f30234385fd572eac4254d2315d41e4102b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12223885.ece/ALTERNATES/s1200/Car-production-figures.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/work-nissan-youre-given-freedom-12223725", "country": "GB", "domain_rank": 21960, "title": "Work for Nissan? You're about to be given the Freedom of the City of Sunderland", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Work for Nissan? You're about to be given the Freedom of the City of Sunderland", "spam_score": 0.0, "site_type": "news", "published": "2016-11-24T19:15:00.000+02:00", "replies_count": 0, "uuid": "59d86f30234385fd572eac4254d2315d41e4102b"}, "author": "Sean Seddon", "url": "http://www.chroniclelive.co.uk/news/north-east-news/work-nissan-youre-given-freedom-12223725", "ord_in_thread": 0, "title": "Work for Nissan? You're about to be given the Freedom of the City of Sunderland", "locations": [], "entities": {"persons": [{"name": "peter vardy", "sentiment": "none"}, {"name": "peter wood", "sentiment": "none"}, {"name": "paul watson", "sentiment": "none"}, {"name": "jimmy montgomery", "sentiment": "none"}, {"name": "trevor", "sentiment": "none"}, {"name": "niall quinn", "sentiment": "none"}, {"name": "trevor mann", "sentiment": "none"}, {"name": "coun watson", "sentiment": "none"}], "locations": [{"name": "sunderland sunderland", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "hms ocean", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "nissan", "sentiment": "neutral"}, {"name": "european union", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "royal navy", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "sunderland afc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Work for Nissan? You're about to be given the Freedom of the City of Sunderland Sunderland councillors have voted unanimously to bestow the honour on the workforce of the car-plant Share Click to play Tap to play The video will start in 8 Cancel Play now Get   \nThe entire workforce of Nissan’s plant in Sunderland is to be honoured with the Freedom of the City. \nCouncillors have voted unanimously to bestow the ceremonial honour on the factory’s staff in light of Nissan’s decision to continue production in the region post-Brexit. \nProposing the motion, the leader of the council, Paul Watson, said: “For the first time we have the real secret of Nissan’s success - it’s the workforce.” \nThe official wording of the motion councillors voted on reads: “This council congratulates wholeheartedly the Nissan workforce for their sterling efforts in securing the future production of the next generation Qashqai and X-Trail and feels that it is right and proper for the workforce of Nissan to receive the Freedom of the City at a future date.” \nA firm date for when the award would be made official was not set. \nNissan plays a pivotal role in the economy of Sunderland and the broader North East region. \nThe largest car plant in the UK for 14 years and largest exporter of cars from the UK for 12 years, Nissan employs over 7000 people. \nThere were serious concerns about the long-term future of the plant following the vote to leave the European Union. \nNissan dramatically announced it would remain in Sunderland and increase production last month. \nHow the government convinced Nissan to stay has come under much scrutiny, with questions raised about the nature of the assurances that were given to the Japanese manufacturing giant. \nIt’s not the first time someone connected with Nissan has been honoured in this way. Nissan's plant in Sunderland (Photo: Owen Humphreys/PA Wire) \nTrevor Mann, Nissan’s Chief Performance Officer, was awarded the Freedom in 2014. \nCoun Watson paraphrased Trevor in last night’s council meeting, saying: “There is a spirit and enthusiasm that makes Sunderland a very special place. \n“Nissan’s successes would not have been possible without the people of Sunderland.” \nCouncillor Peter Wood, leader of the Conservatives on the council, said: “It is right to recognise the contribution of the men and women who work at Nissan – on the production line, in the office and in the boardroom. \n“To confer the freedom of the city upon them is the best way we as councillors can show how proud we are of them for the pride they take in their work.” Read More \nSince the Freedom of the City honour was in introduced in 1901, many different people from different walks of life have been recognised. \nOriginally, it was used primarily to honour soldiers who had served in the Boer War. \nAfter being revived in 2004 it has been awarded to a more varied group of recipients. \nThe first of the new tranche of awards was given to HMS Ocean and her crew, a Royal Navy ship which was constructed on the Wear. \nJimmy Montgomery and Niall Quinn have both been recognised for their service to Sunderland AFC and Peter Vardy, another notable figure from the automotive sector, has also been given the award. Like us on Facebook", "external_links": [], "published": "2016-11-24T19:15:00.000+02:00", "crawled": "2016-11-24T14:48:10.420+02:00", "highlightTitle": ""}