{"organizations": [], "uuid": "137fd1c66077fe06cce311b5043cbe8715d0df93", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12118185.ece/ALTERNATES/s1200/JS101730192.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/small-firms-north-east-need-12118055", "country": "GB", "domain_rank": 21960, "title": "Small firms in North East need better export support, report says", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Small firms in North East need better export support, report says", "spam_score": 0.0, "site_type": "news", "published": "2016-11-03T07:01:00.000+02:00", "replies_count": 0, "uuid": "137fd1c66077fe06cce311b5043cbe8715d0df93"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/small-firms-north-east-need-12118055", "ord_in_thread": 0, "title": "Small firms in North East need better export support, report says", "locations": [], "entities": {"persons": [{"name": "emmerson", "sentiment": "none"}, {"name": "mark emmerson", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "hsbc", "sentiment": "negative"}, {"name": "share containers", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Small firms in North East need better export support, report says A report from HSBC calls for the Government, banks and businesses to help smaller firms trade overseas Share Containers on a ship (Photo: Andrew Matthews/PA Wire) Share Get business   \nSmall businesses in the North East need for more effective support to achieve their international trade ambitions, according to banking giant HSBC. \nThe company has called for action from the Government and the financial sector after recent regional trade statistics showed that exports from the region declined by 0.9% in comparison to the same quarter last year. \nHSBC’s report, Exporting for Growth: the SME Perspective, found that many firms considering exporting feel a limited understanding of local markets and a mire of complicated regulation in the destination market is stopping them from taking their products and services overseas. \nAs a result, fewer than half (45%) of SMEs not exporting think overseas trade will be important to the growth of their business. \nMark Emmerson, HSBC’s North East-born head of global trade and receivables finance UK, said: “The North East is full of dynamic entrepreneurs who want to look beyond their own borders but amid Brexit uncertainty, they’re struggling to see how it can be done. \n“What’s more, they often feel the resources they need can be hard to find. Encouraging exports is a win-win for the British economy and its small businesses, so we must work together to help support SMEs take their businesses global. Mark Emmerson, UK head of global trade and receivables finance, of HSBC \n“In fact, there is a clear need for government, banks and businesses to do more to give SMEs the bespoke support they need to flourish globally.” \nBased on its survey of 1,000 companies, HSBC has called on the Government to offer more tailored support for companies wanting to export and also says exporting firms should be given a voice in trade negotiations. \nIt also called for renewed efforts by banks, business groups and support services to share best practice after finding that almost three quarters of future exporters (71%) surveyed said that having the opportunity to learn from businesses currently exporting would encourage them to do so. \nMr Emmerson said: “Perception is often worse than reality when it comes to exporting. In our experience, once they take that first step, many SMEs find that it isn’t as difficult as they had feared. \n“What’s needed is reassurance and guidance through those early days. It is therefore vital that those already there offer a hand with crucial support, experience and advice. \n“That said, collaboration is a necessity. It’s important to make sure policy makers also have access to the insight and experience that SMEs have, so they’re informed as can be when they begin trade negotiations. \n“We are all already united by a shared goal - to ensure British exports flourish – so it’s time to work together and step up our exporting game.” Share", "external_links": [], "published": "2016-11-03T07:01:00.000+02:00", "crawled": "2016-11-03T02:42:56.122+02:00", "highlightTitle": ""}