{"organizations": [], "uuid": "903dd38cd6f8a9a43ed2a114b002aa979d6d3408", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12239021.ece/ALTERNATES/s1200/JS95621522.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/business-breakfast-live-jd-sports-12239022", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: JD Sports acquires Go Outdoors for £112.3m, plus latest news", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast LIVE: JD Sports acquires Go Outdoors for £112.3m, plus latest news", "spam_score": 0.0, "site_type": "news", "published": "2016-11-28T15:25:00.000+02:00", "replies_count": 0, "uuid": "903dd38cd6f8a9a43ed2a114b002aa979d6d3408"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/business-breakfast-live-jd-sports-12239022", "ord_in_thread": 0, "title": "Business Breakfast LIVE: JD Sports acquires Go Outdoors for £112.3m, plus latest news", "locations": [], "entities": {"persons": [{"name": "grainger", "sentiment": "negative"}, {"name": "loch lomond share", "sentiment": "none"}, {"name": "john graham", "sentiment": "none"}, {"name": "john browett", "sentiment": "none"}, {"name": "peter cowgill", "sentiment": "none"}, {"name": "worldstores", "sentiment": "none"}, {"name": "dunelm", "sentiment": "none"}, {"name": "jd", "sentiment": "none"}, {"name": "helen gordon", "sentiment": "none"}, {"name": "paul caplan", "sentiment": "none"}, {"name": "achica", "sentiment": "none"}, {"name": "alex price", "sentiment": "none"}, {"name": "willmott dixon", "sentiment": "none"}], "locations": [{"name": "portugal", "sentiment": "none"}, {"name": "bristol", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "worldstores", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "bristol city centre", "sentiment": "none"}, {"name": "netherlands", "sentiment": "none"}, {"name": "achica", "sentiment": "none"}], "organizations": [{"name": "grainger plc", "sentiment": "negative"}, {"name": "newcastle", "sentiment": "negative"}, {"name": "jd sports", "sentiment": "none"}, {"name": "palmer capital", "sentiment": "none"}, {"name": "yfm equity partners", "sentiment": "none"}, {"name": "cubex land", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "jd group", "sentiment": "none"}, {"name": "kiddicare", "sentiment": "none"}, {"name": "3i group", "sentiment": "none"}, {"name": "ws group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KEY EVENT Grainger Plc acquires build-to-rent development for £45.7m \nNewcastle’s Grainger plc is expanding its new- private rented sector portfolio following the acquisition of the build-to-rent development at Finzels Reach in Bristol, for £45.7m. \nThe firm - the UK’s largest listed private landlord, has bought the impressive development from a vehicle backed by clients of Palmer Capital and Cubex Land. Grainger will forward fund the project, while Cubex Land will be the developer and Willmott Dixon will be the contractor. \nThe site, which has planning consent, will deliver 194 private rental homes across two blocks and is expected to be completed at the beginning of 2019. \nBristol is a key target city for Grainger’s private rented sector (PRS) investment strategy became of its strong economic fundamentals, growth prospects and the strength of its housing market. \nHelen Gordon, chief executive of Grainger, said: “We are pleased today to announce further significant progress in our PRS investment strategy by agreeing to forward fund a 194 home, build-to-rent scheme at Finzels Reach in Bristol, a location which we believe has strong market prospects and excellent growth potential.” \nAlex Price, Chief Executive of Palmer Capital, said: “We are delighted to be working alongside our partners, Cubex Land and Grainger plc, to see this site brought forward for PRS. It will enhance the thriving mixed use community we have developed at Finzels Reach and provide much needed accommodation to Bristol City Centre.” A CGI of Finzels Reach in Bristol 8.39 KEY EVENT Dunelm doubles online operation after snapping up rival \nHomewares retailer Dunelm has splashed out £8.5 million on acquiring rival WS Group, which consists of Worldstores, Achica and baby retailer Kiddicare. Worldstores specialises in home and garden products, while Achica is a members-only online furniture store. \nIn total, WS Group has 650 employees and Dunelm said the move means that its online operation has more than doubled in size. \nDunelm boss John Browett said: “We are excited by this opportunity to accelerate the growth of our internet operation, more than doubling its size, and enhancing our position as the destination homewares retailer in the UK, both online and offline.” \nDunelm said it would pump £15m into WS Group as working capital and retain its management team. \nWS Group is expected to turn a loss of “around £5-10m” this year, but Dunelm is forecasting that it will at least break even under its first full year of ownership. Dunelm has several North East stores 8.35 FTSE and pound latest \nThe FTSE-100 index at 8:15am was down 39.70 at 6801.05. \nThe pound at 8am was 1.2496 dollars compared to 1.2455 dollars at the previous close. The euro at 8am was 0.8529 pounds compared to 0.8510 pounds at the previous close. 8.30 JD Sports buys Go Outdoors in multi-million pound deal \nJD Sports has acquired retailer Go Outdoors for £112.3m from its private equity owners. \nThe deal will see JD Sports buy the 58-store tents to cycles retailer - which has five North East stores - from YFM Equity Partners and 3i Group and adds to the group’s stable of outdoor brands such as Blacks, Millets and Ultimate Outdoors. \nAs a result of the deal, Go Outdoors founders Paul Caplan and John Graham will leave the business. \nJD Sports chief executive Peter Cowgill said: “Go Outdoors is a great addition to our existing Outdoor business. \n“The minimal overlap in store locations and their out-of-town, one-stop retailer approach complements the work we have done on the high street with Blacks and Millets and further strengthens our offering in the Outdoor sector. I am excited by the future prospects this holds for the JD Group.” \nIn the 53 weeks to January 31 2016, Sheffield-based Go Outdoors made revenues of £202.2m and saw pre-tax profit of £4.9m. \nIn September, JD Sports notched up record half-year profits and announced plans to set up shop in Australia, as well as vowing to press ahead with European expansion despite the Brexit vote. \nThe company also acquired Next Athleisure in Australia, which trades as Glue, with the deal providing “the platform to open JD in Australia”. \nOn Brexit, JD said at the time that while the UK’s decision to quit the European Union means that there will be some “uncertainties” over the next two or three years, it will press ahead with European expansion. The group has recently acquired businesses in Portugal and the Netherlands. Go Outdoors tents at Loch Lomond Share", "external_links": [], "published": "2016-11-28T15:25:00.000+02:00", "crawled": "2016-11-28T10:49:02.716+02:00", "highlightTitle": ""}