{"organizations": [], "uuid": "84530d5982520d81f04c807970f62425014c116d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12150424.ece/ALTERNATES/s1200/US-Presidential-election.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/donald-trump-brexit-wins-could-12150459", "country": "GB", "domain_rank": 21960, "title": "Why Donald Trump and Brexit wins could prove to be a good thing", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Why Donald Trump and Brexit wins could prove to be a good thing", "spam_score": 0.0, "site_type": "news", "published": "2016-11-09T19:28:00.000+02:00", "replies_count": 0, "uuid": "84530d5982520d81f04c807970f62425014c116d"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/donald-trump-brexit-wins-could-12150459", "ord_in_thread": 0, "title": "Why Donald Trump and Brexit wins could prove to be a good thing", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "negative"}, {"name": "brexit", "sentiment": "negative"}, {"name": "clinton", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "paco anselmi/pa wire", "sentiment": "none"}, {"name": "daniel blake", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "harriet harman", "sentiment": "none"}, {"name": "donald trumps", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Opinion Why Donald Trump and Brexit wins could prove to be a good thing Unlikely victories for both could lead to a change in politics which is so badly needed Share Click to play Tap to play The video will start in 8 Cancel Play now 360 video of Donald Trumps victory speech Share this video Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nCould the victories for Donald Trump and Brexit could be a good thing? \nThe thought struck me coming into work this morning as the first snow I have seen in years fell. \nEven the weather seemed heavy with foreboding after Trump’s win in the US presidential election . \nI predicted his triumph - I have witnesses - from lessons learned from the Brexit result. \nBy listening to people other than your close friends or associates who usually agree with your views. The wider, real world often doesn’t. \nSo when Trump with a list of faults which should have made him a political pariah - racism and sexism, to name but two - was still neck-and-neck with Hillary Clinton in the opinion polls up to the vote, alarm bells rang. \nHis supporters had been dismissed as thick red necks similar to how Brexit supporters were categorised here. \nIt was thought Clinton would win, eventually, because ‘common sense will prevail’. It was as patronising as it was ill conceived. \nPeople have become immune to the usual platitudes of career politicians and as a result many have been turned off politics altogether. Donald Trump as he makes his acceptance speech in New York following his victory to become he 45th president of the United States (Photo: Paco Anselmi/PA Wire) \nTrump’s message is extreme, but he struck a chord. Those who oppose his views or his type of politics will have to step up unless they want his world view to prevail in the long term. \nArguments will have to be made and won and politicians will have to make it clear where they stand. \nBy not doing this, the repercussions can be grave and proof of this came this week, not in the US but here, right on our very own door step. \nOn Monday the new benefits cap of £20,000 outside London and £23,000 in the capital came into force. \nIt is expected to push many families and children from that new sub class, the ‘working poor’ - which surely should be an oxymoron in this day and age - into greater poverty. \nYet when it came before parliament in 2015, the very party which should have spoken out most vehemently against it, Labour, had under instruction from interim leader Harriet Harman, chosen to abstain in the Commons vote. Read More US Election 2016 LIVE: Donald Trump is elected president of the United States \nIt was feared Labour would not look good in the eyes of the British public - and more importantly the media - if it did not look hardline enough on benefit payments . \nJeremy Corbyn voted against it. At that moment he cemented his credentials as the next leader of the Labour party. While the Labour MPs in parliament have never come to terms with him as leader, those outside parliament have, to the extent that Labour has become the biggest party, membership wise, in Europe. \nThe received wisdom before both their victories was that Corbyn was as an unlikely party leader as Trump was president. And as for Brexit - no chance. Yet all won decisively. Why? \nBecause Trump and Corbyn are seen as outsiders with clear political views, while Brexit was seen as the anti-establishment vote. \nAll were seen an antidote to the political insiders whose views change with the winds of public opinion. Read More 'We, Daniel Blake' - thousands in North East hit by new austerity measures \nIn the run up to the US presidential election there were a series of polls in which the public acknowledged that Clinton was the more experienced, less scary and better qualified candidate to be President. \nBut the one she got crushed in was in answer to the question that asked which candidate was most likely to bring about change - which Trump won by about 80% to 20%. \nWhile I still wished we had voted to stay in the European Union and, to understate wildly, am not a fan of Trump, both results will accelerate the shake-up of mainstream politics which it has for so long so badly needed. \nBut it’s a heavy dose of foul tasting medicine which we can only hope we can survive and eventually grow stronger from. Share", "external_links": [], "published": "2016-11-09T19:28:00.000+02:00", "crawled": "2016-11-09T14:45:06.345+02:00", "highlightTitle": ""}