{"organizations": [], "uuid": "5905f41d7b8a096549f57bd73459f0b1220f1705", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/29912764/15690250.jpg", "site_section": "http://www.thisisleicestershire.co.uk/specialolympics/rss.html?chid=181121", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/don-t-make-me-vote-to-take-away-my-italian-parents-rights-alberto-costa-s-brexit-plea-to-pm/story-29912764-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "danjmartin published 'Don't make me vote to take away my Italian parents' rights':...", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "danjmartin published 'Don't make me vote to take away my Italian parents' rights':...", "spam_score": 0.0, "site_type": "news", "published": "2016-11-17T18:45:00.000+02:00", "replies_count": 0, "uuid": "5905f41d7b8a096549f57bd73459f0b1220f1705"}, "author": "danjmartin", "url": "http://www.leicestermercury.co.uk/don-t-make-me-vote-to-take-away-my-italian-parents-rights-alberto-costa-s-brexit-plea-to-pm/story-29912764-detail/story.html", "ord_in_thread": 0, "title": "danjmartin published 'Don't make me vote to take away my Italian parents' rights':...", "locations": [], "entities": {"persons": [{"name": "alberto costa", "sentiment": "negative"}, {"name": "brexit", "sentiment": "negative"}, {"name": "theresa may", "sentiment": "negative"}, {"name": "costa", "sentiment": "none"}], "locations": [{"name": "brussels", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "south leicestershire", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}], "organizations": [{"name": "bbc", "sentiment": "none"}, {"name": "south leicestershire tory", "sentiment": "none"}, {"name": "huffington post", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Comments (0) \nAlberto Costa has asked Theresa May not to make him vote to back Brexit plans that could affect the rights of his Italian parents who live in the UK. \nThe South Leicestershire Tory MP urged the Prime Minister not to compel him to support any future legislation that would intrude on the rights of his parents and millions of other EU citizens who chose to live in the UK before the referendum. \nMr Costa told Parliament his mother and father, who came to England from Italy to work, said: \"They have never naturalised and have been in this country for 50 years. Can the Prime Minister assure me that she will never instruct me to vote in the Lobby to take away the rights of my parents and those of millions of other EU citizens? \nRead more: Leicester's Criterion pub to reopen after rapid sale \nMrs May told Mr Costa: \"I recognise the personal passion with which my hon. Friend raises this issue. \n\"I want, intend and expect to be able to guarantee the rights of EU citizens living in the United Kingdom, but I also want the rights of UK citizens living in EU member states to be guaranteed. \n\"As I have said previously, I hope that this is an issue that we shall be able to discuss with my European colleagues at an early stage.\" \nMr Costa later told the Mercury he did not want to discuss his parents situation in any further detail and that he had raised them in Prime Minister's Questions for impact. \nHe also would not talk about any specific rights her feared would be at risk, however the BBC and The Huffington Post have reported his comments as a plea not to make him vote on anything that would mean they would have to leave the UK. \nHe said: \"I don't want to say any more about them but I do know I have constituents in South Leicestershire who are feeling very anxious now. \n\"The Vote Leave campaign was very, very clear that the rights in totality of EU citizens in the UK would not be affected. They said it was Remain and Project Fear stirring this up.\" \n\"Now it seems those rights are on the table.\" \nPMQs this week \nHe said had he known that would be the case he would have argued for UK-based EU citizens to be given a vote in June. \nHe added: \"I have never rebelled against the Government but I could not support anything that would take away existing rights. To do that would be against British values. \n\"I think Theresa May has made a mistake here. It is the UK that is divorcing the EU and in divorces it is the party that wants to leave that makes an offer. \n\"Theresa May should go to Brussels and guarantee the rights of EU citizens after Brexit in the same way I am sure there would be guarantees for UK citizens in the EU.\" \nKeep up to date with Leicestershire's political news by liking our Facebook page.", "external_links": [], "published": "2016-11-17T18:45:00.000+02:00", "crawled": "2016-11-17T14:49:11.752+02:00", "highlightTitle": ""}