{"organizations": [], "uuid": "83751f42bba1cf5dec89df66cdcce2894bfdb1af", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/29917725/15693858.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/theresa-may-should-drop-brexit-appeal-says-leicestershire-mp-sir-edward-garnier/story-29917725-detail/story.html", "country": "US", "domain_rank": 48128, "title": "Theresa May should drop Brexit appeal says Leicestershire MP Sir Edward Garnier | Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "Theresa May should drop Brexit appeal says Leicestershire MP Sir Edward Garnier | Leicester Mercury", "spam_score": 0.134, "site_type": "news", "published": "2016-11-19T17:32:00.000+02:00", "replies_count": 0, "uuid": "83751f42bba1cf5dec89df66cdcce2894bfdb1af"}, "author": "", "url": "http://www.leicestermercury.co.uk/theresa-may-should-drop-brexit-appeal-says-leicestershire-mp-sir-edward-garnier/story-29917725-detail/story.html", "ord_in_thread": 0, "title": "Theresa May should drop Brexit appeal says Leicestershire MP Sir Edward Garnier | Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "edward garnier", "sentiment": "negative"}, {"name": "edward garnier by davidwowen", "sentiment": "negative"}, {"name": "theresa may", "sentiment": "negative"}, {"name": "letwin", "sentiment": "none"}, {"name": "bill", "sentiment": "none"}, {"name": "paterson", "sentiment": "none"}, {"name": "owen paterson", "sentiment": "none"}, {"name": "edward garnier mp", "sentiment": "none"}, {"name": "oliver letwin", "sentiment": "none"}, {"name": "garnier", "sentiment": "none"}, {"name": "dominic grieve", "sentiment": "none"}, {"name": "grieve", "sentiment": "none"}, {"name": "edward", "sentiment": "none"}, {"name": "oadby", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}], "organizations": [{"name": "leicestershire", "sentiment": "negative"}, {"name": "leicester city council", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "wigston", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "bbc radio", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "high court", "sentiment": "none"}, {"name": "supreme court", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Theresa May should drop Brexit appeal says Leicestershire MP Sir Edward Garnier By DavidWOwen | Posted: November 19, 2016 0 COMMENTS SHARES Sir Edward Garnier: \"Avoid an unnecessary legal row.\" Theresa May should drop Brexit appeal says Leicestershire MP Sir Edward Garnier X \nCopy link to paste in your message / Comments (0) \nSir Edward Garnier MP is urging the Prime Minister to scrap an appeal against a court ruling stating Parliament must vote on the UK leaving the EU. \nThe Conservative Harborough, Oadby and Wigston MP who is a former solicitor general and outspoken 'remain' supporter wants Theresa May to abandon her Supreme Court appeal. \nThe Government is appealing against a High Court ruling which states that MPs' permission is required before triggering Article 50 of the EU treaties to begin the exit process. \nSir Edward believes that avoiding the Supreme Court would avert a potential legal row, including the possibility judges grant \"veto powers\" to the Scottish and Welsh devolved administrations. \nCalling for the Prime Minister to bring forward a Bill in Parliament, he said: \"That way you avoid an unnecessary legal row. \n\"You avoid a lot of unnecessary expense, but you also avoid an opportunity for ill-motivated people to attack the judiciary, to misconstrue the motives of both parties to the lawsuit, and you provide certainty.\" \nSir Edward's position is supported by fellow remain-backers Oliver Letwin MP and former attorney general Dominic Grieve – as well as prominent 'Brexit' campaign and former cabinet minister Owen Paterson. \nRead more: Leicester City Council line-up compulsory purchase of this island and a number of homes \nMr Letwin, who was director of the Government's 'Brexit Unit' following the June referendum, said Mrs May should concede defeat because uncertainty is bad for the economy. \nHe said Article 50 should be triggered as promised by the PM in April to make Brexit an issue in French, German and Dutch elections next year – in the hope that businesses in those countries will lobby for commitments to favourable trade terms with the UK. \nMr Paterson, speaking to BBC Radio 4's Today programme, said: \"I'm not a lawyer and I'm not an expert on this, but I wouldn't have a bet on the Government winning this one. \n\"I do agree with Edward (Garnier) – it is not good to have a confrontation with the courts.\" \nHe added: \"My concern is we deliver on what the people wanted.\" \nMr Grieve told Today that the Government's chance of success at the Supreme Court hearing, scheduled to start on December 5, is low. \nHe said: \"I can't see the point in the Government continuing with the case and also agree that if they enact primary legislation, they will get it through Parliament.\" \nThree High Court judges ruled on November 3 that the Government does not have the power to trigger Article 50 alone. \nA spokesman for the Department for the Exit of the European Union said: \"The country voted to leave the European Union in a referendum approved by an Act of Parliament and the Government is determined to respect that result. \n\"We will robustly defend our position in the forthcoming appeal.\" \nHe added: \"As the Prime Minister has made clear, our work is on track and we remain committed to triggering Article 50 by the end of March next year.\" ", "external_links": [], "published": "2016-11-19T17:32:00.000+02:00", "crawled": "2016-11-19T14:17:00.536+02:00", "highlightTitle": ""}