{"organizations": [], "uuid": "bba438f1a854f3b578c91aeb1467819c7e3b80ba", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.liverpoolecho.co.uk/incoming/article12091874.ece/ALTERNATES/s1200/13567077-1.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/tony-blair-branded-yesterdays-man-12230771", "country": "GB", "domain_rank": 21960, "title": "Tony Blair branded 'yesterday's man' and told to forget anti-Brexit comeback", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Tony Blair branded 'yesterday's man' and told to forget anti-Brexit comeback", "spam_score": 0.0, "site_type": "news", "published": "2016-11-27T15:00:00.000+02:00", "replies_count": 0, "uuid": "bba438f1a854f3b578c91aeb1467819c7e3b80ba"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/tony-blair-branded-yesterdays-man-12230771", "ord_in_thread": 0, "title": "Tony Blair branded 'yesterday's man' and told to forget anti-Brexit comeback", "locations": [], "entities": {"persons": [{"name": "tony blair", "sentiment": "neutral"}, {"name": "daniel leal-olivas/pa wire", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "blair", "sentiment": "none"}, {"name": "john major", "sentiment": "none"}, {"name": "campbell", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "ronnie campbell  mr campbell", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "ronnie campbell", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "sedgefield", "sentiment": "none"}, {"name": "blyth valley", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "iraq", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "current labour", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "new statesman", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "pfi", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "  Thank you for subscribing! Could not subscribe, try again later Invalid Email \nFormer Prime Minister Tony Blair has been advised to think again about plans to make a political comeback. \nNorth East Labour MP Ronnie Campbell said Mr Blair was “yesterday’s man”. \nMr Blair, the former MP for Sedgefield, has revealed he hopes to return to British politics and play a significant role behind the scenes. \nAnd he has suggested there should be a second vote on Brexit - a call echoed by another former Prime Minister, Tory Sir John Major. \nIn an interview with the New Statesman magazine, Mr Blair said he couldn’t return to the “front-line” of politics, but he hoped to “create the space for a political debate”. Read More \nAnd he is due to open a new office in London with a team of staff, to act as a base. \nMr Blair became Labour leader in 1994 and was Prime Minister from 1997 to 2007. \nHe is the only Labour leader ever to have won three elections in a row, and it could be argued that he is the most successful leader the party has known. \nHowever, his reputation has been tarnished by the 2003 invasion of Iraq, now widely seen as a disaster. \nCurrent Labour leader Jeremy Corbyn has also disowned some of the “new Labour” policies associated with Mr Blair. Examples include the PFI scheme, in which private developers funded and managed new infrastructure such as hospitals in return for regular payments from the Government. Ronnie Campbell \nMr Campbell, MP for Blyth Valley, said: “I think Tony Blair has had has day. He is what you used to call a yesterday’s man. \n“I’m sure he still has something to say but im not sure many people want to hear it.” \nAnd he criticised suggestions that the UK could think again about quitting the European Union . \nMr Campbell said: “The problem he has is that the majority wanted to leave \n“I’ve always believed right or wrong that the majority has to prevail Read More \n“I’m a democrat, but Blair and the rest of his cronies are not democrats. \n“You can’t just impose your views on people. That’s the Trump agenda.” \nMr Blair has predicted Britain might think again about Brexit once negotiations with the European Union begin in earnest. \nHe said: “It can be stopped if the British people decide that, having seen what it means, the pain-gain cost-benefit analysis doesn’t stack up. And that can happen in one of two ways. \n“I’m not saying it will, by the way, but it could. I’m just saying: until you see what it means, how do you know?” A European Union flag in front of Big Ben (Photo: Daniel Leal-Olivas/PA Wire) \nAnd he told the New Statesman that people might decide that leaving the EU isn’t worth it after all when the time comes to decide whether the UK will still have access to the single market, which means goods made in Britain can be exported to EU countries without paying tariffs. \nSetting out his plans for a comeback, he said he will work to revive the “progressive centre or centre left” but has “no intention” of returning to the coalface of British politics. Read More 'I'll never be fat again': MP Ronnie Campbell in good spirits as he reveals he's battling cancer \nMr Blair said: “What I’m doing is to spend more time not in the front line of politics, because I have no intention of going back to the front line of politics, to correct another misunderstanding ... but in trying to create the space for a political debate about where modern Western democracies go and where the progressive forces particularly find their place ... I’m dismayed by the state of Western politics, but also incredibly motivated by it. I think, in Britain today, you’ve got millions of effectively politically homeless people.” \nHe added: “I can’t come into frontline politics. There’s just too much hostility, and also there are elements of the media who would literally move to destroy mode if I tried to do that.” Like us on Facebook", "external_links": [], "published": "2016-11-27T15:00:00.000+02:00", "crawled": "2016-11-27T10:11:31.842+02:00", "highlightTitle": ""}