{"organizations": [], "uuid": "0d4e2002c1950f4de2a36421ec70f15fd2ab93df", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12214366.ece/ALTERNATES/s1200/AGP_MDM_280616LONDON_014JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/jams-who-they-you-one-12214277", "country": "GB", "domain_rank": 21960, "title": "Jams: Who are they, are you one of them and if so should you be worried?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Jams: Who are they, are you one of them and if so should you be worried?", "spam_score": 0.0, "site_type": "news", "published": "2016-11-23T15:00:00.000+02:00", "replies_count": 0, "uuid": "0d4e2002c1950f4de2a36421ec70f15fd2ab93df"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/jams-who-they-you-one-12214277", "ord_in_thread": 0, "title": "Jams: Who are they, are you one of them and if so should you be worried?", "locations": [], "entities": {"persons": [{"name": "phillip hammond", "sentiment": "negative"}, {"name": "nick clegg", "sentiment": "none"}, {"name": "ed miliband", "sentiment": "none"}, {"name": "philip hammond", "sentiment": "none"}, {"name": "frayne", "sentiment": "none"}, {"name": "james frayne", "sentiment": "none"}, {"name": "theresa may  theresa may", "sentiment": "none"}, {"name": "george osborne", "sentiment": "none"}, {"name": "osborne", "sentiment": "none"}, {"name": "andrew marr", "sentiment": "none"}], "locations": [{"name": "downing street", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "none"}, {"name": "bbc", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "policy exchange", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Foreign Secretary Phillip Hammond cuts through Downing Street, London. Share Get daily   Thank you for subscribing! Could   \nThere’s been a lot of talk about ‘Jams’ in the run up to today’s Autumn statement by Chancellor Phillip Hammond? Who are they, are you one of them and if so should you be afraid? Simple question to start with. Who or what are the ‘Jams’? \nIt is the latest acronym for working families in the UK. It stands for ‘Just About Managing’ families, many of who live in the North East. \nI’d have thought ‘Not Really Managing’ or ‘Barely Managing At All’ families would be more appropriate up here wouldn’t you? \nA moot point because the Jams are expected to be £2,500 a year worse off by 2020 according to a study How did they work that out? \nA study of 187,000 households across the UK found that policies including cuts to universal credit and the four-year benefit rate freeze, coupled with rising rents and higher inflation, would see low-income working families typically lose £48.90 a week by the end of the decade. Are these Jams the ‘‘squeezed middle”, according to former Labour leader Ed Miliband? \nThey are. To ex-Lib Dem leader Nick Clegg, they were part of “alarm clock Britain” - the bleary-eyed grafters struggling to raise families, while getting out to work, with little money left over to pay for luxuries. To former Chancellor George Osborne they were “hard-working families” - again, those not on huge wages, but juggling responsibilities and striving to keep going. Everyone’s got a name for them, but nobody knows how to help them it seems. Although that could change today, of course. Read More Back to Jams. Who came up with this term? Prime Minister Theresa May \nTheresa May used the phrase “just about managing” in her opening speech as Prime Minister on Downing Street. However one of the first uses was, reportedly, in a paper published by the thinktank Policy Exchange last year. Its author, James Frayne, defines them as C1/C2 families: lower middle class and upper working class families, around half of all households in Britain. \nMost of their incomes come from work, but they are often topped up by welfare support. In fact, ‘Jams account for two-thirds of all families with children receiving tax credits. Mr Frayne characterised them as families who manage to get by, but who have low resilience to economic shocks such as rising inflation and interest rates. Likely to be hit hard by the fall out from Brexit. Which of course the majority of the North East electorate voted for, did it not? \nIndeed it did, but let’s move on. In his first Autumn Statement, Mr Osborne’s successor Philip Hammond is expected to promise help for the group to help them avoid poverty. He said on BBC One’s Andrew Marr Show on Sunday, that he would support people “who work hard and by and large do not feel that they are sharing in the prosperity that economic growth is bringing to the country”. Like us on Facebook", "external_links": [], "published": "2016-11-23T15:00:00.000+02:00", "crawled": "2016-11-23T10:18:51.859+02:00", "highlightTitle": ""}