{"organizations": [], "uuid": "1fc1a6b2361b71f2288333a42eb06f52ea5568e2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/29896079/15684018.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/lavendon-to-beat-profits-expectations/story-29896079-detail/story.html", "country": "US", "domain_rank": 48128, "title": "Lavendon Group set to beat analyst expectations despite Brexit uncertainty | Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "Lavendon Group set to beat analyst expectations despite Brexit uncertainty | Leicester Mercury", "spam_score": 0.452, "site_type": "news", "published": "2016-11-15T18:03:00.000+02:00", "replies_count": 0, "uuid": "1fc1a6b2361b71f2288333a42eb06f52ea5568e2"}, "author": "", "url": "http://www.leicestermercury.co.uk/lavendon-to-beat-profits-expectations/story-29896079-detail/story.html", "ord_in_thread": 0, "title": "Lavendon Group set to beat analyst expectations despite Brexit uncertainty | Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "don kenny", "sentiment": "none"}], "locations": [{"name": "qatar", "sentiment": "none"}, {"name": "uae", "sentiment": "none"}, {"name": "oman", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "kuwait", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}], "organizations": [{"name": "lavendon group", "sentiment": "positive"}, {"name": "eu", "sentiment": "none"}, {"name": "lavendon", "sentiment": "none"}, {"name": "london stock exchange", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Comments (0) \nA Lutterworth firm which rents out cherry pickers is confident of exceeding its sales and profits expectations this year. \nLavendon Group, the market leader in the rental of powered access equipment in Europe and the Middle East, said group total and rental revenues for the nine months to September 30 increased by 9 per cent compared to the same period last year. \nUK rental revenues for the nine months increased by 8 per cent, with Middle East rental revenues up 20 per cent. Across its European operations, rental income rose 2 per cent. \nIn a trading update Lavendon said that in the UK, which accounts for almost half group rental revenues, market share gains continued to drive strong volume growth that combined with an improving pricing environment to generate the increase in rental revenue. \nRead more: Lavendon sees strong performance with no Brexit effect \nThe company, which is listed on the London Stock Exchange, said its Middle East business, which accounts for a quarter of group rental revenues, also continued to deliver strong revenue growth. \nLavendon said: \"Revenue growth from our operations in the UAE, Kuwait, Oman and Qatar has continued to more than absorb a decline in our higher margin Saudi Arabian business.\" \nLavendon has moderated its capital investment in the region this year, compared to recent years. It has instead directed investment towards those markets demonstrating strong growth. \nLavendon said given this more modest investment and a continued focus on working capital management, \"the level of free cash generated from the region is increasing significantly in 2016\". \nIt added: \"The group has continued to deliver strong rental revenue growth reflecting the benefits of the investment in additional fleet and operational processes to improve fleet availability.\" \nIn the wake of the Brexit vote, Lavendon said it was \"too early to assess fully the wider economic implications of the UK's decision to leave the EU\" but that it recognised \"the increased uncertainty in the macroeconomic outlook\". \nRead more: Hydraulic platforms group sees revenues rise \nHowever, the board believes the company \"remains well positioned to manage this uncertainty, with over 50 per cent of its revenues and profits being derived from outside the UK. \n\"As we are seeing in 2016, if there is a prolonged period of sterling weakness, the group's reported results benefit from the translational impact on its overseas earnings which may offer some mitigation should there be any adverse economic consequences on the group arising from the UK's decision [to leave the EU].\". \nDon Kenny, the chief executive of Lavendon, said: \"The group's trading performance has continued to deliver strong revenue growth through the third quarter. \n\"This growth reflects the benefits of our strategic investment programmes in both 2015 and 2016 to strengthen our market position in all regions, together with the further operational improvements we have made to support the delivery of our growth plans. \n\"The board is encouraged by the trading performance to date, and as a consequence of the favourable translational impact on our overseas earnings from the continuing weakness of sterling, we expect the group's results to be marginally ahead of our original expectations for 2016.\" \nShares in Lavendon were changing hands for 136p in early trading, slightly ahead of the 121p share price the day after the EU referendum. ", "external_links": [], "published": "2016-11-15T18:03:00.000+02:00", "crawled": "2016-11-15T13:55:58.696+02:00", "highlightTitle": ""}