{"organizations": [], "uuid": "9bb9e0d36a0748e643df34c4e0de992f169dac6f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12131488.ece/ALTERNATES/s1200/EU-referendum.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/britains-manufacturers-set-reduce-investment-12129346", "country": "GB", "domain_rank": 21960, "title": "Britain's manufacturers set to reduce investment as uncertainty spreads", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Britain's manufacturers set to reduce investment as uncertainty spreads", "spam_score": 0.0, "site_type": "news", "published": "2016-11-07T07:01:00.000+02:00", "replies_count": 0, "uuid": "9bb9e0d36a0748e643df34c4e0de992f169dac6f"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/britains-manufacturers-set-reduce-investment-12129346", "ord_in_thread": 0, "title": "Britain's manufacturers set to reduce investment as uncertainty spreads", "locations": [], "entities": {"persons": [{"name": "santande", "sentiment": "negative"}, {"name": "charles garfit", "sentiment": "none"}, {"name": "david davies/pa wire", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "santander", "sentiment": "none"}, {"name": "liz mayes", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "uk manufacturing", "sentiment": "none"}, {"name": "eef", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "santander corporate & commercial", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Britain's manufacturers set to reduce investment as uncertainty spreads Survey from EEF and Santander points to growing uncertainty after the EU referendum Share Workers in a factory (Photo: David Davies/PA Wire) Share Get business   Thank you for subscribing!   \nBritain’s manufacturers are set to pare back investment in plant and machinery over the next two years in response to increased uncertainty in the post-referendum world, a new survey suggests. \nThe poll by manufacturers’ organisation EEF and banking multi-national Santander shows that political uncertainty amongst manufacturers has reached the highest levels on record since the EU referendum, adding to caution in the sector. \nThe EEF/Santander 2016 Investment Monitor, conducted in March and again in August to assess any post-Brexit impact, shows that investment remains stable in the short term, with firms planning to spend to satisfy current capital and customer needs. \nBut EEF says the outlook further ahead is far more uncertain as major developments over the coming year and beyond could tip the investment balance either way. \nEarlier this week a separate survey showed that manufacturing exports had been boosted by the plunge in sterling, but companies were seeing costs rise at the fastest pace for nearly 25 years. \nThe Markit/CIPS UK Manufacturing purchasing managers’ index (PMI) said output hit 54.3 in October, down from 55.5 in September, and below economists’ expectations of 54.4. \nLiz Mayes, EEF’s director in the North East, said: “Fears of an immediate collapse in business investment appear to be unfounded for now. UK manufacturers have been investing at a healthy pace in recent years and while that rate of increase wasn’t going to continue forever, keeping up with customer needs and the competition is ensuring that investment stays on track for many. \n“But, the spike in political risk should not go unnoticed. There is caution amongst businesses, which will inevitably make it more difficult to get big decisions across the line. It’s over to the Autumn statement now to press ahead with policies that further enhance the UK business environment for spending on modern machinery and increasingly important intangible investment.” Read More Brexit takes £170,000 bite out of North East workwear business \nCharles Garfit, head of manufacturing at Santander Corporate & Commercial, said: “It is an understandable reaction from manufacturers to scale back on investment, given the uncertainty, particularly as it follows a relatively buoyant phase for the sector. However, manufacturers are also seizing the moment as there are emerging opportunities for ramping up export activity and diversifying operations for manufacturers of all sizes.” \nAccording to the survey 60% of manufacturers are planning to spend the same or less on plant and machinery over the next two years, up from 54% in 2015 and 51% in 2014. The proportion of manufacturers spending a higher percentage of their business turnover – 25% or more – has also fallen by half, to 5% in 2016 from 10% back in 2014. \nAnd while manufacturers’ view of export prospects improved between March and August on the back of better demand in Europe and the United States, they have become more pessimistic about the prospects for the domestic outlook. \nIn March 5% of companies cited political uncertainty as a reason for not increasing investment. By August this had jumped to one in four firms. Share", "external_links": [], "published": "2016-11-07T07:01:00.000+02:00", "crawled": "2016-11-07T02:18:11.483+02:00", "highlightTitle": ""}