{"organizations": [], "uuid": "553d3590d68f67132fff12f8d970c2262d9deee5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article9018081.ece/ALTERNATES/s1200/barratt.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/barratt-appoints-new-north-east-12185442", "country": "GB", "domain_rank": 21960, "title": "Barratt appoints new North East MD and says housing market is 'robust'", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Barratt appoints new North East MD and says housing market is 'robust'", "spam_score": 0.0, "site_type": "news", "published": "2016-11-16T21:47:00.000+02:00", "replies_count": 0, "uuid": "553d3590d68f67132fff12f8d970c2262d9deee5"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/barratt-appoints-new-north-east-12185442", "ord_in_thread": 0, "title": "Barratt appoints new North East MD and says housing market is 'robust'", "locations": [], "entities": {"persons": [{"name": "barratt", "sentiment": "negative"}, {"name": "charlie campbell", "sentiment": "none"}, {"name": "robin hardy", "sentiment": "none"}, {"name": "martin", "sentiment": "none"}, {"name": "david thomas", "sentiment": "none"}, {"name": "scott martin", "sentiment": "none"}, {"name": "mike roberts", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "west end and city", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "shore capital markets", "sentiment": "none"}, {"name": "barratt developments north east", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "kpmg", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Barratt appoints new North East MD and says housing market is 'robust' Company is reviewing prices in London as market for top-end properties becomes more challenging Share Get business updates     \nDeveloper Barratt has appointed a new managing director for its North East heartland. \nScott Martin, who has worked for Barratt Developments North East since 2008 and was most recently finance director, succeeds Mike Roberts as MD after he stepped up to a role covering the whole of the North. \nMr Martin, who previously held senior positions with accountants KPMG, has been part of the regional management team that has doubled unit volume in the last six years. \nMr Martin said: “I am incredibly proud to have taken up the managing director position at Barratt Developments North East in what is a very exciting time for the company. This year has been a hugely successful one, with record sales success giving us an increase of more than 25% year on year across the North East. \n“I know this is testament to the hard work that is done across all parts of the company at all levels, which makes us the five star housebuilder we are. I am confident that this growth will continue as we work hard to provide quality housing across the region.” \nThe appointment at the North East-founded company came as the firm issued a trading update saying that Britain’s housing market remains “robust”, but revealed it is reviewing prices in London after softer sales across the capital. \nBarratt said that, while the wider UK property sector was “healthy” in spite of Brexit uncertainty, the market for high-end homes in London was “challenging”. \n“To mitigate these risks we have taken pricing action on a number of our sites in London,” the company said. \nAcross the UK, Barratt reported an average weekly sales rate of 0.74 net private reservations for each active outlet from July 1 to November 13, higher than an average of 0.71 a year earlier. \nTotal forward sales, which account for joint ventures, were up 4.3% to £2.65bn. \nChief executive David Thomas said: “This has been another good trading period for the group. Consumer demand is strong, supported by good mortgage availability. \n“We are mindful of the potential for economic uncertainty created by the outcome of the EU referendum. However, market fundamentals are robust, and we remain a housebuilder of choice.” \nBarratt said trading has been in line with market expectations and that it is on track to hit its 20% gross margin target, despite “headwinds” in the London market. \nCommenting on Barratt’s trading update, Shore Capital Markets analyst Robin Hardy said: “Generally the commentary on London is cautious in our view, and that is understandable as Barratt still has a material amount of development in central London (West End and City) and demand has slowed and prices are reported to be falling.” \nLiberum housebuilding analyst Charlie Campbell expects prices to drop further. \n“We continue to expect house price falls of 2.5% in 2017 if the economy slows as forecast.” Like us on Facebook", "external_links": [], "published": "2016-11-16T21:47:00.000+02:00", "crawled": "2016-11-16T17:23:10.343+02:00", "highlightTitle": ""}