{"organizations": [], "uuid": "9c28b3270b234439de05faaf8b2f07e6b5df764b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12184197.ece/ALTERNATES/s1200/Unemployment-figures.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/post-brexit-effect-amount-north-12184092", "country": "GB", "domain_rank": 21960, "title": "The post-Brexit effect? Amount of North East people in work reaches record high", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "The post-Brexit effect? Amount of North East people in work reaches record high", "spam_score": 0.0, "site_type": "news", "published": "2016-11-16T19:19:00.000+02:00", "replies_count": 0, "uuid": "9c28b3270b234439de05faaf8b2f07e6b5df764b"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/post-brexit-effect-amount-north-12184092", "ord_in_thread": 0, "title": "The post-Brexit effect? Amount of North East people in work reaches record high", "locations": [], "entities": {"persons": [{"name": "paul carbert", "sentiment": "none"}, {"name": "david freeman", "sentiment": "none"}, {"name": "damien hinds", "sentiment": "none"}, {"name": "clare mcneil", "sentiment": "none"}, {"name": "steve mccall", "sentiment": "none"}, {"name": "damian hinds", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "jobcentre plus", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north east england", "sentiment": "none"}], "organizations": [{"name": "chamber of commerce", "sentiment": "none"}, {"name": "ippr", "sentiment": "none"}, {"name": "ons", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The entrance to a Jobcentre Plus (Photo: Philip Toscano/PA Wire) Share Get daily   Thank you for subscribing!   \nRecord numbers of people in the North East are now in work, according to the first full set of figures released post-Brexit . \nIn all, 1.2 million people in this region have jobs, compared to 79,000 people who are officially out of work. \nIn the three months from July to September, the North East unemployment rate fell by 1.5% to 6.1%. \nAlthough this is still the highest in the UK and compares to a national average of 4.8%, the gap is at its narrowest since 2010. \nHowever, the claimant count has gone up 800 to 51,900 in the last three months, a 4,400 increase on this time last year. Employment minister Damien Hinds \nEmployment Minister Damian Hinds was upbeat about the figures and said: “Yet again we have a strong set of figures, with employment continuing to run at a record high and unemployment falling to a 11-year low. \n“Growth is being fuelled by full-time professional jobs while wages are continuing to perform strongly, which underlines the resilience of the UK labour market. \n“There’s great news in the North East where the number of people in work has risen by 51,000 over the past year, with a record 1.2 million people in work. \n“The measures we have taken have put our economy in a position of strength, and we will work to ensure more people can benefit from these opportunities as we build a country that works for everyone.” Paul Carbert, policy advisor, North East England Chamber of Commerce \nMeanwhile Paul Carbert, policy adviser at the North East England Chamber of Commerce , said: “These figures give us positive news on the labour market in the North East. \n“They show that participation in the labour market and the number of people in employment has increased in the past year, and unemployment has fallen by 30,000. \n“Although we still have the highest unemployment rate in the country, the gap between the North East unemployment rate and the national average is at its lowest since 2010.” \nSteve McCall, of Jobcentre Plus in the region, said the figures continue an upward trend in recent months - which is likely to continue. \nHe said: “Employment figures have risen to a record high, which is great news. \n“There are plenty of job opportunities across the board so it is positive news for the North East.” Read More \nHowever he added: “The claimant count figure has gone up in part because we have included the Universal Credit figures for the first time.” \nBut some notes of caution were sounded. \nONS statistician David Freeman himself said: “Unemployment is at its lowest for more than 10 years and the employment rate remains at a record high. \n“Nonetheless, there are signs that the labour market might be cooling, with employment growth slowing.” \nAnd Clare McNeil, of the IPPR North think tank, said: “While we should welcome these latest jobs figures, we should keep a close eye on how particular industries and occupations are faring as we negotiate the uncertain period ahead for the economy. \n“In headline terms, the latest employment figures look encouraging with increases in employment and fewer people unemployed. \n“While this is promising for the economy given the uncertainty following the vote to leave the EU , it is still the case that almost half of the increase in employment compared with the same period last year is due to higher rates of self-employment. \n“Almost half of the UK’s self-employed are in low pay, measured on an hourly basis, compared with around a fifth of employees. \n“While the overall picture in terms of vacancies still looks strong, officials statistics cannot tell us what is happening in specific industries or occupations. \n“Caution is needed as data from IPPR and Burning Glass shows that there was a significant slump in vacancies in the finance sector between May/June to July/August, with a 13.6% drop in vacancies in the finance sector in London, and a 10% drop in England as a whole.” Like us on Facebook", "external_links": [], "published": "2016-11-16T19:19:00.000+02:00", "crawled": "2016-11-16T14:36:25.514+02:00", "highlightTitle": ""}