{"organizations": [], "uuid": "d5af0cafd811458839152c2987beee0bc1a6db2f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article11082960.ece/ALTERNATES/s1200/JS85666692.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/news/north-east-news/nissan-deal-shows-still-global-12172110", "country": "GB", "domain_rank": 21960, "title": "Nissan 'deal' shows we are still a global leader, says Prime Minster Theresa May", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Nissan 'deal' shows we are still a global leader, says Prime Minster Theresa May", "spam_score": 0.0, "site_type": "news", "published": "2016-11-14T20:00:00.000+02:00", "replies_count": 0, "uuid": "d5af0cafd811458839152c2987beee0bc1a6db2f"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/nissan-deal-shows-still-global-12172110", "ord_in_thread": 0, "title": "Nissan 'deal' shows we are still a global leader, says Prime Minster Theresa May", "locations": [], "entities": {"persons": [{"name": "theresa may nissan", "sentiment": "negative"}, {"name": "greg clark", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "jon trickett", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "qashqai", "sentiment": "none"}, {"name": "mansion house", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "wales", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "downing street", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "nissan", "sentiment": "negative"}, {"name": "labour", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Nissan 'deal' shows we are still a global leader, says Prime Minster Theresa May Prime Minister highlights Nissan investment as evidence the UK is still a global economic powerhouse Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nTheresa May is claiming the Government’s success in convincing Nissan to continue investing in the North East proves the UK can still be a global leader after Brexit. \nThe Prime Minister is highlighting Nissan’s decision to build the next Qashqai and X-Trail models at its Sunderland factory , safeguarding more than 7,000 jobs, in a speech on Monday night. \nShe is to argue that the UK has an “historic global opportunity” to make the case for free markets and free trade. \nAnd she will highlight two examples showing “our commitment to the UK’s future competitiveness”, including what she calls “a new deal with Nissan in the North East”. \nIn the past, Downing Street has denied there was any deal with Nissan, insisting instead that it had simply promised the carmaker it would get the best deal possible for the automotive sector in its negotiations with the EU. \nIt emerged earlier this month that the European Commission was examining the details of Britain’s arrangement with Nissan. \nOfficials in Brussels have contacted the UK government to find out what promises Business Secretary Greg Clark made to the Japanese carmaker. \nThe UK is still bound by EU rules which ban it from offering state aid in most circumstances. Qashqai production at Nissan's Sunderland plant \nA European commission spokesman said earlier this month: “We have seen press reports regarding this issue. As a result, the commission at services level is in contact with the UK authorities. Such exchanges of information are common.” \nIn a speech at Mansion House, the official residence of the Lord Mayor of London, Mrs May will warn that firms which “game the system” or fail to play by the rules undermine the reputation of business as a whole. This echoes the arguments she made in her speech to the Conservative conference in October, when she said the Government would take action against employers who fail to treat staff or consumers fairly. \nShe will say: “We will do everything we can to make the UK outside the EU the most attractive place for businesses to invest and grow. \n“Already by showing our commitment to the UK’s future competitiveness, we have secured a new deal with Nissan in the North East and a ground-breaking agreement with America that Wales will not just be the European hub, but rather the global hub for maintaining, repairing, overhauling and upgrading the F35 fighter aircraft. \n“And, as I have said, through our industrial strategy we will pro-actively support the industries of the future and rebalance the economy across sectors and areas in order to spread wealth and prosperity around the country.” \nMrs May will add: “But in return, it is right to ask business to play its part in ensuring we build a country that works for everyone. And that British business, which is so often on the frontline of our engagement with the world and whose actions so often project our values in the world, is seen not just to do business but to do that business in the right way.” Read More Theresa May's reassurance to Nissan 'helped secure Sunderland plant investment' \nThe Prime Minister will say the UK has an opportunity “to be the strongest global advocate for free markets and free trade”, but she will also warn: “When a minority of businesses and business figures appear to game the system and work to a different set of rules, the social contract between businesses and their employees fails – and the reputation of business as a whole is quickly undermined. “ \nJon Trickett, Labour’s National Campaign Co-ordinator, said: “Theresa May has spent the early days of her time in No. 10 giving speeches about spreading opportunity and providing leadership but her actions have betrayed her. \n“She simply represents more of the same failed politics. \n“She talks about leading Europe. But has no plan for Brexit. She talks about extending opportunity. But Britain’s working people are worse off. And she talks about transforming the economy. But all that is on offer is more cuts, poor investment and little, if any, growth.” Share", "external_links": [], "published": "2016-11-14T20:00:00.000+02:00", "crawled": "2016-11-14T15:34:20.220+02:00", "highlightTitle": ""}