{"organizations": [], "uuid": "2d11cd329b2f3bd8632031b4d468f4067dee6cfa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12170809.ece/ALTERNATES/s1200/JS102997270.jpg", "site_section": "http://www.topix.com/rss/wire/world/europe", "section_title": "", "url": "http://www.chroniclelive.co.uk/sport/football/football-news/sunderland-face-95m-bill-javier-12170317", "country": "US", "domain_rank": 21960, "title": "Sunderland face A 9.5m bill if Javier Manquillo plays 25 matches for them this season", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 0, "title_full": "Sunderland face A 9.5m bill if Javier Manquillo plays 25 matches for them this season", "spam_score": 0.0, "site_type": "news", "published": "2016-11-14T14:56:00.000+02:00", "replies_count": 0, "uuid": "2d11cd329b2f3bd8632031b4d468f4067dee6cfa"}, "author": "", "url": "http://www.chroniclelive.co.uk/sport/football/football-news/sunderland-face-95m-bill-javier-12170317", "ord_in_thread": 0, "title": "Sunderland face A 9.5m bill if Javier Manquillo plays 25 matches for them this season", "locations": [], "entities": {"persons": [{"name": "javier manquillo", "sentiment": "negative"}, {"name": "moyes", "sentiment": "none"}, {"name": "jones", "sentiment": "none"}, {"name": "advocaat", "sentiment": "none"}, {"name": "sam allardyce", "sentiment": "none"}, {"name": "hector bellerin", "sentiment": "none"}, {"name": "dick advocaat", "sentiment": "none"}, {"name": "denayer", "sentiment": "none"}, {"name": "donald love", "sentiment": "none"}, {"name": "jason denayer", "sentiment": "none"}, {"name": "gustavo poyet", "sentiment": "none"}, {"name": "ricardo alvarez", "sentiment": "none"}, {"name": "ashley fletcher", "sentiment": "none"}, {"name": "david moyes", "sentiment": "none"}, {"name": "billy jones", "sentiment": "none"}, {"name": "manquillo", "sentiment": "none"}, {"name": "santiago vergini", "sentiment": "none"}, {"name": "phil bardsley", "sentiment": "none"}, {"name": "alvarez", "sentiment": "none"}, {"name": "vergini", "sentiment": "none"}], "locations": [{"name": "argentina", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}, {"name": "boca juniors", "sentiment": "none"}, {"name": "getafe", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "liverpool", "sentiment": "none"}, {"name": "austria", "sentiment": "none"}, {"name": "vergini", "sentiment": "none"}, {"name": "marseille", "sentiment": "none"}, {"name": "albacete", "sentiment": "none"}], "organizations": [{"name": "sport sunderland", "sentiment": "negative"}, {"name": "sunderland", "sentiment": "negative"}, {"name": "inter", "sentiment": "none"}, {"name": "west ham united", "sentiment": "none"}, {"name": "player registration committee", "sentiment": "none"}, {"name": "st polten", "sentiment": "none"}, {"name": "inter milan", "sentiment": "none"}, {"name": "atletico madrid", "sentiment": "none"}, {"name": "la liga", "sentiment": "none"}, {"name": "sampdoria", "sentiment": "none"}, {"name": "sunderland afc", "sentiment": "none"}, {"name": "premier league", "sentiment": "none"}, {"name": "atleti", "sentiment": "none"}, {"name": "fifa", "sentiment": "none"}, {"name": "black cats", "sentiment": "none"}, {"name": "court of arbitration", "sentiment": "none"}, {"name": "invalid email  sunderland", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Sport Sunderland face £9.5m bill if Javier Manquillo plays 25 matches for them this season Out-of-favour right-back Javier Manquillo will join Sunderland permanently if he makes a further 18 appearances for them this season Share Sunderland's Javier Manquillo and West Ham United's Ashley Fletcher (Photo: PA Wire) Share Get Sunderland AFC updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nSunderland will have to pay £9.5million for Javier Manquillo if the out-of-favour right-back makes another 18 appearances this season. \nThe 22-year-old is on a year-long loan from Atletico Madrid, and the terms under which the deal will become permanent have been revealed. \nManquillo has lost his place in the Black Cats’ first choice XI since the return to fitness of Billy Jones – but if he makes 25 appearances this season, Sunderland will be obliged to buy him. \nIt is not clear if relegation would nullify the clause, although this seems likely. \nThe Black Cats have another 27 Premier League matches to play this season, plus at least one in the FA Cup. \nJones was cast aside by Sam Allardyce in February and seemed to be on his way out in the summer when new manager David Moyes looked for new right-backs in the summer, signing Manquillo and Donald Love, plus central defender Jason Denayer, who can also play full-back. \nBut despite starting his first seven matches after joining, Manquillo is yet to fully convince in English football, while Love was cast aside as soon as the Spaniard joined. He has been used more in midfield recently, as has the on-loan Denayer since his return from injury. \nThis is Manquillo’s second spell in the Premier League, having spent 2014-15 on a season-long loan at Liverpool, where he made ten league appearances. He spent last season on loan at Marseille. \nManquillo has made just six La Liga appearances for European Cup finalists Atleti, one from the bench. \nHis unconvincing club form did not stop him being called up as cover for the injured Hector Bellerin for Spain’s European Under-21 Championship qualifier against Austria, however. Manquillo was on the bench in Friday’s first leg in St Polten, which ended 1-1. The return leg is in Albacete on Tuesday. Read More Jason Denayer admits he is 'very happy' at Sunderland as he continues to regain his fitness \nSunderland have made frequent use of the loan market in recent years, and clauses such as this have caused them problems in the past. \nIn 2015 they were obliged to buy Santiago Vergini for £2m after the Argentina international had consecutive spells at the Stadium of Light totalling 18 months, during which he made 51 appearances, \nThe first 47 of those matches came under his fellow South American Gustavo Poyet, but by the time Vergini officially became a Sunderland player, Dutchman Dick Advocaat was the head coach. Vergini never played again for the club after joining permanently. \nHe initially moved to Getafe on a season-long loan and the Spanish side were obliged to buy the player until they were relegated from La Liga. Advocaat’s successor Sam Allardyce sold Vergini to Boca Juniors for a nominal fee shortly before leaving to become England manager. \nPotentially much more costly was Ricardo Alvarez’s loan from Inter Milan in 2014-15. \nAgain, Sunderland had agreed to make the move permanent, this time if they avoided relegation, which they did. \nHowever, after a dismal season from the Argentine playmaker they tried to renege on the deal, arguing he was not fit to sign because Inter had blocked knee surgery. With Inter not wanting the player either, Alvarez became a free agent and signed for Sampdoria. \nThe issue of whether the Wearsiders ought to have paid around £8.5m for Alvarez – a fee that will have since risen because of the falling value of the pound against the Euro post-Brexit – remains unresolved, with the Court of Arbitration expected to rule on it on December 9 after Fifa’s Player Registration Committee apparently found in Inter’s favour. \nThere will be no issues for Sunderland if Manquillo can fulfil the potential Moyes has seen in him, or if Jones can make himself a regular selection, but if right-back continues to be the problem position it has been since Phil Bardsley left in 2014, it could give Moyes some difficult and potentially costly selection decisions later in the season. Share", "external_links": [], "published": "2016-11-14T14:56:00.000+02:00", "crawled": "2016-11-14T10:46:44.403+02:00", "highlightTitle": ""}