{"organizations": [], "uuid": "a3d38282fefc8cfe262593bd5a4b1b9920c21e6c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article11824484.ece/ALTERNATES/s1200/JS98351135.jpg", "site_section": "http://www.thejournal.co.uk/sport/?service=rss", "section_title": "nechronicle - Sport", "url": "http://www.chroniclelive.co.uk/sport/football/football-news/lee-cattermoles-mystery-injury-finally-12198439", "country": "GB", "domain_rank": 21960, "title": "Has Lee Cattermole's mystery injury finally been cured? David Moyes hopes so", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Has Lee Cattermole's mystery injury finally been cured? David Moyes hopes so", "spam_score": 0.0, "site_type": "news", "published": "2016-11-19T00:11:00.000+02:00", "replies_count": 0, "uuid": "a3d38282fefc8cfe262593bd5a4b1b9920c21e6c"}, "author": "James Hunter", "url": "http://www.chroniclelive.co.uk/sport/football/football-news/lee-cattermoles-mystery-injury-finally-12198439", "ord_in_thread": 0, "title": "Has Lee Cattermole's mystery injury finally been cured? David Moyes hopes so", "locations": [], "entities": {"persons": [{"name": "lee", "sentiment": "negative"}, {"name": "lee cattermole", "sentiment": "negative"}, {"name": "david moyes", "sentiment": "negative"}, {"name": "sport has lee cattermole", "sentiment": "negative"}, {"name": "moyes", "sentiment": "none"}, {"name": "seb larsson", "sentiment": "none"}, {"name": "cattermole", "sentiment": "none"}, {"name": "steven pienaar", "sentiment": "none"}, {"name": "jan kirchhoff", "sentiment": "none"}, {"name": "vito mannone", "sentiment": "none"}, {"name": "fabio borini", "sentiment": "none"}], "locations": [{"name": "atlantic", "sentiment": "none"}, {"name": "hull city", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "usa", "sentiment": "none"}, {"name": "bournemouth", "sentiment": "none"}], "organizations": [{"name": "sunderland", "sentiment": "neutral"}, {"name": "trump' - sunderland", "sentiment": "none"}, {"name": "manchester united", "sentiment": "none"}, {"name": "black cats", "sentiment": "none"}, {"name": "kirch", "sentiment": "none"}, {"name": "tigers", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Sport Has Lee Cattermole's mystery injury finally been cured? David Moyes hopes so Sunderland's Lee Cattermole has struggled with injury problems all season, and has now been ruled out for four months after undergoing hip surgery Share Get Sunderland AFC   \nDavid Moyes is praying Sunderland have finally got to the bottom of the injury problems that have dogged Lee Cattermole. \nThe influential midfielder has this week undergone surgery in the USA for torn cartilage in his hip, and is expected to be out of action for around four months. \nCattermole has made just two league appearances for the Black Cats this season, with his absence first put down to a hernia problem - for which he went under the knife in August - and then to a back injury. \nBut now a specialist on the other side of the Atlantic has found a problem with his hip and Moyes hopes this latest operation will finally solve the issue. Read More Sunderland's Lee Cattermole blow: Who should replace key man in Black Cats midfield? \n“I think this could be the whole thing, and maybe it had just not been diagnosed correctly previously,” he said. \n“Initially we thought it was a hernia, then we thought he had something wrong with his back, and we had some other treatment for him. \n“But eventually last week we sent him to see a specialist in America who has found a tear in the cartilage in his hip. \n“He has had the operation, and he is due back here in probably a day or two. \n“We think he will be out for somewhere between three and four months. \n“We have to wait and see if this is the right thing, as well. \n“What we don’t want is to find that this doesn’t cure the problem for Lee either. \n“Hopefully, though, this time we have gotten to the bottom of it.” \nThe lengthy lay-off means Cattermole is unlikely to be ready to resume playing until the middle of March, and even then he would need time to build up match fitness. \nHowever Moyes is not yet ready to write-off the 28-year-old for the remainder of the season. Read More \nHe said: “I don’t know if it is the end of his season. \n“Depending on how it goes, maybe we will get him back a bit quicker than that. \n“But in all my time in football, I have never heard of any player needing this operation so it’s not something I can say I know a little bit about. \n“I’m completely in the dark, so I don’t know if it is something you can recover quickly from, or whether it takes longer.” \nHowever long he remains on the sidelines, Cattermole’s experience and competitive spirit will be missed. \nHe has been a key member of the Sunderland sides that have beaten relegation for the last four seasons. \nMoyes admitted: “I feel as though we have missed his leadership, his presence, and what he brings, and we will continue to miss that while he is out.” \nWhile Cattermole is out long-term, Moyes says Jan Kirchhoff is continuing to progress as he recovers from the hamstring injury that has kept him out for six weeks. \nThe German midfielder is back in training and, while he is not ready to feature against Hull City tomorrow, he could be eased back into action when Sunderland’s U23 side visit Manchester United on Monday. \nMoyes said: “Kirch is back training, but not ready to play yet. Read More 'Worse than Brexit and Trump' - Sunderland fans react as Lee Cattermole is ruled out for four months \n“I might look to see how he is and maybe play him in the reserves on Monday night, because we could do with getting him back in amongst it.” \nSeb Larsson is in contention for the game against the Tigers now he has recovered from knee ligament damage, while Vito Mannone could be back on the bench after getting over the elbow problem that has kept him out since August. \nBut Fabio Borini still has a long way to go before he is ready to return from his adductor injury. \nAnd midfielder Steven Pienaar will sit out the Hull City game as he serves a one-match suspension following his red card in the win at Bournemouth a fortnight ago. \nMoyes said: “It’s really disappointing to lose Steven Pienaar because when you look at his performances, his influence and impact has given us some calm and composure. \n“We will miss him tomorrow, but it gives someone another opportunity.” Read More", "external_links": [], "published": "2016-11-19T00:11:00.000+02:00", "crawled": "2016-11-18T19:50:57.206+02:00", "highlightTitle": ""}