{"organizations": [], "uuid": "f06c080b40218c530552ffaf37b4b40d15a50240", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12166682.ece/ALTERNATES/s1200/JS104616034.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/uk-news/donald-trump-supporters-arent-mysogynistic-12166678", "country": "GB", "domain_rank": 21960, "title": "Why Donald Trump supporters aren't all mysogynistic white supremacists", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Why Donald Trump supporters aren't all mysogynistic white supremacists", "spam_score": 0.0, "site_type": "news", "published": "2016-11-13T01:00:00.000+02:00", "replies_count": 0, "uuid": "f06c080b40218c530552ffaf37b4b40d15a50240"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/uk-news/donald-trump-supporters-arent-mysogynistic-12166678", "ord_in_thread": 0, "title": "Why Donald Trump supporters aren't all mysogynistic white supremacists", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "negative"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "ku klux klan", "sentiment": "none"}, {"name": "barack obama", "sentiment": "none"}, {"name": "david duke", "sentiment": "none"}, {"name": "martinez monsivais", "sentiment": "none"}, {"name": "michelle", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "melania", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "oval office of the white house", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "wall street journal", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Why Donald Trump supporters aren't all mysogynistic white supremacists It's hypocrisy to brand US president-elect Donald Trump's fans as bigots with bigoted comments Share News Opinion President Barack Obama listens to President-elect Donald Trump speak to members of the media during their meeting in the Oval Office of the White House in Washington (Photo: AP Photo/Pablo Martinez Monsivais) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nNot all of Donald Trump’s supporters are misogynistic white supremacists, just like all Brexit supporters aren’t thick and racist. \nOK, there are some - eg Ku Klux Klan leader David Duke, whose weird looking mug probably explains his membership of a group with a history of wearing white pillowcases over their head, but not everybody. \nBut to characterise all 60m US citizens who voted for Trump and the 17m+ in the UK who voted for Brexit as anti social Neanderthals is both counter productive and hypocritical. \nThose who do this seem to forget they themselves are displaying the bigotry that is at the core of their criticism as bigotry is intolerance towards those who hold different opinions to you. \nIf we are truly going to make sense of all that has happened of late and have any chance of moving forward in a progressive way it has to stop and talking - not shouting and ranting - has to begin. \nAnd, thankfully, at least two people are taking this line, namely outgoing US President Barack Obama and his wife Michelle. \nThe rapprochement began when the couple received Trump and his wife Melania at the White House. \nWith the amount of malicious and malign grief Obama has received from Trump, who would have blamed him if he’d flipped the bird behind Trump’s back when he arrived or did the old ‘rabbit’s ears’ sign when they lined up for the official snaps. President Barack Obama and President-elect Donald Trump shake hands following their meeting in the Oval Office of the White House in Washington (Photo: AP Photo/Pablo Martinez Monsivais) \nBut Obama’s a classier man than me and whatever he thought personally of him, he put it aside out of respect of the job that Trump will take on after his inauguration in January. \nBoth Trump and his wife were treated with great respect and courtesy. As a result, afterwards, and for the first time since I can remember, Trump appeared on TV restrained, conciliatory and personable. \nAnd maybe I’m reading too much into it, but the talk now is of Trump taking a step back from his hard line stance on the campaign trail. \nHe had said he would “immediately repeal and replace” Obamacare after taking office, but told the Wall Street Journal he might instead seek to reform the policy, keeping the ban on insurers denying coverage for pre-existing conditions. Read More \nHe said he would also look to retain the provision that allowed young adults to be insured on their parents’ policies. \nTrump even admitted the prosecution of Hillary Clinton over confidential emails was not a priority. \nAny why the change of heart? He said he had been convinced of the virtues of the two health care points in his meeting with outgoing Obama on Thursday. \nThat is how you progress. Ditch the bombast, the grandstanding, the insults and the detritus people have become so sick of in politics and actually talk things through. What all sides need to improve their lot actually isn’t that different and it has nothing to do with ethnicity, gender or race. Share", "external_links": [], "published": "2016-11-13T01:00:00.000+02:00", "crawled": "2016-11-12T20:36:32.532+02:00", "highlightTitle": ""}