{"organizations": [], "uuid": "b15296b38607f62b83cec6930636dc5af7866ec9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12183333.ece/ALTERNATES/s1200/Brexit.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/brexit-vote-not-legally-binding-12183302", "country": "GB", "domain_rank": 21960, "title": "Brexit vote not legally binding, says judge - so will the UK remain in Europe?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Brexit vote not legally binding, says judge - so will the UK remain in Europe?", "spam_score": 0.0, "site_type": "news", "published": "2016-11-16T18:13:00.000+02:00", "replies_count": 0, "uuid": "b15296b38607f62b83cec6930636dc5af7866ec9"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/brexit-vote-not-legally-binding-12183302", "ord_in_thread": 0, "title": "Brexit vote not legally binding, says judge - so will the UK remain in Europe?", "locations": [], "entities": {"persons": [{"name": "baroness hale", "sentiment": "negative"}, {"name": "theresa may", "sentiment": "none"}, {"name": "dominic raab", "sentiment": "none"}, {"name": "hale", "sentiment": "none"}, {"name": "lady hale", "sentiment": "none"}, {"name": "iain duncan smith", "sentiment": "none"}, {"name": "toby melville/pa wire", "sentiment": "none"}], "locations": [{"name": "richmond", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "kuala lumpur", "sentiment": "none"}], "organizations": [{"name": "european union", "sentiment": "none"}, {"name": "european economic community", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "jack taylor/pa wire", "sentiment": "none"}, {"name": "cabinet office", "sentiment": "none"}, {"name": "supreme court", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Baroness Hale of Richmond (Photo: Supreme Court/PA Wire) Share Get daily   Thank you for subscribing!   \nA Brexit storm has blown up after a supreme court judge hearing the Government’s appeal against the Brexit legal challenge has said the EU referendum is not legally binding. \nShould Leave campaigners be worried and does it offer hope to those who want to stay in Europe? We answer your questions. \nAnother day, another Brexit bust up. What’s the latest one? \nIt seems a Supreme Court judge, Lady Hale has said the Government would have to comprehensively replace existing EU legislation before the Government could even begin Brexit. Who is Lady Hale? \nShe is one of a panel of 11 justices who will decide whether parliamentary approval is needed before the Government can formally apply to quit the EU. What does she think the Government might have to do? The Union flag flies alongside the EU flag (Photo: Toby Melville/PA Wire) \nShe wonders whether the Government would have to produce a comprehensive replacement of The European Communities Act 1972 took the UK into the then European Economic Community. And what is her attitude towards the EU referendum which voted 52% to 48% to leave the EU? \nIn her speech made to students in Kuala Lumpur, she said that while the British electorate had voted to leave the EU , “that referendum was not legally binding on parliament”. What did she think of the Government position? \nShe put forward the argument that the Government was likely to make, saying it would suggest: “The basis on which the referendum was undertaken was that the Government would give effect to the result. Beginning the process would not change the law.” And what is the Government doing now? Prime Minister Theresa May, whose Government has no Brexit plan and a poor understanding of what leaving the European Union means for industry, according to a leaked memo prepared for the Cabinet Office (Photo: Jack Taylor/PA Wire) \nThere are reports it has prepared a short three-line bill aimed at helping May stick to her March deadline for triggering Article 50 if the supreme court ruled that was necessary. Ministers are said to have drawn up short legislation that would be difficult to amend. How warmly have Lady Hale’s comments been greeted? \nWhat do you think? Lots of sound and fury from Leave campaigners. The former work and pensions secretary Iain Duncan Smith said Hale had pro-EU views and warned that it was not the job of judges to tell parliament what to do, not believe that would be a majority view in the supreme court. Anyone else? \nHis fellow Tory MP Dominic Raab did not question whether the comments suggested which way Hale would sway but argued that she simply should not have made any public comments. Read More", "external_links": [], "published": "2016-11-16T18:13:00.000+02:00", "crawled": "2016-11-16T13:37:05.485+02:00", "highlightTitle": ""}