{"organizations": [], "uuid": "8459e4af3a9e9ee60329b946dcdf3fbc5504484f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article10017443.ece/ALTERNATES/s1200/JS27892950.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/business-breakfast-live-12179676", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Barratt developments to review house prices as sales soften, plus latest news", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast LIVE: Barratt developments to review house prices as sales soften, plus latest news", "spam_score": 0.0, "site_type": "news", "published": "2016-11-16T15:20:00.000+02:00", "replies_count": 0, "uuid": "8459e4af3a9e9ee60329b946dcdf3fbc5504484f"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/business-breakfast-live-12179676", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Barratt developments to review house prices as sales soften, plus latest news", "locations": [], "entities": {"persons": [{"name": "trent", "sentiment": "negative"}, {"name": "barratt", "sentiment": "negative"}, {"name": "severn trent", "sentiment": "none"}, {"name": "david thomas", "sentiment": "none"}, {"name": "james martin", "sentiment": "none"}, {"name": "ancala", "sentiment": "none"}, {"name": "dee valley", "sentiment": "none"}, {"name": "mikael", "sentiment": "none"}, {"name": "liv garfield", "sentiment": "none"}], "locations": [{"name": "scotland", "sentiment": "none"}, {"name": "north wales", "sentiment": "none"}, {"name": "east coast", "sentiment": "none"}, {"name": "cheshire", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "dee valley", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "edinburgh", "sentiment": "none"}], "organizations": [{"name": "coreena ford severn trent", "sentiment": "negative"}, {"name": "barratt homes", "sentiment": "none"}, {"name": "barratt developments", "sentiment": "none"}, {"name": "virgin trains investments  rail", "sentiment": "none"}, {"name": "housebuilder barratt developments", "sentiment": "none"}, {"name": "virgin trains", "sentiment": "none"}, {"name": "coreena ford east coast", "sentiment": "none"}, {"name": "dee valley water", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "azuma virgin trains", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford Severn Trent buys rival water firm in £78.5m deal \nSevern Trent has agreed to buy rival Dee Valley Water in a deal worth around £78.5m. \nSevern will pay 1,705p a share for Dee Valley, which serves around 260,000 customers in Cheshire and North Wales. The deal sees Severn Trent gatecrash plans by rival bidder Ancala - an infrastructure investment manager - which had agreed to buy Dee Valley for around £71.3 million. \nDee Valley said it was now backing Severn Trent’s higher bid and had withdrawn its recommendation for Ancala’s offer. \nSevern Trent said Dee Valley would be a good fit with the firm, as it operates in neighbouring areas to the group. \nIt added that it would continue to invest in Dee Valley, having earmarked £3 billion for an investment programme in the region, and would also support vulnerable customers. “Dee Valley’s customers will share in half of any wholesale cost efficiencies achieved, which will be reflected in future bills,” it added. Severn Trent chief executive Liv Garfield said: \nWe intend to bring real benefits to Dee Valley’s operations and customers by bringing best practice and investment to support and enhance the service the company provides and by sharing the savings we can generate. 8.36 Coreena Ford East Coast mainline passenger numbers speed ahead after Virgin Trains investments \nRail operator Virgin Trains has been crunching numbers since launching 42 new services on the East Coast mainline in May, and it seems journeys between Newcastle and Edinburgh account for a third of all growth on the service since then. \nThe firm is toasting a 26% surge into the number of passenger journeys between Newcastle and the Scottish capital following a series of investments. \nIt invested in 42 new services as part of a £140m investment programme in the East Coast mainline. \nSince then, the firm has recorded 100,000 extra journeys, with trips between Newcastle and Edinburgh accounting for 40,000 of them. The route now accounts for a third of all growth for all cross-border journeys between England and Scotland. \nThe investment programme has included the refurbishment of the entire fleet interiors, the launch of a new menu from leading chef James Martin and an overhaul of first class lounges, including at Newcastle. \nThe new free onboard entertainment streaming system, BEAM, has also been introduced earlier this year and wi-fi made free for first and standard class customers. One of the Azuma Virgin Trains (Photo: Mikael Buck/Virgin Trains/PA Wire) 8.30 KEY EVENT Price review for Barratt Developments' London homes \nHousebuilder Barratt Developments said the UK’s housing market remains “robust”, but revealed it is reviewing prices in London after softer sales across the capital. \nBarratt said that while the wider UK property sector was “healthy” in spite of Brexit uncertainty, the market for high-end homes in London was “challenging”. \nMarket conditions in London at higher selling prices remain more challenging. To mitigate these risks we have taken pricing action on a number of our sites in London. Further actions to de-risk London delivery include an exchanged build and sale agreement on a bespoke development of 39 apartments for a total value of £47m,” the company said. \nAcross the UK, Barratt reported an average weekly sales rate of 0.74 net private reservations for each active outlet from July 1 to November 13, higher than an average of 0.71 a year earlier. \nTotal forward sales, which account for joint ventures, were up 4.3% to £2.65bn. \nChief executive David Thomas said: “This has been another good trading period for the group. \n“Consumer demand is strong, supported by good mortgage availability. \n“We are mindful of the potential for economic uncertainty created by the outcome of the EU referendum. \nHowever, market fundamentals are robust, and we remain a housebuilder of choice.” \nBarratt said trading has been in line with market expectations and that it is on track to hit its 20% gross margin target, despite “headwinds” in the London market. A Barratt Homes development", "external_links": [], "published": "2016-11-16T15:20:00.000+02:00", "crawled": "2016-11-16T10:57:36.351+02:00", "highlightTitle": ""}