{"organizations": [], "uuid": "ae057e4dc41e8b531db72648a98ab0bfea8cff63", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/29924911/15699604.jpg", "site_section": "http://www.thisisleicestershire.co.uk/specialolympics/rss.html?chid=181121", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/profile-8216-brexit-led-to-a-rethink-8211-our-strategy-is-to-maximise-what-we-8217-ve-got-8217/story-29924911-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "TomPegden published Profile: 'Brexit led to a rethink – our strategy is to...", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "TomPegden published Profile: 'Brexit led to a rethink – our strategy is to...", "spam_score": 0.0, "site_type": "news", "published": "2016-11-22T21:48:00.000+02:00", "replies_count": 0, "uuid": "ae057e4dc41e8b531db72648a98ab0bfea8cff63"}, "author": "TomPegden", "url": "http://www.leicestermercury.co.uk/profile-8216-brexit-led-to-a-rethink-8211-our-strategy-is-to-maximise-what-we-8217-ve-got-8217/story-29924911-detail/story.html", "ord_in_thread": 0, "title": "TomPegden published Profile: 'Brexit led to a rethink – our strategy is to...", "locations": [], "entities": {"persons": [{"name": "tompegden", "sentiment": "negative"}, {"name": "jason hathaway", "sentiment": "negative"}, {"name": "rik pancholi", "sentiment": "none"}, {"name": "waite", "sentiment": "none"}, {"name": "jason", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "pancholi", "sentiment": "none"}, {"name": "leanne", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "loughborough road", "sentiment": "none"}, {"name": "glenfield", "sentiment": "none"}, {"name": "birstall", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "netherlands", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "ehl solicitors", "sentiment": "negative"}, {"name": "ehl", "sentiment": "none"}, {"name": "pattersons commercial law", "sentiment": "none"}, {"name": "sheltons solicitors", "sentiment": "none"}, {"name": "st margaret's way", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jason Hathaway and his team at EHL Solicitors made a big decision the day after the UK voted to quit the EU. \nLike many, the board thought the economy was in trouble. \nWhat sort of businesses would want to gamble on investing and branching out, for instance, if there was going to be so much doubt over the economy? \nSo, after years of exponential growth, a decision was made to slow down – because it looked likely the economy would be doing just that. \nIt was a brave move and one, the team assumed, that would set them steady for the tricky times ahead. \nA planned new lease for a Birstall office, for instance, was pulled. \nBut something unusual happened. \nAlthough the pound plummeted against the euro and dollar, the economy didn't tank and employment didn't rocket. \nAfter a short period of reflection, business confidence came back.Many deals went ahead as planned, consumers are still spending, though not quite as much as they might be, and homes are still being bought and sold. \nJason, who runs the business in Loughborough Road, Leicester, with wife Leanne, explained: \"I didn't expect the referendum result to go the way that it did – though probably should have seen it coming – and we had a board meeting the next day. \n\"We have grown faster than any practice in Leicestershire in the last few years, from £300,000 when I bought the business in 2007 to £7 million, and that was through the recession. \n\"We have taken it from one branch to 18, so there is inevitably risk attached to that. Most of that growth has been in the last three years or so, through acquisition and opening offices and the driver has been that the regulatory market for smaller, one and two-man bands, is tough. \n\"A lot relies on conveyancing and lenders are tougher with compliance so firms need things like IT departments, HR and compliance departments. \n\"Volume is the game – if you need to do conveyancing you need to do a lot of it. \n\"So we have been able to build up a complete team, and have been on a growth curve which was expecting to match the economy as it continually improved. \nRead more: Hostile bid for county firm with 225 staff \n\"When the Brexit vote came out we felt the right thing to do was react to that, because we did not know what would happen over the next 12 months. \n\"Some experts were predicting recession, and having gone through 2008-9 we didn't want to be caught out by not responding. \nRead more: County town undergoing major facelift to make it more attractive to visitors \n\"We never said we were not going to recruit, but we decided we would not expand the office network. \n\"We lost five or six people. We closed down our central phone operators because we had them dealing with calls in anticipation of growing to 50 offices, so that was an expensive overhead. And we had a post-completion team which we have rehoused. \n\"We still had vacancies in our offices for lawyers and are still recruiting, but with structural changes. \n\"In that first week after the vote there was a sudden shock. We had two corporate deals pulled – one was a factory lease and one was a £1.25 million corporate deal. \n\"Everyone was saying they were seeing deals pulled and in the build up to it a lot of people were putting things on hold, so the nervousness had been building. Then in July everyone sort of forgot about it. \n\"Don't forget, business is all about confidence and that's a very difficult thing to touch and feel. \n\"Recessions are self made. This was a shock, but we got up the next morning and decided life goes on.\" \nThere are around 174 staff in the business now, including around 30 from the post-referendum acquisition of Nottinghamshire-based legal firm Sheltons Solicitors. \nHe said now that things had settled, they were also planning two new county offices in the new year. \nJason said: \"We had three people start a couple of weeks ago, and every week we have new people starting. \n\"Our aim is to focus on what we've got and make every branch profitable. Brexit led to a rethink and we do have a new strategy to maximise what we've got. \n\"We are still going to expand our branch network, but what Brexit has done is make us pause and get everything in order, which is probably a decision we should have made anyway. \n\"I think what we have seen, and this is why I enjoy business, is the resilience of business owners who absorb information and data and deal with it. \n\"No-one can change Brexit, so the conversations I'm having are not about what we have done, but about where the positives are. \n\"One client has just come back from China, so those conversations are happening. \n\"It is what it is and we adapt to it. \n\"The vast majority of my clients seem to be exporters, though I've one client who imports testing equipment from Japan who has absorbed the change.\"Invariably inflation will go up next year and the issue now is will wage increases follow. \n\"Business investment is key and that all comes down to confidence.\" \nEHL won the services category at the 2013 Leicester Mercury Business Awards \nHe said over the next few years lawyers in particular will be busy adapting case law to changes in legislation following the Euro-split. \n\"We are talking to clients about whether they should have Brexit clauses, for instance, if they are signing contracts with distributors in the Netherlands. \n\"You might be negotiating your prices now, but later on there might be tariffs to pay so that contract could come up for renegotiation. \n\"Most contracts have a force majeure clause, and we are in that sort of environment – a business contract might be based on a set of rules that exist now, but which might be ripped up in two years' time.\" \nJason is proud of the business he has built up in the past few years and the innovative, forward-looking way in which he has done it. \n\"I'm a working class lad and there are huge barriers to entering our profession and we have always wanted to be contrary to that. \n\"Everything we have done as a business and the people we employ and how we approach things shows that we don't want to be like normal lawyers \n\"Our branches are very retail looking and we want to be able to offer everything to the man or woman on the street, and make sure it's not difficult to access services. \n\"Everybody in all walks of life needs the services of a lawyer. \n\"Leanne and I own the business and she always says she wants to create a firm my parents would be comfortable with. \n\"I would say that both in the commercial arm and high street arm we are competitive and there's a lot of competition out there. \n\"As well as that, the most important thing is to be transparent about our fees.\" \nEHL launched a new commercial division earlier this year in St Margaret's Way, off the city's inner ring road, led by Rik Pancholi. \nLast month, it was announced Mr Pancholi had left to set up his own firm, Pattersons Commercial Law, based in Glenfield. \nJason said it had been a surprise to lose his colleague, but he wished him all the best. \nHe said: \"We've worked together on and off for more than 10 years. \n\"I trained at Spearing Waite then set up my own business so can't criticise someone who does the same. I respect that. \n\"I've stepped in. Commercial law is really important to us because it's the counterbalance to the high street brand. \n\"We do not believe we can be a full service law firm without a credible commercial arm, building a good reputation and offering good advice.\" \nJason said there were more than a dozen staff in the new division and he sees that growing to 20 in the next few years. \nHe said: \"The bulk of our clients are businesses that turn over between £1 million and £3 million and we want to do the best job for them that we possibly can. \n\"We are not sector specific and they tend to be owner-managed. \n\"We also like clients at growth stage, because they are active and the main focus is acquisitions, corporate buy-outs and dispute resolution. \n\"We're also doing a lot of work outside of Leicester. Maybe that is because we are more competitive on fees here than firms in London. People are very, very price sensitive now.\"", "external_links": [], "published": "2016-11-22T21:48:00.000+02:00", "crawled": "2016-11-22T17:41:02.753+02:00", "highlightTitle": ""}