{"organizations": [], "uuid": "7faef184ecc020bdac213a5a15157a1fbd5abada", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12220611.ece/ALTERNATES/s1200/Autumn-Statement-2016.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/whats-autumn-statement-heres-everything-12220521", "country": "GB", "domain_rank": 21960, "title": "What's in the Autumn Statement? Here's everything you need to know", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "What's in the Autumn Statement? Here's everything you need to know", "spam_score": 0.0, "site_type": "news", "published": "2016-11-23T23:39:00.000+02:00", "replies_count": 0, "uuid": "7faef184ecc020bdac213a5a15157a1fbd5abada"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/whats-autumn-statement-heres-everything-12220521", "ord_in_thread": 0, "title": "What's in the Autumn Statement? Here's everything you need to know", "locations": [], "entities": {"persons": [{"name": "philip hammond", "sentiment": "neutral"}, {"name": "brexit", "sentiment": "none"}, {"name": "george osborne", "sentiment": "none"}, {"name": "hammond", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "yorkshire", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "north west", "sentiment": "none"}], "organizations": [{"name": "northern powerhouse rail", "sentiment": "none"}, {"name": "local enterprise partnerships", "sentiment": "none"}, {"name": "tax-free childcare", "sentiment": "none"}, {"name": "northern powerhouse", "sentiment": "none"}, {"name": "universal credit", "sentiment": "none"}, {"name": "office for budget responsibility", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News What's in the Autumn Statement? Here's everything you need to know Philip Hammond said his Autumn Statement would improve the living standards of working people - here's what was said Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily   Thank you for subscribing!   \nChancellor Philip Hammond said his Autumn Statement would improve the living standards of working people and their families. \nBut you can judge for yourself if he was telling the truth. Here’s what he said: Cutting debt \nMr Hammond confirmed that he was giving up on the goal set by former Chancellor George Osborne of delivering a budget surplus by 2019-20. \nHe said the economy was expected to grow more slowly than previously expected. \nAnd he said the Office for Budget Responsibility (OBR) had blamed Brexit, saying: “While the OBR is clear that it cannot predict the deal the UK will strike with the EU, its current view is that the referendum decision means that potential growth over the forecast period is 2.4 percentage points lower than would otherwise have been the case.” \nMr Hammond also admitted: “Tax receipts have been lower than expected this year”. \nThe Government is set to borrow 68.2bn this year - and will still be borrowing £17.2bn in 2021-22, he admitted. \nAnd debt will rise to 90.2% of GDP in 2017-18. Taxes \nThe personal tax allowance will rise to £12,500 as planned by 2020, while the higher rate threshold will increase to £50,000. \nThis effectively means tax will be cut for many working people, with the biggest giveaway going to people who currently pay the higher rate of tax. This currently means people with an income of £43,001 or higher. \nCorporation tax will fall to 17% as expected. Mr Hammond said this would be “by far the lowest overall rate of corporate tax in the G20.” Wages \nThe Chancellor announced that the Living Wage will be increased to £7.50 an hour from April 2017, up from £7.20 an hour for people aged 25 or over. \nAnd £4.3 million a year will be spent on enforcing minimum wage laws. \nIn practice, the Government’s living wage is an increase in the minimum wage. It is separate to the living wage used by many local councils to set salaries - which is higher - but it is compulsory for every employer. Benefits \nMr Hammond announced he was watering down cuts to Universal Credit paid to people in work, which had previously been announced by former Chancellor George Osborne. \nHe will do this by allowing people to earn more before their payments begin to be cut. \nUniversal Credit replaces a range of existing benefit payments including Tax Credits paid to working people. Housing \nA £2.3 billion housing infrastructure fund will deliver infrastructure for 100,000 new homes in areas of high demand. \nAnd there will be £1.4 billion to help build 40,000 new “affordable” homes . \nBut, controversially, the Government will allow developers to build more properties to buy when in the past they would have built properties to be rented at a low cost. \nIt will do this by continuing to change the official definition of “affordable housing”. Traditionally, this usually meant homes let to tenants by councils or housing associations, but the Chancellor said providers will now be able to deliver a wide range of products houses for shared ownership and “rent to buy” schemes. \nThis involves renting a property for five years at a cut-price rate, giving tenants time to save up the money for a deposit to buy the property. \nThere will also be a ban on letting agent fees charged on tenants renting in the private sector, which the Government says will save tenants hundreds of pounds in up-front charges. £556 million for jobs in the North \nMr Hammond announced £556 million to grow the economy and create jobs in the Northern Powerhouse , including the North East, North West and Yorkshire. \nThe cash will be used for projects to provide more homes, training schemes and transport improvements such as road, rail or bus schemes. \nLocal Enterprise Partnerships, which involve businesses and local councils, will receive the funding. Details of how exactly the cash will be distributed in different parts of the north will be published later. Research and development \nThe Chancellor said he was investing in infrastructure and research which would improve the UK’s “shocking” productivity gap, paid for through additional borrowing. \nA new national productivity fund would spend £23 billion the next five years, he said. \nThis included investment in research and development, to help turn British inventions and discoveries into commercial products. Transport \nThere will be £1.1 billion for English local transport networks, mainly for smaller schemes designed to make an immediate difference and cut congestion. \nIt includes £220 million to cut congestion on roads. \nThere will be £450m to trial digital signalling on railways to improve reliability. \nAnd there was a boost to the car industry, as the Chancellor announced £390m to help develop low emission vehicles such as electric cars, and “self-driving” or autonomous vehicles. \nThe Government also says it will continue work on developing a “Northern Powerhouse Rail” line, linking the North East and North West. \nAnd it confirmed it would press ahead with plans to dual the A66, with more modest improvements planned for the A69. Education \nThe Government is promising to “design, fund and test” measures to encourage more top teachers to choose to work in the north of England, though there are no further details at this stage. \nBroadband \nOver £1 billion in digital infrastructure to encourage the development of ‘fibre networks’ - which provide ultra-fast broadband services - and help develop a 5G wireless network. \nFibre networks are so fast they could allow users to download an entire series of Game of Thrones in less than a minute. Read More Autumn Statement LIVE: North East reaction to Philip Hammond's first budget statement Savings bond \nA new investment bond will be offered, with an interest rate of around 2.2% gross and a term of three years. \nSavers will be able to deposit up to £3,000. \nMr Hammond said this would help savers currently suffering as a result of low interest rates. However, critics will say that the interest rate on offer may not be as generous as it seems because inflation is expected to increase significantly. Cutting whiplash compensation payments \nThe maximum payout for drivers and passengers who suffer minor whiplash injuries is to be cut by £40. \nIt follows warnings that whiplash claims have soared 50% over the past decade. \nMinisters blame ambulance-chasing lawyers and cold-call firms for a ‘compensation culture’. \nMr Hammond said the new rules would cut the cost of travel by reducing insurance premiums. Measures already announced \nThe Chancellor said his announcements were part of a package of measures to help working people building on policies already announced, including: Free childcare for working parents of 3s and 4s, which will rise from 15 to 30 hours a week, worth up to £5,000 per child per year from 2017. Tax-Free Childcare, worth up to £2,000 per child per year rolling out in early 2017. Introduction of the Personal Savings Allowance which means that 98% of adults have no savings tax to pay at all. Like us on Facebook", "external_links": [], "published": "2016-11-23T23:39:00.000+02:00", "crawled": "2016-11-23T19:09:20.465+02:00", "highlightTitle": ""}