{"organizations": [], "uuid": "eb74f421f8fa9290b58f9878c093e4997cd02a16", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12079463.ece/ALTERNATES/s1200/JS102074544.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/council-leaders-call-government-prioritise-12204295", "country": "GB", "domain_rank": 21960, "title": "Council leaders call on government to prioritise Northern rail network in autumn statement", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Council leaders call on government to prioritise Northern rail network in autumn statement", "spam_score": 0.0, "site_type": "news", "published": "2016-11-20T23:48:00.000+02:00", "replies_count": 0, "uuid": "eb74f421f8fa9290b58f9878c093e4997cd02a16"}, "author": "Sean Seddon", "url": "http://www.chroniclelive.co.uk/news/north-east-news/council-leaders-call-government-prioritise-12204295", "ord_in_thread": 0, "title": "Council leaders call on government to prioritise Northern rail network in autumn statement", "locations": [], "entities": {"persons": [{"name": "nick forbes", "sentiment": "none"}, {"name": "chris grayling", "sentiment": "none"}, {"name": "andy burnham", "sentiment": "none"}, {"name": "steve rotherham", "sentiment": "none"}, {"name": "philip hammond", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "jim o’neill", "sentiment": "none"}, {"name": "george osborne", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "sheffield", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "darlington", "sentiment": "none"}, {"name": "north", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}], "organizations": [{"name": "council", "sentiment": "negative"}, {"name": "labour", "sentiment": "none"}, {"name": "northern powerhouse rail", "sentiment": "none"}, {"name": "northern powerhouse", "sentiment": "none"}, {"name": "newcastle city council", "sentiment": "none"}, {"name": "leeds", "sentiment": "none"}, {"name": "liverpool", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "crossrail", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Council leaders call on government to prioritise Northern rail network in autumn statement The call for funding comes just day ahead of the the Chancellor's autumn statement Share Newcastle City Council leader Nick Forbes Share Get daily   \nThe leader of Newcastle City Council has joined calls for greater investment in the rail network across the North. \nAlong with other town hall bosses in the region, Nick Forbes has demanded further infrastructure spending ahead of the autumn statement. \nThis Wednesday’s statement will be Philip Hammond’s first major economic intervention since becoming Chancellor of the Exchequer. \nCouncils across the North will be listening closely to determine where the Northern Powerhouse agenda ranks in the new government’s list of priorities. \nThe leaders of Manchester, Leeds and Sheffield council and Labour’s mayoral candidates for Manchester and Liverpool, Andy Burnham and Steve Rotherham, have also signed the letter to the chancellor. \nIn it they state: “We are reaching the point where our motorways across the north are at saturation point. \n“Journey times are increasing and capacity on our trains is at the limit. \n“Unless we urgently develop a credible plan to get the north moving, we could suffer a loss of confidence from inward investors.” \nCalling for more east-west rail investment to match the HS2 plans, the letter goes on to say: “As representatives from across the North of England, we write to ask you to use your forthcoming Autumn Statement to make a firm commitment to the construction of Northern Powerhouse Rail as a major transport priority for the country, and to set out a clear and expedited timetable for its completion. \n“We understand the pressure on resources and that is why we ask you, specifically, to make it a higher investment priority than Crossrail 2. \n“We struggle to see the justification for prioritising further infrastructure investment in London and the south whilst the North continues to lag behind.” \nThere have been concerns that the Northern Powerhouse agenda may fall down the pecking order following the sidelining of its key architect, George Osborne. \nCoupled with the resignation of Lord Jim O’Neill, another key pusher of the plans, critics have claimed Theresa May has put the scheme on the back-burner. \nWriting in the Sun on Sunday, Philip Hammond, the Chancellor of the Exchequer, signalled his intention to put infrastructure spending at the heart of this government’s fiscal policy. \nHe wrote: “For years we have not invested enough in our national infrastructure and that’s held this country back. Read More \n“Our roads, rail and housing need an injection of cash to boost growth.” \nHow much of this money will be earmarked for the Northern Powerhouse project remains to be seen. \nThe idea that the North should have better transport links between its key centres has gained traction over recent years. \nLocal transport authorities have signed up to Transport for the North, a body which aims to align the region’s transport strategy. \nIt has a long term ambition of integrating road, rail and bus networks across the North and some have called for developments like an ‘Oyster card for the North’. \nThe letter continues, saying: “If Britain is to make a success of Brexit, then all parts of the country need to have a plan for the future. \nTo drive growth in North, we urgently need to see a bold, clear and ambitious plan for Northern Powerhouse Rail and we look forward to working with you to make a reality.” \nThe call comes just days after Chris Grayling, the transport secretary, confirmed that HS2 services will come to Newcastle, Darlington and Durham as part of the second phase of the roll-out. \nMinisters claim that high speed rail plans would cut journey times between Newcastle and London by half an hour. Like us on Facebook", "external_links": [], "published": "2016-11-20T23:48:00.000+02:00", "crawled": "2016-11-20T18:57:27.859+02:00", "highlightTitle": ""}