{"organizations": [], "uuid": "b613f6892b528d6757aada28ffa03cf573354488", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/29940930/15711025.jpg", "site_section": "http://www.thisisleicestershire.co.uk/specialolympics/rss.html?chid=181121", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/bidding-war-erupts-for-cherry-pickers-giant/story-29940930-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "Leicester Mercury published Bidding war erupts for county firm", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "Leicester Mercury published Bidding war erupts for county firm", "spam_score": 0.0, "site_type": "news", "published": "2016-11-29T20:31:00.000+02:00", "replies_count": 0, "uuid": "b613f6892b528d6757aada28ffa03cf573354488"}, "author": "Leicester Mercury", "url": "http://www.leicestermercury.co.uk/bidding-war-erupts-for-cherry-pickers-giant/story-29940930-detail/story.html", "ord_in_thread": 0, "title": "Leicester Mercury published Bidding war erupts for county firm", "locations": [], "entities": {"persons": [{"name": "lauren mills", "sentiment": "negative"}, {"name": "aj bell", "sentiment": "none"}, {"name": "loxam", "sentiment": "none"}, {"name": "pascal vanhalst", "sentiment": "none"}, {"name": "russ mould", "sentiment": "none"}, {"name": "don kenny", "sentiment": "none"}, {"name": "lavendon", "sentiment": "none"}], "locations": [{"name": "france", "sentiment": "none"}, {"name": "loxam", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "nottingham", "sentiment": "none"}, {"name": "belgium", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "liverpool", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}, {"name": "lutterworth", "sentiment": "none"}, {"name": "anfield", "sentiment": "none"}], "organizations": [{"name": "leicester mercury", "sentiment": "negative"}, {"name": "loxam group", "sentiment": "none"}, {"name": "nationwide platforms", "sentiment": "none"}, {"name": "tvh group", "sentiment": "none"}, {"name": "loxam access", "sentiment": "none"}, {"name": "tvh equipment", "sentiment": "none"}, {"name": "lavendon", "sentiment": "none"}, {"name": "tvh", "sentiment": "none"}, {"name": "lavendon group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Bidding war erupts for county firm By Leicester Mercury | Posted: November 29, 2016 By Lauren Mills famous venues: Lavendon powered equipment being used at Lord's cricket ground VIEW GALLERY Bidding war erupts for county firm X \nCopy link to paste in your message / famous venues: Lavendon powered equipment being used at Lord's cricket ground Helping out at Liverpool's Anfield stadium capital work: Cherry pickers in The Mall Lavendon boss Don Kenny Comments (0) \nA bidding war has broken out for a multi-million pound rental business which employs 225 staff in the county. \nRaised access specialist Loxam is preparing to table a cash offer for hire specialist Lavendon Group, triggering a takeover battle between rival European plant giants. \nLast week, TVH, a materials handling business based in Belgium, made a £348 million hostile bid for Lavendon, which is based in Lutterworth. \nLavendon is the market leader in the rental of powered access equipment, known as cherry pickers, in Europe and the Middle East. \nIt has 200 staff at its Lutterworth headquarters, with 25 employed at its Cosby depot. \nRead more: Lavendon to beat profit expectations despite Brexit uncertainty \nThe board of Lavendon, including chief executive Don Kenny, pictured, had initially planned to recommend TVH Group's 205p a share offer, but rejected it at the last minute turning the takeover hostile. \nIn response, Lavendon said in a statement last week: \"The board confirms that it received an unsolicited approach from TVH after Lavendon's half year reslts in August 2016.\" \nThe company added that after consulting with some of the shareholders approached by TVH \"it was apparent that the level of support anticipated was not forthcoming.\" \nNow the French Loxam Group has emerged as a potential rival bidder and asked Lavendon's shareholders to take no action while it draws up details of its possible offer. \nLavendon is the parent company of Nationwide Platforms, the UK's largest specialist powered access hire company. \nIn the UK, Loxam Access is based in Nottingham and operates from 13 branches across England, Scotland and Ireland hiring boom and vertical mast platforms, scissor lifts and truck mounted platforms. \nIn a statement yesterday morning, Loxam said it \"has made a preliminary approach to Lavendon regarding a possible cash offer\". It added: \"Discussions with Lavendon are ongoing and there can be no certainty that any offer will be made, nor as to the terms of any such offer.\" \nLoxam is urging Lavendon shareholders \"not to take any action in support of the offer announced by TVH on November 22\". \nIn response to the offer from Loxam, Lavendon issued a statement which said; \"The board continues to advise shareholders to take no action at this stage.\" \nTVH executive board member Pascal Vanhalst said last week that \"the acquisition of Lavendon would represent a significant step forward in the growth of our specialised rental activities. \n\"It would also bolster our geographical expansion strategy as TVH Equipment would become active in new markets such as the UK, the Middle East and France. \n\"With Lavendon's vast rental know-how and focus on safety, the customers of the enlarged group would clearly benefit.\" \nAJ Bell investment director Russ Mould said: \"It's amazing how quickly the predators come out of the shadows when the boss sends the right signal to say 'my company is up for sale'. \n\"Aerial platform specialist Lavendon was clearly desperate to be acquired when it asked suitor TVH to try harder in its quest to get more shareholder support for its takeover offer. \n\"Less than a week later we now have another company muscling in. \n\"European rival Loxam has made an approach – I imagine it may not be the only other interested party.\"", "external_links": [], "published": "2016-11-29T20:31:00.000+02:00", "crawled": "2016-11-29T16:44:49.433+02:00", "highlightTitle": ""}