{"organizations": [], "uuid": "8597c1272f2f9126909cfa98de462baf338b0201", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12138530.ece/ALTERNATES/s1200/JS104352873.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/news-opinion/chronicle-us-donald-trump-promises-12138561", "country": "GB", "domain_rank": 21960, "title": "Chronicle in the US: Donald Trump promises supporters a 'Brexit Plus' victory", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Chronicle in the US: Donald Trump promises supporters a 'Brexit Plus' victory", "spam_score": 0.0, "site_type": "news", "published": "2016-11-07T20:00:00.000+02:00", "replies_count": 0, "uuid": "8597c1272f2f9126909cfa98de462baf338b0201"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/news-opinion/chronicle-us-donald-trump-promises-12138561", "ord_in_thread": 0, "title": "Chronicle in the US: Donald Trump promises supporters a 'Brexit Plus' victory", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "negative"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "judy", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "jessica wullukka", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "detroit", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "usa", "sentiment": "none"}, {"name": "sterling heights", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "leesburg", "sentiment": "none"}, {"name": "michigan", "sentiment": "none"}], "organizations": [{"name": "republican party", "sentiment": "none"}, {"name": "freedom hill amphitheatre", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "    \n“This is going to be Brexit plus”. \nThat was Donald Trump’s pledge to a noisy rally of 7,000 enthusiastic supporters as the US Presidential election campaign drew to a close. \n“We are going to win,” he said. \nAnd it would be like Brexit , because once again the politicians, the media and the pundits were predicting yet another victory for the establishment - and they were about to be proved wrong. \n“They don’t know what is coming,” he said. “Or maybe they do know what is coming, and they are not happy about it.” \nTrump, the Republican candidate, was speaking at the Freedom Hill Amphitheatre, in Sterling Heights, Michigan - near Detroit - for a rally in the final stages of the election campaign. Supporters at a Donald Trump rally in Sterling Heights, Michigan \nThese things are organised at short notice, as the candidates fly across the USA to states where opinion polls show the race is tight. Places where they have no hope of winning, or where they already have a decisive lead over their opponent, aren’t worth visiting. \nThe Sterling Heights event had only been announced a day in advance. I was lucky because I was already in the area, and I was able to get in. \nIt’s quite an experience. Whether you like Donald Trump or not, there’s no denying that his rallies are exciting. \nThe crowd had been told to arrive by 5.30pm and were entertained by rock music blasted over the speakers, before the man himself suddenly appeared on stage around 7.30. \nA Trump rally is about audience participation. Rather like a Punch and Judy show at a British seaside, half the fun for the crowd lay in knowing what to shout at the stage. \nSo when Trump spoke about Hillary Clinton, the crowd chanted “lock her up”. When he attacked the “crooked” media, they chanted “CNN sucks” - a dig at America’s leading TV news network. \nTrump promised to strengthen the border with Mexico, and the crowd chanted “build a wall”. He said he would go to Washington and deal with corruption, and his audience joined him in declaring: “Drain the swamp!”. Read More Chronicle in the US: How Donald Trump took over the Republican Party \nAnd of course, he finished his speech by pledging to “make America great again”, the audience chanting the slogan alongside him. They had no excuse for forgetting this one, as it was written on many of the banners they waved, as well as numerous t-shirts and baseball caps. Republican presidential candidate Donald Trump speaks at a rally in Leesburg, Va \nBut Trump had two serious messages beyond the well-worn catchphrases. One, tailored to the local audience, was a pledge to rebuild America’s car industry. \nDetroit was once the heart of America’s car manufacturing sector, but has suffered a devastating economic decline which led to the population falling to half its peak, as residents fled in search of a better life elsewhere. \nTrump promised to reverse all that, mainly by imposing a 35% tariff on cars imported from other countries. Read More Chronicle in the US: How the Presidential election provoked hatred and racism at a top university \nHis second message was an exhortation to go out and vote. It wasn’t an appeal for support so much as a plea for the people who already support him to make the effort to go to the polling station when the time comes. \nThe audience was made up of some of the nicest people you’ll meet. Trump’s supporters, and particularly those who attend his rallies, have been painted in a very unflattering light in parts of the media, and it’s certainly true that protesters have been assaulted at some rallies in the past. \nThere was nothing remotely like that here, though I guess I should note that there were also no protesters either. \nThey really hate Democrat candidate Hillary Clinton though. Supporters at a Donald Trump rally in Sterling Heights, Michigan \nI got to speak to a number of Trump supporters, both before and after the speech. \nSome of them backed Donald Trump because he is pro-life and apparently opposes abortion. Others were worried about the possibility of terrorists coming into the country disguised as refugees from Syria, something Mr Trump says he will prevent. Read More Is Donald Trump or Hillary Clinton winning the race for the White House? \nAnd many simply felt that their prospects were uncertain unless something changes, and Mr Trump is the man to bring change about. \nOne young woman, Jessica Wullukka, from Michigan, told me: “I have a hard time finding a job. There are no jobs. \n“Even for grown adults. Parents are unemployed. There are no jobs there. People are leaving to find jobs elsewhere.” \nSo is Donald Trump the person to fix things? \nShe said: “He’s a businessman. He knows how to do it. I think he can do it. I think he can turn it around.” Share", "external_links": [], "published": "2016-11-07T20:00:00.000+02:00", "crawled": "2016-11-07T15:21:49.800+02:00", "highlightTitle": ""}