{"organizations": [], "uuid": "16732d5787b28e80f6aec94886d9d1ecfbe15f95", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12180836.ece/ALTERNATES/s1200/TMP_NEC_151116BroadbentBank_04JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/cost-living-set-rise-bank-12180799", "country": "GB", "domain_rank": 21960, "title": "Cost of living set to rise, Bank of England deputy governor warns on visit to Newcastle", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Cost of living set to rise, Bank of England deputy governor warns on visit to Newcastle", "spam_score": 0.0, "site_type": "news", "published": "2016-11-15T23:54:00.000+02:00", "replies_count": 0, "uuid": "16732d5787b28e80f6aec94886d9d1ecfbe15f95"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/cost-living-set-rise-bank-12180799", "ord_in_thread": 0, "title": "Cost of living set to rise, Bank of England deputy governor warns on visit to Newcastle", "locations": [], "entities": {"persons": [{"name": "newcastle ben", "sentiment": "negative"}, {"name": "byker", "sentiment": "none"}, {"name": "ben broadbent", "sentiment": "none"}, {"name": "mark carney", "sentiment": "none"}, {"name": "broadbent", "sentiment": "none"}, {"name": "zerolight", "sentiment": "none"}, {"name": "bond dickinson", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "shields road", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "sterling", "sentiment": "none"}], "organizations": [{"name": "newcastle business cost", "sentiment": "negative"}, {"name": "bank of england", "sentiment": "negative"}, {"name": "siemens parsons plant  he", "sentiment": "none"}, {"name": "siemens parsons plant share get", "sentiment": "none"}, {"name": "office for national statistics", "sentiment": "none"}, {"name": "invalid email", "sentiment": "none"}, {"name": "ons", "sentiment": "none"}, {"name": "bank", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "siemens parsons plant  inflation", "sentiment": "none"}, {"name": "siemens", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Cost of living set to rise, Bank of England deputy governor warns on visit to Newcastle Ben Broadbent said growth would slow as businesses held back on investment decisions to see what happens over Brexit Share Ben Broadbent deputy governor of the Bank of England at Siemens Parsons Plant Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nA fall in inflation is likely to be a one-off and the cost of living will rise next year, the Bank of England’s deputy governor has said on a visit to the North East. \nBen Broadbent was in Newcastle yesterday as the UK inflation rate unexpectedly slipped to 0.9%. \nBut he said prices were likely to rise next year and exceed the Bank’s 2% inflation target as the continuing weakness of the pound translated into higher costs for goods in the shops. \nMr Broadbent was speaking after a visit to Newcastle saw him visiting technology firm Zerolight and engineering giant Siemens’ plant on Shields Road, Byker , as well as meeting manufacturing companies in a meeting arranged by EEF and law firm Bond Dickinson. Ben Broadbent deputy governor of the Bank of England at Siemens Parsons Plant \nHe said discussions with North East companies had confirmed that some businesses were holding back on investment because of uncertainty around Brexit , which would lead to slower growth in the economy next year. \nBut he said there were no signs of recession and that the caution being seen in some sections of the economy was nothing like what happened around the time of the financial crash of 2008. \nHe said: “There’s still robust consumer spending, there’s no great sign of any interruption to that. \n“The extent of any sign of post-referendum effects are more in some areas of business investment where, particularly those businesses exposed trade with Europe, there’s some nervousness and uncertainty about what the future trading relationships would be and that probably is having some impact on some companies’ investment decisions. \n“There’s no precipitous change but there are clearer signs in business investment. But we’re not seeing the dramatic fall that we saw after the financial crisis. \n”There is concern about how the Brexit process will work and what it will end up looking like and I do think those are important things for companies nationally and locally.” Ben Broadbent deputy governor of the Bank of England at Siemens Parsons Plant \nInflation was bound to have increased anyway regardless of the EU referendum and the subsequent drop in Sterling, Mr Broadbent said, because of a number of factors affecting the cost of living rate a year ago dropping out of the calculation. \nBut he echoed comments made by Bank governor Mark Carney that “inflation is going up” as the plunging pound puts pressure on retailers and manufacturers to raise their prices. \nThe Office for National Statistics (ONS) said the Consumer Price Index (CPI) measure of inflation was 0.9% in October, down from 1% in September. \nEconomists were expecting a higher figure of 1.1%, but CPI eased back last month after smaller hikes in the cost of clothing and education. Like us on Facebook", "external_links": [], "published": "2016-11-15T23:54:00.000+02:00", "crawled": "2016-11-15T19:35:22.179+02:00", "highlightTitle": ""}