{"organizations": [], "uuid": "9126b34771cbc06ff428ebe571233ae165a04282", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12099966.ece/ALTERNATES/s1200/HS2-project.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/hs2-high-speed-rail-will-12179794", "country": "GB", "domain_rank": 21960, "title": "HS2 high speed rail 'will transform' services to Newcastle insists Government", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "HS2 high speed rail 'will transform' services to Newcastle insists Government", "spam_score": 0.0, "site_type": "news", "published": "2016-11-16T12:00:00.000+02:00", "replies_count": 0, "uuid": "9126b34771cbc06ff428ebe571233ae165a04282"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/hs2-high-speed-rail-will-12179794", "ord_in_thread": 0, "title": "HS2 high speed rail 'will transform' services to Newcastle insists Government", "locations": [], "entities": {"persons": [{"name": "pat glass", "sentiment": "none"}, {"name": "catherine mckinnell  newcastle-upon-tyne north", "sentiment": "none"}, {"name": "chris grayling", "sentiment": "none"}, {"name": "ippr north", "sentiment": "none"}, {"name": "philip hammond", "sentiment": "none"}, {"name": "hull", "sentiment": "none"}, {"name": "joyce mccarty", "sentiment": "none"}, {"name": "andy mcdonald", "sentiment": "none"}, {"name": "george osborne", "sentiment": "none"}, {"name": "catherine mckinnell", "sentiment": "none"}, {"name": "paul griffith", "sentiment": "none"}, {"name": "cllr joyce mccarty", "sentiment": "none"}, {"name": "ed cox", "sentiment": "none"}, {"name": "andrew matthews/pa wire", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "metro", "sentiment": "none"}, {"name": "leeds", "sentiment": "none"}, {"name": "pennines", "sentiment": "none"}, {"name": "midlands", "sentiment": "none"}, {"name": "darlington", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "east coast", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "north west durham", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}, {"name": "north", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}], "organizations": [{"name": "government news", "sentiment": "negative"}, {"name": "newcastle", "sentiment": "negative"}, {"name": "government government", "sentiment": "negative"}, {"name": "sheffield", "sentiment": "none"}, {"name": "northern powerhouse rail", "sentiment": "none"}, {"name": "middlesbrough", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "leeds", "sentiment": "none"}, {"name": "sunderland civic centre", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "newcastle central station", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "shadow transport", "sentiment": "none"}, {"name": "durham county council", "sentiment": "none"}, {"name": "npr", "sentiment": "none"}, {"name": "middlesbrough labour", "sentiment": "none"}, {"name": "department for transport", "sentiment": "none"}, {"name": "transport", "sentiment": "none"}, {"name": "central station", "sentiment": "none"}, {"name": "newcastle city council", "sentiment": "none"}, {"name": "aykley heads", "sentiment": "none"}, {"name": "liverpool", "sentiment": "none"}, {"name": "east coast mainline", "sentiment": "none"}, {"name": "department", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News HS2 high speed rail 'will transform' services to Newcastle insists Government Government ministers have insisted HS2 will benefit the North East as it confirms the second phase of the £55bn network   Thank you for subscribing!   \nThe HS2 high speed rail line will have a “transformational effect” on journey times in the North East even though the new line goes no further north than Leeds, according to the Government. \nMinisters highlighted the benefits to Newcastle, Durham and Darlington as Transport Secretary Chris Grayling confirmed the route for the northern section of the new high speed network. \nTrains running north will transfer on to the East Coast Main Line just before York, but the Government says this means Durham , Darlington and Newcastle will all receive HS2 services. \nIn documentation published to accompany the route announcement, the Department for Transport said journey times between London and Newcastle would be cut by half an hour. Maps of the preferred route for the northern extension of HS2 \nIt said: “HS2 will have a transformational effect on journey times, with journeys between Newcastle and Birmingham taking 1 hour 58 minutes, compared to 3 hours 15 minutes currently, and between Newcastle and London taking 2 hours 17 minutes, compared to 2 hours 49 minutes currently.” \nJourney times between Durham and Birmingham will be cut from 2 hours 57 minutes to 1 hour 50 minutes, the Department said. \nBut there was a sceptical response from North West Durham MP Pat Glass. The Labour MP said: “There have been a huge number of claims about HS2 and the one thing that’s guaranteed is that the cost will continue to go up. \n“I will be trying to get some cast-iron guarantees from the government about benefits to the North East. \n“People in the North East are going to be paying for this and they want to have something in return other than more promises.” Catherine McKinnell \nNewcastle-upon-Tyne North MP Catherine McKinnell said: “HS2 has the potential to provide Newcastle and the North East with some real benefits, as transport links and increasing our connectivity with the rest of the country can only help to support new jobs and growth. \n“Of course, whether we’ll see HS2 come to Newcastle in my lifetime is a different matter – and improving transport links within the North East and the rest of the North is equally important, if we are to achieve our economic potential.’ \nLabour backs HS2 but Shadow Transport Secretary Andy McDonald, Labour MP for Middlesbrough, criticised the Government’s decision to invite private sector firms to operate HS2 rather than keeping it in public control. \nNewcastle City Council has set out plans to invest £9 million to improve Central Station and a further £8 million to redevelop the Metro station at Central, to ensure the region benefits from HS2. \nDurham County Council has also set out plans to capitalise on the arrival of HS2, with the development of the business quarter near the station. Andy McDonald, Middlesbrough Labour MP \nA new business park at Aykley Heads will provide 70,000 square metres of new office space that could bring an estimated 6,000 jobs to the city. \nThe Transport Secretary’s announcement confirms the Government’s plans for a two sections of line running north west and north east from Birmingham, to Manchester and to Leeds respectively. \nThis is known as phase 2 of HS2, and is due to be completed in 2033. \nPhase 1 of the £55.7 billion HS2 railway, between Birmingham and London, had already been confirmed. This is due to open in 2026. \nMinisters also hinted at more announcements to come, and documents published by the Department for Transport show that work is continuing on a proposed trans-Pennine line which is referred to as the Northern Powerhouse Rail network. \nThe documents said: “Work is progressing to see how HS2 could help deliver parts of a fast, frequent Northern Powerhouse Rail (NPR) network for Liverpool, Manchester, Sheffield, Leeds, Hull and Newcastle.” \nGeorge Osborne, the former Chancellor, welcomed the announcements but urged the Government to press ahead with a proposed high speed service across the Pennines, known as HS3. George Osborne (Photo: Andrew Matthews/PA Wire) \nHe said: “Now let’s commit to HS3, the high-speed rail link across the Pennines, so we have a coherent plan to speed journeys across the North.” \nLabour also urged the Government to move ahead with HS3. \nAnd Ed Cox, Director of think tank IPPR North, said: “HS2 is an important piece of the puzzle in connecting the North and rebalancing the economy, but it must go hand-in-hand with plans to connect the North’s cities via HS3.” \nHe urged Chancellor Philip Hammond to announce measures to back the North in his Autumn Statement on November 23, saying: “Now more than ever, the North needs the catch-up cash to prosper post-Brexit and the Autumn Statement presents a great opportunity for the Chancellor to put his money where his mouth is.” \nTransport Secretary Chris Grayling said: “Our railways owe much to the Victorian engineers who pioneered them, but we cannot rest on their legacy when our railways face overcrowding and capacity problems. \n“HS2 is an ambitious and exciting project and the Government is seizing the opportunity it offers to build a transport network fit for the 21st century; one that works for all and makes clear to the world that Britain remains open for business. \n“The full HS2 route will be a game-changer for the country and in particular will significantly improve connectivity between the Midlands and the North to boost economic growth.” \nPaul Griffith, Phase 2 Development Director at HS2 said: “Today’s announcement brings the regeneration benefits of HS2 to the North East one step closer.” \nCouncillor Joyce McCarty, deputy leader of Newcastle City Council, said : “The development of high speed rail services which connect to the North East will bring significant economic benefits and jobs to our city and the wider region. Cllr Joyce McCarty during a North East Combined Authority meeting at Sunderland Civic Centre \n“We have consistently lobbied to ensure the North East is included in the HS2 plans and we welcome the announcement that trains will be able to continue beyond the HS2 network to Newcastle via the East Coast Mainline. \n“This will greatly improve our links to Birmingham and London, with more direct services and faster journey times, and will see Newcastle Central Station become a gateway for the region and beyond. Together with partners, we’ve already invested £24.5m in transforming the station and surrounding area in preparation for the arrival of HS2 trains. \n“But while we welcome this first step, we must also continue to work to secure the investment needed to build capacity on the existing East Coast Mainline, as well as improvements to railway lines within the region which have the potential to help grow our economy. \n“We must also ensure this does not detract from our ambitions to have a full high speed rail connection all the way up the East Coast, through Newcastle and onwards to Scotland.” Like us on Facebook", "external_links": [], "published": "2016-11-16T12:00:00.000+02:00", "crawled": "2016-11-16T07:43:36.327+02:00", "highlightTitle": ""}