{"organizations": [], "uuid": "b058a93d1d357cb59ef746bf79e05c3e6c4f4884", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article11928129.ece/ALTERNATES/s1200/JS52334246.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/business/business-opinion/you-care-treat-people-world-14496654", "country": "GB", "domain_rank": 21960, "title": "If you care about we treat people in the world of work, you must read this book", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-04-05T18:17:00.000+03:00", "replies_count": 0, "uuid": "b058a93d1d357cb59ef746bf79e05c3e6c4f4884"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-opinion/you-care-treat-people-world-14496654", "ord_in_thread": 0, "title": "If you care about we treat people in the world of work, you must read this book", "locations": [], "entities": {"persons": [{"name": "james bloodworth", "sentiment": "none"}, {"name": "graeme whitfield", "sentiment": "none"}], "locations": [{"name": "low-wage britain", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}], "organizations": [{"name": "amazon", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business opinion If you care about we treat people in the world of work, you must read this book Journal business editor Graeme Whitfield on the \"eye-opening, toe-curling\" read that is Hired: Six Months Undercover in Low-Wage Britain Share Parcels are prepared for dispatch at Amazon's warehouse Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nIf you have any interest in the world of work, and how it treats people in 2018, I would urge you to read Hired: Six Months Undercover in Low-Wage Britain. \nHired sees author James Bloodworth taking a series of low-paid jobs in different parts of the country, working first in an Amazon warehouse and then as a care worker, in a call centre and finally as an Uber driver in London. \nNo-one should be surprised to hear that these jobs are not exactly fulfilling but Hired lays out - in eye-opening, toe-curling detail - just how awful they are. \nTo work in these jobs is to be faced with ill-health and insecurity, to have to deal with capricious and cruel bosses and to understand that the Minimum Wage is often a sick joke. \nFrom the ‘motivational’ slogans on the wall of the Amazon warehouse to the nonsense spouted by Uber trainers, the low-paid are showered in a breathtaking level of Orwellian double-speak that does little to disguise how miserable these jobs are. Read More Fish flinging and blue passports: Brexit Britain is a land of metaphors (and they're all rubbish) \nAnd it is depressing to see how the technology that makes life easier for most of us is being used simultaneously to turn the clock back to Victorian working practices for an unfortunate few. \nWhen we talk about record levels of employment, or the flexibility of the “gig” economy, this is the darker side of that story. \nI know most businesses in this and every other region do not treat their staff this way. \nBut we have created a significant section of society whose exploitation and maltreament makes possible many of the benefits of our consumer society. Every time we buy something from Amazon, or hail an Uber, when we get something a little cheaper from an outsourced service, we are fuelling this situation. \nReading Hired will hopefully make you question some of those actions. \nIt also made me ponder on some of the causes I have espoused in recent years, such as social mobility and gender parity in top jobs. Read More It isn't hard to list what is wrong with the North East - but who would want to live anywhere else \nDoes it help, I couldn’t help but think, if a few more companies have women CEOs but we still pay carers (who are overwhelmingly female) a pittance? Plucking the cleverest people out of this life is all very well but turns a blind eye to those who remain. \nI have no easy answers for the issues Mr Bloodworth has highlighted (nor does he, by the way, and nor does he pretend to). \nBut anyone who has read his book will - I hope - feel that we can’t carry on as if these problems don’t exist. \nGraeme Whitfield is business editor of The Journal Like us on Facebook", "external_links": [], "published": "2018-04-05T18:17:00.000+03:00", "crawled": "2018-04-06T01:25:33.005+03:00", "highlightTitle": ""}