{"organizations": [], "uuid": "faa7a2369a996506b38e6d3190c02e7676219270", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1309745.ece/ALTERNATES/s1200/Toys-R-Us.jpg", "site_section": "http://www.westernmorningnews.co.uk/news.rss", "section_title": "devonlive - News", "url": "https://www.devonlive.com/news/business/crisis-high-street-five-reasons-1467477", "country": "GB", "title": "Crisis on the High Street: Five reasons why major brands are struggling", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-04-17T16:33:00.000+03:00", "replies_count": 0, "uuid": "faa7a2369a996506b38e6d3190c02e7676219270"}, "author": "Hannah Finch", "url": "https://www.devonlive.com/news/business/crisis-high-street-five-reasons-1467477", "ord_in_thread": 0, "title": "Crisis on the High Street: Five reasons why major brands are struggling", "locations": [], "entities": {"persons": [{"name": "byron", "sentiment": "none"}, {"name": "jamie", "sentiment": "none"}, {"name": "prezzo", "sentiment": "none"}, {"name": "debenha", "sentiment": "none"}, {"name": "francis clark", "sentiment": "none"}, {"name": "lucinda coleman", "sentiment": "none"}], "locations": [{"name": "exeter", "sentiment": "none"}, {"name": "maplin", "sentiment": "none"}], "organizations": [{"name": "visa uk consumer spending index", "sentiment": "none"}, {"name": "mothercare", "sentiment": "none"}, {"name": "pkf", "sentiment": "none"}, {"name": "business recovery partner", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Toys R Us in Exeter has closed Share     \nThe High Street has been in crisis with major retailers facing collapse. \nVictims of the cold retail climate, Toys R Us , Maplin , Mothercare and New Look join numerous well-known restaurant chains such as Jamie’s Italian , Prezzo and burger chain Byron who have battled a lethal cocktail of online competition, rising costs, and diminishing consumer spending. \nWe asked Lucinda Coleman, Business Recovery Partner at PKF Francis Clark and an expert in helping struggling retailers to find ways of restructuring their business to ride out the storm, to explain why the High Street has buckled under pressure. \n1. Tight wallets \nConsumer spending has had its weakest start to the year since 2012 seeing consumer spending falling -1.1% year – on- year, declining for the ninth time in ten months; face to face spend down -2.5% year- on- year and recreation and culture spending seeing its greatest decline since April 2010, according to the Visa UK Consumer Spending Index. \nIt is a stark reminder of just how tough it is for consumer-facing businesses. Debenhams Exeter. The chain said it was stepping up business rates reviews as part of aims to save an extra £10m in costs this year \n2. Rising labour costs and business rates \nRetailers and restaurants are facing a combination of costs such as the National Living Wage, Apprenticeship Levy and business rates, together with reduced consumer spending. \nMany restaurants are reluctant to pass on growing costs to their customers in the form of price rises but this creates a problem of smaller profit margins to buffer the lost profit, increase in costs and drop in sterling they are currently experiencing. Casual Dining Crunch: which restaurants are feeling the pain – and who’s doing well \nMany restaurants are struggling due to a combination of factors including rising costs and falling consumer spending. \nAccountancy firm Deloitte said like-for-like sales growth in British restaurants fell in the 18 months from December 2015 and was slower than cost inflation. \nSo who is calling for the bill and who’s ordering dessert? \nStruggling: \nByron Burger – former star player is closing 12 branches, is £71.5million in debt. The Exeter branch looks like it will remain open but it and can’t confirm its plan to open in Plymouth’s Drake Circus Leisure multiplex. \nFrankie & Benny’s/Chiquito – owner the Restaurant Group (which also owns Garfunkel’s, Brunning and Price, Coast to Coast and Joe’s Kitchen) is considering selling some prime sites and “exploring options” for other restaurants in its estate. Plymouth and Exeter have Frankie & Benny’s and Chiquito. \nPrezzo – is closing 94 of its 300 restaurants including in Barnstaple. Exeter outlet is at risk but Plymouth, Exmouth and Torquay branches look set to survive. \nJamie’s Italian – chain owned by celebrity chef Jamie Oliver has entered a company voluntary agreement (CVA) and will shut 12 restaurants, after facing pre-tax losses of £9.9million in 2016. The Exeter branch closed in 2017. \nAll Bar One/Toby Carvery – owner Mitchells and Butlers blamed economic and political uncertainty for its decision to cancel its next dividend in late 2017. Industry experts say All Bar One has been slashing prices. There is a Toby Carvery in Plymouth, Newton Abbot and Exeter. \nFranco Manca – owner Fulham Shore saw share price slump after facing challenging market conditions. \nCarluccio’s – is working with KPMG to look into options to help the 102-strong, private equity backed chain. It has a branch in Exeter. \nStrada – the Italian chain shut a third of its restaurants. \nSquare Pie – the London-centric chain has gone into administration. \nPolpo – Exeter and Bristol branches closed in 2018. \nBella Italia, Las Iguanas, Cafe Rouge, La Tasca - the Casual Dining Group made a £60million pre-tax loss in 2017 blaming rising costs, including rent and rates. \nThriving: \nNando’s – the chain with Plymouth branches at Old Town Street and Barbican Leisure Park and in Exeter reported an increase in revenue and gross profit in the year to February 2017. \nWagamama – the Asian food chain, with a large unit at Exeter Princesshay and Royal William Yard, Plymouth and confirmed plans to open at Bretonside’s Drake Circus Leisure multiplex, saw profit after tax, staff and restaurant numbers grow in the year to April 2017. \nZizzi – the chain has a branch in Exeter and another confirmed for Drake Circus Leisure, Plymouth recorded a 12.5 per cent increase in sales to £262.8million for the year to July 2107, though has been accused by some observers of fueling this by discounting prices and Deliveroo sales eating into restaurant turnover. \nTurtle Bay - the Caribbean grub chain made a £12million profit in 2017. The company, which has introduced customers in Exeter and Plymouth to the delights of goat curry and the Marley Mojito cocktail, has seen profits jump by a jaw-dropping 70 per cent. \n3. Narrow margins \nSmall and medium sized businesses operate on tighter budgets so they are likely to either lose money or raise prices which could result in a loss of custom. These tight margins and fragile finances show just how big the threat of insolvency will be in this sector. Jamie's Italian, shortly before its closure at the beginning of 2017 \n4. Cost of ingredients \nAs the value of sterling has fallen, it has pushed up the price of imported goods including the price of food that we import. The UK imports around 50% of its food so many restaurants rely heavily on food and wine imports. With the cost of importing ingredients now higher and the increase in the cost of labour, due to the national minimum wage rises the sector is facing the perfect storm. \nThe restaurant sector in particular is in for another tough year where another swathe of closures are being predicted, with the Brexit effect of higher ingredient costs caused by a weaker pound. Sadly the situation is by no means confined to the larger chains and seemingly debt – backed over expansion. Frankie and Benny's is the latest restaurant experiencing financial difficulties (Image: TripAdvisor) \n5. Competition \nThe restaurant sector is fiercely competitive with so much choice available. The rapid shift towards online shopping and meal delivery services has also taken a severe toll. \nNow, when diners do venture out for a meal with their tightened purses the restaurant needs to do something to entice the customer into their establishment. Like us on Facebook", "external_links": [], "published": "2018-04-17T16:33:00.000+03:00", "crawled": "2018-04-17T16:38:10.003+03:00", "highlightTitle": ""}