{"organizations": [], "uuid": "2acc99b771b0f70e903a6db1be343813f95eab6c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/news/uk-world-news/article293320.ece/ALTERNATES/s1200/34124061.jpg", "site_section": "http://www.leicestermercury.co.uk/rss.xml", "section_title": "leicestermercury - frontpage", "url": "https://www.leicestermercury.co.uk/news/business/put-your-questions-brexit-minister-1509264", "country": "GB", "domain_rank": 48128, "title": "We put your questions to Brexit minister, this is what he said", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-04-28T16:41:00.000+03:00", "replies_count": 0, "uuid": "2acc99b771b0f70e903a6db1be343813f95eab6c"}, "author": "Tom Pegden", "url": "https://www.leicestermercury.co.uk/news/business/put-your-questions-brexit-minister-1509264", "ord_in_thread": 0, "title": "We put your questions to Brexit minister, this is what he said", "locations": [], "entities": {"persons": [{"name": "callanan", "sentiment": "negative"}, {"name": "leicester mercu", "sentiment": "negative"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "voluntary action leicester", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "leicester mercury", "sentiment": "none"}, {"name": "east midlands chamber of commerce brexit advisory group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "We put your questions to Brexit minister, this is what he said Lord Callanan answers Leicester Mercury readers' questions on leaving the EU Share Click to play Tap to play The video will start in 8 Cancel Play now Get Business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nThe Minister of State at the Department for Exiting the European Union visited Leicester yesterday to talk to charity workers and business leaders about the impact of Brexit.\nLord Callanan visited the team at Voluntary Action Leicester and met members of the East Midlands Chamber of Commerce Brexit Advisory Group, updating them on the progress of the Government's plans and negotiations with the EU.\nHe also answered questions posed by Leicester Mercury readers, a selection of which, with the minister's answers, are below.\nThe Tory minister told the Mercury contingency arrangements would be in place if Britain failed to reach a trade deal with Europe, and said there was no chance of a second referendum to finalise the EU divorce plans.\nThe visit came as the Office for National Statistics issued figures showing the UK economy grew at its slowest rate since 2012 in the first three months of the year.\nGDP growth was 0.1 per cent, down from 0.4 per cent during the previous three months, partly due to a slowdown in construction and manufacturing. Lord Callanan is Minister of State at the Department for Exiting the European Union (Image: Chris Gordon)\nLeicester Mercury readers submitted questions about Brexit for the minister to answer. Here is what he said:\nSteve Fox on Twitter asked how soon the Government expected to get EU migration below 50,000 a year.\nLord Callanan said: \"We've set a target of getting immigration as a whole down to the tens of thousands and obviously that's very difficult to achieve when free movement is in operation. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now\n\"But we will be announcing a new, UK-based immigration policy towards the end of this year, which will start to kick in at the end of the implementation period in 2020, and then we will be able to determine our own requirements for inward immigration.\"\nOn Instagram, gaia_gardening felt it was \"disgusting\" that the country had been \"lied to\" in the lead up to the referendum, while brigitte0902 said the result had not been decisive enough for Britain to split from Europe.\nLord Callanan said: \"There was a big debate, one of the largest national debates that we've had on a subject, over many weeks.\n\"There was the biggest participation rate that we've had in any democratic process in the UK for many, many years, and British people reached a decision.\n\"There are criticisms on both sides.\n\"There are criticisms from the Leave campaign material and there are equally valid criticisms of some of the Remain campaign economic scare stories that proved not to be the case.\n\"It was a robust campaign on both sides, and I trust the judgement of the British people. We are a democratic country.\n\"We have decided as a whole that we are going to leave the European Union and this Government is committed to implementing the results of that referendum.\"\nAlan Head on Twitter suggested Britain should just walk away from the EU, and fall back on World Trade Organisation (WTO) trading terms.\nLord Callanan said: \"We don't think that's the best way of proceeding.\n\"We think that it would be better to have a deal with the EU, a deep and comprehensive free trade agreement and defence partnership.\n\"At the end of the day, they are our closest neighbours and we think that's better for the prosperity of the UK, better for the prosperity of Europe, than leaving without a deal and moving to WTO rules.\n\"It's a slight risk [that we might leave without a deal], but it's always possible.\n\"It's not an outcome we want, not an outcome we desire.\n\"I think, given the agreements that we've reached so far, both in December and in March, on the withdrawal agreement and the implementation period, the risks of leaving without a deal are getting less and less by the day.\n\"But of course, as a responsible Government we are going to put in place contingency arrangements in case that does happen. But it's not an outcome that we desire.\"\nHe said that as a \"resilient country\" we would manage without a deal, though it would be \"disruptive\".\nOn Twitter, Lib Dem campaigner Mathew Hulbert (@hulbertmathew) asked for a second referendum on the finished deal and wondered of there was a single scenario where the UK would be better off.\nLord Callanan said: \"People have already had the final say.\n\"We had a referendum and people decided to leave the European Union.\n\"Then following that we had a General Election where 80 per cent of people voted for parties that said they were going to implement the results of the referendum.\n\"The Liberal Democrats campaigned to reverse the result and have another referendum, and they got 7 per cent of the vote.\n\"There's no chance of another referendum. We've made that decision.\n\"We can't be in a state of ongoing national paralysis about this. We have to make a decision and we have to get on with it. Read More Contracts \"being lost\" due to poor investment in Leicestershire railways, roads and digital\n\"One of the biggest criticisms that I receive from business and industry is about the levels of uncertainty.\n\"Now we've agreed the implementation period. We are getting on with negotiating the deal with the EU to try to remove that uncertainty. Read More\n\"To have to legislate for and then implement another referendum of uncertain outcome would lead to political and constitutional chaos for years to come and in my view no responsible politician should advocate that.\" Like us on Facebook ", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/leicestermercury/subscriptions/&quot;}"], "published": "2018-04-28T16:41:00.000+03:00", "crawled": "2018-04-28T18:38:16.008+03:00", "highlightTitle": ""}