{"organizations": [], "uuid": "bd948e1539a2a3bb29b3f441cf52891308f33866", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article12410657.ece/ALTERNATES/s1200/FCR_NJL_220316AP.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/offering-1bn-shipbuilding-contract-foreign-14558034", "country": "GB", "domain_rank": 21960, "title": "Offering £1bn shipbuilding contract to foreign firms is a 'kick in the teeth', says North East MP", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-04-22T10:00:00.000+03:00", "replies_count": 0, "uuid": "bd948e1539a2a3bb29b3f441cf52891308f33866"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/offering-1bn-shipbuilding-contract-foreign-14558034", "ord_in_thread": 0, "title": "Offering £1bn shipbuilding contract to foreign firms is a 'kick in the teeth', says North East MP", "locations": [], "entities": {"persons": [{"name": "north e", "sentiment": "negative"}, {"name": "stephen hepburn", "sentiment": "none"}, {"name": "jarrow", "sentiment": "none"}], "locations": [{"name": "south korea", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "poland", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "navy", "sentiment": "none"}, {"name": "ministry of defence", "sentiment": "none"}, {"name": "british navy", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Offering £1bn shipbuilding contract to foreign firms is a 'kick in the teeth', says North East MP The Government is allowing firms from Germany, South Korea, and Poland to bid on a £1bn contract to ubild Navy support ships Share Click to play Tap to play The video will start in 8 Cancel Play now   \nA decision that could see British Navy ships built overseas has been branded a “kick in the teeth” for British workers by a North East MP. \nStephen Hepburn, MP for Jarrow , said it would be “appalling” if a £1bn contract to build a fleet of Navy support ships was handed to a foreign firm when workers in the North East had the skills to carry out the work. \nThe £1bn contract will see the winning bidders build a fleet of three military support ships, which will be used to service the UK’s £6.3bn Queen Elizabeth-class aircraft carriers and their strikeforce of new F-35 fighter planes. \nThe Ministry of Defence has said that the Fleet Solid Support order will go out to tender on April 30. But under the current tender, North East companies looking to win the work will not only have to compete with other UK firms, but also manufacturers in Germany, Italy, the Netherlands, Poland, South Korea, and Spain. A&P Tyne in Hebburn (Image: handout) \nMr Hepburn said: “It would be appalling if such prestigious contracts are awarded outside of the UK and thousands of jobs here in Britain are lost. \n“Yards in the North East deserve a lion’s share of new warship orders after winning accolades for their fantastic effort in fulfilling contracts for the Royal Navy’s new aircraft super-carriers HMS Queen Elizabeth and HMS Prince of Wales. \n“After the fiasco of the blue passports contract it would be another kick in the teeth for British workers if the Tories put out another prestigious order of national significance to tender abroad. Read More Blue passport decision 'too important to be made on price', Gateshead MP says \n“We already have a hugely skilled shipbuilding workforce in the UK with so much to offer and it would be a gross betrayal on the part of the Tories if this vital work is awarded to companies overseas.” \nThe North East has a strong history of shipbuilding, and is still home to a number of major shipbuilding companies such as A&P Group. Stephen Hepburn MP \nLast year the company was named as a “strong contender” for a contract to build five Navy frigates by former Defence Secretary Michael Fallon. A&P operates a shipyard in Hebburn, which falls within Mr Hepburn’s constituency. \nThe tender decision has proved controversial following the Government’s recent decision to award a contract to print the iconic blue British passport to Franco-Dutch firm Gemalto. \nDe La Rue has been manufacturing British passports for the last 10 years from its factory in Team Valley, Gateshead. Around 200 workers are based in De La Rue’s passport division, and it is unknown whether the company will be forced to make cuts to its team following the loss of the contract. \nTrade union GMB, which represents UK shipbuilding workers, is calling for ministers to reverse their decision to allow overseas firms to bid on the support ship contracts, saying the plans are a “betrayal of May’s ‘red, white and blue Brexit’”. Read More Jobs hopes as Hebburn's A&P yard named 'strong contender' to build Navy frigates \nThe union estimates that if the work was kept in the UK it could create up to 6,700 jobs, including 1,800 based in shipyards and 4,700 in the supply chain. It also estimates that £285m would also be returned to the taxpayer through income tax, national insurance contributions and lower welfare payments. \nRoss Murdoch, GMB national officer for shipbuilding, said: “We have a highly skilled shipbuilding workforce in the UK that is more than capable of making these ships at a fair market price.” Like us on Facebook", "external_links": [], "published": "2018-04-22T10:00:00.000+03:00", "crawled": "2018-04-22T11:11:18.003+03:00", "highlightTitle": ""}