{"organizations": [], "uuid": "05f2205dfca9e3c81c9e20bdddf7c241fb7fff35", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14493672.ece/ALTERNATES/s1200/JS44327862.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14489751", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: 5G mobile airwaves auction raises £1.3bn during first stage of bidding", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-04-05T10:00:00.000+03:00", "replies_count": 0, "uuid": "05f2205dfca9e3c81c9e20bdddf7c241fb7fff35"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14489751", "ord_in_thread": 0, "title": "Business Breakfast LIVE: 5G mobile airwaves auction raises £1.3bn during first stage of bidding", "locations": [], "entities": {"persons": [{"name": "jonathon manning", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "vodafone", "sentiment": "none"}, {"name": "ofcom", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning Hammerson in wait-and-see mode ahead of Klepierre takeover move \nHammerson will not finalise its £3.4bn tie-up with Intu as it awaits clarity on a takeover approach from European rival Klepierre.The shopping centre giant said in a trading statement that while Klepierre’s position “remains unclear”, the board does “not intend to finalise shareholder documents in relation to the proposed acquisition of Intu”.Hammerson has branded Klepierre’s £4.88bn cash-and-shares offer “wholly inadequate” and “entirely opportunistic”, but the French firm has until April 16 to “put up or shut up” with a formal offer.Bull Ring owner Hammerson would prefer to press ahead with an all-share takeover of rival Intu, which would create Britain’s biggest property company with £21bn worth of assets across Europe.Intu operates the Trafford Centre in Manchester, while Hammerson owns the Bicester Village and Brent Cross shopping centres.Hammerson also shed some light on first-quarter trading, pointing to a combination of severe weather and subdued consumer confidence weighing on UK retail sales, which were down 2%.However, Hammerson said that its shopping centres outperformed the market with Bicester Village delivering a double-digit increase in the period.Footfall at Hammerson’s UK centres was up 0.5% over the quarter and up 5% over the Easter weekend.The group also flagged a £3.5m hit to net rental income from the wave of retail restructurings and administrations that have afflicted the sector, including Toys R Us and New Look.David Atkins, Hammerson chief executive, said: \nWhilst we recognise the difficult trading environment and challenges felt by many retail and restaurant formats in the UK, there continues to be good demand for space across our centres. The Bullring shopping centre in Birmingham, which is owned by Hammerson 9:15 Jonathon Manning New boss for former 'tech unicorn' VE Global \nVe Global, the former “tech unicorn” in the middle of a financial turnaround, has parted company with its chief executive.Morten Tonnesen has left the firm after 12 months in the post, with chief operations officer David Marrinan-Hayes being promoted to CEO.Mr Tonnesen’s decision to leave the business was driven by family commitments and a desire to pursue other projects, the Press Association understands.Ve Global, which has 10,000 clients worldwide, was burning through £2m a month when it collapsed into administration in April 2017.Since then, it has secured £15m from investors, let go of around 100 UK staff and shifted into new offices at the White Collar Factory in London’s Old Street.The advertising technology firm said Mr Tonnesen had “successfully consolidated and strengthened” the firm’s position over the past year.Mr Tonnesen said: \nHaving worked closely with David from day one, I have no doubt that the relationships he has built at every level of the business, together with his fortitude, will put Ve Global on the next stage of its journey. \nI am immensely proud of what has been achieved at Ve over the past 12 months. \nI wanted to ensure that the company was robust and healthy enough to transition to the next stage in its development and I am pleased to say that we have achieved that. \nVe Global - formerly known as Ve Interactive when it was considered a “tech unicorn”, a startup company valued at over $1bn - is eyeing a return to profit this year as a company overhaul gains traction.The company announced in January that it was beefing up its board by appointing entrepreneur Michelle Mone as a non-executive director.Mr Marrinan-Hayes said: \nI am looking forward to taking up the mantle and delivering the next phase of Ve’s transformation. \nIt has been a great pleasure working alongside Morten and, thanks to his experience, connections and counsel, Ve is much closer to achieving its goals with many opportunities that he has provided for us. \nVe Interactive founder David Brown left the business last year after coming under fire for the firm’s exorbitant spending under his tenure. Piles of money Jonathon Manning Default product 'should be offered to those who find pension options daunting' \nA default pathway should be offered to people receiving their pension to protect those who are not engaged with their retirement savings, according to a committee of MPs.The Work and Pensions Committee said that while automatic enrolment has been a “tremendous success” by defaulting people into pension saving, in the decumulation phase - when people receive their pension - people must actively choose what to do with their savings.The committee said pensions can seem “distant and daunting. Faced with bewildering complexity, many people simply switch off.”Too many people are not shopping around and do not understand their options for investing their savings, it said.Its pension freedoms report said: \nWe recommend every pension provider offering drawdown is required, by April 2019, to offer a default decumulation pathway suitable for their core customer group. \nThe same charge cap that applies to automatic enrolment schemes, 0.75%, should apply to default drawdown products, the report said.It continued: \nPeople would still be free to choose to invest and spend their own money as they wished. But if they did not make an active choice, they would move into a suitable and regulated default product. \nThe report said Government-backed pension scheme Nest, which was set up to support auto-enrolment, should be allowed to provide decumulation products from April 2019, including a new default drawdown pathway.The report said evidence from automatic enrolment suggests Nest may drive better retirement outcomes by forcing other providers to offer greater value or risk savers switching over to Nest to get a better retirement deal.The committee also said there should be a single pensions dashboard, where people can see all their pension pots in one place, in place by April 2019.It said the multiple pensions dashboards being planned, “hosted by self-interested providers”, would only “add complexity to a problem crying out for simplicity”.The report said: \nRather than regulating the dashboards into consistency, it is far simpler just to have one. \nThe case for a publicly hosted pensions dashboard is clear-cut. Consumers want simple, impartial, and trustworthy information. File photo dated 06/01/15 of money in a piggy bank, as workplace pension savers will see their minimum contributions increased from Friday, as the next stage in boosting peopleÕs future retirement incomes gets under way. PRESS ASSOCIATION Photo. Issue date: Thursday April 5, 2018. Minimum pension contribution rates under automatic enrolment will rise to a combined 5%, with a minimum of 2% from the employer and the remaining 3% from staff. See PA story MONEY Enrollment. Photo credit should read: Gareth Fuller/PA Wire 9:00 Jonathon Manning Durham fishing business reeling in sales thanks to free training \nA Durham fishing firm has boosted its sales after receiving free training aimed at growing North East businesses. \nThe Durham Fly Fishing Company has increased its number of bookings by 20% after its owner Stuart Wardle entered the ‘Boost Your Business Programme, which is led by the North East Enterprise Agency. \nMR Wardle is an expert trout fisherman who runs his business from Hutton Henry. He offers guiding, coaching, tuition and team building days for his customers. \nHe said: \nParticipation in the course has been an invaluable experience definitely helping to move my business forward and secure more work. My diary is the busiest it’s been since I opened for business. \nGaining new skills in enterprise development and digital promotion and sales tools, along with the opportunity to network with other businesses, has been really useful. \nIt also allowed me to take some time to think about my business, future goals and how to achieve them. I’m really excited about the future and the opportunities for growth. 8:55 Jonathon Manning Rank tanks following profit warning \nShares in Mecca Bingo owner Rank Group tumbled on Thursday after the firm warned over profits.The group, which also owns the Grosvenor Casinos chain, blamed weaker than expected visits that were “compounded” by the recent cold weather.Rank added that underperformance at Grosvenor has been exacerbated by a “negative contribution” from its usually big spending “VIP players”.In a trading update covering the 13 weeks to April 1, the firm booked a 2% fall in like-for-like sales.Mecca Bingo’s revenue fell by 2%, Grosvenor’s venues revenues fell by 9%, although digital revenue grew by 17%.As a result, the firm’s management now expects full year operating profit to be in the range of £76m to £78m, below analysts’ consensus of £83m. \nRank said: \nThe board is cautious about the UK consumer outlook and as a result expects the group’s UK venues to continue to be impacted for the remainder of the 2017/18 financial year and into 2018/19. \nShares tanked over 13% to 185p following the news.The profit downgrade comes despite a push to reinvigorate the bingo scene, with “experiential” events such as Batty Bingo, Bonkers Bingo and Big Bingo Bash, as well as a bingo-themed mini-cruise in partnership with P&O Ferries. \nThe firm added: \nAs highlighted in Rank’s recent interim results statement, a number of key operational actions have been identified and are being put into place to improve Grosvenor’s performance over the medium to long term. Mecca Bingo Jonathon Manning Womble Bond Dickinson advises on sale of North East newspaper \nNewcastle law firm Womble Bond Dickinson has advised on the sale of CN Group, which owns newspapers in Cumbria, Nuthumberland, North Lanchashire, and the Scottish Borders. \nThe newspaper group - which publishes the News & Star, Cumberland News, Times & Star, In Cumbria, The Whitehaven News and the Hexham Courant - was sold to Newsquest Media Group. \nThe team at Womble Bond Dickinson was led by Corporate Partner Jamie Pass and included a large team including corporate lawyers Ben Butler, Iain Pritty, Oliver Rickett and Anna McGill, tax partner Jeremy Smith and Martin Poore and Naomi Jacques from the firm’s pensions team. \nJamie Pass, Corporate Partner, said: \nWomble Bond Dickinson has had a close working relationship with CN Group for over 20 years. I am extremely pleased that we have been able to assist the board in securing its future and in achieving this successful exit for the company’s shareholders. This transaction is a good example of our commitment to working with clients across Cumbria and the wider North of England. \nMiller Hogg, outgoing CEO of CN Group, said: \nWe have been very impressed with the team at Womble Bond Dickinson and their resources and expertise have been evident throughout the sale process. Their handling of both the radio and publishing sales has been excellent and it has been good to work with a team who both understood our business and are committed to our region. This deal will provide a sustainable future for our Cumbrian based business with a media partner capable of investing for the print and digital world we live in. The press hall, at Cumbrian Newspapers, Newspaper House, Dalston Road, Carlisle, pictured after signing the documents for the takeover of CN Group by Newsquest are from left, lawyers Oliver Rickett and Jamie Pass from Womble Bond Dickinson, 9 March 2018 LOUISE PORTER 8:45 Demand for new cars dropped 16% in March \nThe new car market continues to decline as demand for diesels plummets, industry figures show.Preliminary figures for March show that new car registrations fell by around 15.6% year-on-year, according to the Society of Motor Manufacturers and Traders (SMMT).This was driven by a fall of just over 37% in the number of new diesel cars bought.Registrations of petrol cars rose by almost 1%, while demand for alternatively fuelled vehicles such as hybrids and pure electrics increased by around 5.7%.The overall market fell by approximately 12% in the first quarter of the year.The SMMT had predicted a “softening” of new car sales last month as March 2017 saw a record high for registrations due to many motorists buying cars before changes to vehicle excise duty came into effect.But Jim Holder, editorial director of What Car? magazine, said low consumer confidence and uncertainty around the future of diesel vehicles “continue to have an impact”.It is “pertinent” that the ongoing drop in diesel sales is not matched by equivalent rises in sales of petrol and electrified cars, he told the Press Association. \nHe said: \nBuyers don’t believe that petrol or electrified cars can deliver the performance or economy benefits they need, and so they are holding on to older vehicles for longer. \nThat evidence would suggest once again that the Government would do well to clarify its position on diesels and to stimulate people into buying newer, cleaner cars. \nMr Holder added that the sales figures were “not that negative” as it was still the fourth best March on record.All new diesels have been subjected to a one-band increase in the first-year vehicle excise duty rate since Sunday.Plans have also been unveiled to ban the sale of all conventional diesel and petrol cars by 2040.Justin Benson, head of automotive at auditors KPMG UK, said: \nMuch like businesses, consumers are currently in the wait and see camp wanting certainty around the economic environment. \nBrexit, concerns over inflation above earnings growth and the Bank of England’s hints that they will raise interest rates in the near future are all causing consumers to hold back. \nIf you are in the market for a new car you should drive a hard bargain. A registration plate KEY EVENT Council leaders accused of 'gambling' with public money on key jobs site \nCouncil leaders are being accused of “gambling” with tens of millions of pounds of public money as the battle over one of the region’s main jobs sites continues. \nIt is hoped that 7,800 jobs will be created on the International Advanced Manufacturing Park (IAMP), which covers more than 150 hectares in Sunderland and South Tyneside and aims to build on the success of the nearby Nissan factory. \nBut a row broke out over the plans at the end of last year when developers Town End Farm Partnership - which owns around a third of the land - said the councils’ approach meant the project would not be developed in time to meet deadlines for Nissan suppliers to be in place when new models go into production. \nHowever Sunderland City Council disputes this, saying “land outside of IAMP ONE is not required to meet current automotive supplier timescales”. \nIAMP is being backed by £42m of Government money, with its importance being shown by the fact that that sum came from a total of £49.7m alloted to the whole of the North East from a jobs creation fund. \nDevelopers appointed by Sunderland and South Tyneside councils have put in a planning application for the first phase of the development, but Town End is calling on Environment Secretary Sajid Javid to intervene and has also threatened a legal challenge. \nThe row over the site reached a meeting of Sunderland Council at the end of March, with Mel Spedding, cabinet secretary at the authority, insisting all land at the site will be under the council’s control by 2020. \nBut now Town End director Peter Razaq has called for scrutiny of the councils’ approach to the project. \nHe said: \nThere is huge potential to attract private investment. However, public money is being gambled with by council leaders that refuse to listen to advice. It is sad to watch and unless there is a change in approach it is a completely wasted opportunity. \nFor several years now we have attempted to reach out, advise and work with our local authority partners and we still hope our advice can be taken on board. We all wish to see the benefits of investment become a reality. \nHowever, if ours and others advice goes unheeded this special opportunity could be lost. One of the jewels in the crown of the North East economy, our automotive sector, will be let down very badly if the development doesn’t come to fruition. \nIt would be an unnecessary act of economic self-harm and we call upon the local councils concerned to work with us to safeguard and grow this sector which has given our region so much. Aerial sketch of IAMP (Image: Handout) 8:35 Land registry registers first 'digital mortgage' \nThe Land Registry has registered its first “digital mortgage deed” signed online.It said a “sign your mortgage deed” service will mean borrowers no longer need to apply pen to paper while witnesses watch, saving time and cutting out the risk of documents getting lost in the post.They will be able to log in and sign their deed at a time when it suits them.The new digital mortgage service is currently still being tested out and could become more widely available in the coming months.The first phase of this service has been aimed at home owners going through the remortgaging process.Once a borrower’s identity has been confirmed, they get a code to input which shows they are the person signing the deed.The digital signature is not an electronic copy of a handwritten signature, but a secure way of confirming the content of a deed and the identity of the person signing it.The Land Registry said the registration of the deed for a house in Rotherhithe, London, follows months of collaboration and testing with Coventry Building Society and Enact Conveyancing and used gov.uk verify - the government identity assurance service - to enable borrowers to verify their identity before digitally signing their mortgage deed online.The Land Registry said the move is part of wider efforts to simplify the home buying process.Land Registry chief executive and chief land registrar Graham Farrant said: \nBy working with partners in the industry, we have secured a simpler and faster service for the benefit of home owners. \nWe are looking forward to rolling this out nationally and will be working with more conveyancers and lenders to do so. \nPeter Frost, chief operating officer at Coventry Building Society, said: \nAlthough this initiative has started with re-mortgages we’re excited about the potential for it to be extended to purchases in the future. \nBen Carroll, Enact Conveyancing’s managing director, said: \nWe are extremely pleased to join HM Land Registry and Coventry Building Society on this pioneering effort to transform the conveyancing process. \nThis fully digitised journey will mean that a customer can sign their mortgage deed online at a time and place of their choosing, securely underpinned by the gov.uk verify platform. \nThe Land Registry safeguards land and property ownership worth over £4tn, including around £1tn of mortgages.The Land Register contains more than 25 million titles showing evidence of ownership for more than 85% of the land mass of England and Wales. The Land Registry has registered its first “digital mortgage deed” signed online (Image: Dominic Lipinski/PA Wire) 8:30 What is the gender pay gap? 8:25 Jonathon Manning Three-quarters of North East firms pay men more than women according to Government data \nMore than three-quarters of North East businesses pay their male employees more than their female colleagues, according to data published by the Government. \nIn total 238 North East companies have published their gender pay gap figures but only 27 firms were found to pay women more than men while 30 paid exactly the same. \nBusinesses with more than 250 employees are now required by law to report the difference between male and female pay within their workforce. More than 9,500 companies around the UK have now reported their pay gap figures, which have highlighted the disparity between the sexes. \nIntrahealth Limited, a collection of GP practices headquartered in Peterlee, County Durham, was found to have the biggest gender pay gap, with women paid a median hourly rate 55.5% lower than men. The figure means that on average women earn 44p for every £1 earned by a man. \nThe gap seems to have been created because more women work in the lowest paid positions within the company compared to the highest paid. \nFollowing closely behind Intrahealth in terms of the biggest pay gap was Billingham’s Beaver Management Services Limited, which women paid a median hourly rate 55% lower than men, and Gateshead security firm The Protector Group Limited, at 52.9%. \nAmong the 20 North East businesses with the largest pay gaps 10 of them operate within the education sector. The Blyth Quays Trust, which operates three primary schools, had the biggest gap and pays its female staff 49.5% less than its male staff. \nWard Hadaway and Womble Bond Dickinson UK LLP - the region’s biggest law firms - were also among the firms with the largest pay gaps. Ward Hadaway was found to pay its female staff an hourly rate 44.5% lower than men, while Womble Bond Dickinson paid 37.4% less. \nIn a report published by Ward Hadaway, managing partner Jamie Martin said: \nBased on our analysis we are confident that men and women are paid fairly for equivalent roles. \nThe quartile results highlight that we employ more females in support roles (eg legal secretaries) than males and also employ more females than males in our top pay quartiles (solicitors, associates and consultants etc). \nWhilst we recognise that further progress still needs to be made, the gender balance in our quartile three and highest quartile reflect the progress we have made in more females holding senior roles. The pay gap in the highest quartile is reflective of the high earners being consultants, of which a high proportion are males. \nWe are committed to reducing our gender pay gap and will continue to support the progression of females to senior roles. \nOn the other side of the scale car parts manufacturer SAI Automotive Washington Limited was found to have the largest pay gap in favour of women. The company paid women a median hourly rate 40.7% higher than men, meaning women earn £1.41 for every £1 earned by a male colleague. A picture to illustrate the gender pay gap (Image: Mirrorpix) 8:20", "external_links": [], "published": "2018-04-05T10:00:00.000+03:00", "crawled": "2018-04-05T10:11:05.005+03:00", "highlightTitle": ""}