{"organizations": [], "uuid": "8ad3c0b6dbbe79f6eb9312bca192abd67bdd025b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1400606.ece/ALTERNATES/s1200/1-2.jpg", "site_section": "https://www.devonlive.com/rss.xml", "section_title": "devonlive - frontpage", "url": "https://www.devonlive.com/news/government-accepts-quarter-devon-farms-1414076", "country": "US", "title": "The government accepts that a quarter of Devon farms could go bust post-Brexit as European subsidies are withdrawn", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-04-03T18:02:00.000+03:00", "replies_count": 0, "uuid": "8ad3c0b6dbbe79f6eb9312bca192abd67bdd025b"}, "author": "Colleen Smith", "url": "https://www.devonlive.com/news/government-accepts-quarter-devon-farms-1414076", "ord_in_thread": 0, "title": "The government accepts that a quarter of Devon farms could go bust post-Brexit as European subsidies are withdrawn", "locations": [], "entities": {"persons": [{"name": "defra", "sentiment": "none"}, {"name": "ludivine petetin", "sentiment": "none"}, {"name": "petetin", "sentiment": "none"}], "locations": [{"name": "devon", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "farmers’ guardian", "sentiment": "none"}, {"name": "farmers guardian", "sentiment": "none"}, {"name": "wildlife conservation trust", "sentiment": "none"}, {"name": "cardiff university", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe Department for the Environment, food and rural affairs is ready to lose up to a quarter of farm businesses when Brexit bites, a leading agricultural expert has warned. \nThe warning, discussed in this week’s Farmers’ Guardian, comes from Dr Ludivine Petetin, who specialises in food and farming law and works at Cardiff University’s policy department. He made the remarks at a meeting organised by the Game and Wildlife Conservation Trust, the Farmers Guardian reports. \nDr Petetin told delegates: “A lot of farms are currently profitable only because of direct payments coming from the Common Agricultural Policy (CAP). \n“From reading the agriculture consultation, it seems to me, and this is going to sound harsh, Defra has made a choice that the 25% of farms which are at the bottom and are not doing very well will perhaps disappear.” Read More Struggle to get a dentist in Devon is revealed \n“I think they are focusing on the 50 per cent in the middle as to how they can turn away from direct payments to environmental payments.”Defra has said it believes the change from payments linked to acreage made under the EU’s Common Agricultural Policy to payments made by the UK Government linked to the delivery of “public goods” doesn’t have to lead to farm business failures. \nA Defra spokesman said: “We have launched a consultation on agriculture which sets out an ambitious and positive future for farming. Our proposals will see money redirected from direct payments based only on the amount of land farmed to a new system of rewarding farms of all sizes for their work to enhance the environment. \n“We encourage all interested parties and farmers to have their say before the consultation closes on May 8.” \nMany farmers, however, are privately sceptical that Defra under Secretary of State Michael Gove has any real interest in maintaining the UK’s ability to produce home-grown food. They fear Mr Gove believes the global market will be able to make up any shortfall if UK farming suffers a downturn as a result of Brexit. \nHead of Exeter's Northcott Theatre stands down \nYesterday International Trade Secretary Liam Fox identified a possible trade deal with Australia as an example of a positive Brexit dividend – but the price we have to pay could include having to take Australian beef reared using growth hormones – something currently banned under EU rules. \nThe National Farmers Union reacted with concern to the possible deal warning of the need for a level playing field without forcing UK farmers to compromise on health and safety standards. \nFarmers Guardian editor Ben Briggs warns: “Far from those with the lowest returns finding themselves heading for the exit post-Brexit, we all know many farmers have the capacity to live on very minimal returns as it is the lifestyle, not the money, they crave. What such an approach could actually result in is those farms in the middle which have invested heavily finding themselves facing the greatest hardship.” Like us on Facebook ", "external_links": [], "published": "2018-04-03T18:02:00.000+03:00", "crawled": "2018-04-03T18:37:46.053+03:00", "highlightTitle": ""}