{"organizations": [], "uuid": "e6c81e5cf605625a8862a2c2dda85dfc9ed39c3a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article563137.ece/ALTERNATES/s1200/ANDrew-Bridgen.jpg", "site_section": "", "section_title": "", "url": "https://www.leicestermercury.co.uk/news/local-news/ill-endure-21-uncomfortable-months-1412618", "country": "GB", "domain_rank": 48128, "title": "'I'll endure 21 'uncomfortable' months for the Brexit prize - Bridgen - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-04-05T18:46:00.000+03:00", "replies_count": 0, "uuid": "e6c81e5cf605625a8862a2c2dda85dfc9ed39c3a"}, "author": "Leicester Mercury", "url": "https://www.leicestermercury.co.uk/news/local-news/ill-endure-21-uncomfortable-months-1412618", "ord_in_thread": 0, "title": "'I'll endure 21 'uncomfortable' months for the Brexit prize - Bridgen - Leicester Mercury", "locations": [], "entities": {"persons": [], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nIt has been a very busy few weeks in Parliament with the terms of the Brexit transition deal now completed, the fallout from the use by Russia of a chemical weapon in the UK, announcements on housing and a new pay deal for those who work in the NHS. \nOn the matter of the transitional deal, this will provide certainty and clarity and will give governments, businesses and citizens in both the UK and the EU the time they need to put in place the new arrangements required, as the terms of our future partnership become clearer. Read More Thieves smash into same Air Ambulance charity shop twice in 2 weeks \nThis period will also put us in the best position possible to take advantage of leaving the single market and customs union – providing for a smooth and orderly exit from the EU, while also allowing us to negotiate, sign and ratify new deals with fast growing markets in the rest of the world from the moment we leave the EU in March 2019. \nThere are, of course, aspects of the deal I am not comfortable with, such as on fishing rights and these concerns are being represented. \nI am, however, willing to endure 21 “uncomfortable” months of transition to achieve the prize of a real Brexit where we regain control of our laws, borders and money. Military personnel are seen outside Salisbury District Hospital where a number of potentially contaminated vehicles are to be removed after former Russian double agent Sergei Skripal and his daughter were found critically ill after exposure to a nerve \nOn the issue of the attack in Salisbury on Mr Skripal and his daughter, it was determined early on that they were poisoned with a military-grade nerve agent of a type developed by Russia. \nThis left two plausible explanations. Either this was a direct act by the Russian state against the UK, or the Russian government lost control of a military-grade nerve agent and allowed it to get into the hands of others. \nThe Government offered Russia the opportunity to provide an explanation, but it failed to explain how this agent was used or why they have an undeclared chemical weapons programme. \nThere is, therefore, no alternative conclusion other than that Russia was culpable for the attempted murder of Mr Skripal and his daughter – and for threatening the lives of other British citizens in Salisbury, including Detective Sergeant Nick Bailey. \nThis attempted murder in Salisbury was not just an act against the UK. \nIt is an affront to the rules-based system on which the UK and our international partners depend. \nWe must work with our allies and partners to confront such actions wherever they threaten our security, at home and abroad and we should be heartened by the show of solidarity by many nations in expelling Russian diplomats. \nThe Government is prioritising the building of homes at present and this is an area where North West Leicestershire is already doing its bit, as I explained at Prime Minister’s Question Time recently when I cited that over the past three years, more than 2,000 homes have been built in North West Leicestershire, including a record 731 in the past 12 months. \nAdditionally, we are building council houses for the first time in decades. \nThat is all in contrast with the 227 houses completed in the year to 2010, which was the last time Labour was in government. \nI also pointed out that our unemployment rate had fallen by 70 per cent and youth unemployment by 80 per cent since 2010. \nThe Prime Minister praised our record stating: “I am pleased my hon friend has raised the example of North West Leicestershire and we are very happy to join him in acknowledging the example it is setting.” \nThis month, the first new council houses to be built in our district for 30 years will be completed and I look forward to visiting the site. \nWe have a record to be proud of and I was pleased to be able to cite our success in Parliament. \nI also brought up the council’s record on homelessness and although we don’t have any recorded homeless people, there is a wider issue. \nFrom April, the Homelessness Reduction Act will be implemented. \nThe most ambitious legislative reform in tackling homelessness in decades and supported by both Shelter and Crisis, this Act will require councils to provide early support to people at risk of homelessness. \nFurthermore, over £1 billion has been allocated through to 2020 towards tackling homelessness and rough sleeping, including £28 million for three Housing First pilots. \nThese pilots will support some of the most entrenched rough sleepers off the streets, providing them with stable accommodation and intensive, wrap-around support. \nHomelessness is a symptom of often complex problems such as addiction issues, mental health problems and family breakdown and it is tackling these underlying causes which is fundamental to solving the problem of rough sleeping. \nThe Government has also announced wage rises for more than 1.1 million NHS workers in England, with the pay of the lowest earning NHS staff, such as porters, cleaners and hospital caterers, increasing substantially as a result of pay band reform. \nThese staff will see their basic pay increase by 15 per cent over the next three years. \nThis has only been possible because of the way the Conservatives have managed the Government finances and brought down the record deficit left by Labour. \nThe ability of the Govenemnet to increase NHS wages is a direct result of areas like ours which have delivered some of the highest economic growth in the country and which continues to drive our economy forward. \nFinally, I was pleased to see that the parliamentary standards investigation into Keith Vaz MP has restarted. \nPerhaps, after nearly 18 months, the matter may finally be concluded. Read More ", "external_links": [], "published": "2018-04-05T18:46:00.000+03:00", "crawled": "2018-04-06T00:12:19.001+03:00", "highlightTitle": ""}