{"organizations": [], "uuid": "8c1f40075038b9307e811bc550982105992768cd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14532044.ece/ALTERNATES/s1200/Pro-European-Campaign-Monument-Newcastle.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/nissan-factory-close-after-brexit-14531837", "country": "GB", "domain_rank": 21960, "title": "Nissan factory WILL close after Brexit, says Pro-European campaigner", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-04-14T20:00:00.000+03:00", "replies_count": 0, "uuid": "8c1f40075038b9307e811bc550982105992768cd"}, "author": "Sophie Doughty", "url": "https://www.chroniclelive.co.uk/news/north-east-news/nissan-factory-close-after-brexit-14531837", "ord_in_thread": 0, "title": "Nissan factory WILL close after Brexit, says Pro-European campaigner", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "negative"}, {"name": "hardman", "sentiment": "none"}, {"name": "david hardman", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "grey", "sentiment": "none"}], "organizations": [{"name": "pro-european", "sentiment": "negative"}, {"name": "nissan", "sentiment": "negative"}, {"name": "invalid email  sunderland", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "tynesiders", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nSunderland's Nissan factory will close after Britain leaves the European Union , according to a pro-European campaigner. \nThat’s the view of David Hardman, from North East for Europe, who was today urging the public to support calls for a public vote on the final Brexit deal. \nActivists took to the streets of Newcastle this afternoon as part of a joint day of action by grass roots groups, who are fighting to give the people more say in if and how we leave Europe. \nCampaigners were at Grey’s Monument chatting to Tynesiders this afternoon. \nMr Hardman said many people he had spoken to did not really understand what Brexit would mean for them, or what they actually voted for in the 2016 referendum. \nAnd he believes a vote on the deal would give the public another chance to reject Brexit now they know more facts. Pro-European campaigners gather at Monument, central Newcastle to drum up support (Image: Newcastle Chronicle) \nHe said: “There’s no doubt Nissan will close, because 70% of their sales are in the European market. A lot of the discussions around the referendum was misleading, and so many people are now sitting there saying; ‘I didn’t vote for that’. A lot of people think the debate is over and have become apathetic because they don’t believe either side of the argument.” \nMr Hardman continued: “We are here to campaign for a people’s vote on the final Brexit deal. We are going to have a specific deal, and then people will have some idea of what they are voting for, and whether it is worth it. There should be a vote, which would give Government the opportunity to reject the deal or to go ahead.” \nA spokesman for Nissan Manufacturing UK declined to comment on the claims. \nToday’s events were organised by activists and supporters from Open Britain, the European Movement and Britain for Europe. \nDuring the Brexit referendum, Newcastle voted by around 51% to 49% in favour of remaining in the EU. \nAnd Mr Hardman said the idea had been well-received. Read More A Brexit museum? The North East could become home to it, say campaign organisers \n“We have had no counter demonstrators,” he said. “Most people wanted to chat, and said they were unhappy about what’s happened in this country. We have had the odd person who has come-up to us and said we are undemocratic, but that’s missing the point.” \nAs well as the flagship event in Newcastle, there were around 10 events taking place across the rest of the North East including Sunderland, Durham and Alnwick. \nAnd there will be hundreds of events taking place up and down the UK. \nThousands of activists and supporters took part with 500,000 leaflets handed out, and more than 100 street stalls set up in towns and cities. \nThe Day of Action was followed by the official launch of the ‘People’s Vote’ campaign, on Sunday. \nLast month the cross-party House of Commons Business Committee warned that a ‘no-deal’ Brexit could destroy the car industry and put 7,000 jobs at Sunderland’s Nissan factory at risk. \nMPs said the UK must stick as closely as possible to existing EU rules and institutions “in order to give volume car manufacturing a realistic chance of surviving in this country”. \nCrucially, the inquiry found that keeping access to the EU single market is far more important to car manufacturers in the UK than signing new trade deals with other countries. \nIt follows warnings from the Society of Motor Manufacturers and Traders, which represents the car industry, that failing to agree a free trade agreement with the EU would result in a £4.5bn drop in exports by UK carmakers. Like us on Facebook", "external_links": [], "published": "2018-04-14T20:00:00.000+03:00", "crawled": "2018-04-14T22:12:21.030+03:00", "highlightTitle": ""}