{"organizations": [], "uuid": "bb49439314795f007bcef2447e46268735742078", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1488410.ece/ALTERNATES/s1200/pexels-photo-113885.jpg", "site_section": "http://www.devonlive.com/rss.xml", "section_title": "devonlive - frontpage", "url": "https://www.devonlive.com/news/devon-news/devon-voters-now-want-remain-1488408", "country": "US", "title": "Devon voters now want to Remain in Europe, major new survey reveals", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-04-23T10:06:00.000+03:00", "replies_count": 0, "uuid": "bb49439314795f007bcef2447e46268735742078"}, "author": "Neil Shaw", "url": "https://www.devonlive.com/news/devon-news/devon-voters-now-want-remain-1488408", "ord_in_thread": 0, "title": "Devon voters now want to Remain in Europe, major new survey reveals", "locations": [], "entities": {"persons": [{"name": "devon", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "devon live", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "share neil shaw head of digital", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Devon voters now want to Remain in Europe, major new survey reveals 15 per cent of those who voted Leave have now changed their minds Share Neil Shaw Head of Digital 08:06, 23 APR 2018 Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nMore than half of Devon now wants Britain to stay in the single market, according to a major new survey carried out by Devon Live - and 15 per cent of Leave voters would change their decision in a new referendum. \nThe latest Brexit survey shows 48% of Devon Live readers believe Britain will be better off economically inside Europe and 53% said Britain should continue to be part of the single European market. \nThe survey revealed that seven per cent of those who voted Leave in te referendum now believe we would be better off, economially, staying in Europe and 20 per cent of Leave voters think we should continue to be part of the Single Market. \nRemain voters are, unsurprisingly, much more likely to think continuing close ties with Europe is a good idea, with 84% saying Britain is better off economically inside Europe and 82% saying we should continue to be part of the Single Market. \nThree-fifths of those surveyed on the site (59%) said they were not happy with the status of Brexit negotiations at the moment, with just a fifth (21%) saying they were happy (the rest weren't sure). \nRegardless of how those surveyed voted in the referendum, they were more likely to be unhappy than happy with the way negotiations are going. \nAmong those who said they voted Leave, 42% are unhappy with the status of negotiations compared to 34% who were happy. More than three-quarters of those who voted Remain (74%) said they were unhappy, compared to 9% who said they were happy. \nHowever, most of those surveyed said they would still stick with how they voted - 85% of Leave voters and 93% of Remain voters. Leave voters were more likely to say they would not vote in the same way now, with one in 14 Leave voters saying they'd act differently (7%) compared to one in 23 Remain voters (4%). The study, run in partnership with Google Surveys, was completed online by 2000 people who visited the Devon Live website. \nAcross the country the survey was completed by 216,800 people who visited news websites. \nThe major new Brexit survey of almost 220,000 readers of Johnson Press, Newsquest and Trinity Mirror websites shows 52% believe Britain would be better off economically inside Europe. 56% said Britain should continue to be part of the single European market. \nThose living in Scotland were most likely to say Britain would be better off economically inside Europe, at 63%, including 13% of Leave voters. \nThey were also the most likely to say that Britain should stay in the Single Market, at 66%, followed by those in Northern Ireland, 60%, including 26% and 24% of Leave voters respectively. \nThose in the North East, Yorkshire and the Humber and the East Midlands were the most likely to say Britain will be better off outside, at 40% each, with those in Yorkshire and the Humber and in the East Midlands the most likely to say Britain shouldn't be part of the Single Market, at 31%. Like us on Facebook ", "external_links": [], "published": "2018-04-23T10:06:00.000+03:00", "crawled": "2018-04-23T10:44:35.019+03:00", "highlightTitle": ""}