{"organizations": [], "uuid": "75834e83128d6b3d826fd5306830e16c866469ef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article1408113.ece/ALTERNATES/s1200/Fools.jpg", "site_section": "", "section_title": "", "url": "https://www.devonlive.com/news/devon-news/best-april-fools-day-pranks-1407942", "country": "US", "title": "The best April Fool's Day pranks: From the first ever meme discovery to Liam Gallagher appearing on Strictly - Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "", "spam_score": 0.021, "site_type": "news", "published": "2018-04-01T18:39:00.000+03:00", "replies_count": 0, "uuid": "75834e83128d6b3d826fd5306830e16c866469ef"}, "author": "Joel Cooper", "url": "https://www.devonlive.com/news/devon-news/best-april-fools-day-pranks-1407942", "ord_in_thread": 0, "title": "The best April Fool's Day pranks: From the first ever meme discovery to Liam Gallagher appearing on Strictly - Devon Live", "locations": [], "entities": {"persons": [{"name": "liam gallagher", "sentiment": "none"}, {"name": "harry", "sentiment": "none"}, {"name": "lynton", "sentiment": "none"}], "locations": [{"name": "wales", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}], "organizations": [{"name": "lynmouth cliff railway", "sentiment": "none"}, {"name": "oxford blue", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now   Thank you for subscribing!   \nPractical jokers and hoaxers have been enjoying the one day of the year when they can legitimately run wild and have some fun. \nAmong the amusing April Fool's Day pranks and tongue-in-cheek news stories are fast food giant Burger King claiming to have created a Chocolate Whopper and a report that Prince Harry's stag do will be held in a spiritual yurt retreat in Wales. \nThere were also some cracking local efforts - including a world first continuous circular wavepool for Devon surfers, and a new colour scheme for one of the region's best loved attractions. \nHere's our pick of some of the best April Fool's pranks played today: Cliff Railway gets a lick of paint \nThe Facebook page of the historic Lynton and Lynmouth Cliff Railway this morning claimed the famous green carriages were being painted Oxford Blue to celebrate their 130th anniversary. \nThe post said: \"In 1888, historical records confirm that the cliff railway was originally Oxford Blue and not the traditional Buckingham Green that we have become used to seeing. \n\"Whilst the cliff railway was extensively photographed in its early years, black and white film could never document the original colour.\" Devon gets the world's first circular wavepool \nThe Museum of British Surfing based in Braunton excitedly announced their newest plans this morning. \nFollowing major sponsorship and funding success, the team revealed they had been granted planning permission for the first Continuous Circular Wave Pool. \nThe post claimed it would be the first man-made pool capable of sustaining a 1ft to 6ft wave for indefinite periods and will be able to produce a barrelling wave that will peel without end. \nCall me crazy, but this actually looks like a good idea to me! Burger King launches 'Chocolate Whopper'... maybe \nFast food giant Burger King got in there early with a claim that it was launching a ‘Chocolate Whopper’. \nAccording to an advert posted on Twitter, the meal will boast a chocolate cake bun, a ‘flame-grilled chocolate patty’, and will use raspberry syrup instead of ketchup. \nCandied blood oranges replace tomatoes and there will be chocolate rings according to the tongue-in-cheek video. \nBurger King’s tweet read: “the NEW chocolate Whopper. coming soon to your local Burger King. maybe.” Prince Harry to spend his stag do at a 'spiritual yurt'? \nPrince Harry has snubbed a conventional stag do in favour of a weekend at a spiritual yurt retreat in West Wales, according to one April Fool’s report. \nThe Mail on Sunday claimed his bride-to-be, Meghan Markle, has put her foot down and demanded there are no drunken shenanigans. \nA ‘friend’ said: “Meghan wants Harry to spend the weekend getting grounded, not inebriated. \n“She thinks a weekend of meditation and chakra-cleansing in Wales will fit the bill perfectly.” Prince Harry and Meghan Markle pictured together in September (Image: PA) Avocado flavour Coca-Cola will get the 'likes' rolling in \nCoca-Cola is doing its bit to help people find Instagram fame - by launching three new flavours for the ‘Instagram generation’, it is reported. \nThe company said it was targeting the ‘brunch-loving, superfood-snacking millenial’ with its avocado, sourdough and charcoal flavours. \nIn a statement to the Sunday Mirror, it said: “Not only do they promise to be the perfect tasty, sugar-free refreshment, but they’ll also double-up as the ideal accessory for any brunch time social media photo – guaranteed to see the ‘likes’ rolling in.” Coca-Cola says its new flavours will get the 'likes' rolling in A combination of wood and fire... \nTheme park Alton Towers has got in on the fun, claiming diners in its restaurant will be served dishes in wooden bowls which are on fire. \nThe tourist attraction posted on Twitter: “HOT NEWS! To celebrate the launch of Wicker Man, our wooden rollercoaster that combines wood and fire, we will soon be serving some of our dishes in wooden bowls that will be ON FIRE in our Rollercoaster Restaurant! More coming soon....” \nOne person responded “what could possibly go wrong?”, before it was pointed out to him that it is April Fool’s Day. Spinning on planes? \nTycoon Richard Branson has had fun on April Fool’s Day by claiming that spin classes will soon be available on flights Down Under. \nBranson posted a video on Twitter claiming that the service would be on offer on Virgin Australia planes. \nHe wrote: “It’s great when two Virgin companies work together to come up with a really great idea. Well done to everyone at @ VirginAustralia and @ VirginActiveOz for introducing the world’s first in flight spin class. Will be touring Australia later this year and can’t wait to join one” Mandarin orange drinks launched in honour of Trump \nEnergy drink giant Carabao claims to have launched a new Mandarin Orange flavour in honour of US President Donald Trump. \nIt claims to be making energy drinks great again. \nThe company’s head of design, Tom Prunddal said: “We’ve been looking at new ways to make our products stand out, so we started looking further afield for inspiration. I saw a picture of Donald Trump in the paper and the light bulb moment of brightness struck! We were looking for something between carrot and goldfish and the President’s face was the answer.” Making energy drinks great again? 'The London Aye' to attract Scots \nThe London Eye is set to be renamed ‘The London Aye’ in order to attract more visitors from Scotland, apparently. \nThe move, in light of financial uncertainty and Brexit, will be accompanied by a marketing campaign in Edinburgh, Glasgow and Aberdeen. \nHead of Operations Neil Dolan said: “We’re always looking for new and innovative ways to ensure our guests feel an affinity with the London Eye, so what better way to attract the Scots than re-naming the famous attraction in their honour. \n“As a Scot myself, we’re passionate about our heritage and I’ve no doubt this will have a huge impact, attracting Scottish guests and driving ticket sales.” (Image: PA) Liam Gallagher set to be a Strictly Come Dancing contestant? \nThat’s according to HeatWorld , which quotes the former Oasis frontman saying: “I’ve kept it secret for all these years, but I live to dance. When I’m not dancing, I’m not breathing. And Strictly Come Dancing will finally allow me to show the world, do you know what I mean?” \nAccording to the tongue-in-cheek report, the singer will be a contestant in the next series, and a BBC spokesman described him as a ‘national treasure’. Liam Gallagher In case there’s any confusion, HeatWorld does confirm at the bottom of the report that it’s a hoax. 'World's first ever meme' discovered at the Royal Albert Hall \nBosses at the Royal Albert Hall claim to have found the first ever meme during excavation works - alongside an item no longer appropriate for public display. \nThe historic London music venue revealed this morning that a trunk of ‘priceless’ Victorian artefacts had been discovered during building work. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nUncovered in the box were a penny, an empty jar of Bovril, a plate, an item no longer appropriate for public display, a wooden sailor and an illustration of two contemporary gentleman, overprinted with the word ‘WHENCE?’ – which has been verified by the British Library as the world’s first ever meme. European Parliament having a giggle about dark blue passports \nOfficials at the European Parliament have been having a giggle at the UK’s expense today. \nThe UK office tweeted a fake news story claiming that EU passports are set to become dark blue - a not-so-subtle dig at the UK’s new passports. \nIt posted an image of a dark blue passport alongside the words: “BREAKING: All EU passports to become dark blue” Like us on Facebook", "external_links": [], "published": "2018-04-01T18:39:00.000+03:00", "crawled": "2018-04-01T18:55:06.023+03:00", "highlightTitle": ""}