{"organizations": [], "uuid": "372da499c347cb4f18707d4478882a117314352f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article1476545.ece/ALTERNATES/s1200/601866.jpg", "site_section": "http://www.leicestermercury.co.uk/rss.xml", "section_title": "leicestermercury - frontpage", "url": "https://www.leicestermercury.co.uk/news/business/contracts-being-lost-due-poor-1480705", "country": "GB", "domain_rank": 48128, "title": "Contracts \"being lost\" due to poor investment in Leicestershire railways, roads and digital", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-04-20T12:56:00.000+03:00", "replies_count": 0, "uuid": "372da499c347cb4f18707d4478882a117314352f"}, "author": "Tom Pegden", "url": "https://www.leicestermercury.co.uk/news/business/contracts-being-lost-due-poor-1480705", "ord_in_thread": 0, "title": "Contracts \"being lost\" due to poor investment in Leicestershire railways, roads and digital", "locations": [], "entities": {"persons": [{"name": "scott knowles", "sentiment": "none"}], "locations": [{"name": "leicestershire", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "dodwells", "sentiment": "none"}, {"name": "east midlands", "sentiment": "none"}], "organizations": [{"name": "midlands chamber", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Contracts \"being lost\" due to poor investment in Leicestershire railways, roads and digital East Midlands Chamber says tenth of firms thought about moving to beat congestion and one in two have lost business Share The congested A5 near Dodwells island in Hinckley Share Get Business updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nBusinesses are losing money due to poor investment in the regions railways and roads. \nResearch by East Midlands Chamber suggested a tenth of firms have considered moving to beat congestion and almost one in two said they’d lost at least one business opportunity due to the delays. \nThe chamber carried out the survey after Government figures suggested infrastructure investment in the East Midlands was only 60 per cent of the average per capita for the rest of the UK. The chamber is lobbying for an equal share by 2020. \nChamber chief executive Scott Knowles said the problems extend beyond road and rail, to include the region’s digital infrastructure. \nMobile and online technologies are nowadays considered crucial but one-in-ten survey respondents said they’d suffered mobile phone outages and a third had had broadband issues. \nMr Knowles said: “This original research confirms what we’ve said all along – that our businesses are very good at making things and selling what they make around the world, but they do it despite Government investment in this region, not because of it. Scott Knowles, chief executive of East Midlands Chamber \n“We’ve been seeking to respond to Government challenges and increase our activity in this region, but it hasn’t been matched by investment in infrastructure and now we’re seeing the results of constant under-investment – for example, over seven-in-ten of our members believe the roads network is less reliable today than it was five years ago. \n“The East Midlands needs a fair share of national infrastructure investment.\" \nOnly this week Theresa May was urged to release £10million to kickstart proposals to upgrade the congested A5 near Hinckley. \nBosworth MP David Tredinnick raised the issue in parliament in a bid to try to speed up plans to convert single carriageway stretches of the busy road into dual carriageway. \nHe told the Prime Minister some 50,000 homes were planned along the A5 corridor between its M1 junction and where the road road runs through Staffordshire. \nSome 2,000 acres along the A5 is also set to be developed as business and industrial land. More congestion ahead? (Image: Getty) \nMr Knowles said: “The region needs roads that recognise its importance as the link between north and south and between east and west. It needs a rail network fit for the 21st Century and beyond. \n“It needs improved transport links with East Midlands Airport and better use made of the capacity at the airport for longer haul flights to complement its status as the country’s biggest pure freight airport. \n“Companies in the East Midlands are among some of the most pioneering in the world, particularly in advanced technologies, but they are being held back by the lack of investment, which is something Government needs to address today if we are to continue to be successful in tomorrow’s post-Brexit world. Read More \n“The risk of getting this wrong is stark and, in a worst case scenario, businesses may feel forced to vote with their feet. Read More \n“We call on all our elected representatives, regionally and in Westminster, to do all they can to ensure this doesn’t happen.” Like us on Facebook ", "external_links": [], "published": "2018-04-20T12:56:00.000+03:00", "crawled": "2018-04-20T13:12:38.041+03:00", "highlightTitle": ""}