{"organizations": [], "uuid": "8a5c7ed3465c0d75ca9769aea932c2d60c439782", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14506320.ece/ALTERNATES/s1200/Fishing-For-Leave-Stage-Brexit-Protest.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/fishermen-north-east-staged-mass-14506217", "country": "GB", "domain_rank": 21960, "title": "Why fishermen from the North East staged a mass protest on the River Tyne", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-04-08T18:54:00.000+03:00", "replies_count": 0, "uuid": "8a5c7ed3465c0d75ca9769aea932c2d60c439782"}, "author": "Mike Kelly", "url": "https://www.chroniclelive.co.uk/news/north-east-news/fishermen-north-east-staged-mass-14506217", "ord_in_thread": 0, "title": "Why fishermen from the North East staged a mass protest on the River Tyne", "locations": [], "entities": {"persons": [{"name": "tyne fishermen", "sentiment": "negative"}, {"name": "tyne", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "milford haven", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "north shields", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "whitstable", "sentiment": "none"}, {"name": "hastings", "sentiment": "none"}, {"name": "portsmouth", "sentiment": "none"}], "organizations": [{"name": "newcastle quayside", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Why fishermen from the North East staged a mass protest on the River Tyne Fishermen took part in a day of protests against what they say is an 'abject betrayal' over Brexit Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nA flotilla of vessels sailed down the River Tyne as part of a protest at six UK ports against what has been described as the “betrayal” of the UK fishing industry in Brexit talks. \nThey mustered at around 9.30am in North Shields on Sunday and made their way to Newcastle Quayside . \nFrom there they set off under the Gateshead Millennium Bridge and back towards North Shields where they dispersed around 3pm. \nIt was organised by the Fishing for Leave group and other protests took place simultaneously in Whitstable, Hastings, Portsmouth, Milford Haven and Plymouth with around 200 boats taking part. \nThe fishing industry is furious that as part of the transition deal which comes into effect on March 29 next year after Brexit, EU boats will still be able to fish in UK waters until 2021. Read More How Brexit has turned the life of these two North East MEPs upside down \nIt views this as the worst case scenario for them as it effectively means the UK remaining part of the EU’s Common Fisheries Policy (CFP) which the industry hates and without a direct say in its rules. \nAnd they point to the fact in March, environment secretary Michael Gove told the fishing industry the UK would effectively become an independent coastal state after Brexit. Fishing boats head downriver on the River Tyne (Image: Getty Images Europe) \nFishing for Leave spokesman Alan Hastings said: “Fishermen are sickened and enraged that our Government has capitulated to obeying all EU law after Brexit.” \nThe group described the transition agreement as a “death sentence for what’s left of the British fishing industry”. \nIt said the EU will be free to enforce and impose detrimental rules on us to cull what’s left of the UK fleet. Read More At last the truth: Brexit will devastate North East economy, leaked Government paper shows \nIt would allow the EU to use international law, UNCLOS Article 62.2, which says if a nation no longer has the capacity to catch its own resources it must give the surplus to its neighbours. \nThe EU would be free to easily eradicate what is left of our fleet and has every incentive to do so, it says. Flares are fired from the deck of a fishing boat (Image: Getty Images Europe) \nOn its website the group said: “The vote to leave was a godsend to our struggling industry and communities. \n“It provided a golden opportunity to automatically repatriate all our waters and resources, worth £6-8 billion, and to start new policy to rejuvenate our coastal communities and industry.” A retired fisherman mends fishing nets as fishing boats gather on the River Tyne (Image: Getty Images Europe) \nHowever now the fishing industry faces being “trapped in the disastrous CFP until January 2021, and possibly trapped forever in exchange for a deal trade”. \nThe Department for Environment, Food and Rural Affairs said it had negotiated that the UK’s share of catch could not be reduced over the transition period, which was about “delivering a smooth and orderly Brexit”. Read More Plenty more fish in the sea? Why your fish supper might be set to change forever \n“It is now important we focus on the significant prize at the end of the implementation period: the arrangements will only apply to negotiations in 2019 - by December 2020 we will be negotiating fishing opportunities as an independent coastal state completely outside the Common Fisheries Policy,” said Defra. \n“This means that for the first time in over 40 years, we will be able to decide who can access our waters and on what terms.” Like us on Facebook", "external_links": [], "published": "2018-04-08T18:54:00.000+03:00", "crawled": "2018-04-09T00:21:42.039+03:00", "highlightTitle": ""}