{"organizations": [], "uuid": "d9544b438e2ebbbb62b282665ce9d9cd8ad05c5b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14503775.ece/ALTERNATES/s1200/Labour-MEP-Newcastle.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/how-brexit-turned-life-two-14502002", "country": "GB", "domain_rank": 21960, "title": "How Brexit has turned the life of these two North East MEPs upside down", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-04-08T07:00:00.000+03:00", "replies_count": 0, "uuid": "d9544b438e2ebbbb62b282665ce9d9cd8ad05c5b"}, "author": "Sean Seddon", "url": "https://www.chroniclelive.co.uk/news/north-east-news/how-brexit-turned-life-two-14502002", "ord_in_thread": 0, "title": "How Brexit has turned the life of these two North East MEPs upside down", "locations": [], "entities": {"persons": [{"name": "jude kirton-da", "sentiment": "neutral"}, {"name": "brexit", "sentiment": "neutral"}, {"name": "paul brannen", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "news how brexit", "sentiment": "neutral"}, {"name": "labour", "sentiment": "neutral"}, {"name": "european parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News How Brexit has turned the life of these two North East MEPs upside down Labour's Jude Kirton-Darling reveals her child is not entitled to British citizenship and Paul Brannen opens up on mayoral run Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nIn all this talk of Brexit, there’s one particular group we haven’t heard all that much from: members of the European Parliament. \nDespite having a front row seat on history, the public debate has been dominated by big domestic political beasts rather those who’ve spent years working at the heart of the system. \nBehind the headlines is a group of people whose careers have been prematurely terminated; their lives turned upside down. \nFor Labour’s two North East MEPs , the months since the Brexit vote have been typified by professional stress and personal turmoil. \nPaul Brannen, 54, was first elected in 2014 and says he’s part of a group of British MEPs who’ve only really just got going. \nHe said: “A year from now we’ll cease to exist as a political species. \n“For those of us in our first terms, we’ve been through a steep learning curve but now I feel like I’ve got to grips with how it all works and how to get things done for the North East. \n“You spend all this time building up contacts and identifying who the best people to talk to make things happen are and then it all comes crashing to an end.” North East Labour MEPs Jude Kirton-Darling and Paul Brannen (Image: Newcastle Chronicle) \nNot only that, the battle to get things done is already harder than it should be as, according to Paul, the shock and sadness from European colleagues in the immediate wake of the vote has made way for tension and vying over national interests that is harming working relationships. \nFor Jude Kirton-Darling, 40, who was also first elected in 2014 but had worked in Europe for several years before, the whole affair is far more personal. \nEuropean politics is in her blood - Jude’s parents launched a campaign against the Thatcher Government’s plans to build waste incinerators near their home in Teesside. Read More The Software Centre is STILL losing money - despite pledge it would boost Wearside \nThey weren’t political activists but managed to take the case to the very highest level of the EU and secure a landmark ruling blocking the development and which still defines European environmental policy today. \nWhen you throw in a Belgian husband, a 15-month-old child who isn’t automatically entitled to British citizenship and a living routine spread over two countries, then Brexit stops seeming like a geopolitical event and more like a domestic crisis. \nShe said: “I’m one of the thousands of British people who fell in love with someone with a different nationality and now I’m having to deal with the consequences of the vote. \n“This whole thing directly impacts on my family so it feels very, very personal for me. \n“When I worked for trade unions I learned the biggest cause of back problems is workplace stress. \n“I recently had to have an operation on mine so I’ve been telling people Brexit literally broke my back.” Former UKIP leader Nigel Farage (Image: PA) \nJude was born in Dar es Salaam, Tanzania, during a two-year period when her father took a job overseas to avoid being caught up in the brutal decline of Teesside’s industrial sector. \nShe now finds herself in a Kafkaesque web of nationality technicalities she wasn’t aware even existed until recently. \n“Apparently my status is British by descent and because my son was born in Belgium that means he isn’t automatically entitled to British citizenship,” said Jude. Read More Go behind the scenes of the Tyne Pedestrian and Cyclist Tunnel as it undergoes renovation \n“So I would need to find a job with a big enough salary to move my family back here and then apply for citizenship for him. \n“I had a really big cry when this all became clear - I’ve always been proud to be British but didn’t realise how much it mattered to me until my son was being denied it. \n“My day job is working thorough the details of this, especially around trade, and then I get home and it’s still all I can think about. \n“I’m not exaggerating when I say people like me who are caught up in this wake up at four o’clock in the morning thinking about it.” Brexit", "external_links": [], "published": "2018-04-08T07:00:00.000+03:00", "crawled": "2018-04-08T09:26:12.003+03:00", "highlightTitle": ""}