{"organizations": [], "uuid": "f3dfceffdda6ebb727df0b0a7d84fd36a166a817", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14515938.ece/ALTERNATES/s1200/John-McCabe.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-exports-grow-fastest-14514941", "country": "GB", "domain_rank": 21960, "title": "North East exports grow at fastest level in more than a decade", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-04-11T02:01:00.000+03:00", "replies_count": 0, "uuid": "f3dfceffdda6ebb727df0b0a7d84fd36a166a817"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-exports-grow-fastest-14514941", "ord_in_thread": 0, "title": "North East exports grow at fastest level in more than a decade", "locations": [], "entities": {"persons": [{"name": "john mccabe", "sentiment": "none"}], "locations": [{"name": "north east england", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}], "organizations": [{"name": "invalid email  north east", "sentiment": "none"}, {"name": "north east england chamber of commerce", "sentiment": "none"}, {"name": "commerce", "sentiment": "none"}, {"name": "share north east england chamber of commerce", "sentiment": "none"}, {"name": "chamber’s quarterly economic survey", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "North East exports grow at fastest level in more than a decade Survey by North East England Chamber of Commerce shows big rise in overseas trade Share North East England Chamber of Commerce president John McCabe (Image: Unknown) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nNorth East businesses have grown their export sales at the fastest rate in more than 11 years, according to the North East England Chamber of Commerce. \nThe figures have been published as part of the Chamber’s Quarterly Economic Survey, which showed a slight increase in overall growth compared to the end of 2017. \nA major contributor to this was export sales growth reaching its highest level since the end of 2006. \nChamber president John McCabe said: “The overall data from the first quarter of 2018 confirms continuation of the positive trend we’ve seen since the end of 2016. Read More Seven of Europe's fastest growing businesses are now from the North East \n“It is worth noting that the rate of growth has slowed slightly, perhaps reflecting wider economic trends. However, with survey indicators pointing to the highest growth levels for nearly three years, we can say with confidence that business looks good in the North East. \n“Individual responses to this survey suggest many businesses are apprehensive about Brexit and what it will mean for future investment and growth. Given the contribution made by export sales growth to this quarter’s results, this comes as little surprise.” \nThe survey takes a selection of North East companies and asks whether they have experienced an increase or decrease in UK sales, exports, and training investment. The result of each question is given a numerical score with a positive figure showing growth and a minus figure showing contraction. Read More Is your company the Best Place to Work in the North East? \nOn the whole, North East businesses said exports sales had increased over the last three months, with the index receiving a score of 21.3. The figure was up 6.5 compared with last quarter. \nIn comparison UK sales also grew, with the survey producing a score of 21.0. However, the figure fell by 0.4 compared with last quarter. \nJonathan Walker, head of policy and campaigns said: “Businesses have continued to invest in both plant and training during the first quarter, with little change compared to the end of last year. \n“However, we have seen some declines in scores for current and future workforce. This may reflect businesses being more hesitant to recruit but could also be a product of a tightening labour market and skills shortages.” Like us on Facebook", "external_links": [], "published": "2018-04-11T02:01:00.000+03:00", "crawled": "2018-04-11T09:39:34.012+03:00", "highlightTitle": ""}