{"organizations": [], "uuid": "6eb568f60aa91f3a5590cfa44b720e1a7b40350d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article378172.ece/ALTERNATES/s1200/1951975.jpg", "site_section": "http://www.leicestermercury.co.uk/rss.xml", "section_title": "leicestermercury - frontpage", "url": "https://www.leicestermercury.co.uk/news/business/hit-squad-help-businesses-deal-1439128", "country": "GB", "domain_rank": 48128, "title": "Expert team will help businesses deal with Brexit", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-04-10T14:42:00.000+03:00", "replies_count": 0, "uuid": "6eb568f60aa91f3a5590cfa44b720e1a7b40350d"}, "author": "Tom Pegden", "url": "https://www.leicestermercury.co.uk/news/business/hit-squad-help-businesses-deal-1439128", "ord_in_thread": 0, "title": "Expert team will help businesses deal with Brexit", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "none"}, {"name": "nik kotecha obe", "sentiment": "none"}], "locations": [{"name": "westminster", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "east midlands chamber", "sentiment": "none"}], "organizations": [{"name": "brexit news expert", "sentiment": "negative"}, {"name": "brexit east midlands chamber", "sentiment": "negative"}, {"name": "brexit advisory group", "sentiment": "none"}, {"name": "morningside pharmaceuticals", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Expert team will help businesses deal with Brexit East Midlands Chamber launches Brexit Advisory Group to deal with the questions and issues in build up to and post-Brexit Share Businesses need to work out how Brexit will affect them Share Get Business updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nA new team has been set up to help businesses navigate their way through Brexit. \nEast Midlands Chamber has launched a Brexit Advisory Group to help the region’s firms deal with the questions and changes in the run up to, and months after, Brexit. \nIt has been set up in collaboration with audit, tax and consulting firm RSM, and is chaired by Dr Nik Kotecha OBE, chief executive at Loughborough-based medicines supplier Morningside Pharmaceuticals. \nIt is hoped the group will shape and help deliver the chamber’s wider Brexit influence and support programme, including lobbying activities. \nIt will lead MPs briefings regionally and at Westminster and help to shape the chamber’s 2018 Manifesto on Brexit. \nIt will also provide up-to-date information to businesses through seminars, workshops and the media. \nOne of its first actions has been to create a ‘Brexit checklist’ setting out the main issues firms need to be considering, which is now available for electronic download from the chamber website. Scott Knowles, chief executive of East Midlands Chamber \nChamber chief executive Scott Knowles said: “Whether you voted for it or against it, Brexit is happening. \n“What we need to do today is make sure we can, as far as possible, future-proof against any potentially negative impact of the divorce. \n“The aim of the Brexit Advisory Group is to provide a conduit between business and Westminster so that the creators of jobs and wealth can influence the direction of Government and, at the same time, be accurately informed about at the earliest opportunity about the decisions and agreements being made that will affect them.” \n“Despite there being only a year to go, considerable doubt remains over what the future holds for business, with things to consider ranging from customs arrangements through employing EU nationals to contracts and Intellectual Property rights. \n“In business terms, a year is a very short time in which to go through all the documents, processes and programmes currently in use and revise all those that need it so that trading can continue post-Brexit. \n“The uncertainty is the hardest thing to deal with because you don’t know what outcome you’re aiming for, so you have to plan for the worst case scenario while hoping for the best. Brexit will impact on everyone \n“What we have done with our briefing paper is set out what we see, and what our members tell us, are some of the more critical elements of the Brexit process that companies need to be looking at today to ensure they can continue to trade globally tomorrow.” \nKevin Harris, managing partner of RSM’s office in Grove Park, Enderby, said: “We are pleased to be working with the chamber to provide businesses with a voice in Westminster and the facts they need to make informed choices for a successful withdrawal from the EU and post-Brexit success. Read More \n“We’ll get only one shot at a successful Brexit so it’s important that we get right first time.” Read More Leicestershire dole queues are getting longer \nScott Knowles said: “The briefing paper is not a definitive list but it is a guide to what businesses need to be considering today. \n“There will be updates as we get closer and closer to Brexit day, but the message we need to get out there is that businesses can’t sit back and wait to see what happens, they have to seize the initiative and plan for all eventualities if they are to succeed post-Brexit.” Like us on Facebook ", "external_links": [], "published": "2018-04-10T14:42:00.000+03:00", "crawled": "2018-04-10T15:28:48.000+03:00", "highlightTitle": ""}