{"organizations": [], "uuid": "cd4aa150533bf42ac1c6ba0c1cf62832de1a395c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14294275.ece/ALTERNATES/s1200/US_Ship_193518.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14511323", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Strong growth in trade between EU and UK, directors reveal", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-04-10T09:50:00.000+03:00", "replies_count": 0, "uuid": "cd4aa150533bf42ac1c6ba0c1cf62832de1a395c"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14511323", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Strong growth in trade between EU and UK, directors reveal", "locations": [], "entities": {"persons": [{"name": "steve mcnicol", "sentiment": "negative"}, {"name": "ward hadaway", "sentiment": "negative"}, {"name": "mcnicol", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "hexham", "sentiment": "none"}], "organizations": [{"name": "ward hadaway", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KEY EVENT Ward Hadaway poaches former Muckle managing partner Steve McNicol \nLaw firm Ward Hadaway has poached former Muckle managing partner Steve McNicol , who has joined the firm as its strategic business development partner. \nIn his new role at Ward Hadaway Mr McNicol will work to build on the firm’s existing relationships, create new opportunities, develop the business’s profile, and work to improve client service. \nMr McNicol, from Hexham, Northumberland, said: “The opportunity to lead Ward Hadaway’s business development strategy and to work alongside the team here is very exciting indeed. \n“There is an overwhelming feeling of ambition and enthusiasm across the business that has been evident from the very start of our discussions. \n“The firm already has a superb reputation and the very fact that the partners are exploring different ways to build on that is really compelling. \n“Technical excellence and strength in depth, whilst clearly critical, can no longer stand alone as true differentiators in professional services. \n“The ability to listen, adapt and deliver what the client really wants is crucial – and developing relationships in that way is something that the team already has a strong name for.” \nMr McNicol led Newcastle commercial law firm Muckle for nearly 11 years between 2004 and 2015, during which he helped grow the business’s turnover to £11.7m. (L-R) Steve McNicol and Ward Hadaway managing partner Jamie Martin (Image: Ward Hadaway) 9.40 Coreena Ford Government urged to protect intellectual property rights after Brexit \nA group of the UK’s leading publishing houses have joined together for the first time to urge the Government to protect intellectual property rights after Brexit. \nFailure to defend such rights will damage the publishing sector in the UK, which supports more than 70,0000 jobs, according to The Publishers Association, which has devised a Brexit Blueprint to continue to support the industry after the departure from the EU. \nThe list of demands on the Government includes a commitment to free speech and freedom to publish, as well as ensuring access to global talent, promoting digital services and ensuring fair online marketplaces. \nPublishing is one of the UK’s most successful export sectors, with British publishers exporting more physical books than any other country. \nThe association has expressed concern some rights could be eroded or traded away to secure new free-trade agreements (FTAs). Pile of books Coreena Ford William Cook praises Stanhope defence arm after parent firms makes £3.7m loss \nThe owners of major North East defence manufacturer William Cook have hailed the County Durham firm’s performance , despite the group as a whole falling into the red. \nA sterling performance in 2013 in which William Cook Holdings made profits of £10m on £80m turnover could not prepare the group for the industry’s collapse a year later. \nIn accounts filed for the year ending July 2017, company chairman Sir Andrew Cook said the business has continued to feel the effects of what he describes as the greatest “market collapse” he had ever experienced, but that the firm is now bouncing back. William Cook Holdings Limited made an operating loss of £3.7m for the year ending July 2017, down from last year’s operating profit of £3.4m, after its turnover fell by £10m to £41.1m, but Sir Andrew praised the work carried out by the group’s County Durham defence business. \nSir Andrew said that, despite the market collapse, the group’s two North East arms – Cook Defence Systems and William Cook Stanhope – had largely remained profitable over the years. The William Cook factory in Stanhope, County Durham (Image: PAUL NORRIS) 8.50 Coreena Ford Applied Graphene Materials sees commercial momentum \nApplied Graphene Materials, manufacturer of the wonder material graphene, says it is gaining commercial momentum through a series of collaborations. \nThe Redcar company is now working with the likes of HMG Paints, James Briggs Ltd and Magna Interiors to bring products containing graphene to the market. \nCash at bank at the end of January 31 2018 reached £12m, up from £5.6m, and during the six months the firm completed a placing and open offer raising £9.77m of funds for the business. \nJon Mabbitt, Chief Executive Officer, said: \nIn recent months we have seen increased commercial momentum in our core markets with a number of key collaborations now reaching the final stages of approval. In particular for coatings, the combination of our technical expertise, extensive data generation and the launch of standardised customer ready dispersions under the Genable® brand earlier in the year are supporting potential commercial adopters to accelerate their product testing and qualification processes. \nWithin the composites sector, significant interest is being shown in Structural Ink® and during the current year we expect to accelerate the technology’s commercial programme. Opportunities within the sector vary immensely, both in application and quantum, but ultimately the automotive and aerospace industries offer the greatest long-term potential. As such, the progress made with Magna Exteriors and with Airbus Space and Defence is particularly encouraging. \nElsewhere, long-term engagements within the functional materials sector are beginning to reach the point of commercialisation and nowhere is this more evident than the collaboration work we have completed with Puraglobe, as they look to launch a graphene enhanced product to their key customers. \nWith solid foundations in place and well-established collaborations ongoing, the Board remains confident that we have the right strategy in place for the long-term success of the business. Whilst the majority of our collaborations have yet to materialise into top line returns, given the progress that is now being made on many fronts in our key target sectors, we are confident that these will soon deliver real growth. CEO of Applied Graphene Materials plc 8.44 Coreena Ford Ramsdens Holdings 'trading strongly' \nPawnbroker Ramsdens Holdings PLC, which now has a range of financial and retail services, has issued a trading update ahead of its full year results. \nThe short statement, ahead of unveiling results for the year ended 31 March 2018 on June 7, said: “The Board is pleased to announce that Group trading in the second half of the year has remained strong and, as a result, it anticipates reporting results for the year slightly ahead of expectations.” Ramsdens chief executive Peter Kenyon (Image: Publicity Pic) 8.38 Coreena Ford Waitrose to phase out takeaway coffee cups in stores \nWaitrose has announced plans to remove all disposable coffee cups from its shops by this autumn, as part of efforts to reduce plastics and packaging. Members of the myWaitrose loyalty scheme will still be able to get free tea or coffee from self-service machines as a reward for shopping at the supermarket, but will be asked to use a reusable “keep cup”, the company said. \nThe removal of disposable cups will initially take place in nine stores from April 30, as a trial for managing the changeover, before the scheme is rolled out nationwide in a phased programme by the autumn. \nWaitrose said the move, which comes as the Government is considering a “latte levy” which would bring in a charge on disposable coffee cups, would save more than 52 million cups a year. \nAccording to the parliamentary Environmental Audit Committee, the UK throws away 2.5 billion disposable coffee cups a year, almost none of which are recycled, with the cups hard to recycle due to their plastic lining Waitrose is phasing out takeaway coffee cups (Image: PA) 8.30 Coreena Ford More cyber attacks against firms than ever, investigators say \nBritish businesses are suffering more cyber attacks than ever before and the strikes are growing more aggressive, investigators have warned. \nCriminals have access to “nation-state grade capabilities” to cause chaos on a global scale, including crippling websites and stealing swathes of personal information, Oliver Gower, deputy director for cybercrime at the National Crime Agency (NCA) said. \nCybercrime is classed as a tier one threat, alongside terrorism, war and natural disasters, because it is a vital part of the national infrastructure. \nA joint report by the NCA and the National Cyber Security Centre, which is part of GCHQ, published today, urges business to take steps to protect themselves and report cyber attacks when they occur. \nMr Gower said: \nWe are seeing more cyber attacks on UK businesses than ever before. \nWe’re seeing these across a whole range of victims from large multinational companies to sole traders and small and medium sized businesses. Overall, the threat is becoming more severe. \nWe are seeing more aggressive and confrontational attacks, we are seeing nation-state grade capabilities twinned with criminal code to wreak havoc across global systems. Internet security software performing an anti-virus and anti-spyware scan (Image: Yui Mok/PA Wire) 8.25 Coreena Ford Four generations of one North East family are brewing up a brilliant tea business \nFour generations of tea lovers from one family are brewing up heady plans for a new business after securing a £25,000 business loan. \nLiza Johnson, 38, has launched The Tea Enthusiasts, a business selling a curated selection of teas from across the globe to customers in the UK, after receiving the loan from Virgin StartUp, as well as assistance from the North Tyneside Business Factory. \nThe Tea Enthusiasts currently sells a range of loose leaf teas and accessories through an online platform that aims to service a range of domestic and trade customers. \nThe company started trading only in January and has quickly become a family affair, with Mrs Johnson’s mother, daughter, son and grandmother all pitching in alongside a newly appointed 17-year-old apprentice training as part of the warehouse and quality control team. Liza Johnson from tea enthusiasts and Janice Ross, business advisor at North Tyneside Business Factory (Image: Ian McClelland) 8.20 Coreena Ford Recruitment firm Robert Walters boosted by robust jobs market \nRobert Walters has bolstered profits as Britain’s jobs market remained robust in the face of Brexit uncertainty. \nThe recruitment firm recorded a 17% rise in net fee income - gross profit - to £88.5m in the first quarter of this year. \nThe UK lifted 6% to £25.2m over the period, thanks to standout performances from Manchester, Milton Keynes and St Albans. \nChief executive Robert Walters said: “The group delivered a strong performance in the first quarter with net fee income increasing 17% year-on-year and growing across all regions. \n“Current trading is in line with market expectations.” The jobs market is robust 8.15 Coreena Ford Card Factory profits hit by soaring costs \nRetailer Card Factory has seen annual profits tumble after taking a £14.6m hit from the weak pound and soaring wage costs. \nThe group - which specialises in greeting cards, wrappings and gifts - reported a 12.3% fall in pre-tax profits to £72.6m for the year to January 31 after its profit margins were hammered by rising costs as the Brexit-hit pound and national living wage took their toll. \nIt confirmed that earnings growth in the new financial year will also be “limited” amid ongoing cost pressures, despite efforts to offset this with savings across the business. \nCard Factory saw shares tumble in January after it warned over the impact of a margin squeeze on its profits. \nBut in its full-year results, the firm cheered a solid performance across its 915 UK stores in the face of “tough” trading conditions, with group like-for-like sales up 2.9% - a pick-up from 0.6% growth the previous year. \nCard Factory opened 50 stores over the past year, including six trial shops in Ireland. It plans to open further outlets and continue to grow its online arm, which saw sales jump 67% higher over the year. The Card Factory store at Gosforth Shopping Centre (Image: Dalla House Photography) 8.10 Coreena Ford North East now one of the most expensive cities for tech talent in the UK \nTech professionals in the North East are among the highest paid in the country , with salaries soaring by 22% over the last five years. \nIn 2012 IT professionals working in Newcastle and the surrounding region were the lowest paid in the country with a median salary of £33,225. \nBut the rise of the North East’s technology sector has driven up pay so that the average IT professional now earns £40,559. \nAccording to the figures, which were analysed by SJD Accountancy, North East IT workers are now the fourth highest paid in the country, after those in London, the South East, and the East of England. \nThe North East’s 22% pay increase is also far higher than that of London’s, which grew by 8.9% from £45,930 to £50,000. \nDerek Kelly, chief executive officer of SJD Accountancy, said: “The continuing success of the North East over the last five years has made it one of the most expensive regions for tech talent in the entire country. \n“Finding the right tech talent in Newcastle is becoming increasingly difficult, forcing businesses to offer more money and other benefits. (Image: PA) Coreena Ford Iceland to remove palm oil from own brand food \nSupermarket Iceland has pledged to stop using palm oil as an ingredient in its own brand food by the end of 2018, warning that it drives the destruction of rainforests. \nThe company said it is taking the product out of 130 food lines, which will reduce demand by more than 500 tonnes per year, with palm oil already replaced with alternatives such as sunflower oil and butter in half of them. \nGrowing demand for palm oil for use in food, toiletries and biofuel has helped fuel widespread deforestation in south-east Asia, prompting industry efforts to promote “sustainable” palm oil which is not environmentally damaging. \nBut Iceland managing director Richard Walker said the company did not believe there was verifiably sustainable palm oil on the mass market and so was removing it all together. An Iceland frozen food store (Image: AP Photo/Matt Dunham)) 8.00 Coreena Ford 'Beast from the East' puts freeze on high street shopping \nThe Beast from the East kept shoppers away from stores in March as people huddled in the warmth of their homes amid the big freeze, figures show. \nA report from the British Retail Consortium (BRC) and KPMG, covering the final days of February to the end of March, said the period was volatile as the run-up to Easter helped to offset the impact of the “seemingly endless” cold weather on sales. \nIt said UK retail sales increased by 1.4% on a like-for-like basis compared with March 2017, when they had decreased 1% from the preceding year. On a total basis, sales rose 2.3% annually in March, against a decline of 0.2% in March 2017. \nHelen Dickinson, chief executive of the BRC, said: “March paints a volatile picture for sales, which experienced peaks and troughs to deliver some modest growth on last year. \n“There’s no doubt that the Beast from the East and its successor played a significant role in deterring shoppers from making store visits. \n“But it didn’t dampen consumers’ appetites towards food purchases, which saw the anticipated spike from the Easter festivities.” \nPaul Martin, head of retail at KPMG, said: “March was difficult for large parts of the UK retail industry. Seemingly endless cold weather dissuaded would-be shoppers from the high street and a number of retailers delivered bad news.” \nThe report was released as figures from Barclaycard showed that consumer spending growth slowed as temperatures fell in March, increasing by 2% year on year - the lowest level since April 2016. \nIt said spending at garden centres plunged by 26.4% annually - the biggest fall since Barclaycard’s records on this started in September 2014. PA photographer Owen Humphreys said: \"It’s here - The Beast From The East hits Newcastle\" (Image: Owen Humphreys/PA) 7.55 Coreena Ford Unnatural History Museum - destined for historic Gateshead old Town Hall? \nAn Unnatural History Museum could be coming to the region amid plans to transform Gateshead’s Old Town Hall into a major visitor attraction. \nThe historic hall and an adjoining patch of land were put up for sale a year ago together with a call out for developers to come forward and regenerate the Grade II listed property. \nThat call out resulted in a deal between Gateshead Council and an entertainment business called Dinosauria Ltd, driven by Newcastle wealth managers Tier One Capital, who agreed to take on a 250-year lease as part of the council’s strategy to sell off surplus assets, paving the way for the building to be turned into an attraction. \nIt was originally understood that Tier One Capital was driving forward plans for a dinosaur-themed centre – a plan the firm first put out to investors several years ago – but both the wealth managers and Gateshead Council remained tight-lipped over the final plans and it was understood that dinosaurs were no longer set to feature. \nNow, however, documents filed at Companies House appear to have given us big clues as to the building’s future, with three directors from Tier One Capital incorporating a company called The Unnatural History Museum Ltd, hinting that an attraction showcasing all things supernatural could be coming to the North East. Old Town Hall Quarter in Gateshead (Image: Gateshead Council) 7.50 KEY EVENT Strong growth in trade between UK and EU, report reveals \nThe importance of the European Union for UK exporters has been revealed in a new study showing strong growth in trade with the bloc. \nA survey of almost 800 company directors found that the EU has seen stronger growth for UK firms selling goods overseas, than Asia or North America over the past two years. \nThe Institute of Directors (IoD) said its poll found that more than two out of five company bosses found most business growth in the EU, compared with one in five citing North America or Asia. Two thirds of those polled exported goods, up by 7% on 2013. \nAllie Renison of the IoD said: “The immediate focus should be on reaching a successful deal with the EU that puts maintaining market access at the heart of its priorities. Steadying the ship will enable the UK to navigate a clear path to a truly global future. \n“The importance of the EU as a growth market for IoD members combined with the clear advantage that business leaders see in new trade agreements shows just how eager businesses are to embrace global Britain. \n“Our members are already showing the strength of British business on the world stage, but the statistics also show that we need to get real about trade, and fast. “Going global is as much about opportunities in Europe as it is further afield, and this should be reflected in how the Government shapes post-Brexit Britain.” \nA separate study found that three out of four companies are optimistic about their international business prospects. \nA survey of more than 6,000 firms by HSBC showed mixed feeling about the impact of Brexit, with 38% saying it will be negative, while a third predicted it will be positive. \nAmanda Murphy, head of commercial banking for HSBC UK, said: “The combined survey and forecast data we’ve gathered both point towards a really strong near-term outlook for UK exporters and importers. \n“Undeterred by future post-EU uncertainty, businesses clearly aim to capitalise on the cheaper pound and rising demand in key markets to boost their overseas sales.” \nA Department for International Trade spokesman said: “Leaving the European Union will allow the UK to operate as an independent trading nation for the first time in 40 years. “The Government has made clear that it will seek to secure a comprehensive free trade deal with the EU as well as capitalising on the IMF’s prediction that 90% of global growth will come from outside the EU over the coming years. “There is clear evidence that demand for our goods and services is growing across the world. “Exports increased by 12.1% over the last year, with the trade deficit narrowing by £12.8 billion. We are also developing a new export strategy, which will offer greater support for businesses of all sizes to target new markets and boost exports.” (Image: PA)", "external_links": [], "published": "2018-04-10T09:50:00.000+03:00", "crawled": "2018-04-10T12:27:21.001+03:00", "highlightTitle": ""}