{"organizations": [], "uuid": "ca451dd9b294da7bab0656b04f46fd625b491c92", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/whats-on/article1384774.ece/ALTERNATES/s1200/Facebook-4.jpg", "site_section": "", "section_title": "", "url": "https://www.devonlive.com/news/devon-news/heres-how-you-find-out-1433437", "country": "US", "title": "Here's how you will find out if your data was shared by Facebook in the Cambridge Analytica scandal - Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "", "spam_score": 0.291, "site_type": "news", "published": "2018-04-09T10:00:00.000+03:00", "replies_count": 0, "uuid": "ca451dd9b294da7bab0656b04f46fd625b491c92"}, "author": "Barbara Ortutay", "url": "https://www.devonlive.com/news/devon-news/heres-how-you-find-out-1433437", "ord_in_thread": 0, "title": "Here's how you will find out if your data was shared by Facebook in the Cambridge Analytica scandal - Devon Live", "locations": [], "entities": {"persons": [{"name": "richard booth head", "sentiment": "none"}], "locations": [{"name": "philippines", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "indonesia", "sentiment": "none"}], "organizations": [{"name": "cambridge analytica", "sentiment": "none"}, {"name": "devon live news here", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "exeter university", "sentiment": "none"}, {"name": "invalid email  facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Here's how you will find out if your data was shared by Facebook in the Cambridge Analytica scandal Facebook said most of the affected users (more than 70 million) are in the US, though there are more than a million each in the Philippines, Indonesia and the UK Share Richard Booth Head of content 08:00, 9 APR 2018 Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nFacebook is to begin alerting users whose private data may have been compromised in the Cambridge Analytica scandal. \nStarting on Monday, the 87 million users who might have had their data shared with Cambridge Analytica will get a detailed message on their news feeds. \nFacebook said most of the affected users (more than 70 million) are in the US, though there are more than a million each in the Philippines, Indonesia and the UK. Read More Exeter University cuts ties with man at centre of Cambridge Analytica scandal \nIn addition, all 2.2 billion Facebook users will receive a notice titled \"Protecting Your Information\" with a link to see what apps they use and what information they have shared with those apps. If they want, they can shut off apps individually or turn off third-party access to their apps completely. \nChief executive Mark Zuckerberg acknowledged that he made a \"huge mistake\" in failing to take a broad enough view of what Facebook's responsibility is in the world. He is set to testify before Congress next week. Cambridge Analytica whistleblower Christopher Wylie gives evidence to the House of Commons Digital, Culture, Media and Sport Committee's inquiry into fake news (Image: PA Wire) \nCambridge Analytica whistleblower Christopher Wylie previously estimated that more than 50 million people were compromised by a personality quiz that collected data from users and their friends. In an interview aired on Sunday on NBC's Meet The Press, Mr Wylie said the true number could be even larger than 87 million. \nThat Facebook app, called This Is Your Digital Life, was a personality quiz created in 2014 by an academic researcher named Aleksander Kogan, who paid about 270,000 people to take it. Read More \nThe app vacuumed up not just the data of the people who took it, but also - thanks to Facebook's loose restrictions - data from their friends, too, including details that they had not intended to share publicly. \nFacebook later limited the data apps can access, but it was too late in this case. \nMr Zuckerberg said Facebook came up with the 87 million figure by calculating the maximum number of friends that users could have had while Mr Kogan's app was collecting data. Read More Meet the young Devon activists who are fighting Brexit \nThe company does not have logs going back that far, he said, so it cannot know exactly how many people may have been affected. \nCambridge Analytica said in a statement on Wednesday that it had data for only 30 million Facebook users. Like us on Facebook", "external_links": [], "published": "2018-04-09T10:00:00.000+03:00", "crawled": "2018-04-09T14:43:52.000+03:00", "highlightTitle": ""}