{"organizations": [], "uuid": "cc8ded0adebeddde8f646c00ca75562a8f2b04aa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14496067.ece/ALTERNATES/s1200/CFR_NJL_050418end_01.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/newcastle-fashions-retailer-end-one-14496023", "country": "GB", "domain_rank": 21960, "title": "Newcastle fashions retailer END is one of UK's fastest growing companies", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-04-05T16:42:00.000+03:00", "replies_count": 0, "uuid": "cc8ded0adebeddde8f646c00ca75562a8f2b04aa"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/newcastle-fashions-retailer-end-one-14496023", "ord_in_thread": 0, "title": "Newcastle fashions retailer END is one of UK's fastest growing companies", "locations": [], "entities": {"persons": [], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "business newcastle", "sentiment": "negative"}, {"name": "sunday times bdo", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Newcastle fashions retailer END is one of UK's fastest growing companies END, which regularly has people queueing for days for its exclusive fashions, has made the Sunday Times BDO Profit Track 100 Share The END clothing store in Newcastle (Image: gallery) Share Get business   Thank you for subscribing!   \nA clothing company which attracts lengthy queues for its exclusive trainer sales has been singled out as one of the UK’s fastest growing companies. \nEND is the sole North East company to feature in the Sunday Times BDO Profit Track 100 league table, which has been compiled to rank Britain’s private companies with the fastest-growing profits over the last three years. \nThe online retailer, which has its flagship store in Newcastle , rocketed into the rankings at number 47 after growing its profits by an average of 73% over the last three years. \nIn 2017 profits reached £16.2m - a 139% increase on the previous year’s £6.7m - on turnover of £69.7m, a significant increase on the previous year’s £37.9m. \nThe firm was set up in 2005 by friends John Parker and Christiaan Ashworth and sells menswear brands such as Comme des Garçons, Barbour and Stone Island from its base on Newcastle’s Grainger Street, which regularly attracts long queues ahead of the release of rare fashion items. \nIts co-founders set up an online store after 12 months and opened a Glasgow store in 2016. Now it plans to launch a flagship London store in Soho this year. \nEND appears on the list with businesses from around the UK, including domestic appliance designer Gtech, sandwich shop chain Pret A Manger and gym operator PureGym. \nDespite cost pressures caused in part by the weakening of the pound, all 100 companies increased sales and average profit margins rose from 8% to 15%. \nThe companies achieved, on average, profit growth of 77% a year over three years, to a total of £1.1bn in 2016/17. \nTogether they employ 52,600 staff, having added 20,000 employees to their combined workforce over the period, some as a result of acquisitions. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nThe league table and awards programme is sponsored by BDO and UBS Wealth Management, and is compiled by Fast Track, the Oxford-based research and networking events firm. \nTerry Jones, partner and head of the North East at BDO, the title sponsor of the league table, said: “These high-growth, high-energy and highly-entrepreneurial companies will be the difference between success and failure in our post-Brexit economic future. \n“These businesses are playing their part by recording strong levels of revenue and profit growth and by creating jobs. We’d like to see the Government do more to help them by focusing on skills, infrastructure investment and tax simplification.” Like us on Facebook", "external_links": [], "published": "2018-04-05T16:42:00.000+03:00", "crawled": "2018-04-05T17:10:42.004+03:00", "highlightTitle": ""}