{"organizations": [], "uuid": "f9c6c292c0f24104c2aa3968c7dbc40dbc470572", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1419277.ece/ALTERNATES/s1200/DfE-1.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "devonlive - frontpage", "url": "https://www.devonlive.com/news/devon-news/meet-young-devon-activists-who-1418390", "country": "GB", "title": "Meet the young Devon activists who are fighting Brexit", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-04-05T12:38:00.000+03:00", "replies_count": 0, "uuid": "f9c6c292c0f24104c2aa3968c7dbc40dbc470572"}, "author": "Rom Preston-Ellis", "url": "https://www.devonlive.com/news/devon-news/meet-young-devon-activists-who-1418390", "ord_in_thread": 0, "title": "Meet the young Devon activists who are fighting Brexit", "locations": [], "entities": {"persons": [{"name": "devon", "sentiment": "none"}, {"name": "james dart", "sentiment": "none"}, {"name": "dart", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "exeter students for europe", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "barnett international", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Meet the young Devon activists who are fighting Brexit Students still believe they can stop Britain leaving the EU Share Young activists want to keep the UK in the European Union (Image: Barnett International) Share Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nAs the UK inches ever closer to a divorce from the European Union a group of young grassroots activists know that they are running out of time to stop something they believe will have a 'dangerous and damaging' impact on the country. \nFollowing a 2,500 strong pro-EU protest in the city centre last month, hundreds of under-30s across Devon say they are determined to make their voices heard. \nJames Dart, founder of Exeter Students For Europe, refutes claims that he is undemocratic in his desire to keep Britain in the EU and says that his fellow activists are determined to hold the Government to account over Brexit. Read More Watch dramatic rescue as power of the waves drags rescuers one-by-one out to sea \n\"Our message is that we want to remain, reform and rebuild,\" said Mr Dart, 27. \n\"We need to get more grassroots support to badger our MPs to understand that we want another say in this process. \n\"With the initial vote we were mis-sold what it meant. James Dart address crowds at a pro-EU demonstration last month \n\"Leaving the EU is one thing but leaving the single market and customs union as well is so radical that even some of the most Eurosceptic members of the Tory party probably could never have foreseen that it would happen. \n\"These hubs of Remain pockets around the country are being completely ignored and you have the different age cohorts as well. \n\"Under 55s voted to remain, 70 to 80 per cent of 18-24 did the same and so did the over 80s, the war generation. \n\"The Baby Boomers have taken our democracy and just won't let go of this one vote in June that was just a snapshot of sentiment on one day.\" Read More What are you allowed to do if someone breaks into your house? \nGroups and individuals who have campaigned for the UK to stay in the EU since June 2016's Brexit vote have been accused of being 'undemocratic' and ignoring the will of the people - something that James, who is studying a masters in European Politics at the University of Exeter, denies. \nAlong with his role as president of Exeter Students for Europe and youth coordinator of Devon for Europe, Mr Dart has also founded national campaign group Inspire EU alongside his brother. \n\"The will of the people is not something that is static,\" he said. Crowds gathered in Exeter city centre for a pro-EU demo last month \n\"There was only about a third of the population who were supportive about the idea of us leaving the EU. \n\"When you break that down further you see that there was virtually nobody who wanted to leave the single market. \n\"To say that the will of the people is something that is static, cemented and can't be moved is ridiclous. \n\"When you looked the way people have been changing their minds over the last few years - it has been going up and down. Read More Newton Abbot woman, 25, found dead on family holiday in Cyprus \n\"This is grassroots led opposition to what we think is a really dangerous and damaging route forward. \n\"The Leave campaign exploit people like you've never seen before using words such as 'liberal elite' and 'establishment' which is classic populist language. \n\"But these guys in Government are the establishment and we need to make sure we hold them account at every stage of this process. The Brexit protest march at Bedford Square, Exeter (Image: Bridget Batchelor Photography) \n\"I hear quite a lot people in the street people saying 'we won get over it'. \n\"If we were just to 'get over it' what would that mean? We would give a blank cheque to this Government to do anything. \n\"That's not how democracy should work. There should always be a really strong opposition and loud, dissenting voices in any strong democracy.\" Read More Wildlife trust confirms death of Devon beaver - thought to be first ever killed on roads in Britain \nWhile 55 per cent of voters in Exeter backed remaining in the EU, vast areas of Devon expressed their wish to leave a relationship that dates back more than 40 years. \nThe farming and fishing industries were two of the most vocal opponents of the EU during the referendum campaign but Mr Dart claims that there is still no clear picture of how the country will operate once Brexit happens. \n\"A few months before the vote I was still quite split but what swung it for me was when [Eurosceptic MEP] Dan Hannan came down to Exeter,\" said James. James Dart address crowds at a pro-EU demonstration last month \n\"He spoke eloquently and articulately but I came away thinking that the substance is lacking. \n\"If that's the best that Leave have got then I'm not prepared to vote for that. \n\"There was lots flowery language and no substance. Read More This Devon swimmer has been disqualified in Commonwealth Games controversy \n\"There is no blueprint for what a post-Brexit UK will look like.\" \nExeter Students For Europe's stance has been echoed by the city's MP Ben Bradshaw who has repeatedly questioned the decision to leave the EU. \nWriting for DevonLive.com last month, he said that the Facebook and Cambridge Analytica scandal raises awkward questions about legitimacy of the Brexit referendum. \n\"I have also had concerns for some time, which I have repeatedly raised in Parliament – about the use, or rather misuse, of people’s personal data for covert political campaigning and the impact that could have on our democracy,\" said Mr Bradshaw. \n\"So, shocking as the revelations about Facebook and Cambridge Analytica have been, I am not surprised. \n\"It is already clear to me that our regulators have neither the power nor the resources they need to protect our democracy from manipulation. Read More Cold today but hitting 17C at the weekend \n\"Just look at the farce of the Information Commissioner spending a week before finally getting a warrant to search Cambridge Analytica’s office, when Facebook themselves had been to their offices within hours of the scandal breaking. \n\"But Ministers too need to take this problem more seriously than they have. Indeed, everyone who cares about our democracy should, however awkward that might be in terms of raising questions about the legitimacy of the Brexit referendum result.\" Like us on Facebook ", "external_links": [], "published": "2018-04-05T12:38:00.000+03:00", "crawled": "2018-04-05T12:48:43.001+03:00", "highlightTitle": ""}