{"organizations": [], "uuid": "93158a8dfe3a2a1b90fb5c4a0772dabd63004687", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article11054424.ece/ALTERNATES/s1200/JS73334597.jpg", "site_section": "http://www.thejournal.co.uk/business/?service=rss", "section_title": "nechronicle - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14523111", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast RECAP: Intu and Hammerson merger back on after French rival bows out", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-04-13T10:00:00.000+03:00", "replies_count": 0, "uuid": "93158a8dfe3a2a1b90fb5c4a0772dabd63004687"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14523111", "ord_in_thread": 0, "title": "Business Breakfast RECAP: Intu and Hammerson merger back on after French rival bows out", "locations": [], "entities": {"persons": [{"name": "intu", "sentiment": "negative"}, {"name": "tej parikh", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "coreena ford company", "sentiment": "negative"}, {"name": "hammerson", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford Company directors confident about UK economy \nBusiness leaders are feeling more confident about the UK economy than at any time in almost a year, a new study shows. \nResearch among 700 company directors found almost half were confident about prospects for their own company. \nThe Institute of Directors (IoD) said its survey revealed that worries about trade were not among the main three concerns for the first time since Brexit withdrawal negotiations started. \nOptimism is now higher than at any time since the Prime Minister triggered Article 50 last March, said the IoD. \nTej Parikh, senior economist at the IoD, said: “After nearly a year of economic pessimism winning out among business leaders, the scales have tipped gently into the positive. “It seems likely that meaningful progress in Brexit negotiations since December has brought some much needed reassurance. \n“We urge the Government to provide further detail on its proposals for the UK’s future trading and regulatory relationship with the EU, and to iron out its initiatives to narrow the skills gap and enhance business productivity through the Industrial Strategy. \n“While directors’ economic confidence has edged into positive territory, there’s still plenty keeping them on the fence. Positivity has been held back by rising labour shortages and the burden of complying with Government regulations, and this should remind us that Brexit isn’t the only game in town.” Part of the Newcastle City Centre skyline, including Grey's Monument (centre) (Image: Newcastle Journal) 8.50 Coreena Ford Newcastle video game that helps fight dementia nominated for BAFTA award \nA virtual reality (VR) video game designed to help scientists “save the human brain” by fighting dementia was in the running for a Bafta award. \nSea Hero Quest was co-designed by Northumbria University professor Ruth Dalton, who created the game to find out how our brains are able to navigate using a series of increasingly difficult puzzles. \nOne of the early symptoms of dementia is increased difficulty when finding your way around. By monitoring the actions taken by people playing the game, scientists are able to collect vasts amount of data to help their research and understand how brains compute spatial navigation. \nSea Hero Quest was unfortunately pipped to the post at the British Academy Game Awards - the gaming arm of the Baftas last night - but, with more than three million people having played the game so far, and more than two million users allowing their data to be used by scientists, it’s certainly in our eyes... Sea Hero Quest is helping scientists make ground breaking research on the symptoms of dementia (Image: Northumbria University) 8.45 Coreena Ford Closing dates set for remaining Toys R Us stores in the North East \nToys R Us will shut its final stores in the next two weeks, resulting in the loss of more than 2,000 jobs, the retailer’s administrators have confirmed. \nThe toy chain collapsed in February and insolvency specialist Moorfields has been selling off the retailer’s stock at knockdown prices. \nHowever, Moorfields has said that all Toys R Us’s 75 stores would close by April 24, with 2,054 employees set to be made redundant. \nThe chain has three North East outlets, with the Metrocentre store closing on April 21, the Sunderland outlet on April 18 and Teesside on April 20. A sale sign outside a Toys R Us store (Image: PA) 8.40 Coreena Ford Employers relabelling low-skilled roles as apprenticeships, think tank claims \nThe introduction of a levy on apprenticeships has reduced their quality, with some businesses simply relabelling existing training courses, according to a think tank. \nAlmost 40% of apprenticeship standards approved by the Government in the past six years do not meet the international and historical definition of such a scheme, Reform said. \nAn apprenticeship levy was launched a year ago, under which employers with a payroll of £3m or more are required to pay 0.5% of their annual pay bill, with the aim of increasing the number of placements. \nBut the think tank listed typically low-wage jobs including restaurant waiters and hotel reception staff among those now being classed as apprenticeships, and said they are not considered skilled occupations. \nThe report, entitled The great training robbery, said employers are “using the levy to rebadge existing training courses as apprenticeships to shift the costs of training onto the Government instead”. \nThe levy is encouraging employers, some of whom are said to be classing leadership and management skills courses among their apprenticeship standards, to prioritise older, experienced workers over young people, the think tank added. \nShould the trend continue, the Government is in line to spend £600 million on courses wrongly labelled as apprenticeships in 2019/2020, the report predicted. 8.28 KEY EVENT Sage shares fall following slowing sales announcement \nNewcastle software giant Sage has seen a 19% fall in its share price this morning, after announcing its half year sales growth had been slower than expected because of “inconsistent operational execution.” \nIn a trading update for the six months to March 31 2018, the firm said its forecast has been revised from around 8% organic revenue growth and an organic operating margin of around 27.5% to around 7% organic revenue growth and an organic operating margin of around 27.5%. \nOver the long-term, Sage has an aim of achieving organic operating margins of at least 30%. \nDuring the period it saw organic revenue growth of 6.3%, down on the comparable period’s 7.4%, and that the figure had been impacted by two factors: a decline in recurring revenue growth, from 11% to 6.4%, and contract licence slippage in the enterprise segment. \nSoftware subscription growth was 25.3%, compared to 2017’s 30.6%. \nThe share price is currently 544p, down 19.05%. \nStephen Kelly, chief executive officer, said: \nGrowth in H1 18 was lower than our expectations as the pace of execution has been slower than we planned. The market opportunity as outlined at CMD 2018 remains unchanged. \nThe revised revenue guidance targets for FY18 reflect both the performance in H1 18, but also our diligence in ensuring that we focus on recurring revenue to drive sustainable acceleration throughout the rest of FY18 as a platform into FY19. We will provide a further update on our plans at our H1 18 results announcement on May 2 2018. CEO of Sage, Stephen Kelly, at the Sage Gateshead (Image: Newcastle Chronicle) 8.20 Coreena Ford Rolls-Royce warns over customer disruptions \nEngine maker Rolls-Royce has warned over customer disruption and higher costs as it carries out additional inspections on some Trent 1000 engines. \nIn March the engineering firm revealed a charge of around £340 million for repairs on existing engines, but this morning it said the requirement for more regular inspections will lead to “higher than previously guided cash costs”. \nLast month it said up to 500 Trent 1000 engines - used on Boeing 787 planes - were affected by the issues, which see components wear out earlier than expected. \nRolls said that 380 Package C engines, which are under review, are currently in service with airlines, but added that the Trent 1000 Package B and Trent 1000 TEN are not impacted. \nThe group said that the move is driven by its further understanding of the durability of the Trent 1000 Package C compressor. Rolls-Royce - work being carried out on one of their Trent XWB engines (Image: Gary Marshall/Rolls-Royce/PA Wire) 8.15 KEY EVENT 'Filling stations' for electric cars to be built in Newcastle and Sunderland city centres \nA £4m scheme that will see ‘filling stations’ for electric cars built in Newcastle and Sunderland city centres has been announced. \nThe city centre stations on Wellington Street in Newcastle - close to St James’ Park - and West Wear Street in Sunderland, are in prominent locations and will allow electric vehicles to be charged up faster than they could be at home. \nLayouts for the two stations are now being finalised and planning applications will be submitted in the coming weeks after the North East Combined Authority and Newcastle University won funding from a number of sources. \nThe North East is seen as a leader in the use of electric vehicles and has around 10% of the EVs currently on the roads in the UK. \nNissan’s Sunderland plant produces the all-electric Leaf and a number of other companies in the region are also leaders in the electric vehicle industry. Proposed electric vehicle 'filling station' coming to Newcastle and Sunderland (Image: Handout) 8.08 Coreena Ford London Stock Exchange appoints new chief executive \nLondon Stock Exchange Group has appointed Goldman Sachs veteran David Schwimmer as its new chief executive. \nMr Schwimmer, 49, will join the LSE on August 1 and will replace the long standing Xavier Rolet, who left the firm last year in controversial circumstances. David Warren, who has been standing in as interim CEO, will stay on as the company’s finance chief. \nMost recently, Mr Schwimmer was global head of market structure and metals and mining at Goldman Sachs’ investment banking arm. \nHis career at the US titan spans 20 years and includes a stint as chief of staff to Lloyd Blankfein, the bank’s boss. He will join on an annual salary of £775,000 with a bonus opportunity of 225% of that figure, pro-rated for 2018 based on joining date. An information screen displaying the FTSE 100 at the London Stock Exchange (Image: PA) 8.00 KEY EVENT Hammerson and Intu merger can get back on track as French rival walks away \nFrench shopping centre firm Klepierre has said it does not intend to make a formal offer for Hammerson, paving the way for the Bullring owner to seal a tie up with Eldon Square and Metrocentre owner Intu. \nKlepierre said that its chairman Jean-Marc Jestin held a meeting with his Hammerson counterpart David Tyler on Monday to table a £5.04 billion proposal worth 635p per share. \nHowever, following the meeting, it is walking away because Hammerson “did not provide any meaningful engagement”. \nKlepierre said in a stock exchange announcement: “The board of Hammerson did not provide any meaningful engagement with respect to the increased proposal and, after careful consideration, Klepierre has concluded that it does not intend to make an offer for Hammerson.” \nThe latest figure, an advance on Klepierre initial 615p cash-and-shares bid worth £4.88 billion, represented a premium of 45% to Hammerson’s share price March 16. \nBut Hammerson has branded Klepierre’s overtures as “wholly inadequate” and “entirely opportunistic”. \nMr Tyler said earlier this week: “The board has considered the revised proposal from Klepierre carefully. \n“At 635p, it is only a 3% increase on the previous proposal and continues very significantly to undervalue the company.” \nKlepierre’s decision to back off paves the way for Hammerson’s preferred option of a £3.4 billion tie-up with rival Intu, which operates the Trafford Centre in Manchester. \nHammerson, former owner of Newcastle’s Monument Mall and Cramlington’s Manor Walks and owner of Cleveland Retail Park in Middlesbrough, announced last year an all-share takeover of Intu to create the UK’s biggest property company, bringing all their centres under one roof. \nHammerson is now expected to press ahead with that deal which would create Britain’s biggest property company with £21bn worth of assets across Europe. The Bullring shopping centre in Birmingham, owned by Hammerson. More On", "external_links": [], "published": "2018-04-13T10:00:00.000+03:00", "crawled": "2018-04-16T10:23:42.000+03:00", "highlightTitle": ""}