{"organizations": [], "uuid": "c0f787c771c5fe80e2264aab6369d581554f7393", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14593349.ece/ALTERNATES/s1200/FILE-Amber-Rudd-Resigns-As-Home-Secretary.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/amber-rudd-resigns-home-secretary-14593287", "country": "GB", "domain_rank": 21960, "title": "Amber Rudd resigns as Home Secretary, admitting she misled MPs on deporting targets", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-04-30T09:49:00.000+03:00", "replies_count": 0, "uuid": "c0f787c771c5fe80e2264aab6369d581554f7393"}, "author": "Agency Staff", "url": "https://www.chroniclelive.co.uk/news/north-east-news/amber-rudd-resigns-home-secretary-14593287", "ord_in_thread": 0, "title": "Amber Rudd resigns as Home Secretary, admitting she misled MPs on deporting targets", "locations": [], "entities": {"persons": [{"name": "amber rudd", "sentiment": "negative"}, {"name": "rudd", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "ms rudd", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Amber Rudd resigns as Home Secretary, admitting she misled MPs on deporting targets Amber Rudd says she 'inadvertently' misled MPs on targets for the deportation of immigrants Share Amber Rudd (Image: Getty Images Europe) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nAmber Rudd has resigned has Home Secretary after admitting she “inadvertently” misled MPs over government targets for removing illegal migrants.\nMs Rudd, who told a Commons committee on Wednesday there were no such targets, informed Theresa May of her decision to quit in a phone call to Number 10.\nIn her letter of resignation to the Prime Minister , Ms Rudd admitted she should have been aware of information provided to her office making clear such targets did exist, adding: “I take full responsibility for the fact that I was not”.\nShe also referred to the Windrush “scandal”, admitting that people with a right to live in the UK had not always been treated “fairly and humanely”.\nOpposition parties said Ms Rudd was paying the price for Mrs May’s “hostile environment” policy towards illegal immigrants when she was Home Secretary which had led to people being wrongly stripped of their rights and threatened with deportation.\nLaura Pidcock, MP for North West Durham and Shadow Minister for Labour, said: “Clearly Amber Rudd had to go. But the really important issue here is a deep seated hostility within the Home Office of which Theresa May was architect. Personalities & media drama aside, this should be the start of a new direction, where immigrants aren’t used as pawns by government.” Video Loading Click to play Tap to play The video will start in 8 Cancel Play now\nMs Rudd said that prior to her resignation she had been hoping to devise a policy which would have resolved the Windrush crisis.\nIt would have included emergency legislation to protect the rights of the Windrush generation - who came to the UK from the Commonwealth in the post-war decades - alongside measures to remove those who were in the country illegally.\n“The Windrush scandal has rightly shone a light on an important issue for our country,” she wrote in her resignation letter.\n“As so often, the instincts of the British people are right. They want people who have a right to live here to be treated fairly and humanely, which has sometimes not been the case.\n“But they also want the Government to remove those who don’t have the right to be here.”\nMs Rudd’s decision to stand down will come as a major blow to Mrs May who publicly declared her “full confidence” in her as recently as Friday. The sign outside the Home Office in Westminster (Image: PA)\nIt will also upset the delicate balance within the Cabinet between Leavers and Remainers ahead of a crucial meeting of the Brexit “war cabinet” on Wednesday to discuss Britain’s future customs relationship with the EU.\nEnvironment Secretary Michael Gove - one of the Cabinet’s leading Brexiteers - was being touted as the front runner replace her at the Home Office.\nMs Rudd had appeared to be prepared to ride out the storm announcing her intention to come to the Commons on Monday to answer MPs’ “legitimate questions” about the removals targets.\nShe has previously apologised in the House for the “appalling” treatment of the Windrush veterans announcing a taskforce to resolve their immigration status as quickly as possible.\nHowever she was criticised for saying the Home Office was “too concerned with policy and strategy and sometimes loses sight of the individual”, prompting accusations that she was trying to put the blame on civil servants.\nHer latest difficulties began on Wednesday when she told the Commons Home Affairs Committee that the Home Office did not have targets for removals.\nThe following day, however, she returned to the House to admit that Immigration Enforcement managers did use “local targets” but she said they were “not published targets against which performance was assessed”. Read More Amber Rudd under pressure to resign as it emerges Home Office set targets for deportations\nThe pressure then ratcheted up on Friday with the leak of a Home Office memo, which referred to a target of 2,800 enforced returns for 2017-18, and the progress towards a 10% increase in enforced returns “which we promised the Home Secretary earlier this year”.\nIn a series of late night tweets, Ms Rudd said she had not seen the memo - even though it was copied to her office - but admitted that she should have been aware of the targets.\nHer position was further weakened over the weekend however when former immigration minister Brandon Lewis - now the Conservative Party chairman - disclosed they had held weekly meetings to discuss her plans to increase the numbers of removals, although he insisted they did not discuss detailed targets or numbers. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-04-30T09:49:00.000+03:00", "crawled": "2018-04-30T11:23:16.005+03:00", "highlightTitle": ""}