{"organizations": [], "uuid": "bf3439bac5bd7ac500b179253ec07136e4689b40", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/sport/sport-opinion/article1468250.ece/ALTERNATES/s1200/adeapril.jpg", "site_section": "", "section_title": "", "url": "https://www.devonlive.com/sport/sport-opinion/imagined-conversation-between-those-voted-1468144", "country": "US", "title": "An imagined conversation between those that voted to serve notice on Paul Tisdale's contract and those Frank Lampard rumours... - Adrian Edmondson - Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "", "spam_score": 0.105, "site_type": "news", "published": "2018-04-17T17:12:00.000+03:00", "replies_count": 0, "uuid": "bf3439bac5bd7ac500b179253ec07136e4689b40"}, "author": "Adrian Edmondson", "url": "https://www.devonlive.com/sport/sport-opinion/imagined-conversation-between-those-voted-1468144", "ord_in_thread": 0, "title": "An imagined conversation between those that voted to serve notice on Paul Tisdale's contract and those Frank Lampard rumours... - Adrian Edmondson - Devon Live", "locations": [], "entities": {"persons": [{"name": "paul tisdale", "sentiment": "none"}, {"name": "frank lampard", "sentiment": "none"}, {"name": "adrian edmondson", "sentiment": "none"}, {"name": "wolverhampton", "sentiment": "none"}, {"name": "ade edmondson", "sentiment": "none"}], "locations": [{"name": "devon live sport", "sentiment": "none"}, {"name": "chelsea", "sentiment": "none"}], "organizations": [{"name": "city community trust share click", "sentiment": "none"}, {"name": "exeter city fc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Sport opinion An imagined conversation between those that voted to serve notice on Paul Tisdale's contract and those Frank Lampard rumours... Comedian and Exeter City FC fan Ade Edmondson writes a monthly column for Devon Live on behalf of the football club’s partner charity, CITY Community Trust Share Click to play Tap to play The video will start in 8 Cancel Play now   Thank you for subscribing!   \nAn imagined conversation that might have taken place in November 2016, which also reflects the (probably scurrilous) rumour that ‘a potential managerial successor’ was seen at club last week: \n‘Oh crikey, we’re not doing very well at this precise moment.’ \n‘I know, I’m in despair, what shall we do?’ \n‘Well, there’s that bloke who’s dedicated the last ten years of his life to keeping this club running, keeping it competitive, keeping it solvent.’ \n‘What, the one that takes kids from the youth team and makes them into brilliant footballers that get sold to the likes of Chelsea, Wolverhampton, Swansea, Brentford and Peterborough etc.?’ \n‘Yeah, him. The one the players really like.’ \n‘What about him?’ \n‘Well, I reckon, if we sacked him, we’d be much better off.’ Paul Tisdale watches on during Exeter City's win over Cambridge United (Image: Pinnacle) \n‘Brilliant idea! Oh, that makes so much sense. That’d get us shooting up the league in no time, wouldn’t it? Why didn’t I think of that? God, it’s so easy isn’t it? But, hang on… we can’t afford to pay him off, can we?’ \n‘Well, no, that is the one small fly in the ointment, but I’ve thought of a way round it: let’s tell him we’re terminating his contract now but we’d like him work out the remaining two years.’ \n‘Sack him and keep him on?’ Read More \n‘Yeah – he’s such a decent bloke he’ll be fine with that. He’ll still work as hard as he ever did, I’m sure of it. Even though we’re basically slapping him in the face.’ \n‘You’re a genius!’ \n‘I know! And of course, it is a bit sad, but I’m sure it’s the only way we’ll ever get promoted.’ \n‘You’re right, we’ve no chance of even reaching the playoffs with this sad loser…. Though I’m just thinking – you know, before we push the button on this – our current bad form has got nothing to do with most of the first team being injured at the moment, has it?’ Exeter City fans invade the pitch after Jack Stacey's winning goal in the play-off semi-final last season (Image: Pinnacle) \n‘I can’t think what bearing that would have on the team’s performance.’ \n‘You’re right. Let’s sack him.’ \n‘Yeah, let’s sack him. A knee jerk reaction to our current league position is the only sensible way out of this mess. It’s what all the big clubs do.’ \n‘Well, speaking of big clubs, he might agree to go sooner. A lot of much bigger clubs have been sniffing around him for years.’ Read More \n‘Why would they be sniffing round him?’ \n‘Well, they must think he’s good, I suppose.’ \n‘Idiots!’ \n‘And then we might get Frank Lampard as our new manager.’ \n‘God! Really? Frank Lampard - him with three Premier League medals, four FA Cup medals, two League Cup medals, two Community Shield medals, a Champions League medal and a Europa League medal?’ \n‘No, his dad – Frank Lampard Senior.’ \n‘Oh right – he’s a manager, is he?’ Frank Lampard Senior with Frank Lampard (Image: Getty) \n‘Well, he was an assistant manager once. To his brother-in-law. And he was a ‘consultant’ at Watford for a few months, and then again for a few months at Reading…’ \n‘He sounds just the ticket! How old is he?’ \n‘Sixty nine.’ \n‘Brilliant!’ \n‘Yes, it’s a great time to be alive isn’t it? What with Trump, Brexit and getting rid of Tisdale – it’s the dawn of a new era! Our children will look back on this decade, and the decisions we made, and marvel at how we did it.’ \n‘They certainly will.’ \nCome on you Mighty Grecians! Read More Musical legend Lionel Richie declares himself a Chesterfield fan ahead of Exeter City clash \nComedian and Exeter City FC fan Ade Edmondson writes a monthly column for Devon Live on behalf of the football club’s partner charity, CITY Community Trust. \nCITY Community Trust delivers a range of activities to people of all ages across the greater Exeter area, focussed on health, education, wellbeing and physical activity. Ade donates his fee for writing the column to CITY Community Trust. Like us on Facebook", "external_links": [], "published": "2018-04-17T17:12:00.000+03:00", "crawled": "2018-04-17T17:19:02.008+03:00", "highlightTitle": ""}