{"organizations": [], "uuid": "c79ad87e3e9b38cbc201b447d59ab50170b9209c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14447123.ece/ALTERNATES/s1200/TMP_NEC_220318DeLaRue05JPG.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/de-la-rue-preparing-take-14485077", "country": "GB", "domain_rank": 21960, "title": "De La Rue preparing to take Government to court over blue passport debacle", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-04-03T09:53:00.000+03:00", "replies_count": 0, "uuid": "c79ad87e3e9b38cbc201b447d59ab50170b9209c"}, "author": "Sean Seddon", "url": "https://www.chroniclelive.co.uk/news/north-east-news/de-la-rue-preparing-take-14485077", "ord_in_thread": 0, "title": "De La Rue preparing to take Government to court over blue passport debacle", "locations": [], "entities": {"persons": [{"name": "de la rue", "sentiment": "none"}], "locations": [{"name": "team valley", "sentiment": "none"}], "organizations": [{"name": "home office", "sentiment": "none"}, {"name": "de la rue", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News De La Rue preparing to take Government to court over blue passport debacle The Gateshead-based manufacturer has signalled it will resort to legal action after a contract was awarded to a European firm Share The De la Rue plant in the Team Valley. The company has lost out on a big contract to a french company to produce the blue passports after Brexit (Image: newcastle chronicle) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nGateshead-based manufacturer De La Rue is poised to take the Government to court after it awarded a contract to print passports to a European firm. \nIt has emerged the new blue passports, which were billed by the Prime Minister as a symbolic post- Brexit triumph, are to be produced by a Franco-Dutch firm. \nDe La Rue have warned it would be not in the national interest for the Home Office to proceed with their preferred bid, describing themselves as the “highest quality and technically most secure” option. \nMinisters have defended a preliminary decision to grant the contract to Gemalto, which they say will save taxpayers about £120 million. \nDe La Rue has publicly accepted it’s a more expensive option but questioned their rival’s ability to complete the work on the price quoted to the Government. \nThis proposed legal challenge comes in the wake of a Daily Mail petition calling for the Home Office to give the contract to a British firm reached 266,000 signatures. Read More Gateshead Council boss demands answers as De La Rue loses UK passport contract \nA spokesperson for the company said: “We confirm that we are taking the first steps towards initiating appeal proceedings against the provisional decision to award the British passport contract to a part state-owned Franco-Dutch company. \n“Based on our knowledge of the market, it’s our view that ours was the highest quality and technically most secure bid. \n“We can accept that we weren’t the cheapest, even if our tender represented a significant discount on the current price. \n“It has also been suggested that the winning bid was well below our cost price, which causes us to question how sustainable it is. \n“In the light of this, we are confident that we remain the best and securest option in the national interest.” Read More De La Rue vows to fight decision to print UK passport abroad \nIn December, the Government announced that the UK passport would change from the standard EU burgundy colour to a blue and gold design after leaving the bloc. \nThe blue cover was billed as a return to the “iconic” original appearance of the British passport, with the colour first used in 1921. \nAt the time the move was announced, Theresa May said the document was an “expression of our independence and sovereignty”. \nMinisters came under fire after reports emerged that the new travel document would be manufactured in France. \nThe Prime Minister has also faced calls to explain to British workers why the passport appears set to be made on the Continent. Like us on Facebook", "external_links": [], "published": "2018-04-03T09:53:00.000+03:00", "crawled": "2018-04-03T16:35:15.000+03:00", "highlightTitle": ""}