{"organizations": [], "uuid": "27a3c6d8ceb75a751a9e1f5a796edf1d23b0043f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article1464320.ece/ALTERNATES/s1200/24232963_10212200434621017_3844810111980729737_n.jpg", "site_section": "https://www.devonlive.com/rss.xml", "section_title": "devonlive - frontpage", "url": "https://www.devonlive.com/news/devon-news/devon-young-farmer-chosen-represent-1464306", "country": "US", "title": "Devon young farmer chosen to represent the nation in South Africa", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-04-16T19:05:00.000+03:00", "replies_count": 0, "uuid": "27a3c6d8ceb75a751a9e1f5a796edf1d23b0043f"}, "author": "Lewis Clarke", "url": "https://www.devonlive.com/news/devon-news/devon-young-farmer-chosen-represent-1464306", "ord_in_thread": 0, "title": "Devon young farmer chosen to represent the nation in South Africa", "locations": [], "entities": {"persons": [{"name": "devon", "sentiment": "none"}, {"name": "cruwys morchard yfc", "sentiment": "none"}, {"name": "cruwys morchard", "sentiment": "none"}, {"name": "layla hill", "sentiment": "none"}], "locations": [{"name": "south africa layla hill", "sentiment": "none"}, {"name": "south africa devon", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "south africa", "sentiment": "none"}], "organizations": [{"name": "national federation of young farmers’ clubs", "sentiment": "none"}, {"name": "yfc travel", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Devon young farmer chosen to represent the nation in South Africa Layla Hill will be heading out in August with the group Projects Abroad Share Layla Hill will be heading out in August with the group Projects Abroad Share   Thank you for subscribing!   \nA young farmer from Devon has been chosen to represent the nation as an ambassador in South Africa. \nLayla Hill, Cruwys Morchard YFC’s chairman has been selected to represent the National Federation of Young Farmers’ Clubs on a team travel through the YFC Travel programme. \nShe said: “I will be travelling to South Africa in August 2018 with Projects Abroad. \n“In October, I submitted my application to gain an interview. The reason I applied for this trip is that I work as a teaching assistant in a primary school and would love to see how children in different cultures are educated. I live with my family on a small holding where I enjoy helping out with the day to day duties on the farm. Read More Task group report says farmers need to have greater clarity about what will happen post Brexit \n“I am a very active member of Cruwys Morchard YFC, always keen and willing to help out. The thought of helping out on another farm that maybe less fortunate is something I feel I would be able to do, as our club is always enthusiastic to help in our local community. I successfully gained an interview which took place in December at NFYFC centre, Stoneleigh Park, Warwickshire. Following this, I was offered a place on the travel team.” \nMiss Hill said YFC Tracel was a “brilliant” way to visit new countries, experience other cultures, learn things to take back to your own community and make lots of new friends. \nShe said: “I will be staying with different host farming families and I will be assisting with: Preparing land for planting- removing rubble and waste, planting trees and seedlings, weeding, composting and cutting grass, creating and maintaining vegetable gardens for vulnerable families in the township, collecting litter and creating materials for nutrition and organic farming awareness campaigns Read More Prince of Wales watches inmates performing opera in Devon prison \n“In addition to this, I will also have the opportunity to spend some time at one of the care placements, helping to provide young children with basic care and promoting early childhood development, including running educational games or organising a sports day. \n“I have been fundraising for this amazing opportunity i have been given and would especially like to thank my local community, which has been behind me 100 per cent and supporting all the fundraising events that I have held.” \nIn January, she held a bingo which raised £262 and in March a raffle was held at Cruwys Morchard YFC Big Breakfast raising £120. \n“I have just recently held a fundraising race night at the start of April, which was a massive success and very well supported,” she added. “This event raised a massive £1057, I would like to thank everybody that attended this event, and the sponsors of this event.” \nOn April 28 there is a chocoholic bingo. Doors open 7.30pm. On May 12 there is an afternoon tea and Big Draw from noon until 3pm. Both these events will be held at Cruwys Morchard Parish Hall. Read More Young Farmers' Q&A with Kate Edginton: Championship accolade is 'dream come true' for dedicated member \nShe added: “I would also like to thank anybody who has donated money towards this fantastic opportunity. I am really looking forward to this opportunity and the experiences I will gain from this. I know I will be able to bring back my experiences to my work place and to the YFC community. On my return I will be doing a presentation evening about my trip to South Africa.” Like us on Facebook", "external_links": [], "published": "2018-04-16T19:05:00.000+03:00", "crawled": "2018-04-16T19:23:17.011+03:00", "highlightTitle": ""}