{"organizations": [], "uuid": "98896a31617098a7726517d45438ac6f2b8c9294", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article1416169.ece/ALTERNATES/s1200/35683658JPG.jpg", "site_section": "", "section_title": "", "url": "https://www.leicestermercury.co.uk/news/business/aggregate-industries-chief-executive-franois-1416093", "country": "GB", "domain_rank": 48128, "title": "Aggregate Industries chief executive François Pétry on challenging times for the construction sector - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.179, "site_type": "news", "published": "2018-04-04T12:12:00.000+03:00", "replies_count": 0, "uuid": "98896a31617098a7726517d45438ac6f2b8c9294"}, "author": "Justine Halifax", "url": "https://www.leicestermercury.co.uk/news/business/aggregate-industries-chief-executive-franois-1416093", "ord_in_thread": 0, "title": "Aggregate Industries chief executive François Pétry on challenging times for the construction sector - Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "françois pétry", "sentiment": "negative"}, {"name": "alistair langham", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "francois petry", "sentiment": "none"}, {"name": "françois", "sentiment": "none"}], "locations": [{"name": "bardon hill", "sentiment": "none"}, {"name": "coalville", "sentiment": "none"}, {"name": "midlands", "sentiment": "none"}, {"name": "bardon hall", "sentiment": "none"}], "organizations": [{"name": "aggregate industries", "sentiment": "negative"}, {"name": "leicester mercury aggregate industries", "sentiment": "negative"}, {"name": "share aggregate industries", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Aggregate Industries chief executive François Pétry on challenging times for the construction sector ‘I take great pride in seeing what the company has made possible’ Share Aggregate Industries CEO Francois Petry at Bardon Hall, the company's HQ (Image: Alistair Langham/ The Studio 17) Share Get Business   Thank you for subscribing!   \nWith the weaker pound, growing skills shortage and Brexit, the last two years have been an interesting period for a constuction materials giant founded 150 years ago. \nBut François Pétry also said it had been an exciting time to be at the helm of one of Leicestershire’s top five biggest companies, and the job had already proved to be a career milestone. \nAggregate Industries, based in Bardon Hill, just outside Coalville, has an enviable position as a market leader in modern construction developments. \nAs chief executive, François has been focusing on securing the firm’s position in the Midlands up until 2045 – building on its foundations, further investing in its 4,200 employees, and embracing new technology. \nHe said: “My focus as CEO of Aggregate Industries has been on nurturing a culture of stability and strength, ensuring that we continue to innovate, invest in our people and push boundaries in modern construction practice. \n“To this extent, I am most proud of the fact that we have been able to continue to lead with confidence in today’s challenging market, adapting to changing environs and reinforcing our position as a market leader.” \nJust one of the development projects he has overseen is the £80 million investment into extending Bardon Hill Quarry from 74 to 222 acres, enabling it to significantly extend it previous expected rock depletion date of 2020 up to 2045. \nThe massive extension to the quarry – which was used to build London’s Olympic Park – will also create over 200 contractor jobs, the bulk of which will be from Leicestershire, and have long-term gains. François Pétry became chief executive of mining company Aggregate Industries two years ago \nHe said: “This is a very exciting project allowing us to operate in the Midlands for the next 25 years, adding value to Leicestershire and stimulating the local economy. \n“We are also creating employment opportunities. \n“More than 200 contractors will be employed to work on the project during its peak, nearly all local operators, and this project also ensures sustainable employment for the long-term.” \nIt has also continued to play a “fundamental role” in bringing many large-scale infrastructure projects “to fruition” across the country. \nAs well as London’s Olympic Park, it also supplied construction teams on The Shard in 2012. \nMore recent examples include Aggregate Industries’ “heavy involvement” in the M1 junction 16-19 improvement scheme. \nWorth an estimated £94.1 million, it saw the creation of a new running lane to increase capacity and improve journey time reliability on the route. \nIt has also been involved in many local and regional initiatives. \nThey include supplying De Montfort University as part of its major remodeling and landscaping project to create a “visually impressive area” of public paths and seating in Mill Lane, the main area of the university. \nAnd that’s not all. \nFrançois said: “As a business that’s deeply vested in its regional business community, we continue to work on lots of core projects throughout the area. \n“A recent key highlight is the East Midlands Airport runway refurbishment project where we supplied the vast 55,000 tonnes of aggregates for a new 2.9km runway which serves airlines including Ryanair, Flybe and Jet2. This was no easy feat. \n“It marked the first time a UK commercial airport had implemented full shutdowns across multiple weekends to allow large volumes of surfacing to be carried out. \n“With our Bardon Hill quarry capable of producing 1.5 million tonnes of aggregates a year for surfacing solutions, we were able to deliver a stockpile of 800-1,000 tonnes of aggregates a day, ensuring the project was kept on schedule and downtime minimised.” Francois Petry at his Bardon Hall desk (Image: Alistair Langham/The Studio 17) \nHe also admits to being “excited” by the firm’s “ongoing move towards a more digital business” – a “big focus” for 2018. \nIt will include the launch of an internal digital lab and the company is also in the “early stages” of developing VR capabilities and even using drones for stocktaking work. \nFrançois said: “The launch of our internal digital lab sees a full integration of our digital capabilities in line with our business strategy. \n“We already have some established digital companies, such as Simply Paving, but we are continuing to invest in our digital offer and have recently launched a brand new Aggregate Industries’ website. \n“Our ability to transact digitally is also creating efficiencies in our internal processes. \n“We are also starting to understand practical uses for these technologies that will positively impact our employees and customers. \n“For example, we are in the early stages of developing VR health and safety inductions, as well as training modules. \n“Another use of technology that we are in the early stages of utilising is drones, which are allowing us to measure our onsite stocks. \n“We are only at the start of our journey into fully understanding the potential of these advancements and we are learning more each day how we can better leverage these to both our own and our customers’ advantage.” \nIn terms of continuing to grow, the company is also “currently focusing” on “improving the efficiencies” of existing sites and it will also be “adding additional capacity” in terms of its “concrete logistics offering” this year with the recent acquisition of The Kendall Group. Bardon Hill and quarry - how they looked back in 2014 (Image: Andy Baker) \nFrançois, a 52-year-old father-of-three, was born in Nancy, 200 miles east of Paris, but now regards the UK as his home. \nNo stranger to the quarrying industry, he has worked for the LafargeHolcim group – which Aggregate Industries is part of – since 2008, and described taking over as CEO of the firm as “a real milestone” of his career. \nHe said: “When I was offered the chance to become directly involved with the organisation, I saw it as a unique and exciting chance, so I grabbed it with both hands. \n“And I take great pride in seeing what the company and our people have been able to make possible, such as the London Olympic Park and The Shard.” \nHaving worked across Europe before coming to the UK, he has been impressed by the “high professionalism” in Britain, “no matter where you operate within the value chain”. \nBut what was key to making him stay with the group for a decade, and becoming Aggregate Industries’ boss in December 2015, is its “progressive, innovative and incredibly ambitious” approach, as well as the fact it’s a business that “still values people”. \nA rugby fan, François admits he’s driven by “strong team spirit, creating efficiencies and driving competitive performance”. \nHe said: “The construction industry still values people and this is reflected in Aggregate Industries, where we continue to encourage our entrepreneurial spirit, as we recognise that this is what drives our performance, even whilst operating in what can be a difficult economic environment. \n“I feel that I have managed to achieve my personal career goals through working within organisations that value their staff and allow them to implement change – whether it has been in strong performing companies or companies that have required change. \n“This led me to be attracted to Aggregate Industries, as our people drive our performance, even in an uncertain environment, as it is today in the midst of Brexit.” North West Leicestershire MP Andrew Bridgen with Aggregate Industries CEO Francois Petry at the lighting of a beacon on Bardon Hill to mark the Queen's 90th birthday last year (Image: Alistair Langham/The Studio 17) \nLooking to the future after Brexit, François said: “As a Frenchman, I always see the benefit of working closely with the rest of Europe, but I respect the decision that’s been made. \n“Frustratingly, we are already seeing that the investment decision-making process has been impacted by the uncertainty surrounding the negotiation process. \n“However, the fundamental needs for housing and large-scale infrastructure projects in the UK means that the market will remain stable and is already showing resilience compared to Continental Europe.” \nBut like many others at the helm of firms in the construction industry he is concerned about the growing skills shortage in the UK and how Brexit will impact this. \n“More long-term, depending on the nature of the Brexit agreement, we will be particularly interested in UK immigration policy and trade restrictions,” he said. \n“One major impact it can have is to reduce our ability to recruit talent with the needed skills and competencies, as we currently have a severe skills shortage in the UK.” \n“We will continue with our commitment to high quality, high value products and solutions and do our very best for our customers. \n“We are in a strong position to fulfil this aspiration and are confident in our ability to deliver.” \nTo sustain the industry’s future, he also admitted that he felt it needed to “come together” to be “more attractive” to younger generations and it also “needed “to work harder to be more inclusive”. \nDespite the uncertainty hanging over the UK’s economy, François is confident its planned investment programme will help Aggregate Industries, which is working to attract more women into the business, continue to be a “sustainable business”. \nHe said: “Even in a difficult market, we’ve managed to occupy pockets of growth and have in turn invested in these areas to define our framework for the future. \n“For example, we are investing in our rail and logistics capabilities, as well as our sites and products to increase our efficiencies and improve services for our customers, as well as to become a more sustainable business. \n“Our vision of the future is to continue to work collaboratively and partner with customers to deliver products and services that offer a real solution to the challenges they face. \n“Looking ahead, it will continue to be a challenging market, as the uncertainty of Brexit causes a lack of confidence to invest here. \n“However, we are confident the UK will remain strong. Read More Wayne Sheppard stepping down from top job at Leicestershire brick maker Ibstock \n“As well as the clear requirement for housing and large-scale infrastructure projects there’s a clear commitment from government to deliver these. \n“We will continue to bring our best solutions and services to the market to help deliver these projects and this is where we see potential growth for our business. Read More Breedon Group doubles revenues \n“We will also continue to invest in the Midlands and the wider UK. \n“Leicestershire is an important part of our company, as a lot of our employees live and work in this area, and in turn we continue to invest heavily in the region.” Read More Leicestershire construction materials giant Aggregate Industries buys Kendall Group \nWith supporting Leicester A key element of Aggregate Industries’ business plan is to back a host of initiatives and partnerships. \nThese include the Concrete Rugby programme with Leicester Tigers, which included staff joining Tigers players in sharing thoughts on video as part of the Give Bullying the Boot campaign last year. during National Bullying Week 2017. Read More \nThe firm’s Bardon Community Fund is also committed to providing £400,000 to support local community initiatives that benefit residents around Bardon Hill Quarry for the next 10 years. Like us on Facebook", "external_links": [], "published": "2018-04-04T12:12:00.000+03:00", "crawled": "2018-04-04T16:28:35.054+03:00", "highlightTitle": ""}