{"organizations": [], "uuid": "1440ea1d2e46d668a9b6ceb75a82534f6bab1bc7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14553219.ece/ALTERNATES/s1200/MoyaGreen-20retouched_0.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14553217", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Royal Mail CEO Moya Greene retires after eight years in charge", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-04-20T10:00:00.000+03:00", "replies_count": 0, "uuid": "1440ea1d2e46d668a9b6ceb75a82534f6bab1bc7"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14553217", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Royal Mail CEO Moya Greene retires after eight years in charge", "locations": [], "entities": {"persons": [{"name": "moya greene", "sentiment": "negative"}, {"name": "jes stal", "sentiment": "negative"}, {"name": "staley", "sentiment": "none"}], "locations": [], "organizations": [{"name": "barclays", "sentiment": "negative"}, {"name": "prudential regulation authority", "sentiment": "none"}, {"name": "financial conduct authority", "sentiment": "none"}, {"name": "barclays bank plc", "sentiment": "none"}, {"name": "barclays bank uk plc", "sentiment": "none"}, {"name": "fca", "sentiment": "none"}, {"name": "pra", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Take a look at David Lloyd Clubs' PTV classes 9:10 Jonathon Manning Get fit while watching Netflix as gym introduces personal trainers who carry TVs on their backs \nHave you ever wished that you could keep fit while catching up with all your favourite television shows? \nNow you can – thanks to a new fitness class that lets you watch TV while out running. \nGym company David Lloyd Clubs has now launched a new fitness class where personal-running coaches carry out classes with TVs strapped to their backs , with access to everything from BBC iPlayer and Amazon Prime to Netflix. \nThe PTV service has been introduced to combat the negative effects of binge watching TV, so that instead of sitting down for long periods of time, those looking to get fit can watch their favourite episodes of Game of Thrones, The Crown, Stranger Things, or Westworld while running. \nRunners can sign up for one-to-one session or team up with others, before choosing their show from Netflix, BBC iPlayer, Now TV or Amazon Prime. \nThe PTV then maps a route runners can complete in the time it takes to watch an episode. \nThe classes are being trialled at David Lloyd’s Chigwell club in Essex but if successful they could be rolled out across the country, potentially bringing them to the three David Lloyd clubs in the North East, at Newcastle, Sunderland and Middlesbrough. \nJorge Fernandes, general manager at David Lloyd Chigwell, said: \nWe are always looking at ways we can introduce exciting new types of classes and services that can really benefit our members. \nWe appreciate that the hectic nature of modern life means people often struggle to find time to exercise each week. \nOur new PTV classes aim to counter this trend, giving time-poor parents and young professionals the perfect means to stay up to date with their favourite shows while ensuring they stay active and healthy at the same time. David Lloyd Clubs is introducing 'PTVs' - a team of personal outdoor running coaches with digital screens strapped to their backs (Image: publicity pic) 9:00 Jonathon Manning Massive drop in apprenticeship starts brings fresh call to reform levy \nBusiness leaders have stepped up calls to reform the Government’s apprenticeship levy after new figures showed a huge fall in the number of apprenticeship starts since it came in.Between August 2017 and January this year there were 206,100 apprenticeship starts in England compared with 269,600 between the same period a year ago.The Institute of Directors (IoD) said starts were down 24%, adding to the “growing body of evidence” that the levy was not working as the Government intended.Head of Policy Research Seamus Nevin, said: \nEmployers in almost every sector are reporting urgent skills shortages so the majority are very supportive of the levy in principle. \nBut there have been major problems with putting the funds to use in the ways and places they are needed most. \nWhile the intention behind the policy is right, today’s stats reinforce why we need a change in how the levy is implemented. \nThe IoD has been urging the Government to reform the system so that larger companies can pass more of the funds down their supply chain to the places it is really needed, and to give firms longer to use the money, so that it is spent on the most valuable apprenticeships and on subjects where there are the biggest skills shortages. \nA Department for Education spokesman said: \nOur reforms to the apprenticeship system are about increasing the number of quality apprenticeships, so people of all ages and backgrounds can take advantage of the opportunities apprenticeships bring. \nWe have recently seen an increase in the number of people starting on higher level apprenticeships, such as engineering and law, and on our new quality apprenticeship standards. \nThese new apprenticeships are designed by employers themselves to meet their needs, and in a range of industries such as fashion, banking and defence. \nThe apprenticeship levy is an important part of these changes to raise the quality of apprenticeships in this country, creating long-term, sustainable investment in training and education. \nNearly 60% of people starting on the new apprenticeship standards are levy supported, showing that levy payers are working well with the new system. The number of apprenticeships has fallen 8:50 KEY EVENT Blue passport decision 'too important to be made on price', Gateshead MP says \nNorth East MP Liz Twist says the decision about who makes British passports is too important to be made solely on price , after she visited De La Rue’s Gateshead factory. \nThe Blaydon MP made her comments after visiting De La Rue’s Gateshead factory, just days after the company revealed it would not be appealing the Government’s decision to hand a major passport manufacturing contract to Franco-Dutch firm Gemalto. \nDe La Rue has been manufacturing British passports from its Team Valley factory in Gateshead for the last 10 years, but was recently outbid on the contract by Gemalto. The European firm will now be tasked with producing the blue passports after Brexit. \nMs Twist said: \nI really feel that staff have been doing a brilliant job at delivering the contract. I still remain concerned at the deliverability of the contract at a price that is so much lower. \nThere are concerns about the deliverability of the contract and that the passports are being manufactured in two places. \nI think we have started from the wrong place on this. Our UK passports are too important to go through a procurement process based on price. \nDe La Rue’s Gateshead factory employs around 600 people, including around 200 in the firm’s passport division. The company has said it is too early to tell whether the loss of the contract will lead to job cuts but added it will be working to find new contracts to replace the work. \nMs Twist added: \nThe staff are shocked and concerned and everyone is keen to get on with the job they are doing and do the best they can. They are keen for the company to win additional work. \nMs Twist also said she would do all she could to support the workers who may be affected by the loss of the contract. Blaydon MP Liz Twist with De La Rue's chief operating officer Bryan Gray during a tour of the company's Gateshead factory (Image: Unknown) 8:45 Jonathon Manning Councils urged to switch after paying £863m a year to Big Six energy firms \nMore than £863m of taxpayer’s cash is being handed over by local authorities to the Big Six energy providers or oil giants as councils fail to switch to smaller providers, research has found.Nine out of 10 local authorities in Britain are supplied by one of the major UK energy or oil firms, according to the results of a Freedom of Interest (FOI) request by smaller supplier Bulb.This comes despite a raft of council leaders openly encouraging residents to switch to challenger suppliers to save cash and be more environmentally-friendly.In contrast, 20% of households have switched to a smaller energy firm.Citizens UK urged councils to shop around to find the best deal for taxpayers.Caitlin Burbridge, a community organiser with Citizens UK, said: \nCouncils have a responsibility to seek the best value for money for their residents, and spending on energy should be no different. \nWith many smaller suppliers offering cheaper tariffs, and often green energy, councils should look to shop around rather than continue to stick with the Big Six. \nResponses from 273 out of 408 local authorities in the UK to the FOI discovered councils were paying over £863m a year to the major providers, with mammoth differences in the amount forked out for energy bills.The study found 243 of the 273 authorities which responded use a large supplier, including 92 with Npower, 45 using EDF Energy, 36 opting for Total Gas & Power and 49 using a mixture of large providers.It also showed residents paying as much as £83.32 on average a year in Milton Keynes for the unitary authority’s energy, versus just £4.99 in Portsmouth, although these figures are also dependent on the number of residential properties and other factors.In Orkney Islands in Scotland, households are forking out £165.46 a year for council energy against £44.48 per household in Renfrewshire. Gas rings on a cooker (Image: PA) 8:40 Bristol Street Motor's Newcastle branch named Dealer of the Year \nBristol Street Motors’ Newcastle Vauxhall is celebrating after winning a national award. \nThe dealership was recognised as “Dealer of the Year” at the Motobility Scheme’s annual awards. \nIt is the fourth time in five years that the dealership has been named Dealer of the Year at the awards, which recognises and rewards best practice at national dealerships. \nNick Harding, general manager of Bristol Street Motors Newcastle Vauxhall said: \nCustomer service is extremely important in every aspect of the business and that has been reflected in this award, which is based on customer feedback and Motability performance. \nThe Motability Scheme aims to help eligible people with ‘worry free motoring’ and Gavin, Steve and Lauren excel at delivering that to our customers. Gavin has been at the dealership for many years and has built up a loyal customer base. Customers return time after time and also recommend Gavin, and his expertise is a major driver behind our success. The Bristol Street Motors Newcastle Vauxhall team with Richard Povey, dealer development manager - dealer relations at Motability Operations (far right) 8:35 Jonathon Manning Cramlington's Avid Technology creates new jobs after winning £50m worth of work \nNorth East automotive firm Avid technology has created 10 jobs after winning a contracts worth more than £50m. \nThe Cramlington firm, which specialises in vehicle electrification, design and manufacture, has hired 10 members of staff since January, taking its headcount to 64. \nThe new hires have been appointed across all of the firm’s departments including project management, engineering, production, testing, software, and electric motor design. \nAlong with the boost in headcount, the company’s project pipeline has more than doubled in the last 12 months, with annualised sales now exceeding £240m. \nRyan Maughan, Avid’s managing director, said: \nSince the start of the year we’ve experienced a significant increase in new business both in the passenger and commercial vehicle industries internationally and the robotics and aerospace sectors which we began targeting in 2017. \nDuring the past few years our staff numbers have grown at a steady rate year-on-year, from an average of 14 in 2014 to 64 this month. We expect this number to increase significantly throughout the rest of 2018. This is an exciting time to join the team, as a young company we are focused on growth and breaking new ground. \nOur ability to support customer programs from prototype development to series production is demonstrated through our growing global customer base. Climate change, urban air quality and the rising cost of energy are major issues of our time. \nThe energy consumption and exhaust emissions from vehicles and transport are major contributors to these issues. Everyone at Avid is committed to delivering a cleaner, greener future through the design and delivery of world-leading, energy efficient, electrified powertrain and propulsion technology. AVID's new recruits (Image: CREST PHOTOGRAPHY) 8:30 KEY EVENT Barclays boss facing fine by regulators over whistleblower debacle \nBarclays boss Jes Staley is facing a fine after regulators found he had allegedly breached conduct rules by attempting to identify a whistleblower in 2016.The lender detailed draft warning notices issued by the Financial Conduct Authority (FCA) and Prudential Regulation Authority (PRA), which both allege that Mr Staley’s action’s violated rules that require an individual “to act with due skill, care and diligence”.However, the bank stressed that regulators are not alleging that the Barclays boss acted with a lack of integrity or that he was not fit to continue in his role as chief executive.The size of the proposed penalty has not been disclosed.Mr Staley now has 28 days to respond to the warning notice.Barclays Bank, which also faced a probe following Mr Staley’s attempts to identify the author of the anonymous letter, is not facing any enforcement action by the FCA or PRA. \nThe lender said: \nHowever, they have proposed that each of Barclays Bank PLC and Barclays Bank UK PLC will be subject to requirements to report to the FCA and PRA on certain aspects of their whistleblowing programmes. Barclays (Image: PA) Jonathon Manning North East wind industry can create thousands of jobs, new report says \nThe North East should be promoted as the UK’s leading centre for cutting edge technologies in the offshore wind sector as it creates thousands of highly skilled jobs, a major new report has said. \nFormer Cabinet Minister Sir Michael Fallon has produced a series of recommendations designed to get offshore wind to be central to the Government’s industrial strategy, highlighting the North East as a leader for new technologies in turbine and blade development, cabling and electricity storage. \nSir Michael, a one-time Darlington MP who was an Energy Minister and most recently Defence Secretary, has called on the Government to establish a 60% target for UK content within British offshore wind projects. \nThe report also recommends the UK offshore wind industry should agree a ‘sector deal’, placing it at the heart of the Government’s Industrial Strategy and giving it equal status with sectors such as pharmaceuticals, defence and aerospace. \nSir Michael calls for Government export finance assistance to be made available for domestic projects being undertaken by firms already exporting, and said that the UK Business Bank should look at ways of reducing the bond finance burden on the supply chain. \nHe said: \nThis is a pivotal moment for offshore wind. The huge investment to date has repaid the confidence shown by the Government in its future over the last six years. \nBut some of that investment has gone to European companies with no consequent impact on UK skills and productivity. The priority now must be to ensure that more of this investment leads to the bigger prize, a genuinely competitive UK industry that can help build the wind farms now being envisaged in the Indian Ocean, the Sea of Japan and off the north eastern US seaboard. \nStrong UK supply chains and innovative high technology SMEs are the keys to winning these new contracts. Brexit offers fresh opportunities to use our freedom from artificially restrictive EU procurement rules to develop a world-beating industrial sector. An offshore windfarm run by Dong Energy (Image: Handout) 8:20 Jonathon Manning Tech giants should pay people for their data, says Sir Vince Cable \nPeople should be paid whenever their personal data is used by tech giants to make money, Sir Vince Cable has suggested.The Liberal Democrat leader said data was the “new oil” and the “growth industry of this century”, with control of customers’ information giving tech firms an advantage over competitors.But it was “astounding” that people were giving away something so valuable free of charge, the former business secretary said. \nHe said: \nWe should seriously consider the possibility of compensating people - or society more broadly - financially for the data they currently hand over for nothing. \nSpeaking at the CodeNode tech events centre in London, Sir Vince said there was a “fundamental economic issue of whether any company which uses data from individuals to make money should pay the owner of that data for its use”.He said economists from Microsoft and the Universities of Columbia and Stanford have argued that “data should be seen as a form of labour” and “regarded solely as the property of those that generate it, unless they agree to sell it”. \nLooked at in another way, it is astounding that people have been so happy to give up something so valuable without charge. \nIf individuals were paid every time their data is used anywhere in the world, in a mirror of the worldwide copyright structure, there would be a mechanism for redistributing the profits of those with most to gain from technological advances, into the pockets of those who are most likely, in the short term at least, to lose. \nBy putting data in people’s hands and empowering them to choose who to sell it to, personal data would no longer be monopolised by the tech giants, and innovative insurgents could buy the data they needed, instead of letting themselves be bought up to access the giants’ data pools. Vince Cable (Image: Newcastle Chronicle) 8:15", "external_links": [], "published": "2018-04-20T10:00:00.000+03:00", "crawled": "2018-04-20T10:37:58.004+03:00", "highlightTitle": ""}