{"organizations": [], "uuid": "cc285a3fccbdaa378d0c768c8c55d87372a6b120", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/article1449675.ece/ALTERNATES/s1200/KH_Lundy.jpg", "site_section": "http://www.westernmorningnews.co.uk/editorschoices.rss", "section_title": "devonlive - frontpage", "url": "https://www.devonlive.com/news/adventures-skin-diving-trade-1449670", "country": "GB", "title": "The man who has spent a lifetime studying Britain's underwater world", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-04-12T19:34:00.000+03:00", "replies_count": 0, "uuid": "cc285a3fccbdaa378d0c768c8c55d87372a6b120"}, "author": "Keith Rossiter", "url": "https://www.devonlive.com/news/adventures-skin-diving-trade-1449670", "ord_in_thread": 0, "title": "The man who has spent a lifetime studying Britain's underwater world", "locations": [], "entities": {"persons": [{"name": "keith hiscock", "sentiment": "none"}, {"name": "gosse", "sentiment": "none"}, {"name": "keith", "sentiment": "none"}, {"name": "hiscock", "sentiment": "none"}, {"name": "philip henry gosse", "sentiment": "none"}, {"name": "lundy", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "ilfracombe", "sentiment": "none"}], "organizations": [{"name": "hidden world", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The man who has spent a lifetime studying Britain's underwater world Keith Hiscock has been at the forefront of marine conservation for 50 years Share Keith Hiscock diving off Lundy Island Share   Thank you for subscribing!   \nWhen marine ecologist Keith Hiscock started diving, wetsuits came as a “flat-pack” kit of neoprene, a brown-paper pattern and a tin of glue. \nKeith got himself into trouble with his Mum by cutting out and assembling his in the living room of their Ilfracombe home – and getting glue on the carpet. \nBy then the young Hiscock was already splashing in the tracks of the famous Victorian naturalist Philip Henry Gosse. Gosse, who was virtually the inventor of the seawater aquarium, lived for a time in Ilfracombe so doubtless Keith Hiscock trod in the same rock pools as his hero once had. While still at school he developed a fascination for marine life. \n“I was trying to follow in Gosse’s footsteps,” he says. \nHis new book, Exploring Britain’s Hidden World, shares the knowledge – and the images – gathered during a 50-year career. March 31 this year was the 50 anniversary of his very first dive. Read More A deposit return scheme will encourage more people than ever to recycle Cuttlefish at Babbacombe (Image: Keith Hiscock) \nKeith took his first photos with a very basic camera hired from Ilfracombe dive club at two shillings a dive. \nHe took a step up as a student at Westfield College University of London, persuading the technicians to build him a Perspex camera housing in 1972. \n“Up to the mid-1970s knowledge of the seas was very sparse,” he says. “We didn’t know what was down there.” \nEven today Britain’s shallow seas are a mysterious domain. Thanks to David Attenborough, most people may know more about life on a coral reef than they do about the seabed on their own doorstep. \nIn spite of the growing popularity of scuba diving, most people only venture beneath the waves on their sunshine holidays. Read More Devon is officially one of the most vegan-friendly places in the UK \nDiving in UK waters may be expensive and challenging, but it’s well worth it, he says. The water is cold, and visibility is sometimes so poor you can barely see you own feet. But, as his book shows, when conditions are right Britain’s marine life is every bit as interesting as the world of the coral seas. \nDr Hiscock, now an associate fellow of the Marine Biological Association (MBA) in Plymouth, is a leading marine ecologist and conservation scientist. He headed up the Marine Nature Conservation Review of Great Britain from 1987 to 1998. \n“Our aim was to increase knowledge of the shallow inshore waters,” he says. The review’s work was used as the basis for creating marine conservation zones around our coasts. \nWhen that work came to an end, he headed back to the Westcountry to set up MarLIN, the Marine Life Information Network at the MBA. MarLIN provides information to support marine conservation, management and planning. Kelp and jewel anemones at the Eddystone reef (Image: Keith Hiscock) \nEvery question answered in science creates five questions more, and five decades spent studying the seas hasn’t answered all of Keith’s questions. Read More Owners praised for not going into water after dog that drowned \n“In some ways the sea hasn’t changed at all,” he says. “I go back to sites I was diving in the 1970s and it’s just the same. \n“But there are places like Lundy where the number of species has reduced since the 1980s. No one knows the cause. Everything possible has been done to prevent any human damage and interference.” \nLundy Island, in the Bristol Channel and visible from the rocky cliffs west of Ilfracombe, was designated as a Marine Conservation Zone in 2013 to protect the spiny lobsters found here. Spiny lobsters are one of those mysteries marine biologists still need to solve. \n“I hadn’t seen a spiny lobster in 15 years after I came to Plymouth, even though I do about 60 dives a year,” Keith says. “But all of a sudden they’ve come back since 2014, and now people are seeing as many as 20 in a dive.” \nThe marine environment is no stranger to boom and bust, driven by a range of factors from overfishing to changing temperatures. “You get a species doing well for five years, and then it spends the next 40 years in decline.” Read More Many thousands of plastic 'nurdles' have washed up on Dawlish Warren beach \nThe return of the spiny lobster may be simply the result of a “perfect storm” – the right food, water conditions and currents sweeping the tiny larvae north from Brittany. Or it may be none of those: sometimes it seems we know more about the surface of the Moon than we do about the seas. A variable blenny at Firestone Bay in Plymouth Sound (Image: Keith Hiscock) \nIf the underwater world seems alien to you, Dr Hiscock’s book will do little to dispel that impression. The spiny lobster larval stage looks more like an ill-conceived spider with too many legs than a tasty seafood meal. \nOne of my favourite images is the tiny, colourful anemone shrimp nestled in the tentacles of a snakelocks anemone. \nThese anemones, familiar to every child who has explored a rock pool, rely for their survival on symbiotic algae found in their tissues. Like any plant, the algae need light to flourish, so the snakelocks sticks to the sunniest pools and even turns it tentacles to seek out the light. \nLike Dr Hiscock, many of us never grow out of our rock-pooling enthusiasm, even if we haven’t followed the same career path he has. Read More Wildlife trust confirms death of Devon beaver - thought to be first ever killed on roads in Britain \nNow, though, we can do our bit – whether exploring the rocks at the beach or learning to scuba dive. The MBA website (mba.ac.uk/recording) welcomes sealife spotters and Seasearch (seasearch.org.uk) is a project for volunteer sports divers who have an interest in what they're seeing under water, want to learn more and want to help protect the marine environment. \nIf your eyes are sharp enough, perhaps you’ll make your mark in the history books. In 1969 Dr Hiscock, diving at Lundy, found the first UK specimen of the beautifully named sunset cup coral. Keith Hiscock's new book \nHis book will be a good companion for those interested in natural history, for students starting a course in marine biology, and as a coffee-table book for divers. It is packed with beautiful photos and a wealth of accurate information. \nUnderstanding the seabed is intensely practical. The marine environment has a very tangible economic value for the food it delivers and the recreational uses it provides. Read More Devon man captures stunning never-before-pictured shark-nado \nFishermen may rail against quotas and restrictions, but Dr Hiscock says that two EU measures in particular have had a big impact: the Water Framework Directive and the Marine Strategy Framework Directive \n“The UK Government needs to make a commitment to continue with implementing those directives after Brexit,” he says. “They are accepted as having made enormous improvements to our aquatic environment.” \nThe first forced Britain to “clean up its act” – though moving most of our heavy industry to China also helped. \nThe book \nExploring Britain’s Hidden World by Dr Keith Hiscock is available from bookshops, wildnaturepress.com or Amazon . \nKeith Hiscock has been chairman of the Lundy Field Society since 2008 and is currently chairman of Plymouth Sound Branch of the BSAC . He has featured in several television programmes that were shot underwater as what he describes as the ‘local yokel’. Like us on Facebook", "external_links": [], "published": "2018-04-12T19:34:00.000+03:00", "crawled": "2018-04-12T19:49:42.005+03:00", "highlightTitle": ""}