{"organizations": [], "uuid": "e0fe5f871544a45c0def49858dc96aa2bd4ec5d5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article12600355.ece/ALTERNATES/s1200/JS109334833.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14501201", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast RECAP: Rolls-Royce sells technology firm L'Orange to US firm", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-04-09T10:30:00.000+03:00", "replies_count": 0, "uuid": "e0fe5f871544a45c0def49858dc96aa2bd4ec5d5"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14501201", "ord_in_thread": 0, "title": "Business Breakfast RECAP: Rolls-Royce sells technology firm L'Orange to US firm", "locations": [], "entities": {"persons": [], "locations": [{"name": "newcastle", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "elswick", "sentiment": "none"}, {"name": "elswick road", "sentiment": "none"}, {"name": "solihull", "sentiment": "none"}], "organizations": [{"name": "rolls-royce", "sentiment": "negative"}, {"name": "coreena ford developers dwell newcastle ltd", "sentiment": "negative"}, {"name": "newcastle", "sentiment": "none"}, {"name": "liberty court", "sentiment": "none"}, {"name": "newcastle ltd", "sentiment": "none"}, {"name": "interior", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford Developers Dwell Newcastle Ltd in bid to bring students back to Newcastle suburb \nA suburban student housing building which has lain empty for months following the advent of newer, modern schemes in the city centre is set for a revamp in a bid to bring it back into use. \nThe Grade II listed Liberty Court building in Elswick, Newcastle, was converted from offices and flats into a student housing scheme in 1992, but property agents say its location away from the city centre and its outdated layout have led to it being vacant for some time. \nNow Dwell Newcastle Ltd, a Solihull business with student housing interests all over the country, has applied for the building at 80-88 Elswick Road to undergo a radical makeover as part of plans to give it new life and entice in student tenants. \nA design statement submitted on behalf of the firms says it wants to reconfigure the interior, which currently has 72 bed spaces in 14 clusters, with shared lounges, kitchens and bathrooms. \nToday’s students prefer to live in studio-style apartments, so Liberty Court could be altered into a series of one and two-bedroom apartments, still providing a total of 72 beds, with a renewed contemporary makeover for the interior retaining and showing off period features. Liberty Court in Newcastle which could be converted into student rooms (Image: Newcastle City Council planning portal) 9.10 Coreena Ford Hiring intentions at record high \nImprovements in manufacturing and services output has put the economy in a strong position, leading to record levels of recruitment, according to a study. Research by business advisers BDO LLP showed that firms were investing in taking on staff during a period of low wage growth. \nEasing inflation and a better domestic economic outlook also boosted both sectors, said the report. \nPeter Hemington of BDO LLP said: “The performance of both the manufacturing and services sectors is encouraging for the health of the UK economy and the data suggest that there will be an improvement in GDP growth over the next few months. \n“Businesses are retaining a positive outlook, and this may add to the pressure that the monetary policy committee feels to raise rates. \n“But the recovery remains patchy and febrile with Brexit looming. The MPC (the Bank of England’s Monetary Policy Committee) must hold fast and keep interest rates to a minimum to encourage confidence and growth for UK businesses.” (Image: Frank Recruitment Group) Coreena Ford Deal flurry lifts first quarter M&As to 10-year high \nThe UK has chalked up its strongest first quarter for mergers and acquisitions (M&A) in 10 years after businesses signed off 120 billion (£85 billion) worth of deals. \nA total of 681 deals were secured between January and March, with telecoms, automobile and healthcare proving the hottest sectors for transactions, according to research by EY. \nThe result comfortably outstrips the final three months of last year when firms sealed 586 deals, worth 51 billion (£36 billion). However, it falls short of the 147 billion (£104 billion) and 1,045 transactions seen in the first three months of 2007. \nDespite fears that Brexit uncertainty would put M&A on the back burner, GlaxoSmithKline and Novartis, GKN and Melrose, and UBM and Informa all announced tie-ups between January and March this year. \nSteve Ivermee, EY’s managing partner for UK and Ireland transaction advisory services, said: \nThe UK deals market has experienced a very healthy start to the year as UK companies with presence in international markets remain particularly attractive to international investors. \nMore significantly, we see UK businesses continuing to make deals internationally. The significant increase in inbound transactions is likely to lead to a new environment for M&A and deal makers. GKN's takeover by Melrose was among the leading M&As 9.02 Coreena Ford Brexit remains biggest risk for UK economy, study finds \nFinancial services firms are worried about prospects for the UK economy, with Brexit remaining the biggest risk, a study shows. \nResearch by Lloyds Bank found that executives in the sector believe growth in this country will be outpaced by all other nations in the G7 this year. Despite the findings from a survey of over 100 boardroom and senior executives, most expect the UK economy to remain resilient. Robina Barker Bennett of Lloyds Bank Commercial Banking said: “As the biggest industry in the UK, the financial services sector is a crucial bellwether for the nation’s economic prospects. “Fears about Brexit are looming large as the final countdown begins to March 2019, but our survey suggests that the UK economy will prove to be resilient and that it will come through the challenges of the next few months relatively unscathed. \n“There is, however, a real risk that our growth will be slower this year than in all other advanced nations; and that we will fall to the back of the G7 pack.” The London skyline KEY EVENT Plans to improve Newcastle's Christmas outlined by business group NE1 \nThe body tasked with improving Newcastle city centre as a place to do business is working up plans to exploit the city’s riverfront and to improve its Christmas celebrations. \nBusiness improvement district NE1 has been in operation for almost a decade, introducing a number of initiatives that have helped to boost the city’s centre economy. \nThe organisation - which levies money from companies in the city centre to spend on projects that bring more people into the area - is set to face its second five-year renewal vote among its members later this year. \nA consultation document on what NE1 plans to do will be issued in May, but the body’s new chief executive has pinpointed the river and the festive period as two areas that can bring more trade into Newcastle. Festive lights on Northumberland Street, Newcastle, Christmas 1987 8.51 KEY EVENT Deutsche Bank sacks CEO John Cryan after less than three years \nDeutsche Bank has ousted its UK chief executive John Cryan, who grew up in the North East, after less than three years in post. \nThe German giant’s supervisory board said they wanted a “new execution dynamic” in the top team as they announced he will be replaced by retail arm chief Christian Sewing. \nHarrogate-born John Cryan, 57, who became co-chief executive of Deutsche Bank in July 2015, will leave at the end of the month. \nThe Cambridge graduate, who grew up in Sunderland, moved to shrink the bank’s global ambitions by axing jobs and closing branches following his appointment. \nBut he could not effectively arrest the bank’s slide, which has been compounded by billions of pounds in regulatory fines and the financial fallout of low interest rates in recent years. \nThe son of a jazz musician, German-speaking Mr Cryan joined the Frankfurt-based lender after stints at Swiss bank UBS and wealth fund Temasek. \nHe is said to have rejected the corporate flamboyance of his predecessors, preferring scheduled flights to private jets. \nIncoming CEO Christian Sewing, who has worked at the bank for almost 30 years, thanked Mr Cryan for his “enormous contribution” during an “extremely difficult period”. \nLast year, the German banking giant signed a 25-year lease for its new City headquarters despite warnings it may move staff and assets to Frankfurt in light of Brexit. \nMr Cryan took home a base salary of 3.8 million euro (£3.3 million) in 2017 - but did not receive a bonus for the second year in a row. John Cryan, former CEO of Deutsche Bank 8.45 Coreena Ford Ex BHS owner Dominic Chappell plans to sue Philip Green \nFormer BHS owner Dominic Chappell plans to sue Sir Philip Green and contest a proposed boardroom ban in a bid to repair his “tarnished reputation” and resurrect his career. \nThe thrice-bankrupt businessman has lashed out at Insolvency Service plans to stop him from serving as a company director while taking no action against Sir Philip, saying the authority has “not got the guts to go after Green”. \nHe claims the Government agency’s findings were at odds with parliamentary inquiries by business and pension committees that pinned BHS’ collapse on the billionaire tycoon. \nMr Chappell, who bought BHS from Sir Philip for £1 in 2015, said he had notified the agency that he would fight their proceedings, which could see him disqualified from serving as a company director for 15 years. \nHis rebuke came as he vowed to drag Sir Philip into the courtroom over the demise of the department store chain, and was laying the groundwork for legal action before the summer. Dominic Chappell, the man who bought BHS for £1 from Sir Philip Green (Image: PA Wire) 8.41 Coreena Ford Mike Ashley's Sports Direct snaps up prime Newcastle city centre property \nMike Ashley’s retail empire Sports Direct is believed to have snapped up a prime piece of Newcastle city centre property as part of expansion plans. \nThe firm is reported to have completed a deal to buy a 90,000sqft building at 36-40 Northumberland Street, which is currently home to H&M and WHSmith. \nSports Direct has acquired the sizeable property in a deal with Aberdeen Standard Investments, but one big chunk of the building has lain empty for the last year, having previously been leased to Swedish retailer Clas Ohlson until it closed with the loss of 18 jobs. \nWhether this signals plans by the retailer to move are not known - but it already owns a large store close by on Northumberland Street. \nThe value of the deal has not been disclosed and it is not known how long remains on the existing tenants’ leases. \nSports Direct has reportedly said the purchase is aligned with its medium- to long-term “elevation strategy”, under which it plans to invest in excess of £300m a year in property assets and open 10 to 20 new stores this year. The building on Northumberland Street that Mike Ashley's Sports Direct is said to have snapped up (Image: staff photo) 8.35 Stock market latest \nThe FTSE-100 index opened at 7183.64. \nThe pound at 8am was 1.4100 dollars compared to 1.4088 dollars at the previous close. The euro at 8am was 0.8706 pounds compared to 0.8713 pounds at the previous close. \nThe Japanese Nikkei 225 opened down 0.15% at 21534.33 points, compared to Friday’s close at 21567.52, while the Australian ASX All Ordinaries was down 0.08% in early trading. Hong Kong’s Hang Seng opened up 0.87% at 30104.32 points, compared to Friday’s close at 29844.94, while the Shanghai SE Composite Index in China opened down 0.18% at 3125.44 points. An information screen displaying the FTSE 100 at the London Stock Exchange (Image: PA) 8.34 Coreena Ford Rathbone Brothers confirms takeover talks with Glasgow firm \nWealth manager Rathbone Brothers is locked in takeover talks with Glasgow-based investment manager Speirs and Jeffrey over a potential £200m deal. \nThe group confirmed the possible tie-up in a London Stock Exchange announcement, but said no binding offer had been made and there was “no certainty” a deal would be done. \nLondon-based Rathbone revealed its interest following a report in the Sunday Telegraph, which claimed private equity firm Permira was also weighing a bid for Speirs and Jeffrey. \nSuch a move would line up Rathbone and Permira for their second head-to-head battle in less than a year. \nThe sale of Speirs and Jeffrey could land its 10 partners a cash windfall of £10m each, according to reports. 8.30 Coreena Ford Engine maker Rolls-Royce to sell L'Orange \nEngine maker Rolls-Royce has taken further steps to shore up its balance sheet by offloading fuel injection technology firm L’Orange to America’s Woodward in a £610m deal. \nThe sale of L’Orange - a subsidiary of Rolls-Royce Power Systems - has been backed by the boards of both companies and is expected to be sealed by the end of the second quarter, 2018. \nThe move will help “improve the resilience” of the balance sheet and stump up extra capital “to pursue opportunities that will drive greater returns”, Rolls-Royce said. \nL’Orange employs around 1,000 staff and is based in Stuttgart, Germany, with operations in the US and China. \nIt makes fuel injection products for areas such as marine power and propulsion systems and special-application vehicles. The operation secured sales of 244 million euros (£212m) last year. \nRolls-Royce chief executive Warren East said: “This transaction builds on the actions we have taken over the last two years to simplify our business. \n“The divestiture of L’Orange enables Rolls-Royce Power Systems to focus on other long-term, high growth opportunities and our company to allocate our capital to core technologies and businesses that drive greater returns for the group.” \nColorado-based Woodward designs and manufactures control systems and components for the aerospace and industrial sectors. If it wins the backing of regulators, the combined firm will be named Woodward L’Orange and will join Woodward’s industrial unit. The famous Rolls-Royce Spirit of Ecstasy bonnet ornament More On", "external_links": [], "published": "2018-04-09T10:30:00.000+03:00", "crawled": "2018-04-09T13:28:34.000+03:00", "highlightTitle": ""}