{"organizations": [], "uuid": "a7e6b02dc86b02145ce80d4639bc93c08390cda7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article361724.ece/ALTERNATES/s1200/Anne-Marie-Morris.jpg", "site_section": "http://www.westernmorningnews.co.uk/editorschoices.rss", "section_title": "devonlive - frontpage", "url": "https://www.devonlive.com/news/news-opinion/major-opportunity-leaving-eu-withdrawal-1413051", "country": "GB", "title": "A major opportunity in leaving the EU is withdrawal from the Common Fisheries Policy", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-04-03T15:47:00.000+03:00", "replies_count": 0, "uuid": "a7e6b02dc86b02145ce80d4639bc93c08390cda7"}, "author": "Anne Marie Morris", "url": "https://www.devonlive.com/news/news-opinion/major-opportunity-leaving-eu-withdrawal-1413051", "ord_in_thread": 0, "title": "A major opportunity in leaving the EU is withdrawal from the Common Fisheries Policy", "locations": [], "entities": {"persons": [{"name": "anne marie morris", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "common fisheries policy news", "sentiment": "none"}, {"name": "newton", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News opinion A major opportunity in leaving the EU is withdrawal from the Common Fisheries Policy I share the disappointment of the fishing industry that the UK will remain part of the Common Fisheries Policy (CFP), without a direct say in its rules, until the end of 2020. Share Click to play Tap to play The video will start in 8 Cancel Play now Get     ANNE MARIE MORRIS IS THE CONSERVATIVE MP FOR NEWTON ABBOT AND HAS BEEN SINCE 2010 \nThe Transition Agreement \nNegotiations for the transition agreement ended last month with positive confirmation of the UK being able to negotiate, sign and ratify its own trade deals during the transition period and guarantees on the reciprocal rights of UK expats and EU citizens in the UK. However, I share the disappointment of the fishing industry that the UK will remain part of the Common Fisheries Policy (CFP), without a direct say in its rules, until the end of 2020. \nAt the conclusion of negotiations with the EU over the Brexit transition period, it was agreed that fishing opportunities throughout this period would continue to be negotiated with the EU under the CFP. The Government agreed to be “consulted” on arrangements, with the EU continuing to set quotas. The EU has sought to keep the current system as long as possible as it unfairly disadvantages the UK. Anne Marie Morris MP \nA major opportunity in leaving the EU is withdrawal from the CFP, which currently allows all European vessels to fish between 12 and 200 nautical miles of the UK and sets quotas for how much fish each nation can catch. The Government has also served notice to withdraw from the earlier 1964 London Fisheries Convention, which allows vessels from five European countries to fish within six and 12 nautical miles of the UK’s coastline. Read More We're committed to tackling modern slavery in Devon and Cornwall \nThe CFP has had a profoundly negative impact on both the UK’s coastal communities and on the sustainability of our fish stocks. Over the period of our membership, the UK catch declined from over 1.1 million tonnes a year to 700,000. The CFP’s quota system has struggled to recognise and accommodate the South West’s mixed fishery and the total allowable catch has long been unfairly weighted against the British fishing fleet. In recent years, up to 60% of the fish and shellfish landed from UK waters were caught by boats from other EU countries. EU vessels now catch 650,000 tons of fish in UK waters while UK vessels catch only 90,000 tons in non-UK EU waters in return. \nFuture UK Fisheries Policy \nIn December 2020, we will be negotiating fishing opportunities as a third country and independent coastal state—deciding who can access our waters and on what terms for the first time in over 40 years. The Government will bring forward a Fisheries Bill in this Parliamentary session, allowing the UK to take back control of access to UK waters and the allocation of fishing opportunities (either through quota or days at sea) after the transition period ends. Access to fish in UK waters will then be a matter for negotiation and will be on terms the UK decides. Anne Marie Morris MP \nThe values at the heart of our new fisheries policy should be conservation of the environment and fish stocks and restoration of the right for UK vessels to catch and land UK fish. The UK should have complete control of all fishing activity within our Exclusive Economic Zone. As other North Atlantic maritime states do, we should negotiate reciprocal access of our waters to non-UK vessels. Fishing requires internationally agreed management of fleets, vessels, catches and sustainability, however, any access granted must be limited and without future obligation. The UK should seek beneficial access arrangements but avoid another ridged, damaging agreement like the CFP. Read More Brexit is an opportunity to improve and invest in the skills of our domestic workforce \nOur post-Brexit fisheries policy needs to work for our coastal communities and have a sustainable approach at its core. The UK should nurture its own world class fishing fleet and lead in environmental standards. There has been an historical neglect not just of the fishing industry, but of coastal communities. We now have an opportunity to nearly double the size of our fishing industry to the benefit of the UK’s economy and cultural heritage. We can help rebuild our valuable inshore fishing fleet. We should start the work of revitalising all our coastal communities throughout the UK by championing a truly independent UK fishing policy. Like us on Facebook", "external_links": [], "published": "2018-04-03T15:47:00.000+03:00", "crawled": "2018-04-03T15:59:25.034+03:00", "highlightTitle": ""}