{"organizations": [], "uuid": "a6ec9078ffe8211758efba967ff7d4a6d28126b0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article11521046.ece/ALTERNATES/s1200/JS66574798.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/passports-could-made-europe-far-14551828", "country": "GB", "domain_rank": 21960, "title": "Passports 'could be made in Europe or Far East' after De La Rue abandons legal challenge", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-04-19T23:00:00.000+03:00", "replies_count": 0, "uuid": "a6ec9078ffe8211758efba967ff7d4a6d28126b0"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/passports-could-made-europe-far-14551828", "ord_in_thread": 0, "title": "Passports 'could be made in Europe or Far East' after De La Rue abandons legal challenge", "locations": [], "entities": {"persons": [{"name": "ian mearns", "sentiment": "none"}, {"name": "amber rudd", "sentiment": "none"}, {"name": "katie", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "far east", "sentiment": "none"}, {"name": "invalid email  eastern europe", "sentiment": "none"}, {"name": "team valle", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "de la rue", "sentiment": "negative"}, {"name": "gemalto", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Passports 'could be made in Europe or Far East' after De La Rue abandons legal challenge Gateshead MP Ian Mearns is asking for a full explanation Share A British passport (Image: Katie Collins/PA Wire) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nEastern Europe and the Far East have been touted as locations where post-Brexit UK passports could be produced, the Commons has heard. \nLabour’s Ian Mearns expressed frustration at British firm De La Rue appearing to have “thrown in the towel” by not appealing against the Government’s controversial move to hand the £490 million contract to Franco-Dutch company Gemalto. \nThe Gateshead MP said the company has examined the successful bid and has suggested the cost means British passports post-2020 could be “mainly produced in eastern Europe or in the Far East”. \nHis claim emerged as he called on Home Secretary Amber Rudd to appear before MPs to explain where and how passports will be produced under the new contract. The De la Rue plant in the Team Valley (Image: newcastle chronicle) \nShares in De La Rue dropped and the firm also issued a warning over profits after announcing it would not challenge the decision, blaming the £4 million in bid costs for the contracts. \nTrade union Unite said it was a “dark day for UK manufacturing”, with the loss of the contract coming as a blow to De La Rue’s passport printing factory in Gateshead. \nThe Government claims the new deal will save £120 million during the lifetime of the eleven-and-a-half year contract, with personal data for each passport holder added in the UK. \nSpeaking in the Commons, Mr Mearns said: “I’d like a statement from the Home Secretary about exactly where and how our passports will be produced post-2020. Ian Mearns (Image: Newcastle Chronicle) \n“De La Rue has done an awful lot of work looking at the bids put in by Gemalto and Thales, and it seems to them - and probably to me, I think - that it looks very likely that the costs which have been provided (means) our passports post-2020 will probably be produced, or mainly produced, in eastern Europe or in the Far East. \n“That is not a satisfactory situation for the UK passport post-Brexit , and for an independent nation, proud of itself, to have its passport produced far and far away.” \nCommons Leader Andrea Leadsom replied: “He will appreciate De La Rue actually prints passports and does security documents and money for countries right across the world. \n“The UK, as we seek to leave the EU, will be a global champion for free trade. \n“So it can’t only be one-sided. We do need to accept that as well as our brilliant UK businesses generating income and profits from overseas, so other businesses must be able to compete in the UK market.” Like us on Facebook", "external_links": [], "published": "2018-04-19T23:00:00.000+03:00", "crawled": "2018-04-20T02:48:02.000+03:00", "highlightTitle": ""}