{"organizations": [], "uuid": "4bcc4d9ca6a62b22129800ce05c518b2956254b2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/whats-on/article1464050.ece/ALTERNATES/s1200/LPB-2jpeg.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "devonlive - frontpage", "url": "https://www.devonlive.com/whats-on/food-drink/inside-story-how-la-petite-1480291", "country": "GB", "title": "The inside story as to how La Petite Bouchée grew from a small campervan to one of Devon's most talked about restaurants", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-04-20T13:22:00.000+03:00", "replies_count": 0, "uuid": "4bcc4d9ca6a62b22129800ce05c518b2956254b2"}, "author": "Richard Amofa", "url": "https://www.devonlive.com/whats-on/food-drink/inside-story-how-la-petite-1480291", "ord_in_thread": 0, "title": "The inside story as to how La Petite Bouchée grew from a small campervan to one of Devon's most talked about restaurants", "locations": [], "entities": {"persons": [{"name": "devon", "sentiment": "none"}, {"name": "justin rose", "sentiment": "none"}, {"name": "ed sheeran", "sentiment": "none"}, {"name": "sergio garcia", "sentiment": "none"}, {"name": "anita-clare field", "sentiment": "none"}, {"name": "richard amofa", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "nathan outlaw", "sentiment": "none"}], "locations": [{"name": "devon", "sentiment": "none"}, {"name": "north devon", "sentiment": "none"}, {"name": "anita-clare field", "sentiment": "none"}, {"name": "witheridge", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "dubai", "sentiment": "none"}], "organizations": [{"name": "onedevon podcast", "sentiment": "none"}, {"name": "la petite bouchee", "sentiment": "none"}, {"name": "le petite bouchée", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The inside story as to how La Petite Bouchée grew from a small campervan to one of Devon's most talked about restaurants La Petite Bouchée, based in Witheridge, is already one of Devon's most popular venues La Petite Bouchée The French eatery is a very popular venue in Devon (Image: Richard Amofa) Share Get Daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nA lot can change in a year. \nBritain's Prime Minister Theresa May emerged from 10 Downing Street to announce a snap election, while Sergio Garcia won his first major golf title at his 74th attempt with a thrilling play-off victory over England's Justin Rose at the Masters. \nMeanwhile, Ed Sheeran’s ‘Shape of You’ was number one in the charts. \n'King of Fish' Nathan Outlaw tells the OneDevon Podcast all about his future plans, Dubai and why he's backing fishermen over Brexit deal Anita-Clare Field, owner of award-winning venue La Petite Bouchee (Image: TheChefsForum) \nIt was also a time when Anita-Clare Field was putting the finishing touches on her restaurant, Le Petite Bouchée. \nBased in Witheridge, North Devon , the restaurant already has a strong reputation and has even drawn praise from two-star Michelin chef Michel Roux Jr when the venue featured on Channel Four show, Hidden Restaurants. \nHe said: \"Anita's clear vision and attention to detail, from the surroundings to the food has created the perfect experience for her diners and it's something every hidden restaurant can learn from, including mine.” What is the OneDevon Podcast? \nThe new OneDevon Podcast features everything What’s On in Devon including food, entertainment, culture and much more. \nWe’ll be speaking to the people who make our county tick, such as the chefs inside Devon’s best restaurants and the individuals behind the events that everyone’s talking about. \nListen to episode, here . \nThat was just another high point in a journey that began in 2014 for Ms Field after the purchase of a 1971 Citroen HY in 2014 when she was based in London. \nShe said: “We'd been watching George Clark Amazing spaces and had serious Citroen HY Van envy. \n“We bought Demelza our campervan purely by chance. \n“Our friend Rachel alerted us that someone she knew was selling one. It was a camper van, though. We looked at some pictures, fell in love with the colour and by 4pm we owned her. \n“She was in Bude and so she was transported back to London on a low loader by our wonderful friend Jerry, two weeks after we got married. \n“I am a terrible insomniac and I’d been thinking about what we could do with her for a few days and that particular night, 3.00am I woke Caroline up and said: \" I can see red-checked table cloths and Moules Pots. I think we should turn her into a little brasserie.” \n“Caroline fortunately thought it was a great idea and named the 'idea' La Petite Bouchée or The small Mouthful. Le Petite Bouchée used to function from inside the campavan - and it instantly became a big hit in London before it came to Devon (Image: Richard Amofa) \n“We talked for hours about it and by dawn there was a URL, twitter and Facebook page. We thought about how we would like her to look and our wonderful builder set about restoring and painting her. “She basically looks like a miniature French Brasserie right down to the chequer-board floor and the full length gilded mirror.” \nThe business was born and quickly grew in popularity from its base at Sydenham Wells Park in South London. \nAs there was no electricity and no running water, the van was powered by lots of battery operated lights and gallons of bottled water. \nAfter three years of successful trading, however, Ms Clare decided to make the move to Devon. Read More The best 19 beer gardens in Devon where you can enjoy the glorious weather \n“I have lived in London most of my life. When I met Caroline she'd been living in Somerset for most of her adult life. She came up to London, to be with me,” Ms Field said. \n“I didn't want to leave because my mother was terminally ill and we didn't know how much longer we had. \n“She died in November 2015 and in the spring of 2016 a bit of a 'kick up the backside' prompted me to have the conversation with Caroline. Where it all began: The 1971 Citroen HY campavan which ms Field bought in 2014 (Image: Richard Amofa) \n“She was delighted at the prospect of moving back to the West Country and we plumped for Devon because we both love it so much. \n“Everyone says \"Why Witheridge?\" \n“It wasn't really about the village, it was about the house. Caroline loved it from the minute she saw it and after a bit of arm twisting I came down to look. I walked through the front door and was overwhelmed by the warmth and the love which poured from every wall. \n“It reminded me so much of the feeling I got in my parents’ home. I knew instantly that we had to buy it.” \nThe restaurant operates with an admirable no waste policy and visitors have to submit their menu choices in advance of their visit. \nAdditionally, they can also get doggy bags to take home if they can’t visit their meals there and then. \nThe restaurant is quintessentially French, both in design and in cuisine, taking full advantage of the array of produce in North Devon and its surrounding areas. \n“I love French Food and there's something for everyone,” Ms Field said. Outside the 'La Petite Bouchee' restaurant \n“The type of French cuisine we serve at La Petite Bouchée is just good honest brasserie food packed with flavour using the freshest ingredients from Devon's very abundant larder. \n“We try to stay true to our French roots but there are often little twists here and there. \n“We're introducing some French old world dishes this year too. Our Vegetable Tagine was a huge hit. We're already planning some Vietnamese summer rolls for later this year when are all the herbs and vegetables we're growing are ready to harvest.” \nShe added: “For year two we’re just looking to build on our successes. \n“It’s an uncertain climate for restaurants so this is a big achievement, and there will be a lot of corks popped at our birthday party on May 5. \n“As for the future, we have got lots of plans in the pipeline. Watch this space.” Read More What’s the food like at La Petite Bouchee? \nIt’s a small restaurant that offers big flavours. \nCompact in its nature, the tables are very close together, instantly exuding a warm vibrancy in the room to the point where it feels like you’re at a family dinner. \nIt does allow for some intimacy, but the social set up means that it doesn’t feel too intrusive when the person on the table next to you asks you about the meal you’re having. \nFor the starter I had grilled asparagus wrapped in Bayonne ham and served with homemade aioli . Grilled asparagus wrapped in Bayonne ham and served with homemade aioli - an excellent starter (Image: Richard Amofa) \nThe asparagus had a fresh, earthy feel. I was pleased that this vegetable was chosen as it has a unique ability to blend well with many other flavours – and it was no different here. \nThe cured ham was excellent and left me craving more, while the homemade aioli was prolifically piquant and very pleasant indeed. \nIt was very bringing the South of France to Devon in a brilliant way. \nThe main was Steak Frites served with homemade béarnaise sauce. Main: Steak Frites served with homemade Béarnaise sauce (Image: Richard Amofa) \nI can see everyone now heavily alarmed by the minimal amount of chips on my plate. Don’t worry, this isn’t an official portion size, it was a mere handful from what was a deep sharing bowl. The flank steak was lightly seasoned, bringing out the best of its natural flavours (Image: Richard Amofa) \nThe steak was of amply size, anyway. \nAlso known as bavette, the flank steak was thick, juicy and was subtly marinated to bring out the best of its natural flavours that really flourished on this occasion. Read More ", "external_links": [], "published": "2018-04-20T13:22:00.000+03:00", "crawled": "2018-04-20T13:27:22.019+03:00", "highlightTitle": ""}