{"organizations": [], "uuid": "84752f4b09da4baeb60ded09a98392e685fa4320", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14530664.ece/ALTERNATES/s1200/Kim-Kimberley-Blackstar-UKIP-candidate-for-Newcastles-Kingston-Park-South-and-Newbiggin-Hall-Face.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/newcastle-ukip-election-candidate-says-14530579", "country": "GB", "domain_rank": 21960, "title": "Newcastle UKIP election candidate says Muslims are a 'barbaric satanic cult'", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-04-14T14:37:00.000+03:00", "replies_count": 0, "uuid": "84752f4b09da4baeb60ded09a98392e685fa4320"}, "author": "Lisa Hutchinson", "url": "https://www.chroniclelive.co.uk/news/north-east-news/newcastle-ukip-election-candidate-says-14530579", "ord_in_thread": 0, "title": "Newcastle UKIP election candidate says Muslims are a 'barbaric satanic cult'", "locations": [], "entities": {"persons": [{"name": "kim kimberley-blac", "sentiment": "negative"}, {"name": "muslims", "sentiment": "negative"}, {"name": "kimberley-blackstar", "sentiment": "none"}, {"name": "kim kimberley-blackstar", "sentiment": "none"}, {"name": "gina miller", "sentiment": "none"}, {"name": "tony sanderson", "sentiment": "none"}], "locations": [{"name": "newbiggin hall", "sentiment": "none"}, {"name": "trafalgar square", "sentiment": "none"}, {"name": "kingston park south", "sentiment": "none"}], "organizations": [{"name": "newcastle ukip", "sentiment": "negative"}, {"name": "ukip", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Newcastle UKIP election candidate says Muslims are a 'barbaric satanic cult' Kim Kimberley-Blackstar, UKIP candidate for Kingston Park South and Newbiggin Hall, made the claim on his Facebook page Share Kim Kimberley-Blackstar, UKIP candidate for Newcastle's Kingston Park South and Newbiggin Hall, Facebook comments (Image: Facebook) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nA Newcastle UKIP election candidate has called Islam a “barbaric satanic cult”, and said he would “never trust a Muslim”. \nKim Kimberley-Blackstar has also suggested the Queen should have Brexit legal challenger Gina Miller “hanging from Trafalgar Square by the neck”. \nMr Kimberley-Blackstar, candidate in Kingston Park South and Newbiggin Hall, has declined to comment on the social media posts. \nBut his agent, Tony Sanderson, said the remarks, mostly from 2016, were “historic and do not represent the true views of the candidate”. Kim Kimberley-Blackstar, UKIP candidate for Newcastle's Kingston Park South and Newbiggin Hall, Facebook comments (Image: Facebook) \nThe Facebook page “has now been removed and we feel that no further action need be taken”, said Mr Sanderson. \nThe Newcastle UKIP candidate’s comments on other people’s posts are still online, although some of his posts have been removed. \nCommenting on a Facebook post about Brexit, Mr Kimberley-Blackstar suggested the Queen should call in her forces to “blow up all the mosques, nuke Jerusalem, The Vatican, Mecca & Brussels and lets [sic] invade and get our empire back”. \nHe also joined Facebook groups including Anarchists Against Islam, Britain Vs The Migrant Invasion and The Real British Folks Against Islam And The Rest Who Threaten Our Land. Kim Kimberley-Blackstar, UKIP candidate for Newcastle's Kingston Park South and Newbiggin Hall, Facebook comments (Image: Facebook) \nHe expressed support for a ban on Muslim immigration and suggested those who “don’t like our country... should be deported or exiled”. \nResponding to a post about a Muslim man being forced off a London tube train he said, if worried, it would be “better to get him off than get blown up”. \n“Muslims have brought this on themselves,” he posted. \nIn 2016 Mr Kimberley-Blackstar expressed the hope that, if Donald Trump became president, London mayor Sadiq Khan would be the CIA’s “first target”. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nHe has also said halal and kosher food should be banned. \nUKIP Gateshead and Newcastle branch chairman Mr Sanderson said: “It is not and never will be UKIP policy to blow up mosques, nuke the Vatican, or hang people from lamp-posts, nor to ban halal or kosher food, though we certainly insist that it should be clearly labelled so that customers know whether to avoid it.” \nMr Blackstar, who is also known as Camaro Kimberley-Blackstar, has Facebook profiles in both names. \nHe sent a message to the North East English Defence League saying it was “always handy to have a 2nd FB page in case FB ban you from your original one”. \nA Newcastle City Council spokesman said: “If anyone is unhappy about any element of the local elections, including candidates, they can make a complaint to the returning officer who will forward the complaint to Northumbria Police .” \nThe force said it had not received any complaints about the posts. Like us on Facebook", "external_links": [], "published": "2018-04-14T14:37:00.000+03:00", "crawled": "2018-04-14T16:20:19.007+03:00", "highlightTitle": ""}