{"organizations": [], "uuid": "92c315e129699200673609c743a5a3dc1db6a430", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14586099.ece/ALTERNATES/s1200/IBP_NEC_260418biz_awards_70JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/business-secretary-calls-soft-brexit-14585879", "country": "GB", "domain_rank": 21960, "title": "Business Secretary calls for soft Brexit to protect North East businesses", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-04-27T17:21:00.000+03:00", "replies_count": 0, "uuid": "92c315e129699200673609c743a5a3dc1db6a430"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-news/business-secretary-calls-soft-brexit-14585879", "ord_in_thread": 0, "title": "Business Secretary calls for soft Brexit to protect North East businesses", "locations": [], "entities": {"persons": [{"name": "greg clark", "sentiment": "negative"}, {"name": "brexit", "sentiment": "negative"}, {"name": "clark", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "teesside", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "north east england chamber of commerce", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "journal", "sentiment": "none"}, {"name": "newcastle journal", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Business Secretary calls for soft Brexit to protect North East businesses Greg Clark uses speech to North East Business Awards to say Brexit deal must avoid tariffs and other frictions Share North East Business Awards guest speaker Greg Clark MP (Image: Newcastle Journal)\nBusiness Secretary Greg Clark has used a speech in the North East to call for a soft Brexit that does not hurt businesses in the region.\nMr Clark, who grew up on Teesside, was guest speaker at the North East Business Awards run by The Journal in association with the North East England Chamber of Commerce.\nHe used his address to praise a number of the region’s businesses and also referred to the just-in-time operations which make Nissan’s factory at Sunderland one of the most efficient car plants in the world.\nMr Clark, who campaigned to remain in the EU but has since said his priority is to make the best of the Brexit negotiations , said the country’s arrangements for leaving Europe must not put businesses like those at risk.\nHe was speaking as tensions within the Government over Brexit continue, with pressure from MPs to remain in the Customs’ Union followed by a lacklash from Brexiteers. North East Business Awards at Hardwick Hall Hotel in Sedgefield Guest speaker Greg Clark MP (Image: Newcastle Journal)\nMr Clark said: “Most of the North East’s exports go to countries all across the world but the EU is very important in this.\n“Anyone that knows how important just-in-time production and efficiency of production is could not be in any doubt of the need to make sure that, when we do these negotiations for Brexit, that we establish a trading relationship that has to be not only free of tariffs but free of the frictions that will prevent the successful model, particularly for this region, continuing.\n“This region is an exporting region, it’s a trading region and our future is trading with Europe and the world, not drawing in and retreating to a kind of regional or national self-sufficiency.”\nOn Thursday MPs approved a non-binding motion which called on the Government to include as an objective in Brexit negotiations the option of establishing “an effective customs union” between the UK and EU.\nVery few Brexit-backing MPs attended the debate, which emerged after 10 select committee chairs moved a motion on the issue. The vote has been seen as a purely symbolic victory but raises the pressure ahead of another vote in May.\nDuring his speech at the Business Awards, Mr Clark also praised devolution efforts in the North East, speaking just hours after three North of Tyne councils voted to establish a devolved authority in Newcastle, Northumberland and North Tyneside.\nMr Clark said: “I’ve always felt that decisions about the North East are always better taken in the North East.\n“When power, over decades, moved from the banks of the Tyne, the banks of the Wear and the banks of the Tees to the banks of the Thames, it seemed to me that the great towns and cities of our region lost the prominence they had and they were entitled to.\n“That’s why I’m thrilled that power is at last flowing the other way for the first time in many decades, and we have a new mayor of the Tees Valley who in just one short year has become one of the best known local leaders in Britain. He is working together with local businesses and councils and through the development corporation to make the old SSI plant, one of the best located sites in the whole of Europe, a hive of industries of the future.\n“I’m really encouraged by the news I heard today that devolution is in prospect for the north of the region as well. It’s been too long in coming but when it’s taken up with enthusiasm it will really power the region ahead.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-04-27T17:21:00.000+03:00", "crawled": "2018-04-27T18:35:43.015+03:00", "highlightTitle": ""}