{"organizations": [], "uuid": "3930868b7968b54ede4e16c8610cca08fc76b91c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14587651.ece/ALTERNATES/s1200/CFR_NJL_270917utc_03.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/newcastle-school-praised-governments-blueprint-14587057", "country": "GB", "domain_rank": 21960, "title": "Newcastle school praised in Government's blueprint for future of business", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-04-28T10:00:00.000+03:00", "replies_count": 0, "uuid": "3930868b7968b54ede4e16c8610cca08fc76b91c"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-news/newcastle-school-praised-governments-blueprint-14587057", "ord_in_thread": 0, "title": "Newcastle school praised in Government's blueprint for future of business", "locations": [], "entities": {"persons": [{"name": "dan sydes", "sentiment": "none"}], "locations": [{"name": "stephenson quarter", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "utc", "sentiment": "negative"}, {"name": "newcastle", "sentiment": "negative"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Newcastle school praised in Government's blueprint for future of business North East Futures UTC, which opens in September, has been highlighted in the Government's Industrial Strategy Share A CGI of the North East Futures (Image: UTC) Share\nA new school being built in the North is being used to showcase a key part of the Government’s blueprint for the future of business.\nNorth East Futures UTC, which will open its doors in Newcastle ’s Stephenson Quarter in September, features as a case study within the Industrial Strategy’s Creative Industries: Sector Deal.\nThe Government and the creative industries sector have agreed a Sector Deal to unlock growth for creative businesses, which will invest more than £150m into creative businesses. Dan Sydes, head of North East futures, a new school to open at Stephenson Quarter, Newcastle (Image: Newcastle Chronicle)\nThe case study cites the North East Futures UTC as an “example of regional co-operation between the creative industries and academia.”\nIt also describes work between computer game company Ubisoft, professional services firm Accenture and Sunderland University, which are working with the UTC to develop a curriculum to ensure the school is addressing the skills gap in the IT/digital creative sector.\nNorth East Futures is the only school featured in the strategy document, with the school praised for trying to ensure there are equal opportunities for girls to be inspired by roles in the digital and creative tech sectors. Read More Business Secretary calls for soft Brexit to protect North East businesses\nPrincipal Dan Sydes said: “We’re excited to be such a high-profile example of how the relationship between creative industries and academia can work. Our school is all about collaboration between sectors, particularly collaboration between education and industry.\n“That’s why we have the likes of Ubisoft working with us on our curriculum and these close working relationships with local, regional and national firms will enable us to provide an employer mentor for every student as well as helping us to provide guaranteed apprenticeship places for our students.\n“This unique relationship will give our students a competitive edge when it comes to them looking for employment or moving on to the region’s excellent university provision.” Giselle Stewart, director of UK Corporate Affairs at Ubisoft (Image: from Tark)\nGiselle Stewart, director of UK corporate affairs for Ubisoft, said: “The use of the North East Futures UTC as a case study in such a key strategy is recognition that our approach is the way forward.\n“The North East recognised that a sector that is thriving in the region needed a talent pipeline to help it grow. The solution was a school that works with key players in the sector to produce a curriculum that will deliver students with the skills and attitudes needed by the sector.\n“The sector gets what it needs, the north east keeps talented young people in the region and the students will move into well-paid careers in an exciting, thriving industry sector.”\nThe school is open to children who are about to enter their Year 10 and Year 12, giving them the opportunity to embark on their GCSEs at a specialist school, as well as providing an alternative to college or sixth form. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-04-28T10:00:00.000+03:00", "crawled": "2018-04-28T11:09:28.054+03:00", "highlightTitle": ""}