{"organizations": [], "uuid": "c45a656a1e2ab33f3b652f0ae59e0e7b42bbb6c6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article1155853.ece/ALTERNATES/s1200/30086591.jpg", "site_section": "", "section_title": "", "url": "https://www.leicestermercury.co.uk/news/business/nick-pulley-stepping-down-llep-1421550", "country": "GB", "domain_rank": 48128, "title": "Nick Pulley stepping down as LLEP chair - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.626, "site_type": "news", "published": "2018-04-05T15:01:00.000+03:00", "replies_count": 0, "uuid": "c45a656a1e2ab33f3b652f0ae59e0e7b42bbb6c6"}, "author": "Tom Pegden", "url": "https://www.leicestermercury.co.uk/news/business/nick-pulley-stepping-down-llep-1421550", "ord_in_thread": 0, "title": "Nick Pulley stepping down as LLEP chair - Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "nick pulley", "sentiment": "negative"}, {"name": "beth walsh", "sentiment": "none"}, {"name": "pulley", "sentiment": "none"}], "locations": [{"name": "leicester", "sentiment": "none"}, {"name": "east midlands", "sentiment": "none"}], "organizations": [{"name": "leicestershire enterprise partnership", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Nick Pulley stepping down as LLEP chair Search on for replacement to act as business ambassador and oversee £250m of LLEP business support Share Outgoing LLEP chairman Nick Pulley (Image: Beth Walsh) Share Get Business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe chair of the Leicester and Leicestershire Enterprise Partnership (LLEP) will step down this summer after completing his stint on the board. \nNick Pulley, regional director of corporate and commercial banking for Santander in the East Midlands, has been in the LLEP post for four years and a board member for six. \nThe search is now on for a replacement. \nMr Pulley said it had been an honour to represent the business community on the partnership board as the city and county came out of the economic downturn and entered a new period of change with Brexit on the horizon. \nHe said: “I’m leaving with a somewhat heavy heart but the LLEP constitution says we cannot do more than two terms of three years. It is good to refresh things. \n“There’s no doubt that its been hard work and demanding, and has meant fitting things around my job, but it has also been rewarding – otherwise you would not do it. \n“The biggest achievements would be coming through the set-up phase of the LLEP, through to delivering tangible projects. Backing the Midlands Engine: Patrick Magee of British Business Bank, Sajid Javid MP and Nick Pulley \n“We have had various growth deal funding rounds along the way – helping Leicester College, for instance and Melton Cattle Market, which was recently opened by Princess Anne. \n“And there has been the Growing Places fund, which has helped projects such as Optimus Point, in Glenfield. \n“Right now there are around £200 million of projects in the pipeline that will get delivered over the next few years such as the £9.5 million skills centre at MIRA, near Hinckley. \n“I have also been involved in the evolving Midlands Engine from the start and the Midlands Engine Investment Fund which launched in February.” There are lots of new jobs to chose from at Fish4Jobs \nHe said it was possible he could continue working with the Midlands Engine in another capacity. \nThe 46-year-old, who has been at Santander for 20 years, said although he was stepping down from the LLEP in the summer, the job of recruiting his successor was already underway. \nMr Pulley said: “It would be really good for the LLEP to get someone local, who can continue the work already being done, who has a pan-regional or maybe even a national profile, because the LLEP chair roles are getting bigger.” The LLEP is supporting the £9.5 million MIRA Technology Institute being built near Hinckley \nIn a statement the LLEP said it was looking for a “recognised business leader, with a high profile in the area who will bring strong regional and national networks”. \nIt said: “Meeting regularly with senior politicians and the Prime Minister twice annually, this is an exciting opportunity to make a significant impact locally and nationally.” Read More \nAs well as chairing the 15 strong board, the chair will act as an ambassador for local businesses and ensure the LLEP’s collective voice is heard in Westminster and within the Midlands Engine. Read More \nThe replacement will help the board make key investment decisions, oversee more than £250 million of LLEP business support, and lead the board in setting out the long-term economic vision and priorities for Leicester and Leicestershire. Read More \nIt said: “This is not a paid position and the commitment can be up to three days per month. Reasonable expenses are covered. \n“The board term lasts for a period of three years.” Like us on Facebook ", "external_links": [], "published": "2018-04-05T15:01:00.000+03:00", "crawled": "2018-04-05T19:14:59.102+03:00", "highlightTitle": ""}