{"organizations": [], "uuid": "5f59da844c5ef9ca4e29b3f26d5c424001002dd0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article12098926.ece/ALTERNATES/s1200/Stings-tribute-to-A1.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/new-laws-changes-april-uk-14441050", "country": "GB", "domain_rank": 21960, "title": "New laws come into effect TODAY across the UK - how many do you know?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-04-01T10:45:00.000+03:00", "replies_count": 0, "uuid": "5f59da844c5ef9ca4e29b3f26d5c424001002dd0"}, "author": "James Rodger", "url": "https://www.chroniclelive.co.uk/news/north-east-news/new-laws-changes-april-uk-14441050", "ord_in_thread": 0, "title": "New laws come into effect TODAY across the UK - how many do you know?", "locations": [], "entities": {"persons": [], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "wales", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nStarting from the beginning of April, a string of law changes are set to come into effect. \nThere are price hikes for those heading abroad, you could be be set to fork out hundreds more if you own a car, and there are also changes for employers to be aware of. \nWith a new month coming, we've rounded up all the ways your life could be impacted by the changes. \nFrom cars to passports to Universal Credit, there's plenty to take note of and prepare for. Gender pay gap \nEngland, Wales and Scotland employers with at least 250 employees will be required to publish information about the differences in pay between men and women in their workforce, based on a pay bill ‘snapshot’ date of 5 April 2017, under the Equality Act 2010 (Gender Pay Gap Information) Regulations 2017. Read More \nhe first reports must be published by 4 April 2018. Passport renewals \nUnder the plans, online applications, which are available to all UK-based applicants, will increase in line with inflation, taking the total from £72.50 to £75.50 (4 per cent rise) for adults and from £46 to £49 for children, reports the MEN. \nPostal applications will increase by £12.50 to £85 for adults (17 per cent) and to £58.50 for children, reflecting the increased costs of processing postal applications compared to online applications. How a British passport will look after Brexit and a burgundy UK passport in the European Union style format (Image: PA) \nAnd with the Post Office check and send costing an extra £9.75, anyone wanting to use that service from March 27 is set to have to pay £94.75. \nAdults choosing to apply online would still be paying less than they would have in 2009, with passport fees having decreased in 2012. New car tax rules \nYou'll be forking out an extra five hundred quid from the start of next month, apparently. \nThat's the warning from some, who are urging you to get yourself clued up on the changes to car tax. \nThe changes come into effect from April 1 - but this isn't an April's Fool. \nThe Autumn Budget last year saw bands change. \nThis means the changes are coming into force in just a few days time. \nDrivers need to notice there are new rules around Vehicle Excise Duty (VED) bands. \nYou can renew it here , if it's either already expired or is due to. Traffic on a motorway (Image: PA) \nThe rules are designed to reduce pollution and will particularly target diesel cars that fail to meet tough standards. \nAt present, no new diesels conform to the standards, so the extra fee will apply to all new diesels sold. \nDiesel cars that issue an excessive level of pollution, as measured against the Euro 6 emission standards, will pay extra tax, which can be anything from £15 to £500 in the first year, reports The Mirror . \nAfter that there will be a flat rate depending on your vehicle: £140 a year extra for petrol or diesel vehicles £130 a year extra for alternative fuel vehicles (hybrids, bioethanol and LPG) £0 a year for vehicles with zero CO2 emissions \nAny car that produces more than 120mg/km of NOx will be forced to pay more for road tax in the first year. \nThe car tax increase will be applied to new cars bought after 1 April 2018 and not those registered before, so drivers with existing diesel cars will not pay more. \nThe Treasury says it thinks fewer than two million cars will be subject to the band jump, though cars like the Ford Fiesta are expected to see a £20 rise in the first-year rates. \nBritain is one of the five member states that have received a \"final warning\" from the EU for breaching nitrogen dioxide limits - which have proven links to heart disease and lung cancer. \nAccording to some studies, air pollution kills 50,000 people annually in the UK alone. \nThe penalties are designed to encourage drivers to adopt fuel types that are less polluting and less damaging to the environment. \nIf you bought your car before April 1, 2018, you won't be affected by the new tax changes as it only affects cars registered after 1 April this year. \nOlder cars will continue to be taxed according to the old system of CO2 emissions. \nIf you are buying a new car, you may want to reconsider your fuel options, or aim for a pre-registered one to avoid the extra tax. Four Universal Credit changes \nThe four key benefit cuts coming in to force on April 9 are: \n- Year three of the four-year cash freeze in working age benefits, affecting almost 11 million families. \n- The 3% real terms cut in working age benefits this year is set to be by far the biggest of the four-year benefit freeze. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \n- A two child limit for benefit claims , costing up to £2,780 for a family having a third child. This will affect 150,000 families. \n- Withdrawal of the family element of support for new tax credit and universal credit claims from families with children , costing up to £545 and affecting 400,000 families. \nThe rollout of Universal Credit , saving £200m this year due to lower entitlements than the existing benefit system for long term sick and working families in particular. Termination payments \nThe government plans to make changes to the taxation of termination payments from April 2018. \nThe proposals include: removing the distinction between contractual and non-contractual PILONs (payments in lieu of notice) so that all PILONs are taxable and subject to Class 1 NICs ensuring that the first £30,000 of a termination payment remains exempt from income tax and that any payment paid to any employee that relates solely to the termination of the employment continues to have an unlimited employee NICs exemption aligning the rules for income tax and employer NICs so that employer NICs will be payable on payments above £30,000 (which are currently only subject to income tax) Employment Allowance changes \nThe government plans to introduce a further deterrent to the employment of illegal workers. \nFrom April 2018, employers will not be able to claim the Employment Allowance for one year if they have: hired an illegal worker been penalised by the Home Office exhausted all appeal rights against that penalty Minimum Energy Performance Ratings \nFrom 1st April 2018, there will be a requirement for any privately rented properties to have a minimum energy performance rating of E. Gas rings on a cooker (Image: PA) \nThe government has announced it will be unlawful to rent out a property which breaches this minimum rating. \nA civil penalty of up to £4,000 will be imposed for landlords who do - meaning properties which fall in the F or G category will no longer be acceptable. Like us on Facebook", "external_links": [], "published": "2018-04-01T10:45:00.000+03:00", "crawled": "2018-04-01T15:24:00.027+03:00", "highlightTitle": ""}