{"organizations": [], "uuid": "316865f81fa3a44f5615e78b190eeb751a6ce424", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article9532444.ece/ALTERNATES/s1200/JS35404382.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/fury-lords-votes-keep-option-14552771", "country": "GB", "domain_rank": 21960, "title": "Fury as Lords votes to keep option of customs union with EU after Brexit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-04-19T23:00:00.000+03:00", "replies_count": 0, "uuid": "316865f81fa3a44f5615e78b190eeb751a6ce424"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/fury-lords-votes-keep-option-14552771", "ord_in_thread": 0, "title": "Fury as Lords votes to keep option of customs union with EU after Brexit", "locations": [], "entities": {"persons": [{"name": "jonathan", "sentiment": "negative"}, {"name": "arnott", "sentiment": "none"}, {"name": "michael gove", "sentiment": "none"}, {"name": "kerr", "sentiment": "none"}, {"name": "jonathan arnott", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "brexit fury as lords", "sentiment": "negative"}, {"name": "house of lords", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Fury as Lords votes to keep option of customs union with EU after Brexit Brexit-backing MEP Jonathan Arnott accuses the House of Lords of \"utter betrayal\" Share Jonathan Arnott, Independent MEP for the North East Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nEnvironment Secretary Michael Gove has admitted the Government could struggle to overturn a House of Lords defeat on the Government’s flagship Brexit bill, when it returns to the Commons. \nHe spoke after an alliance of Labour and Liberal Democrat peers, crossbenchers and Tory rebels combined to pass an amendment seeking to retain the option of a customs union with the EU. \nAnd the Lords vote sparked fury among some supporters of Brexit . North East MEP Jonathan Arnott has described it as “an utter betrayal.” \nThe amendment, tabled by cross-bencher Lord Kerr, passed with a majority of 123 votes. \nMinisters sought to play down the defeat, arguing that it did not commit the UK to a customs union and simply required ministers to make a statement explaining the steps it was taking. The EU and Union flags (Image: PA) \nBut with a number of pro-EU Tory MPs thought to be strongly sympathetic to the amendment, Mr Gove acknowledged the Government may not have the numbers to actually reverse the vote when the EU (Withdrawal) Bill returns to the Commons next month. \n“It is the case that there are lots of potential future votes - given the arithmetic in the House of Commons, given the fact that we don’t have a majority - which are always going to rely on the persuasive powers of ministers to get colleagues to support the Government,” he told BBC Radio 4’s Today programme. \nFor Labour - which supports a customs union - shadow Brexit secretary Sir Keir Starmer said they would fight to keep the amendment. \n“The Labour Party will absolutely support this with a three-line whip and I suspect the other opposition parties will - save, of course for the DUP,” he told Today. \n“Then the Tory MPs who are concerned about this will have to decide whether they want to support it. I hope they do.” \nMinisters argue that if the UK remains in a customs union with the EU after Brexit, it will be unable to strike its own free trade agreements with countries around the world. \nAnd Mr Arnott said the vote to leave the EU in the 2016 referendum meant the UK should leave the single market and the customs union. Read More Newcastle MP Chi Onwurah sets out Labour's vision for a successful economy \nHe said: “It is both saddening and ironic at the same time that an unelected House of Lords sees fit to attempt to overturn the biggest democratic mandate in the history of our country. \n“The one thing both Leave and Remain campaigns agreed on during the referendum campaign was that a vote for Brexit would mean leaving the Single Market and the Customs Union. \n“Labour are trying to keep the UK in the Single Market; the House of Lords are trying to keep us in the Customs Union. If the UK were to remain in both, we wouldn’t regain control of our Parliamentary sovereignty, our courts, our finances, our borders, or our fisheries. \n“We wouldn’t be able to negotiate trade deals for ourselves. In fact, it would mean nothing had been regained on every single major reason that caused Brexit voters to choose Brexit. \n“It would be Brexit in name only, an utter betrayal of 17.4 million people - including a huge 58% right here in the North East.” \nHe said that instead of trying to limit Brexit, the UK “should be trying to seize the opportunities it provides”. Read More Labour plans one million new homes and social housing for people on middle incomes \nIt has emerged that Theresa May faces another difficult vote after senior MPs tabled a motion on a continued customs union between the UK and the EU. \nYvette Cooper, the Labour chair of the Home Affairs Committee chair, and Nicky Morgan, Conservative chair of the Treasury Select Committee chair, have drafted a motion that calls on the Government to establish “an effective customs union” between the UK and EU. \nThe motion will be tabled on Thursday, HuffPo UK reports. Like us on Facebook", "external_links": [], "published": "2018-04-19T23:00:00.000+03:00", "crawled": "2018-04-20T02:48:02.000+03:00", "highlightTitle": ""}