{"organizations": [], "uuid": "d5eba9cda826e0de50d1a68463c6995b7dfe53b4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article475480.ece/ALTERNATES/s1200/Spoons-4.jpg", "site_section": "https://www.devonlive.com/rss.xml", "section_title": "devonlive - frontpage", "url": "https://www.devonlive.com/news/devon-news/jd-wetherspoon-shutting-down-social-1463705", "country": "US", "title": "JD Wetherspoon is shutting down its social media but the complaints won't go away", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-04-16T17:40:00.000+03:00", "replies_count": 0, "uuid": "d5eba9cda826e0de50d1a68463c6995b7dfe53b4"}, "author": "Edward Oldfield", "url": "https://www.devonlive.com/news/devon-news/jd-wetherspoon-shutting-down-social-1463705", "ord_in_thread": 0, "title": "JD Wetherspoon is shutting down its social media but the complaints won't go away", "locations": [], "entities": {"persons": [{"name": "wetherspoon", "sentiment": "none"}, {"name": "tim martin", "sentiment": "none"}, {"name": "martin", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "news", "sentiment": "none"}, {"name": "instagram", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News opinion JD Wetherspoon is shutting down its social media but the complaints won't go away The boss blames 'trolls' and the Facebook data scandal. But is there more to the story? Share Click to play Tap to play The video will start in 8 Cancel Play now   Thank you for subscribing!   \nPub giant JD Wetherspoon has closed down its social media accounts including Twitter, Facebook and Instagram, which is owned by Facebook. The chain with 900 pubs blames ‘trolling’ of MPs and the Facebook privacy scandal, when personal information from millions of users was collected without their consent. \nThe Devon-based founder of the nationwide pub chain, Tim Martin, said: \"It’s becoming increasingly obvious that people spend too much time on Twitter, Instagram and Facebook, and struggle to control the compulsion.” \nNow, the champion of the British boozer has shown a magic touch in growing his empire when the sector as a whole has been coming under pressure from cheap drink bought from supermarkets. \nI’m sure Mr Martin, a leading supporter of Brexit, would rather you spent more time in the pub, whether you have a compulsion to or not. JD Wetherspoon founder and chairman Tim Martin (Image: Lucy Munday) \nHe told the BBC he didn’t think the decision would affect the business and added: \"We were also concerned that pub managers were being side-tracked from the real job of serving customers.\" \nBut is there more to this story? It’s certainly generated a lot of publicity for the chain. If you scratch the surface of the Wetherspoon social media accounts, it appears many unhappy customers are using them to complain. Read More Driver reported by police for running out of petrol on the A30 near Exeter \nIt’s a fact of life for service industries that social media give their customers a chance to go very public very quickly, good or bad. And mostly people want to share when it’s bad. \nAmong the first tweets that came up when I searched Twitter for ‘JD Wetherspoon’ on Monday, was the story of a young woman with a brain injury who was thrown out of a Wetherspoon pub after being wrongly accused of being drunk. \nThe chain’s Head Office Facebook page,which has 188 likes, has a star review rating of 1.7 out of five, with 56 1-star rating compared to 10 5-stars. Now of course this is not necessarily a fair reflection of the business as a whole, as the individual pubs all had their own social media accounts. Read More \nI had a quick look on Facebook at my old haunt The Powder Monkey at Exmouth, and was pleased to see it was standing at four out of five, which reflects my own good experience of the place. The Powder Monkey pub in Exmouth \nGetting rid of all the social media accounts will certainly save managers’ time dealing with complaints. But are they taking a ‘Shoot the messenger’ approach? \nFor those in the service industry, social media is a fact of life and can provide useful free marketing and customer services tool. Read More Here's how to shop in Exeter's IKEA two days before it opens \nThe most important thing for any business is to deliver a good experience for its customers. Ignoring what they’ve got to say when things go wrong can make a bad experience worse. \nThe reality is that JD Wetherspoon has got its own phone app and website, and wants to manage its customer services through those channels and face to face. There’s a lot to be said for that, but it won’t stop unhappy customers sharing their experiences on social media, whether Mr Martin and his staff are prepared to reply or not. Like us on Facebook", "external_links": [], "published": "2018-04-16T17:40:00.000+03:00", "crawled": "2018-04-16T17:59:20.000+03:00", "highlightTitle": ""}