{"organizations": [], "uuid": "0bc01e7a93275b10276e9635f9559f554526519d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14551423.ece/ALTERNATES/s1200/DONG-Energy-Seeks-Subsea-Structural-Inspections-for-3-OWFsJPG.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-wind-industry-can-14551350", "country": "GB", "domain_rank": 21960, "title": "North East wind industry can create thousands of jobs, new report says", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-04-19T17:37:00.000+03:00", "replies_count": 0, "uuid": "0bc01e7a93275b10276e9635f9559f554526519d"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-wind-industry-can-14551350", "ord_in_thread": 0, "title": "North East wind industry can create thousands of jobs, new report says", "locations": [], "entities": {"persons": [{"name": "michael fallon", "sentiment": "none"}, {"name": "michael", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "darlington", "sentiment": "none"}], "organizations": [{"name": "defence", "sentiment": "none"}, {"name": "dong energy", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "North East wind industry can create thousands of jobs, new report says Report by former Cabinet Minister Sir Michael Fallon highlights North East as centre of wind farm innovation Share An offshore windfarm run by Dong Energy (Image: Handout) Share Get business updates   Thank you for subscribing!   \nThe North East should be promoted as the UK’s leading centre for cutting edge technologies in the offshore wind sector as it creates thousands of highly skilled jobs, a major new report has said. \nFormer Cabinet Minister Sir Michael Fallon has produced a series of recommendations designed to get offshore wind to be central to the Government’s industrial strategy, highlighting the North East as a leader for new technologies in turbine and blade development, cabling and electricity storage. \nSir Michael, a one-time Darlington MP who was an Energy Minister and most recently Defence Secretary, has called on the Government to establish a 60% target for UK content within British offshore wind projects. \nThe report also recommends the UK offshore wind industry should agree a ‘sector deal’, placing it at the heart of the Government’s Industrial Strategy and giving it equal status with sectors such as pharmaceuticals, defence and aerospace. \nSir Michael calls for Government export finance assistance to be made available for domestic projects being undertaken by firms already exporting, and said that the UK Business Bank should look at ways of reducing the bond finance burden on the supply chain. Left to right, Wilton Engineering Chief Executive, Bill Scott, Sir Michael Fallon, and Tees Valley Mayor, Ben Houchen (Image: Copyright unknown) \nHe said: “This is a pivotal moment for offshore wind. The huge investment to date has repaid the confidence shown by the Government in its future over the last six years. \n“But some of that investment has gone to European companies with no consequent impact on UK skills and productivity. The priority now must be to ensure that more of this investment leads to the bigger prize, a genuinely competitive UK industry that can help build the wind farms now being envisaged in the Indian Ocean, the Sea of Japan and off the north eastern US seaboard. \n“Strong UK supply chains and innovative high technology SMEs are the keys to winning these new contracts. Brexit offers fresh opportunities to use our freedom from artificially restrictive EU procurement rules to develop a world-beating industrial sector.” \nHe added: “If the sector is able to invest as a result of higher local content, it can grow and export throughout the world. \n“Given the explosion of interest in offshore wind in overseas markets, positive policy, strategic planning and early investment could deliver more than 25,000 jobs in the UK over the next decade.” \nNorth East companies involved in offshore wind projects have complained in the past that much of the work for wind farms subsidised by the UK taxpayer has gone to foreign firms. \nBut Sir Michael said a 50% target for UK work is now being met by some wind farm developers and should be raised to a more ambitious level. \nSir Michael’s report was commissioned by Teesside’s Wilton Engineering, and highlights leading North East firms involved in the offshore sector, including Northumberland’s Osbit and Tekmar, in County Durham. Read More See the massive wind farm structure that is looming over one Northumberland town \nBill Scott, chief executive of Wilton Engineering, said: “I welcome this report as a major contribution to thinking about the future of the offshore sector in the UK. \n“We are on the cusp of something that can deliver sustainable solutions to the massive growing demand for electricity in the developed world. As we decarbonise, electricity becomes more important and our engineering excellence is providing the infrastructure needed to harness our offshore wind power. \n“The North East of England is home to talented and innovative businesses that form a major link in the offshore wind supply chain. \n“However, the UK supply chain needs the Government to maintain its commitment to local content from our own licences. This spur is driving the investment and planning we need to create a viable business sector that could enable green renewable electricity generation to become commonplace throughout the world.” \nClark MacFarlane, from the Offshore Wind Industry Council, said: “We welcome the ambition expressed in Sir Michael Fallon’s report to grow the UK’s offshore wind supply chain. \n“British firms are already exporting goods and services to offshore wind projects around the world, as well as supplying UK projects. The case for Ministerial support is clear, and we are working with Government on a sector deal which would unlock even greater investment in our industry.” Like us on Facebook", "external_links": [], "published": "2018-04-19T17:37:00.000+03:00", "crawled": "2018-04-19T17:42:20.009+03:00", "highlightTitle": ""}