{"organizations": [], "uuid": "b57d5352fc25455e4185fa6bcad68d4d39f7b793", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14582918.ece/ALTERNATES/s1200/IBP_NEC_260418biz_awards_78JPG.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/cramlington-firm-merit-named-north-14580842", "country": "GB", "domain_rank": 21960, "title": "Cramlington firm Merit named North East Company of the Year", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-04-27T02:01:00.000+03:00", "replies_count": 0, "uuid": "b57d5352fc25455e4185fa6bcad68d4d39f7b793"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-news/cramlington-firm-merit-named-north-14580842", "ord_in_thread": 0, "title": "Cramlington firm Merit named North East Company of the Year", "locations": [], "entities": {"persons": [{"name": "henderson", "sentiment": "none"}], "locations": [{"name": "sedgefield", "sentiment": "none"}, {"name": "royal albert hall", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "fairstone", "sentiment": "none"}, {"name": "hardwick hall hotel", "sentiment": "none"}, {"name": "teesside", "sentiment": "none"}], "organizations": [{"name": "merit named north east company", "sentiment": "neutral"}, {"name": "invalid email northumberland", "sentiment": "none"}, {"name": "northumberland company", "sentiment": "none"}, {"name": "newcastle journal", "sentiment": "none"}, {"name": "newcastle jour", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Cramlington firm Merit named North East Company of the Year Other winners on the night included Prosafe Engineering, PC Henderson, Houghton International and Big Little Toys Share North East Business Awards at Hardwick Hall Hotel in Sedgefield (Image: Newcastle Journal) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nNorthumberland engineering and construction company Merit has seen off tough competition to be named North East Company of the Year for 2018.\nThe Cramlington firm, which had qualified for the prize after being named Tyneside and Northumberland Company of the Year in February, saw off Boldon-based financial advisory group Fairstone and Teesside vegetarian food producer Quorn to win the title.\nMerit – which was one of the finalists for the same award 10 years ago – has seen big increases in turnover over the last three years and has won high profile contracts at London’s Royal Albert Hall and for the British Antarctic Survey. Company of the Year nominee, Merit (Image: Newcastle Journal)\nThe company’s victory marked the culmination of the annual celebration of the best of North East business, with almost 600 people gathered at Hardwick Hall in Sedgefield, County Durham.\nOther winners included Beamish Museum, AkzoNobel Ashington, Lingotot and Keepmoat Homes.\nHelen Dalby, senior editor of The Journal, opened the event with a rallying call for the region’s business community, saying that the Great Exhibiton of the North, Tall Ships and other events meant 2018 was the region’s “time to shine”.\nShe said: “The Exhibition gives us the chance to change the tired old narrative about the North East as a place in decline and show people the place WE all know it to be. Helen Dalby, ncjMedia, at the North East Business Awards at Hardwick Hall Hotel in Sedgefield (Image: Newcastle Journal)\n“The prophets of doom have been quick to predict gloom for the North East after Brexit.\n“Tonight’s celebration has shown what we can achieve in this great region, so let’s prove the doom mongers wrong.”\nThe awards heard from guest speaker Greg Clark, Secretary of State for Business, Energy and Industrial Strategy, and from Lucy Winskell, chair of associate sponsors the North East England Chamber of Commerce. Guest speaker Greg Clark MP (Image: Newcastle Journal)\nEntertainment was provided by the award-winning Voices of Hope choir while gifts were left for all the finalists and other guests by Popaball.\nWinners:\nNewcomer of the Year (sponsored by Virgin Money): Prosafe Engineering Ltd\nLet’s Grow Award (sponsored by Newcastle International Airport): Flame Heating Group\nExport Award (sponsored by Square One Law): P C Henderson\nHeart of the Community Award (sponsored by Karbon Homes): Keepmoat Homes\nApprenticeship Award (sponsored by CIPD North East of England): British Steel - Teesside Beam Mill\nBest Creative Company Award (sponsored by Durham University): Big Little Toys Ltd\nTourism & Hospitality Award (sponsored by Newcastle United FC): Beamish, The Living Museum of the North\nServices Award (sponsored by Northumbrian Water): Houghton International\nSmall Business Award (sponsored by Handelsbanken): WhiteWash Laboratories Ltd\nDigital Technology Award (sponsored by Newcastle University): Lingotot\nInnovation Award (sponsored by Premier Tech Aqua UK): Applied Scientific Technologies UK Ltd\nManufacturing Award (sponsored by Business Durham): AkzoNobel Ashington\nCompany of the Year (sponsored by Sunderland City Council): Merit Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-04-27T02:01:00.000+03:00", "crawled": "2018-04-27T02:58:11.003+03:00", "highlightTitle": ""}