{"organizations": [], "uuid": "58d2b665ab705ca50f46f10b644c74cb7e0d79a8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14578775.ece/ALTERNATES/s1200/Car-production-figures.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/considerable-concern-over-slump-car-14578771", "country": "GB", "domain_rank": 21960, "title": "'Considerable concern' over slump in car production - days after Nissan announces job losses", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-04-26T12:21:00.000+03:00", "replies_count": 0, "uuid": "58d2b665ab705ca50f46f10b644c74cb7e0d79a8"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-news/considerable-concern-over-slump-car-14578771", "ord_in_thread": 0, "title": "'Considerable concern' over slump in car production - days after Nissan announces job losses", "locations": [], "entities": {"persons": [{"name": "mike hawes", "sentiment": "none"}], "locations": [{"name": "sunderland", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "nissan", "sentiment": "negative"}, {"name": "smmt", "sentiment": "none"}, {"name": "society of motor manufacturing", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Nissan's plant in Sunderland (Image: PA) Share Get business updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email\nCar production fell by 13% last month compared with a year ago, sparking “considerable concern”.\nThe announcement from the Society of Motor Manufacturing and Traders (SMMT) comes just a few days after Nissan announced plans to cut hundreds of jobs at its Sunderland plant after a fall in demand for new cars, particularly diesels.\nA total of 141,471 cars were built in UK factories in March. Domestic demand was down by 17.7%, while exports also fell, by 11.9%, amid fluctuations in demand in some global markets, said the trade group. Some manufacturers were hit by the bad weather in March.\nReacting to the figures, SMMT chief executive Mike Hawes said it was vital that politicians provided certainty for the automotive industry both in terms of the future of diesel and post-Brexit trading arrangments.\nMPs have warned of potentially huge job losses in the automotive sector if negotiations with the EU do not provide protection for the industry.\nThe introduction of tariffs and delays if the UK leaves the EU single market would be especially damaging to car manufacturers, where car parts are frequently transported across borders during the manufacturing process.\nMike Hawes, SMMT chief executive, said: “A double digit decline in car manufacturing for both home and overseas markets is of considerable concern.\n“Following recent announcements on jobs cutbacks in the sector, it’s vitally important that the industry and consumers receive greater certainty, both about future policies towards diesel and other low emission technologies, and our post-Brexit trading relationships and customs arrangements.\n“Maintaining free and frictionless trade is an absolute priority - it has been fundamental to our past success and is key to our future growth.” Read More Cramlington firm invests in Liam Neeson's latest movie\nAny slump in the automotive sector would be a huge blow to the North East economy, with 7,000 people working at the Nissan plant and tens of thousands more in the supply chain.\nThere are hopes too that thousands of new automotive jobs can be created with the building of the International Advanced Manufacturing Park (IAMP) on the border of Sunderland and South Tyneside .\nSMMT figures showed that production in the first quarter of the year fell by 6.3% compared with the same period in 2017, with 440,426 cars being built, 80% for export.\nThe figures chime with data released earlier in the month when the European Automobile Manufacturers Association said the EU passenger car market had declined by 5.3%, with particular problems in the UK, Germany and Italy.\nAmong car manufacturers, Nissan suffered one of the largest declines, losing 17.8% of sales from this time last year, and seeing its share of the European market fall from 4.8% to 4.2%. Read More Plans to cut 100 jobs at Nestlé factory in Newcastle still up in the air, one year on\nTwo weeks ago Jaguar Land Rover (JLR) said it would cut production at its Solihull plant and not renew the contracts of around 1,000 temporary workers, blaming “continuing headwinds impacting the car industry”.\nBoth firms, along with other automotive giants, have suffered from a slump in the sales of diesel cars after Governments around the world moved to make them less attractive because of higher-than-thought pollution levels.\nNissan have stressed that its current job losses are not related to Brexit. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-04-26T12:21:00.000+03:00", "crawled": "2018-04-26T13:17:02.005+03:00", "highlightTitle": ""}