{"organizations": [], "uuid": "0381d7b4f26b4bce396b0a2b800f6ce0be13fd5c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14471792.ece/ALTERNATES/s1200/JS147536204.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/one-year-until-brexit-day-14471396", "country": "GB", "domain_rank": 21960, "title": "One year until Brexit Day - 5 major studies and what they said about leaving the EU", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-04-01T07:00:00.000+03:00", "replies_count": 0, "uuid": "0381d7b4f26b4bce396b0a2b800f6ce0be13fd5c"}, "author": "Mike Kelly", "url": "https://www.chroniclelive.co.uk/news/north-east-news/one-year-until-brexit-day-14471396", "ord_in_thread": 0, "title": "One year until Brexit Day - 5 major studies and what they said about leaving the EU", "locations": [], "entities": {"persons": [{"name": "george osborne", "sentiment": "none"}, {"name": "osborne", "sentiment": "none"}, {"name": "boris johnson", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "neutral"}, {"name": "treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nBefore the EU referendum vote, then Chancellor George Osborne’s gloomy prediction of what leaving Europe would mean to the UK backfired as it became labelled ‘Project fear’ by Leave supporters. \nHas the former Chancellor’s predictions been borne out by subsequent studies? \nIt is now less than one year until ‘Brexit Day’ - March 29 2019. \nHere we take a look at five major studies into the impact of Brexit and what they said. 1. George Osborne’s pre-referendum prediction \nIt’s worth looking back to 2016 when Chancellor George Osborne said Britain would be “permanently poorer” if voters choose to leave the EU. \nOsborne said a Treasury study claimed the economy would shrink by 6% by 2030, costing every household the equivalent of £4,300 a year. \nOsborne warned that the option favoured then by Boris Johnson – a deal along the lines of the EU-Canada arrangement – would lead to an economic contraction of 6% by 2030. 2. The Government’s ‘secret’ impact study Brexit minister Mike Russell during a meeting with UK and EU nationals in Edinburgh \nThe Government didn’t want to release it, and you can see why. It made grim reading for the country, particularly this region. \nIt said the North East, along with the West Midlands and Northern Ireland, will suffer the biggest hit to economic growth after the UK’s withdrawal from the EU. \nThe North East would take an 11% hit to economic growth under the Government’s preferred outcome of a free trade deal with the EU, while leaving with no deal will result in a 16% dip, and staying in the single market would cause a 3% decline. \nLondon will see the least damage although every area of the UK will suffer a decline in GDP. \nThe UK as a whole will become poorer over 15 years after Brexit under all possible scenarios, according to the Government’s analysis. 3. Prices could fall, then there’s the big but ... \nConsumers could see prices fall by up to 1.2% if Britain were to abolish all tariffs once it has left the European Union, a study by the Institute for Fiscal Studies said. \nHowever it warned that any gains would be small and were based on “optimistic” assumptions. \nIt also said that consumers had already seen prices rise by 2% since the referendum due to the weaker pound. \nCosts linked to new EU trade barriers could also hit consumers, it said. \nThose increased costs would “offset” any “rather limited” gains from becoming tariff free in the future, the report from the think tank says. \n“We estimate that complete abolition of all tariffs would reduce prices faced by households by about 0.7-1.2%,” the report said. \n“This could have additional positive economic benefits in the long run but could also be very damaging for some UK industries in the short run.” Read More", "external_links": [], "published": "2018-04-01T07:00:00.000+03:00", "crawled": "2018-04-01T09:08:03.005+03:00", "highlightTitle": ""}