{"organizations": [], "uuid": "1e1780c7ba3c84a2bfb89d3dda07fffd435e8fc6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1412990.ece/ALTERNATES/s1200/1-3.jpg", "site_section": "http://www.westernmorningnews.co.uk/editorschoices.rss", "section_title": "devonlive - frontpage", "url": "https://www.devonlive.com/news/devon-news/greater-exeter-plan-been-delayed-1412993", "country": "GB", "title": "The Greater Exeter plan has been delayed", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-04-03T15:29:00.000+03:00", "replies_count": 0, "uuid": "1e1780c7ba3c84a2bfb89d3dda07fffd435e8fc6"}, "author": "Daniel Clark", "url": "https://www.devonlive.com/news/devon-news/greater-exeter-plan-been-delayed-1412993", "ord_in_thread": 0, "title": "The Greater Exeter plan has been delayed", "locations": [], "entities": {"persons": [{"name": "devon 13:29", "sentiment": "none"}, {"name": "daniel clark", "sentiment": "none"}], "locations": [{"name": "greater exeter", "sentiment": "none"}, {"name": "mid devon", "sentiment": "none"}, {"name": "teignbridge", "sentiment": "none"}, {"name": "exeter city cou", "sentiment": "none"}, {"name": "east devon", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "devon county council", "sentiment": "none"}], "organizations": [{"name": "greater exeter", "sentiment": "none"}, {"name": "exeter city council", "sentiment": "none"}, {"name": "devon county council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News The Greater Exeter plan has been delayed Mid Devon, East Devon, Teignbridge and Exeter City Council, in partnership with Devon County Council, are teaming up to create a Greater Exeter Strategic Plan (GESP) which focuses on the creation of jobs and housing until 2040 Share Daniel Clark Local Democracy Reporter for Devon 13:29, 3 APR 2018 Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe draft Greater Exeter Strategic Plan which would outline a major strategic blueprint for the area around Exeter is now not expected to be published until the summer of 2018. \nMid Devon, East Devon, Teignbridge and Exeter City Council, in partnership with Devon County Council, are teaming up to create a Greater Exeter Strategic Plan (GESP) which focuses on the creation of jobs and housing until 2040. \nThis formal statutory document will provide the overall framework for housing and employment land to be provided up to 2040 and by working together the councils aim to earmark the right locations for employment, new homes and infrastructure, while safeguarding the local environment. Read More Confusion erupts after 'daft and misleading' street signs installed in Exeter \nA consultation on the issues that the GESP should focus on took place 12 months ago and it was initially hoped that a consultation on a draft plan would begin in January of 2018. \nBut publication of the draft plan has been delayed and it is now likely that the draft GESP will be published in the summer of 2018. \nExplaining the delay, a statement said: “In respect of the Greater Exeter Strategic Plan (GESP), and since our last Local Development Scheme was approved, there have been a number of factors which have delayed plan production. \n“These include the fact that a great many sites were submitted through the Housing and Employment Land Availability Assessment ‘call for sites’ and these are being carefully assessed as well as further draft changes to national Government planning policy and a wish to investigate differing ways to ensure we can secure the best forms of development, including the highest quality new housing with supporting facilities, to meet our future needs.” Read More Task group report says farmers need to have greater clarity about what will happen post Brexit \nA Local Development Scheme Review, which will include the GESP, will go before Teignbridge District Council’s executive committee on May 1, and a council spokesman said that at around the same time it is expected similar reports will go to the executives/cabinets of partner authorities. \nThey added: “The report will set out the current position of the Plan alongside a revised timetable and that report will set the context as to why the Plan needs to be rescheduled.” \nThe purpose of preparing the Greater Exeter Strategic Plan is to have a joined-up vision and aspirations for the area. \nThe local authorities are working together, engaging with stakeholders and communities, to prepare a new joint plan. \nThey are working together to deliver the best possible outcomes for the provision of new homes, jobs and infrastructure for existing and future generations, while also protecting and enhancing the environment. \nThe GESP will sit above District-level Local and community Neighbourhood Plans, taking a long-term strategic view to ensure important decisions about development and investment are coordinated. Read More Bus service improvements and park-and-change car park planned for Exeter Enterprise Zone \nIt will: set an overall vision and strategy for the development of the area in the context of national and other high level policy; include overarching, cross-boundary and strategic targets, policies and proposals for development and conservation guide the overall level and distribution of development make strategic development and infrastructure proposals contain other strategic policies necessary to implement the vision and strategy; cover the period to 2040. \nThe initial preparation timetable published was as follows: February 2017 – Issues consultation January 2018 – consultation on draft plan February 2019 – Publication (Proposed Submission) August 2019 – Submission November 2019 – Inspector’s Hearings June 2020 – Adoption ", "external_links": [], "published": "2018-04-03T15:29:00.000+03:00", "crawled": "2018-04-03T15:59:30.001+03:00", "highlightTitle": ""}