{"organizations": [], "uuid": "ed21a3623c9d3da06b8556cbcca296bd5c5444cd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article967466.ece/ALTERNATES/s1200/2170067.jpg", "site_section": "http://www.leicestermercury.co.uk/rss.xml", "section_title": "leicestermercury - frontpage", "url": "https://www.leicestermercury.co.uk/news/leicester-news/foreign-offenders-leicestershire-cost-government-1447942", "country": "GB", "domain_rank": 48128, "title": "Foreign offenders in Leicestershire cost Government £7.7m last year", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-04-12T13:54:00.000+03:00", "replies_count": 0, "uuid": "ed21a3623c9d3da06b8556cbcca296bd5c5444cd"}, "author": "Amy Orton", "url": "https://www.leicestermercury.co.uk/news/leicester-news/foreign-offenders-leicestershire-cost-government-1447942", "ord_in_thread": 0, "title": "Foreign offenders in Leicestershire cost Government £7.7m last year", "locations": [], "entities": {"persons": [], "locations": [{"name": "leicestershire", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Foreign offenders in Leicestershire cost Government £7.7m last year Cost covered referring offenders to Government for deportation Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily   Thank you for subscribing! Could not subscribe, try again later Invalid Email \nReferring foreign national offenders in Leicestershire to the Home Office for deportation cost the criminal justice system around £7.7million last year. \nForeign national offenders are classed as any offender who is not a UK citizen. Their offences could have been committed overseas or in the UK. \nFor those who committed offences overseas, those crimes might not come to light until the individual is brought to the attention of police in this country, sometimes for minor offences. \nUnder freedom of movement rules, background checks are not currently carried out on European Union (EU) nationals who come to the UK, although this could change when the Brexit deal is finalised. \nPeople from outside the EU, and those entering the country via certain visa routes, do have to disclose their background. \nShould people coming into the UK from the EU have to declare any convictions they have? Vote in our poll below. \nDuring 2017, 110 offenders who passed through Leicestershire Police custody suites were referred to the Home Office. Read More Revealed: Where in Leicester bike thieves are getting away with it \nThe Office for National Statistics estimates the cost of dealing with such criminals to be about £70,000 per offender. \nThe figures were revealed as Detective Sergeant Gary Bee and Pc Tony Andrews from Operation Advenus gave a presentation on their work to the Leicestershire Safer Communities Strategy Board at a County Hall meeting. \nOperation Advenus investigates cases for referral to the Home Office and the immigration service. 'It is startling, but this is the situation we face.' \nDet Sgt Bee said: “The misconception is that there is an application process, but that is not the case. \n“The reality is that people [from the EU] with convictions, and often very serious convictions, can move to the UK with an entirely clean slate. \n“It is startling, but this is the situation we face. Read More Jail for thief who stole £1k of CONDOMS from Boots in Leicester \n“The worrying thing is that often the first time we come into contact with these people is often when we get them in custody.” \nAt the meeting the officers outlined their operation and asked local councillors and council officers to raise any concerns they have about people within their areas at the earliest possible opportunity. \nThe police want to encourage community partners to report any suspicions about individuals to them in an attempt to make communities safer. \nDet Sgt Bee said: “We’re asking our partners in the community to alert us as soon as they can. We want to see improved information sharing to help us tackle this problem. \n“When someone comes into custody there is a process that we follow to identify foreign national offenders, but before that point they could have been someone’s noisy neighbour or a person responsible for anti-social behaviour in a community.\" Read More Leicestershire Police praises courage of Gwent officers who came face to face with knifeman \nAn average of 120 foreign national offenders pass through Leicestershire Police's custody suites per month. The 110 offenders referred to the Home Office in 2017 were able to be referred for deportation because of the severity of their criminal backgrounds. \nOffenders can be referred to the Home Office if background checks carried out by the police show that they have committed a sex offence which resulted in a more than one day imprisonment, served a sentence of 12 months to four years within the past 10 years and any offence that resulted in a more than four year sentence. \nIf approved for deportation, a referral usually results in the offender being banned from the UK for 10 years or more. \nPc Andrews said: “These costs mentioned are just to manage offenders who are referred to the Home Office. \n\"If we were talking about [dealing with] a murder or a stranger rape, then the costs are unquantifiable.\" \nHe added: \"These people serve their time overseas and then come here with a clean slate. \n“[But] murderers, rapists and drug dealers don’t stop being those things just because they move to a new country. \n“Until we come into contact with them, often for a nominal offence, we have no idea of their background.” \nDet Sgt Bee, of the Leicestershire Police Force Intelligence Bureau, said that Operation Advenus is working to protect the people of the county and not to single out innocent foreigners. \nHe said : “It’s important to say we’re not targeting foreign nationals here, we’re targeting foreign national offenders.\" poll loading Should people coming into the UK from the EU have to declare their convictions, if any? 0+ VOTES SO FAR", "external_links": [], "published": "2018-04-12T13:54:00.000+03:00", "crawled": "2018-04-12T14:35:49.056+03:00", "highlightTitle": ""}