{"organizations": [], "uuid": "aad300696ffcbecb98041d489b2588341c1b3d7e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article12073268.ece/ALTERNATES/s1200/JS61762182.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14520932", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Carpetright to slash 300 jobs and close 92 stores amid major restructure", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-04-12T10:05:00.000+03:00", "replies_count": 0, "uuid": "aad300696ffcbecb98041d489b2588341c1b3d7e"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14520932", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Carpetright to slash 300 jobs and close 92 stores amid major restructure", "locations": [], "entities": {"persons": [{"name": "adzuna", "sentiment": "none"}, {"name": "andrew hunter", "sentiment": "none"}], "locations": [{"name": "adzuna", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "carpetright", "sentiment": "negative"}, {"name": "coreena ford", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford It pays to stay in a first job, research reveals \nWorkers who spend up to three years in their first job earn higher salaries over their career, a study has found. \nJobs site Adzuna said its research suggested a “salary premium” for staying with a first employer. \nAn analysis of 50,000 jobseekers’ CVs showed that a worker spending between two and three years in their first job earned around £4,000 a year more than those who left within 12 months. \nWorkers based in the north tend to stay in their first job longer than those in the south, the study found. \nThe average first job tenure is over three years in the North East compared with two years in London, said the report. \nMen tend to stay in a first job longer than women, said Adzuna. \nAndrew Hunter, co-founder of Adzuna, said: \nSwitching jobs to climb the career ladder may be tempting for ambitious young workers, but patience comes with a premium. \nWorkers who show staying power by sticking to a first role for a few years end up earning more than their flightier colleagues. \nYo-yoing through a career by changing jobs often can be viewed negatively, and could harm pay prospects in the long-run. Instead, showing a little loyalty pays dividends. \nWorkers are spending shorter and shorter periods within a first role, with each generation moving on more quickly than its predecessor. (Image: PA) Coreena Ford Digital Union calls for tech firms to hire more women in senior roles \nThe head of Digital Union has called for tech companies to hire more women in senior roles , after Government figures revealed the gender pay gap in the industry. \nNationally, men working in the tech sector are paid 18.6% more than women. The reason for the large pay gap is because the majority of senior positions in digital firms are held by men. \nRachel Peacock, the head of Digital Union – which represents the North East’s creative, digital and tech industries – is calling for tech companies to make more female hires at senior levels. \nShe said: “While we applaud the Government’s initiative to raise awareness of the gender pay gap, the figures released last week show that deep divisions still exist and much more needs to be done to address the balance. \n“We’ve all known for a very long time that there’s a significant gap between the incomes of men and women and one of the big reasons for this is that many of the senior roles are dominated by men, and the tech sector in the North East at the moment isn’t too different. Digital Union wants to see more senior women in tech and will continue to boost gender equality through a range of our own efforts including women having a leading presence at high profile event panels.” Rachel Peacock, head of Digital Union (Image: Unknown) 9.00 Coreena Ford Morpeth business owners say no to BID scheme levies \nBusiness owners in Morpeth have voted against creating a Business Improvement District (BID) in the town, after owners opposed levies used to finance the scheme. \nThe BID proposal aimed to boost Morpeth’s economy by increasing footfall in the centre of town, promoting the local area to a wider audience, and supporting businesses, but ultimately failed to get off the ground. \nPlans were put forward by Morpeth BID Steering Group but faced staunch opposition from a number of local businesses, many of which were against the financial cost of setting up the BID. \nBIDs are funded by local businesses and if the plans had been approved, local ratepayers would have faced a levy of 1.4% of their rateable value. \nBusiness owners were given four weeks to cast their vote on whether to approve their plans and by the end of the process 221 votes were cast, representing nearly 60% of the local business community. \nOnly 78 votes were cast in favour of the BID plans, 35.3% of the overall votes cast. The proposals required 50% of the votes to be approved. \nMorpeth BID Steering Board said it was “disappointed by the result of the vote” but would “fully respect the ‘no’ outcome”. 8.55 Coreena Ford WH Smith boss hails good half-year performance \nThe chief executive of retailer WH Smith has hailed a good half-yearly performance after the group posted a 1% fall in group pre-tax profits to £82m for the six months to February 28. \nThe firm said high street trading profits dropped 6%, while earnings in the travel arm - its largest division - lifted 5%. \nLike-for-like sales in high street stores fell 4% over the half-year, while travel outlets saw a 3% rise on a constant currency basis. \nThe group’s interim dividend per share was increased 10% to 16p. \nStephen Clarke, group chief executive said: \nThe group has delivered another good first half performance. \nIn Travel, which is the largest part of the Group in both sales and profit, we continue to see strong sales growth, up 7%, driven by continued investment in our UK and international businesses and ongoing growth in passenger numbers. As a result, profit in Travel was up 5% in the period. \nWe have also had a record period for tender wins internationally, with 26 new units won since the start of the year, including eight units in Madrid Airport and our first seven units in South America in Rio de Janeiro. We are now present in 48 airports across 27 countries. \nOur High Street business delivered a good first half performance, despite no publishing trend to match last year’s strong sales of humour books over Christmas. \nStationery performed particularly well in the period, including our seasonal categories over Christmas and our 2018 fashion ranges. \nThese results are only possible through the hard work of all of our teams across the business and I am very grateful for their hard work and support. \nWhile there is some uncertainty in the broader economic environment, we have made a good start to the second half of the financial year, increased the interim dividend by 10% and are confident in the outcome for the full year. A WH Smith branch Coreena Ford Formica halves operating loss as £40m investment plan continues \nNorth Tyneside manufacturer Formica is celebrating improved financial results after boosting its turnover by £7m and halving its operating loss. \nFormica – which makes laminate products for the residential and commercial sectors from its sites in North Shields and Newton Aycliffe – saw its turnover grow from £64m to £77.5m for the year ending June 2017. \nThe company said its 21% revenue boost showed the firm had experienced good growth in the UK, even though the market was “weak”. \nWhile turnover increased substantially, the company also managed to make a major improvement to its operating losses, which fell from £13.1m in 2016 to £7.1m last year. \nNeil Mason, Formica’s chief finance officer, said: “UK sales grew by over 10% in the past financial year, following investment in both the commercial team and product innovation. This, combined with our drive to improve factory productivity, has resulted in increased gross profit. \n“This is a positive first step in our journey which includes the £40m investment plan announced in 2017, coupled with the continued focus on our customers and more exciting new product developments in the pipeline. We’re confident our sales will continue to grow and we’re looking forward to seeing the benefits of new machinery which will be commissioned at the end of this year. Formica headquarters in North Tyneside (Image: Newcastle Journal) 8.45 National Grid issues profit warning \nNational Grid has warned over profits after storms dealt a blow to its US business. \nThe power operator said headline group earnings for the full year were set to be lower as it faced storm remediation costs of £140m. However, it said underlying group earnings were on track to meet expectations. \nNational Grid will publish its preliminary results for 2017/18 on Thursday, May 17. Electricity pylons (Image: Andrew Milligan/PA Wire) 8.38 Coreena Ford Kids' creative company Geo Journey strikes gold with major mums' website \nA company which takes children on an educational trip around the world with themed gift packs is gearing up for growth after winning a coveted MadeForMums award . \nGeo Journey aims to inspire children to learn about the world throughly monthly parcels, starting with an initial explorer kit of a suitcase, travel journal, passport map and activities. \nNow the Sunderland business, run by Christina Armstrong and her sister Fiona Waistell, has won the MadeForMums gold award for best subscription box/service, after beating competition from the likes of Bookabees and BKD. \nThe MadeForMums website – the UK’s largest online parenting community – highlighted Geo Journey in its mission to reward companies for having the best products, brands and services for children and parents. Christina Armstrong and her sister Fiona Waistell at Geo Journey (Image: Ian McClelland) 8.30 Coreena Ford Landlords to vote on Carpetright CVA \nCarpetright directors said trading had remained “difficult” since its last update on March 1, with the group continuing to expect a small underlying loss for the year to April 28. \nIt said the CVA - which is a form of insolvency aimed at protecting a business from going bust by cutting its costs - will help it to “address the competitive threat from a position of strength”. \nLandlords will vote on the plans on April 26, while shareholders will have their say on April 30. \nThe rescue deal, which is being handled by Big Four accountancy firm Deloitte, marks another dark day for the sector, which has already seen thousands of jobs axed following the collapse of well-known names Toys R Us and Maplin . \nHigh street retailers have been hit by a drop in consumer spending, soaring costs and the increasing threat of online competitors. \nThe British Property Federation (BPF) praised Carpetright for taking early action to address its trading woes. \nStephanie Pollitt, assistant director of real estate policy at the BPF, said: \nThese situations are never easy as landlords need to take into consideration the impact on their investors, including those protecting pensioners’ savings, as they vote on the CVA proposal. \nCarpetright and Deloitte, however, have demonstrated best practice, constructively engaging with the BPF early in the process and ensuring landlords’ interests have been properly taken into account. \nUltimately, it will be for individual landlords to decide how they will vote on the CVA, but the proposal has sought to find a solution that works for all parties. 8.19 Coreena Ford Councils could get £870m boost from business rates retention \nCouncils allowed to retain 100% of business rates under pilot schemes could get £870m in extra funding, a new study has found. \nEnglish local authorities testing the initiative are forecast to receive 3.6% of their core funding from the move in 2018-2019, according to the Institute for Fiscal Studies (IFS) report. \nHowever, if the increases were shared out equally among all councils, not just selected ones, authorities would receive a boost of 2% to their general grants, the study said. \nSince test schemes may only last a year, it is unclear how much can be learned from the pilots, according to the IFS analysis, which was funded by the Local Government Finance and Devolution Consortium. Forecasts of funding boosts for pilot councils no longer in the 50% retention scheme would see London local authorities gaining £430m a year, Berkshire ones £53m, but Liverpool benefiting by just £2.5m. Citi will keep the majority of its workforce in the UK despite Brexit 8.10 Coreena Ford Mothercare cheers rises in online sales \nMothercare has cheered a much-needed resurgence in online sales as the struggling retailer remains locked in talks with lenders over a refinancing deal. Online sales returned to growth in the UK, expanding by 2.1% in the 12 weeks to March 24 this year. \nHowever, trading on the British high street proved tough, with like-for-like sales sliding 2.8% over the period as store footfall tumbled. \nInternational sales were also down 3.7% as growth in the Middle East failed to offset sliding footfall in Russia. \nThe update comes a week since Mothercare parted company with chief executive Mark Newton-Jones, replacing him with former Tesco man David Wood. \nThe group has been seeking a reprieve from the demands of its lenders by drafting in KPMG to advise on a refinancing of the firm. \nIt called in the accountancy giant to help it secure waivers to its financial covenants as it looks at additional sources of financing from its lenders HSBC and Barclays. \nMr Wood said his “immediate priority” was to ensure Mothercare was returned to firmer financial ground. \nHe said: \nThe UK retail trading environment remained relatively muted in the quarter, with a continuing trend of lower footfall in stores, though there was an encouraging return to growth online, with website sales in particular growing at 7.2%. \nMy immediate priority is to ensure Mothercare is put back on a sound financial footing and to improve its financial performance. A Mothercare store (Image: PA) 8.00 KEY EVENT Carpetright to close 92 stores and axe 300 jobs \nAround 300 jobs will be axed at Carpetright after the struggling retailer unveiled plans to shut another 81 stores and tap investors for £60m under major restructure. \nThe chain said 92 overall sites had been earmarked for closure, although 11 have already stopped trading, with the rent on another 113 set to be slashed under the company voluntary arrangement (CVA) proposals being put to landlords. \nIt said it hopes to relocate impacted staff where possible. \nThe group - which employs nearly 2,700 staff overall - also confirmed an investor cash-call to raise around £60m through a rights issue to put the firm on a firmer financial footing. \nCarpetright has more than 400 stores across the UK including 18 around the North East, two of which have recently been refurbished - at Washington and Bishop Auckland - while the Hartlepool store has only recently opened. \nThe details came as it revealed a “technical breach” of its banking arrangements, but the group said it was taking action to address this and ensure it is amended for the future. \nWilf Walsh, chief executive of Carpetright, said: “These tough but necessary actions will enable us to address the burden of a legacy UK property estate consisting of too many poorly located stores on unsustainable rents, and are essential if we are to restore our profitability and deliver a successful turnaround. “We will remain in close contact with all colleagues to keep them fully informed as we move through this process.” Carpetright CEO Wilf Walsh (Image: PA) More On", "external_links": [], "published": "2018-04-12T10:05:00.000+03:00", "crawled": "2018-04-12T12:51:47.011+03:00", "highlightTitle": ""}