{"organizations": [], "uuid": "0eb1946aa0708ab9fa0147fb65882eed12b8ec1d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article12917289.ece/ALTERNATES/s1200/JS116388016.jpg", "site_section": "http://www.thejournal.co.uk/business/?service=rss", "section_title": "nechronicle - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14485122", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast RECAP: Sky News could be sold to Disney under new plans by Rupert Murdoch", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-04-03T10:00:00.000+03:00", "replies_count": 0, "uuid": "0eb1946aa0708ab9fa0147fb65882eed12b8ec1d"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14485122", "ord_in_thread": 0, "title": "Business Breakfast RECAP: Sky News could be sold to Disney under new plans by Rupert Murdoch", "locations": [], "entities": {"persons": [{"name": "rupert murdoch jonathon manning", "sentiment": "negative"}, {"name": "embarg", "sentiment": "negative"}, {"name": "richard", "sentiment": "none"}, {"name": "jonathon manning", "sentiment": "none"}, {"name": "mon", "sentiment": "none"}], "locations": [{"name": "doncaster", "sentiment": "none"}, {"name": "yorkshire", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "disney", "sentiment": "negative"}, {"name": "hammerson", "sentiment": "none"}, {"name": "rail delivery group", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning Government 'does no know how much air pollution is emitted by diesel trains' Embargoed to 0001 Monday January 29 File photo dated 10/9/2017 of a 142 Pacer diesel train at Doncaster station, Yorkshire. More than 7,000 new train carriages are being introduced to Britain's railways, according to an industry body. PRESS ASSOCIATION Photo. Issue date: Monday January 29, 2018. The upgrade will enable an extra 6,400 services to operate each week by 2021, the Rail Delivery Group (RDG) said. Pacer trains which date back to the 1980s and were constructed using parts from buses are still in use in the north of England. They are being replaced by 281 new carriages featuring wi-fi, power sockets and digital information screens. See PA story RAIL RollingStock. Photo credit should read: Richard Woodward/PA Wire 9:10 Jonathon Manning Shopping giant Hammerson to reveal figures following eventful few months and Intu tie-up \nHammerson is expected to shed further light on future plans this week following an eventful few months. \nThe shopping centre giant, former owner of Newcastle’s Monument Mall, recently rejected a takeover approach from European rival Klepierre and it is standing by plans to seal a £3.4bn tie-up with Intu, owner of Metrocentre and Eldon Square in the North East. \nThe firm, which owns Cleveland Retail Park, will issue a trading update on Thursday, just weeks after disclosing the approach from France’s Klepierre. \nAt the time, Hammerson branded the £4.88bn cash-and-shares offer “wholly inadequate” and “entirely opportunistic”. \nThe Birmingham Bull Ring owner instead wants to press ahead with an all-share takeover of rival Intu, which would create Britain’s biggest property company with £21bn worth of assets across Europe. \nIntu operates some of the biggest centres in the UK alongside its Gateshead and Newcastle properties, including the Trafford Centre in Manchester, while Hammerson owns the Bicester Village and Brent Cross shopping centres. \nCity analysts will be expecting an explanation for Hammerson’s thinking. \nGeorge Salmon, equity analyst at Hargreaves Lansdown, said: \nIt’s been a rollercoaster few months at FTSE 100-listed Hammerson. \nIn rejecting the offer (from Klepierre), Hammerson’s board described it as ‘unsolicited and entirely opportunistic’. \nNext week’s update will give the group a platform to show exactly why. Inside intu Metrocentre in Gateshead (Image: handout from Sorted PR) 8:59 Jonathon Manning China raises tariffs on US pork and fruit in trade dispute \nChina has raised import duties on a $3bn (£2.1bn) list of US pork, apples and other products in an escalating dispute with Washington over trade and industrial policy. Pigs Jonathon Manning Construction bosses lend over a third more money to their businesses \nThe amount of money loaned by construction company directors to their own businesses to keep them afloat has increased by over a third in the past year, a new study reveals.Almost £548m was loaned last year, up from £408m in the previous 12 months, an analysis of information from 180,000 firms by Funding Options found.The business finance company said there were fears that smaller construction business owners, who represent the vast majority of these loans, may be forced to further increase lending following the collapse of Carillion, which has caused disruption across the construction industry.Many businesses that were subcontractors for Carillion will not be paid for their work, increasing the likelihood of those businesses’ directors having to cover cashflow shortages, it was suggested.Conrad Ford, founder of Funding Options, said: \nConstruction bosses have been forced to dig deeper into their own pockets to help their companies survive. \nMany directors will be worried about Carillion’s collapse and the knock-on effect it might have on their businesses - many will have already seen an impact. (Image: Daily Mirror) 8:49 KEY EVENT Nissan gender pay gap figures: Women are paid more than men but receive less in bonuses \nJapanese car giant Nissan has published its gender pay gap figures, revealing women are paid on average 15.1% more than men . \nThe manufacturer, which employs more than 6,700 at its Sunderland plant, has bucked the trend of many of the North East’s largest companies by paying its female workers more than its male staff. \nWomen working at the firm are paid a median hourly rate that is 15.1% higher than the median male pay, meaning for every £1 a man working at the company earns, a woman is paid £1.15. \nThe data covers Nissan’s five UK sites, including its Wearside plant, its research and development base in Cranfield, the parts centre in Lutterworth, design centre in London and its sales and marketing office in Rickmansworth. In total the pay of 8,405 workers was analysed. \nMark Pennifold, HR director at Nissan, said: \nNissan prides itself on providing a workplace that is diverse, inclusive and fair. \nWe deliver award-winning school initiatives designed to encourage young people in general and women in particular to consider a career in Engineering or Manufacturing, such as our GIMME (Girls in Monozukuri, Manufacturing and Engineering) programme. \nWe also have a range of Talent initiatives in place designed to support the development of female employees eg high potential development programmes, leadership &career coaching and participation in the WISE (Women in Science & Engineering) group. \nWhile on average women at Nissan were paid more than men, male workers still make up the majority of the firm’s workforce. \nThe Government requires firms to publish the proportion of female workers working in each quartile of the company’s pay bands. Women make up 6.2% of the lowest paid positions within the business, but this rises to 10.2% within the highest paid roles. \nHowever, when it comes to bonus payments, women still receive on average less than their male colleagues. The median bonus payment given to female staff members is 12.9% lower, despite 6.9% of women being eligible for bonuses, while only 3.5% of men are eligible. Workers at Nissan's plant in Sunderland (Image: PA) 8:44 Jonathon Manning Irwin Mitchell raises £19,000 for Rape Crisis \nA law firm in Newcastle has raised £19,000 for a charity that supports the survivors of rape, sexual violence and abuse in Newcastle. \nIrwin Mitchell’s Newcastle office has raised £19,000 after staff at the firm spent a year raising money for the good cause. \nRape Crisis Tyneside and Northumberland (RCTN) was voted for by staff at the office to be their Charity of the Year for 2017 as part of a nationwide initiative by the Irwin Mitchell Charities Foundation (IMCF). \nPaula Myers, Regional Managing Partner at Irwin Mitchell’s Newcastle office, said: \nIt’s an honour to be able to provide this record donation to a truly fantastic cause in our local community. \nLast year we celebrated 20 years of the IMCF and I am delighted that thanks to the creativity and generosity of Irwin Mitchell employees, we made our anniversary year a record breaking one. \nEveryone at IM is passionate about giving back to the communities we operate in and making a real difference to the lives of those supported through our Charities of the Year programme. \nWe are incredibly proud of what we achieved last year. Hearing how Rape Crisis is going to use the donation, and the positive impact that will have on survivors of sexual violence, is spurring on our staff to think of bigger and better ways to fundraise for this year’s good cause. 8:39 Jonathon Manning North Shields firm turns former pub into its new offices \nAccountancy firm Blu Sky is moving into what was Ye Olde Hundred pub in a prominent location in North Shields, with a a £200,000 investment that will see the ground floor of the old pub converted into office space. \nThe building in Church Way – known locally as the Tun - closed as a pub in 2014. \nOriginally it consisted of two older pubs. Robert Potts owned the Victoria Inn at 100 Church Way – hence the name – and his sister ran The Angel Inn on Albion Road. They merged in 1895 and became Ye Olde Hundred Inn. \nJon Dudgeon, partner at Blu Sky said: \nWe’ve been based in North Shields since day one and our steady expansion over the past 10 years inevitably led to our current offices in Northumberland Square being unsuitable for the needs of our 20 members of staff. \nWe’ve been searching for new office premises for quite some time but could never quite find the kind of space that suited our type of business. \nI walk past the Tun every day and could see that it had real potential to support a move from social space to business offices with the right vision and investment. \nBlu Sky is a very forward-thinking company and we like to challenge the accepted business model and service expectations of a traditional accountancy firm. \nOur new offices needed to reflect this and transforming a former pub certainly fits the bill. We wanted an open plan space that took into account our flexible approach to working and the lounge area of the pub really supports this type of environment. \nThe offices have been designed by Blake Hopkinson Architects and are currently under construction by North East building firm, JD Joinery and Building Services through its commercial building division. Blu Sky's Jon Dudgeon at the former Tun pub in North Shields (Image: Copyright unknown) 8:33 KEY EVENT De La Rue set to challenge the Government over Blue passport deal \nDe La Rue is set to announce that it will challenge the Government’s decision not to renew a deal that would see the firm manufacture UK passports in Gateshead. \nThe Guardian is reporting that De La Rue will formally launch an appeal against the decision to award the contract to French-Dutch firm Gemalto. \nDe La Rue has manufactured UK passports from its Team Valley factory for the last 10 years but the firm’s chief executive Martin Sutherland has previously said the firm was undercut by Gemalto. \nThe European firm has not been officially announced as the winner of the contract, but the deal was expected to be formally signed today. \nIn a statement, given to the Guardian, De La Rue said: \nBased on our knowledge of the market, it’s our view that ours was the highest quality and technically most secure bid. \nIt added: \nWe can accept that we weren’t the cheapest. De La Rue in Gateshead, which has lost the contract to make British passports (Image: Daily Mirror) 8:28 KEY EVENT More than 20,000 jobs have been lost this year - with more set to go \nA staggering 21,000 jobs have been axed in the first three months of the year as retail store closures, company restructurings and Carillion’s collapse resulted in a bleak quarter. \nNumbers crunched by the Press Association show that approximately 21,413 staff have been made redundant or seen their role put under threat, with the bulk of them working for well known high street chains. \nSince January Toys R Us and Maplin have filed for administration, while fashion retailers such as New Look and Select have embarked on radical store closure programmes. \nOnly last week, Bargain Booze owner Conviviality said it plans to call in administrators within the next 10 days, putting 2,600 jobs at risk. \nPiling on the misery has been the under pressure casual dining sector, with Prezzo, Byron and Jamie’s Italian all shutting restaurants and culling hundreds of jobs. \nRetailers have been hammered by Brexit-fuelled inflation, soaring business rates and falling consumer confidence, but experts also point to structural changes in the sector. \nDuncan Brewer, partner at consultancy Oliver Wyman, said: \nWhat we’re seeing play out is a mixture of different things. \nCost is one of the biggest pressures out there. The devaluation of sterling, increased labour costs and business rates will be having an effect. \nThe high cost operating model businesses that are not offering customers what they want are being squeezed by better quality, or lower-cost rivals that are. \nWe’re also seeing a move towards improvements in productivity, with some businesses positioning themselves for the future, which will leave others less able to compete. \nSupermarket giants have also made swingeing cuts to shop floor staff, with Morrisons, Sainsbury’s and Tesco axing 5,200 roles between them. \nMr Brewer added that the sector’s future prospects are dependent on consumer confidence, which has tanked since the Brexit vote. \nElsewhere, the collapse of outsourcer Carillion has so far resulted in over 1,700 job losses, with more pain expected. \nBritish Gas owner Centrica has recently announced it will axe 4,000 roles over the next three years under a ramped-up efficiency programme. A Carillion sign (Image: PA) 8:18", "external_links": [], "published": "2018-04-03T10:00:00.000+03:00", "crawled": "2018-04-03T20:31:29.026+03:00", "highlightTitle": ""}