{"organizations": [], "uuid": "fb13f70d3b89c91ac18e7b6e29e18c80aa088519", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article11826112.ece/ALTERNATES/s1200/JS93357410.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/north-east-could-become-home-14513826", "country": "GB", "domain_rank": 21960, "title": "The North East could become home to a Brexit museum say campaign organisers", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-04-10T18:00:00.000+03:00", "replies_count": 0, "uuid": "fb13f70d3b89c91ac18e7b6e29e18c80aa088519"}, "author": "Mike Kelly", "url": "https://www.chroniclelive.co.uk/news/north-east-news/north-east-could-become-home-14513826", "ord_in_thread": 0, "title": "The North East could become home to a Brexit museum say campaign organisers", "locations": [], "entities": {"persons": [{"name": "lee rotherham", "sentiment": "none"}, {"name": "gawain towler", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "european union", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}, {"name": "lincoln", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News The North East could become home to a Brexit museum say campaign organisers Plans for the museum are still in their infancy but the people behind it think a North East city has a good claim Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily   Thank you for subscribing!   \nPlans for a ‘Brexit Museum’ have been launched and organisers say a North East city could eventually house it. \nSunderland was famously the first place in Britain to declare its support for Leave on the night of the EU referendum in June 2016. \nAnd its place in history could further be cemented if the people behind the museum decided to locate it there. \nBackers of the project, formally known as ‘the Museum of Sovereignty’, have also identified Lincoln as a possible home because of its association with Euroscepticism but nothing has been decided yet. Leave campaigners celebrate as they win the vote in Sunderland during the North East region European Union referendum count on June 24, 2016 \nIt is the idea of Gawain Towler, a former UKIP spokesman; Lee Rotherham, a Vote Leave campaigner; and Alex Deane, a Grassroots Out campaign executive. \nMr Rotherham, said: “Sunderland could be one of the potential sites as it is strongly associated with the Leave vote. \n“It’s also got good transport links and is relatively central.” \nHe added: “There will be a whole range of criteria to be met and there are a number of obvious candidates and Sunderland certainly is one of them.” \nThe plan for the museum has been launched with a website https://www.museumofbrexit.uk/ containing details of places where people can donate items, anything from drafts of major speeches to campaign memorabilia and leaflets and photographs. Daily Mirror front page on 01/01/1973 (Image: Mirrorpix) \nThey plan to gather an academic trove of artefacts, papers and books chronicling not just Brexit, but also the decades of Eurosceptic activism that preceded it going back to 1973, when the UK joined the European Economic Community. \nThey hope there will be input from supporters of EU membership too. \n“In 40 years time we want people to know that the Brexit referendum wasn’t just a period of six months in British history,” said Mr Rotherham. \nHowever he said it will be some years yet before any museum will be up and running. \n“The Brexit debate is on-going and we still don’t know what the final model is,” said Mr Rotherham. “We don’t want to distract from that debate. \n“It’s highly controversial and still divides the country. We want to allow a bit of time for passions to die down.” \nHe added: “The transition period will be difficult for some sectors and communities - we need to allow a bit of distance to be able to look forward.” Like us on Facebook", "external_links": [], "published": "2018-04-10T18:00:00.000+03:00", "crawled": "2018-04-11T00:05:58.001+03:00", "highlightTitle": ""}