{"organizations": [], "uuid": "fd15c9bd480eec8777eec2f52db38c7dc5baf96e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.derbytelegraph.co.uk/incoming/article1504159.ece/ALTERNATES/s1200/golf3.jpg", "site_section": "", "section_title": "", "url": "https://www.leicestermercury.co.uk/news/local-news/police-race-alleged-golf-course-1504121", "country": "GB", "domain_rank": 48128, "title": "Police race to alleged golf course brawl in buggies - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-04-26T03:00:00.000+03:00", "replies_count": 0, "uuid": "fd15c9bd480eec8777eec2f52db38c7dc5baf96e"}, "author": "Share", "url": "https://www.leicestermercury.co.uk/news/local-news/police-race-alleged-golf-course-1504121", "ord_in_thread": 0, "title": "Police race to alleged golf course brawl in buggies - Leicester Mercury", "locations": [], "entities": {"persons": [], "locations": [{"name": "greenway hall golf club", "sentiment": "none"}], "organizations": [{"name": "leicester mercury police", "sentiment": "negative"}, {"name": "staffordshire police", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Police race to alleged golf course brawl in buggies Four golfers were arrested on suspicion of assault Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nFour golfers were arrested after police used buggies to get to the scene of an alleged brawl on a golf course.\nThe officers were responding to initial reports of an \"eight-man brawl\" on the fourth hole of the course. The four men were arrested on suspicion of assault.\nA spokesman for Staffordshire Police told Stoke-on-Trent Live : \"Our officers used their initiative and utilised two golf buggies when they were called to reports of an incident at the golf course.\n\"The officers responded to a report of an alleged assault at Greenway Hall Golf Club at around 1.55pm on Friday. On arrival the officers used two golf buggies to quickly get to the location on the course. Staffordshire Police race to the eight-man brawl in two of the buggies\n\"Four men were arrested at the scene on suspicion of assault. A man was treated at the scene for minor injuries.\"\nPolice have also revealed that weapons were used in the incident - and \"bones had been broken\". Read More Holiday makers might have to pay to get into EU countries after Brexit\nThe drama unfolded at Greenway Hall Golf Club, in Stanley Road, Stockton Brook, at 1.55pm on Friday.\nChief Inspector John Owen, commander of Stoke-on-Trent North, said: \"I'm very proud of my officers. They've used initiative, gone to a fight (as we always do) outnumbered, and have resolved it resulting in peace and order. Hole in one I'd say!\" Greenway Hall Golf Club\nThe police spokesman added that, after an investigation, the four arrested men were released \"without further action\".\nIt has been claimed that the dispute related to complaints about slow play between two groups of golfers. Read More A third of Poundworld stores could close as company struggles to stay afloat\nGreenway Hall Golf Club has been contacted for a statement regarding the incident.\nAnyone with any information about Friday's incident should call the police on 101, quoting incident number 410 of April 20. Like us on Facebook ", "external_links": [], "published": "2018-04-26T03:00:00.000+03:00", "crawled": "2018-04-26T22:29:37.024+03:00", "highlightTitle": ""}