{"organizations": [], "uuid": "bd13d46d4f0c54572b5677ac7b8ba85163106b67", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14593349.ece/ALTERNATES/s1200/FILE-Amber-Rudd-Resigns-As-Home-Secretary.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/uk-news/who-replace-amber-rudd-home-14593438", "country": "GB", "domain_rank": 21960, "title": "Who will replace Amber Rudd as Home Secretary? Michael Gove and Sajid Javid bookies' favourites", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-04-30T11:04:00.000+03:00", "replies_count": 0, "uuid": "bd13d46d4f0c54572b5677ac7b8ba85163106b67"}, "author": "Simon Meechan", "url": "https://www.chroniclelive.co.uk/news/uk-news/who-replace-amber-rudd-home-14593438", "ord_in_thread": 0, "title": "Who will replace Amber Rudd as Home Secretary? Michael Gove and Sajid Javid bookies' favourites", "locations": [], "entities": {"persons": [{"name": "rudd", "sentiment": "neutral"}, {"name": "michael gove", "sentiment": "neutral"}, {"name": "sajid javid", "sentiment": "neutral"}, {"name": "theresa may", "sentiment": "none"}, {"name": "javid", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "caribbean", "sentiment": "none"}, {"name": "windrush scandal", "sentiment": "none"}], "organizations": [{"name": "house of commons", "sentiment": "none"}, {"name": "guardian", "sentiment": "none"}, {"name": "home office", "sentiment": "none"}, {"name": "ladbrokes", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Who will replace Amber Rudd as Home Secretary? Michael Gove and Sajid Javid bookies' favourites Amber Rudd resigned on Sunday night in the wake of the Windrush Scandal, Ladbrokes has had a flurry of bets on Javid taking over Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nOne of British politics’ top jobs is up for grabs after Amber Rudd resigned as Home Secretary amid accusations she misled the House of Commons over deportation targets.\nMs Rudd stepped down a day before she was due to make a statement on deportation targets and illegal immigration, in the wake of the Windrush Scandal where the Home Office sent deportation threats to people who arrived in the UK from the Caribbean legally and had a right to remain in the country.\nMs Rudd had denied knowing about deportation targets, but a letter from her office leaked to the Guardian suggested she was aware of them. In the letter to Theresa May, Ms Rudd suggests increasing the targets by 10%. So who is set to replace Hastings and Rye MP as Home Secretary?\nHere are some of the top Tories in the running. Sajid Javid EVENS Sajid Javid, arrives in Downing Street, London, for a cabinet meeting (Image: PA)\nLadbrokes Politics initially had Michael Gove as favourite, but punters put their faith in Bromsgrove in Worcestershire MP and current Secretary of State for Communities and Local Government Sajid Javid. Ladbrokes had Mr Javid at evens odds as of Tuesday morning.\nMr Javid backed remaining in the EU, which would add balance to the Cabinet with prominent Leaver Boris Johnson in a prime role as Defence Secretary.\nMr Javid is viewed as a figure of unity, having issued a plea to ethnic minorities to look at the Government’s efforts to “put things rights” in the wake of the Windrush fiasco.\nSpeaking about Windrush this weekend, Mr Javid, who is of Pakistani descent, said: “It could have been me, my mum or my dad.” Michael Gove 5/1 Michael Gove (Image: PA)\nEarly favourite Michael Gove’s odds to replace Ms Rudd are now at 5/1\nThe Secretary of State for Environment, Food and Rural Affairs has held a string of cabinet positions, having been Minister for Justice and Education since becoming Surrey Heath MP in 2005.\nMrs May removed Mr Gove as Justice Secretary when she became Prime Minister, but appointed him as Environment Secretary a year later. In that time he has impressed with his fight against single-use plastics and his support for farmers. Mr Gove regularly appears in the media to defend the Prime Minister. He made a failed attempt to become Tory leader in 2016.\nMr Gove voted Leave in the 2016 EU Referendum . Read More Jeremy Hunt 6/1 Health Secretary Jeremy Hunt (Image: Getty Images Europe)\nBritain’s Health Secretary has held his Cabinet position since 2012. In that time, he has dealt with the 2015 junior doctors strikes and the NHS winter health crisis of 2017/18.\nHowever, Mr Hunt is currently under investigation by the Parliamentary Commissioner for Standards over a breaches of conduct in relation to a string of luxury flats he bought.\nMr Hunt campaigned to remain the EU, but has since said he would vote Leave if there was a second referendum. Karen Bradley 6/1 Northern Ireland Secretary Karen Bradley (Image: PA)\nNorthern Ireland Secretary Karen Bradley has served as Secretary of State for Digital, Culture, Media and Sport.\nHowever, it is unlikely Mrs May would chose to move Mrs Bradley from her current position, as the Northern Ireland post is crucial during the Brexit negotiations.\nMrs Bradley campaigned for Remain in the EU Referendum. James Brokenshire 8/1 James Brokenshire (Image: PA)\nMr Brokenshire stepped down as Northern Ireland Secretary in January this year. The Old Bexley and Sidcup MP was diagnosed with the early stages of lung cancer.\nBut he is back in Parliament and has experience as Immigration Secretary, a post he held between 2014 and 2016. Mr Brokenshire voted to Remain in the EU. BetFair is also taking bets on who will replace Ms Rudd\nSajid Javid evens", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-04-30T11:04:00.000+03:00", "crawled": "2018-04-30T11:23:07.003+03:00", "highlightTitle": ""}