{"organizations": [], "uuid": "4f7c2d4ba16e2774eb0957b60af3755e11bec0f4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article10663113.ece/ALTERNATES/s1200/JS77554862.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/newcastle-council-local-elections-2018-14523380", "country": "GB", "domain_rank": 21960, "title": "Newcastle local elections 2018: Candidates, wards, how to vote and other essential information", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-04-30T13:01:00.000+03:00", "replies_count": 0, "uuid": "4f7c2d4ba16e2774eb0957b60af3755e11bec0f4"}, "author": "Daniel Holland", "url": "https://www.chroniclelive.co.uk/news/north-east-news/newcastle-council-local-elections-2018-14523380", "ord_in_thread": 0, "title": "Newcastle local elections 2018: Candidates, wards, how to vote and other essential information", "locations": [], "entities": {"persons": [{"name": "tyne", "sentiment": "none"}], "locations": [{"name": "newcastle civic centre", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "newcastle city council", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "local government boundary review", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email\nNewcastle voters will head to the polls on Thursday, May 3.\nAll 78 of Newcastle’s councillor posts are up for grabs when every seat is contested.\nThe Labour Party will be hoping to maintain its majority, currently holding 53 of the council’s seats.\nHere is all you need to know about the vote: What kind of council is it?\nNewcastle City Council is the local authority for the metropolitan borough of Newcastle upon Tyne and is based at Newcastle Civic Centre.\nHow many councillors are up for election?\nAll 78 of Newcastle’s councillor posts are up for grabs when voters go to the polls on May 3. The council usually operates a system whereby a third of councillors - one for each of the 26 wards - are elected every year, with no elections in the fourth year.\nBut since the last set of local elections were held in 2016, the Local Government Boundary Review has altered the boundaries of every ward in Newcastle to ensure a more even spread of voters - this means that every seat will be contested this year, with voters choosing up to three candidates on their ballot paper. How will this affect future elections?\nOf the three candidates elected in each ward this year, the one with the fewest number of votes will be up for re-election in 2019. Those who finish second will be up for re-election in 2020, while the candidate with the most votes will serve a full four-year term of office to 2022. The new Newcastle ward boundaries for the 2018 local elections (Image: Newcastle City Council) What is the current make-up of the council?\nThe ruling Labour group has 53 seats, while there are 20 Liberal Democrats and four independents. There is currently one vacant seat in South Jesmond, after Kerry Allibhai stepped down in December.\nThe Labour group is led by leader of the council, Nick Forbes, and the Liberal Democrats are led by Anita Lower.\nNewcastle has been predominantly a Labour-held council and was red between 1974 and 2004. The Liberal Democrats were in control between 2004 and 2011 under the leadership of Peter Arnold, John Shipley and David Faulkner. Who is the leader of the council?\nNick Forbes, who has been a councillor representing the Westgate ward since he was 26, in the year 2000. He became leader in 2011 and is also leader of Labour’s Local Government Association group. Which seats are being fought over?\nThe new ward boundaries and the extra number of candidates standing create a greater degree of uncertainty in terms of where the battlegrounds will be during this election.\nThe Liberal Democrats lost two seats to Labour in North Jesmond and Ouseburn in 2016, so will be keen to regain those.\nThere are currently no Conservatives on the council, so they will be hopeful of making a push in areas such as Gosforth.\nThere are eight candidates on the ballot from the Newcastle upon Tyne Community First Party across five wards in the west of the city, a further 10 independents, and one communist - Martin Levy in South Jesmond.\nThe newly-created Chapel ward will be one to watch on election night, with three independent candidates - including sitting Westerhope councillor Marc Donnelly - in a battle with Labour, the Lib Dems, and the Tories. Where are the high-profile candidates standing?\nCity council leader Nick Forbes is standing in the newly-created Arthur’s Hill ward, as his Westgate ward is being abolished. His deputy, Joyce McCarty, is looking to retain her Wingrove seat.\nCabinet members Ged Bell (Kenton), Arlene Ainsley (South Jesmond), Karen Kilgour (West Fenham), Kim McGuinness (Lemington), Nick Kemp (Byker), Veronica Dunn (Byker), Jane Streather (Gosforth) and Nora Casey (Blakelaw) are all up for re-election.\nLiberal Democrat leader Anita Lower is standing in Castle ward and her deputy, Wendy Taylor, in Dene and South Gosforth. What are the issues getting people talking?\nBudget cuts have long dominated the agenda in Newcastle - the council says it will have lost £283m since 2010 by the end of the current budget cycle in 2020. That has resulted in significant rises to council tax, as well as severe pressures on social care and other vital services.\nCouncillors elected this year will also be tasked with guiding the city through Brexit and the new North of Tyne devolution process, as well as hosting the Great Exhibition of the North.\nOther hot button issues in Newcastle in the past year have included homelessness, bin collections, improvements to rail services and the Tyne and Wear Metro, and a number of major redevelopment and housing projects. Read More When is the deadline for registering to vote?\nThe registration deadline is midnight on Tuesday April 17. Anyone can apply online at gov.uk/register-to-vote.\nThe deadline to apply for a postal vote or change an existing postal vote is 5pm on Wednesday April 18.\nThe deadline to apply for a proxy vote is 5pm on Wednesday April 25.\nIf you were eligible to vote in last year’s general election and your details have not changed, you will still be registered to vote. If in doubt, check your details by ring the council’s Electoral Services Department on 0191 2787878. Full list of election candidates\nArthur’s Hill\nNick Forbes - Labour and Co-operative\nDaniel Gilmore - Trade Unionist and Socialist Coalition\nJoanne Kingsland - Labour and Co-operative\nShirley Mansfield - Liberal Democrats", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-04-30T13:01:00.000+03:00", "crawled": "2018-04-30T15:08:22.042+03:00", "highlightTitle": ""}