{"organizations": [], "uuid": "bd005ab435576a916e366a85dfc33b8e3c220034", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14483047.ece/ALTERNATES/s1200/Carillion-crisis.jpg", "site_section": "http://www.thejournal.co.uk/business/?service=rss", "section_title": "nechronicle - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/more-20000-jobs-been-lost-14482941", "country": "GB", "domain_rank": 21960, "title": "More than 20,000 jobs have been lost this year - with more set to go", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-04-02T13:26:00.000+03:00", "replies_count": 0, "uuid": "bd005ab435576a916e366a85dfc33b8e3c220034"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-news/more-20000-jobs-been-lost-14482941", "ord_in_thread": 0, "title": "More than 20,000 jobs have been lost this year - with more set to go", "locations": [], "entities": {"persons": [{"name": "byron", "sentiment": "none"}, {"name": "jamie", "sentiment": "none"}, {"name": "maplin", "sentiment": "none"}, {"name": "prezzo", "sentiment": "none"}, {"name": "conviviality", "sentiment": "none"}], "locations": [], "organizations": [{"name": "press association", "sentiment": "none"}, {"name": "bargain booze", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "A Carillion sign (Image: PA) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nA staggering 21,000 jobs have been axed in the first three months of the year as retail store closures, company restructurings and Carillion’s collapse resulted in a bleak quarter. \nNumbers crunched by the Press Association show that approximately 21,413 staff have been made redundant or seen their role put under threat, with the bulk of them working for well known high street chains. \nSince January Toys R Us and Maplin have filed for administration, while fashion retailers such as New Look and Select have embarked on radical store closure programmes. \nOnly last week, Bargain Booze owner Conviviality said it plans to call in administrators within the next 10 days, putting 2,600 jobs at risk. \nPiling on the misery has been the under pressure casual dining sector, with Prezzo, Byron and Jamie’s Italian all shutting restaurants and culling hundreds of jobs. \nRetailers have been hammered by Brexit-fuelled inflation, soaring business rates and falling consumer confidence, but experts also point to structural changes in the sector. \nDuncan Brewer, partner at consultancy Oliver Wyman, said: “What we’re seeing play out is a mixture of different things. \n“Cost is one of the biggest pressures out there. The devaluation of sterling, increased labour costs and business rates will be having an effect. \n“The high cost operating model businesses that are not offering customers what they want are being squeezed by better quality, or lower-cost rivals that are. \n“We’re also seeing a move towards improvements in productivity, with some businesses positioning themselves for the future, which will leave others less able to compete.” Read More Shopping giant Hammerson to reveal figures following eventful few months and Intu tie-up \nSupermarket giants have also made swingeing cuts to shop floor staff, with Morrisons, Sainsbury’s and Tesco axing 5,200 roles between them. \nMr Brewer added that the sector’s future prospects are dependent on consumer confidence, which has tanked since the Brexit vote. \nElsewhere, the collapse of outsourcer Carillion has so far resulted in over 1,700 job losses, with more pain expected. \nBritish Gas owner Centrica has recently announced it will axe 4,000 roles over the next three years under a ramped-up efficiency programme. \nCompounding the misery was the closure of Norwich’s iconic Colman’s mustard factory, which saw 113 workers culled and was followed by drinks giant Coca-Cola shutting sites in Milton Keynes and Northampton. Read More North East's four universities set up accelerator to boost region's economy \nUnions have placed the blame for the dire figures firmly at the feet of the Government, blaming Theresa May’s Conservative party for economic mismanagement. \nTim Roache, general secretary of the GMB union, said: “A strong economy doesn’t see job losses like this. It’s time to invest in British industry and put forward a plan for real jobs, that pay a decent wage. \n“It’s not rocket science, but such a level of common sense seems to be escaping ministers, who are busy concentrating on backbench Brexit squabbles, and not sorting out the economy. \n“And when the Government does try to tackle industry issues, it fails to include any voice for workers, giving the impression that their views aren’t legitimate despite working at the coal face in British industries.” Like us on Facebook", "external_links": [], "published": "2018-04-02T13:26:00.000+03:00", "crawled": "2018-04-02T16:30:41.013+03:00", "highlightTitle": ""}