{"organizations": [], "uuid": "62258c9f0abe97aa8f0278cc3c6ad454adf5c34a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14563174.ece/ALTERNATES/s1200/JS142348565.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14556919", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Capita seeks £701m from investors as loss widens to £513m", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-04-23T10:00:00.000+03:00", "replies_count": 0, "uuid": "62258c9f0abe97aa8f0278cc3c6ad454adf5c34a"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14556919", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Capita seeks £701m from investors as loss widens to £513m", "locations": [], "entities": {"persons": [{"name": "david harrison", "sentiment": "none"}], "locations": [{"name": "blockchain", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "coreena ford newcastle", "sentiment": "negative"}, {"name": "true potential", "sentiment": "none"}, {"name": "fintech", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford Safestyle dives on profit warning \nShares in Safestyle plummeted this morning after the double-glazing windows and doors firm issued a profits warning and announced the departure of its chairman. \nThe group said it has been stung by an “aggressive new market entrant” which is eating into its customer base, particularly its sales and canvass divisions. It also again pointed to declining consumer confidence. \n]“The activities of this competitor have intensified and the group has taken longer to rebuild its order intake to the rate previously anticipated, and has also experienced cost increases as management takes the necessary actions to address these challenges. \n“The board now expects group revenues and underlying profit before tax for the year ending 31 December 2018 to be significantly below current market expectations with profits for the year expected to be heavily weighted to the second half.” \nShares crashed 21% following the update. \nTo compound matters, Safestyle intends to cancel its final dividend of 7.5p a share as it scrambles to strengthen its balance sheet. 9.05 Coreena Ford Durham activity park set for major expansion - including cult ice cream parlour \nA Durham activity centre which incorporates football facilities and an indoor trampoline park is set for a major expansion following a £2m deal . \nThe activity park - consisting of Soccarena, Infinite Air Extreme Trampoline, and New Ferens Park Stadium - have been acquired by Austin Carney, who plans to bring the three parks together under the name Infinite Durham. \nThe site is based on Belmont Industrial Estate and as well as containing sports and trampolining facilities is also home to Durham Women FC. \nAlong with merging the three sites under one brand Mr Carney also plans to invest £400,000 into the facility over the next 12 months. The cash will be used to launch a Lickety Split Ice Cream Parlour, a daytime tots activity area, a food court, and upgrade facilities. \nThe expansion will create 20 new jobs at the company and take its headcount to 60. The Infinite Air Extreme Trampoline Centre in Durham 8.57 Coreena Ford Offering   \nA decision that could see British Navy ships built overseas has been branded a “kick in the teeth” for British workers by a North East MP. \nStephen Hepburn, MP for Jarrow, said it would be “appalling” if a £1bn contract to build a fleet of Navy support ships was handed to a foreign firm when workers in the North East had the skills to carry out the work. \nThe £1bn contract will see the winning bidders build a fleet of three military support ships, which will be used to service the UK’s £6.3bn Queen Elizabeth-class aircraft carriers and their strikeforce of new F-35 fighter planes. \nThe Ministry of Defence has said that the Fleet Solid Support order will go out to tender on April 30. \nBut under the current tender, North East companies looking to win the work will not only have to compete with other UK firms, but also manufacturers in Germany, Italy, the Netherlands, Poland, South Korea, and Spain. A&P Tyne in Hebburn (Image: handout) 8.50 Coreena Ford Three North East firms win Queen's Awards for Enterprise to mark Queen's 92nd birthday \nEngineers, printers and construction leaders in the North East have been singled out as Queen’s Award for Enterprise winners. \nNow in their 52nd year, the Queen’s Awards are the most prestigious business awards in the country, with winning businesses recognised as being among the best in the country. \nThis year, 230 businesses from across the UK have been recognised for their contribution to international trade, innovation, sustainable development and promoting opportunity. \nWithin the North East, three firms have made this year’s list, including Gateshead printing solutions business Gate 7, Durham construction firm Esh Group and Barnard Castle-based engineers Honeyman Group. \nBusiness secretary Greg Clark said: “The UK has some of the most entrepreneurial and innovative minds in the world delivering jobs, growth and greater choice for consumers and I am proud to see a wealth of these businesses being recognised today. \n“Small businesses are the backbone of our economy, supporting 355,000 jobs and revenues of £27bn in the North East. Through our Industrial Strategy we are building a Britain in which they will continue to thrive.” \nThe winners will attend a royal reception at Buckingham Palace in the summer to celebrate the Awards. Esh Group staff outside the company's County Durham headquarters (Image: Esh Group) 8.44 Utilitywise boosts half-year revenues to £39.7m \nEnergy consultancy Utilitywise has posted a 3% lift in revenues to £39.7m in half-yearly results. \nThe North Tyneside business saw adjusted Ebitda of £3.4m in the six months to January 31 2018, an increase of 31%. \nThe firm also saw growth in total customer numbers of 1% to around 43,000, driven by a 3% growth in the UK & Ireland, the core geographical market of the group. \nThe firm delayed publishing its full year results until March - four months after it was originally due to publish them - after it was forced to push them back when the firm’s auditor requested an independent review be carried out concerning its accounting policy. \nTrading of shares in the AIM-listed firm were put on hold while the review took place. \nThe uncertainty surrounding the suspension of shares impacted attrition levels. The company recorded energy consultant attrition of 72% for the twelve-month period ended 31 January 2018, compared to 59% in the same period last year, primarily due to a spike in attrition late in H1 FY18, caused by uncertainty regarding the suspension of the shares of the Group, as a result of the delay in the completion of the FY17 year-end audit. \nBrendan Flattery, chief executive officer, said: “The overall performance of the group in the first half is in line with our expectations with revenue, profit and cash flow all improving while we have maintained our customer base, whose satisfaction with our services, as reflected in our net promoter score, is high. \n“In the short term, we have dealt with a number of legacy issues from earlier years but, looking ahead, I remain excited about the prospects for Utilitywise.” Brendan Flattery, CEO of Utilitywise 8.32 Coreena Ford Clarkson warns over profits amid choppy waters \nShipping services giant Clarkson has warned over profits after being blown off course by a “challenging environment”. \nThe FTSE 250 firm said that profits for both the first half and the full year are “anticipated to be materially below those of last year”. \nClarkson blamed choppy conditions in shipping and offshore capital markets, which resulted in transactions being pushed back. \nThis was compounded by a “quiet period” in sale and purchase activity for the group, the firm said in a stock market announcement. \nA weaker dollar and lower freight rates within the tanker market also took their toll. “Together these have resulted in a financial performance that is below that previously expected by the board. \n“Consequently, whilst it is still too early to determine the exact impact, profits for both the first half and the full year are now anticipated to be materially below those of last year,” Clarkson said. \n]Last year, the firm booked a half year pre-tax profit of £21.9 million and £45.5 million for the full year. \nIn August 2017, Clarkson had flagged a “significant increase” in spot broking revenues and rising dry cargo rates, helping to offset lower revenues from its forward order book. The group said at the time it was “optimistic” that the company was now in a position to capitalise on the upturn in the shipping market “when it occurs”. 8.27 Coreena Ford Martin Lewis to launch legal action against Facebook over 'scam' adverts \nMoneySavingExpert founder Martin Lewis is launching a High Court legal battle to “give Facebook a bloody nose” and change the way it operates over claims the site is publishing scam adverts causing vulnerable people to hand over thousands of pounds to criminals. \nMr Lewis is due to lodge court papers today for a defamation lawsuit against Facebook over claims it has published more than 50 fake posts bearing his name in the last year, many of which are used to scam money out of people. \nMr Lewis said the legal action was the result of months of frustration with scammers piggybacking on his reputation and preying on Facebook users with outlandish get-rich-quick scams. \nHe said people have handed over thousands of pounds in good faith, only to find the advert has nothing to do with Mr Lewis or his company. \nAny damages won through the lawsuit will be donated to charity, but Mr Lewis said the real aim was to force the social media behemoth to change its policy and reduce the risk of such scams being hosted by Facebook. \nMr Lewis said: “There are customers who have lost a lot of money. Some of them won’t even talk to me because they’ve seen my face on the advert and think it’s me who has scammed them - it’s an absolute disgrace. \n“I’ve had enough of this. It’s affecting my reputation, but more importantly it is affecting real people who are handing over money in good faith while the scammers are raking in the cash. \n“I won’t be making a penny out of this, by the way - I’ve had a team of people looking at this for months now and it is time to take a stand.” Martin Lewis sues Facebook over scam adverts (Image: Getty Images) 8.18 KEY EVENT Kromek to work with Newcastle Hospitals on pioneering breast cancer detectors \nRadiation tech firm Kromek has been awarded £1.4m for a three year project which could greatly improve breast cancer detection in the North East. \nThe AIM-listed company, based at NETPark, Sedgefield, has been awarded funding from the UK’s Innovation agency, Innovate UK, for a programme to deliver a Low Dose Molecular Breast Imaging technology based on its CZT-based detectors. \nThe project, starting mid-2018 and worth £1.4m, is in partnership with Newcastle-upon-Tyne Hospitals Foundation Trust and it will use Kromek’s innovative CZT-based SPECT (Single Photon Emission Computed Tomography) detectors, which are capable of significantly lowering radiation doses in molecular breast imaging, to greatly improve the detection of cancer in a significant proportion of women. \nBy partnering with breast cancer experts at the Newcastle Hospitals for the development, the team will ensure that the technology is tuned to clinical and patient needs. \nThe low dose device will then be used in a pilot study with the Newcastle Hospitals to demonstrate the clinical benefits of incorporating Kromek’s SPECT detectors. \nDr Arnab Basu, CEO of Kromek, said: “This project is further evidence that CZT-based detectors are becoming a core technology in replacing legacy diagnostic products across the medical imaging sector. \n“Our innovative SPECT detectors are capable of significantly lowering radiation doses, thereby offering cost savings for health services and, crucially, making enhanced detection and early diagnosis of breast cancer accessible on a much wider scale. \n“We look forward to collaborating with Newcastle-upon-Tyne Hospitals NHS Foundation Trust as well as our OEM partner to carry out this vital work.” \nLouise Robson, joint acting chief executive for the Newcastle Hospitals, added: “Providing patient care which is safe and of the highest quality is a key priority for us and by working collaboratively in this way, we are able to ensure new, advanced treatments are as safe as they can be. \n“We welcome working with Kromek on this exciting initiative, and hope to see many more similar ventures which benefit patient care, whilst placing the North East firmly on the map as a leader in healthcare innovation.” Arnab Basu, ceo of Kromek 8.10 Coreena Ford Newcastle's True Potential to bring in Blockchain technology as turnover soars to £99m \nFintech firm True Potential boosted its turnover to almost £100m last year and will soon be launching a new investment platform powered by Blockchain technology. \nThe Newcastle asset management company will replace its investment platform this year with a new system that has been built with “Blockchain at its heart”. \nThe cutting-edge technology works as a digital ledger which stores information about transactions across multiple computers. The system increases security against hackers and can be used to verify the authenticity of payments and their sources. \nBlockchain will allow True Potential to process payments incredibly quickly, while increasing security and lowering costs. However, as the first UK asset management company to fully adopt the technology in this way the full extent of its functionality will only be achieved when other companies incorporate it into their systems. \nManaging partner David Harrison said: “During 2018 we will replace our current investment platform with a brand-new version, built totally in-house and incorporating Blockchain technology. This will give us total control over trading, technology, reporting and of course costs.” True Potential managing director David Harrison 8.05 Coreena Ford London's Euro clearing dominance poses a risk, German politician says \nGermany has ramped up the rhetoric as the battle to wrench euro clearing from London after Brexit continues, with a top politician dismissing the City’s claim that fragmentation represents a risk to the financial system. \nTarek Al-Wazir, economy minister for the German state of Hesse, where the country’s financial centre Frankfurt is situated, said London’s own dominance over the euro clearing industry was in itself a concern for the EU. \nHe said: “If you look at the risks ... everything concentrated in one place is, at the end, the riskiest thing you can have. \n“I don’t think that if you have two places, for example, or three places (where euro clearing is based) that it’s more risky. I think the opposite is true. \n“If you have the risk offshore - and don’t forget from the perspective of the European Union the UK will be something like ‘offshore’ ... why should the European taxpayer accept that in case something goes wrong that you have to, in the worst case, help someone to survive if you have no possibility to somehow supervise what he’s doing?” \nThe comments come as rival European centres vie for the multibillion-pound market that could leave London as a result of Brexit. London's Euro clearing dominance poses a risk, it has been claimed 8.00 KEY EVENT Capita taps up investors for £701m \nOutsourcing giant Capita has posted a £513.1m annual pre-tax loss as the firm counted the cost of impairments and provisions. \nThe figure compares to an £89.8m loss in 2016 and comes as Capita booked £850.7 million of “specific non-underlying items” which dragged on its performance. Revenue fell 4% to £4.23bn in the year to December 31 and the firm also announced a £701m rights issues as part of a transformation strategy under new chief executive Jonathan Lewis. \nThe proceeds of the rights issue will be used to reduce Capita’s debt and make investments. \nAs part of the new strategy, the outsourcer is targeting annualised cost savings of £175m by the end of 2020 and around £300m from disposals in 2018. \nThe group said: “Capita has today announced its new strategy which aims to simplify and strengthen the business in order to deliver future success. \n“Capita’s objective is to become a more focused and predictable, client-centric company, generating sustainable free cash flow. Capita believes that changes to its operating model under its new strategy will deliver enhanced performance through increased simplification, efficiency, standardisation and focus.” \nMr Lewis said: \nToday we have announced a new strategy to simplify and strengthen Capita. \nWe need to simplify Capita by focusing on growth markets and to improve our cost competitiveness. We need to strengthen Capita and plan to invest up to £500m in our infrastructure, technology and people over the next three years. \nThere is a lot to do, but I am confident that the plan is clear and prudent. Capita will become more predictable, have stronger operational discipline and consistently delight its clients. Capita have an office at Lingfield Point in Darlington More On", "external_links": [], "published": "2018-04-23T10:00:00.000+03:00", "crawled": "2018-04-23T10:16:20.019+03:00", "highlightTitle": ""}