{"organizations": [], "uuid": "9ed4f6318f6796e1dc1804b079e5718cc4292f50", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14552375.ece/ALTERNATES/s1200/Blaydon-MP-Liz-Twist-with-De-La-Rues-chief-operating-officer-Bryan-Gray-during-a-tour-of-the-compan.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/blue-passport-decision-too-important-14552345", "country": "GB", "domain_rank": 21960, "title": "Blue passport decision 'too important to be made on price', Gateshead MP says", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-04-19T19:28:00.000+03:00", "replies_count": 0, "uuid": "9ed4f6318f6796e1dc1804b079e5718cc4292f50"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/blue-passport-decision-too-important-14552345", "ord_in_thread": 0, "title": "Blue passport decision 'too important to be made on price', Gateshead MP says", "locations": [], "entities": {"persons": [{"name": "blaydon", "sentiment": "negative"}, {"name": "li", "sentiment": "negative"}, {"name": "bryan gray", "sentiment": "none"}, {"name": "liz twist", "sentiment": "none"}, {"name": "de la rue", "sentiment": "none"}], "locations": [{"name": "gateshead", "sentiment": "none"}, {"name": "de la rue's gateshead", "sentiment": "none"}, {"name": "team valley", "sentiment": "none"}], "organizations": [{"name": "business blue", "sentiment": "negative"}, {"name": "gemalto", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Blue passport decision 'too important to be made on price', Gateshead MP says Blaydon MP Liz Twist visited workers at De La Rue's Gateshead factory after the firm lost a major government contract Share Blaydon MP Liz Twist with De La Rue's chief operating officer Bryan Gray during a tour of the company's Gateshead factory (Image: Unknown) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nNorth East MP Liz Twist says the decision about who makes British passports is too important to be made solely on price, after she visited De La Rue’s Gateshead factory. \nThe Blaydon MP made her comments after visiting De La Rue’s Gateshead factory, just days after the company revealed it would not be appealing the Government’s decision to hand a major passport manufacturing contract to Franco-Dutch firm Gemalto. \nDe La Rue has been manufacturing British passports from its Team Valley factory in Gateshead for the last 10 years, but was recently outbid on the contract by Gemalto. The European firm will now be tasked with producing the blue passports after Brexit. \nMs Twist said: “I really feel that staff have been doing a brilliant job at delivering the contract. I still remain concerned at the deliverability of the contract at a price that is so much lower. How a British passport will look after Brexit and a burgundy UK passport in the European Union style format (Image: PA) \n“There are concerns about the deliverability of the contract and that the passports are being manufactured in two places. \n“I think we have started from the wrong place on this. Our UK passports are too important to go through a procurement process based on price.” \nDe La Rue’s Gateshead factory employs around 600 people, including around 200 in the firm’s passport division. The company has said it is too early to tell whether the loss of the contract will lead to job cuts but added it will be working to find new contracts to replace the work. \nMs Twist added: “The staff are shocked and concerned and everyone is keen to get on with the job they are doing and do the best they can. They are keen for the company to win additional work.” \nMs Twist also said she would do all she could to support the workers who may be affected by the loss of the contract. De La Rue in Gateshead, which has lost the contract to make British passports (Image: Daily Mirror) \nDe La Rue’s chief operating officer Bryan Gray said: “We remain both surprised and disappointed by the decision of HMPO to award the contract to a competitor. We believe De La Rue submitted the highest quality and technically most secure bid. \n“However, having considered all the legal and commercial implications of pursuing legal action, we have concluded that it is not in the best interests of the company to proceed with an appeal. \n“We know what a blow this is for the team at Gateshead who have worked so hard to deliver the UK passport with an unblemished record for the last nine years and for the broader economy in the North East. We will work with HMPO and Gemalto to support the transition and in particular work on securing jobs for our staff. \n“We will now focus on looking for other business opportunities and hope to secure new contracts over the next 18 months in our international markets in ID, currency and authentication, all areas of growth for us.” Like us on Facebook", "external_links": [], "published": "2018-04-19T19:28:00.000+03:00", "crawled": "2018-04-20T02:48:04.004+03:00", "highlightTitle": ""}