{"organizations": [], "uuid": "53e60d7c0004ffa45649da5bab2191330bbdfb59", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.plymouthherald.co.uk/incoming/article1483368.ece/ALTERNATES/s1200/39484388445_c277f255d8_o.jpg", "site_section": "http://www.westernmorningnews.co.uk/editorschoices.rss", "section_title": "devonlive - frontpage", "url": "https://www.devonlive.com/news/devon-news/farmers-must-speak-up-insist-1483341", "country": "GB", "title": "Farmers must speak up to insist on right post-Brexit deal", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-04-20T18:42:00.000+03:00", "replies_count": 0, "uuid": "53e60d7c0004ffa45649da5bab2191330bbdfb59"}, "author": "Athwenna Irons", "url": "https://www.devonlive.com/news/devon-news/farmers-must-speak-up-insist-1483341", "ord_in_thread": 0, "title": "Farmers must speak up to insist on right post-Brexit deal", "locations": [], "entities": {"persons": [{"name": "michael gove", "sentiment": "none"}, {"name": "athwenna irons", "sentiment": "none"}, {"name": "gove", "sentiment": "none"}, {"name": "frank perry", "sentiment": "none"}], "locations": [{"name": "birmingham", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}], "organizations": [{"name": "national farmers' union", "sentiment": "none"}, {"name": "nfu", "sentiment": "none"}, {"name": "whitehall", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News opinion Environment Secretary Michael Gove speaking at this year's National Farmers' Union (NFU) Conference in Birmingham (Image: NFU) Share   Thank you for subscribing!   \nIn under three weeks’ time, the deadline for the Government’s future agricultural policy consultation will be upon us. \nCome May 9, Environment Secretary Michael Gove and his Defra team will retreat to the darkest corners of Whitehall to begin the monumental task of analysing 10 weeks’ worth of responses from farmers, landowners and food producers across the country – all keen to share their thoughts on how a new domestic policy should look and work for the industry. \nAnd hopefully among those contributions set to land on Mr Gove’s desk next month will be plenty from the South West, from farmers and growers on the front line of production working day-in, day-out to put food of world-leading quality not only on the region’s but nation’s dining tables. Farming is on the brink of 'monumental change', says the Western Morning News' farming editor, Athwenna Irons (Image: Frank Perry / Getty Images) \nIt really is in farmers’ interests to join the consultation and give their view on how direct payments under the CAP should be phased out, the range of public goods that could qualify for government funding and measures to move away from unnecessary red tape, as well as new industry incentives to drive innovation and profitability. \nIt was only in last week’s Farmers Guardian that Mr Gove stressed he wanted as many people as possible to respond to the consultation, in order to ensure that future policy was not shaped by “vested interests with the money, connections or power to push their agenda”. Read More Free sheep shearing workshops in Cornwall and Devon to help shearers of all abilities \nMr Gove is not a farmer or food producer. Decisions made following this consultation on the industry’s future outside of the European Union won’t affect how he goes about his day-to-day life or manages his finances. \nBut for farmers, these proposals are arguably the most significant development in Government laying out UK agricultural policy since the passing of the 1947 Agriculture Act. Whether you’re growing cauliflowers in West Cornwall, producing free range eggs in Devon or rearing Belted Galloways on the heights of Exmoor, change after Brexit is inevitable. Farmers all around the country - including the South West - are being urged to submit their evidence to the Government's future agricultural policy consultation \nTherefore it is so important that farmers make the time to read the consultation paper and submit their evidence. You’re the ones who know and understand the countryside better than any politician ever could. Knowledge which has not been learned out of a text book, but rather passed down through the generations. \nWe desperately want Mr Gove to listen to what farmers have to say, but in order to do that farmers themselves must speak up. It’s no use keeping your knowledge and opinions to yourself. While life on the farm will undoubtedly be busy over the next few weeks, as many will be playing catch-up after all the recent rain, hopefully farmers who haven’t yet taken part in the consultation can find the time of an evening to sit down and make their voices heard. Read More Vigilante animal rights group releases thousands of pheasants from Devon farm \nAgriculture is on the brink of monumental change but with the backing of those who know it best, I think it stands every chance of getting the deal it deserves. \nThe consultation will close on Tuesday, May 8. Farmers can respond either online at www.gov.uk/government/consultations/the-future-for-food-farming-and-the-environment , by emailing agricultureconsultation@defra.gsi.gov.uk or in writing to Agriculture Consultation Team, 1b – Future Farming Directorate, Department for Environment, Food and Rural Affairs Nobel House, 17 Smith Square, London, SW1P 3JR. Like us on Facebook", "external_links": [], "published": "2018-04-20T18:42:00.000+03:00", "crawled": "2018-04-20T19:19:39.000+03:00", "highlightTitle": ""}