{"organizations": [], "uuid": "7ea195540da7cf3c9c4f9ecacd021c6c437520fb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article805748.ece/ALTERNATES/s1200/35385509.jpg", "site_section": "http://www.leicestermercury.co.uk/rss.xml", "section_title": "leicestermercury - frontpage", "url": "https://www.leicestermercury.co.uk/news/business/leicestershire-companies-hks-retail-qdos-1444689", "country": "GB", "domain_rank": 48128, "title": "Leicestershire companies HKS Retail and QDOS make top 100 list of most profitable UK companies", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-04-12T07:01:00.000+03:00", "replies_count": 0, "uuid": "7ea195540da7cf3c9c4f9ecacd021c6c437520fb"}, "author": "Tom Pegden", "url": "https://www.leicestermercury.co.uk/news/business/leicestershire-companies-hks-retail-qdos-1444689", "ord_in_thread": 0, "title": "Leicestershire companies HKS Retail and QDOS make top 100 list of most profitable UK companies", "locations": [], "entities": {"persons": [{"name": "shane thakrar", "sentiment": "none"}, {"name": "chris gordon", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "thurmaston", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "east midlands", "sentiment": "none"}], "organizations": [{"name": "leicestershire", "sentiment": "negative"}, {"name": "news leicestershire", "sentiment": "negative"}, {"name": "hks retail", "sentiment": "negative"}, {"name": "qdos", "sentiment": "none"}, {"name": "qdos group", "sentiment": "none"}, {"name": "sunday times bdo", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Leicestershire companies HKS Retail and QDOS make top 100 list of most profitable UK companies Insurance firm QDOS - with profit margin of 51.5 per cent - had the \"highest profit margin\" of any private company on the list Share Shane Thakrar of HKS Retail - The family business has expanded exponentially and won lots of awards (Image: Chris Gordon) Share Get Business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nTwo Leicestershire companies have made it onto a list of 100 British companies with the fastest-growing profits. \nFuel forecourt operator HKS Retail , in Leicester and insurance broker and business consultancy The Qdos Group in Thurmaston were among seven East Midlands high risers to make it onto the Sunday Times BDO Profit Track 100 league table. \nThe list suggests HKS Retail – which operates from more than 70 service station forecourts – has seen profits rise 72 per cent over the last three years placing it 49 in the fastest growers list. According to the research its latest profits stood at £6.4 million. \nMeanwhile QDOS – which has big overseas expansion plans – has seen a 70 per cent rise in profits over three years, placing it 55th on the national list. \nIts latest profits were £7.1 million. \nQDOS chief executive Seb Maley said that with a profit margin of 51.5 per cent in 2017, the insurance technology business, had the highest profit margin of any private company on the list. \nHe said the recent success was down to continuous innovation, a lean business model with a low headcount of just 71, and rapidly scalable solutions. \nMr Maley said: “Obviously, we’re delighted at being the private company with the highest growing profit margin in the UK. \n“Placing first is a huge achievement, and a testament to the entire team’s dedication to providing innovative insurance solutions day-in, day-out. QDOS chief executive Seb Maley \n“We recognised that to keep pace with the evolving employment landscape, insurance and workplace solutions desperately needed innovating. \n“And so, we invested in researching, developing and building our own solutions, which has contributed to our recent success. \n“Our investment and focus on technology has allowed us to maintain a relatively small cost base and headcount whilst driving growth through our online platforms, which we made sure were scalable from the outset. \n“As the only insurance provider on the list, we’re thrilled to represent part of the change our industry is currently experiencing – something which will spur us on, as we focus on building smarter, more cost-effective solutions for the new world of work.” Read More \nRichard Rose, partner and head of the Midlands at BDO, the title sponsor of the league table, said: “These high-growth, high-energy and highly-entrepreneurial companies will be the difference between success and failure in our post-Brexit economic future. Read More \n“These businesses are playing their part by recording strong levels of revenue and profit growth and by creating jobs. Read More \n“We’d like to see the Government do more to help them by focusing on skills, infrastructure investment and tax simplification.” Like us on Facebook ", "external_links": [], "published": "2018-04-12T07:01:00.000+03:00", "crawled": "2018-04-12T08:09:55.003+03:00", "highlightTitle": ""}