{"organizations": [], "uuid": "c792025d0ebf9e73f2b13fe949f0901e3b034ce4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article1503719.ece/ALTERNATES/s1200/beach.jpg", "site_section": "", "section_title": "", "url": "https://www.leicestermercury.co.uk/news/uk-world-news/brexit-holiday-charges-spain-italy-1503691", "country": "GB", "domain_rank": 48128, "title": "Holiday makers might have to pay to get into EU countries after Brexit - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.007, "site_type": "news", "published": "2018-04-26T03:00:00.000+03:00", "replies_count": 0, "uuid": "c792025d0ebf9e73f2b13fe949f0901e3b034ce4"}, "author": "Rachel Bishop", "url": "https://www.leicestermercury.co.uk/news/uk-world-news/brexit-holiday-charges-spain-italy-1503691", "ord_in_thread": 0, "title": "Holiday makers might have to pay to get into EU countries after Brexit - Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "de soller", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "brexit - leicester mercury holiday", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}, {"name": "invalid email britain", "sentiment": "none"}, {"name": "mallorca", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "european parliament", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Holiday makers might have to pay to get into EU countries after Brexit The move would 'protect the EU's external borders' Share British nationals may have to pay to get into EU countries on holiday. Port de Soller, Mallorca, Spain (Image: Getty images) Share Get Daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email\nBritain’s exit from the EU could directly hit holiday makers in the pocket.\nThose visiting places like Italy or Spain may be forced to pay to get in.\nBrussels says “the system will apply to visa-exempt third country nationals”, which Britons are set to become as of March 29, 2019, according to the EU’s agreed Brexit negotiating guidelines.\nIt comes after an agreement was reached by the Bulgarian Council presidency and European Parliament representatives for the European travel information and authorisation system (ETIAS) on Wednesday.\nThe move, which is intended to “protect the European Union’s external borders” to allow European Parliament “to stop those who may pose a threat to our citizens”, will see an end to free movement for UK citizens between the 27 other EU nations.\nIf the proposals are voted in, Brits will need to pay 7 Euros (around £6) to submit an online ETIAS application to the Brussels authorities, reports Chronicle Live .\nValentin Radev, the Bulgarian interior minister, said: “Today’s agreement is another important step in protecting the EU’s external borders.\n“By knowing who is coming to the EU before they even arrive at the border, we will be better able to stop those who may pose a threat to our citizens.” Read More Airline adds new seaside destination Bourgas to its East Midlands Airport offer\nThe EU announcement reads: “ETIAS will allow for advance checks and, if necessary, deny travel authorisation to visa-exempt third-country nationals travelling to the Schengen area.\n“The information submitted in each application will be automatically processed against EU and relevant Interpol databases to determine whether there are grounds to refuse a travel authorisation.\n“Before boarding, air carriers and sea carriers will need to check whether third country nationals subject to the travel authorisation requirement are in possession of a valid travel authorisation.”\nThe new proposal will now be voted on in European Parliament before being sent to the Council for adoption. Holiday makers face a tariff to get into EU countries (Image: Getty images)\nHowever European chief Brexit negotiator for the UK Michel Barnier said he wants a post-Brexit deal which includes “foreign, security and defence policy”, meaning Britons may still be unaffected by the proposals if an agreement is reached.\nThe announcement comes as Brexit Secretary David Davis was forced to deny the Government was “winging it” over quitting the EU.\nFor more information on the plans, click here . Like us on Facebook ", "external_links": [], "published": "2018-04-26T03:00:00.000+03:00", "crawled": "2018-04-26T17:34:21.048+03:00", "highlightTitle": ""}