{"organizations": [], "uuid": "9d8ce3a9d9d35aa01a59987a8ecef2e7e770f570", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13575577.ece/ALTERNATES/s1200/Sedgefield-MP-Phil-Wilson-at-the-Hitachi-opening-ceremony.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/anti-semitism-row-labour-mp-14487176", "country": "GB", "domain_rank": 21960, "title": "Anti-Semitism row: Labour MP says he fears for the soul of the party", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-04-03T18:00:00.000+03:00", "replies_count": 0, "uuid": "9d8ce3a9d9d35aa01a59987a8ecef2e7e770f570"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/anti-semitism-row-labour-mp-14487176", "ord_in_thread": 0, "title": "Anti-Semitism row: Labour MP says he fears for the soul of the party", "locations": [], "entities": {"persons": [{"name": "jeremy corbyn", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "phil wilson", "sentiment": "none"}, {"name": "roy smart", "sentiment": "none"}], "locations": [{"name": "sedgefield", "sentiment": "none"}, {"name": "tunbridge wells", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "negative"}, {"name": "hitachi", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "  Thank you for subscribing!   \nA Labour MP has said he fears for the soul of his party if people who hold racist views about Jews are not evicted. \nPhil Wilson, Labour MP for Sedgefield, said anti-Semites “feel as though they now have a home in Labour’s mainstream, where once their views were confined to the fringe”. \nAnd he said he had been accused of taking a stand against anti-Semitism in order to undermine Labour leader Jeremy Corbyn - a claim he found “grossly insulting”. Sedgefield MP Phil Wilson at the Hitachi opening ceremony (Image: Unknown) \nThe MP set out his concerns in an article, after representatives of the Jewish community last week held a protest outside Parliament against anti-Semitism. \nLabour’s difficulties continued over the bank holiday weekend, as the party suspended a council candidate who shared Facebook posts urging followers to “question the Holocaust”. \nRoy Smart had been due to contest a seat in Tunbridge Wells in May’s local elections, before his suspension. \nMr Corbyn was criticised after it emerged he opposed the removal of an anti-Semitic mural in London in 2012. He has said he did not look carefully at the mural and “sincerely regrets” the comment, and firmly opposes all anti-Semitism. He has also said he hoped to meet Jewish community leaders. A demonstrator holding a painting saying \"For the many not the Jew\", as people protest against anti-Semitism in the Labour party (Image: PA) \nMr Wilson said Mr Corbyn must act to show anti-Semites they are unwelcome. \n“Anti-Semitic remarks from party members seem to maraud social media every day and must be called out in all places, at all times. Those found indulging in this malign practice have no place in a party I have called my political home for more than three decades. \n“Tolerance on this, as of any other kind of racism in the Labour Party , should be zero. I know Jeremy Corbyn has said he agrees. But actions speak louder than words.” \nMr Wilson highlighted the case of Christine Shawcroft, the former head of Labour’s disputes committee, who resigned from the post and also left Labour’s National Executive Committee after opposing the suspension of another Labour candidate also accused of Holocaust denial. Read More North East Labour MP accuses party colleagues of launching a 'vendetta' against her \nHe said Ms Shawcroft should not be a Labour member, saying: “She is still a member of the party: that can’t be right.” \nAnd he said anti-Semites appeared to feel welcome in the Labour Party. Mr Wilson said: “If they are not evicted I fear for Labour’s soul.” \nHe added: “I’ve seen first-hand the effect the anti-Semitic abuse my Jewish parliamentary colleagues have suffered, so I say to those members who believe the accusations of anti-Semitism against Labour made by the Jewish community and others are ‘hurtful’ to the leader and who say ‘poor Jeremy’: I’m afraid you are also part of the problem.” Read More Theresa May says the North East will 'not be left behind' after Brexit as she visits the region \nMr Corbyn has defended himself after attending a Seder, a celebration connected to the Jewish holiday of Passover, with a left-wing group Jewish group called Jewdas, which has criticised mainstream Jewish organisations for their protests over alleged anti-Semitism in the Labour Party. \nHe said the Seder feast was “very interesting” and involved “talking to a lot of young people about their experiences of modern Britain”. \nHe added that “anti-Semitism is a vile and evil thing” and Labour had a process for dealing with it. Like us on Facebook", "external_links": [], "published": "2018-04-03T18:00:00.000+03:00", "crawled": "2018-04-04T04:39:14.020+03:00", "highlightTitle": ""}