{"organizations": [], "uuid": "ef564cab93ea5454eac8d13734575987378e9cdb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/news/property/article1471280.ece/ALTERNATES/s1200/GettyImages-904325132.jpg", "site_section": "http://www.leicestermercury.co.uk/rss.xml", "section_title": "leicestermercury - frontpage", "url": "https://www.leicestermercury.co.uk/news/property/your-construction-been-delayed-report-1471301", "country": "GB", "domain_rank": 48128, "title": "Has your construction been delayed? Report says you can't blame the weather", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-04-19T02:01:00.000+03:00", "replies_count": 0, "uuid": "ef564cab93ea5454eac8d13734575987378e9cdb"}, "author": "Karen Antcliff", "url": "https://www.leicestermercury.co.uk/news/property/your-construction-been-delayed-report-1471301", "ord_in_thread": 0, "title": "Has your construction been delayed? Report says you can't blame the weather", "locations": [], "entities": {"persons": [{"name": "jeffrey matsu", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "midlands", "sentiment": "none"}], "organizations": [{"name": "rics", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Has your construction been delayed? Report says you can't blame the weather The industry has battled the weather and won Share Work goes on despite the weather Share Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nWe blame a lot on the weather in this country but it appears that one thing we can't blame this year is delays in build. \nConstruction workloads in the Midlands remained resilient despite bad weather and a weaker near-term economic outlook, in the first quarter of 2018. \nThe news comes following the publication of the latest RICS Construction and Infrastructure Market Survey. \nIn the first quarter of 2018, 37 percent more chartered surveyors reported that their workloads had risen as opposed to fallen, alongside the East of England this was the strongest reading across the UK. \nWhile 63 percent of respondents noted bad weather conditions as a limiting factor, the “Beast from the East” was not enough to slow the pace of growth. Jeffrey Matsu, RICS senior economist \nIn the early part of 2018 workloads in the Midlands increased across all subsectors, with both new work and repair and maintenance activity rising steadily. \nPrivate housing reported the strongest rise in workloads with 55 percent more respondents citing an increase rather than a decrease - the most positive since quarter three of 2015. \nWhile public sector growth remains slower than private the pace of workloads remained steady with a net balance of +18 percent in housing (+19 in quarter four 2017). \nInside the stunning £695k listed mansion near Coalville that's just gone on the market \nInfrastructure continues to be strong in the Midlands construction market as 35 percent more contributors reported a rise rather than a fall in activity. \nLooking ahead, Midlands’ respondents expect the rail, road and energy categories to post the most significant increases over the coming 12 months. Read More \nWorkloads in the Midlands are once again accelerating faster than the rest of the UK in all sectors minus public housing. \nThis quarter there was also an acceleration in the pace of growth in workloads in the Southwest. \nJeffrey Matsu, RICS senior economist, said: “While a short-lived snowstorm may have snarled logistical supply chains and site works at the end of February, it was not enough to negatively impact on workload order books. \n\"Indeed, several years of limited spare capacity have resulted in a backlog within the delivery pipeline which will take some time to unwind. \n\"Risk aversion by both lenders and developers, in the wake of Carillion and ongoing Brexit negotiation, will continue to weigh on investment decisions.” Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nCompanies in the Midlands continue to highlight the shortage of skilled professionals as one of the biggest constraints to growth. \nIn quarter one of 2018, 69 percent of chartered surveyors reported a lack of quantity surveyors as holding back projects. This quarter, respondents are reporting it increasingly difficult to recruit labourers. \nThe shortage of labour, coupled with higher input costs, continues to restrict growth in profit margins, and while cost pressures may ease later this year, expectations on profit margins are still well below the three-year average of 40% recorded between 2014 and 2016. \nIndeed, tender prices are expected to rise over the next 12 months with respondents in both the building and civil engineering sectors envisaging greater price pressures. Like us on Facebook ", "external_links": [], "published": "2018-04-19T02:01:00.000+03:00", "crawled": "2018-04-19T04:16:58.000+03:00", "highlightTitle": ""}