{"organizations": [], "uuid": "df03d922e3c99ff943821c30a15b99618ca376a8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14487924.ece/ALTERNATES/s1200/JS147889622.jpg", "site_section": "http://www.thejournal.co.uk/business/?service=rss", "section_title": "nechronicle - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/fancy-partying-seven-foot-dinosaur-14487747", "country": "GB", "domain_rank": 21960, "title": "Fancy partying with a seven-foot dinosaur? This Gateshead firm might be the one for you", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-04-03T18:25:00.000+03:00", "replies_count": 0, "uuid": "df03d922e3c99ff943821c30a15b99618ca376a8"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/fancy-partying-seven-foot-dinosaur-14487747", "ord_in_thread": 0, "title": "Fancy partying with a seven-foot dinosaur? This Gateshead firm might be the one for you", "locations": [], "entities": {"persons": [{"name": "mrs pitchford", "sentiment": "none"}, {"name": "rex", "sentiment": "none"}, {"name": "duggan", "sentiment": "none"}, {"name": "max", "sentiment": "none"}, {"name": "faye brannigan", "sentiment": "none"}, {"name": "craig duggan", "sentiment": "none"}, {"name": "claire pitchford", "sentiment": "none"}], "locations": [{"name": "gateshead", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "roarsome events", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nA seven-foot dinosaur called Rex is helping a Gateshead company fill a gap in the education and parties sectors by teaching children about dinosaurs and evolution. \nGateshead’s Roarsome Events has launched the North East’s first “dinosaur experience” to allow children to get hands on with one of the ancients beasts to boost their education. \nThe company - which was founded by Craig Duggan and Claire Pitchford - uses a specially designed tyrannosaurus rex suit that looks and moves like a real dinosaur to inspire children to learn more about the prehistoric animals. (L-R) Faye Brannigan, Roarsome co-founder Claire Pitchford, and her son Max \nThe life-like costume stands seven foot tall and 18 foot long and will be made available for school workshops. \nBoth Mr Duggan and Mrs Pitchford are qualified teachers and the team is trained in first aid meaning they are fully equipped to educate classes of school children. \nMr Duggan said: “My background is running workshops for children and schools to enhance the curriculum. We identified that there was this need in the national curriculum to look at topics such as evolution and dinosaurs. Craig Duggan, co-founder of Roarsome \n“Schools were using online teaching aids and videos to do that. We thought there is surely a better way to do that. \n“We bought this dinosaur from China and put together an offer to the public for birthdays and events but also for workshops for schools.” \nThe workshops focus on five main subjects: fossils, variation, deep time, genetic inheritance, and evolution. \nMr Duggan added: “On the key stage one and key stage two curriculum all those subjects are integral to science classes. We provide explanations about fossils and geology and how they come about, down to ‘deep time’, which is how time moves and how we understand it. The big one is evolution and inheritance, which teaches how ecosystems change. Read More Fish flinging and blue passports: Brexit Britain is a land of metaphors (and they're all rubbish) \n“We offer them to schools and they come back to us with what they want the workshop to focus on. The big thing all the kids love is coming in contact with Rex. He is 18 ft long and seven foot tall.” \nAs well as meeting and training Rex, Roarsome also provides real dinosaur fossils, teeth, artefacts, and fossilised dinosaur poo for the children to examine. Read More \nRex and his trainer can also be hired out for private events and parties. \nThe company is currently looking to develop a team of actors and performers to expand its business. Like us on Facebook", "external_links": [], "published": "2018-04-03T18:25:00.000+03:00", "crawled": "2018-04-03T20:31:10.000+03:00", "highlightTitle": ""}