{"organizations": [], "uuid": "e8c91964568fe960af3b3b69b76321dd678ae56a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article1416015.ece/ALTERNATES/s1200/31544809JPG.jpg", "site_section": "", "section_title": "", "url": "https://www.leicestermercury.co.uk/news/business/antalis-md-david-hunter-what-1415927", "country": "GB", "domain_rank": 48128, "title": "Antalis MD David Hunter on what it takes to run £500m Coalville paper and packaging supplier - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.931, "site_type": "news", "published": "2018-04-04T11:47:00.000+03:00", "replies_count": 0, "uuid": "e8c91964568fe960af3b3b69b76321dd678ae56a"}, "author": "Justine Halifax", "url": "https://www.leicestermercury.co.uk/news/business/antalis-md-david-hunter-what-1415927", "ord_in_thread": 0, "title": "Antalis MD David Hunter on what it takes to run £500m Coalville paper and packaging supplier - Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "david hunter", "sentiment": "negative"}, {"name": "matt short", "sentiment": "none"}], "locations": [{"name": "coalville", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "southern africa", "sentiment": "none"}, {"name": "antalis", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}], "organizations": [{"name": "leicester mercury news antalis", "sentiment": "negative"}, {"name": "antalis group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Antalis MD David Hunter on what it takes to run £500m Coalville paper and packaging supplier Firm has 1,100 staff – including 500 in Leicestershire – selling 14,000 products and delivering 550,000 tonnes of paper a year Share David Hunter is passionate about his role as MD of the UK, Ireland and Southern Africa region at Antalis (Image: Matt Short) Share Get Business   Thank you for subscribing!   \nWith its UK head office in Coalville, Antalis is Europe’s leading distributor of everything from paper, packaging and sticky labels to envelopes, coloured boards and flip charts. \nIn the UK and Ireland, it boasts an annual turnover of more than £500 million, with 16 branches, more than 1,100 staff – including 500 in Leicestershire – and sells 14,000 products and delivers 550,000 tonnes of paper a year. \nWith customers including high street stores, huge multi-nationals and conglomerates, it is part of the global Antalis Group, which supplies 43 countries across five continents, including Singapore, China, South America, and Australia, and has 118 worldwide distribution centres. \nAs well as the enviable title of European leader in its field, it also ranks second globally with 127,000 customers supplied by more than 5,600 employees. \nTo put the scale of its operation into perspective, in 2016 it sold 1.5 million tonnes of paper and achieved a global turnover of 2.5 billion euros – or £2.2 billion at today’s rate. \nSpeaking to him, it’s clear 63-year-old David Hunter is incredibly passionate about his role as regional managing director of the UK, Ireland and Southern Africa for Antalis UK. David Hunter \nThe father-of-one, who previously worked in senior management for B&Q and the Build Centre, said his six years there had been “fantastic, a real career highlight”. \nSpeaking in the midst of the recent problems caused by Storm Emma and the Beast from the East, David said: “Working in a company as vast, ambitious and progressive as Antalis, the sheer breadth of experience and variety is astonishing. \n“That said, covering such a huge geographical area, of course, comes with a variety of challenges and opportunities. \n“A great example of this is today. I’m sitting in our Coalville head office looking out at snow drifting by amid sub-zero temperatures, ensuring we have adequate mitigation plans in place to cope with site closures across country, including businesses in Scotland and the South West which are on red alert. \n“Whereas last week I was in Cape Town in temperatures of 40C facing the challenge of the city running out of water due to the worst drought experienced in 100 years. \n“It’s something I have to ensure we can manage not just on a commercial front but in terms of ensuring the welfare of our employees. So, for variety I don’t think it gets much bigger. \n“For me, the beauty of my role at Antalis is I’m able to experience the hugely different economic, cultural and social conditions between the UK and Ireland and South Africa, and the ensuing impact on our business model, our customers and delivery. \n“While there are a number of current political situations in South Africa to navigate, for example, here in the UK the focus remains on the Brexit negotiations, and the implications on our trade and economic relationship with the European Union. \n“Yet, such challenges are nothing new for Antalis, having seen our fair share of major change over the decades – we still make a great net profit and have a very healthy business. \n“In this way, every day is different, every day is fascinating. \n“One thing is for sure, my job isn’t boring or mundane.” Antalis UK supplies 14,000 products and delivers 550,000 tonnes of paper a year (Image: Matt Short) \nTouching on Brexit, he revealed that Antalis was already seeing an impact. \nThe Barnsley-born businessman – who happens to be a keen fly fisherman – said: “Prior to the vote I was asked a lot about what my personal view was. \n“So, I sent a letter to all employees telling them my perspective as a businessman, and that was very strongly to remain, and that’s how I voted. \n“For me the vote to leave came as a huge shock. \n“Antalis is a European company, has European suppliers and a French parent company. \n“The impact, in the short term, is that for every £1 we earn it’s converted into euros, so it’s worth less now than it was the day before the vote. \n“How do I think it will pan out in the long term? Like most of us, I have no idea and keenly follow news of the Government’s Brexit negotiations. \n“My hope is that common sense will prevail and the impact on our trade relationship with the EU is kept to a minimum. \n“I absolutely understand the measure of having our own laws, ruling our own courts and having the final say on what happens in our country – I get that. \n“But from an economic point of view Europe is stronger together than being fragmented.” \nWhen it comes to future proofing the business, Antalis is as much at the forefront of its game as it can possibly be. \nIt is continually investing in new technology, as well as in staff and customers, in addition to making acquisitions, \nincluding in packaging, to further strengthen its position in Europe and internationally. \nSuch investments have proved highly successful, with David revealing the business will easily have secured an additional £150 million in turnover during the last six years. \nHe also revealed he expects the same level of growth to continue for the firm over the next few years with “big expansion plans” in the pipeline – including increasing staffing in Leicestershire. \nHe said: “Leicestershire is a great area to do business and, as a large employer that’s continually investing in expanding its workforce, having the right skillset and calibre of people is essential. \n“That’s why, from truck drivers to accountants, education and training remains a strong focus throughout all aspects of Antalis. \n“Our business is one that’s founded on its people and I believe this is important to maintaining excellence and a great talent pool to draw from.” \nDavid took over from Ian George – who had 37 years’ experience working in the paper industry and left a “solid business to build on” – and believes several elements are key to Antalis’ continued success. \nThey include valuing its employees and constantly investing in training within its own on-site academy, to keep staff up to date with cutting edge technology. \nHe said investing in staff was rewarded with loyalty, so that a “breadth and depth of experience” spanning across decades is maintained. \nDavid said: “I’m regularly writing to long-serving employees to thank them for their service – 10 and 20 years is common, and 30 years isn’t unusual, even 40 years. \n“It’s this important, long pedigree of both length of service and depth of understanding of products that helps Antalis to stand out.” \nAnother element is a healthy, company-wide “obsession with delivering the best customer service”. \nOne example of this is in the digital print market. \nBecause “technology is advancing so quickly” the business also runs digital courses in its academy for clients to help them to stay ahead of the game. \nDigital print is set to remain a key area of development for the firm as it has seen “exponential growth” that’s expected to “continue apace”. \nIn a determined bid to stay at the cutting edge, one recent investment has been in 3D design technology which allows clients to create bespoke, real-time packaging designs – and walk away with real examples of them. \nAntalis has also introduced the most advanced warehouse management technology currently available and improved its mechanical handling equipment and its logistics fleet, which can deliver up to 2,000 tonnes of paper a day. \nDavid, who lives near Stratford-upon-Avon, said: “We might look like a traditional business from the outside, but behind the scenes we are trying to be as highly technological as we possibly can. \n“And, while new technology can be difficult and painful to introduce, if you want to future-proof your business for the next 10 years you’ve got to be at the forefront.” \nHe said another thing that sets Antalis apart from the competition is that it retains a massive stock range. \nWhile he admitted the business could probably save a couple of million pounds by removing lower selling ranges, he said: “This is what our customers have come to expect. They’ve come to rely on us as the ‘go-to’ supplier for almost every requirement.” \nAnd, despite handling vast amounts of paper and packaging materials, Antalis still maintains a strong ethic on environmental and sustainable sourcing, so much so that David admitted it won’t work with firms with “dubious green credentials”. Read More Geoff's Toys in Loughborough closing after 35 years as Amazon effect bites \nWhen it comes to his own career success, David said his working-class roots gave him a great start in life, instilling respect for individuals, fairness – even in challenging circumstances – and a sense of always trying to do the right thing. \nHe said: “I always want to be able to look my parents in the eye and say although that was a difficult situation I was fair, reasonable and treated the people involved with respect.” Read More Amazon to create over 3,000 new jobs at second huge warehouse in Leicestershire \nWorking as a navigation officer in the Merchant Navy with P&O when he was a young man played a part in that. \nDavid said: “It taught me to navigate a path to where I want to go, how I need to get there and set a course – and even if it’s difficult and we get diverted, how to get things back on course.” \nHe also believes that a broad experience of business, understanding the detail from many people’s perspectives across the board, and hard work have helped drive his career forward. Read More MIPIM 2018: Leicestershire business leaders look for investors for 4 big multi-million pound schemes \nDavid said: “I’m either not talented enough, or not intelligent enough, but what I’ve achieved has been through hard work and putting the hours in. \n“I think it’s also important to always be brave and take opportunities and challenges and grasp them with both hands. \n“But every day I strive to go home knowing that I have made some element of the business better, or more efficient, so I know I’ve made a difference by going to work that day.” \nWith such a busy management role, how does he maintain an all-important work-life balance? Read More \nDavid said: “I’ve been an MD since I was 32 so I’ve had a lot of practice. \n“It also helps that I have a strong base at home and an incredibly supportive family. \n“My wife and I have been together for 36 years so she understands the pressures that can come with the job and if I need to stay later than 5pm. \n\"The good news for me though is, as I genuinely love my job, it doesn’t feel like work.” Like us on Facebook", "external_links": [], "published": "2018-04-04T11:47:00.000+03:00", "crawled": "2018-04-04T16:28:30.018+03:00", "highlightTitle": ""}