{"organizations": [], "uuid": "e9b3966df933d8f64210c81dfe2b9a42e716935a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14520189.ece/ALTERNATES/s1200/Rachel-Peacock-head-of-Digital-Union.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/digital-union-unveils-first-manifesto-14576192", "country": "GB", "domain_rank": 21960, "title": "Digital Union unveils first manifesto for North East's creative sector", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-04-26T02:01:00.000+03:00", "replies_count": 0, "uuid": "e9b3966df933d8f64210c81dfe2b9a42e716935a"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/digital-union-unveils-first-manifesto-14576192", "ord_in_thread": 0, "title": "Digital Union unveils first manifesto for North East's creative sector", "locations": [], "entities": {"persons": [{"name": "rachel peacock", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "northern design centre", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}], "organizations": [{"name": "digital union", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Digital Union unveils first manifesto for North East's creative sector The 12-point plan has been unveiled at an industry event at the Northern Design Centre Share Rachel Peacock, head of Digital Union (Image: Unknown) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nThe biggest network for the digital sector in the North East has unveiled a 12-point manifesto detailing how it can help to boost the region this year and beyond.\nDigital Union, which is powered by creative development agency Generator, announced plans in January to launch its very first manifesto in a bid to tackle some of the biggest challenges currently facing tech businesses.\nNow, having invited its members to work together to create the publication and make their voices heard, Digital Union has finally unveiled the manifesto at an event at Gateshead’s Northern Design Centre.\nFindings from research conducted with members showed that the main areas of concern for creative, digital, and tech businesses are the talent and skills shortage, lack of investment, a central business advice and information hub, as well as the uncertainty around Brexit and the impact on the region’s business community.\nHead of Digital Union Rachel Peacock said: “Digital Union’s prime aims are to unify, promote, and campaign for the businesses we represent. As such this document sets out an outline of what we see as the key issues we will take on for the next year.\n“It is not a policy or strategy document for the North East digital and tech sector, but rather a promise to our members in assisting them to overcome the challenges we have collectively identified.\n“As well as our own research, we analysed several national reports and found that talent and skills has overtaken access to finance as the key barrier to growth and expansion.\n“We are committed to reducing the skills gaps and encourage greater partnership between the education system on all levels and the businesses we help.\n“We see evidence that the companies that actively work with education providers, are the ones that are experiencing the quickest growth. This is a massive issue and we all must take time to help solve it.\n“We will continue to work with our partners at the North East LEP and campaign to Government to ensure that post-Brexit, funding is available to continue the sector specific business support we offer.\n“The 12-point plan will be rolled out through a range of activities and incorporates various initiatives to help address the pain points such as pushing for greater collaboration, encouraging peer to peer support, tackling diversity and inclusion the North East, and attracting investment to the region.”\nDigital Union sponsor, the University of Sunderland, has welcomed the manifesto and believes more collaboration between businesses and educational institutes is key moving forward.\nProfessor Alastair Irons, academic dean for the faculty of computer science at the university, said: “Developing career-ready graduates with high level skills is where we excel at the University of Sunderland.\n“We run an array of programmes that incorporate the cutting-edge requirements needed to succeed in the digital and creative sector. We are also putting significant investment into enhancing our academics, curriculum and facilities to meet the needs of these sectors.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-04-26T02:01:00.000+03:00", "crawled": "2018-04-26T13:17:41.001+03:00", "highlightTitle": ""}