{"organizations": [], "uuid": "2313bdef2f8ce8d638139a2496ccff3b3642ed9c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14557666.ece/ALTERNATES/s1200/Labour-Leader-Jeremy-Corbyn-in-Blyth.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/labour-mp-says-far-right-14557587", "country": "GB", "domain_rank": 21960, "title": "Labour MP says far right may be posing as anti-semitic Corbyn supporters", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-04-20T20:00:00.000+03:00", "replies_count": 0, "uuid": "2313bdef2f8ce8d638139a2496ccff3b3642ed9c"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/labour-mp-says-far-right-14557587", "ord_in_thread": 0, "title": "Labour MP says far right may be posing as anti-semitic Corbyn supporters", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Labour Leader Jeremy Corbyn with Blyth MP Ronnie Campbell (Image: Newcastle Chronicle) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nSome of the horrific abuse received by Jewish Labour MPs may have come from opponents of Jeremy Corbyn who set up “fake profiles” and pretended to be supporters, according to Labour MP Ronnie Campbell. \nLabour MPs including Ruth Smeeth and Luciana Berger spoke about the racist abuse they received when the House of Commons held a debate about antisemitism. \nMuch of it came from people who appeared to be supporters of Mr Corbyn. \nBut Mr Campbell, Labour MP for Blyth Valley, said anyone could pretend to be a supporter of the Labour leader on social media. \nHe said: “These people are posting vile stuff and claiming to be Jeremy Corbyn supporters. The trouble that social media is just a platform for people to say whatever they want. Labour leader Jeremy Corbyn (Image: PA) \n“It is out of control and it is becoming increasingly difficult to police especially when people can set up fake profiles and delete them without a trace. \n“If they claim to be Labour supporters and if they can be traced, then they should be drummed out of the party instantly, without any hearing or involvement from the party’s National Executive Committee. \n“These people could be the biggest supporters of the National Front and other Right-wing, racist parties. \n“There is seriously something wrong with the system if people can get away with saying what they want on social media. \n“It is a deliberate and organised attempt to bring Jeremy down and that cannot be tolerated.” \nMr Campbell added: “The Labour Party has a proud and honourable record of fighting racism and bigotry in all its forms, and those responsible for on-line intolerance have no place in our party.” Ronnie Campbell MP (Image: Newcastle Chronicle) \nShadow attorney general Baroness Chakrabarti this week accepted there was a “serious problem” with anti-Semitism, nearly two years after a report she wrote for Jeremy Corbyn urged action to address an “occasionally toxic atmosphere”. \nJewish groups, which demonstrated outside Parliament last month, have demanded urgent action - including the full implementation of the Labour peer’s 2016 report - after a number of high-profile rows. Read More Fury as Lords votes to keep option of customs union with EU after Brexit \nMr Corbyn will meet representatives from the Board of Deputies of British Jews and Jewish Leadership Council for talks on 24 April. \nSpeaking in the House of Commons, Ms Smeeth gave examples of the abuse she received, some of it containing the hashtag “JC4PM”, which stands for Jeremy Corbyn for Prime Minister. \nHang yourself you vile treacherous Zionist Tory filth. You are a cancer of humanity.” \nExamples included: “First job for Jeremy Corbyn tomorrow - expel the Zionist BICOM smear hag b**** Ruth Smeeth from the Party. \n“This Ruth Smeeth b**** is Britainophobic, we need to cleanse our nation of these types. \n“#JC4PM Deselect Ruth Smeeth ASAP. Poke the pig get all Zionist child killer scum out of Labour. Read More Passports 'could be made in Europe or Far East' after De La Rue abandons legal challenge \n“You are a spy! You are evil, satanic! Leave! #Labour #Corbyn. \n“Ruth you are a Zionist plant, I’m ashamed you are in Labour. Better suited to the murderous Knesset! #I Support Ken.” Like us on Facebook", "external_links": [], "published": "2018-04-20T20:00:00.000+03:00", "crawled": "2018-04-21T00:34:35.010+03:00", "highlightTitle": ""}