{"organizations": [], "uuid": "dca3612ed2aef2d143eada0e0ab3b421becdf90c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14523782.ece/ALTERNATES/s1200/GWR_-NJL_120418uni_01.jpg", "site_section": "http://www.thejournal.co.uk/business/?service=rss", "section_title": "nechronicle - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/northumbria-university-students-chance-study-14523198", "country": "GB", "domain_rank": 21960, "title": "Northumbria University students get chance to study in Amsterdam", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-04-12T17:38:00.000+03:00", "replies_count": 0, "uuid": "dca3612ed2aef2d143eada0e0ab3b421becdf90c"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-news/northumbria-university-students-chance-study-14523198", "ord_in_thread": 0, "title": "Northumbria University students get chance to study in Amsterdam", "locations": [], "entities": {"persons": [{"name": "amste", "sentiment": "negative"}], "locations": [{"name": "amsterdam", "sentiment": "none"}, {"name": "northumbria", "sentiment": "none"}, {"name": "netherlands", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "indone", "sentiment": "none"}], "organizations": [{"name": "northumbria university", "sentiment": "negative"}, {"name": "amsterdam business northumbria university", "sentiment": "negative"}, {"name": "university of applied sciences", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "holland share amsterdam university of applied sciences", "sentiment": "none"}, {"name": "amsterdam university of applied sciences", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Northumbria University students get chance to study in Amsterdam New partnership with Amsterdam University of Applied Sciences will see a number of links between Newcastle and Holland Share Amsterdam University of Applied Sciences (Image: Copyright unknown) Share   \nNorthumbria University will give business students the chance to study in Europe after signing a partnership agreement with a university in Amsterdam. \nThe partnership will see postgraduate courses in business and project management taught at the Amsterdam University of Applied Sciences (AUAS) by Northumbria academics, while Northumbria students will be able to take a one-year programme in international business in the Netherlands. \nThe two institutions have also signed an Erasmus agreement, which provides students and staff with exchange opportunities, and have set out a long-term goal of deeper collaboration. \nThe link-up, which comes at a time when Brexit is making international collaboration a concern for universities, increases Northumbria’s global presence, which already sees it delivering courses in Indonesia, Singapore and Hong Kong, as well as a campus in London. Prof Andrew Wathey, vice chancellor of Northumbria University \nNorthumbria’s vice-chancellor Prof Andrew Wathey said: “This mutually supportive collaboration brings together two research-rich and business-focused institutions with a shared focus on quality. \n“It will deepen our research, educational, business and community engagement links not only between the UK and the Netherlands, but also across Europe and internationally. \n“The partnership also extends Northumbria’s global reach with a presence in Newcastle and London in the UK, and internationally including Jakarta, Hong Kong, Singapore and now the Netherlands. We look forward to working with colleagues at AUAS and to deepening our partnership.” \nAUAS is one of the Netherlands’ largest universities and runs courses in a number of similar subject areas to Northumbria, including business and law, health and social sciences, education and sport. \nIt is hoped the link-up will foster an “international outlook and global mind-set among students and staff, and allow both universities to exchange complementary strengths in research, professional expertise, business and international networks”. \nProf Huib de Jong, chairman of the AUAS executive board, said: “Our slogan is Creating Tomorrow - a slogan that matches perfectly with the values of Northumbria. \n“The complementary strengths between both universities in our core areas of education and research is fundamental for the proposed collaboration. \n“Amsterdam is traditionally the Netherlands’ connection to the world city network, linking many different businesses, people and organisations together. \n“Northumbria recognizes this, and at a time of increasing internationalization and rapid societal and technological change, both universities agree that collaboration across national boundaries is benefitting to both students and staff, offering better access to knowledge and understanding in order to meet future challenges.” Like us on Facebook", "external_links": [], "published": "2018-04-12T17:38:00.000+03:00", "crawled": "2018-04-12T20:33:11.028+03:00", "highlightTitle": ""}