{"organizations": [], "uuid": "6c39af6f45a09d899552206064ec38902837b321", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14595810.ece/ALTERNATES/s1200/SAFC-Short1JPG.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/sport/football/football-news/ellis-shorts-guide-how-not-14595317", "country": "GB", "domain_rank": 21960, "title": "Ellis Short's guide to how not to run a football club - ex-Sunderland owner's well-meaning mistakes", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-04-30T18:13:00.000+03:00", "replies_count": 0, "uuid": "6c39af6f45a09d899552206064ec38902837b321"}, "author": "Stuart Rayner", "url": "https://www.chroniclelive.co.uk/sport/football/football-news/ellis-shorts-guide-how-not-14595317", "ord_in_thread": 0, "title": "Ellis Short's guide to how not to run a football club - ex-Sunderland owner's well-meaning mistakes", "locations": [], "entities": {"persons": [{"name": "ellis short", "sentiment": "negative"}, {"name": "ellis", "sentiment": "none"}, {"name": "stewart donald", "sentiment": "none"}, {"name": "niall quinn", "sentiment": "none"}, {"name": "quinn", "sentiment": "none"}, {"name": "margaret byrne", "sentiment": "none"}, {"name": "roberto de fanti", "sentiment": "none"}, {"name": "david moyes", "sentiment": "none"}, {"name": "jack rodwell", "sentiment": "none"}], "locations": [], "organizations": [{"name": "sunderland", "sentiment": "negative"}, {"name": "drumaville", "sentiment": "none"}, {"name": "white army", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get Sunderland AFC updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email\nHis parting gift to Sunderland showed Ellis Short’s heart was in the right place.\nWriting off the club’s debt – expected to stand at well over £100m when the latest accounts are revealed this week – before he handed over ownership to an international consortium was a good gesture to bow out with.\nBut whatever the intentions, there is no question his entire tenure has been a disaster on and off the pitch.\nShort came on board with Niall Quinn’s Drumaville consortium and took a controlling interest in 2008 when the effects of the global financial crash took their toll on the Irish businessmen. He had full control by the following year, and installed himself as chairman in 2011 after falling out with Quinn. Read More Red and White Army hopes Sunderland 'matchdays will feel like matchdays again' Niall Quinn and Ellis Short\nShortly probably made too many mistakes to list them all, but here are some of the main ones Stewart Donald’s consortium will do well to avoid. Don’t put trust in the 'wrong' people\nMargaret Byrne, Roberto De Fanti, David Moyes, Jack Rodwell and many more besides – at every level, Short put his faith in people who let him down.\nMany of the problems which beset Sunderland during his ownership were not directly of his own making, but made by people he had trusted but who ultimately didn’t deliver. Margaret Byrne (Image: Mike Egerton/PA Wire)\nPerhaps one of his biggest mistakes was falling out with his chairman, Quinn, leaving the boardroom without football expertise. Not that having worked in the game is a guarantee of anything – chief executive Martin Bain had plenty of experience of it, yet presided over the club’s first double relegation.\nMoyes, the manager Short wanted more than perhaps any he appointed, was the man set that ball rolling. Read More Confirmed: Robbie Stockdale will take charge of Sunderland against Wolverhampton Wanderers Find some stability\nIn 2013 Short was persuaded to go down the director of football route to bring stability, but agent De Fanti was a bad choice, and he had gone through the Italian and Lee Congerton before abandoning the model as a condition of Sam Allardyce joining as manager. There was no more method to the club’s recruitment, and the squad became a hotch-potch of different signings.\nAs Short’s tenure went on, management became an even more short-term occupation football-wide. Chelsea have enjoyed plenty of success by chopping and changing, but there has been a consistent theme to their appointments. In 2015 Short made the full swing from Gustavo Poyet’s attempts to have Sunderland playing like Barcelona-lite to Allardyce’s more direct approach. Neither was the wrong way of playing, but to go from one to the other in the space of seven months was always going to be difficult – and costly.\nNo wonder Chris Coleman admitted he was in charge of a team with no identity shortly before he left. Read More Don’t buy players you don’t want and don’t try to welsh on your agreements Sunderland's signing of Ricardo Alvarez turned into a disaster (Image: Getty Images Europe)\nEven the great managers and best directors of football make bad signings – whatever the Moneyball men might tell you, it is not and never will be an exact science, thank goodness.\nBut there are bad signings and then there is Ricardo Alvarez, the poster boy for Short’s failed regime.\nIn 2014, Poyet persuaded Sunderland to sign the Argentinian. Rather than buy him up front, they tried to cut corners by taking the playmaker on a season-long loan, and promised to buy him from Inter Milan if the Black Cats stayed up at the end of the season.\nThey did, but no thanks to Alvarez, who looked ill-suited to English football in his five goalless Premier League starts.\nBy the time the season was over, Sunderland had changed managerial tack and Dick Advocaat was not keen on Alvarez, so the club tried to wriggle out of the deal by claiming Alvarez was not fit enough to join courtesy of knee problems Inter blocked surgery on. Inter would not back down because they did not want him either. Read More Chris Coleman found talking the talk easy, but walking the Sunderland walk was too steep a task\nThe Black Cats took the case to the Court of Arbitration for Sport, who finally settled the matter two years later. Because the price had been set in Euros, the post-Brexit drop in the pound’s value pushed the price up to £9.7m – before you even factor in legal fees.\nWhile the lawyers fought it out, Alvarez was allowed to get on with his career, and joined Sampdoria, where he is still playing. For their £9.7m (and the rest), the Wearsiders did not even get a footballer, let alone one they wanted.\nOther classic deals include loaning Santiago Vergini for 18 months, then buying him permanently (another pre-arranged deal) and never playing him again. They loaned him out in 2015-16, then sold him at a loss to Boca Juniors. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now Don’t overpay your players\nIn business, Short would expect to pay people what they are worth, but not in football it seems.\nHeavily incentivised wages would make a lot of sense for players, especially when it is so hard to sack them for poor performance, but most clubs are scared of losing out on signings if they go down that route.\nSunderland’s wages were the 13th highest in their final Premier League season, when they finished bottom. Hardly value for money. Don’t forget the relegation clauses Jack Rodwell's contract did not include a wage decrease following Premier League relegation (Image: Sunderland AFC)\nWhen Sunderland were relegated from the Premier League, it emerged Rodwell’s £70,000-a-week wages would go untouched.\nHaving learnt the lessons of their ruinous 2003 relegation, the Black Cats put clauses in every player’s contract which cut their wages by 40% as they dropped into the Championship. The only exception was Rodwell.\nIn their desperation to sign the £10m midfielder, Sunderland agreed to defer his cut by 12 months if the club did not bounce back. Of course they did not, but it still means his pay will be massively out of kilter with that of every other League One first-teamer, never mind a reserve.\nColeman tried to shame Rodwell out of the club but soon found if it meant walking away from money like that, he was not for budging.\nNone of the rest had clauses for a double relegation – well, it was not going to happen, was it? – and although those signed post-Moyes did have that provision, Coleman did not.\nWhen it comes to pay, his successor will have to disentangle and harmonise a two-tier squad next season. Read More Don’t pay your players to play for someone else Papy Djilobodji and Wahbi Khazri have spent the season on loan in France\nLast summer knew they needed a full-scale rebuild, but doing it was easier said than done.\nThe list of players they wanted rid of was into the teens – the problem was finding buyers.\nThe loan players could be sent back, and those out of contract shown the door. Everton paid £30m for Jordan Pickford, Reading £2m for Vito Mannone.\nBut the wages of the likes of Rodwell, Lamine Kone , Didier Ndong, Fabio Borini, Jeremain Lens, Wahbi Khazri and Papy Djilobodji were too high to find buyers.\nRodwell, Kone and Ndong stayed, the rest went on loan.\nL’Equipe revealed Sunderland have been subsidising Khazri and Djilobodji to the tune of £30,000-a-week so they can play elsewhere.\nNone of the loans contained an obligation to buy, although Besiktas have made Lens’ move permanent, AC Milan are expected to do so with Borini, and Khazri’s form has apparently attracted interest. We might see Djilobodji swap Ligue 1 for League One, though. Read More Make a profit on players Simon Mignolet is one of the few players Sunderland sold for a profit (Image: Getty Images Europe)\nSince taking overall control, Short bought, then sold (or released) 53 players, and only made a profit on Simon Mignolet, Darren Bent, James McClean, Patrick van Aanholt and Mannone.\nInevitably clubs lose money on some players, and if they get good value for it like they did with Jermain Defoe, for example, it is bearable.\nBut Sunderland’s player trading on Short’s watch was woeful. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now Don’t waste a fortune on agent’s fees\nAll those years of waste left Sunderland with buttons to spend on their Championship overhaul.\nThe 15 players signed after dropping out of the Premier League cost a combined £1.25m in transfer fees – or just over half what the club brought in for Mannone.\nYou would think, then, they were watching every penny but the real cost became apparent later when it was revealed they paid agents £4.3m – second only to Aston Villa in the Football League. Read More", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-04-30T18:13:00.000+03:00", "crawled": "2018-04-30T20:33:54.004+03:00", "highlightTitle": ""}