{"organizations": [], "uuid": "6555aa5c938d91a9679cf0d5701db250447b35e8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13161585.ece/ALTERNATES/s1200/SGP_NEC_050617BLYTH15JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/jeremy-corbyn-anti-semitism-row-14495365", "country": "GB", "domain_rank": 21960, "title": "Jeremy Corbyn anti-Semitism row: MP tells politicians to 'wind their necks in'", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-04-05T18:00:00.000+03:00", "replies_count": 0, "uuid": "6555aa5c938d91a9679cf0d5701db250447b35e8"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/jeremy-corbyn-anti-semitism-row-14495365", "ord_in_thread": 0, "title": "Jeremy Corbyn anti-Semitism row: MP tells politicians to 'wind their necks in'", "locations": [], "entities": {"persons": [{"name": "ronnie campbell", "sentiment": "negative"}, {"name": "jeremy corbyn", "sentiment": "negative"}, {"name": "jeremy", "sentiment": "none"}, {"name": "campbell", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "phil wilson", "sentiment": "none"}], "locations": [{"name": "blyth valley", "sentiment": "none"}, {"name": "sedgefield", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "israel", "sentiment": "none"}], "organizations": [{"name": "newcastle chronicle", "sentiment": "negative"}, {"name": "labour", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Ronnie Campbell and Jeremy Corbyn (Image: Newcastle Chronicle) Share Get daily   Thank you for subscribing!   \nClaims that Labour has a problem with anti-Jewish racism have been “got up by the Right-wing media” who are using it as “a big stick to hit Jeremy with”, according to one of Jeremy Corbyn’s supporters. \nBlyth Valley MP Ronnie Campbell has issued a statement expressing staunch support for party leader Jeremy Corbyn. \nHe said that anyone who criticised Israel found themselves “accused of racism or fascism”. \nAnd Mr Campbell said that attacks were coming from “career politicians in the Labour Party” who should instead be fighting the Conservative Party. \nThe Labour MP, a long-standing supporter of Mr Corbyn , spoke as Labour’s row over anti-Semitism continued. Ronnie Campbell MP (Image: Newcastle Chronicle) \nPhil Wilson, Labour MP for Sedgefield, has said anti-Semites “feel as though they now have a home in Labour’s mainstream” and warned: “If they are not evicted I fear for Labour’s soul.” \nOrganisations representing Britain’s Jewish communities wrote to Jeremy Corbyn this week accepting his offer of a meeting to discuss anti-Semitism within the Labour Party. \nMr Campbell said: “Let us be clear – Adolf Hitler was a very bad person, and there is not an anti-Semitic bone in Jeremy Corbyn’s body. \n“There are few people who have done more to tackle racism and intolerance, in all its forms, than my party Leader. Read More The chances of winning the lottery have gone down - as has the amount donated to charity \n“The latest row over the bizarre allegation that Jeremy is in any way anti-Jewish has been got up by the Right-wing media. \n“It is getting so bad that you cannot criticise Israel in its dealings with Palestine without being accused of racism or fascism. They are using it as a big stick to hit Jeremy with.” Labour leader Jeremy Corbyn (Image: Getty Images Europe) \nHe added: “I do understand that people have to be careful what they say in any social media, and I will never condone some of the juvenile nonsense put about by social media on all sides, on Brexit and a host of other issues as well as racial slurs. \n“However, the row is not as big as the Daily Mail and other Establishment toilet papers making it out to be. \n“Any critic of Israel who has had dealings with Palestine is seen as anti-Semitic and that is just plain wrong. \n“The Jewish people are no different to any other ethnic or social minority communities, such as the Irish, the Asian and the Chinese who have contributed so much to our society. And long may that continue. \n“For once, it is not the Tories that are doing this; it is people on our side. Those career politicians in the Labour Party need to wind their necks in and fight the Tories. We have to remember who the enemy is - the Tories!” \nThe Board of Deputies of British Jews and the Jewish Leadership Council have written to Mr Corbyn to thank him for his commitment to addressing the “anguish” caused by anti-Semitic incidents. \nBut they said that the events of the past few weeks had not been “reassuring” for Jewish people in Britain, and told him he need to use his “personal authority” to root anti-Semitism out of his party. Read More The North is urged to speak with one voice as new transport body meets for the first time \nMr Corbyn’s offer of a meeting came after he was attacked by some in his own party for a supportive comment he made to the painter of an anti-Semitic mural. He later apologised and admitted he had not looked closely enough at the picture before commenting. \nIn a letter to the Board of Deputies and the Jewish Leadership Council, Mr Corbyn said he accepted his “responsibility to give a strong and continuing personal lead”. Like us on Facebook", "external_links": [], "published": "2018-04-05T18:00:00.000+03:00", "crawled": "2018-04-05T18:37:21.005+03:00", "highlightTitle": ""}