{"organizations": [], "uuid": "0e754945ebf8c425e3bcc6404755d55ac2bfb1a5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14222574.ece/ALTERNATES/s1200/The-Nissan-factory-in-Sunderland-has-manufactured-the-first-of-its-new-Leaf-model-electric-cars.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/nissan-cut-jobs-sunderland-due-14555976", "country": "GB", "domain_rank": 21960, "title": "Nissan to cut 'hundreds' of jobs in Sunderland due to short-term reduction in work", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-04-20T16:24:00.000+03:00", "replies_count": 0, "uuid": "0e754945ebf8c425e3bcc6404755d55ac2bfb1a5"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/nissan-cut-jobs-sunderland-due-14555976", "ord_in_thread": 0, "title": "Nissan to cut 'hundreds' of jobs in Sunderland due to short-term reduction in work", "locations": [], "entities": {"persons": [], "locations": [{"name": "sunderland", "sentiment": "none"}], "organizations": [{"name": "nissan", "sentiment": "negative"}, {"name": "invalid email  nissan", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nNissan is planning to axe a number of jobs - believed to be hundreds - at its Sunderland factory over the next year. \nThe automotive giant has revealed that it is looking to cut the number of salaried positions at its Sunderland plant as part of plans to introduce a new range of automotive parts. \nNissan said the cuts were needed because it is planning to introduce a new range of powertrains and during the process, which will lead to its plant volumes decreasing. \nNissan has declined to say how many jobs will be affected by the decision, or how long the discussions with staff on job losses will take. It has been reported that there will be “hundreds” of redundancies, but the company has declined to comment on numbers. \nThe jobs losses are expected to come from a range of departments, not just the powertrain section. The Nissan factory in Sunderland (Image: Unknown) \nIn a statement the firm said: “As previously communicated, we are transitioning to a new range of powertrains over the next year. \n“As we make the operational changes required to support this, we will be managing a planned short-term reduction in powertrain supply and plant volumes at NMUK in line with our 2018 business plan. \n“We are now discussing these operational changes with our employees.” \nThe news on job losses has come the day after it was revealed car sales had fallen in Europe for the first time in four years, with Nissan among those worst affected. \nThe European Automobile Manufacturers Association said the EU passenger car market had declined by 5.3%, with particular problems in the UK, Germany and Italy. \nAmong manufacturers, Nissan suffered one of the largest declines, losing 17.8% of sales from this time last year, and seeing its share of the European market fall from 4.8% to 4.2%. \nLast week Jaguar Land Rover (JLR) said it would cut production at its Solihull plant and not renew the contracts of around 1,000 temporary workers, blaming “continuing headwinds impacting the car industry”. Read More Blue passport decision 'too important to be made on price', Gateshead MP says \nBoth firms, along with other automotive giants, have suffered from a slump in the sales of diesel cars after governments around the world moved to make them less attractive because of higher-than-thought pollution levels. \nUncertainty over Brexit is also affecting the automotive industry, with MPs warning of potentially huge job losses in the automotive sector if negotiations with the EU do not provide protection for the industry. \nThe introduction of tariffs and delays if the UK leaves the EU single market would be hugely damaging to car manufacturers, where car parts are frequently transported across borders during the manufacturing process. \nBut Nissan have stressed that the current job losses are not related to Brexit. Like us on Facebook", "external_links": [], "published": "2018-04-20T16:24:00.000+03:00", "crawled": "2018-04-20T17:50:56.017+03:00", "highlightTitle": ""}