{"organizations": [], "uuid": "19117fa8976ad9c88572b892bd33bd0a3ad78c59", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14442920.ece/ALTERNATES/s1200/ruemain.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/de-la-rue-not-appeal-14544191", "country": "GB", "domain_rank": 21960, "title": "De La Rue will NOT appeal decision to hand iconic blue passport to French firm", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-04-18T10:23:00.000+03:00", "replies_count": 0, "uuid": "19117fa8976ad9c88572b892bd33bd0a3ad78c59"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/de-la-rue-not-appeal-14544191", "ord_in_thread": 0, "title": "De La Rue will NOT appeal decision to hand iconic blue passport to French firm", "locations": [], "entities": {"persons": [{"name": "de la rue", "sentiment": "negative"}, {"name": "de la rue boss martin sutherland", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "gateshead", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "team valley", "sentiment": "none"}], "organizations": [{"name": "business de la rue", "sentiment": "negative"}, {"name": "de la rue", "sentiment": "negative"}, {"name": "gemalto", "sentiment": "none"}, {"name": "gemalto share de la rue", "sentiment": "none"}, {"name": "daily mirror", "sentiment": "none"}, {"name": "invalid email  de la rue", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business De La Rue will NOT appeal decision to hand iconic blue passport to French firm De La Rue has made British passports in Gateshead for 10 years but will not appeal the Government's decision to hand the contract to Gemalto Share De La Rue in Gateshead, which has lost the contract to make British passports (Image: Daily Mirror) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nDe La Rue has revealed that it will not appeal the decision by the UK Government to hand a contract to print the iconic blue British passports to a French rival. \nThe company has printed UK passports from its Team Valley factory, in Gateshead, for the last 10 years but last month the Government contract was issued to Franco-Dutch firm Gemalto. \nThe decision caused wide-spread controversy as the contract will involve EU-headquartered Gemalto printing the first batch of blue passports after Brexit. It could also put around 200 Gateshead jobs at risk. \nAt the time of the decision De La Rue boss Martin Sutherland said he was “disappointed and surprised” that an “icon of British identity” would be manufactured in France. \nThe UK firm then said it would appeal the tender decision in a bid to win back the work, and even went as far as to say it could take the Government to court. \nHowever, De La Rue has now reversed its decision and said it will no longer be lodging an appeal. Read More Gateshead jobs at risk as blue passport to be printed abroad \nMr Sutherland said: “It looked unlikely that we would get this overturned on a technicality. It looks unlikely to us it will get overturned politically. \n“So as a business what we have to do is we have to act in the interests of our staff, of our customers, of our shareholders and we have to focus our efforst and our energies elsewhere. \n“It’s a disappointing outcome but that’s just the rough and tumble of business.” \nHe added that no decision had been made about the jobs in Gateshead, and said De La Rue would be seeking new orders to replace the British passport contract when it ends in 18 months. \nDe La Rue’s Team Valley site primarily focuses on printing bank notes for countries around the world. The factory employs around 600 people, with around 200 of them working in the passport division. Read More Take a look inside the Gateshead factory where 50 million banknotes are produced each week \nThe UK Government has defended its decision to give the contract to Gemalto claiming it will save UK taxpayers around £120m. But despite the cost saving implications members of UK have rallied in support of De La Rue with 266,000 people adding their signature to a petition calling for the Home Office to give the contract to the British firm. \nTrade union Unite has came out in support of the passports being made in the UK and said the announcement represents a “dark day for manufacturing”. \nLouisa Bull, Unite national officer, said: “This news will come as a bitter blow to De La Rue workers who now face an uncertain future. Workers will feel let down that the company is not prepared to fight the government’s decision to ship the production of the new blue passport overseas.” \nShe added: “Unite will be working closely with De La Rue to seek assurances on jobs as well as supporting workers through these uncertain times. \n“It need not be like this though. Unite and our members are mobilised and prepared to fight the government’s decision which represents a dark day for UK manufacturing. \n“Theresa May needs to wake up to the anger her Government’s short sighted job destroying decision has generated and intervene to back UK passport workers by ensuring Britain’s blue passports are made in the UK.” Like us on Facebook", "external_links": [], "published": "2018-04-18T10:23:00.000+03:00", "crawled": "2018-04-18T13:01:57.024+03:00", "highlightTitle": ""}