{"organizations": [], "uuid": "74b625ca2483139c904d4823663b27a9a58bab9a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14508622.ece/ALTERNATES/s1200/Election-in-United-Kingdom-voting-at-the-ballot-box.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/ukip-could-fold-after-next-14591736", "country": "GB", "domain_rank": 21960, "title": "Why Ukip could fold after next week's local elections, according to a political expert", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-04-29T18:00:00.000+03:00", "replies_count": 0, "uuid": "74b625ca2483139c904d4823663b27a9a58bab9a"}, "author": "Mike Kelly", "url": "https://www.chroniclelive.co.uk/news/north-east-news/ukip-could-fold-after-next-14591736", "ord_in_thread": 0, "title": "Why Ukip could fold after next week's local elections, according to a political expert", "locations": [], "entities": {"persons": [{"name": "ukip", "sentiment": "negative"}, {"name": "martin farr", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "nigel farage", "sentiment": "none"}], "locations": [{"name": "gateshead", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "south tyneside", "sentiment": "none"}, {"name": "north tyneside", "sentiment": "none"}, {"name": "houghton", "sentiment": "none"}], "organizations": [{"name": "sunderland", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Why Ukip could fold after next week's local elections, according to a political expert With Brexit approaching has the controversial right wing party lost the reason for its existence? Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily Thank you for subscribing! Could\nEurosceptic party UKIP could be staging its last hurrah at Thursday’s local elections in the North East.\nIn total there are 163 seats up for grabs at Newcastle, Sunderland , South Tyneside, Gateshead and North Tyneside councils - yet it has only put up 18 candidates altogether.\nAmazingly it has none standing in Sunderland, the city synonymous with Brexit as it was the first to declare its support for Leave.\nWhen this was first revealed, a statement was issued by the Sunderland and Houghton branch denying first of all that it was as a result of deals with other parties.\nIt also said: “ UKIP is not dead, especially in Sunderland.”\nHowever, if not dead, it seems to be on a political life support machine. Former UKIP leader and current MEP Nigel Farage (Image: AP)\nPolitical expert Dr Martin Farr of Newcastle University said: “They are the UK Independence party and as we’re withdrawing from Europe its reason to exist is gone.”\nAnd, he said, its recent leadership controversies had also brought it into disrepute.\nMeanwhile previous leader Nigel Farage, no matter what people thought of him, was a huge loss too.\n“He was its principal face and he has gone onto other things. Minority parties like UKIP need a noticeable, central charismatic leader,” said Prof Farr. Read More Conservative Party deny having local election pact with Ukip in Sunderland\nIts biggest percentage of candidates in this region are standing in North Tyneside where it has eight fighting in 20 wards.\nIronically in two of them - Monkseaton South and Tynemouth - the fledgling pro-Europe party Renew has its only candidates standing outside of London.\nAt the core of its political platform is the demand for a second referendum on the final deal before leaving Europe.\nDr Farr said: “It’s really interesting that while Brexit means UKIP is losing its reason for existing, it is the reason for the birth of Renew.” Ballot box (Image: Rui Vieira/PA Wire)\nWhile slightly dismissive of the name - “it sounds a bit like a soap powder” - he said it was looking to plough the fertile ‘centre ground’ of politics.\n“The Labour leadership is quite left wing, too much for people who regard themselves as moderate centrists.\n“The mystery is why the Lib Dems aren’t benefitting. Actually it’s no mystery as it’s been so tarnished by the Coalition, like Iraq did to Labour under Tony Blair which has now led to Jeremy Corbyn.”\nRenew was only officially launched in February, originally to get the machinery in place for the 2022 general election- it is currently ‘vetting’ prospective parliamentary candidates up and down the country.\nIt takes its inspiration from En Marche - the French party formed in 2016 by Emmanuel Macron which seemingly came from nowhere to see him elected President just a year later. Read More Newcastle UKIP election candidate says Muslims are a 'barbaric satanic cult'\nDr Farr said: “It’s about getting name recognition and publicity.\n“Part of the appeal of Renew, like Macron and En Marche offered France, is that it has a newness and novelty and a reputation that hasn’t been tarnished.”\nHe added: “Without Farage UKIP is not sturdy enough. I can’t see him coming back.\n“Brexit was an opportunity made by the fact there was the perfect coincidence of public disquiet about immigration and an eloquent and unscrupulous mouthpiece to take advantage of it.\n“It was a moment in time. Without UKIP there wouldn’t have been Brexit. With Brexit now coming there will be no UKIP.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-04-29T18:00:00.000+03:00", "crawled": "2018-04-29T20:00:00.019+03:00", "highlightTitle": ""}