{"organizations": [], "uuid": "66b02e2aa60705e1c293db8dbae2e0cd30e9fcba", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14557276.ece/ALTERNATES/s1200/Sir-John-Major-Gives-A-Brexit-Speech-On-How-To-Bring-Negotiations-To-A-Close.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/sir-john-majors-cathedral-date-14556980", "country": "GB", "domain_rank": 21960, "title": "Sir John Major's cathedral date sparks (almost) biblical backlash", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-04-20T20:00:00.000+03:00", "replies_count": 0, "uuid": "66b02e2aa60705e1c293db8dbae2e0cd30e9fcba"}, "author": "Ian Johnson", "url": "https://www.chroniclelive.co.uk/news/north-east-news/sir-john-majors-cathedral-date-14556980", "ord_in_thread": 0, "title": "Sir John Major's cathedral date sparks (almost) biblical backlash", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "St Nicholas Cathedral silhouetted against the morning sky in Newcastle City Centre (Image: Newcastle Chronicle) Share Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nOn Thursday night, Sir John Major will speak inside Newcastle Cathedral . \nAlthough the fundraising event costs £29.50-a-head, the ex-PM won’t pocket a penny for appearing. \nYet his appearance has sparked a storm of - almost - biblical proportions. \n“I think it is rather hypercritical (that) an organisation that is meant to reach out to the poor and needy and vulnerable is charging for people to listen to someone who has helped put them in this situation,” raged Alan Tullett. \n“I’m pretty sure that if Jesus was alive today, he would have turned up and trashed the place, just as supposedly he did in the bible.” \nThat anger oozed through the Cathedral’s Facebook post announcing Sir John’s appearance. \n“Is it really appropriate for the church to be giving a platform to someone who represented, and to many still will represent, the establishment?’ added Fred Rich. \nThe common thread that linked many of the comment was not that Sir John was appearing. \nIt was that he was a Tory. \n“They don’t represent normal, hard working British people,” fumed Stephen Knight. \nNewcastle is Labour country, a city which hasn’t had a Tory councillor since 1995. \nAnd the Facebook backlash towards the appearance of Sir John, who fought to remain in the EU, paints a picture of an area still unwilling to forgive the Conservatives for the damage many here perceive they did generations ago. Sir John Major (Image: Getty Images Europe) \nOne quipped they wouldn’t attend if they were paid in gold bars, while one questioned the “strange” booking. \nYet the Conservatives believe that attitude is changing in our region. \nLast year, the party took two Westminster seats in another North-East Labour stronghold - Teesside \nAnd on May 3, when the region takes to the polls for local authority elections, there is a quiet confidence among local Tory brass that the party will make gains. \n“We have been campaigning really hard across Newcastle and knocking on doors,” said a Newcastle Conservative’s spokesperson. \n“There seems to be a lot of opportunity.” \nThey added candidates had received “no hostility” while canvassing. \nSir John’s talk is titled “The Way We Live Now” and tickets range from £5 to £29.50, the latter of which includes a drinks reception. \nSt Nicholas’ Cathedral declined to comment on the backlash. \nIn their advert, the cathedral states Sir John will offer “the benefit of his huge experience at a time when our communities face many important challenges and opportunities.” \nOthers were more welcoming of his appearance, with JJ McLauchlin stating: “I might not agree with his politics but he seems a decent man and he’s spot on about Brexit.” \nTickets are still available.", "external_links": [], "published": "2018-04-20T20:00:00.000+03:00", "crawled": "2018-04-21T00:34:35.003+03:00", "highlightTitle": ""}