{"organizations": [], "uuid": "b9a090b47d5df124d74e63de7f3ebf2694723dff", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/news/article607933.ece/ALTERNATES/s1200/Win3.jpg", "site_section": "http://www.leicestermercury.co.uk/rss.xml", "section_title": "leicestermercury - frontpage", "url": "https://www.leicestermercury.co.uk/news/business/who-richest-asians-leicestershire-1507914", "country": "GB", "domain_rank": 48128, "title": "Who are the richest Asians in Leicestershire?", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-04-28T01:00:00.000+03:00", "replies_count": 0, "uuid": "b9a090b47d5df124d74e63de7f3ebf2694723dff"}, "author": "Tom Pegden", "url": "https://www.leicestermercury.co.uk/news/business/who-richest-asians-leicestershire-1507914", "ord_in_thread": 0, "title": "Who are the richest Asians in Leicestershire?", "locations": [], "entities": {"persons": [{"name": "chris gordon", "sentiment": "none"}, {"name": "nik kotecha", "sentiment": "none"}], "locations": [{"name": "leicestershire", "sentiment": "none"}, {"name": "braunstone", "sentiment": "none"}, {"name": "winstanley house", "sentiment": "none"}], "organizations": [{"name": "asian media group", "sentiment": "none"}, {"name": "winstanley house", "sentiment": "none"}, {"name": "amg", "sentiment": "none"}, {"name": "eastern eye", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Who are the richest Asians in Leicestershire? Leicestershire business people figure highly on 2018 Asian Rich List Midlands - with combined wealth of £585m Share 2018 Asian Rich List was announced at Winstanley House, in Braunstone (Image: Chris Gordon) Share Get Business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nSome of Leicestershire's most successful entrepreneurs have made it onto a list of the region's top 10 wealthiest Asian business people.\nAccording to the 2018 Asian Rich List Midlands, the four business people, all of whom are male, are worth a combined total of £585 million.\nThe list was revealed during an awards event at Winstanley House, in Braunstone, during which tribute was paid to the city and county’s top Asian business people.\nThe combined overall net worth of the featured 51 Midlands millionaires on this year’s list is more than £5 billion, up £400 million in a year, with the top 10 valued at more than £3 billion.\nCompiled by Eastern Eye publisher Asian Media Group (AMG), the 2018 list says that Dr Nik Kotecha is the fifth wealthiest Asian person in the region, worth a reported £235 million.\nDr Kotecha is chief executive at Loughborough-based medicines supplier Morningside Pharmaceuticals, which recently signed a three-year naming rights deal with the Leicester Riders basketball stadium .\nTaking sixth place on this year’s list is Aziz Tayub, who heads up the family-run wholesale business Crown Crest, in Kirby Muxloe, which also owns the Poundstretcher store chain.\nAccording to the list, Mr Tayub is reported to be worth £195 million. The family behind Poundstretcher are high up on the list\nPoundstretcher employs about 6,000 people in 400 stores nationwide, with 100 staff at its Leicestershire headquarters.\nThe group saw turnover drop about £37 million, to £412 million, in the year to March 31, 2107.\nIn at number seven on this year’s list are toilet roll manufacturers Shiraz and Amin Tejani, with a reported combined wealth of £155 million.\nShane Thakrar, 34, whose family run petrol forecourt business HKS Retail, is at number 12 on the list. He said the region had lots to be proud of.\nHe said: “It’s been a great home to us.\n“The Midlands is a diverse area with a great economy, and it’s a powerful place with so many pockets of different trades.” Shane Thakrar of HKS Retail - The family business has expanded exponentially and won lots of awards (Image: Chris Gordon)\nLoughbrough-based Kailash and Suman Suri, who run the independent Reel cinema chain, have risen up the list from 34 to 21 this year.\nOther risers include Joginder Pal and Harjot Singh Anand, who own battery and electronics wholesaler Anand International, in Melton Road, Leicester, who have moved up from 44 to number 36.\nThe list was announced along with the winners of Asian Media Group’s 2018 Asian Business Awards.\nWinner of the food and drink category was Simtom Food Products, on the Merry Lees Industrial Estate, near Desford, which makes Indian sauces, seasonings, marinades, pickles and chutneys.\nA pioneer award was presented posthumously to Bhagwanjibhai Lakhani, who co-founded Bobby’s Restaurant, in Belgrave Road, Leicester, in 1976.\nAn entrepreneur of the year award went to Keith and Maria Bastian, managing directors at Leicester radiator business Fischer Future Heat, who also have an electricity and gas supply business.\nThe Asian business of the year was Cofresh Snack Foods which makes snacks such as Bombay mix at its factory in Menzies Road, Leicester.\nShailesh Solanki, executive editor of AMG, said: \"The Midlands has for a long time been a beacon of success for the UK. Read More\n“The list shows the remarkable strength and diversity of Asian businesses in the region. Read More\n“And with Brexit on the horizon, and uncertainty over future trading relationships with Europe and the world, this comprehensive list proves that British Asian businesses in the Midlands have the desire, flair and know-how to continue to flourish.” Like us on Facebook ", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/leicestermercury/subscriptions/&quot;}"], "published": "2018-04-28T01:00:00.000+03:00", "crawled": "2018-04-28T07:28:07.052+03:00", "highlightTitle": ""}