{"organizations": [], "uuid": "63d5fad3f92e5c5862e6ab933f7f7a890399fc3a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1430387.ece/ALTERNATES/s1200/Jade-Krotke-wants-to-warn-other-parents-after-finding-needles-in-the-baby-changing-unit-at-McDonalds.png", "site_section": "http://www.devonlive.com/rss.xml", "section_title": "devonlive - frontpage", "url": "https://www.devonlive.com/news/devon-news/mums-warning-after-finding-used-1430416", "country": "US", "title": "Mum's warning after finding used 'needles' on McDonald's baby changing mat", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-04-07T17:50:00.000+03:00", "replies_count": 0, "uuid": "63d5fad3f92e5c5862e6ab933f7f7a890399fc3a"}, "author": "Katie Timms", "url": "https://www.devonlive.com/news/devon-news/mums-warning-after-finding-used-1430416", "ord_in_thread": 0, "title": "Mum's warning after finding used 'needles' on McDonald's baby changing mat", "locations": [], "entities": {"persons": [{"name": "jade krotke", "sentiment": "none"}, {"name": "olivia", "sentiment": "none"}, {"name": "sebastian krotke", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "mrs krotke", "sentiment": "none"}], "locations": [{"name": "new george street", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "mcdonald", "sentiment": "none"}, {"name": "herald", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Mum's warning after finding used 'needles' on McDonald's baby changing mat Jade Krotke, 25, said she now wanted to make other parents aware of what happened Share Jade Krotke wants to warn other parents after finding needles in the baby changing unit at McDonald's Share Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nA mum has told of her horror after she found what she believed were used 'smack needles' on a baby changing unit in McDonald's. \nJade Krotke, 25, said she now wanted to make other parents aware of what happened. \nMrs Krotke also said she was \"disgusted\" by the way that management at the New George Street store in Plymouth handled the situation. \nMcDonald's has now apologised for Mrs Krotke's experience, reports The Herald . \nThe mum-of-one had just finished eating in the store in Plymouth city centre with her husband, her daughter and her sister. Read More Devon wants final say on Brexit deal say campaign group \nMrs Krotke then took her daughter Olivia to the downstairs changing facilities with hubby Sebastian Krotke, where they found \"three used needles\" on the changing unit. \nMrs Krotke said: \"The toilet door had to be unlocked by a member of staff for us to use the room which suggests it hadn't been checked properly prior. \n\"Had I not been concentrating, my eight-month-old daughter would have been placed on top of this. \n\"I am furious.\" Jade said she was \"furious\" after almost laying her daughter on the needles \nMrs Krotke said that when she called on a member of staff she was \"in shock\". \nShe added that the cashier was very apologetic, but was unhappy with how the manager responded and that the way the situation was handled made her feel like it was \" a regular occurrence\" in the store. Read More \nMrs Krotke said: \"The manager didn't even acknowledge us and went to clean it up with a sharps box in his hand. I'm assuming this is a frequent occurrence. \n\"It's disgusting. \n\"Hats off to the young lady on the till, she kept apologising but the manager did nothing. \n\"It's devastating, it could have punctured her [Olivia's] skin and it could have given her HIV or anything.\" \nThe family said that they tried to report the incident on the McDonald's website, but were faced with lots of questions about what they had to eat at the restaurant and then received an automated response. The baby changing unit in the McDonald's \n\"McDonald's prides itself on being a family friendly restaurant, but they have handled it badly,\" she said. \nMrs Krotke is now urging parents to check baby changing units before they lay their children on them. Read More Thousands of pounds of damage as hooligans smash up city centre shops \nShe said: \"When you're a mum, it's all hectic and go go go, you don't always check before you put them down. \n\"I want parents to be aware no matter how much of a rush you're in, please, please check. \n\"The thought of someone's child, or my child being hurt is frightening.\" \nThe Krotke family currently live in Tenerife and had come back to Plymouth to attend a family members wedding. Baby Olivia's mum said she could have been put down on the needles \nMrs Krotke added: \"I don't want anything, I just want parents to be vigilant. \n\"They've put needles in the unit that you put your baby in, it's vile. \n\"My daughter is my life and if something happened to her, I'd never forgive myself.\" Read More Umbrellas will be needed across Devon this weekend \nA McDonald’s spokesperson said: \"We are sorry for this customer’s experience. \n\"Hygiene and safety is of paramount importance to us; the baby changing facility in this restaurant is within a toilet which is locked and checked frequently. \n\"Once our restaurant manager became aware of the issue the items were disposed of safely.” Like us on Facebook", "external_links": [], "published": "2018-04-07T17:50:00.000+03:00", "crawled": "2018-04-07T18:01:14.000+03:00", "highlightTitle": ""}