{"organizations": [], "uuid": "a248887fb7cd04b183d67e254eb6fee1d775ac2c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14516443.ece/ALTERNATES/s1200/JS146730206.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14516444", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Shopping centre giant Hammerson knocks back new takeover offer", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-04-11T10:05:00.000+03:00", "replies_count": 0, "uuid": "a248887fb7cd04b183d67e254eb6fee1d775ac2c"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14516444", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Shopping centre giant Hammerson knocks back new takeover offer", "locations": [], "entities": {"persons": [{"name": "carolyn fairbairn", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "coreena ford greater", "sentiment": "negative"}, {"name": "hammerson", "sentiment": "negative"}, {"name": "cbi", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford Greater costs than opportunities if UK moves away from EU rules, CBI says \nBusiness will be hit by greater costs rather than benefits if Brexit leads to the UK moving away from EU rules and regulations, an industry group has warned. The CBI said a study of 23 industry and service sectors showed that 18 preferred convergence or alignment for most of the important regulations. \nRule changes in agriculture, shipping and tourism could benefit the economy, but these are “vastly outweighed” by the costs of deviating from rules necessary to ensure smooth access to the EU, said a CBI report. \nCarolyn Fairbairn, CBI director general, said: \nIt’s vitally important that negotiators understand the complexity of rules and the effects that even the smallest of changes can have. \nDeviation from rules in one sector will have a knock-on effect on businesses in others, and divergence from rules in one part of a production process will have consequences for market access throughout entire supply chains. \nIt’s hard to overstate the importance of the decisions that will be taken over the next six months. “Put simply, for the majority of businesses, diverging from EU rules and regulations will make them less globally competitive, and so should only be done where the evidence is clear that the benefits outweigh the costs. The EU and Union flags (Image: PA) 8.50 KEY EVENT Sub-zero ice bar Antarctica coming to Newcastle city centre \nA sub-zero ice bar is set to become the city’s coolest attraction when it opens as part of shopping and leisure destination Stack Newcastle. \nDevelopers Dan­­ieli Holdings are weeks away from officially opening the 60-shipping-container ‘box park’ on the former Odeon cinema site, potentially creating 500 jobs over the four years it will be there. \nContractor Brims Construction is getting the patch of land ready for the arrival of the 60 shipping containers that will form the base of Stack, currently being fabricated in Cheshire and Teesside. \nStack aims to combine the best elements of food festivals and continental markets, providing a launchpad for up to 50 SMEs. \nDanieli Holdings, which operates Yolo Townhouse and Yolo Ponteland, has also announced plans for its own leisure venues to feature within the box park. \nThese include Antarctica, an ice bar serving beers and cocktails in a sub-zero setting, crafted entirely from ice, which will become one of the three seasonal attractions, alongside the popular Hadrian’s Tipi and another new arrival, Enchanted Garden. An ice bar similar to this one in Manchester is coming to Newcastle (Image: Manchester Evening News) 8.43 KEY EVENT Four shops closed in the North East EVERY WEEK last year \nRetailers closed four stores in the North East every week last year as the challenging retail climate continued to trouble the high street. \nRetail store closures rose massively across the region’s high streets in 2017, with closures outstripping the number of stores opening amid changing consumers habits and economic uncertainty, according to research compiled by the Local Data Company (LDC). \nThe region as a whole started the year with 2,321 stores owned by multiple retailers – businesses with more than five shops – but ended it with 2,221, and with openings and closures factored in the region had seen net loss of 100 stores – a marked increase on the net loss of 14 the year before. \nThe analysis of the top 500 town centres in Great Britain covered 67,157 outlets run by multiple retailers last year. It found that 116 shops opened and 216 closed across the North East and all but one town and city in the region saw more closures than openings. \nStockton was the only town centre that saw a positive net change in 2017, where seven shops opened but only six closed. \nNewcastle saw the most closures, with 46 shutting up shop – including the likes of Greenwoods menswear and hardware store Clas Ohlson – though it had seen the most openings with 43 new businesses launching to the high street, giving a net change of just -3 Shoppers on Northumberland Street, Newcastle (Image: Newcastle Chronicle) 8.35 Coreena Ford Facebook to probe 'tens o thousands' of apps \nFacebook will investigate “tens of thousands” of apps to discover if any other companies have accessed data in a similar way to Cambridge Analytica (CA), Mark Zuckerberg has told US politicians. \nThe social network says it is in the process of letting up to 87 million users know that their information may have been accessed by CA, and in a packed room on Capitol Hill, Mr Zuckerberg repeated his admission that the company “didn’t do enough” to stop its tools “being used for harm”. \nHe also said the company was in an “arms race” with Russia, warning there were people in the country tasked with finding ways to breach Facebook’s systems. \nAfter a torrid few weeks for the company’s share price investors rewarded Mr Zuckerberg for appearing on the Hill. \nFacebook stocks rose 4.5% on Tuesday, which is said to have swelled the entrepreneur’s fortune by several billion dollars. \nSpeaking to the Senate Judiciary and Commerce Committees, the tech entrepreneur apologised that Facebook had not taken a “broad enough view” of its responsibility for people’s public information. \n“It was my mistake, and I’m sorry. I started Facebook, I run it, and I’m responsible for what happens here,” he said, in words from a prepared statement. \nMr Zuckerberg said its audit of third-party apps would highlight any misuse of personal information, and said the company would alert users instantly if it “found anything suspicious”. Facebook CEO Mark Zuckerberg (Image: FR34727 AP) 8.30 KEY EVENT Competitions watchdog to probe Trinity Mirror's takeover of Northern & Shell \nThe Competition and Markets Authority has launched an investigation into Trinity Mirror’s £126.7m deal to buy Daily Express publisher Northern & Shell. \nThe probe will assess whether the tie-up would substantially lessen competition within the UK media industry. \nA short statement from the CMA said: “Trinity Mirror plc took over part of Northern & Shell Media Group Limited, including the Express and Star newspapers, in February 2018. \n“The Competition and Markets Authority (CMA) will now assess whether this deal could significantly reduce competition within the UK media sector, in line with its merger guidance.” \nThe deadline for the initial decision is June 7. The Trinity Mirror media group agreed in February to pay £126.7m for Northern & Shell (Image: Getty Images Europe) 8.25 Coreena Ford Little Mix and Ed Sheeran help UK record labels reach Britpop era sales growth \nUK record labels grew at the fastest rate since the Britpop era last year, as artists including Ed Sheeran, Little Mix and Stormzy helped boost revenues through vinyl records and streaming services. \nRecord companies in the UK generated £839.4m in sales in 2017, up 10.6% on the prior year, according to figures from the British Phonographic Industry (BPI) The last time the industry achieved a similar level of growth was in 1995, when sales jumped 10.7% on the back of Britpop bands such as Oasis, Blur and Pulp. \nNow, record companies are banking on the success of stars such as Sheeran, whose album Divide was the most popular record in all formats last year. Streaming was the fastest-growing sales category, with revenues rising by 41% year-on-year to £388.8 million. \nStreaming, which includes subscription services, video streaming and ad-supported streaming, now makes up close to half (46%) of the industry’s total turnover. \nSales of physical records also rose in the year, a trend supported by the ongoing revival of vinyl records, with sales of the format jumping 24% year on year. Little Mix concert at Durham County Cricket Club (Image: Tony Stott) 8.20 Coreena Ford North East exports grow at fastest level in more than a decade \nNorth East businesses have grown their export sales at the fastest rate in more than 11 years, according to the North East England Chamber of Commerce (NEECC). \nThe figures have been published as part of the chamber’s Quarterly Economic Survey, which showed a slight increase in overall growth compared to the end of 2017. \nA major contributor to this was export sales growth reaching its highest level since the end of 2006. \nChamber president John McCabe said: “The overall data from the first quarter of 2018 confirms continuation of the positive trend we’ve seen since the end of 2016. It is worth noting that the rate of growth has slowed slightly, perhaps reflecting wider economic trends. Individual responses to this survey suggest many businesses are apprehensive about Brexit and what it will mean for future investment and growth. Given the contribution made by export sales growth to this quarter’s results, this comes as little surprise.” \nThe survey takes a selection of North East companies and asks whether they have experienced an increase or decrease in UK sales, exports, and training investment. The result of each question is given a numerical score with a positive figure showing growth and a minus figure showing contraction. \nOn the whole, North East businesses said exports sales had increased over the last three months, with the index receiving a score of 21.3. The figure was up 6.5 compared with last quarter. North East England Chamber of Commerce president John McCabe (Image: Unknown) 8.15 Coreena Ford Tesco shares rise after ringing up big profits \nTesco has posted a surge in annual profits as it hailed a year of “strong progress” after more than two straight years of rising sales and the completion of its £3.7 billion Booker deal. \nThe UK’s biggest supermarket reported a 28.4% jump in underlying operating profits to £1.64bn for the year to February 24. \nTesco notched up like-for-like sales growth of 2.2% in the UK after a 2.3% rise in the final three months - marking its ninth quarter of growth in a row. Boss Dave Lewis said the group was on track to deliver at least £200 million of annual cost savings after sealing its takeover of wholesaler Booker. \nThe group also announced its first end of year dividend since 2014, with a final payout of 2p, giving a 3p full-year divi for shareholders. \nMr Lewis said: \nThis has been another year of strong progress, with the ninth consecutive quarter of growth. “I am delighted to have completed our merger with Booker, and we are moving quickly to deliver synergies and access new growth. \nThe results also showed that on a bottom line basis, pre-tax profits leapt to £1.3 billion from £145 million after one-off costs weighed on the previous year’s result.Shares rose nearly 4% after the results. Tesco (Image: Manchester Evening News) 8.05 KEY EVENT Hammerson knocks back renewed offer from Klepierre - but doesn't bring down shutters on talks \nShopping centre owner Hammerson has knocked back a sweetened £5.04bn takeover offer from Klepierre, saying the French firm’s advances failed to reflect the value of the shopping centre giant. \nHammerson - owner of Cleveland Retail Park in Middlesbrough and former owner of Newcastle’s Monument Mall and Cramlington’s Manor Walks - has paused its merger with Eldon Square and Metrocentre owner Intu as it awaits clarity on a takeover approach from the rival. \nBut the Birmingham Bullring owner has now knocked back a revised cash-and-shares bid of 635p - comprising 50% cash and 50% in new Klepierre shares - but said the board was willing discuss an offer that met its valuation. \nKlepierre is determined to takeover the firm and take it away from the deal with Intu, a £3.4bn tie-up which could create the biggest property business in Britain. \nHammerson branded Klepierre’s initial 615p cash-and-shares bid worth £4.88bn “wholly inadequate” and “entirely opportunistic”. \nIt said today’s offer price did not justify further talks at this price, but the French rival still has until April 16 to table a formal offer. \nDavid Tyler, Hammerson chairman, said: “The board has considered the revised proposal from Klepierre carefully. \n“At 635p, it is only a 3% increase on the previous proposal and continues very significantly to undervalue the company.” \nThe upped proposal was outlined during crunch talks between Mr Tyler and Klepierre chairman Jean-Marc Jestin on Monday. \nHammerson would prefer to press ahead with an all-share takeover of rival Intu, which operates the Trafford Centre in Manchester, while Hammerson owns the Bicester Village and Brent Cross shopping centres as well as the Cleveland shopping complex. Cleveland Retail Park, Middlesbrough.", "external_links": [], "published": "2018-04-11T10:05:00.000+03:00", "crawled": "2018-04-11T13:26:14.004+03:00", "highlightTitle": ""}