{"organizations": [], "uuid": "0121d25b06acff4a1ad83272b3634dce34a8bf1f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14488389.ece/ALTERNATES/s1200/TMP_NEC_220318DeLaRue02JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/government-urged-avoid-legal-action-14488324", "country": "GB", "domain_rank": 21960, "title": "Government urged to avoid legal action by giving passport contract to De La Rue", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-04-03T20:00:00.000+03:00", "replies_count": 0, "uuid": "0121d25b06acff4a1ad83272b3634dce34a8bf1f"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/government-urged-avoid-legal-action-14488324", "ord_in_thread": 0, "title": "Government urged to avoid legal action by giving passport contract to De La Rue", "locations": [], "entities": {"persons": [{"name": "ian mearns", "sentiment": "none"}, {"name": "liz twist", "sentiment": "none"}, {"name": "de la rue", "sentiment": "none"}, {"name": "blaydon", "sentiment": "none"}], "locations": [{"name": "de la rue", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "team valley", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "de la rue mps", "sentiment": "negative"}, {"name": "de la rue news government", "sentiment": "negative"}, {"name": "de la rue", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Government urged to avoid legal action by giving passport contract to De La Rue MPs have backed Gateshead firm De La Rue as it threatens legal action over its bid to produce post-Brexit passports Share The De la Rue plant in the Team Valley (Image: newcastle chronicle) Share Get daily   Thank you for subscribing!   \nMPs have backed Gateshead manufacturer De La Rue after it threatened to take the Government to court over plans to award a contract to produce blue British passports to a Franco-Dutch firm. \nBlaydon MP Liz Twist, whose constituency includes the De La Rue plant, said: “It is great to see they are fighting to keep the contract and keep the jobs here in the North East.” \nGateshead MP Ian Mearns urged the Government to avoid legal action by re-starting talks with the firm. \nHe said: “I think there is room for negotiation between a British Government and a British company to provide a British passport. \n“If it does come to legal action then I hope De La Rue is successful.” \nThe Government responded to the legal threat by announcing it was giving De La Rue two weeks to make its case. \nA spokesman for Theresa May said the standstill period, between a contract being awarded and its final conclusion, had been extended. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nThe looming legal challenge comes as a petition calling for the Home Office to give the contract to a British firm reached 266,000 signatures. \nMinisters have defended a preliminary decision to grant the contract to Gemalto, which they say will save taxpayers about £120m. \nBut it means the new post-Brexit passport will be produced in France - while 200 North East jobs may be put at risk. \nDe La Rue has accepted it is charging more than its rival. But it said it was the “highest quality and technically most secure” option for producing the post-Brexit travel document, warning it was in the national interest to ensure UK passports were produced at home. Read More What is Article 50? \nA spokeswoman said: “We confirm that we are taking the first steps towards initiating appeal proceedings against the provisional decision to award the British passport contract to a part state-owned Franco-Dutch company. \n“Based on our knowledge of the market, it’s our view that ours was the highest quality and technically most secure bid. We can accept that we weren’t the cheapest, even if our tender represented a significant discount on the current price. \n“It has also been suggested that the winning bid was well below our cost price, which causes us to question how sustainable it is. \n“In the light of this, we are confident that we remain the best and securest option in the national interest.” Read More North East Labour MP accuses party colleagues of launching a 'vendetta' against her \nIn December, the Government announced the UK passport would change from the standard EU burgundy colour to a blue and gold design after leaving the bloc. \nThe blue cover was billed as a return to the “iconic” original appearance of the British passport, with the colour first used in 1921. \nAt the time the move was announced, Theresa May said the document was an “expression of our independence and sovereignty”. \nMinisters came under fire after reports emerged that the new travel document would be manufactured in France. \nA Number 10 spokesman said that the Franco-Dutch company Gemalto remained the Government’s preferred bidder. Read More Theresa May says the North East will 'not be left behind' after Brexit as she visits the region \n“The preferred bidder demonstrated they were best able to meet the needs of our passport service, with a high-quality and secure product and best value for the taxpayer,” he said. \nMr Mearns pointed out that a number of petitions had been launched calling on the government to change its mind. \n“There are many petitions, showing it has raised the hackles of the British people.” \nUnite national officer Louisa Bull said: “Unite strongly supports De La Rue’s legal challenge on the grounds of jobs and protecting communities.” Like us on Facebook", "external_links": [], "published": "2018-04-03T20:00:00.000+03:00", "crawled": "2018-04-04T00:36:02.008+03:00", "highlightTitle": ""}