{"organizations": [], "uuid": "03244d2b88694594c5902897d1809caff90c252b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article12857213.ece/ALTERNATES/s1200/North-East-Ambulance-Service-ambulance.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/least-five-ambulance-staff-assaulted-14570287", "country": "GB", "domain_rank": 21960, "title": "At least five ambulance staff are assaulted each week in the North East", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-04-25T07:00:00.000+03:00", "replies_count": 0, "uuid": "03244d2b88694594c5902897d1809caff90c252b"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/least-five-ambulance-staff-assaulted-14570287", "ord_in_thread": 0, "title": "At least five ambulance staff are assaulted each week in the North East", "locations": [], "entities": {"persons": [], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "north east union", "sentiment": "none"}], "organizations": [{"name": "ugc", "sentiment": "none"}, {"name": "invalid email  ambulance", "sentiment": "none"}, {"name": "gmb", "sentiment": "none"}, {"name": "north east ambulance service", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "At least five ambulance staff are assaulted each week in the North East Union wants laws to punish thugs who assault ambulance workers Share North East Ambulance Service ambulance (Image: UGC) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nAmbulance staff have been bitten, stabbed and spat at, with five physical assaults on North East Ambulance Service staff reported every week. \nThere have been 1,646 violent attacks on ambulance workers in the North East since 2012, a major investigation by GMB, the union for ambulance workers, has revealed. \nAnd 292 of these took place in the 12 months between April 1 2017 and March 31 2018. That’s more than five every week, on average. \nExamples of violent attacks reported by GMB members include being bitten, stabbed, having blood spat at them by intravenous drug users, having bones broken, attempts to hit them with cars, as well as racist and sexual abuse. \nThe union revealed the shocking figures ahead of a crunch vote by MPs on tougher sentences for attacks on emergency workers. \nGMB carried out a Freedom of Information survey of employers after national reporting of physical assaults was ended when a body called NHS Protect was abolished last year. \nIt found 72% of ambulance workers have been attacked while on duty, and 94% were aware of attacks on their colleagues. \nThe union’s survey of over 500 ambulance staff across the UK found that: \n* 21% of ambulance staff had to take sick leave due to violent assaults \n* 37% have considered leaving their job due to the threat of violence \n* Almost half (48%) said the support offered by their employer was ‘inadequate’ \nReports of violent assaults against health workers to the Health and Safety Executive (HSE) increased by 20% between 2012/13 and 2016/17, the investigation found. To be reported to the HSE, an attack must result in seven days or more off work, or a “specified” injury which can include fractures, amputation, loss of sight, brain damage, loss of consciousness and asphyxiation. \nGMB is backing proposed new legislation that would introduce a new offence of common assault against an emergency worker and require courts to treat attacks on emergency workers as an aggravating factor for sentencing purpose. \nThe Assaults on Emergency Workers (Offences) Bill 2017-19 is due to be debated on Friday. Read More Japanese firms like Nissan 'won't invest in the North East due to Brexit uncertainty' \nHowever, sexual assaults are not currently covered by the Bill. GMB’s investigation revealed that reported sexual assaults and other sexually abusive incidents nationwide increased by 211% between 2012/13 and 2016/17. \nKevin Brandstatter, GMB NHS National Officer, said: “No one should be told that facing violence is just ‘part of the job’. The number of attacks faced by ambulance workers as they try to save lives is beyond unacceptable. \n“Our members do their jobs with complete professionalism - but everyone has their breaking point. \n“As lone working becomes more common and cuts to services bite, ambulance workers are increasingly vulnerable to violence in the line of duty. Read More Foodbank charity reveals devastating impact of Universal Credit on people's lives \n“Changing the law will be an important first step as current sentences aren’t providing an adequate deterrent. \n“MPs must back emergency workers by backing this crucial legislation on Friday and widening its scope to include sexual assaults. \n“The best laws will only be effective if they are enforced. Ambulance workers are there we when the public need them – and now they need us all to stand up for them.” Like us on Facebook", "external_links": [], "published": "2018-04-25T07:00:00.000+03:00", "crawled": "2018-04-25T08:40:41.000+03:00", "highlightTitle": ""}