{"organizations": [], "uuid": "2d4afeb294dcd8765cabff4e4dbff6f8cfe9b250", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article1307935.ece/ALTERNATES/s1200/asda.jpg", "site_section": "", "section_title": "", "url": "https://www.leicestermercury.co.uk/news/business/how-would-merger-sainsburys-asda-1515854", "country": "GB", "domain_rank": 48128, "title": "How would merger of Sainsbury's and Asda affect Leicestershire shoppers? - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-04-30T03:00:00.000+03:00", "replies_count": 0, "uuid": "2d4afeb294dcd8765cabff4e4dbff6f8cfe9b250"}, "author": "Tom Pegden", "url": "https://www.leicestermercury.co.uk/news/business/how-would-merger-sainsburys-asda-1515854", "ord_in_thread": 0, "title": "How would merger of Sainsbury's and Asda affect Leicestershire shoppers? - Leicester Mercury", "locations": [], "entities": {"persons": [], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "asda", "sentiment": "neutral"}, {"name": "leicestershire", "sentiment": "neutral"}, {"name": "sainsbury", "sentiment": "neutral"}, {"name": "walmart", "sentiment": "none"}, {"name": "invalid email sainsbury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "How would merger of Sainsbury's and Asda affect Leicestershire shoppers? Supermarkets pledge to invest savings from cost efficiencies into lower prices if £12bn deal goes ahead Share Get Business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nSainsbury's management have said food prices would drop if a planned merger with Asda gets the go-ahead.\nThe two retailers say they have agreed the terms of a merger - all it needs now is approval from competition regulators if they decide it doesn't give the larger group an unfair advantage.\nUnder the £12 billion deal the supermarkets have pledged to invest any savings from cost efficiencies into lower prices.\nThe merger coupld be completed by the second half of next year, bringing together 2,800 Asda , Sainsbury's and Argos stores as well as some of the UK's most visited online shops, with a combined 47 million transactions every week.\nSainsbury's expects to save £500 million from merging with Asda - currently owned by US supermarket giant Walmart - and has said it will lower shop prices by 10 per cent on everyday products.\nBoth chains, along with big name rivals Morrisons and Tesco, have had to adapt in recent years to growing competition from the likes of Lidl and Aldi.\nThe Competition and Markets Authority (CMA) will soon start its investigation of the proposed merger, raising the prospect that Sainsbury's and Asda will be forced to sell off stores that would give the new business too much of a monopoly in any one area.\nSainsbury's insisted on Monday that it would not expect to shut any stores. The supermarket says its store footprint is more focused on the south, and Asda has more stores in the north.\nHowever some experts said it was not as straight forward as that.\nSainsburys has big stores in many of the city and county's busiest areas including Loughborough, Melton, Thurmaston and Fosse Park as well as an anchor store in the new Hinckley town centre shopping precint.\nIt also has a number of smaller convenience style stories up and down the county.\nAsda has big stores in Fosse Park, Oadby and Belgrave as well as Hinckley, Thurmaston, Shepshed and Coalville.\nAsda also has its George clothing operation based in the county near Lutterworth.\nOne local supplier said he believed the two brands would stay separate following any deal.\nPriyesh Patel is managing director of £30 million turnover Cofresh, based just off Leicester's Abbey Lane, which supplies Indian snacks such as Bombay mix to all of the big four supermarkets as well as wholesalers and independents across the UK.\nHe said: \"With Asda and Sainsbury's it's difficult to know who would be taking over who.\n\"They are very different businesses and their customers and pricing structures are very different.\n\"If it did go through I think they would stay quite independent, with different ranges and serving different types of customer.\" Priyesh Patel runs Indian snack maker Cofresh\nSome industry analysts say it would be unlikely that any deal would be signed off by the CMA without a sell-off of stores that are too close to others within the enlarged business.\nThe Fosse Park stores, for instance, are a couple of hundred yards from one another.\nCharles Hall, head of research at stockbroker Peel Hunt said: “While the Sainsbury’s/Asda merger might look good on paper, we see no chance of it getting through the CMA without a major dismemberment of the combined business.\n\"This will only be possible if there is an acquirer for a significant proportion of the business and Morrisons is the only acquirer that makes sense.\n\"This would take the big four down to three, which looks highly unlikely to get through the CMA.\n\"Clearly synergy savings would be substantial if the deal was to complete, which would come through sourcing benefits as well as the reduction in central staff, IT and distribution.\n\"This would clearly be of concern for the suppliers, but there would be winners and losers.”\nSainsbury's bought Argos in 2016 and already has more than 200 Argos outlets within its supermarkets.\nIt is expected that Argos would start appearing in Asda's stores, with Sainsbury's chief executive Mike Coupe saying this morning that the deal \"brings scale in clothing and general merchandise\".\nIn recent years retailers have had to take action to stay competitive in the face of cut price rivals such as Aldi and Lidl and after import costs went up after sterling dropped in value following the Brexit vote.\nAmazon is also eyeing up the UK food market with its fresh delivery service. Read More ", "external_links": [], "published": "2018-04-30T03:00:00.000+03:00", "crawled": "2018-04-30T21:04:07.001+03:00", "highlightTitle": ""}