{"organizations": [], "uuid": "181b49a268f514f24c07108978707c5df7b087b2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14589369.ece/ALTERNATES/s1200/JS150180934.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14593422", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Sainsbury's and Asda unveil £12bn merger details", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-04-30T10:30:00.000+03:00", "replies_count": 0, "uuid": "181b49a268f514f24c07108978707c5df7b087b2"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14593422", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Sainsbury's and Asda unveil £12bn merger details", "locations": [], "entities": {"persons": [{"name": "wallington hal", "sentiment": "none"}, {"name": "shakila ahmed", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}], "locations": [{"name": "great britain", "sentiment": "none"}, {"name": "cornwall", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "asda", "sentiment": "negative"}, {"name": "sainsbury", "sentiment": "negative"}, {"name": "coreena ford uk", "sentiment": "negative"}, {"name": "coreena ford industry", "sentiment": "none"}, {"name": "travelodge", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford UK is a staycation nation, study reveals\nMore people plan to have a summer holiday in the UK this year rather than travel overseas, a new study finds.\nResearch by hotel chain Travelodge showed that almost three out of five people will have their annual summer break in this country, up by 2% on last year. A survey of 3,000 adults revealed that one in four are taking more short breaks, averaging three this year.\nShakila Ahmed of Travelodge said the UK has become a “staycation nation”, adding: “More Britons than ever are exploring what makes Great Britain so great.\n“We are seeing more Britons booking three-in-one holidays. This includes taking a city, rural and coastal break as part of a one-week holiday.”\nCornwall and Devon remain the top two destinations for UK holidays this year, said the report. UK is a staycation nation and would rather holiday at home, visiting places like Wallington Hal, than holiday abroad, the survey found. (Image: ncjMedia) 9.10 Coreena Ford Industry calls for summit with government to reform apprenticeship levy\nA leading business group is calling for an urgent summit with the Government to discuss “fundamental reforms” of its controversial apprenticeship levy.\nThe EEF said most manufacturers wanted changes to the levy, while one in 10 had actually cancelled or delayed an engineering apprenticeship specifically because of the levy.\nThe number of people starting apprenticeships has dropped by nearly a quarter since the flagship scheme was launched a year ago.\nThe aim was to create three million apprentices by 2020, but business groups complain that the system is too complex and there are growing calls for the levy to be reformed.\nVerity Davidge of the EEF said: “Everyone shares the ambition of creating high quality apprenticeships which are essential if industry is going to access the skills it will need in the future, especially in a post-Brexit world where fewer skilled workers will come to the UK.\n“But, whilst the apprentice levy had laudable aims its impact has been highly damaging for employers and apprentices, and what should have been a win-win situation has turned into a lose-lose.\n“We have to address the alarming drop in starts initially and then look at positive solutions which are on the table to make the levy work for employers and learners in the long term.\n“Government must now sit down with business and find a way to rescue the levy so that it meets the original pledges made to companies when it was introduced.” A leading business group is calling for an urgent summit with the Government to discuss \"fundamental reforms\" of its controversial apprenticeship levy. 9.05 Coreena Ford Were you at the North East Business Awards? The winners speak of their joy\nNorthumberland engineering and construction company Merit saw off tough competition to be named North East Company of the Year for 2018 last Thursday night.\nThe Cramlington firm – which earned its place in the grand final of the North East Business Awards after triumphing as Tyneside and Northumberland Company of the Year in February – saw off Boldon-based financial advisory group Fairstone and Teesside vegetarian food producer Quorn to win the title.\nThe company’s victory marked the culmination of the annual celebration of the best of North East business, with almost 600 people gathered at Hardwick Hall in Sedgefield, County Durham.\nThe awards heard from guest speaker Greg Clark, Secretary of State for Business, Energy and Industrial Strategy, and from Lucy Winskell, chair of associate sponsors the North East England Chamber of Commerce.\nAfter entertainment from the Voices of Hope choir, hosts Alfie Joey and Ingrid Hagemann presented 13 awards to companies, the majority of whom had been named winners at the Tyneside and Northumberland, Durham, Sunderland & South Tyneside and Teesside regional heats. All the winners on stage (Image: Newcastle Journal) 8.57 Coreena Ford Meet the Newcastle gaming gurus behind Nickelodeon's Infinity Island games\nA gaming company based in Newcastle is working on a large commission for the children’s network Nickelodeon UK.\nPeg Digital, based at Hoults Yard in the city’s east end, has been working with the TV network for three years and is now working on phase two of Infinity Islands, a virtual gaming world which brings together popular Nickelodeon characters from its hit shows in a theme-park setting.\nThe firm, set up by Adam Quickfall and Doug Charnley, who met while working for a web design company in Newcastle, are specialists in designing browser based online games that work on any device. In addition to Nickelodeon, Peg also work with a range of other clients in the kids’ entertainment space.\nThe project Infinity Island is the largest single suite of web browser mini games on Nickelodeon’s website and boasts a big variety of gameplay.\nPeg Digital and Nickelodeon UK worked together to come up with the suite, which became an instant hit when it first launched last July. The first four mini games – set on four islands of Jungle, Volcano, Beach and Ice – were swiftly followed up with further packs of games released in August and September last year.\nNickelodeon has commissioned four more games, one of which features new Nickelodeon brand, I Am Frankie, to promote the new show.\nPeg Digital is now working on its latest commission from Nickelodeon, which will launch this summer and feature a new island, Alien Asteroid, bringing the total number of islands to five complete with 20 games.\nThe new launch will also bring a new look, gift shops and swag that players can unlock, as well as new brands and characters to play with.\nMr Charnley said: “Infinity Islands represents a huge vote of confidence in us from Nickelodeon, who could have their pick digital agencies in the UK. This is one of their largest online game commissions to date, so it means a lot to us that we were chosen for this.” Peg Digital, from left, Tom Harrison, Doug Charnley, Ben Dixon and Adam Quickfall (Image: Peg Digital) 8.50 KEY EVENT New North East Company of the Year calls for better Government support for SMEs\nThe new North East Company of the Year has called for the Government’s procurement policy to be skewed towards small businesses in the wake of Carillion’s collapse.\nEngineering and construction company Merit, which is based in Cramlington, Northumberland, saw off tough competition from larger firms Quorn Foods and Fairstone to triumph as Company of the Year at the North East Business Awards grand final last week.\nMerit, which was one of the finalists for the same award 10 years ago, has seen big jumps in sales over the last three years and is now regularly beating big corporations to high-profile contracts, including work for London’s Royal Albert Hall, Harrods, GSK, the British Antarctic Survey and for Rolls-Royce.\nThe firm, which has 120 employees and uses 80 agency workers, has a specialist fabrication centre based near its Cramlington HQ and its own in-house team of designers, pipework fitters and electricians, who can carry out pre-fabrication work which gives them an edge over the competition.\nLast week, it won a contract from E.ON to develop a community energy centre as part of a regeneration project for Blackwall Reach in Tower Hamlets, London.\nManaging director Tony Wells said he was delighted with Merit’s big award win and described it as a significant success for SMEs.\nHe said: “Having seen the other finalists, I thought we had done very well to get here in the first place, so I’m a bit shocked to be honest.\n“Over the years we have done some very iconic projects and right now we are working at the Royal Albert Hall and we beat a big company to the Cell and Gene Therapy Catapult centre in Stevenage. We’ve beaten a few multibillion-dollar corporations, so I guess we’re doing something right.\n“We have our own fabrication shop and you don’t get many of those around in this area – we don’t believe in outsourcing abroad, we want to make things here in Newcastle.\n“Carillion has been a good thing for us. The amount of money they owe to people certainly isn’t good but within the construction industry there’s something of a change coming and it seems people recognise a change needs to happen.” Tony Wells MD of Company of the Year Merit (Image: Newcastle Journal) 8.44 Coreena Ford Stock market flotation still on agenda for Made\nBosses at Made remain open-minded about the prospect of a stock market listing after the furniture retailer secured double-digital revenue growth last year. The online firm’s revenues soared by 40% to £127m in 2017, on the back of a similar level of growth the year before.\nThe brand also reached a significant milestone when it secured its first institutional investor as part of a £40m funding round, although the company has refused to name its newest backer.\nMade also secured backing from Partech Ventures, Level Equity and Eight Roads Ventures, which have invested in the business in previous funding rounds. Chief executive Philippe Chainieux, who took over from Made’s founder Ning Li after serving as chief operating officer, said an initial public offering (IPO) remains an option open to the business.\n“We’ve been on the IPO track for years. It’s a modality, not a strategy.\n“We are happy with the route we are on, it’s (the IPO) one of the many options we have,” the chief executive said. Made still want to float on the LSE (Image: PA) 8.35 KEY EVENT Supermarket sweep - the big retail deals\nShares in Sainsbury’s rocketed 20% to 325p at the market open following the deal announcement - and shares in Tesco fell 4% and Morrisons stock was down 3%.\nThe last few years have seen a few notable M&As in the sector:\n2018 - Tesco completes £3.7 billion takeover of Booker, resulting in the combination of Britain’s biggest retailer and wholesaler - Co-operative Group acquires wholesaler Nisa for £137.5 million\n2017 - Amazon acquires upmarket supermarket chain Whole Foods in an all-cash deal worth $13.7bn (£10.7bn), in the internet giant’s biggest foray into the grocery sector\n2016 - Sainsbury’s acquires Argos owner Home Retail Group in a deal worth £1.4bn- Home Retail sells off its DIY chain Homebase to Australian conglomerate Wesfarmers for £340m\n- South African retailer Steinhoff International acquires Poundland for £610m\n- JD Sports snaps up retailer Go Outdoors for £112.3m from its private equity owner in November\n2014 - Dixons and Carphone join forces in a£5bn mega-merger to become Dixons Carphone 2004 - Supermarket Morrisons acquires Safeway for £3bn\n1999 - Sir Philip Green, whose empire includes Topshop, Burton and Dorothy Perkins, buys BHS for £200m. He later sells the department store chain in 2015 for £1 before its collapse Dave Lewis, CEO of Tesco (right) and Charles Wilson, CEO of Booker, when they signed the takeover deal last year. Mr Wilson now leads Tesco’s UK business. (Image: Stephen Lock/Tulchan Communications/PA Wire) 8.30 KEY EVENT Sainsbury's and Asda unveil details of £12bn merger\nSainsbury’s has confirmed it has agreed terms for a £12bn merger with Walmart-owned Asda, setting the stage for one of the most audacious deals in British retail history.\nThe duo - the UK’s number two and three supermarkets - said that the unified group would have combined revenues of £51bn and boast a network of 2,800 Sainsbury’s, Asda and Argos stores.\nIt will aim to generate £500m in cost savings but Sainsbury’s insisted there are no planned store closures as part of the merger, with both brands to operate side by side.\nThe combined supermarket expects to lower prices by around 10% on products customers buy regularly.\nIt will see Asda owner Walmart hold 42% of the new business and receive £2.97bn in cash, valuing Asda at £7.3bn. Sainsbury’s is valued at around £5.9 billion.\nSainsbury’s chairman David Tyler said: “We believe that the combination of Sainsbury’s and Asda will create substantial value for our shareholders and will be excellent news for our customers and our colleagues.\n“As one of the largest employers in the country, the combined business will become an even greater contributor to the British economy.”\nIf it goes ahead, the combination will create a high street titan with a bigger share of the market than Tesco.\nLatest figures show that Tesco has a 27.6% market share, while Sainsbury’s has 15.8% and Asda has 15.6%.\nTogether, they would move ahead of Tesco, with 31.4% of the market.\nHowever, the merger would have to be approved by the Competition and Markets Authority (CMA). Sainsbury's store in Heaton", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/14593422;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-04-30T10:30:00.000+03:00", "crawled": "2018-04-30T11:23:07.023+03:00", "highlightTitle": ""}