{
 "Boris Johnson’s Brexit battle bus bowled into Chester-le-Street on Monday – with an added spin. ": [
  -1,
  "’s Brexit bus",
  [],
  [],
  [
   "bowled",
   "added"
  ]
 ],
 "The one time Scunthorpe United centre half ‘Beefy’ Botham came out to bat for Brexit last month, slamming the European Union as “corrupt” and a “racket” in a Sunday Times article. ": [
  -1,
  "Beefy ’",
  [
   "last"
  ],
  [],
  [
   "came",
   "slamming"
  ]
 ],
 "Mr Johnson asked the cricketer, who he called “one of the country’s great sporting heroes”, where he thought the Leave campaign stood, just weeks away from the vote. ": [
  0,
  "Mr Johnson",
  [],
  [],
  [
   "asked"
  ]
 ],
 "He said: “I’d say we’re some wickets down, but we can win the match, we’ve got the right players and we’ve got enough votes in hand.” ": [
  -1,
  "He",
  [],
  [],
  [
   "said"
  ]
 ],
 "Before stepping in to bowl and bat for a few overs with the pro-Brexit Durham students, Mr Johnson told the assembled crowd that Brexit would save the UK £350m a week. ": [
  0,
  "Mr Johnson",
  [
   "few",
   "pro",
   "-"
  ],
  [],
  [
   "stepping",
   "told",
   "assembled"
  ]
 ],
 "He added leaving the EU was important for British democracy. ": [
  -1,
  "He",
  [
   "British",
   "important"
  ],
  [],
  [
   "was",
   "leaving",
   "added"
  ]
 ],
 "Boris Johnson meets up with fellow vote leaver Ian Botham at Chester-le-Street Cricket Club ": [
  0,
  "Boris Johnson",
  [
   "fellow"
  ],
  [],
  [
   "meets"
  ]
 ],
 "But the Tory politician refused to answer questions about the state of his own party, as the referendum campaign causes increasingly bitter divides among Conservatives. ": [
  -1,
  "Tory politician",
  [
   "own"
  ],
  [],
  [
   "refused",
   "answer"
  ]
 ],
 "He insisted that what the public wanted was for him to speak about the advantages he see for the UK outside of the EU. ": [
  -1,
  "He",
  [],
  [],
  [
   "insisted"
  ]
 ],
 "He said: “My job in the next 23 days, whatever we have got left, is to get over our key messages. ": [
  -1,
  "He",
  [],
  [],
  [
   "said"
  ]
 ],
 "“This is the only chance in our lifetimes to go for a new approach, a democratic approach, but still leading in Europe.” ": [
  -1,
  "This",
  [
   "only",
   "new",
   "democratic"
  ],
  [
   "still"
  ],
  [
   "leading",
   "go",
   "is"
  ]
 ],
 "Asked about the outlook for the North East outside the EU, Mr Johnson said In campaigners were wrong to suggest that manufacturing jobs, such as those at the Nissan plant in Sunderland , would be at risk. ": [
  0,
  "Mr Johnson",
  [],
  [],
  [
   "Asked",
   "said"
  ]
 ],
 "He said: “If you look at what Carlos Ghosn [chairman and CEO of Nissan] himself has said, they’ve very much changed their line since 15 years ago when the discussion was held about the Euro and I think Nissan now see massive strengths in this area, a great skills base, fantastic people, no reason not to continue to invest in this part of the world, that’s what they’re saying and plenty of other international investors are saying the same thing.” ": [
  -1,
  "He",
  [],
  [],
  [
   "said"
  ]
 ],
 "And he also denied concerns raised by Skills Minister Nick Boles MP on a recent visit to Newcastle that the North East would lose thousands of tech jobs outside the EU. ": [
  0,
  "he",
  [
   "recent"
  ],
  [
   "also"
  ],
  [
   "denied",
   "raised"
  ]
 ],
 "He said: “Digital is one of those areas where the EU’s attempts at legislation regulation have been absolutely catastrophic and the UK’s success in that area, in tech, is nothing to do with our membership of the EU.” ": [
  -1,
  "He",
  [],
  [],
  [
   "do",
   "is",
   "said"
  ]
 ],
 "The gathered students enjoyed their brief cricket match with the politician, and did not pass up the opportunity to take selfies and quiz him on campaigning tactics. ": [
  -1,
  "students",
  [
   "brief"
  ],
  [
   "not"
  ],
  [
   "gathered",
   "campaigning",
   "take",
   "quiz",
   "did",
   "enjoyed",
   "pass"
  ]
 ],
 "Economics student Sam Taylor, 21, said he would be voting to leave because he felt over-regulation had made Britain less competitive than it should be on the world stage. ": [
  -1,
  "Sam Taylor",
  [],
  [],
  [
   "said"
  ]
 ],
 "Asked whether it was easy to persuade students and young people to vote for an independent Britain, he said: “Everyone I’ve spoken to has been less informed, and I’ve had reasonable success in convincing them. ": [
  0,
  "he",
  [],
  [],
  [
   "said"
  ]
 ],
 "“I think they’re there to be persuaded.": [
  -1,
  "I",
  [],
  [
   "there"
  ],
  [
   "persuaded",
   "’re",
   "be",
   "think"
  ]
 ],
 "Copy link to paste in your message / Comments (1) ": [
  -1,
  "Copy",
  [],
  [],
  [
   "Copy",
   "paste",
   "link"
  ]
 ],
 "The Times has reported an argument between the pair happened at breakfast on Wednesday. ": [
  -1,
  "Times",
  [],
  [],
  [
   "happened",
   "has",
   "reported"
  ]
 ],
 "The newspaper said shocked Tory and SNP MPs witnessed the incident in which Mr Shelbrooke, MP for Elmet and Rothell in Yorkshire, was shouting 'like a Harpy' while Mr Bridgen mocked the size of his rival's large cooked breakfast. ": [
  -1,
  "newspaper",
  [],
  [],
  [
   "said"
  ]
 ],
 "Read more: Brexit would not cost Melton Mowbray Pork Pies protected status says pro-EU expert ": [
  -1,
  "status",
  [
   "EU",
   "pro",
   "-"
  ],
  [],
  [
   "says",
   "protected"
  ]
 ],
 "The paper reports Mr Bridgen was eating a boiled egg when Mr Shelbrooke, dining nearby remarked that Leave campaigners had 'had it all their own way until now' but were now getting it from the Prime Minister and just don't like it. ": [
  -1,
  "paper",
  [],
  [],
  [
   "reports"
  ]
 ],
 "Mr Bridgen is reported to have told Mr Shelbrooke: \"When I saw your breakfast I thought you had invited your entire office\" adding \"Watch your fingers when you are eating the sausage sandwich because they are going to fall out.\" ": [
  -1,
  "I",
  [],
  [],
  [
   "told",
   "is",
   "thought",
   "reported",
   "have"
  ]
 ],
 "Mr Bridgen told the Mercury: \"It was very unpleasant. ": [
  0,
  "Mr Bridgen",
  [],
  [],
  [
   "told"
  ]
 ],
 "\"I am big enough and ugly enough to deal with it but there were lady members present who were very upset. ": [
  -1,
  "I",
  [
   "ugly",
   "big"
  ],
  [
   "enough",
   "there"
  ],
  [
   "am",
   "deal",
   "were"
  ]
 ],
 "\"It just shows that there are real tension in our party over that this issue. ": [
  -1,
  "It",
  [
   "real"
  ],
  [
   "there",
   "just"
  ],
  [
   "shows",
   "are"
  ]
 ],
 "\"It is the most important vote any of us will make.\" ": [
  -1,
  "It",
  [],
  [],
  [
   "is"
  ]
 ],
 "The Mercury attempted to contact Mr Shelbrooke but his office did not respond.": [
  -1,
  "Mercury",
  [],
  [],
  [
   "contact",
   "attempted"
  ]
 ],
 "Copy link to paste in your message / Comments (0) ": [
  -1,
  "Copy",
  [],
  [],
  [
   "Copy",
   "paste",
   "link"
  ]
 ],
 "The protected status of Melton Mowbray pork pies would not necessarily be lost if the UK quit the European Union, an expert has said. ": [
  -1,
  "expert",
  [],
  [],
  [
   "has",
   "said"
  ]
 ],
 "Prime minister David Cameron has written to various local newspapers arguing the special recognition of unique foods in Bitaun would be at risk if the country votes to leave the EU in next month's referendum. ": [
  0,
  "David Cameron",
  [
   "local",
   "special",
   "various",
   "unique"
  ],
  [],
  [
   "has",
   "written",
   "arguing"
  ]
 ],
 "The European Union granted the Melton Mowbray Pork Pie protected status in 2008 which meant only pies made in the area could carry the label. ": [
  -1,
  "European Union",
  [],
  [],
  [
   "protected",
   "granted"
  ]
 ],
 "Last month, in a letter to the Gloucester Echo, the Prime Minister wrote: \"If we leave the EU and our farmers have to operate under World Trade Organisation rules, things would be very different. ": [
  0,
  "Prime Minister",
  [
   "Last"
  ],
  [],
  [
   "wrote"
  ]
 ],
 "However chairman of the Melton Mowbray Pork Pie Association Matthew O'Callaghan, who is also chairman of the UK Protected Food Names Association, said the protected status could be maintained which ever way the vote goes. ": [
  -1,
  "chairman",
  [],
  [
   "However"
  ],
  [
   "said"
  ]
 ],
 "He said: \"If there was a Brexit the protected status will remain.\"There are many foods from countries that are not in the EU that have protected status - Colombian coffee for example. ": [
  -1,
  "He",
  [],
  [],
  [
   "said"
  ]
 ],
 "\"But if we did leave, EU regulations would cease to apply and it would mean our Government would have to bring in new legislation.\"Given that they have been promoting it heavily I don't think it would be a problem.\" ": [
  -1,
  "EU regulations",
  [],
  [],
  [
   "would",
   "cease",
   "apply"
  ]
 ],
 "Mr O'Callaghan, a former Labour parliamentary candidate and supporter of EU, added: \"It is an argument that has been made against Brexit but there could still be protected status.\" ": [
  0,
  "Mr O'Callaghan",
  [
   "parliamentary",
   "former"
  ],
  [],
  [
   "added"
  ]
 ],
 "Mr O'Callaghan said since the EU referendum debate began there had been considerable interest in the subject of protected food statuses. ": [
  0,
  "Mr O'Callaghan",
  [
   "considerable"
  ],
  [
   "there"
  ],
  [
   "been",
   "had",
   "protected",
   "said"
  ]
 ],
 "He said: \"We have had Irish television here asking about it and Russian television too.\"All are asking what it means should we leave the EU.\"Things would change but the protected status could be kept.\"": [
  -1,
  "He",
  [],
  [],
  [
   "said"
  ]
 ],
 "The EU Referendum on June 23 is a serious business. Goodness, it’s serious. So we asked the comedians appearing at Jesterval, the North East Comedy Festival (taking place June 3-12), how they would lighten it up. Scott Gibson wrote an essay and Brendon Burns’s first attempt, rendered for family consumption, whittled down to just a few words including ‘I’d’, ‘get’, ‘my’, ‘out’ and ‘wahey’. But a politically aware 17 responded – and here’s how. Catherine Scott ": [
  -1,
  "EU Referendum",
  [
   "serious"
  ],
  [],
  [
   "is"
  ]
 ],
 "To me the whole thing is a bit of a joke anyway, dreamed up by Tories trying to win back their Ukip defectors. I find clowns, balloons and silly string works to brighten up any event. ": [
  -1,
  "thing",
  [
   "whole"
  ],
  [
   "anyway"
  ],
  [
   "dreamed",
   "win",
   "is",
   "trying"
  ]
 ],
 "Unless you’re afraid of those things... then you probably shouldn’t leave your house on voting day :) xx Gary Delaney ": [
  -1,
  "you",
  [],
  [
   "then",
   "n’t",
   "probably"
  ],
  [
   "voting",
   "leave"
  ]
 ],
 "Any time in a debate anyone says the words ‘EU’ they have to say it like a Glaswegian starting a fight... Jarred Christmas FOCALPOINT OPTICS Jarred Christmas ": [
  -1,
  "anyone",
  [],
  [],
  [
   "Jarred",
   "says",
   "OPTICS"
  ]
 ],
 "I’ve devised a Ukip version of Cluedo. That’s where it doesn’t matter who did it, you just blame the immigrant. Yeah, it was Meitjeck the Polish builder in that conservatory he’s building. With a hammer and a truck-load of overtime. Jonathan Pelham ": [
  -1,
  "I",
  [],
  [],
  [
   "devised",
   "’ve"
  ]
 ],
 "I would make a rule that every time anyone from either camp predicted that if we didn’t do what they thought we should there would be totally disastrous effects to our economy/security/way of life, they had to put £1 in a jar. Whichever way we vote at the end, the money in the pot gets spent on an obscene amount of chocolate. That way we know whatever happens there will be a lot of chocolate come the 24th. Kate Fox Kate Fox ": [
  -1,
  "they",
  [],
  [],
  [
   "put",
   "had"
  ]
 ],
 "I’d have Eurovision representatives from each country singing a song to remind Britain why it should stay in Europe. Then a Eurovision-style voting slot to announce the referendum results with representatives from each county giving the votes whilst wearing sparkly suits. There could be referendum parties with themed European food and flags and Graham Norton commentating. Though once we were reminded how nobody votes for us anymore in Eurovision (and heard the terrible songs), I suspect the Brexiteers would get a massive boost. Kate Lucas ": [
  -1,
  "I",
  [],
  [],
  [
   "have"
  ]
 ],
 "I think David Cameron should add to the conditions of Britain’s ‘special status’ that we all agree Gina G was the true winner of the 1996 Eurovision Song Contest. Only when this happens can we trade and create policy effectively. It would also mean a lot to my seven-year-old self. Paul Foot ": [
  -1,
  "I",
  [],
  [],
  [
   "think"
  ]
 ],
 "Well, referendum is a fancy word for a yes/no vote. So perhaps instead you turn it into a ‘Would you rather?’ game of spin-the-bottle with conundrums such as: “Would you rather have an orange complexion or an orange man?”; “Would you rather lose the last cool thing about you or the first thing you tell yourself when you’re losing an argument?”; or “Would you rather turn a blind eye to Turkey being a bit ropey or that your Prime Minister may have loved a pig in the mouth once?” George Zach George Zach ": [
  -1,
  "referendum",
  [
   "fancy"
  ],
  [],
  [
   "is"
  ]
 ],
 "A lot of people are voting to exit for fear of immigrants entering the UK. I say we be careful what we wish for because if the borders close, does that mean we have to get our own immigrants back? I don’t think I’d be comfortable with all the criminals returning from the Costa Del Sol and all of the pondlife coming back from Benidorm. I honestly don’t think Sticky Vicky would fit in working at Sainsbury’s. Lauren Pattison ": [
  -1,
  "lot",
  [],
  [],
  [
   "exit",
   "entering",
   "are",
   "voting"
  ]
 ],
 "God, I’m s*** at these things. How could you lighten up the EU Referendum? I wouldn’t. It’s a very serious business. There is a time and a place for comedy and that time and place is Sunday, June 12 (5pm) at Jesterval. Also, I’d make them wear funny hats and trick them into necking on with seals. Matt Reed ": [
  -1,
  "God",
  [],
  [],
  [
   "s"
  ]
 ],
 "I’d fill the voting booths with helium so even if it doesn’t end well we all have had a laugh. Who doesn’t like the old helium ‘kids’ voice’ joke? Scott Gibson ": [
  -1,
  "’d",
  [],
  [
   "so"
  ],
  [
   "fill"
  ]
 ],
 "How could you lighten it up? For me that’s a pretty easy question. British people don’t want to be bored with in-depth knowledge, rational thought or important facts!!! NO!!! They want to know if Boris thinks the German Chancellor will stop your 13-year-old son working a 14-hour paper round before a shift down an old pit. They want simple made up nonsense, all rolled up and delivered in an easy-to-digest 90s classic TV show. So what we do on June 23 is no referendum, no votes, no news. We bring back Gladiators for an EU Special. 10 UK Gladiators vs 10 EU Gladiators. Think about it. The Wolf Man vs some Polish guy with an ear missing and questionable prison tattoos, or Jet on the hoops with her soft inner thigh pressed against the cheek of an ex-East German butterfly champion. A series of games to determine who stays and who goes. People at home vote for their favourite Gladiator and get a chance to win a number of British or EU-themed prizes like holidays to Blackpool or to Brussels. It also gives Ulrika one last pay day before she’s boxed up and shipped back to Sweden for a recalibration and the inevitability that she is melted down for spare parts. I wonder in another 10 years what we will miss more? The joy of homo-erotic Saturday night TV, where ex-bodybuilders and debt collectors with bums like pin cushions fought it out to slake an IT specialist and long distance runner from Peterborough into a crash mat, or the open trade policies and freedom of movement of the EU? I imagine it’ll still be Gladiators. But, hey, don’t worry. Scotland will have its independence by then so it’s all good. Si Buglass Si Buglass ": [
  -1,
  "you",
  [],
  [
   "How"
  ],
  [
   "lighten",
   "could"
  ]
 ],
 "I would lighten up the referendum by making everyone get hammered on Mad Dog 20/20 and listen to MC Stompin. ": [
  -1,
  "I",
  [
   "Mad"
  ],
  [],
  [
   "hammered",
   "making",
   "lighten",
   "would",
   "get",
   "listen"
  ]
 ],
 "Jesterval, the North East Comedy Festival, takes place for the fourth year running in a laughter-filled marquee at Baltic Square, Gateshead , from June 3 to 12. ": [
  -1,
  "Jesterval",
  [
   "fourth"
  ],
  [],
  [
   "running",
   "filled",
   "takes"
  ]
 ],
 "All these jokers will be appearing along with many more, household names mixing with newcomers tipped for the top. There is, promise the organisers, something for everyone – adults, children, families. ": [
  -1,
  "jokers",
  [
   "many",
   "more"
  ],
  [],
  [
   "will",
   "appearing",
   "be",
   "tipped",
   "mixing"
  ]
 ],
 "Treasury Minister Harriett Baldwin MP visited two of Newcastle’s best-known financial services firms as she cautioned that leaving the EU could damage the North East’s position as a hub for the sector. ": [
  -1,
  "Harriett Treasury Baldwin Minister MP",
  [
   "financial"
  ],
  [
   "best"
  ],
  [
   "visited",
   "known"
  ]
 ],
 "The financial sector adds around £2bn to the North East economy every year, supporting roughly 53,000 jobs in the region - 26,000 within financial services and 27,000 in associated industries. ": [
  -1,
  "sector",
  [
   "financial",
   "£"
  ],
  [
   "roughly"
  ],
  [
   "supporting",
   "adds",
   "associated"
  ]
 ],
 "At True Potential, staff numbers have increased 26% since January to more than 230. Turnover, meanwhile, rose from £44m in 2014 to £56.7m the following year. ": [
  -1,
  "numbers",
  [
   "True",
   "more"
  ],
  [],
  [
   "increased",
   "have"
  ]
 ],
 "The company has also appeared in the Deloitte Technology Fast 500 EMEA for three years running and the UK Technology Fast 50 for the past two years. ": [
  -1,
  "company",
  [
   "past"
  ],
  [
   "Fast",
   "also"
  ],
  [
   "running",
   "appeared",
   "has"
  ]
 ],
 "During her time there, Mrs Baldwin witnessed a demonstration of its impulseSave technology and its planning dashboard True Potential One, which gives savers a full overview of their investments. ": [
  1,
  "Mrs Baldwin",
  [],
  [
   "there"
  ],
  [
   "witnessed"
  ]
 ],
 "She also discussed the Lifetime ISA (Lisa), which from next April will mean savers will be able to receive a 25% Government bonus for saving up to £4,000 annually. ": [
  -1,
  "She",
  [],
  [
   "also"
  ],
  [
   "discussed"
  ]
 ],
 "She said: “I’m was very grateful to get the chance to see a growing financial services business and it’s fantastic to see so many graduates from North East universities creating financial services careers at this fast-growing company. ": [
  -1,
  "She",
  [],
  [],
  [
   "said"
  ]
 ],
 "“Two thirds of jobs in financial services are outside the M25 area. The sector benefits the whole of the UK and the UK is acknowledged as a world leader.” ": [
  -1,
  "thirds",
  [
   "financial"
  ],
  [],
  [
   "are"
  ]
 ],
 "True Potential managing partner David Harrison said: “FinTech is thriving in the UK with the Government’s support and we were pleased to show the Economic Secretary our impulseSave and True Potential One technology that is helping to simplify saving and investing. ": [
  -1,
  "partner",
  [
   "True",
   "Potential"
  ],
  [],
  [
   "said"
  ]
 ],
 "“The Lifetime ISA is an excellent example of a simple and effective way to save and our research shows that it is certain to be popular when it is available next year.” ": [
  -1,
  "Lifetime ISA",
  [
   "excellent",
   "effective",
   "simple"
  ],
  [],
  [
   "save",
   "is"
  ]
 ],
 "Treasury Minister Harriet Baldwin visits True Potential LLP at Newburn. Also pictured David Harrison of True Potential ": [
  -1,
  "Treasury Harriet Minister Baldwin",
  [
   "True",
   "Potential"
  ],
  [],
  [
   "visits"
  ]
 ],
 "At Virgin Money, then Mrs Baldwin, alongside the company’s CEO Jayne-Anne Gadhia, addressed employees on the benefits remaining in the EU would bring to the North East’s financial services sector. ": [
  1,
  "Mrs Baldwin",
  [],
  [
   "then"
  ],
  [
   "addressed"
  ]
 ],
 "New Treasury analysis has shown the North East’s economy would be tipped into recession, with unemployment rising by 20,000 if Britain voted to leave the EU. ": [
  -1,
  "New Treasury analysis",
  [],
  [],
  [
   "has",
   "shown"
  ]
 ],
 "The region has also benefited from £1.1bn of inward investment from EU members over the last five years, with 90 foreign investment projects creating or safeguarding almost 6,000 jobs. ": [
  -1,
  "region",
  [
   "foreign",
   "last",
   "£",
   "inward"
  ],
  [
   "also",
   "almost"
  ],
  [
   "has",
   "creating",
   "safeguarding",
   "benefited"
  ]
 ],
 "Ms Baldwin said: “Voters in Newcastle and across the country faces a fundamental choice – whether to remain a member of a reformed EU, or to take a leap into the dark. ": [
  0,
  "Ms Baldwin",
  [],
  [],
  [
   "said"
  ]
 ],
 "“A vote to stay in Europe will protect jobs in the North East, promote economic growth and ensure that the regional financial services sector continues to grow. ": [
  -1,
  "vote",
  [],
  [],
  [
   "will",
   "protect",
   "stay"
  ]
 ],
 "Ms Gadhia said: “Working with our European partners, Britain has helped create the biggest market in the world. ": [
  0,
  "Ms Gadhia",
  [],
  [],
  [
   "said"
  ]
 ],
 "“Membership of the EU gives us unrestricted access to 500m consumers and, with around 100,000 jobs in the North East linked to exports to the EU, remaining as a strong part of a reformed EU protects our jobs, our incomes and our future. ": [
  -1,
  "Membership",
  [
   "unrestricted"
  ],
  [],
  [
   "gives",
   "protects"
  ]
 ],
 "“The benefits of EU membership significantly outweigh the costs and I believe the path to a more certain and prosperous future for our families, business, innovation and investment is to vote Remain on June 23.” The European Union debate": [
  -1,
  "benefits",
  [],
  [
   "significantly"
  ],
  [
   "outweigh"
  ]
 ],
 "Outer space is already filling up with junk but I wouldn’t hesitate to put Boris Johnson and Donald Trump – they should get on splendidly – in a rocket to the furthermost galaxy. ": [
  -1,
  "space",
  [
   "Outer"
  ],
  [
   "already"
  ],
  [
   "is",
   "filling"
  ]
 ],
 "You could ignore flustered G7 leaders who warned that Britain leaving the European Union would be a threat to the global economy. ": [
  -1,
  "You",
  [],
  [],
  [
   "could",
   "ignore"
  ]
 ],
 "You cannot ignore the Institute for Fiscal Studies, Britain’s most respected economics think-tank with an impeccable reputation for impartiality. They made it crystal clear: Brexit could save about £8bn annually – less than half a per cent of national income – if Britain stopped contributing to the EU but the cost and disruption of leaving the EU would bring a significant economic slowdown. ": [
  -1,
  "You",
  [
   "respected",
   "impeccable"
  ],
  [
   "not",
   "most"
  ],
  [
   "ignore"
  ]
 ],
 "It took me a while to work out what it was that had bothered me at the excellent debate held at Barter Books recently. I looked back at the photos on my phone – no young people – only grey or balding heads listening to Anne-Marie Trevelyan, Conservative MP for the Berwick constituency, and Julie Pörksen, spokesperson for the Liberal Democrat party in Northumberland . ": [
  -1,
  "It",
  [],
  [],
  [
   "took"
  ]
 ],
 "Julie said the next generation will be more prosperous and safer if we stay in Europe. They may vote the way Cameron wants if he could offer them respite from student debt, low wages, dwindling public services and ludicrous rents. ": [
  -1,
  "Julie",
  [],
  [],
  [
   "said"
  ]
 ],
 "In the North East, the Office for National Statistics projects that, over the next eight years, there will be a 20% increase in people over 65 while the number of 16 to 64-year-olds falls. So who will “man” the tools, tills and tillers? ": [
  -1,
  "Office",
  [],
  [],
  [
   "projects"
  ]
 ],
 "Numerous studies show immigration to Britain has not increased unemployment or reduced wages. If the UK closed its doors to more than two-thirds of prospective immigrants, skill and labour shortages would cause economic seizure. We just don’t have enough UK graduates or apprentices in science, maths or engineering. Leaving the EU could undermine thousands of British businesses, not to mention an understaffed NHS reliant on foreign nurses and doctors. ": [
  -1,
  "studies",
  [
   "Numerous"
  ],
  [
   "not"
  ],
  [
   "has",
   "increased",
   "reduced",
   "show"
  ]
 ],
 "Predictably, an audience member at Barter Books said immigrants are responsible for bankrupting the NHS. Wrong. Most immigrants are young, healthy and work hard. The key development for public services has been deepening austerity; a growing population will put pressure on services if we don’t invest in them. In 2014, the NHS had a shortfall of 50,000 clinically trained staff, gaps migrants helped fill. One in five care workers is foreign-born. The NHS is in a pickle because of the huge amount it pays agency staff, and an ageing population suffering long-term health conditions. Britain spends a lower percentage of national wealth on health than France, Germany, Sweden or even Greece. ": [
  -1,
  "member",
  [],
  [
   "Predictably"
  ],
  [
   "said"
  ]
 ],
 "I am not uncritical of the EU: it promotes its own commercial interests while doing little to stimulate economic growth in the developing world; it has been slow and inflexible over Greece’s debt; it must urgently fathom how to help the refugees on our doorstep or populism and extremism will continue to gain ground. ": [
  -1,
  "it",
  [],
  [
   "urgently",
   "how"
  ],
  [
   "will",
   "continue",
   "must",
   "fathom",
   "gain",
   "help"
  ]
 ],
 "We have an imperfect EU beset by mounting troubles but Brexit is a recipe for silent decline and regional chaos. ": [
  -1,
  "We",
  [
   "imperfect"
  ],
  [],
  [
   "have",
   "mounting"
  ]
 ],
 "Too often, money in the hands of the Chancellor fails to find its way North. A recent report from Northumberland County Council states that the North East has been allocated £436m of European Structural and Investment Funds for the budget period 2014-2020. That’s the largest allocation outside London. EU money allocated to our region is ours to spend. ": [
  -1,
  "money",
  [],
  [
   "often",
   "Too"
  ],
  [
   "find",
   "fails"
  ]
 ],
 "Of course, the EU needs to change if it is to become more effective and more accountable. ": [
  -1,
  "EU",
  [],
  [
   "Of",
   "course"
  ],
  [
   "needs"
  ]
 ],
 "Brexiteers point to lumbering Brussels bureaucracy and bemoan the UK’s limited influence. Gordon Brown reminded us this week that Britain will hold the presidency of the European Council between July and December 2017, handing the UK responsibility for pushing through new EU diktats and brokering co-operation between member states. A better place surely from which to puff out our chest. ": [
  -1,
  "Brexiteers",
  [
   "limited"
  ],
  [],
  [
   "bemoan",
   "point",
   "lumbering"
  ]
 ],
 "Most EU members want less red tape. One point lost in the debate is that, just as Britain considers Brexit, the European Commission has already proposed fewer regulations. According to the London School of Economics, our costliest business regulations are home-grown, not EU inspired. By international standards, Britain is lightly regulated. ": [
  -1,
  "EU members",
  [
   "Most",
   "red"
  ],
  [
   "less"
  ],
  [
   "want"
  ]
 ],
 "EU social policy and positive regulation over the past 45 years have made this country, and our lives, infinitely fairer and safer, and every major climate change agreement has involved EU leadership. ": [
  -1,
  "policy",
  [
   "positive",
   "social",
   "past"
  ],
  [],
  [
   "made",
   "have"
  ]
 ],
 "A historian, Brendan Simms, boiled the whole argument down to three words, quite simply: “Europe made us.” ": [
  -1,
  "historian",
  [
   "whole"
  ],
  [
   "quite",
   "simply"
  ],
  [
   "boiled"
  ]
 ],
 "An integrated Europe is a legacy worth improving, not abandoning. ": [
  -1,
  "Europe",
  [
   "worth"
  ],
  [
   "not"
  ],
  [
   "improving",
   "is",
   "abandoning",
   "integrated"
  ]
 ],
 "The journalist Martin Wolf said this referendum is, arguably, the most irresponsible act by a British government. ": [
  -1,
  "journalist",
  [],
  [],
  [
   "said"
  ]
 ],
 "Whatever the result, I hope the EU forgives us.": [
  -1,
  "I",
  [],
  [],
  [
   "hope"
  ]
 ],
 "Leading faith figures have put their names to a letter urging voters to remain in Europe . ": [
  -1,
  "figures",
  [],
  [],
  [
   "put",
   "urging",
   "Leading",
   "have",
   "remain"
  ]
 ],
 "Signing in a personal capacity, 37 signatories from across all major faiths claimed Brexit would harm efforts to tackle climate change and the current migration crisis. ": [
  -1,
  "signatories",
  [
   "personal",
   "major"
  ],
  [],
  [
   "claimed",
   "Signing"
  ]
 ],
 "Two prominent religious leaders in the North East, Newcastle equality campaigner Hari Shukla and former Dean of Durham Michael Sadgove, were among those to put their signatures on the letter. ": [
  -1,
  "leaders",
  [
   "religious",
   "prominent",
   "former"
  ],
  [],
  [
   "put",
   "were"
  ]
 ],
 "Mr Shukla said: “I am very much aware of what is happening in Europe and in the world. There are special challenges we have to face and I believe these challenges can be met by working together as one community.” ": [
  0,
  "Mr Shukla",
  [],
  [],
  [
   "said"
  ]
 ],
 "The letter reads: “Faith is about integration and building bridges, not about isolation and erecting barriers. ": [
  -1,
  "letter",
  [],
  [],
  [
   "reads"
  ]
 ],
 "“As leaders and senior figures of faith communities, we urge our co-religionists and others to think about the implications of a leave vote for the things about which we are most passionate. ": [
  -1,
  "we",
  [
   "senior"
  ],
  [],
  [
   "urge"
  ]
 ],
 "“The past 70 years have been the longest period of peace in Europe’s history. Institutions that enable us to work together and understand both our differences and what we share in common contribute to our increased security and sense of collective endeavour. ": [
  -1,
  "years",
  [
   "longest",
   "past"
  ],
  [],
  [
   "been",
   "have"
  ]
 ],
 "“We hope that when voting on June 23, people will reflect on whether undermining the international institutions charged with delivering these goals could conceivably contribute to a fairer, cleaner and safer world.” ": [
  -1,
  "We",
  [],
  [],
  [
   "hope"
  ]
 ],
 "Other figures to have signed the letter include Rt Rev and Rt Hon Dr Rowan Williams, former Archbishop of Canterbury; Rabbi Laura Janner-Klausner, Principal Rabbi, Movement for Reform Judaism; Mona Siddiqui, professor of Islamic and Inter-Religious Studies and assistant principal of religion and society, University of Edinburgh; and Bharti Tailor, executive director, Hindu Forum in Europe. ": [
  -1,
  "figures",
  [
   "Other",
   "assistant",
   "executive",
   "Islamic",
   "former",
   "-"
  ],
  [],
  [
   "signed",
   "include",
   "have"
  ]
 ],
 "The letter comes as former Conservative Defence Secretary Liam Fox said it would only be possible to reduce immigration to tens of thousands if the UK votes to leave the EU. ": [
  -1,
  "letter",
  [],
  [],
  [
   "comes"
  ]
 ],
 "Dr Fox said immigration is a “huge issue for real people” who are facing the implications of it in their “real lives” and that he does not have a problem with migration, but “uncontrolled migration”. ": [
  -1,
  "Dr Fox",
  [],
  [],
  [
   "uncontrolled",
   "said"
  ]
 ],
 "The North Somerset MP said: “No Conservative MP who was elected at the last election can fulfil our pledge to the British people - including me - if we stay in the European Union. ": [
  -1,
  "North Somerset MP",
  [],
  [],
  [
   "said"
  ]
 ],
 "“I am quite sure that the Prime Minister wanted to be able to get restrictions on free movement to be able to meet that target but it wasn’t on offer. ": [
  -1,
  "I",
  [],
  [],
  [
   "am"
  ]
 ],
 "“There is no reformed EU, it is a fantasy.” ": [
  -1,
  "it",
  [
   "reformed"
  ],
  [
   "There"
  ],
  [
   "is"
  ]
 ],
 "On Monday, Boris Johnson will arrive in the region on the Vote Leave battle bus. Mr Johnson will meet students from Durham University and then travel to the Riverside at Chester-le-Street to meet up with ex-England cricketer Sir Ian Botham.": [
  0,
  "Boris Johnson",
  [],
  [],
  [
   "will",
   "arrive"
  ]
 ],
 "Copy link to paste in your message / ": [
  -1,
  "Copy",
  [],
  [],
  [
   "Copy",
   "paste",
   "link"
  ]
 ],
 "A Leicestershire Liberal Democrat has explained why he is campaigning for Britain to leave the European Union in contrast to most of his party colleagues. ": [
  -1,
  "Liberal Leicestershire Democrat",
  [],
  [],
  [
   "has",
   "explained"
  ]
 ],
 "County councillor Michael Wyatt is encouraging voters to back quitting the EU in next month's referendum. ": [
  0,
  "Michael Wyatt",
  [
   "next"
  ],
  [],
  [
   "back",
   "quitting",
   "encouraging",
   "is"
  ]
 ],
 "While his party leadership is firmly behind continued UK membership Coun Wyatt has been out on the stump with an unlikely ally - Euro-sceptic Tory North West Leicestershire MP Andrew Bridgen. ": [
  -1,
  "Coun Wyatt",
  [
   "sceptic",
   "unlikely"
  ],
  [],
  [
   "been",
   "continued",
   "has"
  ]
 ],
 "Coun Wyatt, who represents the Warren Hills division at County Hall, said he believed the EU was a 'bureaucratic mess'. ": [
  -1,
  "Coun Wyatt",
  [],
  [],
  [
   "said"
  ]
 ],
 "He said: \"There aren't that many of us in the party but I'm not the only one on the Lib Dem benches at County Hall who is for leaving. ": [
  -1,
  "He",
  [],
  [],
  [
   "said"
  ]
 ],
 "\"It hasn't been a problem. ": [
  -1,
  "It",
  [],
  [
   "n't"
  ],
  [
   "been",
   "has"
  ]
 ],
 "\"The view on this is really each to their own. ": [
  -1,
  "view",
  [
   "own"
  ],
  [
   "really"
  ],
  [
   "is"
  ]
 ],
 "\"I believe the purpose of the EU as been lost, and as steadily become a huge distraction, and a huge financial black hole. ": [
  -1,
  "I",
  [
   "financial",
   "huge",
   "black"
  ],
  [
   "steadily",
   "as"
  ],
  [
   "been",
   "believe",
   "become",
   "lost"
  ]
 ],
 "\"The EU is also becoming an overcrowded bureaucratic mess that we should no longer be apart. ": [
  -1,
  "EU",
  [],
  [
   "also"
  ],
  [
   "becoming",
   "is"
  ]
 ],
 "\"As a Liberal Democrat I support the open market but I cannot and will not support an ever increasing financial and social restrictive EU which ignores its citizens and becoming to large for it to be able to function the way its was meant.\" ": [
  -1,
  "I",
  [
   "open"
  ],
  [],
  [
   "support"
  ]
 ],
 "Coun Wyatt added: \"For many years now I have had grave misgivings about the future direction of the EU. ": [
  -1,
  "Coun Wyatt",
  [],
  [],
  [
   "added"
  ]
 ],
 "\"Turkey for one is pounding at the door expecting to join, which is a step we will all regret if its allowed to happen due to its less than democratic credentials, and its unstable relationship with various sections within its own borders. ": [
  -1,
  "Turkey",
  [],
  [],
  [
   "expecting",
   "join",
   "pounding",
   "is"
  ]
 ],
 "Senior Liberal Democrat Vince Cable will be attending a remain rally in Leicester on Thursday. ": [
  -1,
  "Vince Democrat Cable",
  [
   "Liberal",
   "Senior"
  ],
  [],
  [
   "will",
   "be",
   "attending"
  ]
 ],
 "The former secretary of state for business, skills and innovation will share a stage with Labour Leicester West MP Liz Kendall and Green MP for Brighton Pavilion Caroline Lucas. ": [
  -1,
  "secretary",
  [
   "former"
  ],
  [],
  [
   "share",
   "will"
  ]
 ],
 "The Leading not Leaving event will take place at St Martin's House in Peacock Lane from 1pm to 3pm.": [
  -1,
  "event",
  [],
  [
   "not"
  ],
  [
   "take",
   "will",
   "Leading",
   "Leaving"
  ]
 ],
 "Research by the Northumberland Labour group claims up to 1,200 jobs could go if Northumberland County Council lost up to £28m of EU funding. ": [
  -1,
  "Research",
  [],
  [],
  [
   "claims"
  ]
 ],
 "And the group fears more than £4m a year would be lost from the county’s economy if the jobs were cut. ": [
  -1,
  "group",
  [
   "more"
  ],
  [],
  [
   "be",
   "would",
   "cut",
   "fears",
   "were",
   "lost"
  ]
 ],
 "Councillor Grant Davey, leader of Northumberland County Council, said: “We are very concerned that a vote for Brexit would be devastating to the Northumberland economy. ": [
  -1,
  "Grant Councillor Davey",
  [],
  [],
  [
   "said"
  ]
 ],
 "“We are already dealing with more than 80% of cuts to council funding and we may have to deal with further extreme shocks to the economy through a Brexit vote. ": [
  -1,
  "We",
  [
   "more"
  ],
  [
   "already"
  ],
  [
   "dealing",
   "are"
  ]
 ],
 "“Nobody from the Brexit campaign has answered the simple question – what happens to real people, the real economy and real communities if they get their way and leave the EU?” ": [
  -1,
  "Nobody",
  [
   "simple"
  ],
  [],
  [
   "answered",
   "has"
  ]
 ],
 "She said: “All funds received by councils, including Northumberland County Council, is UK taxpayers’ money sent via the EU, some of which is given back to us with strict conditions. ": [
  -1,
  "She",
  [],
  [],
  [
   "said"
  ]
 ],
 "“If we vote to leave the EU, we can spend £350m per week on our own priorities, which will include ensuring councils are properly funded. ": [
  -1,
  "we",
  [],
  [],
  [
   "spend",
   "can"
  ]
 ],
 "“It will also enable us to spend more money on our NHS, public services, and be able to invest more in science and technology.” ": [
  -1,
  "It",
  [
   "able",
   "public",
   "more"
  ],
  [
   "also"
  ],
  [
   "invest",
   "will",
   "be",
   "spend",
   "enable"
  ]
 ],
 "The Labour group fears the farming industry would be the hardest hit if Britain left the EU, and workers could lose up to 50% of their income. ": [
  -1,
  "Labour group",
  [],
  [],
  [
   "fears"
  ]
 ],
 "Coun Davey said: “Brexit campaigners need to tell us if their plans will give a cast iron guarantee on upland farming incomes, business investment and job creation and public sector funding, which is reliant on EU funding. They are proposing a ‘leap into the dark’ which will have a real impact on families and individuals across Northumberland.” ": [
  -1,
  "Coun Davey",
  [],
  [],
  [
   "said"
  ]
 ],
 "But Mrs Trevelyan believes Britain’s farms would thrive outside of the EU. ": [
  1,
  "Mrs Trevelyan",
  [],
  [],
  [
   "believes"
  ]
 ],
 "She said: “The system does not work for our farmers. ": [
  -1,
  "She",
  [],
  [],
  [
   "said"
  ]
 ],
 "“We can create a better one designed with them in mind, and stop sending our money to French farmers at the expense of our own.”": [
  -1,
  "We",
  [
   "better",
   "own",
   "French"
  ],
  [],
  [
   "can",
   "designed",
   "create",
   "sending",
   "stop"
  ]
 ],
 "The choice is yours in the decision to move home, but might be determined by the whole nation should we ultimately decide to quit the EU.The impact of this vital, forthcoming referendum for the nation on June 23 will take the property market into uncharted waters should the Brexit camp get its way.Until the vote is decided, the property market remains in a jittery state, with people loath to put their home up for sale until the picture is clarified.Asking local agents to venture an opinion is a tricky business, as no one can really predict what a leave vote would do to a property market, which has recently been growing, although somewhat shakily in the current economic climate. ": [
  -1,
  "choice",
  [
   "whole"
  ],
  [
   "home"
  ],
  [
   "be",
   "might",
   "is",
   "determined",
   "move"
  ]
 ],
 "James Court, director at Leicester's Readings Property Group, bravely sets out his views, albeit with a warning rider.\"It is almost impossible at present to obtain a non-partisan opinion on the impact of staying in or leaving the EU, but one thing is absolutely certain: markets do not like uncertainty.\"We saw transaction levels drop significantly during 2015 before the General Election, with many owner-occupiers and investors delaying their decision-making.\"Post-election, things very quickly returned to normal, with an uplift in transaction levels due to that previously pent up demand.\"Mr Court believes this is a route we are retracing with the EU referendum.\"We are seeing a reluctance from people to place their properties on the market for fear of the impact of a Brexit decision,\" he says. \"Notwithstanding this uncertainty, the UK market is currently characterised by a general lack of supply of available housing in any case.\"Sentiment from the domestic market is such that people are keeping their powder dry to await the results on June 23.\"April saw a dramatic reduction in transaction levels, following on from bumper March, fuelled by investors wishing to beat the increase in second home stamp duty rises. \"One school of thought is that if we leave the EU, the pound will weaken,\" says Mr Court. \"This will put pressure on interest rates, which in turn will affect consumer confidence and high street spending.\"Imports will become cheaper, which will put further pressure on our manufacturing industries and could lead to job losses.\"Clearly this will adversely impact the housing market and forecasts have suggested that our economy could take as long as two to three years to restore balance. I have heard figures as high as an 18 per cent drop in average house prices mentioned in some quarters. \"If the country's decision is to stay in the EU, the owner-occupier market is likely to be business as usual and the lost ground of the late spring will be made up during June and July, months that typically herald a slowdown in activity levels.\"": [
  0,
  "he",
  [],
  [],
  [
   "says"
  ]
 ],
 "Comedian Eddie Izzard is dropping into The University of Leicester in a bid to get as many young people as possible to register for the EU referendum. ": [
  -1,
  "Eddie Comedian Izzard",
  [
   "many",
   "possible",
   "young"
  ],
  [
   "as"
  ],
  [
   "get",
   "register",
   "is",
   "dropping"
  ]
 ],
 "His visit on June 16 is part of a 31 city tour he is making to encourage people to vote to stay in the European Union. ": [
  -1,
  "visit",
  [],
  [],
  [
   "is"
  ]
 ],
 "He will be speaking about his views in the Peter Williams Lecture Theatre, Fielding Johnson South Wing, between 5pm and 6.15pm on the day. ": [
  -1,
  "He",
  [],
  [],
  [
   "will",
   "be",
   "speaking",
   "Fielding"
  ]
 ],
 "Speaking ahead of this, he said: \"We know the overwhelming majority of young people want to stay in Europe because of the opportunities it presents to work, to study and to travel. I share their positive view of Europe – I am a British European who has performed in German, French and Spanish. ": [
  0,
  "he",
  [],
  [
   "ahead"
  ],
  [
   "Speaking",
   "said"
  ]
 ],
 "\"But if they are not registered, they can't vote and those opportunities will be taken away without them getting to have their say. It only takes two minutes to register on a smartphone and it must be done by June 7.\" ": [
  -1,
  "they",
  [],
  [
   "away",
   "not",
   "n't"
  ],
  [
   "will",
   "registered",
   "be",
   "are",
   "vote",
   "taken"
  ]
 ],
 "However, those campaigning for the \"Brexit\" campaign to leave the EU believe it will enable the UK take back control and spend money on its priorities. ": [
  -1,
  "those",
  [],
  [
   "However"
  ],
  [
   "campaigning",
   "believe",
   "leave"
  ]
 ],
 "Education bosses at the University of Leicester have also highlighted how important it is for students to cast a vote - no matter what their political preference. ": [
  -1,
  "bosses",
  [],
  [
   "also"
  ],
  [
   "highlighted",
   "have"
  ]
 ],
 "The University of Leicester and its Students' Union have spearheaded campaigns to highlight the importance of students registering to vote, including registration in social areas of the Union, direct communications with students about the EU referendum vote, social media campaigns and letters being placed in every study bedroom in the university. ": [
  -1,
  "University",
  [
   "direct",
   "social"
  ],
  [],
  [
   "highlight",
   "placed",
   "vote",
   "registering",
   "including",
   "spearheaded",
   "being",
   "have"
  ]
 ],
 "Professor Paul Boyle, president and vice-chancellor of the University of Leicester, said: \"Students in Leicester, together with others up and down the country, could play a decisive role in the EU referendum on June 23. ": [
  -1,
  "Paul Professor Boyle",
  [],
  [],
  [
   "said"
  ]
 ],
 "\"The referendum is a once in a generation decision, so it's all the more vital that young people have their say. I wouldn't want any of our students to lose out on their chance to vote because they were not registered or registered to vote in the wrong place.\" ": [
  -1,
  "referendum",
  [],
  [
   "once"
  ],
  [
   "is"
  ]
 ],
 "Rachel Holland, President of the University of Leicester Students' Union, said: \"We're really pleased to be welcoming Eddie Izzard to our University next month. It's vital that students and young people exercise their democratic right to vote on June 23 and regardless of which way the vote goes, it is young people who are going to be impacted the most by the result.\" ": [
  1,
  "Rachel Holland",
  [],
  [],
  [
   "said"
  ]
 ],
 "If students aren't sure which address they'll be at, they can register at both their term-time and home address – although they can only vote once. If students aren't sure where they'll be at either location, if they will be on holiday or if they can't get to their polling station for any reason, they should consider registering for a postal or proxy vote.": [
  -1,
  "they",
  [],
  [],
  [
   "register",
   "can"
  ]
 ],
 "The big question arrived at the fag end of the interview, as the Labour leader Jeremy Corbyn sat back in his chair, mentally switching off, relieved it was almost over. ": [
  -1,
  "question",
  [
   "fag",
   "big"
  ],
  [],
  [
   "arrived"
  ]
 ],
 "\"Do you think of yourself as middle class?\" asked Robert Peston, almost as an afterthought, unaware this was The One that would stump the Labour leader. \"Oh Gawd,\" said Corbyn, reeling. \"I dunno.\" ": [
  -1,
  "you",
  [
   "middle"
  ],
  [],
  [
   "Do",
   "think"
  ]
 ],
 "And he uhmmed and he arrhed and explained that he lived in a house with a mortgage but because he was an MP he may well be middle class but he represented the poor and the down trodden so maybe he wasn't. But he didn't know. Not really. ": [
  0,
  "he",
  [],
  [],
  [
   "uhmmed"
  ]
 ],
 "And there we are. Britain in a nutshell, where the articulate leader of the opposition, the tweed and cord-wearing epitome of a north London metropolitan socialist, a politician who can fend off complicated political questions about the economy and Brexit and austerity but come unstuck when a man asks him to define his very essence. ": [
  -1,
  "we",
  [],
  [
   "there"
  ],
  [
   "are"
  ]
 ],
 "Because social class, still, is tricky in the UK. It shouldn't be. But it is. ": [
  -1,
  "class",
  [
   "social",
   "tricky"
  ],
  [
   "still"
  ],
  [
   "is"
  ]
 ],
 "I reckon most sensible people can pinpoint a specific moment they went off John Prescott, the bumbling buffoon with the extra portion of face and brass neck who was, lest we forget, the Deputy Prime Minister of this country. ": [
  -1,
  "I",
  [],
  [],
  [
   "reckon"
  ]
 ],
 "For me, although all of those are valid, it was the time he said we were \" all middle class now. \" No thanks, John. You might think you are. But you don't speak for me. ": [
  -1,
  "it",
  [],
  [],
  [
   "was"
  ]
 ],
 "I'd rather have an over-earnest, middle class Labour leader struggling with his bourgeois status than an obvious working class Labour deputy leader insisting he's not. Because that doesn't feel like understandable class confusion to me. It feels like betrayal. ": [
  -1,
  "I",
  [],
  [
   "rather"
  ],
  [
   "have"
  ]
 ],
 "I've reined myself in on this front. With age, comes wisdom and temperance. I used to feel so strongly about this there were times when I barely spoke of anything else. I banged my working class drum so loudly and so often I gave myself a headache. In the end, I bored myself with it. God only knows what it did to everyone else. I feel bad about that. ": [
  -1,
  "I",
  [],
  [],
  [
   "'ve",
   "reined"
  ]
 ],
 "I sort of understand why I did, though. The 80s and 90s were full of people talking excitedly about aspiration.It was the golden era of aspiration. Aspiration, aspiration, aspiration seemed more important than education, education, education. ": [
  -1,
  "I",
  [],
  [
   "of",
   "sort",
   "though"
  ],
  [
   "understand"
  ]
 ],
 "You might think I'm middle class. I'm a journalist. I have five different kinds of pasta in my cupboard and four different kinds of olive oil by the hob. I have the Sunday Times. I watch Newsnight. I have bread in the cupboard with sawdust-like bits in it. I sometimes eat fish that isn't battered and a few years ago I moved from Maxwell House coffee to something in a silver tin which is much better. I recommend it. ": [
  -1,
  "You",
  [],
  [],
  [
   "might",
   "think"
  ]
 ],
 "But I'm not middle class. You can say I am, if you like, but you'd be wrong. Because you don't define my class. I do. ": [
  -1,
  "I",
  [
   "middle"
  ],
  [
   "not"
  ],
  [
   "'m"
  ]
 ],
 "I am working class. I'm the son of a hard-working, decent man who made his living with his hands. It might say Columnist of the Year above this page - well, I'm writing this on Thursday, this year's award were on Friday. I won't win it again (Editor's note - He didn't, the let down) – but I'm not fit to lace his boots. He's a proper man. ": [
  -1,
  "I",
  [],
  [],
  [
   "am",
   "working"
  ]
 ],
 "We went to Pontins on holiday when we were kids and I was raised in the bosom of a big, funny, brilliant extended working class family full of strong women who kept the show on the road and good men who would play football with you in the park and mended your bike chain when it broke and all seemed lost. ": [
  -1,
  "We",
  [],
  [],
  [
   "went"
  ]
 ],
 "I loved them then, as a kid, who knew nothing else, and I love them now, as an adult, who knows a little bit more. ": [
  -1,
  "I",
  [],
  [
   "then"
  ],
  [
   "loved"
  ]
 ],
 "I like football and pubs. I can whistle, loudly, through my fingers. Pie is still reliably my favourite tea of the week (and it's tea, not dinner). Most of my friends have ridiculous nicknames, even though they're in their 40s. And if I was to give you directions to anywhere in Leicester, I would do so not by landmarks or street names but pubs, or pubs that once were there. \"Yes mate, it's just by what used to be the Pump and Tap, doyouknowworrimean? \"Etc, etc. ": [
  -1,
  "I",
  [],
  [],
  [
   "like"
  ]
 ],
 "But it doesn't matter does it? It used to irk me when lads I went to school with, lads I played football with down the field until the sun went down, started saying they were middle class because they had a company car. But it's not up to me to define them is it? Just like it's not up to anyone else to define me.You are what you think you are. That's all that matters. ": [
  -1,
  "it",
  [],
  [
   "n't"
  ],
  [
   "matter",
   "does"
  ]
 ],
 "Today I'm raising a couple of kids who, at 15 and 12 , already talk about going to university. They like bread with sawdust bits in and they're totally unmoved by The Dukes of Hazzard. They're middle class in a way I can never be. ": [
  -1,
  "I",
  [],
  [],
  [
   "'m",
   "raising"
  ]
 ],
 "But they know where they're from. They know what their granddad did and their granddad before him. And they know what that means. ": [
  -1,
  "they",
  [],
  [],
  [
   "know"
  ]
 ],
 "Because I think that's important.": [
  -1,
  "I",
  [],
  [],
  [
   "think"
  ]
 ],
 "Leaving the European Union would severely damage the competitiveness of the North East’s financial services industry, a Treasury Minister has warned, ": [
  -1,
  "Treasury Minister",
  [
   "financial"
  ],
  [
   "severely"
  ],
  [
   "damage",
   "Leaving",
   "would",
   "warned",
   "has"
  ]
 ],
 "She said financial services played a key role in the North East, adding around £2bn to the region’s economy every year. ": [
  -1,
  "She",
  [],
  [],
  [
   "said"
  ]
 ],
 "The industry supports around 53,000 jobs in the region, with 26,000 people working directly in financial services and another 27,000 working in associated professional services. ": [
  -1,
  "industry",
  [],
  [
   "around"
  ],
  [
   "supports"
  ]
 ],
 "But this would be put at risk by a vote to leave the EU in the referendum on June 23, she said. ": [
  1,
  "she",
  [],
  [],
  [
   "be",
   "put",
   "would",
   "said",
   "leave"
  ]
 ],
 "Mrs Baldwin is due to visit the Gosforth offices of Virgin Money on Thursday, where she will speak to staff about the benefits of remaining in the EU. ": [
  1,
  "Mrs Baldwin",
  [],
  [],
  [
   "is"
  ]
 ],
 "The Minister will also visit True Potential, another major financial services employer in the city. ": [
  -1,
  "Minister",
  [
   "financial",
   "True",
   "major"
  ],
  [
   "also"
  ],
  [
   "will",
   "visit"
  ]
 ],
 "On Wednesday, Alan Johnson MP, chair of the Labour In for Britain campaign visited the Hitachi Rail Europe site in Newton Aycliffe with the ‘Labour In’ battle bus. ": [
  0,
  "Alan Johnson MP",
  [],
  [],
  [
   "visited"
  ]
 ],
 "His fellow Labour In peer, Hilary Benn, will be at the Angel of the North and the Oxford Centre in Longbenton on Thursday, while Nigel Farage will be in Newcastle city centre on the ‘leave’ campaign trail. ": [
  -1,
  "Labour",
  [
   "fellow"
  ],
  [],
  [
   "will",
   "be"
  ]
 ],
 "Mrs Baldwin said: “The financial services industry in the North East makes an important contribution to the Northern Powerhouse. ": [
  1,
  "Mrs Baldwin",
  [],
  [],
  [
   "said"
  ]
 ],
 "“Today I am visiting True Potential and Virgin Money, two firms that make are going from strength to strength in Newcastle. They play an important role in the local economy and are part of a financial services industry that employs around 26,000 people with a further 27,000 in related professional services.” ": [
  -1,
  "I",
  [],
  [],
  [
   "am",
   "are",
   "going",
   "visiting"
  ]
 ],
 "She added: “Voters in Newcastle and across the country face a fundamental choice – whether to remain a member of a reformed EU, or to take a leap into the dark. ": [
  -1,
  "She",
  [],
  [],
  [
   "added"
  ]
 ],
 "“A vote to stay in Europe will protect jobs in the North East, promote economic growth and ensure that the regional financial services sector continues to grow.” ": [
  -1,
  "vote",
  [],
  [],
  [
   "will",
   "protect",
   "stay"
  ]
 ],
 "Newcastle is at the heart of the North East’s financial services industry, accounting for around a quarter of all financial and associated professional services jobs in the region according to the Treasury. ": [
  -1,
  "Newcastle",
  [
   "professional",
   "financial"
  ],
  [],
  [
   "accounting",
   "associated",
   "is",
   "according"
  ]
 ],
 "Virgin Money employs around 2,000 people in the city, and other major employers include AA insurance, Tesco Bank, Santander and the Newcastle Building Society. Another bank, Atom Bank, is based in Durham. 2016 Getty Images The European Union and the Union flag sit together ": [
  -1,
  "Virgin Money",
  [],
  [],
  [
   "employs"
  ]
 ],
 "Access to the EU single market helped the UK financial services sector to export over £22bn in 2014, the Treasury says. ": [
  -1,
  "Treasury",
  [],
  [],
  [
   "says"
  ]
 ],
 "Jayne-Anne Gadhia, Virgin Money’s chief executive, said: “Working with our European partners, Britain has helped create the biggest market in the world. ": [
  -1,
  "Anne Jayne Gadhia",
  [
   "chief"
  ],
  [],
  [
   "said"
  ]
 ],
 "“Membership of the EU gives us unrestricted access to 500 million consumers and, with around 100,000 jobs in the North East linked to exports to the EU, remaining as a strong part of a reformed EU protects our jobs, our incomes and our future.” ": [
  -1,
  "Membership",
  [
   "unrestricted"
  ],
  [],
  [
   "gives",
   "protects"
  ]
 ],
 "The latest warning comes after the Treasury published a report earlier this week predicting the economy would be tipped into recession and unemployment in the North East could rise by 20,000 if Britain voted to leave the EU. ": [
  -1,
  "warning",
  [
   "latest"
  ],
  [],
  [
   "comes"
  ]
 ],
 "The EU referendum campaign has become increasingly bad-tempered with senior Conservatives battling each other - and complaining that the Government is giving itself an unfair advantage. Poll loading … ": [
  -1,
  "campaign",
  [
   "bad",
   "senior",
   "other"
  ],
  [
   "increasingly"
  ],
  [
   "tempered",
   "battling",
   "become",
   "has"
  ]
 ],
 "They say the pages must go once the so-called purdah period comes into force on May 27. ": [
  -1,
  "They",
  [],
  [],
  [
   "say"
  ]
 ],
 "Tory backbencher Anne Main told the House of Commons: “They are trying to muzzle us when we are trying to get the truth of all this.” ": [
  -1,
  "Anne Main",
  [],
  [],
  [
   "told"
  ]
 ],
 "Launching the Veterans For Britain campaign, Major General Tim Cross said: “The Prime Minister and others who constantly tell me to be afraid, frankly, speaking soldierly about it, they can bugger off.” The European Union debate": [
  -1,
  "Major Tim General Cross",
  [],
  [],
  [
   "said",
   "Launching"
  ]
 ],
 "Tens of thousands of small businesses in the North East would be hit if the UK votes to leave the European Union, Business Secretary Sajid Javid has warned. ": [
  0,
  "Business Sajid Secretary Javid",
  [],
  [],
  [
   "warned",
   "has"
  ]
 ],
 "The Cabinet minister said it was a “dangerous” misconception to believe that smaller firms would be unaffected by Brexit after the Britain Stronger in Europe said that 31,000 firms in the North East either export to Europe or supply firms that do export. ": [
  -1,
  "Cabinet minister",
  [],
  [],
  [
   "said"
  ]
 ],
 "Opinion on the EU in the small business community is much more mixed than among larger companies, with polls by bodies such as the Federation of Small Businesses showing support for EU membership but at much lower levels. ": [
  -1,
  "Opinion",
  [
   "lower",
   "larger",
   "mixed",
   "small",
   "such"
  ],
  [
   "more",
   "much"
  ],
  [
   "showing",
   "is"
  ]
 ],
 "But Mr Javid said small firms were the “backbone of our economy” and the livelihoods of millions of workers could be put at risk if the country breaks from Brussels on June 23. ": [
  0,
  "Mr Javid",
  [],
  [],
  [
   "said"
  ]
 ],
 "Citing the number of companies in the region that rely on trade with Europe, Mr Javid said: “This shows yet again that small businesses across the North East are stronger, safer and better off in Europe. ": [
  0,
  "Mr Javid",
  [],
  [],
  [
   "said"
  ]
 ],
 "“If we leave the EU, small firms are on the front line and that’s a gamble with people’s livelihoods I’m not willing to take. Small businesses are the backbone of our economy. Let’s not break that backbone with a leap into the dark.” ": [
  -1,
  "I",
  [
   "willing"
  ],
  [
   "not"
  ],
  [
   "take",
   "’m"
  ]
 ],
 "Britain Stronger in Europe also highlighted comments from a number of North East firms backing the Remain Campaign. ": [
  1,
  "Britain Stronger",
  [],
  [
   "also"
  ],
  [
   "backing",
   "highlighted"
  ]
 ],
 "Charlie Gibbs, director of Gateshead-based company Steampunk Gin, said: “We are a small but growing gin business who are looking to expand by exporting into countries all across Europe. At the moment, once we have established new customers, doing business is easy. ": [
  -1,
  "Charlie Gibbs",
  [],
  [],
  [
   "based",
   "said"
  ]
 ],
 "“In addition, we source round 80% of our raw materials from EU countries, which means we pay no local VAT due to the reciprocal arrangements we have now. If, for example, we had to start paying Germany 19% VAT that we could not claim back, then that 19% increase would need to be passed onto our customers, who in turn would be passing it onto consumers.” ": [
  -1,
  "we",
  [],
  [],
  [
   "source"
  ]
 ],
 "But John Longworth, former director-general of the British Chambers of Commerce who now chairs the Vote Leave Business Council, said: “These Government figures are extremely questionable. ": [
  0,
  "John Longworth",
  [],
  [],
  [
   "said"
  ]
 ],
 "“The reality is that only 6% of British firms export to the EU, but 100% are caught up in red tape and costs from Brussels. If we Vote Leave and take back control of our economy, our businesses will thrive.”": [
  -1,
  "reality",
  [
   "red"
  ],
  [],
  [
   "are",
   "is",
   "caught"
  ]
 ],
 "Liz Kendall has hit out at Government plans to sell off the Land Registry. ": [
  1,
  "Liz Kendall",
  [],
  [],
  [
   "has",
   "plans",
   "sell",
   "hit"
  ]
 ],
 "The Labour Leicester West MP has urged ministers to abandon proposals to privatise the department following a consultation which ended today. ": [
  -1,
  "Labour West Leicester MP",
  [],
  [],
  [
   "has",
   "urged"
  ]
 ],
 "The registry holds documents detailing property. ": [
  -1,
  "registry",
  [],
  [],
  [
   "detailing",
   "holds"
  ]
 ],
 "Some 250 Land Registry employees work at its office in Westbridge Place in her constituency and the potential privatisation has left their futures uncertain. ": [
  -1,
  "Land Registry employees",
  [],
  [],
  [
   "work"
  ]
 ],
 "Ms Kendall said the latest attempt to sell the Land Registry was a rehash of plans she had fought in the last Parliament. ": [
  0,
  "Ms Kendall",
  [],
  [],
  [
   "said"
  ]
 ],
 "She said: \"Previous reviews by the Tories themselves found the fact the Land Registry is in public ownership is crucial to its impartiality and its work. ": [
  -1,
  "She",
  [],
  [],
  [
   "said"
  ]
 ],
 "\"It hold the records of ownership of £2.5 trillion worth of property across the country. ": [
  -1,
  "It",
  [],
  [],
  [
   "hold"
  ]
 ],
 "The Government has argued a sell-off will produce cash which will go towards the repayment of the national debt. ": [
  0,
  "Government",
  [],
  [],
  [
   "argued",
   "has"
  ]
 ],
 "It has not put a price tag on the registry, but previous valuations have returned a figure of £1.2 billion. ": [
  -1,
  "It",
  [],
  [
   "not"
  ],
  [
   "put",
   "has"
  ]
 ],
 "Last year, the department made a surplus of £36.6m and paid the Government more than £100 million in dividends. ": [
  -1,
  "department",
  [
   "Last",
   "more"
  ],
  [],
  [
   "paid",
   "made"
  ]
 ],
 "Some 288,000 people have signed an online petition against the proposed sell-off. ": [
  -1,
  "people",
  [
   "online"
  ],
  [],
  [
   "signed",
   "proposed",
   "have"
  ]
 ],
 "PCS union general secretary Mark Serwotka said: \"We exposed the emptiness of the Government's case last time and will do again to put a stop to this plan that is being driven by short-term political choice, not economic necessity. ": [
  0,
  "Mark Serwotka",
  [
   "general"
  ],
  [],
  [
   "said"
  ]
 ],
 "\"Home buyers and owners rely on the Land Registry to provide an impartial professional service and it must remain under public control, free from any profit motive and conflict of interest.\" ": [
  -1,
  "buyers",
  [
   "professional",
   "impartial"
  ],
  [],
  [
   "provide",
   "rely"
  ]
 ],
 "A Government spokesman said: \"We believe our preferred model would benefit Land Registry, the Government, customers and the wider public. ": [
  0,
  "Government spokesman",
  [],
  [],
  [
   "said"
  ]
 ],
 "\"It would bring significant benefits to Land Registry and, in time, the wider economy by increasing the potential of the business and its data. ": [
  -1,
  "It",
  [
   "wider",
   "significant"
  ],
  [],
  [
   "increasing",
   "would",
   "bring"
  ]
 ],
 "\"We believe a transaction of this type is deliverable in 2017, thereby reducing impact of delay and uncertainty to the workforce.\"": [
  -1,
  "We",
  [],
  [],
  [
   "believe"
  ]
 ],
 "Just over three months ago, our Prime Minister David Cameron told the House of Commons “I’m not arguing and I will never argue that Britain couldn’t survive outside the European Union .” Just a few weeks earlier, he said “Some people seem to say that really Britain couldn’t survive couldn’t do ok outside the European Union, I don’t think that is true.” His words are pretty clear. Elsewhere he pointed out that “We are the fifth-largest economy in the world, the biggest defence player in Europe with one of the most extensive and influential diplomatic networks on the planet.” ": [
  0,
  "Prime David Minister Cameron",
  [],
  [
   "Just",
   "ago"
  ],
  [
   "told"
  ]
 ],
 "Of course, he might believe that we could succeed outside the EU but that (somehow) we could do even better by being tied into the European Union. I wouldn’t agree but it would be an honest viewpoint for him to hold. His words back in February must have been true, or else he would have to resign: a Prime Minister who misleads Parliament has no other course of action. PA Wire Prime Minister David Cameron ": [
  0,
  "he",
  [],
  [
   "Of",
   "course"
  ],
  [
   "believe",
   "might"
  ]
 ],
 "Many people in the North East don’t trust the Conservatives anyway, but is Labour’s Jeremy Corbyn really any better? He used to be anti-European Union; indeed, he voted against membership all the way back in 1975 when opposition to the European Union was a fringe political view. Throughout the decades, his various quotes on the subject have been pretty clear. Only last year, he described the situation in Greece: “If the EU becomes a totally brutal organisation that treats every one of its member states in the way that the people of Greece have been treated at the moment, then I think it will lose a lot of support from a lot of people.” ": [
  -1,
  "n’t",
  [],
  [
   "anyway",
   "n’t"
  ],
  [
   "trust"
  ]
 ],
 "I spoke to one Labour MEP (not from the North East, and I’m not naming names because it would be unfair to do so) who didn’t believe, in their heart of hearts, that Corbyn had actually changed his mind. It could be that he is merely bowing to the will of the majority of the Parliamentary Labour Party or his perception that a majority of its activists want to remain in the EU. I interpreted it as meaning that he would like to leave the European Union, but is campaigning for Remain because he’s terrified of losing his job if he gives his own honest view. ": [
  -1,
  "I",
  [],
  [
   "not"
  ],
  [
   "spoke"
  ]
 ],
 "Our Prime Minister and the Leader of the Opposition have something in common. They’re both threatening us with all kinds of negative consequences if we vote to leave the European Union, but in fact they’re both acting within their own self-interest. If you think David Cameron is a fantastic Prime Minister of the United Kingdom of Great Britain and Northern Ireland, and if you’re willing to overlook the hoodwinking of the British people, then you might well vote to Remain if you can cope with the astronomical cost, unlimited immigration and continuing drip-drip-drip of job-destroying legislation. Otherwise, a Leave vote - a vote for our independence, freedom and democracy - might well have the added byproduct of not just putting me and my MEP colleagues out of work (a badge I’d wear with pride if it meant getting our country back), but also removing an unpopular Prime Minister who’s well past his sell-by date anyway. The European Union debate": [
  0,
  "Prime Minister",
  [
   "common"
  ],
  [],
  [
   "have"
  ]
 ],
 "Leaving the European Union would destroy 20,000 jobs in the North East, Chancellor George Osborne has claimed. ": [
  0,
  "George Chancellor Osborne",
  [],
  [],
  [
   "claimed",
   "Leaving",
   "would",
   "destroy",
   "has"
  ]
 ],
 "And that includes 3,000 jobs for young people, pushing up the youth unemployment rate. ": [
  -1,
  "that",
  [
   "young"
  ],
  [],
  [
   "pushing",
   "includes"
  ]
 ],
 "And North East Conservative MP Anne-Marie Trevelyan said the biggest threat to jobs would be staying in the “failing” EU. ": [
  1,
  "East North Conservative Marie Anne MP Trevelyan",
  [],
  [],
  [
   "said"
  ]
 ],
 "It said around 100,000 jobs in the region are linked to the UK’s exports to other EU countries. ": [
  -1,
  "It",
  [
   "other"
  ],
  [
   "around"
  ],
  [
   "are",
   "linked",
   "said"
  ]
 ],
 "And the Treasury pointed out that the North East has benefited from £1.1 billion of inward investment from EU members over the last 5 years, with 90 foreign investment projects in the North East creating or safeguarding almost 6,000 jobs. ": [
  -1,
  "Treasury",
  [],
  [],
  [
   "pointed"
  ]
 ],
 "Mr Osborne claimed that a vote to leave would plunge the United Kingdom into a year-long economic recession. ": [
  0,
  "Mr Osborne",
  [],
  [],
  [
   "claimed"
  ]
 ],
 "He said: “The people of the North East and across Britain have worked so hard to get our country back on track. ": [
  -1,
  "He",
  [],
  [],
  [
   "said"
  ]
 ],
 "“Do we want to throw it all away? ": [
  -1,
  "we",
  [],
  [
   "away"
  ],
  [
   "want",
   "Do",
   "throw"
  ]
 ],
 "“With exactly one month to go to the referendum, the British people must ask themselves this question: can we knowingly vote for a recession?” ": [
  -1,
  "people",
  [
   "British"
  ],
  [
   "exactly"
  ],
  [
   "go",
   "ask",
   "must"
  ]
 ],
 "Ronnie Campbell has accused the Chancellor of making 'wild predictions' ": [
  0,
  "Ronnie Campbell",
  [
   "wild"
  ],
  [],
  [
   "has",
   "making",
   "accused"
  ]
 ],
 "Painting a gloomy picture of the effects of leaving, the Chancellor claimed in a speech that it would lead to the economy shrinking, the value of the pound falling, inflation rising, wages falling, house prices falling government borrowing going up. ": [
  -1,
  "Chancellor",
  [
   "gloomy"
  ],
  [],
  [
   "claimed",
   "Painting",
   "leaving"
  ]
 ],
 "Guy Opperman , the Conservative MP for Hexham in Northumberland and a supporter of the “remain” campaign, echoed the warning, saying: “Times are hard - why would you want to damage our North East economy? There is no doubt that Brexit would make the North East worse off.” ": [
  0,
  "Guy Opperman",
  [
   "Conservative"
  ],
  [],
  [
   "remain"
  ]
 ],
 "And Jayne Anne Gadhia, chief executive of Newcastle-based banking giant Virgin Money , added: “Staying in the EU means economic security for local people and families. With around 100,000 jobs in the region linked to exports to the EU, voting to leave comes with a hefty price tag - for workers, businesses and consumers.” ": [
  -1,
  "Anne Jayne Gadhia",
  [
   "chief",
   "economic",
   "local"
  ],
  [],
  [
   "Staying",
   "based",
   "means",
   "added"
  ]
 ],
 "But Anne-Marie Trevelyan, Conservative MP for Berwick-upon-Tweed , said leaving the EU would make it easier for North East firms to trade with growing markets in other parts of the world. ": [
  1,
  "Marie Anne Trevelyan",
  [
   "Conservative"
  ],
  [],
  [
   "said"
  ]
 ],
 "She said: “Only 6% of our businesses export to the EU, but 100% of them have to abide by the EU’s crippling regulations which damage our small and medium-sized businesses. ": [
  -1,
  "She",
  [],
  [],
  [
   "said"
  ]
 ],
 "“By contrast, the UK operates a trade deficit with the EU – we are the EU’s largest export market. EU countries will need to continue to sell us their products after we vote to leave the EU. The real risk to growth and jobs is if we vote to stay.” ": [
  -1,
  "UK",
  [],
  [],
  [
   "operates"
  ]
 ],
 "She added: “The Eurozone suffers from crippling unemployment and stagnant growth. The risk to jobs is to remain in a failing political union and risk our economy by bailing out Eurozone countries. ": [
  -1,
  "She",
  [],
  [],
  [
   "added"
  ]
 ],
 "“The two most successful nations in Europe are Norway and Switzerland – they have the highest GDP, the lowest unemployment and the lowest wage inequality. Neither are members of the EU.” ": [
  -1,
  "nations",
  [
   "successful"
  ],
  [
   "most"
  ],
  [
   "are"
  ]
 ],
 "Ronnie Campbell, the Labour MP for Blyth Valley, accused the Chancellor of making “wild predictions”. ": [
  0,
  "Ronnie Campbell",
  [],
  [],
  [
   "accused"
  ]
 ],
 "He said the job loss claims were based on the assumption that the EU would refuse to trade with the UK or introduce restrictions. ": [
  -1,
  "He",
  [],
  [],
  [
   "said"
  ]
 ],
 "But he said: “Are French farmers going to say you can’t have our food? Or carmakers in Germany saying you can’t buy our Mercedes? ": [
  0,
  "he",
  [],
  [],
  [
   "said"
  ]
 ],
 "“We are the fifth biggest economy in the world. Capitalists are not going to do that.” ": [
  -1,
  "We",
  [
   "biggest"
  ],
  [
   "fifth"
  ],
  [
   "are"
  ]
 ],
 "But Mr Campbell, who will voting to leave the EU in the referendum on June 23, said both sides in the debate had resorted to scare tactics. ": [
  0,
  "Mr Campbell",
  [],
  [],
  [
   "said"
  ]
 ],
 "He said: “It is about frightening the voters either to stay in or come out.”": [
  -1,
  "He",
  [],
  [],
  [
   "said"
  ]
 ],
 "A few weeks ago I wrote about the depressingly poor standard of the EU referendum debate, and, if nothing else, events since then have proved that no one takes a blind bit of notice of me. ": [
  -1,
  "I",
  [
   "few",
   "poor"
  ],
  [
   "ago",
   "depressingly"
  ],
  [
   "wrote"
  ]
 ],
 "The campaign has raised some chuckles, at least, in causing the tabloid press to froth at the mouth about EU scaremongering, something they had assumed they had cornered the market in for many years. ": [
  -1,
  "campaign",
  [
   "least"
  ],
  [],
  [
   "has",
   "raised"
  ]
 ],
 "It is hard not to wonder too whether Mr Pot has been introduced to Mr Kettle when you see Boris Johnson, a man who has fibbed his way through his adult life, complaining about the Remain side’s tactics. ": [
  -1,
  "It",
  [
   "hard"
  ],
  [],
  [
   "is"
  ]
 ],
 "The former mayor of London, having been sacked by The Times for fabricating a quote, became The Telegraph’s Brussels correspondent in the 1990s and spent a number of years making up stories about the EU. Why anyone would listen to a single word he says on Europe now is beyond me. ": [
  -1,
  "mayor",
  [
   "former"
  ],
  [],
  [
   "having",
   "became",
   "fabricating",
   "sacked",
   "making",
   "spent",
   "been"
  ]
 ],
 "It seems reasonably clear that if your vote in the EU referendum is based on the economics of Brexit, any sensible person would vote to Remain. The vast majority of studies, including many by people with no axe to grind, show that leaving the EU would cost us jobs and reduce incomes. ": [
  -1,
  "It",
  [
   "clear"
  ],
  [
   "reasonably"
  ],
  [
   "seems"
  ]
 ],
 "Having won the Scottish referendum and last year’s General Election by prophesying doom if the other side won, Cameron is returning to his favourite tactic. The Leave side are running much the same game plan, all but predicting an invasion of Mongol maurauders if we stay in the EU. ": [
  0,
  "Cameron",
  [
   "favourite"
  ],
  [],
  [
   "is",
   "returning"
  ]
 ],
 "(It’s interesting that Project Fear failed to work in the London mayoral election, though my guess is that that failure was mostly down to the cackhanded nature of Zac Goldsmith’s dog whistle campaign, aided and abetted by that man Boris). ": [
  -1,
  "It",
  [
   "interesting"
  ],
  [],
  [
   "’s"
  ]
 ],
 "With four weeks of campaigning to go, it would be refreshing for politicians to present a positive vision of what remaining or leaving the EU would mean for Britain. But I’m not holding my breath. ": [
  -1,
  "it",
  [],
  [],
  [
   "be",
   "campaigning",
   "go",
   "would",
   "mean"
  ]
 ],
 "Graeme Whitfield is business editor of The Journal": [
  0,
  "Graeme Whitfield",
  [],
  [],
  [
   "is"
  ]
 ],
 "The deadline to register to vote in the EU referendum is to be extended to the end of Thursday - after a website crash threatened to deny thousands of people of the chance to take part. ": [
  -1,
  "deadline",
  [],
  [],
  [
   "vote",
   "register",
   "is"
  ]
 ],
 "Voters originally had until midnight on Tuesday to register for the poll on June 23. ": [
  -1,
  "Voters",
  [],
  [
   "originally"
  ],
  [
   "had",
   "register"
  ]
 ],
 "But the official website crashed, preventing thousands of people from registering. ": [
  -1,
  "website",
  [
   "official"
  ],
  [],
  [
   "preventing",
   "crashed",
   "registering"
  ]
 ],
 "The extension of the deadline will require emergency legislation. ": [
  -1,
  "extension",
  [],
  [],
  [
   "require",
   "will"
  ]
 ],
 "Cabinet Office minister Matt Hancock said: “Following discussions with the Electoral Commission and strong cross-party support expressed in the House of Commons, we will introduce secondary legislation to extend the deadline for voter registration until midnight tomorrow [Thursday].” ": [
  0,
  "Matt Hancock",
  [],
  [],
  [
   "said"
  ]
 ],
 "Supporters of the ‘leave’ campaign complained that the move was unfair and accused the Government of trying to “skew” the result of the EU referendum by extending the deadline. ": [
  -1,
  "Supporters",
  [],
  [],
  [
   "complained"
  ]
 ],
 "The chief executive of the Vote Leave campaign, Matthew Elliott, said the Government was “trying to register as many likely Remain voters as possible” amid speculation that thousands of those prevented from registering were younger people who are thought to be more likely to back EU membership. ": [
  -1,
  "executive",
  [
   "chief"
  ],
  [],
  [
   "said"
  ]
 ],
 "Also read: Everything you need to know about registering to vote in the EU referendum ": [
  -1,
  "Everything",
  [],
  [
   "Also"
  ],
  [
   "read"
  ]
 ],
 "Downing Street said 214,000 people were trying to use the www.gov.uk/register-to-vote website between 9pm and 10pm on Tuesday, but it was not known how many were prevented by the system overload from registering before the midnight deadline. ": [
  -1,
  "Downing Street",
  [
   "many"
  ],
  [
   "not",
   "how"
  ],
  [
   "was",
   "known",
   "prevented",
   "registering",
   "said",
   "were"
  ]
 ],
 "Amid demands from senior figures including Labour leader Jeremy Corbyn, Liberal Democrat chief Tim Farron and Green leader Natalie Bennett for a deadline extension, ministers went into urgent talks with the Electoral Commission over possible legislative action to allow late applicants to vote. ": [
  -1,
  "ministers",
  [
   "possible",
   "legislative",
   "urgent",
   "senior"
  ],
  [],
  [
   "went",
   "including"
  ]
 ],
 "And Mr Cameron urged people to keep on registering while the situation was sorted out. ": [
  0,
  "Mr Cameron",
  [],
  [],
  [
   "was",
   "sorted",
   "registering",
   "keep",
   "urged"
  ]
 ],
 "In a message on Twitter, he said: “If you aren’t registered and you want to vote in this EU referendum you should continue to register at gov.uk/register-to-vote. ": [
  0,
  "he",
  [],
  [],
  [
   "said"
  ]
 ],
 "“Huge demand caused system overload last night. Urgent discussions with Electoral Commission to try to ensure people who register can vote.” PA/PA Wire The government website to register to vote in the EU referendum which crashed less than hour before the deadline slams shut ": [
  -1,
  "demand",
  [
   "Huge",
   "last"
  ],
  [],
  [
   "caused"
  ]
 ],
 "The chairman of the Commons Public Administration and Constitutional Affairs Committee, Bernard Jenkin - a leading Leave campaigner - warned the Government was acting on the “cusp of legality” and may be faced by a judicial review if the referendum result was close. ": [
  -1,
  "chairman",
  [],
  [],
  [
   "warned",
   "leading"
  ]
 ],
 "He said the law required the register to be finished and published six working days before the poll, with a further five days in which new entrants on the register can be challenged, when there are just 14 working days before the vote. ": [
  -1,
  "He",
  [],
  [],
  [
   "said"
  ]
 ],
 "“We are on the cusp of legality here. We are now outside the legal framework by keeping the registration open today,” Mr Jenkin told BBC Radio 4’s World At One. ": [
  -1,
  "We",
  [],
  [
   "here"
  ],
  [
   "are"
  ]
 ],
 "“If they were to extend the registration for a period longer than this, they are really opening the possibility of a judicial review of the result if it is very close and people feel they have got a cause. ": [
  -1,
  "they",
  [
   "judicial"
  ],
  [
   "really"
  ],
  [
   "opening",
   "are"
  ]
 ],
 "“We are not a banana republic. We shouldn’t be making up the rules for our elections as we go along. This is a shambles.” ": [
  -1,
  "We",
  [],
  [
   "not"
  ],
  [
   "are"
  ]
 ],
 "Also read: MP calls for an extension to the EU vote register deadline after Government website crashes ": [
  -1,
  "MP",
  [],
  [
   "Also"
  ],
  [
   "read",
   "calls"
  ]
 ],
 "Leading Brexit campaigner Michael Gove said: “These are complex legal waters and I do not want to presume definitively without having looked at the law. But in my heart is a desire to ensure that everyone possible can be given the vote. ": [
  0,
  "Michael Gove",
  [],
  [],
  [
   "Leading",
   "said"
  ]
 ],
 "Asked if he feared a higher turnout could damage the chances of a Leave vote, he said: “I am confident that the more people who hear our message, the more will vote to leave.”": [
  0,
  "he",
  [],
  [],
  [
   "said"
  ]
 ],
 "The warning comes from Universities UK, the body which represents universities across the country. ": [
  -1,
  "warning",
  [],
  [],
  [
   "comes"
  ]
 ],
 "It has entered the debate with less than two weeks to go before the historic vote. ": [
  -1,
  "It",
  [
   "historic",
   "less"
  ],
  [],
  [
   "go",
   "has",
   "entered"
  ]
 ],
 "An analysis by Universities UK found that colleges in Newcastle alone received £17.29m of research funding from EU sources in the last financial year. ": [
  -1,
  "analysis",
  [],
  [],
  [
   "found"
  ]
 ],
 "Across the North East as a whole, the figure is £29.1m. ": [
  -1,
  "figure",
  [],
  [],
  [
   "is"
  ]
 ],
 "And university research contributes to the wider economy, academic leaders said. ": [
  -1,
  "leaders",
  [
   "academic"
  ],
  [],
  [
   "said"
  ]
 ],
 "Industries in the North East that have benefited most from this knock-on impact include manufacturing, wholesale and retail trade and services to businesses. ": [
  -1,
  "Industries",
  [
   "retail",
   "wholesale"
  ],
  [],
  [
   "include"
  ]
 ],
 "Projects receiving funding include RD-Connect at Newcastle University which provides a central resource for doctors and researchers working on rare genetic diseases to share data, make new discoveries and diagnose more patients. ": [
  -1,
  "Projects",
  [
   "more",
   "new"
  ],
  [],
  [
   "make",
   "diagnose",
   "receiving",
   "include"
  ]
 ],
 "It’s hard for doctors to develop the expertise to diagnose and treat rare diseases because they see them so rarely. However, the Newcastle-based scheme allows them to share knowledge with other doctors across Europe. ": [
  -1,
  "It",
  [
   "hard"
  ],
  [],
  [
   "’s"
  ]
 ],
 "Hanns Lochmüller, Professor of Experimental Myology at the Newcastle University John Walton Muscular Dystrophy Research Centre and honorary consultant with the Newcastle upon Tyne Hospitals NHS Trust, said: “EU funding is absolutely vital to our medical research work at Newcastle University. ": [
  0,
  "Hanns Lochmüller",
  [
   "honorary"
  ],
  [],
  [
   "said"
  ]
 ],
 "“Of course the number of jobs it has brought into the region is substantial, but what is even more important to me and the patients who come to our centre is that it enables us to run world-leading clinical trials for rare muscle-wasting conditions, provide the best care, and develop cutting-edge ways of diagnosing patients who do not know the cause of their disease.” ": [
  -1,
  "number",
  [
   "substantial"
  ],
  [
   "Of",
   "course"
  ],
  [
   "is"
  ]
 ],
 "As the EU debate continued, a former leader of Newcastle City Council warned that leaving the EU would be “a massive own goal disrupting our economy and the livelihoods of very many households”. ": [
  -1,
  "leader",
  [
   "massive",
   "many",
   "former",
   "own"
  ],
  [
   "very"
  ],
  [
   "be",
   "leaving",
   "would",
   "disrupting",
   "warned"
  ]
 ],
 "John Shipley, now a Liberal Democrat member of the House of Lords, said in a speech in Parliament: “The North East would lose access to hundreds of millions of pounds of EU funding for regional development. ": [
  0,
  "John Shipley",
  [],
  [
   "now"
  ],
  [
   "said"
  ]
 ],
 "“The North East needs access to the EU single market of 500 million people, with a say over the rules of doing business across Europe. That means more jobs and more financial security for our region.” ": [
  0,
  "North East",
  [
   "single"
  ],
  [],
  [
   "doing",
   "needs"
  ]
 ],
 "Labour Deputy Leader Tom Watson will today publish a dossier setting out what he says will be the impact of leaving the European Union on family budgets. ": [
  -1,
  "Deputy Labour Tom Leader Watson",
  [],
  [],
  [
   "will",
   "publish"
  ]
 ],
 "He will claim that social security cuts and tax rises totalling more than £18bn would be introduced. ": [
  -1,
  "He",
  [],
  [],
  [
   "will",
   "claim"
  ]
 ],
 "JCB chairman Lord Bamford, a Tory peer, has written to all JCB employees to explain why he is in favour of quitting the EU. ": [
  0,
  "Lord Bamford",
  [],
  [],
  [
   "has",
   "written"
  ]
 ],
 "The businessman says he supported joining the Common Market but did not back it turning into a political union. ": [
  -1,
  "businessman",
  [],
  [],
  [
   "says"
  ]
 ],
 "Stating that more than half of Britain’s trade is with non-EU countries, Lord Bamford warns that the EU has a shrinking share of world trade. ": [
  0,
  "Lord Bamford",
  [],
  [],
  [
   "warns"
  ]
 ],
 "“No one can be certain of the outcome. One thing I am certain of is this: JCB will continue to trade with Europe irrespective of whether we remain or leave the EU. ": [
  -1,
  "one",
  [
   "certain"
  ],
  [],
  [
   "be",
   "can"
  ]
 ],
 "“JCB was selling into Europe long before the UK joined the Common Market in 1973, and it will remain an important market for JCB,” Lord Bamford wrote. ": [
  0,
  "Lord Bamford",
  [],
  [],
  [
   "wrote"
  ]
 ],
 "The JCB chairman told workers it was up to them how they voted, but they should vote one way or the other in the referendum. The European Union debate ": [
  -1,
  "JCB chairman",
  [],
  [],
  [
   "told"
  ]
 ],
 "Former Trade Commissioner Lord Peter Mandelson issued the stark warning over the “black hole” Brexit would open up in the region. ": [
  0,
  "Trade Commissioner Peter Lord Mandelson",
  [
   "Former",
   "black",
   "stark"
  ],
  [],
  [
   "issued"
  ]
 ],
 "The Labour peer claimed losing vital access to the single European market would have a significant impact on the region’s economy - home to giants like Nissan and Hitachi - as well as the scores of European companies that have made the area their home. ": [
  -1,
  "Labour peer",
  [],
  [],
  [
   "claimed"
  ]
 ],
 "Lord Mandelson said: “Around 58% of all goods exported from the North East go to Europe. If we leave and put up barriers to trade, those exports and jobs would come under threat. ": [
  0,
  "Lord Mandelson",
  [],
  [],
  [
   "said"
  ]
 ],
 "“In the last five years, 90 investments from new businesses and projects from Europe have created and safeguarded around 6,000 North East jobs.” ": [
  -1,
  "investments",
  [
   "last",
   "new"
  ],
  [],
  [
   "safeguarded",
   "have",
   "created"
  ]
 ],
 "While many argue Lord Mandelson’s warnings come amid increasingly desperate tactics from the Remain campaign, his views nonetheless carry weight as the man responsible for overseeing all EU trade deals between 2004 and 2008. Ben Pruchnie/Getty Images Lord Mandelson delivers a keynote speech during an event hosted by the Britain Stronger In Europe campaign on March 1, 2016 in London, England ": [
  -1,
  "views",
  [
   "responsible"
  ],
  [
   "nonetheless"
  ],
  [
   "overseeing",
   "carry"
  ]
 ],
 "Always a pro-European advocate, the peer has warned that losing the EU’s preferential trading benefits in foreign markets could mean new tariffs of 10, 20% or sometimes even more on key UK exports, such as cars ": [
  -1,
  "peer",
  [
   "new",
   "key",
   "pro",
   "preferential",
   "European",
   "foreign",
   "such",
   "-"
  ],
  [
   "more",
   "Always",
   "sometimes",
   "even"
  ],
  [
   "could",
   "losing",
   "mean",
   "warned",
   "has"
  ]
 ],
 "He said: “There is not doubt that an exit will change the ground rules for businesses that have invested heavily in the North East. Blocking access to a European market of 500 million will leave these businesses in trouble.” ": [
  -1,
  "He",
  [],
  [],
  [
   "said"
  ]
 ],
 "Lord Mandelson acknowledged that many people have concerns over accountability to the EU and its reach. ": [
  0,
  "Lord Mandelson",
  [],
  [],
  [
   "acknowledged"
  ]
 ],
 "“But leaving it won’t make it any better,” he added. “Prices will go up, exports will go down, the economy will suffer, jobs will be lost and the NHS will suffer. ": [
  0,
  "he",
  [
   "“"
  ],
  [],
  [
   "added"
  ]
 ],
 "“This is the clear reality of what leaving the EU would mean for Great Britain. It people are willing to pay that price and still leave, that’s their decision. ": [
  -1,
  "This",
  [
   "clear"
  ],
  [],
  [
   "mean",
   "would",
   "is",
   "leaving"
  ]
 ],
 "“But I believe the price we would pay in our economy would be too great.” ": [
  -1,
  "I",
  [],
  [],
  [
   "believe"
  ]
 ],
 "Lord Mandelson was speaking as the Remain campaign stepped up warnings surrounding the cost of Brexit to the UK’s economy. ": [
  0,
  "Lord Mandelson",
  [],
  [],
  [
   "was",
   "speaking"
  ]
 ],
 "David Cameron has said the Government might not be able to protect spending on pensions, the NHS and defence in the long term if the UK leaves the EU. ": [
  0,
  "David Cameron",
  [
   "long"
  ],
  [],
  [
   "has",
   "said"
  ]
 ],
 "The Prime Minister said Brexit could cause a “black hole” in the public finances and threaten the “triple lock” guaranteeing state pension increases. ": [
  0,
  "Prime Minister",
  [],
  [],
  [
   "said"
  ]
 ],
 "He said “our economy would be smaller” if the UK left the single market, leading to “difficult choices”. ": [
  -1,
  "He",
  [],
  [],
  [
   "said"
  ]
 ],
 "Vote Leave said the latest warning was nothing more than “a frantic attempt to rescue a failing campaign”. ": [
  -1,
  "Vote Leave",
  [],
  [],
  [
   "said"
  ]
 ],
 "But Lord Mandelson urged North East voters to go with their gut instincts on June 23. ": [
  0,
  "Lord Mandelson",
  [],
  [],
  [
   "go",
   "urged"
  ]
 ],
 "He added: “A lot of people are sick of claims and counter claims. I would say, if they don’t like what the experts are telling them, just do what your gut tells you. ": [
  -1,
  "He",
  [],
  [],
  [
   "added"
  ]
 ],
 "“The whole country has to make a decision that we have to live with for the rest of our lives.” ": [
  -1,
  "country",
  [
   "whole"
  ],
  [],
  [
   "has"
  ]
 ],
 "Mr Cameron said on Sunday that forecasts from the Institute for Fiscal Studies suggested Brexit could lead to a shortfall in the public finances of between £20bn and £40bn which would need to be “filled” - either by tax rises, borrowing or spending cuts. The European Union debate": [
  0,
  "Mr Cameron",
  [],
  [],
  [
   "said"
  ]
 ],
 "What does the rest of Europe think about the Brexit debate? To find out, we spoke to a French journalist who visited the North East to cover the EU referendum for her newspaper. MIKE KELLY reports. ": [
  -1,
  "rest",
  [],
  [],
  [
   "think",
   "does"
  ]
 ],
 "For many, particularly in the UK regions, the feeling is the Brexit debate has become a London-centric face off between Tory party factions. ": [
  -1,
  "feeling",
  [
   "many"
  ],
  [
   "particularly"
  ],
  [
   "is"
  ]
 ],
 "It’s David Cameron and George Osborne versus Boris Johnson and Michael Gove, with UKIP’s Nigel Farage the between rounds entertainment. ": [
  -1,
  "It",
  [],
  [],
  [
   "rounds",
   "’s"
  ]
 ],
 "That’s not to decry the efforts of the campaign groups working day and night to educate a public on a steep learning curve about what the EU means to them. ": [
  -1,
  "That",
  [],
  [],
  [
   "’s"
  ]
 ],
 "However the British media seems, by and large, to have locked into the ‘Tory party bun fight’ narrative. ": [
  -1,
  "media",
  [
   "British",
   "large"
  ],
  [
   "However"
  ],
  [
   "seems",
   "fight",
   "locked",
   "have"
  ]
 ],
 "So it was a pleasant surprise that journalist Cecile Reto, of the French newspaper Ouest France, chose to ignore London and came to Newcastle and the North East to get a perspective on what the EU referendum means to the public. ": [
  -1,
  "it",
  [],
  [
   "So"
  ],
  [
   "was"
  ]
 ],
 "“The reason I came to Newcastle was because of Nissan, which I saw as a big EU company in a region which has been touched by so much austerity,” said Cecile. “I wanted to give our readers a different view other than that of London.” ": [
  -1,
  "Cecile",
  [],
  [],
  [
   "said"
  ]
 ],
 "We are talking, via an interpreter, at the Bridge Hotel in the shadow of the castle from which Newcastle got its name. ": [
  -1,
  "We",
  [],
  [],
  [
   "are",
   "talking"
  ]
 ],
 "She was a few days into a one week stay and said it had proved both a rewarding and enlightening experience. ": [
  -1,
  "She",
  [
   "few"
  ],
  [],
  [
   "was"
  ]
 ],
 "She said: “I’ve been surprised by the answers I have got. A lot of people say their views about leaving or remaining in the EU are not about their politics but personal opinions.” ": [
  -1,
  "She",
  [],
  [],
  [
   "said"
  ]
 ],
 "This could be bad news for the Remain group, if the perception of political party allegiance is anything to go by. ": [
  -1,
  "This",
  [
   "bad"
  ],
  [],
  [
   "be",
   "could"
  ]
 ],
 "For weeks now since the campaigning began in earnest it has not just seemed to be the main topic of debate in the UK. Hardly a days go by without some politician from abroad having their say. ": [
  -1,
  "it",
  [
   "main"
  ],
  [
   "not",
   "just",
   "now"
  ],
  [
   "has",
   "be",
   "seemed"
  ]
 ],
 "So, the whole world knows what’s happening here and has an opinion? Perhaps, not. ": [
  -1,
  "world",
  [
   "whole"
  ],
  [
   "So"
  ],
  [
   "knows",
   "has"
  ]
 ],
 "Cecile said: “Some French people don’t even know the referendum is happening. ": [
  -1,
  "Cecile",
  [],
  [],
  [
   "said"
  ]
 ],
 "“Those who do know are quite divided. They think if the UK does leave it will be the beginning of the end and other countries will leave too. Others think ‘it’s those Brits again, they’ve never liked the EU’.” ": [
  -1,
  "Those",
  [
   "divided"
  ],
  [
   "quite"
  ],
  [
   "are"
  ]
 ],
 "From a personal point of view, Cecile said she is worried at the thought of the UK leaving, especially with the growing migrant and financial crises in Europe. ": [
  -1,
  "Cecile",
  [
   "personal"
  ],
  [],
  [
   "said"
  ]
 ],
 "“If the UK leaves it could show Europe doesn’t have a place and it would give the narrative to UKIP and the (extreme right) Front National in France.” ": [
  -1,
  "it",
  [],
  [
   "n’t"
  ],
  [
   "have",
   "could",
   "show"
  ]
 ],
 "She added: “I’m scared not just for economic reasons but for those European values upon which the EU is based that are at risk - peace and friendship between neighbouring countries, and security.” ": [
  -1,
  "She",
  [],
  [],
  [
   "added"
  ]
 ],
 "And Cecile added that for those in France who have been paying attention to what’s happening in the UK, it has caused them to think more deeply about their position within it. ": [
  -1,
  "Cecile",
  [],
  [],
  [
   "added"
  ]
 ],
 "“They have started asking questions about a referendum in France. But I think as it stands about 37% would vote to leave and 60% would vote to stay but I think that 37% are trying to stoke the fires a bit. ": [
  -1,
  "They",
  [],
  [],
  [
   "started",
   "have",
   "asking"
  ]
 ],
 "“Even then, if it came to it, I think they’d vote to stay. The danger isn’t real in France.” ": [
  -1,
  "I",
  [],
  [
   "then",
   "Even"
  ],
  [
   "think"
  ]
 ],
 "She added: “We can’t actually imagine a Brexit happening. A lot of French people are convinced that at the last minute people are going to turn out and be reasonable and vote to stay.” ": [
  -1,
  "She",
  [],
  [],
  [
   "added"
  ]
 ],
 "Cecile laughed at the “be reasonable and vote stay” line, branding it “French arrogance.” AP Photo/Remy de la Mauviniere Far right party National Front leader Marine Le Pen ": [
  -1,
  "Cecile",
  [
   "reasonable",
   "French"
  ],
  [],
  [
   "branding",
   "be",
   "laughed",
   "stay"
  ]
 ],
 "“I’ve got colleagues working in Normandy who say there’s been an increase in people wanting to become naturalised French citizens since the start of the year,” she said. ": [
  1,
  "she",
  [],
  [],
  [
   "said"
  ]
 ],
 "And Cecile assumes this could be being repeated across a country where around 200,000 Brits have homes. So popular is it with ex-pats that Dordogne in the south west of France has been nicknamed Dordogneshire. ": [
  -1,
  "Cecile",
  [],
  [],
  [
   "assumes"
  ]
 ],
 "Cecile said: “I’ve worked in a few different offices and remember in Mayenne in the Loire department I went into a village that had more English schoolchildren than it did French children. It was a very small school, but it was funny all the same. ": [
  -1,
  "Cecile",
  [],
  [],
  [
   "said"
  ]
 ],
 "“And I’ve noticed that a number of English people have now been elected as councillors in French councils.” ": [
  -1,
  "’ve",
  [
   "English",
   "French"
  ],
  [
   "now"
  ],
  [
   "noticed",
   "elected",
   "been",
   "’ve",
   "have"
  ]
 ],
 "So it seems after 1066 when French king William conquered England, if there’s a Brexit in 2016 there might be a British invasion of sorts in the opposite direction. The European Union debate": [
  -1,
  "it",
  [
   "opposite",
   "British"
  ],
  [
   "there",
   "So"
  ],
  [
   "seems",
   "be",
   "might"
  ]
 ],
 "The electoral commission has moved to allay worries over voting with a pencil after conspiracy theories started to appear on social media. ": [
  -1,
  "commission",
  [
   "electoral"
  ],
  [],
  [
   "moved",
   "has"
  ]
 ],
 "Worried voters, mainly Leave campaign supporters, have taken to social media to urge people to #UsePens to vote out of the EU , fearing pencil votes on ballot papers could be rubbed out. ": [
  -1,
  "voters",
  [
   "social",
   "Worried"
  ],
  [
   "mainly"
  ],
  [
   "urge",
   "be",
   "could",
   "rubbed",
   "Leave",
   "fearing",
   "vote",
   "taken",
   "have"
  ]
 ],
 "A spokesperson for the electoral commission reiterated that there is no law to say whether voters should use a pen or a pencil in polling stations. ": [
  -1,
  "spokesperson",
  [
   "electoral"
  ],
  [],
  [
   "reiterated"
  ]
 ],
 "“If someone wants to use a pen that is fine,” the spokesperson said. “We would say be careful that the ink has dried before they fold the ballot paper in case it smudges, people just need to make sure their mark is clear and we would ask them to take their pen out of the polling booth with them.” Simon Greener Polling stations across the region for the EU referendum St Andrews Newcastle ": [
  -1,
  "spokesperson",
  [],
  [],
  [
   "said"
  ]
 ],
 "Gateshead voter Anthony Cummings said he was shocked to find only pencils at the polling station in Felling, Gateshead . ": [
  0,
  "Anthony Cummings",
  [
   "only"
  ],
  [
   "Gateshead"
  ],
  [
   "find",
   "was",
   "shocked",
   "said"
  ]
 ],
 "He said: “I refuse to use a pencil, I asked someone and thankfully they were able to lend me a pen so I could cast my vote. ": [
  -1,
  "He",
  [],
  [],
  [
   "said"
  ]
 ],
 "“I think it would be so easy for them to rub it out, it should be in ink, I am 54 years old and this is the most important vote of my lifetime. I am sure I have used a pen every other election.” ": [
  -1,
  "I",
  [
   "old"
  ],
  [],
  [
   "am"
  ]
 ],
 "He said: “When I went in, it was just pencils and I thought ‘why? There’s no reason?’ ": [
  -1,
  "He",
  [],
  [],
  [
   "said"
  ]
 ],
 "“I checked and found out you can use pens, so I decided to make sure other people knew that too by sitting outside today, handing them out. ": [
  -1,
  "I",
  [],
  [],
  [
   "checked"
  ]
 ],
 "“A lot of people have brought their own pens because of what’s been on the internet, but a lot haven’t and were happy to get one to take in.” ": [
  -1,
  "lot",
  [
   "own"
  ],
  [],
  [
   "brought",
   "have"
  ]
 ],
 "Brexit supporter Jacqueline Jackson even filmed the moment that she was questioned by a police officer in Chichester, claiming police were called by Remain voters who saw her handing out pens. ": [
  1,
  "Jacqueline Jackson",
  [],
  [
   "even"
  ],
  [
   "was",
   "questioned",
   "filmed"
  ]
 ],
 "The counting of the votes will begin at the 382 stations across the UK soon after the polls close at 10pm, and we will know the outcome of the referendum on Friday, June 24. ": [
  -1,
  "counting",
  [],
  [],
  [
   "will",
   "begin"
  ]
 ],
 "Below, we’ve taken a look at what happens if the public chooses a Brexit. ": [
  -1,
  "we",
  [],
  [
   "Below"
  ],
  [
   "taken",
   "’ve"
  ]
 ],
 "EU Referendum LIVE: Updates as the North East heads to the polls How long would it take to leave? ": [
  -1,
  "EU Referendum",
  [],
  [],
  [
   "LIVE"
  ]
 ],
 "If the majority of the nation’s votes decide that Britain will leave the EU, it is likely that a domino effect will ensue, both inside the UK and globally, causing several occurrences to happen at once. Some sources suggest it is possible that David Cameron will resign as prime minister in order to make way for another Tory leader in favour of the out vote, who will begin the Brexit process. ": [
  -1,
  "it",
  [],
  [],
  [
   "is"
  ]
 ],
 "Likely candidates for a replacement PM include Boris Johnson, Theresa May, and Michael Gove. What are the next steps involved in the UK’s leaving process? ": [
  -1,
  "candidates",
  [
   "Likely"
  ],
  [],
  [
   "include"
  ]
 ],
 "British politicians would begin in-depth renegotiations with Europe and would be forced to set up new trade agreements both with Europe and the rest of the world. There is a possibility that EU leaders will complicate this process to deter any other EU member states from following in Britain’s example. Geoff Caddick/PA Wire Former prime minister Gordon Brown takes part in a Britain Stronger In Europe rally in Birmingham ahead of the EU referendum What major changes would occur? ": [
  -1,
  "politicians",
  [
   "British",
   "new"
  ],
  [],
  [
   "be",
   "forced",
   "begin",
   "would",
   "set"
  ]
 ],
 "Nobody can say for certain what impacts Brexit would have on the UK, and it may take years for the effects to be keenly felt, as the process would be a gradual one. The economic repercussions of Brexit are likely to be substantial, due to the fact that most financial markets believe that Britain will vote to remain. ": [
  -1,
  "Nobody",
  [
   "certain"
  ],
  [],
  [
   "say",
   "can"
  ]
 ],
 "If the UK leaves the EU, it is probable that the value of the pound would drop even lower than it has in the lead up to the referendum. Share prices will also fall noticeably, particularly banking stocks and multinationals. The Bank of England may increase interest rates in order to stop the sterling plummeting any further, which would affect the general public in the form of higher costs of mortgages and loans. ": [
  -1,
  "it",
  [
   "probable"
  ],
  [],
  [
   "is"
  ]
 ],
 "Many British laws and acts will have to be reassessed and potentially rewritten, as many of them coincide with EU legislation. These laws cover a tremendous variety of issues, including employment rights, environmental protection, and migration. However, if Britain chose to adopt Norway’s model and remain in the European Economic Area, most of the EU-derived laws would be maintained. Video loading Click to play Tap to play The Live Event you are trying to watch is either unavailable or has not started Please refresh this page in your browser to reload this live event video What would happen in Europe and the EU? ": [
  -1,
  "laws",
  [
   "Many",
   "British"
  ],
  [],
  [
   "will",
   "have"
  ]
 ],
 "On June 28 and 29, EU leaders will meet to discuss the result, and if Brexit prevails, Britain will cause the EU’s Article 50 to take effect; the law that would set in motion the two-year period of the UK’s political detachment from the EU. ": [
  -1,
  "EU leaders",
  [],
  [],
  [
   "discuss",
   "will",
   "meet"
  ]
 ],
 "However, Eurosceptic cabinet minister Chris Grayling says that Article 50 should not be triggered immediately, which could set back the final Brexit to 2019. ": [
  0,
  "Chris Grayling",
  [
   "Eurosceptic"
  ],
  [
   "However"
  ],
  [
   "says"
  ]
 ],
 "An emergency summit may also be convened in the EU should Vote Leave succeed, alongside an emergency meeting of eurozone finance ministers. A Brexit result would hugely impact the global economy at large. ": [
  -1,
  "Leave",
  [
   "eurozone"
  ],
  [
   "also"
  ],
  [
   "be",
   "convened",
   "succeed",
   "Vote",
   "should",
   "may"
  ]
 ],
 "Certainly, upon a confirmation of Britain’s out vote, EU leaders will be hard at work defending the integrity of the Union, and its values, as Eurosceptic politicians from across Europe will use a Brexit outcome to promote their own independence from the entity, such as anti-EU populist parties in France, Germany and the Netherlands, which all have crucial elections in 2017. The European Union debate": [
  -1,
  "EU leaders",
  [
   "hard"
  ],
  [
   "Certainly"
  ],
  [
   "defending",
   "will",
   "be"
  ]
 ],
 "The vote to Leave is not actually legally binding as it is parliament and not the voters who make that decision. ": [
  -1,
  "vote",
  [
   "binding"
  ],
  [
   "legally",
   "not",
   "actually"
  ],
  [
   "is"
  ]
 ],
 "Legal experts have pointed out the Brexit vote is “advisory,” not “mandatory”. ": [
  -1,
  "experts",
  [
   "Legal",
   "advisory",
   "mandatory"
  ],
  [
   "not"
  ],
  [
   "pointed",
   "have"
  ]
 ],
 "As such MPs can legally disregard the public’s will and decide the path Britain chooses. So what could happen next? ": [
  -1,
  "MPs",
  [
   "public",
   "such"
  ],
  [
   "legally"
  ],
  [
   "disregard",
   "will",
   "can"
  ]
 ],
 "The options of course include supporting the result but on the flipside MPs can choose to ignore it. Pro-EU ministers have an overwhelming cross-party support in parliament, with less than 200 of the 650 MPs supporting the Leave campaign. ": [
  -1,
  "options",
  [],
  [],
  [
   "supporting",
   "include"
  ]
 ],
 "A Commons vote could put pressure on the government to keep the UK inside the single market. ": [
  -1,
  "Commons vote",
  [
   "single"
  ],
  [],
  [
   "put",
   "keep",
   "could"
  ]
 ],
 "Another option is to renegotiate a deal with the EU making it more palatable to the British public and then holding another referendum. ": [
  -1,
  "option",
  [],
  [
   "then"
  ],
  [
   "making",
   "holding",
   "is",
   "renegotiate"
  ]
 ],
 "Fanciful, you might think. But here’s the thing. In February Boris Johnson, the early favourite to replace David Cameron as Prime Minister, intimated just that. ": [
  -1,
  "you",
  [
   "Fanciful"
  ],
  [],
  [
   "might",
   "think"
  ]
 ],
 "In his Daily Telegraph column he wrote: “EU history shows that they only really listen to a population when it says ‘no’”. Video loading Click to play Tap to play The Live Event you are trying to watch is either unavailable or has not started Please refresh this page in your browser to reload this live event video ": [
  0,
  "he",
  [],
  [],
  [
   "wrote"
  ]
 ],
 "He has previously suggested that only by voting to Leave would the country “get the change we need”. This was widely interpreted as advocating a second referendum. ": [
  -1,
  "He",
  [],
  [
   "previously"
  ],
  [
   "has",
   "suggested"
  ]
 ],
 "However he later back tracked, saying “out was out”. ": [
  0,
  "he",
  [],
  [
   "later",
   "back",
   "However",
   "out"
  ],
  [
   "tracked",
   "was",
   "saying"
  ]
 ],
 "This is if MPs forced a general election and a party campaigned on a promise to keep Britain in the EU, got elected and then claimed that the election mandate topped the referendum one. How likely would that be? ": [
  -1,
  "This",
  [],
  [],
  [
   "is"
  ]
 ],
 "Very unlikely, say experts. ": [
  -1,
  "experts",
  [
   "unlikely"
  ],
  [
   "Very"
  ],
  [
   "say"
  ]
 ],
 "Many commentators, argue it would be “political suicide” if the government were to dismiss the result of a democratic vote. ": [
  -1,
  "commentators",
  [
   "Many"
  ],
  [],
  [
   "argue"
  ]
 ],
 "It is only when Article 50 is invoked that it all become legally binding, the timing of which is something Mr Cameron has left to his successor. ": [
  -1,
  "timing",
  [],
  [],
  [
   "is"
  ]
 ],
 "Thousands of voters across the North East will be making their way to polling stations to have their say on the EU referendum . ": [
  -1,
  "Thousands",
  [],
  [],
  [
   "will",
   "making",
   "be"
  ]
 ],
 "Experts are saying the result will be too close to call, even after a gruelling 10-week campaign. ": [
  -1,
  "Experts",
  [],
  [],
  [
   "are",
   "saying"
  ]
 ],
 "Prime Minister David Cameron is backing Remain, while Boris Johnson is the Brexit camp’s highest profile politician. ": [
  0,
  "Prime David Minister Cameron",
  [],
  [],
  [
   "backing",
   "is"
  ]
 ],
 "Polling stations in the North East opened their doors at 7am on Thursday, but what time do they close? What time do the polls shut? ": [
  -1,
  "stations",
  [],
  [],
  [
   "opened"
  ]
 ],
 "Polls will shut at 10pm. Is this the same for other election? ": [
  -1,
  "Polls",
  [],
  [],
  [
   "will",
   "shut"
  ]
 ],
 "Experts say the soonest we will know is around 6am or 7am on Friday, but we could have indications of the result sooner than that. ": [
  -1,
  "Experts",
  [],
  [],
  [
   "say"
  ]
 ],
 "Although there are no official exit polls, some private companies will be doing them, and then using their knowledge to gamble on the outcome. ": [
  -1,
  "companies",
  [
   "official",
   "private"
  ],
  [
   "then",
   "there"
  ],
  [
   "doing",
   "will",
   "be",
   "are",
   "gamble",
   "using"
  ]
 ],
 "This could give an early indication of the result. What is the question on the ballot paper? ": [
  -1,
  "This",
  [
   "early"
  ],
  [],
  [
   "give",
   "could"
  ]
 ],
 "“Should the United Kingdom remain a member of the European Union or leave the European Union?” ": [
  0,
  "United Kingdom",
  [],
  [],
  [
   "Should",
   "remain",
   "leave"
  ]
 ],
 "You then place a cross in the box of your choice.": [
  -1,
  "You",
  [],
  [
   "then"
  ],
  [
   "place"
  ]
 ],
 "The UK Government has one of the largest budget deficits of any advanced economy, with public sector net debt excluding banks reaching £1,606.9 billion, according to the Office for National Statistics (ONS). That debt is equivalent to 83.7% of the UK’s economic output, known as gross domestic product (GDP).The ONS said the Chancellor borrowed £74.9 billion for the financial year ending in March, overshooting the annual target by £2.7 billion.It was a setback for George Osborne in his efforts to shore up the nation’s finances after he pledged to return the UK to a surplus by 2020.The ratings agencies are concerned Brexit will make this plan harder to achieve, particularly as they predict economic growth will be stunted and uncertainty over trade arrangements will be prolonged while Britain negotiates to leave the EU. 11:19 Tom Eden UK's credit rating downgraded ": [
  -1,
  "UK Government",
  [
   "public",
   "net",
   "advanced",
   "largest"
  ],
  [],
  [
   "has",
   "reaching",
   "excluding",
   "according"
  ]
 ],
 "The financial shockwaves of the Brexit vote have begun to reverberate as the outlook on Britain’s credit rating was downgraded to “negative”.Ratings agency Moody’s changed the UK’s long-term issuer and debt ratings to negative from stable due to uncertainty after the vote to leave the European Union.Another leading agency, Standard and Poor’s (S&P), also warned that Britain could lose its AAA rating following the referendum result.Moody’s and another ratings agency, Fitch, had already stripped Britain of its AAA rating before the referendum. But what does it mean for the UK? ": [
  -1,
  "shockwaves",
  [
   "financial"
  ],
  [],
  [
   "was",
   "downgraded",
   "reverberate",
   "begun",
   "have"
  ]
 ],
 "I’ll be posting some Q&As now. 11:11 Tom Eden ": [
  -1,
  "I",
  [],
  [
   "now"
  ],
  [
   "posting",
   "be"
  ]
 ],
 "More than one million people have now signed an online petition calling for a new EU referendum. 11:00 Two women stuck in waist high mud at Blyth ": [
  -1,
  "people",
  [
   "online",
   "new",
   "More"
  ],
  [
   "now"
  ],
  [
   "calling",
   "signed",
   "have"
  ]
 ],
 "It took around an hour to free the stricken pair after they became stuck in an area of waist high mud, at Blyth Harbour, today. ": [
  -1,
  "It",
  [],
  [],
  [
   "stricken",
   "free",
   "took"
  ]
 ],
 "Flash floods hit Alnwick after a burst of heavy rain and lightning yesterday. Video loading Click to play Tap to play The Live Event you are trying to watch is either unavailable or has not started Please refresh this page in your browser to reload this live event video ": [
  -1,
  "Flash floods",
  [
   "heavy"
  ],
  [],
  [
   "hit"
  ]
 ],
 "Many of the town’s roads were impassable following the torrential downpour, with floodwater reaching the bonnets of some vehicles as they struggled to get through the water. ": [
  -1,
  "Many",
  [
   "Many",
   "impassable",
   "torrential"
  ],
  [],
  [
   "following",
   "were"
  ]
 ],
 "But most of the water dispersed as quickly as it appeared after several hours, but another warning has now been issued for storms today. Video loading Click to play Tap to play The Live Event you are trying to watch is either unavailable or has not started Please refresh this page in your browser to reload this live event video 10:42 Tom Eden Yellow weather warning issued ": [
  -1,
  "most",
  [
   "most"
  ],
  [
   "now"
  ],
  [
   "been",
   "dispersed",
   "has",
   "issued"
  ]
 ],
 "Some locations will miss the downpours, but where they do occur there is a risk of localised surface water flooding, especially in urban areas. ": [
  -1,
  "locations",
  [],
  [],
  [
   "miss",
   "will"
  ]
 ],
 "A parliamentary petition for a second referendum has attracted almost a million signatures despite unprecedented demand crashing the website. Petition for the UK to have a second EU referendum 10:31 Tom Eden How Newcastle are trying to improve their injury record ": [
  -1,
  "petition",
  [
   "second",
   "parliamentary",
   "unprecedented"
  ],
  [
   "almost"
  ],
  [
   "attracted",
   "has",
   "crashing"
  ]
 ],
 "Newcastle United will announce measures to tackle their long-standing injury problems next week – with the club set to appoint additional medical staff as part of Rafa Benitez’s backroom revamp. Newcastle United's Daryl Janmaat in pain after Southampton score their second goal ": [
  -1,
  "Newcastle United",
  [
   "additional",
   "medical"
  ],
  [
   "long"
  ],
  [
   "tackle",
   "will",
   "standing",
   "appoint",
   "announce",
   "set"
  ]
 ],
 "Newcastle are nearing their first new signing and hope to have new players in place by the first week of July, when most of the squad will be back from their summer break. But there is also work going on behind the scenes to improve scouting, injuries and the Academy. ": [
  -1,
  "Newcastle",
  [],
  [],
  [
   "are",
   "nearing"
  ]
 ],
 "To that end, Benitez and United will announce additional medical staff to enhance the medical care given to players in a bid to get to the bottom of problems which the United manager is acutely aware of. ": [
  0,
  "Benitez",
  [
   "additional",
   "medical"
  ],
  [],
  [
   "announce",
   "will"
  ]
 ],
 "The Spanish boss has been studying the injury data for the last few seasons and is fully aware that it does not make pretty reading for him or the club. Premierleagueinjuries.comestimated that United lost a collective 2,288 days to injury last season - the highest in the top flight. 10:26 Tom Eden Could the EU referendum results be overturned? ": [
  -1,
  "boss",
  [
   "few",
   "Spanish",
   "last"
  ],
  [],
  [
   "been",
   "studying",
   "has"
  ]
 ],
 "It’s been pretty gloomy over the past 24 hours since the result came in. ": [
  -1,
  "It",
  [
   "gloomy",
   "past"
  ],
  [
   "pretty"
  ],
  [
   "been"
  ]
 ],
 "On top of that, Leave campaigners have rowed back on lots of promises made in the referendum, including the £350m extra each week for the NHS, immediately triggering the process of withrawing from Europe and astonishingly their claims about stopping immigration: ": [
  -1,
  "Leave campaigners",
  [
   "extra"
  ],
  [
   "back",
   "immediately",
   "astonishingly"
  ],
  [
   "rowed",
   "stopping",
   "made",
   "triggering",
   "including",
   "have"
  ]
 ],
 "As such MPs can legally disregard the public’s will and decide the path Britain chooses.": [
  -1,
  "MPs",
  [
   "public",
   "such"
  ],
  [
   "legally"
  ],
  [
   "disregard",
   "will",
   "can"
  ]
 ],
 "Mrs Glass told how police warned her to avoid the count on referendum night as the individual or individuals who made the threats “would be expecting her there.” ": [
  1,
  "Mrs Glass",
  [],
  [],
  [
   "told"
  ]
 ],
 "Mrs Glass, who is Labour’s Shadow Minister for Europe, said that she would usually dismiss the individuals making the threats as nothing more than keyboard warriors but, in the aftermath of the death of Jo Cox, she said that threats had to be taken more seriously. ": [
  1,
  "Mrs Glass",
  [],
  [],
  [
   "said"
  ]
 ],
 "She said: “There were a number of death threats made against me and that’s as much as I know. I did not go to the referendum count on the advice of the police as they thought it was a place where people would expect me to be. ": [
  -1,
  "She",
  [],
  [],
  [
   "said"
  ]
 ],
 "“I thought it was just individuals sitting on their keyboards making threats, but after what happened to Jo you have to take more precautions, especially for your family,” ": [
  -1,
  "I",
  [],
  [],
  [
   "thought"
  ]
 ],
 "She added: “I was the Shadow Minister for Europe so naturally I came in for a bit more focus, but one email was sent to my family - that is just beyond the pale.” ": [
  -1,
  "She",
  [],
  [],
  [
   "added"
  ]
 ],
 "Mrs Glass called for calm following the vote for Brexit on Friday morning. She said: “This has been a very difficult campaign with a massive polarisation of opinion. ": [
  1,
  "Mrs Glass",
  [],
  [],
  [
   "following",
   "called"
  ]
 ],
 "“I really do think it has brought the best and worst out in people. I have never experienced anything like it in 40 years of campaigning - I would now like to see things return to some normality. ": [
  -1,
  "I",
  [],
  [
   "really"
  ],
  [
   "think",
   "do"
  ]
 ],
 "“In the North East, the majority of MPs campaigned to remain and the majority of the North East voted to leave so there now needs to be a time of reflection I think, I believe in democracy and we have to accept the result and move forward now.” More on the EU Referendum": [
  -1,
  "majority",
  [],
  [],
  [
   "campaigned",
   "remain"
  ]
 ],
 "Ayoze Perez insists he is “preparing to return” to his best with Newcastle United despite reports linking the forward with four Premier League sides. ": [
  0,
  "Ayoze Perez",
  [],
  [],
  [
   "insists"
  ]
 ],
 "The 22-year-old signed a new contract through until 2021 in January and he is determined to help the Magpies back into the top flight, having been a part of the side who were relegated to the Championship. ": [
  -1,
  "old",
  [
   "22-year",
   "new",
   "old"
  ],
  [],
  [
   "signed"
  ]
 ],
 "Asked about his future by Spanish publication El Dia the forward explained: “I have a contract [with Newcastle] until 2021, I was part of the relegation and I am preparing to return my best. ": [
  -1,
  "I",
  [],
  [],
  [
   "was"
  ]
 ],
 "“It was not a good year collectively or individually, but I scored some goals. ": [
  -1,
  "It",
  [
   "good"
  ],
  [
   "not",
   "collectively",
   "individually"
  ],
  [
   "was"
  ]
 ],
 "“You have to take the positives and think about what’s coming. ": [
  -1,
  "You",
  [],
  [],
  [
   "have"
  ]
 ],
 "“It’s going to be tough but in your career, a player must always jump over obstacles.” ": [
  -1,
  "It",
  [
   "tough"
  ],
  [],
  [
   "be",
   "going"
  ]
 ],
 "The Spaniard - who was appearing at a football clinic for children in Tenerife along with his brother Sammy, who plays for Team Northumbria - has also revealed he has not had time to digest the next that Britain will leave the European Union. ": [
  -1,
  "Spaniard",
  [],
  [
   "also"
  ],
  [
   "revealed",
   "has"
  ]
 ],
 "Post-Brexit, Perez would have been one of the nine current Magpies who United would have likely been unable to sign. ": [
  -1,
  "Perez",
  [],
  [],
  [
   "been",
   "would",
   "have"
  ]
 ],
 "Under current employment rules, any player with an EU passport is free to play in the UK without restriction, while those from outside Europe must meet specific Home Office criteria which depends on how many international appearances they have made and where their country sits in the FIFA rankings. ": [
  -1,
  "player",
  [
   "current",
   "free"
  ],
  [],
  [
   "play",
   "is"
  ]
 ],
 "That EU legislation allowed United to snap up Perez for just £1.5million from Tenerife two summers ago. ": [
  -1,
  "EU legislation",
  [],
  [],
  [
   "allowed"
  ]
 ],
 "Asked about Britain’s decision to leave the EU and how it could impact on his career, Perez replied: “I heard about, I have received some news about it, but being here on my vacation, it is not the time to dwell on that matter. ": [
  -1,
  "Perez",
  [],
  [],
  [
   "replied"
  ]
 ],
 "“I do not know [if it will impact on my future]. ": [
  -1,
  "I",
  [],
  [
   "not"
  ],
  [
   "know",
   "do"
  ]
 ],
 "“I do not want to think too much about what will happen, only training. ": [
  -1,
  "I",
  [],
  [
   "much",
   "not",
   "only",
   "too"
  ],
  [
   "want",
   "think",
   "do"
  ]
 ],
 "“I have not had a chance to discuss the matter with my teammates.” NUFC transfers - the latest news": [
  -1,
  "I",
  [],
  [
   "not"
  ],
  [
   "discuss",
   "had",
   "have"
  ]
 ],
 "North East employers need to know what the plan is for making sure the UK’s economy stays strong following last week’s Brexit vote, the region’s business leaders have warned. ": [
  -1,
  "leaders",
  [],
  [],
  [
   "warned",
   "have"
  ]
 ],
 "James Ramsbotham, Chief Executive of North East England Chamber of Commerce, said: “What business so desperately needs is to know what the road-map is, where it’s taking us and what the timescale is.” ": [
  0,
  "James Ramsbotham",
  [],
  [],
  [
   "said"
  ]
 ],
 "He was speaking after Chancellor George Osborne attempted to steady nerves with a speech revealing that the Treasury had been working on a plan for Brexit for weeks. ": [
  -1,
  "He",
  [],
  [],
  [
   "was",
   "speaking"
  ]
 ],
 "It followed criticism that he had appeared to go to ground following last week’s referendum, when the country voted to leave the European Union, leaving uncertainty about who was actually running the country. James Ramsbotham, Chief Executive of the North East Chamber of Commerce ": [
  -1,
  "It",
  [],
  [],
  [
   "followed"
  ]
 ],
 "Prime Minister David Cameron announced plans to resign following the ballot, although he continues in office until a replacement Conservative leader is elected. The Tory 1922 Committee, which will oversee the election, has announced that a new party leader - who will become Prime Minister - will be in place by September 2 at the latest. ": [
  0,
  "Prime David Minister Cameron",
  [],
  [],
  [
   "resign",
   "announced",
   "following"
  ]
 ],
 "Mr Ramsbotham praised Mark Carney, the Governor of the Bank of England, who delivered a reassuring statement on Friday shortly after the referendum result was announced. ": [
  0,
  "Mr Ramsbotham",
  [],
  [],
  [
   "praised"
  ]
 ],
 "And the Chamber leader said he welcome the Chancellor’s comments, but added:”Although he tried to reassure people by saying there was a plan, I think we’d like to see the details of said plan. ": [
  -1,
  "Chamber leader",
  [],
  [],
  [
   "said"
  ]
 ],
 "He said: “Businesses may not like it, but they can cope with anything as long as they know what it is. ": [
  -1,
  "He",
  [],
  [],
  [
   "said"
  ]
 ],
 "“But if there is a plan, nobody seems to know what it is - or not well enough to communicate it.” ": [
  -1,
  "nobody",
  [],
  [
   "there"
  ],
  [
   "seems",
   "is"
  ]
 ],
 "In his speech, Mr Osborne insisted: “I want to reassure the British people, and the global community, that Britain is ready to confront what the future holds for us from a position of strength. Chancellor George Osborne ": [
  0,
  "Mr Osborne",
  [],
  [],
  [
   "insisted"
  ]
 ],
 "“That is because in the last six years the government and the British people have worked hard to rebuild the British economy.” ": [
  -1,
  "That",
  [],
  [],
  [
   "is"
  ]
 ],
 "While he had campaigned for a remain vote, everyone had to accept that the public had voted to leave the European Union, Mr Osborne said. ": [
  0,
  "Mr Osborne",
  [],
  [],
  [
   "said"
  ]
 ],
 "“The Treasury, the Bank of England, and the Financial Conduct Authority have spent the last few months putting in place robust contingency plans for the immediate financial aftermath in the event of this result.” ": [
  -1,
  "Treasury",
  [
   "few",
   "immediate",
   "financial",
   "last",
   "robust"
  ],
  [],
  [
   "have",
   "spent",
   "putting"
  ]
 ],
 "He said the Treasury and the Prudential Regulation Authority, a Bank of England body which regulates banks, had “worked systematically with each major financial institution in recent weeks to make sure they were ready to deal with the consequences of a vote to leave.” ": [
  -1,
  "He",
  [],
  [],
  [
   "said"
  ]
 ],
 "Mr Osborne added: “It will not be plain sailing in the days ahead, but let me be clear. You should not underestimate our resolve. ": [
  0,
  "Mr Osborne",
  [],
  [],
  [
   "added"
  ]
 ],
 "“We were prepared for the unexpected. We are equipped for whatever happens.” ": [
  -1,
  "We",
  [
   "unexpected"
  ],
  [],
  [
   "prepared",
   "were"
  ]
 ],
 "He made no direct mention of plans for an “emergency budget” - despite warning during the referendum campaign that a vote for Brexit would force him to raise taxes and cut public spending. ": [
  -1,
  "He",
  [
   "direct",
   "despite"
  ],
  [],
  [
   "made"
  ]
 ],
 "But he appeared to hint that some action would be required, saying: “It is already evident that as a result of Thursday’s decision, some firms are continuing to pause their decisions to invest, or to hire people. ": [
  0,
  "he",
  [],
  [],
  [
   "be",
   "hint",
   "would",
   "required",
   "appeared"
  ]
 ],
 "“As I said before the referendum, this will have an impact on the economy and the public finances – and there will need to be action to address that.” ": [
  -1,
  "this",
  [
   "public"
  ],
  [
   "there"
  ],
  [
   "will",
   "be",
   "address",
   "have",
   "need"
  ]
 ],
 "Sterling continued its steep slide against the dollar on Monday as concerns about the British economy deepened. ": [
  -1,
  "Sterling",
  [
   "steep"
  ],
  [],
  [
   "continued"
  ]
 ],
 "The pound plunged 3.35% against the US currency to 1.32 dollars, following on from Friday’s 10% dive. ": [
  -1,
  "pound",
  [],
  [],
  [
   "plunged",
   "following"
  ]
 ],
 "Against the euro the pound was also down, falling 2.27% at 1.20 euro. ": [
  -1,
  "pound",
  [],
  [
   "also",
   "down"
  ],
  [
   "was",
   "falling"
  ]
 ],
 "Mr Osborne’s speech had contributed to a mini-rally early on Monday, but the gains soon evaporated and experts warned that months of uncertainty could see more volatility.": [
  0,
  "Mr Osborne ’s speech",
  [
   "mini"
  ],
  [
   "early"
  ],
  [
   "had",
   "contributed"
  ]
 ],
 "The challenge of Corbyn has been brewing since even before he was elected last September when crowds flocked to hear him speak, party membership rocketed and the expected runners and riders for the top job saw it slipping through their fingers. ": [
  -1,
  "membership",
  [],
  [],
  [
   "rocketed"
  ]
 ],
 "It was actually Copeland MP Jamie Reed who started the present leadership challenge eight months ago when he tweeted his resignation from the Shadow Cabinet as Corbyn made his victory speech. ": [
  -1,
  "It",
  [],
  [
   "actually"
  ],
  [
   "was"
  ]
 ],
 "Seldom has a week gone by since then without rumblings of fresh discontent about Corbyn’s performance at PMQs, his dress sense and not singing the national anthem, to name but a few gripes. ": [
  -1,
  "Seldom",
  [
   "few",
   "fresh",
   "national"
  ],
  [
   "then",
   "Seldom",
   "not",
   "by"
  ],
  [
   "has",
   "name",
   "gone",
   "singing"
  ]
 ],
 "Then last December the ‘Corbyn out’ campaign shifted gears when Hilary Benn delivered a memorable speech in the Commons calling for more military action in Syria after his leader delivered a less memorable one calling for the opposite. Labour Party leader Jeremy Corbyn leaves his home in north London ": [
  -1,
  "’",
  [
   "last"
  ],
  [
   "Then"
  ],
  [
   "Corbyn",
   "shifted"
  ]
 ],
 "If he is ousted in a ‘no confidence’ vote by his parliamentary colleagues despite the party members maintaining their confidence in him, it can have serious consequences. ": [
  -1,
  "it",
  [
   "parliamentary",
   "serious"
  ],
  [],
  [
   "ousted",
   "is",
   "can",
   "maintaining",
   "have"
  ]
 ],
 "It could be saying the voice of the people of Britain is nothing to that of a narrow, self seeking Westminster elite. More on the EU Referendum": [
  -1,
  "It",
  [],
  [],
  [
   "be",
   "saying",
   "could"
  ]
 ],
 "Washington and Sunderland West MP Sharon Hodgson has joined the rebellion against Jeremy Corbyn. ": [
  1,
  "Sharon Hodgson",
  [],
  [],
  [
   "has",
   "joined"
  ]
 ],
 "She resigned her post as Shadow Minister for Children and Families on Monday, condemning Mr Corbyn’s campaign against Brexit as “lacklustre” and saying he could not command the support of the wider parliamentary Labour Party. ": [
  -1,
  "She",
  [],
  [],
  [
   "resigned"
  ]
 ],
 "Announcing her decision on Twitter, the former Shadow Minister said she felt “great regret”. ": [
  0,
  "Shadow Minister",
  [
   "former"
  ],
  [],
  [
   "Announcing",
   "said"
  ]
 ],
 "In her resignation letter, she said that, although she had not supported Mr Corbyn ’s leadership campaign, she had welcomed the opportunity to serve on the front bench and had not taken the decision to stand down lightly. ": [
  1,
  "she",
  [],
  [],
  [
   "said"
  ]
 ],
 "But she said: “Now, more than ever, we need a united and effective opposition... and I am not confident that you can give us that leadership.” Labour Party leader Jeremy Corbyn leaves his home in north London ": [
  1,
  "she",
  [],
  [],
  [
   "said"
  ]
 ],
 "She added: “This is even more concerning now that the extent of your ambivalence and lacklustre campaigning to remain in the EU has come to light.” ": [
  -1,
  "She",
  [],
  [],
  [
   "added"
  ]
 ],
 "Expressing her concern that a snap election could approaching, she said that if the party were to face election under its current leadership it might be “fighting for its very existence” ": [
  1,
  "she",
  [],
  [],
  [
   "said"
  ]
 ],
 "She added: “I am concerned that this will leave the people we both came into politics to help and serve in a far worse position, abandoned for a generation.” ": [
  -1,
  "She",
  [],
  [],
  [
   "added"
  ]
 ],
 "Ms Hodgson called on Mr Corbyn to do “the honourable, decent and selfless thing” in stepping down. ": [
  0,
  "Ms Hodgson",
  [
   "honourable",
   "decent",
   "selfless"
  ],
  [],
  [
   "do",
   "stepping",
   "“",
   "called"
  ]
 ],
 "“I want you to be remembered as the Labour Leader who reinvigorated our membership,” she told him, “not the Labour Leader who irreparably broke the Party we both hold so dear.” ": [
  1,
  "she",
  [],
  [],
  [
   "told"
  ]
 ],
 "While 46 shadow front bench members, including Durham’s Roberta Blackman-Woods, have now stepped down, the resulting reshuffle has lead to top jobs for others from the region. Ian Forsyth/Getty Images Pat Glass MP ": [
  -1,
  "reshuffle",
  [
   "top"
  ],
  [],
  [
   "lead",
   "has",
   "resulting"
  ]
 ],
 "Pat Glass, the Labour MP for North West Durham, becomes the new Shadow Education Secretary. She had been the Shadow Europe Minister. ": [
  -1,
  "Pat Glass",
  [
   "new"
  ],
  [],
  [
   "becomes"
  ]
 ],
 "Easington MP Grahame Morris becomes Shadow Secretary of State for Communities and Local Government and Shadow Minister for the Constitutional Convention. ": [
  1,
  "Easington Grahame MP Morris",
  [],
  [],
  [
   "becomes"
  ]
 ],
 "Dave Anderson , Labour MP for Blaydon, is the new Shadow Northern Ireland Secretary. He was previously a party whip. ": [
  0,
  "Dave Anderson",
  [
   "new"
  ],
  [],
  [
   "is"
  ]
 ],
 "He has previously said he would stand again for election, if forced to step down, pointing to the large mandate he holds from grassroots labour members.": [
  -1,
  "He",
  [],
  [
   "previously"
  ],
  [
   "has",
   "said"
  ]
 ],
 "Some warned the economy might slow down and said the Government had to act swiftly to calm the uncertain months ahead. ": [
  -1,
  "Some",
  [],
  [],
  [
   "warned"
  ]
 ],
 "However, others were more optimistic, saying Britain needed a new start and would be all the better for Thursday's In/Out referendum. ": [
  -1,
  "others",
  [
   "optimistic"
  ],
  [
   "more",
   "However"
  ],
  [
   "were"
  ]
 ],
 "He said: \"In uncertain and worrying times we want the politicians to do their job, bring people together and stay calm. ": [
  -1,
  "He",
  [],
  [],
  [
   "said"
  ]
 ],
 "\"I think people are thinking very hard about whether to make big decisions. ": [
  -1,
  "I",
  [],
  [],
  [
   "think"
  ]
 ],
 "\"I'm not a doom-monger, and change brings opportunity, and opportunity brings potential growth and prosperity. ": [
  -1,
  "I",
  [],
  [
   "not"
  ],
  [
   "'m"
  ]
 ],
 "\"If we keep our heads and manage the situation, in the long term we might all benefit.\" ": [
  -1,
  "we",
  [
   "long"
  ],
  [
   "all"
  ],
  [
   "might",
   "benefit"
  ]
 ],
 "Jane Cowley, a partner at law firm Howes Percival, in Braunstone , said: \"Everybody I have spoken to is in a state of shock. ": [
  -1,
  "Jane Cowley",
  [],
  [],
  [
   "said"
  ]
 ],
 "\"I think there are business owners who have delayed making decisions pending the vote and I think everyone is now going to re-evaluate.\" ": [
  -1,
  "I",
  [],
  [],
  [
   "think"
  ]
 ],
 "Pete Patel, managing director of Asian snack maker Cofresh, in Leicester, said: \"Overall I'm very disappointed. I thought it was best for the country to stay in the EU. ": [
  0,
  "Pete Patel",
  [
   "Asian"
  ],
  [],
  [
   "managing",
   "said"
  ]
 ],
 "\"I think we're going to see a turbulent few weeks until the market calms down. ": [
  -1,
  "I",
  [],
  [],
  [
   "think"
  ]
 ],
 "\"But it is difficult to comment on what I think will happen in terms of currency and tariffs, as it is too early to say.\" ": [
  -1,
  "it",
  [
   "difficult"
  ],
  [],
  [
   "is"
  ]
 ],
 "Mike Kirsopp, chief executive at Cambridge and Counties business bank, based in New Walk, Leicester, was more optimistic. ": [
  0,
  "Mike Kirsopp",
  [
   "chief",
   "optimistic"
  ],
  [
   "more"
  ],
  [
   "was",
   "based"
  ]
 ],
 "He said: \"I think it was less a surprise than maybe others in my industry thought because the big sentiments for leave were in the Midlands and North where our business is focused. ": [
  -1,
  "He",
  [],
  [],
  [
   "said"
  ]
 ],
 "\"We prepared for both eventualities and always thought it would be close, but we are UK focused so do not have importers and exporters in volumes. ": [
  -1,
  "We",
  [],
  [],
  [
   "prepared"
  ]
 ],
 "\"We are planning for business as usual. ": [
  -1,
  "We",
  [
   "usual"
  ],
  [],
  [
   "planning",
   "are"
  ]
 ],
 "\"It always feels very raw in the first wave, but we've got months and years to sort this out.\" ": [
  -1,
  "It",
  [
   "first",
   "raw"
  ],
  [
   "always",
   "very"
  ],
  [
   "feels"
  ]
 ],
 "He said: \"It's going to be very good for the country to get its independence back. Europe does not particularly like us. ": [
  -1,
  "He",
  [],
  [],
  [
   "said"
  ]
 ],
 "\"I think we contribute more to the EU than we get back. ": [
  -1,
  "I",
  [],
  [],
  [
   "think"
  ]
 ],
 "\"I would say, for instance, because we are not in the monetary system we won't really lose much trade. ": [
  -1,
  "I",
  [],
  [],
  [
   "say",
   "would"
  ]
 ],
 "\"I voted for Cameron's Government. His idea was to be in Europe, and he knew how to steer the country then, but he is not the right persons to make the right decisions now we are leaving. I want Boris to take over. I trust him.\" ": [
  -1,
  "I",
  [],
  [],
  [
   "voted"
  ]
 ],
 "Sam Suffolk, operations director at metal working business CNC Direct Engineering in Countesthorpe, supplies Caterpillar among others. ": [
  -1,
  "Sam Suffolk",
  [],
  [],
  [
   "working",
   "supplies"
  ]
 ],
 "He said: \"We are a businesses who exports some of our products to Europe. The pound has always been a high value. ": [
  -1,
  "He",
  [],
  [],
  [
   "said"
  ]
 ],
 "\"Now that it is devaluing it is going to make anyone who exports competitive in the EU. ": [
  -1,
  "it",
  [],
  [
   "Now"
  ],
  [
   "devaluing",
   "is"
  ]
 ],
 "\"While the dust settles, we have got products people want and they are not going to stop wanting products from the UK.\" ": [
  -1,
  "we",
  [],
  [],
  [
   "got",
   "have"
  ]
 ],
 "A vote to leave the EU could tear apart the United Kingdom – the Bishop of Durham has warned. ": [
  -1,
  "Bishop",
  [],
  [],
  [
   "warned",
   "has"
  ]
 ],
 "Voters will go to the polls on June 23 for the once in a generation chance to vote on the UK’s future in the European Union and as the debate on whether to stay or go heats up the Bishop has spoken out. ": [
  -1,
  "Voters",
  [],
  [],
  [
   "vote",
   "go",
   "will"
  ]
 ],
 "The Right Reverend Paul Butler declared his support for the Remain campaign on Friday, speaking at Auckland Castle, the historic seat of the Bishop of Durham . ": [
  -1,
  "Paul Reverend Butler",
  [
   "historic",
   "Right"
  ],
  [],
  [
   "declared",
   "speaking"
  ]
 ],
 "Rt Rev Butler argued the country will need to do a great deal of “healing” after the referendum , no matter what the outcome of the vote. ": [
  -1,
  "Rev Rt Butler",
  [],
  [],
  [
   "argued"
  ]
 ],
 "He said: “What happens if Northern Ireland, Scotland and Wales vote to stay and England votes to leave? What if London votes to stay and other regions vote to leave? ": [
  -1,
  "He",
  [],
  [],
  [
   "said"
  ]
 ],
 "“The vote to leave raises serious concerns about the unity of the nation.” ": [
  -1,
  "vote",
  [
   "serious"
  ],
  [],
  [
   "raises",
   "leave"
  ]
 ],
 "ALSO READ: Brexit would cost North East universities £29m claim university bosses ": [
  -1,
  "Brexit",
  [],
  [
   "ALSO"
  ],
  [
   "would",
   "cost"
  ]
 ],
 "The North East’s most senior religious figure added his support to the remain campaign after months of thinking and praying, he said. ": [
  0,
  "he",
  [],
  [],
  [
   "said"
  ]
 ],
 "Rt Rev Butler said that he believes a vote to remain in the EU is the best thing for the UK as a whole. ": [
  -1,
  "Rev Rt Butler",
  [],
  [],
  [
   "said"
  ]
 ],
 "He said: “At our best Britain is a generous, welcoming, hospitable nation that has a wider role in the world. Being art of the EU is the best way to support and express that.” ": [
  -1,
  "He",
  [],
  [],
  [
   "said"
  ]
 ],
 "The Bishop, who sits in the House of Lords said his decision to come out and support one side of the referendum was partly driven by his disappointment at the rhetoric of the campaigns so far. ": [
  -1,
  "Bishop",
  [],
  [
   "so",
   "partly",
   "far"
  ],
  [
   "was",
   "driven",
   "come",
   "support",
   "said"
  ]
 ],
 "He said: “I have been very deeply concerned that this while debate has been reduced to being about economic and migration. ": [
  -1,
  "He",
  [],
  [],
  [
   "said"
  ]
 ],
 "“It is about peace, the well-being of ordinary people, how we engage with the world. It is much bigger than simply economics or migration. ": [
  -1,
  "It",
  [],
  [],
  [
   "is"
  ]
 ],
 "“I think a lot of the tone has been very unfortunate, it’s become too personalised in some instances. It’s become too focused on economics and migration when for me it’s about peace and wellbeing of nations together.” ": [
  -1,
  "it",
  [
   "personalised"
  ],
  [
   "too"
  ],
  [
   "become"
  ]
 ],
 "The Bishop refrained from giving voters direction how to vote and said: “People must make up their own minds and then go out and vote on the day.” ": [
  -1,
  "Bishop",
  [],
  [
   "how"
  ],
  [
   "vote",
   "refrained",
   "giving"
  ]
 ],
 "Earlier this week he signed a letter along with over 150 senior business leaders, who say the region could face financial difficulties if the nation voted to leave the EU. ": [
  0,
  "he",
  [],
  [
   "Earlier"
  ],
  [
   "signed"
  ]
 ],
 "He added: “For the North East, being part of the EU has been really important for manufacturing, for farming. We as a region feel the benefits of being in the EU. ": [
  -1,
  "He",
  [
   "important"
  ],
  [
   "really"
  ],
  [
   "been",
   "has",
   "being",
   "added"
  ]
 ],
 "“I believe it is the best thing for the North East, and the nation as a whole.” The European Union debate": [
  -1,
  "I",
  [],
  [],
  [
   "believe"
  ]
 ],
 "The Vote Leave campaign has taken to the skies above Leicester as the European Union referendum approaches. ": [
  -1,
  "Vote Leave campaign",
  [],
  [],
  [
   "taken",
   "has"
  ]
 ],
 "A plane circled the city centre at lunch time pulling a large banner urging people to cast a ballot for quitting the EU on Thursday. ": [
  -1,
  "plane",
  [
   "large"
  ],
  [],
  [
   "circled",
   "cast",
   "urging",
   "pulling",
   "quitting"
  ]
 ],
 "It has been touring the country ahead of the vote. ": [
  -1,
  "It",
  [],
  [
   "ahead"
  ],
  [
   "been",
   "has",
   "touring"
  ]
 ],
 "The firm's chief executive William Hynett said: \"The largest single threat to our business comes from EU directives and the other regulations imposed by its various institutions – these burdens are already forcing us to migrate part of our supply chain and some of our jobs outside the EU and we predict that this is a trend that is likely to continue should Britain choose to remain within the EU.\" ": [
  -1,
  "executive",
  [
   "chief"
  ],
  [],
  [
   "said"
  ]
 ],
 "Read more: Safety alert after more brutal robberies in Leicester's West End ": [
  -1,
  "alert",
  [
   "brutal",
   "more",
   "alert"
  ],
  [
   "more"
  ],
  [
   "Read"
  ]
 ],
 "Meanwhile Premier League champions Leicester City have backed remaining in the EU along with the other clubs in England's top flight. ": [
  0,
  "Leicester City",
  [
   "top",
   "other"
  ],
  [
   "Meanwhile"
  ],
  [
   "remaining",
   "backed",
   "have",
   "champions"
  ]
 ],
 "Premier League executive chairman Richard Scudamore said: \"There is an openness about the Premier League which I think it would be completely incongruous if we were to take the opposite position. ": [
  0,
  "Richard Scudamore",
  [],
  [],
  [
   "said"
  ]
 ],
 "\"We would just be, I think, respected less around the world for not wanting to be part of something.\" ": [
  -1,
  "We",
  [],
  [
   "less",
   "not",
   "just"
  ],
  [
   "respected",
   "would",
   "be",
   "wanting"
  ]
 ],
 "Former Foxes star Neil Lennon also backs the campaign to remain in Europe. ": [
  0,
  "Neil Lennon",
  [
   "Former"
  ],
  [
   "also"
  ],
  [
   "backs",
   "remain"
  ]
 ],
 "He said said: \"We need to continue to invest in talent at the grassroots and, for the thousands of young people starting out in their sport, every last penny is vital. ": [
  -1,
  "He",
  [],
  [],
  [
   "said"
  ]
 ],
 "\"At the moment, EU funding promotes UK sport at the local level and funding for school sport is essential too, and this is at risk if we decide to leave.\" ": [
  -1,
  "EU funding",
  [
   "local"
  ],
  [],
  [
   "promotes"
  ]
 ],
 "Today’s vote on whether we stay in the European Union will determine the future of the United Kingdom for generations to come. ": [
  -1,
  "vote",
  [],
  [],
  [
   "will",
   "determine",
   "come"
  ]
 ],
 "Right now, the future for the North East is bright. And the stakes are too high for a gamble which could change all that. ": [
  -1,
  "future",
  [
   "bright"
  ],
  [
   "Right",
   "now"
  ],
  [
   "is"
  ]
 ],
 "Because that’s exactly what a vote for Brexit is – a throw of the dice using North East jobs and our children’s future as gambling chips. ": [
  -1,
  "vote",
  [],
  [
   "exactly"
  ],
  [
   "using",
   "is",
   "’s"
  ]
 ],
 "Our busy ports are Britain’s gateway to the world. That’s why the North East is the only region with a positive balance of trade - meaning we export more than we import. ": [
  -1,
  "ports",
  [
   "busy"
  ],
  [
   "gateway"
  ],
  [
   "are"
  ]
 ],
 "Foreign firms such as Nissan have so much confidence in the North East that they’ve invested literally billions of pounds here, while the region is at the heart of the UK’s energy sector. Owen Humphreys/PA Wire Workers at Nissan's plant in Sunderland on the production line ": [
  -1,
  "firms",
  [
   "such",
   "Foreign"
  ],
  [],
  [
   "have"
  ]
 ],
 "The North East is home to 6,000 digital businesses. And with firms like Virgin Money in Newcastle, it also has a growing financial services industry. ": [
  0,
  "North East",
  [
   "digital"
  ],
  [],
  [
   "is"
  ]
 ],
 "We know there is poverty and other problems too. ": [
  -1,
  "We",
  [
   "other"
  ],
  [
   "too",
   "there"
  ],
  [
   "know",
   "is"
  ]
 ],
 "But the North East is proud and successful - and we can only tackle the challenges we face if we have a strong economy behind us. ": [
  0,
  "North East",
  [
   "proud",
   "successful"
  ],
  [],
  [
   "is"
  ]
 ],
 "The EU hasn’t held us back. It’s helped us. ": [
  -1,
  "EU",
  [],
  [
   "back",
   "n’t"
  ],
  [
   "held",
   "has"
  ]
 ],
 "Portobello Trade Park in Durham is one example. The Core Science Central in Newcastle city centre is another - and there are many more. ": [
  -1,
  "Trade Portobello Park",
  [],
  [],
  [
   "is"
  ]
 ],
 "It’s true that the UK contributes to the EU. Yes, we put money in and then get it back. ": [
  -1,
  "It",
  [
   "true"
  ],
  [],
  [
   "’s"
  ]
 ],
 "But the alternative is that spending decisions would be made by central government instead. And there’s no reason to imagine it would be more generous to the North East. ": [
  -1,
  "alternative",
  [
   "central"
  ],
  [
   "instead"
  ],
  [
   "be",
   "made",
   "is",
   "would",
   "spending"
  ]
 ],
 "The North East looks beyond Europe. ": [
  0,
  "North East",
  [],
  [],
  [
   "looks"
  ]
 ],
 "Managers at Newcastle Airport , a vital part of the economy with big plans for the future, will tell you that. ": [
  -1,
  "Managers",
  [
   "vital",
   "big"
  ],
  [],
  [
   "tell",
   "will"
  ]
 ],
 "Japanese firm Hitachi couldn’t have put it more plainly in its statement on the referendum, when it said: “Hitachi, like other multinationals, invested in the UK in order to access the whole of the EU market, and unimpeded access to the EU market is fundamental for our position in the UK.” AP Photo/Geert Vanden Wijngaert British Prime Minister David Cameron speaks ": [
  -1,
  "Hitachi",
  [
   "Japanese"
  ],
  [
   "more",
   "plainly",
   "n’t"
  ],
  [
   "put",
   "have"
  ]
 ],
 "What do anti-EU campaigners offer instead? A vague promise that if we quit then we’ll be able to negotiate a new deal giving us access to European markets again. ": [
  -1,
  "campaigners",
  [
   "anti",
   "-"
  ],
  [
   "instead"
  ],
  [
   "offer",
   "do"
  ]
 ],
 "This isn’t a game. This is a real threat to the prosperity and success of our industries, our institutions and our communities here in the North East. ": [
  -1,
  "This",
  [],
  [
   "n’t"
  ],
  [
   "is"
  ]
 ],
 "That’s why everyone from the heads of our universities to employers big and small, the region’s top scientists, premier league football clubs and the Bishop of Durham is urging Britain to vote to remain in the EU. ": [
  -1,
  "That",
  [],
  [],
  [
   "’s"
  ]
 ],
 "They say that millions of Turks are set to invade Britain if we stay in the EU. But this is just fearmongering. Turkey is not joining the EU for the foreseeable future, because of its poor human rights record. ": [
  -1,
  "They",
  [],
  [],
  [
   "say"
  ]
 ],
 "We can’t cut ourselves off from our neighbours. And we can’t put our jobs and exports at risk, as the leave campaign wants us to do. ": [
  -1,
  "We",
  [],
  [
   "n’t"
  ],
  [
   "cut"
  ]
 ],
 "The North East is strong and successful when it looks out across the world, trading, attracting investment and collaborating. ": [
  0,
  "North East",
  [
   "successful",
   "strong"
  ],
  [],
  [
   "is"
  ]
 ],
 "We do that best as part of the European Union. ": [
  -1,
  "We",
  [
   "best"
  ],
  [],
  [
   "do"
  ]
 ],
 "And that’s why the best way to safeguard the future of this region, our families and generations to come is to vote “remain” today. The European Union debate": [
  -1,
  "’s",
  [],
  [],
  [
   "remain"
  ]
 ],
 "As a result it could not have been more emphatic - 58% of North East voters were in favour of leaving the European Union, 42% to stay. ": [
  -1,
  "it",
  [],
  [
   "not"
  ],
  [
   "been",
   "have",
   "could"
  ]
 ],
 "Yet the North East is a Labour stronghold and Labour was for Remain. It has a strong union base and the TUC also came out for Remain. ": [
  0,
  "North East",
  [],
  [],
  [
   "is"
  ]
 ],
 "So why did the North East choose to ignore both the Labour party and the unions to vote for Brexit? ": [
  0,
  "North East",
  [],
  [
   "why",
   "So"
  ],
  [
   "vote",
   "choose",
   "did",
   "ignore"
  ]
 ]
}