{"organizations": [], "uuid": "e2a0f8dcd232cb7b5cd5b09a356c32a7ff141530", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article11826289.ece/ALTERNATES/s1200/JS91507950.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/north-east-mayor-900-million-11862144", "country": "GB", "domain_rank": 21960, "title": "North East mayor and £900 million devolution deal is scrapped", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "North East mayor and £900 million devolution deal is scrapped", "spam_score": 0.0, "site_type": "news", "published": "2016-09-09T01:32:00.000+03:00", "replies_count": 0, "uuid": "e2a0f8dcd232cb7b5cd5b09a356c32a7ff141530"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/north-east-mayor-900-million-11862144", "ord_in_thread": 0, "title": "North East mayor and £900 million devolution deal is scrapped", "locations": [], "entities": {"persons": [{"name": "nick forbes", "sentiment": "none"}, {"name": "stockton", "sentiment": "none"}, {"name": "sajid javid", "sentiment": "none"}, {"name": "guy opperman", "sentiment": "none"}, {"name": "javid", "sentiment": "none"}, {"name": "forbes", "sentiment": "none"}, {"name": "george osborne", "sentiment": "none"}, {"name": "anna", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "greater manchester", "sentiment": "none"}, {"name": "yorkshire", "sentiment": "none"}, {"name": "north-east", "sentiment": "none"}, {"name": "cleveland", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "sunderland civic centre", "sentiment": "none"}, {"name": "darlington", "sentiment": "none"}, {"name": "tees valley", "sentiment": "none"}, {"name": "north tyneside", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}, {"name": "south tyneside", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "liverpool", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "westminster", "sentiment": "none"}], "organizations": [{"name": "newcastle college’s rail academy", "sentiment": "none"}, {"name": "middlesbrough", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "gateshead council", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "north east combined authority", "sentiment": "none"}, {"name": "hexham", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "employment and skills", "sentiment": "none"}, {"name": "hartlepool", "sentiment": "none"}, {"name": "northern powerhouse", "sentiment": "none"}, {"name": "newcastle city council", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "liverpool", "sentiment": "none"}, {"name": "redcar", "sentiment": "none"}, {"name": "department", "sentiment": "none"}, {"name": "department for communities and local government", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "North East mayor and £900 million devolution deal is scrapped 18:32, 8 Sep 2016 The Government has run out of patience after council leaders repeatedly delayed agreeing a deal Shares Get daily news by email Anna Gowthorpe/PA Wire Business Secretary Sajid Javid \nPlans for a North East regional mayor and £900 million regional fund have been axed. \nThe Government announced it was giving up on the North East devolution package, after a majority of the region’s seven local councils voted against pressing ahead with it. \nLocal Government Secretary Sajid Javid said: “That deal is now off the table.” \nIt means that there will be no election for a North East mayor next year although other regions, such as Tees Valley, Greater Manchester, the Liverpool region and Birmingham, will vote for mayors on May 4, 2017. \nBut Mr Javid said he would seek to agree a new package, which could include extra funding, with Newcastle , Northumberland and North Tyneside councils, after they supported the devolution plan. \nLeaders of these three councils voted in favour of putting the package out to a public consultation - the next step in making it a reality - when the North East Combined Authority met at Sunderland Civic Centre on Tuesday. \nBut the proposal was defeated when the four leaders of Gateshead, Sunderland, Durham and South Tyneside councils voted not to go ahead unless they received more reassurances from the government over funding after the Brexit vote . \nThe Department for Communities and Local Government has now cancelled a Commons debate planned for Monday which was set to approve the legislation needed for the mayoral election to go ahead. \nMr Javid said he was “very disappointed” that four local authority leaders voted against implementing what he called the “pro-jobs devolution deal”. \nA statement issued by the Department named Durham, Gateshead, Sunderland, and South Tyneside as the four councils concerned. Chancellor George Osborne signs the Devolution agreement for the North East \nBut he said the local decision would be respected, and that the government stood ready to work with authorities in the North-East that share its aim to boost jobs and opportunities. \nHe said: “Local leaders in the North East Combined Authority have made a clear decision not to proceed with this ambitious and far-reaching devolution deal for their region – while I am disappointed, it is a decision I respect and so that deal is now off the table. \n“It is with regret that we have therefore withdrawn the legislation that would have brought this deal to life, which means local people will miss out on over £1 billion of investment, and new powers on transport, planning, and skills. \n“Handing power back to Northerners is a key part of our plans to build a Northern Powerhouse and our focus now will be on working to secure a new agreement for residents in those areas committed to progressing with devolution.” \nThe announcement has no impact on the separate Tees Valley devolution agreement, which involves Darlington, Hartlepool, Middlesbrough, Redcar and Cleveland and Stockton. Residents in those areas will elect their own regional mayor next year. \nThe North East deal included an infrastructure fund of £30m per year for 30 years, making £900 million in total, powers over bus franchising powers, strategic planning powers, joint responsibility for an Employment and Skills board and devolved skills funding for adults aged over 19. \nThe North East Combined Authority, led by the seven council leaders and chaired by the regional mayor, was due to run the infrastructure fund while the mayor would exercise other powers, such as control of bus services, in their own right. Read More Government accused of 'backtracking' over North East mayor deal \nGeorge Osborne, the former Chancellor, signed an interim deal with council leaders at Newcastle College’s Rail Academy in Gateshead in October 2015 - but progress was then delayed by a series of rows. \nGateshead Council pulled out in March. South Tyneside and Durham councils also expressed doubts, saying more talks with the Government were needed. \nSome councillors objected to the idea of a regional mayor. Ministers argue a significant package of funding and powers can only be devolved if there is an individual clearly responsible for them. \nMany Labour MPs also opposed the package, and accused the Government of forcing local leaders to take responsibility for funding cuts imposed at Westminster. \nBut other Labour politicians, such as Newcastle City Council leader Nick Forbes , were enthusiastic advocates for the deal. \nMr Forbes said he would work with any willing councils on a new devolution arrangement. \nConservative MP Guy Opperman , MP for Hexham, was also a strong supporter. \nHe said: “I am delighted that Newcastle, Northumberland and North Tyneside still wish to proceed with devolution. But I’m obviously disappointed that the four authorities south of the Tyne do not wish to proceed with this. \n“Why these four local authorities don’t want to run transport, skills and so much more for their local area I cannot comprehend. \n“The local authorities have to ask why they don’t want to proceed while many other authorities - like Labour controlled Greater Manchester, Yorkshire, Liverpool and others - have embraced devolution.”", "external_links": [], "published": "2016-09-09T01:32:00.000+03:00", "crawled": "2016-09-08T21:05:24.656+03:00", "highlightTitle": ""}