{"organizations": [], "uuid": "96a1ed22aae3e099498647959b69769204ffd63d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article11954733.ece/ALTERNATES/s1200/JS100991192.jpg", "site_section": "http://www.thejournal.co.uk/culture/?service=rss", "section_title": "nechronicle - What's On", "url": "http://www.chroniclelive.co.uk/whats-on/arts-culture-news/eye-catching-photos-appeared-walls-11954675", "country": "GB", "domain_rank": 21960, "title": "Why have eye-catching photos appeared on walls around Newcastle? Here's the answer", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Why have eye-catching photos appeared on walls around Newcastle? Here's the answer", "spam_score": 0.0, "site_type": "news", "published": "2016-09-29T18:34:00.000+03:00", "replies_count": 0, "uuid": "96a1ed22aae3e099498647959b69769204ffd63d"}, "author": "David Whetstone", "url": "http://www.chroniclelive.co.uk/whats-on/arts-culture-news/eye-catching-photos-appeared-walls-11954675", "ord_in_thread": 0, "title": "Why have eye-catching photos appeared on walls around Newcastle? Here's the answer", "locations": [], "entities": {"persons": [{"name": "stephenson", "sentiment": "neutral"}, {"name": "greg", "sentiment": "none"}, {"name": "kyla woods", "sentiment": "none"}, {"name": "hannah kirkham", "sentiment": "none"}, {"name": "gabriele", "sentiment": "none"}, {"name": "dysturb", "sentiment": "none"}, {"name": "greg khan", "sentiment": "none"}, {"name": "peter bauza", "sentiment": "none"}, {"name": "banksy", "sentiment": "none"}, {"name": "paolo", "sentiment": "none"}, {"name": "omar al bashir", "sentiment": "none"}, {"name": "marko", "sentiment": "none"}, {"name": "janina sabaliauskaite", "sentiment": "none"}, {"name": "hannah", "sentiment": "none"}, {"name": "michael bunel", "sentiment": "none"}, {"name": "paolo woods", "sentiment": "none"}, {"name": "gabriele galimberti", "sentiment": "none"}, {"name": "pierre morel", "sentiment": "none"}, {"name": "zied ben romohane", "sentiment": "none"}, {"name": "mary f. calvert", "sentiment": "none"}, {"name": "mary f calvert", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "calvert", "sentiment": "none"}, {"name": "pierre", "sentiment": "none"}, {"name": "marko risovic", "sentiment": "none"}, {"name": "adriane ohanesian", "sentiment": "none"}], "locations": [{"name": "newcastle", "sentiment": "none"}, {"name": "ellison place", "sentiment": "none"}, {"name": "gevgelija", "sentiment": "none"}, {"name": "new bridge street west", "sentiment": "none"}, {"name": "pascarola", "sentiment": "none"}, {"name": "lime street", "sentiment": "none"}, {"name": "darfur", "sentiment": "none"}, {"name": "central dafur", "sentiment": "none"}, {"name": "newcastle arts centre", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}, {"name": "norham house", "sentiment": "none"}, {"name": "ouseburn valley", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "macedonia", "sentiment": "none"}, {"name": "forth lane", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "tunisia", "sentiment": "none"}, {"name": "mettlaoui", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "panama", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "high bridge street", "sentiment": "none"}, {"name": "baltic 39", "sentiment": "none"}, {"name": "calais", "sentiment": "none"}, {"name": "higham place", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "balkan", "sentiment": "none"}, {"name": "sudan", "sentiment": "none"}, {"name": "costa mesa", "sentiment": "none"}, {"name": "usa", "sentiment": "none"}, {"name": "argentina", "sentiment": "none"}, {"name": "brazil", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}, {"name": "forth street", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "hadrian house", "sentiment": "none"}, {"name": "newbridge project", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "  \nOn a public-facing hoarding at the developing Stephenson Quarter in Newcastle , three people were posting up a billboard-sized black and white photograph, complete with caption. \nThere’s a good chance that the poster is still there now, along with others displayed at seven other locations around the city. \nThey are among the first signs of a festival called Hidden Civil War which is taking place across Newcastle from tomorrow and throughout October. \nIt sounds alarming. We’re not at war, are we? Not here, anyway. VIEW GALLERY \nWell, the people behind Hidden Civil War think it’s a question that gives rise to all sorts of other questions and is, at least, worthy of debate. \nThe festival, according to its dedicated newspaper, The Precariat, features a series of events “that expose, collate and present evidence of a Hidden Civil War in Britain today”. \nHannah Kirkham, one of those involved in the poster pasting, said the festival was planned before Brexit by the artists based at The NewBridge Project, formerly the office block known as Norham House on New Bridge Street West, Newcastle. \n“With Brexit happening it felt even more relevant,” said Hannah. Janina Sabaliauskaite Examples of photojournalism have been pasted up around Newcastle by Dysturb \n“The initial idea was to invite artists, activists and local groups to get involved in looking at the state of the world we find ourselves in.” \nThe idea of civil war at home, she said, had been highlighted by events including the Scottish referendum of 2014 and the turmoil in domestic politics which sees Jeremy Corbyn in charge of the Labour Party while seemingly at odds with many of his MPs. \nThrow austerity into the mix and the ongoing debates about tax havens, immigration and housing and there’s scope for, at the very least, a discussion. \nDysturb, founded in Paris in 2014, is one of the groups invited to Newcastle to take part in the festival, which was always intended to involve as many people across the city as possible. \nPierre Morel, the man with the stepladder, the brush and the bucket of paste, explained: “We’re all photojournalists and we were frustrated by the space we were getting in the newspapers. Janina Sabaliauskaite Examples of photojournalism have been pasted up around Newcastle by Dysturb \n“It seems there is less room in the regular newspapers now for strong images showing the reality of the world. \n“We are all very focused on international stories and we want our images to be seen, so the idea was to put photojournalism on the streets.” \nAs a matter of principle, he said, Dysturb members don’t show their own work but instead focus on that of other respected international photojournalists doing important work. \nTheir permission is sought before their work is used and they always get full credit – both in each location and online – and, whenever possible, payment. \nIn Paris, said Pierre, Dysturb work quickly, at night and usually without permission. They are to photojournalism what Banksy is to art. \nThe police, he said, tended not to deal heavy handedly with their poster pasting, often turning a blind eye. Others weren’t so kind. \n“Usually the average is about one week,” said Pierre, asked about the lifespan of Dysturb posters. \n“But sometimes you go back the next day and we don’t have the picture any more. Janina Sabaliauskaite Examples of photojournalism have been pasted up around Newcastle by Dysturb \n“You never know. Sometimes they can be there for three months. It’s all part of the game. \n“Perhaps in Newcastle someone will be upset and not agree with a picture and take it down. Sometimes it’s the weather that does it.” \nOften it’s images of war that Dysturb paste up, hoping to alert people to things that might be happening in their name. \nThe photo on Forth Street shows a man floating in a very swanky swimming pool against a Singapore skyline. \nIt is credited to Gabriele Galimberti and Paolo Woods who did a project about tax havens. The Heavens: Annual Report sought “to render intelligible the nebulous world of tax havens”. \nPierre said demand for their images soared when the leaked Panama Papers, shedding light on tax avoidance, became a major news story. \nPierre, helped by Hannah and NewBridge Project artist and photographer Janina Sabaliauskaite, worked fast, picked up their stepladder and moved on. \nNo need for subterfuge since permission was granted for all their chosen Newcastle locations. \nFind more about Dysturb at dysturb.com and about Hidden Civil War at www.thenewbridgeproject.com Janina Sabaliauskaite Examples of photojournalism have been pasted up around Newcastle by Dysturb The photos \nKyla Woods, Dysturb’s partnership and community manager, said: “Although the purpose of Hidden Civil War is to bring together artists who will expose, collate and present evidence of internal conflict in Britain today, Dysturb has decided to take an alternative approach. \n“We have installed large-format photojournalism throughout the streets of Newcastle that depict the hidden civil wars in the international community. \n“They show issues that relate to civil war, including sexual-based violence, displacement, tax evasion and pollution.” Michael Bunel’s photo, in an underpass below 55 Degrees North, was taken in Calais on January 23, 2016 \nExplanation: “This image shows migrants making a forced entry into the Port of Calais. The migrant crisis is affecting all nations and it is the result of on-going conflicts. This was chosen because of the migrant crisis in relation to the UK.” The photo by Gabriele Galimberti and Paolo Woods, on hoardings on Forth Street, was taken in Singapore in 2013 \nExplanation: “Gabriele and Paolo’s shot illustrates the wealth and freedom wealthy individuals have in cities, such as Singapore, that are considered tax havens. Distribution of wealth, or lack thereof, can and does lead to conflict.” Zied Ben Romohane’s photo at Hadrian House, Higham Place, was taken in Mettlaoui, Tunisia, on April 19, 2015 \nExplanation: “Zied Ben Romohane’s photograph depicts the devastation that state-controlled mining companies can cause. In Tunisia, mining has rendered land uninhabitable and, due to lack of regulation, workers live in polluted areas and remain below the poverty line. This is not only a problem in Tunisia but many other countries.” Greg Khan’s photo, at Forth Lane, near Newcastle Arts Centre, was taken in Pascarola, Italy, on May 22, 2014 \nExplanation: “Greg’s photo shows a toxic fire in Italy. Improper disposal of toxic waste has contaminated soil and water. This in turn has seen inhabitants of nearby villages increasingly affected by rare cancers and tumors. This issue is not specific to Italy, but effects places like China, Argentina and more.” Mary F Calvert’s photo at Lime Street, Ouseburn Valley, was taken in Costa Mesa, California, on December 1, 2014 \nExplanation: “Mary F. Calvert’s image illustrates the results of those who have suffered from sexual based violence in the army. Part of Calvert’s ‘Missing in Action: Homeless Women Veterans’ project, this photograph is an insight into one of the USA’s most daunting issues: the increasing number of female veterans who are becoming homeless. This is a hidden issue.” Marko Risovic’s photo at Baltic 39 on High Bridge Street was taken in Gevgelija, Macedonia, on August 21, 2015 \nExplanation: “Marko’s photograph, taken in Macedonia, shows the despair facing refugees who are looking for a better life. Police brutality is not an uncommon greeting for refugees in their plight along the Balkan route.” Peter Bauza’s photo in an underpass at 55 Degrees North was taken in Brazil on November 1, 2015 \nExplanation: “While Brazil has focused on building infrastructure for the Olympic games, many families are living in poverty in makeshift homes. Peter Bauza photographed the lives of over 300 families in an unfinished condo. Poor living conditions often mean there is a fine line between life and death.” Adriane Ohanesian’s photo in the Ellison Place carpark, NE1 8XS, was taken in Central Dafur, Sudan, on March 4, 2014 \nExplanation: “Adriane Ohanesian photographed Sudan’s civil war. President Omar al Bashir has continued to wage a war against the rebel groups and civilians of Darfur. As many as three million people have been displaced and nearly half a million lives have been lost in the conflict. In the last year, over 600,000 people have fled their homes, due mainly to the violent government offensives.”", "external_links": [], "published": "2016-09-29T18:34:00.000+03:00", "crawled": "2016-09-29T13:48:08.420+03:00", "highlightTitle": ""}