{"organizations": [], "uuid": "f955a6d456caa4f8edf622eb2015c361377d65ea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/29688845/15381435.jpg", "site_section": "http://www.thisisleicestershire.co.uk/generalelection2010/rss.html?chid=182803", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/company-car-man-in-the-wake-of-brexit-the-pm-has-to-look-at-our-home-market-prosperity/story-29688845-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "Leicester Mercury published Company Car Man: 'In the wake of Brexit, the PM has to look at...", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "Leicester Mercury published Company Car Man: 'In the wake of Brexit, the PM has to look at...", "spam_score": 0.0, "site_type": "news", "published": "2016-09-06T19:36:00.000+03:00", "replies_count": 0, "uuid": "f955a6d456caa4f8edf622eb2015c361377d65ea"}, "author": "Leicester Mercury", "url": "http://www.leicestermercury.co.uk/company-car-man-in-the-wake-of-brexit-the-pm-has-to-look-at-our-home-market-prosperity/story-29688845-detail/story.html", "ord_in_thread": 0, "title": "Leicester Mercury published Company Car Man: 'In the wake of Brexit, the PM has to look at...", "locations": [], "entities": {"persons": [{"name": "alex matschy", "sentiment": "negative"}, {"name": "claudio ranieri", "sentiment": "none"}, {"name": "peter jones", "sentiment": "none"}, {"name": "rich wilson", "sentiment": "none"}, {"name": "jessops", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "leicester city", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "kate street", "sentiment": "none"}, {"name": "highcross", "sentiment": "none"}], "organizations": [{"name": "sturgess jaguar land rover", "sentiment": "negative"}, {"name": "leicester mercury", "sentiment": "negative"}, {"name": "leicester city's premier league", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "premier league", "sentiment": "none"}, {"name": "jaguar", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Alex Matschy, general manager of Sturgess Jaguar Land Rover, is this week's Company Car Man \n​ What type of car do you drive and why have you chosen it? \nWorking for Sturgess Jaguar Land Rover, I am very lucky with the choice of cars available and am currently driving a Jaguar F-Pace. It is an incredibly stylish car, British, drives superbly and being aluminium is economical. With a good choice of engines and specifications, it is a great car to drive. \nDo you think the city council needs to do more to help protect cyclists in around Leicester? \nCyclists can be vulnerable on the road and steps always need to be taken to protect them. There are a number of cycle lanes already in the City, however signs could possibly be improved. Clearly road users need to respect one another and take care when on the roads to safeguard each other. \nLeicester City have got off to a slow start this season. What do you think the club's chances are of finishing the Premier League the top six this time round? \nI think they have a great opportunity. They have a great team ethos, key players decided to stay at the club this season and Claudio Ranieri is an excellent manager. We're looking forward to a strong season ahead. #fearless \nEuropean leaders warned that Theresa May's Brexit negotiations with the EU will be \"more difficult\" if she cuts corporation tax. Do you think the benefits for UK companies of such a tax cut would outweigh the risk of tougher negotiations? \nAnything that can stimulate UK industry has got to be seen as positive. This could also increase investment in our economy through businesses attracted to the UK. This may not be seen as positive by other EU members, but the vote to leave was passed and the PM has to look at our own home market prosperity. \nLeicester City's Premier League triumph has seen an array of street art has been popping up around the city, such as the Rich Wilson mural on Kate Street. Do you think graffiti enhances the cityscape? \nTasteful street art can enrich certain areas and create areas of interest to visit and see for both local residents and visitors. As long as it is controlled I think it is ok, however random graffiti can be damaging and sometimes offensive. The street art that has been applied to a number of walls celebrating the Premiership win is good for the city as it builds interest and awareness of Leicester. \nHow do you think Team GB's success at the Rio Olympics can be harnessed to encourage people to get more active across the city and county? \nTeam GB has been an inspiring display. It shows how hard work and dedication can generate fantastic results and can only be good for the county and city. There are fantastic facilities locally and around the county which makes sport accessible to everyone. Following Leicester City's success last season and now the success in the Olympics this should inspire a generation to take up sport. \nPhotography company Jessops has returned to Leicester three years after it left, with a new store in Highcross. The chain went into administration in 2013 but was rescued by Dragons Den star Peter Jones. Do you think it will be successful this time round? \nWith the more recent resurgence in all types of cameras and a strong online presence I am sure they will be very successful. Peter Jones is a shrewd businessman (and tall)!", "external_links": [], "published": "2016-09-06T19:36:00.000+03:00", "crawled": "2016-09-06T16:03:34.453+03:00", "highlightTitle": ""}