{"organizations": [], "uuid": "213ed38ba59c65f4b3e0c1a768b7c0ee2b6bbbb1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article11893596.ece/ALTERNATES/s1200/JS99697227.jpg", "site_section": "http://www.thejournal.co.uk/business/?service=rss", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/commonwealth-secretary-general-urges-north-11892147", "country": "GB", "domain_rank": 21960, "title": "Commonwealth secretary-general urges North East businesses to consider export opportunities", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Commonwealth secretary-general urges North East businesses to consider export opportunities", "spam_score": 0.0, "site_type": "news", "published": "2016-09-16T07:01:00.000+03:00", "replies_count": 0, "uuid": "213ed38ba59c65f4b3e0c1a768b7c0ee2b6bbbb1"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/commonwealth-secretary-general-urges-north-11892147", "ord_in_thread": 0, "title": "Commonwealth secretary-general urges North East businesses to consider export opportunities", "locations": [], "entities": {"persons": [{"name": "baroness scotland", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "dawson", "sentiment": "none"}, {"name": "james ramsbotham", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "commonwea", "sentiment": "none"}, {"name": "heathrow airport", "sentiment": "none"}, {"name": "palintest", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "commonwealth", "sentiment": "none"}, {"name": "north east england", "sentiment": "none"}, {"name": "ramside hall hotel", "sentiment": "none"}], "organizations": [{"name": "commonwealth", "sentiment": "negative"}, {"name": "athena", "sentiment": "none"}, {"name": "commonwealth secretariat", "sentiment": "none"}, {"name": "chamber of commerce", "sentiment": "none"}, {"name": "hsbc", "sentiment": "none"}, {"name": "north east england chamber of commerce", "sentiment": "none"}, {"name": "ward brothers (steel", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "VIEW GALLERY \nNorth East businesses have been urged to look at export opportunities in the Commonwealth in a message from the Secretary-General of the global organisation. \nBaroness Scotland, who took over as leader of the 53-nation organisation last year, sent a message to some of the region’s top firms at the North East Exporters’ Awards, held in Durham last night. \nShe said that ties between Commonwealth nations - which make up more than a quarter of the world’s population - offer huge opportunities for companies in the North East, particularly in light of the vote for Brexit earlier this year. \nShe was speaking as the region’s top exporters were honoured, with the prestigious Exporter of the Year award going to Team Valley-based Palintest, which exports water analysis technologies. \nIn her message, Baroness Scotland said: “The Commonwealth offers an unrivalled network of networks through which to expand trade and investment among our 53 member states. \n“Recent Commonwealth Secretariat research and analysis shows that when both bilateral partners are Commonwealth members they tend to trade 20% more, and generate 10% more foreign direct investment inflows than would otherwise be the case. \n“This potent Commonwealth effect implies bilateral trade costs between Commonwealth partners are on average 19% lower compared with those for other country pairs. It is good business sense to make the most of these unique Commonwealth advantages for the greater good of all our citizens. The North East Exporters Awards 2016 held at Ramside Hall Hotel \n“The UK has long played a leading role in promoting trade-led economic development worldwide. In the post-Brexit era there are fresh opportunities to build on this valuable global contribution through the Commonwealth. \n“Businesses in North East England are well placed to build on the goodwill and sense of affinity that are such distinctive features of our global family by exploring new trade and investment opportunities with Commonwealth counterparts.” \nThe Exporters’ Awards, which are organised by the North East England Chamber of Commerce, saw Ward Brothers (Steel) named SME Exporter of the Year, while Craft Yourself Silly won the New Exporter Award. \nPrizes also went to Palintest, as Export Team of the Year, Huntsman Pigments and Additives as Medium and Large Exporter of the Year, AV Dawson in the Supporting Export category and Videre Global in the Conquering New Markets award. \nChamber of Commerce chief executive James Ramsbotham said: “Huge congratulations to the winners at the export awards last night. \n“We have tremendously talented and ambitious exporters in our region who make a substantial contribution to our regional economy. We have a positive balance of trade, the envy of many other regions, and it is due to the strength of our export businesses. \n“Both the winners and runners-up are great examples of our innovative companies who help put the North East on the world map. They help make us all proud of our region.” \nAs well as the Chamber, support and sponsorship for the awards came from Athena Risk, HSBC and Heathrow Airport.", "external_links": [], "published": "2016-09-16T07:01:00.000+03:00", "crawled": "2016-09-16T02:17:53.732+03:00", "highlightTitle": ""}