{"organizations": [], "uuid": "c454b429ed5992a977eccb2d1326c04b8c0a30f0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/29751030/15577395.jpg", "site_section": "http://www.thisisleicestershire.co.uk/specialolympics/rss.html?chid=181121", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/jet2/story-29751030-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "IFrodsham published Jet2 to include East Midlands Airport in future expansion plans", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "IFrodsham published Jet2 to include East Midlands Airport in future expansion plans", "spam_score": 0.0, "site_type": "news", "published": "2016-09-27T13:02:00.000+03:00", "replies_count": 0, "uuid": "c454b429ed5992a977eccb2d1326c04b8c0a30f0"}, "author": "IFrodsham", "url": "http://www.leicestermercury.co.uk/jet2/story-29751030-detail/story.html", "ord_in_thread": 0, "title": "IFrodsham published Jet2 to include East Midlands Airport in future expansion plans", "locations": [], "entities": {"persons": [{"name": "dart", "sentiment": "none"}, {"name": "isobel frodsham", "sentiment": "none"}, {"name": "steve", "sentiment": "none"}, {"name": "phil", "sentiment": "none"}, {"name": "monty oliver", "sentiment": "none"}, {"name": "steve heapy", "sentiment": "none"}, {"name": "philip meeson", "sentiment": "none"}, {"name": "fowler welch", "sentiment": "none"}], "locations": [{"name": "east midlands airport", "sentiment": "none"}, {"name": "castle donington", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "leeds bradford airport", "sentiment": "none"}, {"name": "leeds", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "egypt", "sentiment": "none"}, {"name": "nottingham", "sentiment": "none"}, {"name": "seattle", "sentiment": "none"}, {"name": "east midlands", "sentiment": "none"}, {"name": "channel islands", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "renton", "sentiment": "none"}, {"name": "glasgow", "sentiment": "none"}, {"name": "tunisia", "sentiment": "none"}, {"name": "edinburgh", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}], "organizations": [{"name": "southwest airlines.boeing", "sentiment": "none"}, {"name": "boeing", "sentiment": "none"}, {"name": "dart group", "sentiment": "none"}, {"name": "boeing commercial airplanes", "sentiment": "none"}, {"name": "ryanair", "sentiment": "none"}, {"name": "channel express", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "federal express", "sentiment": "none"}, {"name": "united parcel service", "sentiment": "none"}, {"name": "ups", "sentiment": "none"}, {"name": "leicestershire's all leisure group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jet2 to include East Midlands Airport in future expansion plans By IFrodsham | Posted: September 27, 2016 0 COMMENTS SHARES Jet2's new plane at the Boeing headquarters in Seattle Jet2 to include East Midlands Airport in future expansion plans X \nCopy link to paste in your message / Comments (0) \nJet2.com plays a big part in the fortunes of the county economy. Business Reporter Isobel Frodsham flew to Seattle to find out how the low-cost airline keeps flying high \nIt's an exciting time for Jet2.com and its sister company Jet2holidays. The business, which specialises in flying Brits on packaged holidays to sunny destinations for low-cost fares, is expanding rapidly and creating jobs across the UK. \nDart Group's two subsidiaries were only launched at Leeds Bradford Airport in 2002. \nBut its latest annual results show Jet2.com and Jet2holidays enjoyed a 15 per cent increase in revenue to more than £1.26 million. \nFor Dart, it's been even bigger and better – the company saw pre-tax profits increase from £57.2 million in March 2015 to more than £104 million this year. \nRecently, the company announced plans to recruit a further 1,000 staff across the UK, including 80 new jobs at East Midlands Airport. The firm already employs 298 people there. \nTwo weeks ago also marked another significant milestone when the airline took delivery of its new Boeing aircraft. \nThe business has ordered 30 of the 737-800s, with plans to introduce 16 into its fleet by this winter and the remaining 14 by next winter. \nThe Boeings have a combined list price of more than $2.9 billion, but the airline negotiated significant discounts with the plane manufacturer. \nThey hold 189 passengers and some will be added to the six-strong fleet already flying out of East Midlands. \nThe holiday firm is also going to expand its Castle Donington routes from 29 this summer to 34 next year. \nOther companies, such as Leicestershire's All Leisure Group, are taking hits on their profits following terrorist attacks in Tunisia and Egypt and the depreciation of the pound following the Brexit vote. \nSo how is Jet2 managing to fly so high? \nSpeaking at Boeing's headquarters in Seattle, Steve Heapy, chief executive of Jet2.com and Jet2holidays, said: \"We don't get greedy. \n\"We keep our costs low so we can pass on great value to our customers. \n\"The depreciation of the pound has made the cost of accommodation more expensive, but we have some protection because we had already bought some currency prior to Brexit, and we try to keep the costs as low as possible. \n\"We think that everyone deserves a holiday and we try to make things as easy as possible for people to book with confidence with us.\" \nIt's easy for any chief executive to say that, but, with Jet2, the numbers speak for themselves. \nJet2's flight capacity when it launched six years ago was less than 117,000. That has now jumped to more than 930,000. \nThe company flew 740,000 passengers last year and had 161,000 holiday customers last year. \nJet2's origins can be traced back to Philip Meeson, a former British aerobatic champion, who sold his shares in his car retailing business to purchase Channel Express in 1983. \nThe business specialised in flying flowers in boxes from the Channel Islands to the UK, and then sending their lorries to deliver them to market. \nPhil said: \"I love aeroplanes. I wanted to buy a business that had involvement with aeroplanes and the distribution side of the business was attractive as well as it was an integrated company.\" \nThe distribution business, Fowler Welch, is still going strong and now has 600 lorries. \nSo why did he decide to set up Jet2? \nPhil said: \"We built our business up and had very large contracts with United Parcel Service and Federal Express – we flew throughout Europe for them. \n\"But then UPS got their own freight aeroplanes, and we could see this business was not going to continue in the same way, so we decided to start our leisure airline in Leeds in 2003. \n\"It was a great opportunity as the North wasn't served by a specialist leisure airline in the same way. \n\"We started off in Leeds before moving to Manchester, Newcastle, Edinburgh, Glasgow and then East Midlands. \n\"We decided to go to East Midlands as we have progressively moved South, which has been efficient for our marketing, and it's really well placed. \n\"You have the M1, M69 and M6, it's a great catchment area for Leicester, Nottingham and Derby. \n\"It's a great airport that is very good and well run. It does get a bit crowded though, we hope they're going to expand the facilities.\" \nSteve added: \"East Midlands Airport is a very important base, we have six aircraft based there. \n\"We have built up a very loyal following from our customers and we have huge demand for our flights and holiday products there. \n\"It's a base we will continue to operate from and continue to grow in. \n\"We fully intend it to be a part of our exciting growth plans.\" \nSince its launch, Jet2 has been a loyal customer of Boeing. \nSteve said: \"We looked at a number of aircraft manufacturers and the 737-800 is an aircraft we currently already operate. \n\"We know it very well and knew it was the right choice to take us forward. \n\"It is the right size and has the right economics. \n\"We'll probably start thinking about buying more planes in 18 months' time when we'll work out what our next phase of growth will be.\" \nMonty Oliver, senior vice president of European Sales at Boeing Commercial Airplanes, said: \"Jet2 has been a Boeing customer for quite some time. \n\"They are an exclusive, because nearly all of their aircraft are Boeing planes. That makes us a truly unique relationship and a really nice partnership. \n\"When the opportunity came for them to start renewing their fleet, it was one of those opportunities we really placed an emphasis on to make sure we won. \n\"We couldn't be more thrilled to see them grow while flying Boeing planes.\" \nThe Jet2 planes take about 18 months to build, while the average Boeing aircraft from design to finish can take around three years.Boeing completed the planes at its huge factory in Renton, 11 miles from Seattle, in Washington, where it employs 12,000 workers at various bases. \nA total of 42 aeroplanes roll out of the factory each month – these also include 737-700s and 737-900ERs. The company's other customers include Ryanair and Southwest Airlines.Boeing's production line has also undergone a revamp. \nInstead of moving planes a few centimetres each hour, they now make all of the movements in the factory every evening.This is to help increase production from 42 planes to 52 each month.", "external_links": [], "published": "2016-09-27T13:02:00.000+03:00", "crawled": "2016-09-27T08:15:50.378+03:00", "highlightTitle": ""}