{"organizations": [], "uuid": "85a2b87d8c324de2c4fac8a42ff729fc4fa57ae9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bostonstandard.co.uk", "main_image": "http://res.cloudinary.com/jpress/image/fetch/w_300,f_auto,ar_3:2,c_fill/http://www.bostonstandard.co.uk/webimage/1.7595291.1474654655!/image/image.jpg", "site_section": "http://www.bostonstandard.co.uk/rss/cmlink/1.5179319", "section_title": "Boston Standard Feed", "url": "http://www.bostonstandard.co.uk/whats-on/arts/tv-column-national-treasure-panorama-brexit-a-very-british-coup-1-7595292", "country": "GB", "title": "TV COLUMN: National Treasure, Panorama, Brexit: A Very British Coup?", "performance_score": 0, "site": "bostonstandard.co.uk", "participants_count": 0, "title_full": "TV COLUMN: National Treasure, Panorama, Brexit: A Very British Coup?", "spam_score": 0.0, "site_type": "news", "published": "2016-09-24T02:17:00.000+03:00", "replies_count": 0, "uuid": "85a2b87d8c324de2c4fac8a42ff729fc4fa57ae9"}, "author": "", "url": "http://www.bostonstandard.co.uk/whats-on/arts/tv-column-national-treasure-panorama-brexit-a-very-british-coup-1-7595292", "ord_in_thread": 0, "title": "TV COLUMN: National Treasure, Panorama, Brexit: A Very British Coup?", "locations": [], "entities": {"persons": [{"name": "james waller-davies", "sentiment": "none"}, {"name": "coltrane", "sentiment": "none"}, {"name": "rees-mogg", "sentiment": "none"}, {"name": "paul finchley", "sentiment": "none"}, {"name": "robbie coltrane", "sentiment": "none"}, {"name": "johnson", "sentiment": "none"}, {"name": "messrs farage", "sentiment": "none"}, {"name": "julie waters", "sentiment": "none"}, {"name": "jack thorne", "sentiment": "none"}, {"name": "pienaar", "sentiment": "none"}, {"name": "fox", "sentiment": "none"}, {"name": "panorama", "sentiment": "none"}, {"name": "gove", "sentiment": "none"}, {"name": "john pienaar", "sentiment": "none"}], "locations": [{"name": "finchley", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}], "organizations": [{"name": "panorama", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "sdlp", "sentiment": "none"}, {"name": "finchley", "sentiment": "none"}, {"name": "national treasure", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Have your say \nColumnist James Waller-Davies gives his view of some of the recent events on television. \nChannel 4 restored a bit of its Bake Off battered reputation this week with the start of a compelling new drama, National Treasure. \nThe show presents Robbie Coltrane as aging old-time television star, Paul Finchley, accused of a historic sexual attack. Julie Waters plays his short on credulity, but long on loyalty wife. \nThe superb writing and direction introduce suspicion at every turn. As an audience, we are none the wiser as to Finchley’s guilt or innocence, but writer, Jack Thorne, has astutely latched on to a public wish to condemn and judge. \nIn one of the more poignant scenes, Finchley’s sums up the accused celebrity’s dilemma: “If I was innocent, I’d say I was innocent. If I was guilty, I’d say I was innocent. What do I say?” \nThe performances are powerfully understated. Given their comic beginnings, it’s easy to forget what consummate dramatic actors both Coltrane and Waters are. \nNational Treasure is already being talked about in terms of BAFTAs. It’s possibly a bit early for that and it is, after all, that time of the year when every week has a new release that someone is tipping for awards. But it will be something very good indeed that beats National Treasure to the prizes at the end of the year. \nBut if there was a prize for the clumsiest piece of programme scheduling, then following the celebrity sex scandal of National Treasure with It Was Alright in the ‘70s is going to take some beating. \nThis week’s Panorama (BBC1) scratched under the surface of the Labour leadership contest and went out under the subtitle, Labour: Is the Party Over? \nPresented by the very able – and rather underused on TV – John Pienaar, this Panorama had surprisingly little new to offer. From the outside, the current Labour woes seem very black or white and Pienaar was able to find very little that was nuanced or with shades of grey. Indeed, the only shades of anything were those of red as the ‘blood on the carpet’ metaphor appears to be the one which will prevail after the result, whomever wins. \nWhat was clear from Pienaar’s analysis as that the current strife makes the SDLP split of the early 1980s look like a glancing blow that chipped a bit of the side. Thirty years later it looks like it might be a clean cleave straight down the middle. \nFar more illuminating and entertaining was BBC2’s political fly-on-the-wall, Brexit: A Very British Coup? which followed the Leave campaign during the EU referendum. \nThese up-close political documentaries are incredibly revealing and are as near as you can get to political diaries on television. In an age obsessed with the politics of personality, it remains more riveting to get a glimpse of the personalities behind the politics, especially in their more unguarded moments. \nWhat came over more than anything else was how the personalities of Leave had a massive rhetorical advantage over the Remain campaign and they targeted their guns narrowly. Love them or loathe them all, there’s no denying that the likes of Messrs Farage, Fox, Rees-Mogg, Johnson and Gove could debate the socks of small gatherings and charm the Brexit birds from the trees. \nWhilst Remain went more for the large scale events and big guns, Leave criss-crossed the country. For the Remainers it was the month of the short knives and death by a thousand cuts. \nIronically, after the day after, no one seemed happy, as once again politics showed it is the nation’s number one blood sport. Sign in", "external_links": [], "published": "2016-09-24T02:17:00.000+03:00", "crawled": "2016-09-23T23:11:24.516+03:00", "highlightTitle": ""}