{"organizations": [], "uuid": "4942a990d29803aabd33d3710bce1c7ec8a57099", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article11833259.ece/ALTERNATES/s1200/JS97856152.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/construction-sector-shows-signs-recovery-11833201", "country": "GB", "domain_rank": 21960, "title": "Construction sector shows signs of recovery in latest survey", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Construction sector shows signs of recovery in latest survey", "spam_score": 0.0, "site_type": "news", "published": "2016-09-02T18:27:00.000+03:00", "replies_count": 0, "uuid": "4942a990d29803aabd33d3710bce1c7ec8a57099"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/construction-sector-shows-signs-recovery-11833201", "ord_in_thread": 0, "title": "Construction sector shows signs of recovery in latest survey", "locations": [], "entities": {"persons": [{"name": "david davies/pa wire bricks", "sentiment": "none"}, {"name": "tim moore", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "office for national statistics", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "markit", "sentiment": "none"}, {"name": "ons", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Construction sector shows signs of recovery in latest survey 11:27, 2 Sep 2016 The research comes after a surprise swing in manufacturing output, which saw its highest monthly rise in 25 years Shares Get business news by email David Davies/PA Wire Bricks on a building site \nBritain’s construction industry showed signs of recovery last month, as output beat expectations and picked up from July’s seven-year low. \nThe closely-watched Markit/CIPS construction purchasing managers’ index (PMI) hit 49.2 in August, up from 45.9 in July and above economists’ expectations of 46.5. \nA reading above 50 indicated growth. \nThe pound rose 0.8% against the dollar following the update to 1.328 US dollars. Sterling was also 0.1% ahead against the euro at 1.187 euros. \nThe update follows a surprise swing in manufacturing output in August, notching up its highest monthly rise in a quarter of a century. \nConstruction activity recorded its fastest fall since June 2009 in July as uncertainty over Britain’s decision to ditch the European Union triggered a steep fall in commercial building activity. \nHowever, business activity only recorded a marginal fall in August, as new order volumes “moved closer to stabilisation”. \nThe report said the rate of contraction in housing activity and commercial building was the slowest for three months, while civil engineering was stable after falling in July. \nThe returning strength to industry also filtered through to employment, with staffing levels recording a small expansion in August. It said the use of sub-contractors continued to decline. \nHowever, sterling’s plunge to 31-year lows since the Brexit vote has ramped up costs for construction firms, as input cost inflation grew for the third month in a row and hit its highest level for five years. \nBusiness confidence also rebounded from a 39-month low in July, but was still close to the lowest level on record for the past three years. \nTim Moore, senior economist at Markit, said the survey only highlights “a partial move towards stabilisation” and not a return to “business as usual” for the construction sector. \n“The downturn in UK construction activity has eased considerably since July, primarily helped by a much slower decline in commercial building. \n“Construction firms cited a nascent recovery in client confidence since the EU referendum result and a relatively steady flow of invitations to tender in August.” \nHe said there were still widespread reports that Brexit uncertainty was dampening demand, with total new order volumes continuing to fall in August. \n“Despite another month of reduced output, the latest figures can be viewed as welcome news overall after a challenging summer for the construction sector,” he added. \n“The move towards stabilisation chimes with the more upbeat UK manufacturing PMI data for August, and provides hope that the near-term fallout from Brexit uncertainty will prove less severe than feared.” \nThe construction industry’s better-than-expected PMI comes after official figures published last month showed the industry had fallen back into recession for the first time in four years \nThe Office for National Statistics (ONS) said construction output dropped by 0.7% in the second quarter, following a 0.3% fall in the first quarter, meaning the industry recorded two consecutive quarters of negative growth for the first time since 2012.", "external_links": [], "published": "2016-09-02T18:27:00.000+03:00", "crawled": "2016-09-02T13:40:22.563+03:00", "highlightTitle": ""}