{"organizations": [], "uuid": "267d331cea356acc6425ad757eab30bf9b32b950", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article11595517.ece/ALTERNATES/s1200/JS94026548-1.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/business-breakfast-recap-smes-generate-11852745", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast RECAP: SMEs to generate £16bn a year despite Brexit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast RECAP: SMEs to generate £16bn a year despite Brexit", "spam_score": 0.0, "site_type": "news", "published": "2016-09-08T15:20:00.000+03:00", "replies_count": 0, "uuid": "267d331cea356acc6425ad757eab30bf9b32b950"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/business-breakfast-recap-smes-generate-11852745", "ord_in_thread": 0, "title": "Business Breakfast RECAP: SMEs to generate £16bn a year despite Brexit", "locations": [], "entities": {"persons": [{"name": "coreena ford north eas", "sentiment": "negative"}, {"name": "dale murray", "sentiment": "none"}, {"name": "robert", "sentiment": "none"}, {"name": "coreena ford zoopla", "sentiment": "none"}, {"name": "prem sikka", "sentiment": "none"}, {"name": "andy street", "sentiment": "none"}, {"name": "zoopla", "sentiment": "none"}, {"name": "kevin fitzpatrick", "sentiment": "none"}, {"name": "fitzpatrick", "sentiment": "none"}, {"name": "kevin loosemore", "sentiment": "none"}, {"name": "john lewis", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "john mcdonnell", "sentiment": "none"}, {"name": "robert gibson", "sentiment": "none"}, {"name": "coreena ford", "sentiment": "none"}, {"name": "greggs", "sentiment": "none"}, {"name": "daniel", "sentiment": "none"}, {"name": "seb james", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "coreena ford more east coast", "sentiment": "none"}, {"name": "vermont hotel", "sentiment": "none"}, {"name": "greece", "sentiment": "none"}, {"name": "oxford", "sentiment": "none"}, {"name": "zoopla", "sentiment": "none"}, {"name": "brighton", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "morpeth", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "southern europe", "sentiment": "none"}, {"name": "st albans", "sentiment": "none"}, {"name": "nottingham", "sentiment": "none"}, {"name": "aveika", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "edinburgh waverley", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "hove", "sentiment": "none"}, {"name": "bristol", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "southampton", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "vermont aparthotel", "sentiment": "none"}, {"name": "mercure county hotel", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "derby", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}, {"name": "shutterstock a virgin east coast", "sentiment": "none"}, {"name": "edinburgh", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "westminster", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}], "organizations": [{"name": "arm holdings", "sentiment": "none"}, {"name": "autonomy corp", "sentiment": "none"}, {"name": "hm revenue and customs", "sentiment": "none"}, {"name": "us telecoms group sprint", "sentiment": "none"}, {"name": "vermont hotel", "sentiment": "none"}, {"name": "carphone warehouse", "sentiment": "none"}, {"name": "dixons carphone", "sentiment": "none"}, {"name": "hewlett packard  uk tech technology company micro focus international", "sentiment": "none"}, {"name": "nordics", "sentiment": "none"}, {"name": "london king", "sentiment": "none"}, {"name": "coreena ford newcastle", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "journal", "sentiment": "none"}, {"name": "gainford group  gainford group", "sentiment": "none"}, {"name": "coreena ford micro focus", "sentiment": "none"}, {"name": "micro focus", "sentiment": "none"}, {"name": "liverpool", "sentiment": "none"}, {"name": "hmrc", "sentiment": "none"}, {"name": "county hotel", "sentiment": "none"}, {"name": "coreena ford dixons carphone", "sentiment": "none"}, {"name": "coreena ford", "sentiment": "none"}, {"name": "dixons carphone group", "sentiment": "none"}, {"name": "capital economics", "sentiment": "none"}, {"name": "gainford group", "sentiment": "none"}, {"name": "british chambers of commerce", "sentiment": "none"}, {"name": "esh group", "sentiment": "none"}, {"name": "gainford group the county hotel", "sentiment": "none"}, {"name": "leeds", "sentiment": "none"}, {"name": "alnmouth", "sentiment": "none"}, {"name": "dixons", "sentiment": "none"}, {"name": "softbank", "sentiment": "none"}, {"name": "north east england chamber of commerce", "sentiment": "none"}, {"name": "fujitsu", "sentiment": "none"}, {"name": "hewlett packard enterprise", "sentiment": "none"}, {"name": "jefferies", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}, {"name": "university of essex", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "east coast mainline", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "See you back here tomorrow for more North East and UK business news. . . 9.25 Coreena Ford North East Business Awards 2017 are launched \nIs yours the best company in the North East? Our search for the best firms in the region has begun with the opening of entries for the 2017 North East Business Awards. \nThe awards are run by The Journal and The Gazette with support from the North East England Chamber of Commerce to recognise the top businesses in a range of sectors in all corners of the region. \nOne firm takes the ultimate prize of North East Company of the Year while winners from some of the categories go on to represent the North East in the national Business Awards run by the British Chambers of Commerce. \nThe list of firms to have been named North East company of the year is a long and illustrious one that includes some of the top names in the region’s business community, including Greggs, Nissan, Fujitsu and Esh Group. 9.21 Coreena Ford More East Coast mainline trains to make Northumberland stops \nGood news for commuters - Virgin Trains has agreed to requests from passengers for more trains to stop at Morpeth and Alnmouth. \nCommuters in Northumberland are to get extra services on the East Coast Mainline after train operators Virgin agreed to requests for more trains to stop at Morpeth. \nVirgin Trains is making changes to its December timetable which will include four more daily services to the Northumberland town, three of which are in the afternoon. \nThe new services are: \n* the northbound train leaving London King’s Cross at 9.30am will now call at Morpeth at 12.57pm; \n* the 1.30pm northbound train from London will stop at Morpeth at 4.57pm and Alnmouth at 5.11pm; \n* the 5.30pm northbound train from London will stop at Alnmouth at 9pm; \n* the 2pm southbound train from Edinburgh Waverley will call at Morpeth at 3.15pm; \n* a new 6.30pm service from Edinburgh will now stop at Alnmouth at 7.40pm and Morpeth at 7.57pm. Shutterstock A Virgin East Coast train 9.16 Coreena Ford Zoopla ups earnings outlook thanks to uSwitch purchase \nProperty website Zoopla upped its earnings outlook as a surge in energy provider switching continues to boost its recently-bought comparison service uSwitch. The group hailed strong trading at its uSwitch division, with competitive gas and electricity deals driving a jump in the number of households switching their energy supplier. \nZoopla now expects full-year underlying earnings to be at the top-end of City forecasts, with the market previously pencilling in a range of £69 million to £76 million. \nIt comes after the group posted a 58% surge in first half profits to £22.6 million in May thanks to record revenues. \nHalf-year turnover rocketed 130% to £96.4 million, driven by growth in its comparison services division, which alone totted up sales of £57.7 million. \nZoopla, which bought uSwitch last year, said in its latest update: “The comparison services division continues to outperform, driven by continued competitive supplier offers and a supportive regulatory environment across the home services switching market.” \nFigures earlier this week from energy watchdog Ofgem revealed the number of UK households switching their energy provider rose by 30% in the first half of the year. \nMore than 3.8 million switches took place between January and June as people changed their energy supplier - around a million more than the same period last year, the regulator said. \nZoopla’s update also added that its property site saw ongoing growth in the number of estate agents signed up, rising 5% year-on-year to 13,275, while property listings also lifted 5% to 925,000. Analysts at Jefferies said Zoopla was “top of the class”. \n“Zoopla is leading rather than following the market as it seeks to be the ‘one stop shop’ for the homebuyer - the Amazon of UK residential, with services ranging across property to tradesmen to utilities,” they added. Zoopla has upped its earnings outlook 9.05 Coreena Ford Big companies should be forced to publish tax returns - Labour \nBig companies should be forced to publish their tax returns as part of efforts to clamp down on avoidance and evasion, an independent review commissioned by Labour has recommended. \nThe first stage of the review of HM Revenue and Customs said related documents and calculations should also be publicly available. \nParliamentary committees should be empowered to examine sensitive tax information, with MPs and peers deciding whether scrutiny of documents and practices should be conducted behind closed doors, it said. \nThe review by Professor Prem Sikka of the University of Essex also called for the creation of a supervisory board for HMRC to “act as a bulwark against corporate capture and inertia”, accountable to parliamentary committees. \nThat board should also protect tax whistleblowers, the report said. \nShadow chancellor John McDonnell said the study lent weight to Labour’s argument that HMRC needs to be more accountable and have more resources to deal with tax avoidance and evasion. \nHe said: \nThe public want to urgently see more action on tax avoidance but the Government have made things worse by cutting staff and resources at HMRC. This report lends further support to something we have been arguing for years: that HMRC needs more accountability and resources to deal with tax avoidance and evasion. \nLabour will be looking at the report’s recommendations in great detail while we develop our policies in this area, and also discussing how to take the review forward to the next stage. \nIt’s only under a Labour government that the UK can get a serious grip on the problems of tax avoidance and evasion. \nThe report also called for HMRC to be given more cash for resources and staffing, to restore a local network of offices, and to be given extra funds for investigations and prosecutions. Daniel Leal-Olivas/PA Wire Labour Shadow Chancellor John McDonnell 9.01 Coreena Ford The pound at 9am \nThe pound at 9am was 1.3351 dollars compared to 1.3337 dollars at the previous close. The euro at 9am was 0.8434 pounds compared to 0.8423 pounds at the previous close. 9.00 Coreena Ford How 30 years of Nissan has transformed the North East... \nOur business desk colleague Robert Gibson left last Friday for a new career, but before he left he had a chat with Nissan MD Kevin Fitzpatrick. \nToday marks the 30 years since the Sunderland plant’s official opening. \nAnd since then, Mr Fitzpatrick told Robert, the factory has transformed the North East and UK manufacturing as a whole. \nRead the piece here . 8.55 Coreena Ford Newcastle's County Hotel set for transformation under Gainford Group \nGainford Group, owners of The Vermont Hotel and Vermont Aparthotel, have snapped up The Mercure County Hotel opposite central station in a deal worth in the region of £12m - and the firm has big plans for the property. \nThe deal completed today, and includes the hotel and 10 retail units. Having created Bar Livello and Aveika on the Quayside we can expect to see similar venues spring up within the building soon, no doubt. \nRead the full story here . Gainford Group The County Hotel is now owned by Gainford Group, who also own the Vermont Hotel 8.50 Coreena Ford Micro Focus in £6.6bn merger with Hewlett Packard \nUK tech technology company Micro Focus International has announced that it is to buy the software arm of Hewlett Packard Enterprise (HPE) in an 8.8 billion dollar deal, which equates to £6.6bn. \nThe combined entity will have annual revenues of 4.5 billion US dollars, creating one of the biggest software firms in the UK. \nMicro Focus executive chairman Kevin Loosemore, who will head up the new firm, said: \nThe merger will create one of the world’s largest infrastructure software companies with leading positions across a number of key products and represents a compelling opportunity to create significant value for both companies’ shareholders by applying Micro Focus’ proven approach to efficient management of mature software products. \nThe deal includes Autonomy Corp, which HPE acquired for 11 billion US dollars in 2011, before writing off three-quarters of its value. \nThe merger comes months after Japan’s Softbank’s acquired ARM Holdings, widely regarded as the jewel in the crown of the UK technology sector, for £24.3 billion. 8.45 Coreena Ford Pokemon Go doubles demand for mobile chargers \nDixons Carphone was created from the £5bn merger between Dixons and Carphone Warehouse in 2014, and customers have been clamouring for a whole range of products. \nAs expected, it saw strong demand for TVs ahead of the summer’s Euro 2016 football championship, while sales were also strong for smart fitness devices and watches, as well as PC gaming. \nAnd perhaps not surprising to anyone why plays it, but the Pokemon Go gaming craze has seen demand for mobile phone chargers more than double, as players seek to give their batteries a boost as they run down their phone power while out and about, glued to their screens. \nThe chain also said it had delivered sales growth in built-in white goods, such as washing machines and dishwashers, three times faster than the market after boosting its range available for next-day delivery and launching an expert installation service. \nCEO Seb James confirmed the rollout of its three-in-one megastores was “well on track”, while the group’s first quarter also saw it go live with a new Carphone Warehouse website and expand its click-and-collect reach for small products sold group-wide across 500 Carphone Warehouse stores. \nHe also gave an update on the company’s US expansion plans through a joint venture deal with US telecoms group Sprint, with 31 stores now across five regions. The firm plans to eventually open 500 outlets in the US. \nThe retailer’s overseas operations also delivered robust like-for-like sales growth in its first quarter, up 13% in Southern Europe driven by Greece and 2% higher in the Nordics. The Pokemon Go game is boosting sales of mobile chargers 8.40 Coreena Ford Dixons Carphone hails 4% sale rise \nElectricals and mobile phones giant Dixons Carphone said the Brexit vote had not put consumers off from hitting the shops as it cheered “strong” trading. \nThe Currys and PC World owner notched up a 4% rise in like-for-like sales across the UK and Ireland in its first quarter to July 30. \nChief executive Seb James said so-called shopper footfall had been “really strong” in the latest sign that the June vote to quit the European Union has not yet dented consumer confidence. \nHe added: “We continue to see no detectable impact of the Brexit vote on consumer behaviour in the UK.” \nOfficial retail sales figures showed a far-better-than-expected 1.4% rise in July, which marked a rebound from June, when the high street suffered its sharpest sales fall in six months. But not all retailers are convinced over consumer resilience, with John Lewis managing director Andy Street revealing on Wednesday that he feared shopper confidence had failed to bounce back to pre-referendum levels. Dixons Carphone Group owns Carphone Warehouse and Currys PC World 8.35 Coreena Ford SME report - where's the North East? \nCapital economics ranked UK cities by growth prospect scores, which were calculated using four metrics, and they’ve listed the top 15 cities expected to see the biggest growth by 2020 . . .and there’s no sign of the North East? \nThe metrics they used considered the regional economic outlook, the change in the number of SMEs in the city since 2010, the share of fast-growing SME industries, and the quality of the business environment, which considered workforce skills, property costs and broadband speed. \nIn descending order, the top 15 UK cities expected to see the biggest rise in SME growth by 2020 are: The City of London, Bristol, Leeds, Birmingham, Brighton and Hove, Manchester, Nottingham, Leicester, Westminster, Liverpool, Derby, Oxford, St Albans, Southampton and Edinburgh. \nLeeds is predicted to see 4,000 jobs created and a £1.9bn contribution to the economy per year by 2020, with SMEs benefiting from low property prices and access to the local airport. \nBirmingham-based SMEs will contribute £13.8 billion per year to the local economy, with health and education identified as the city’s fastest growing sectors. 8.30 Coreena Ford Report predicts SMEs to generate £16bn a year \nSmall and medium-sized businesses are set to generate a whopping £16bn for the UK economy each year by 2020, despite Brexit, a new report shows. \nBristol, Leeds, the City of London, Birmingham and Brighton are tipped to see the biggest rise in SME growth over the next four years, according to research by Capital Economics and commissioned by energy firm npower. \nTogether, the top 15 cities with the best SME growth prospects are set to create a total of 200,000 new jobs by 2020, Capital Economics said. \nThat is despite fears over an economic slowdown in the wake of the EU referendum. \nCapital economics said: \nOverall we expect that the impact of Brexit will be more modest than other commentators suggest and we expect all regions to grow by an average of more than 1% per annum in the next five years. \nThe City of London is expected to benefit from a strong growth outlook, and access to a high-skilled workforce that is drawn by attractive living conditions. Over 36,000 jobs are set to be created in the city as a result, the report explains. \nMeanwhile, small to medium-sized businesses are expected to contribute £11.1 billion per year to Bristol’s economy by 2020 amid fast growth in the television, music, video and financial service industries. \nCompanies in those sectors are forecast to benefit from low business rates, good internet connection rates and an enterprise zone which provides tax breaks and government support. \nDale Murray, CBE & Board Advisor at the Centre for Entrepreneurs, said: \nGrowth of SMEs will be crucial to the British economy over the next five years as they create tens of thousands of jobs. \nPolicy makers must recognise how vital business rates, living conditions and workforce skills are to attracting SMEs and do everything they can to support them.", "external_links": [], "published": "2016-09-08T15:20:00.000+03:00", "crawled": "2016-09-08T13:16:27.815+03:00", "highlightTitle": ""}