{"organizations": [], "uuid": "1c0c1587c8a3eec3d7dac0600c4aa1c4b6f2fd6e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/29698708/15414049.jpg", "site_section": "http://www.thisisleicestershire.co.uk/weathernews/rss.html?chid=182806", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/footwear-firm-to-step-up-business-after-grant-boost/story-29698708-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "Leicester Mercury commented Shoe firm to Princess Charlotte expands and creates jobs", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "Leicester Mercury commented Shoe firm to Princess Charlotte expands and creates jobs", "spam_score": 0.0, "site_type": "news", "published": "2016-09-09T17:11:00.000+03:00", "replies_count": 0, "uuid": "1c0c1587c8a3eec3d7dac0600c4aa1c4b6f2fd6e"}, "author": "Leicester Mercury", "url": "http://www.leicestermercury.co.uk/footwear-firm-to-step-up-business-after-grant-boost/story-29698708-detail/story.html", "ord_in_thread": 0, "title": "Leicester Mercury commented Shoe firm to Princess Charlotte expands and creates jobs", "locations": [], "entities": {"persons": [{"name": "charlotte", "sentiment": "negative"}, {"name": "sons", "sentiment": "none"}, {"name": "adrian", "sentiment": "none"}, {"name": "michael bolton", "sentiment": "none"}, {"name": "paul bolton", "sentiment": "none"}, {"name": "lauren mills", "sentiment": "none"}, {"name": "lorna fitzsimons", "sentiment": "none"}, {"name": "george", "sentiment": "none"}], "locations": [{"name": "kensington palace", "sentiment": "none"}, {"name": "oadby premises", "sentiment": "none"}, {"name": "greater manchester", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "leicester mercury", "sentiment": "negative"}, {"name": "manchester growth company", "sentiment": "none"}, {"name": "n brown textiles growth programme", "sentiment": "none"}, {"name": "textiles growth programme", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Shoe firm to Princess Charlotte expands and creates jobs By Leicester Mercury | Posted: September 09, 2016 By Lauren Mills 1 COMMENTS SHARES Shoes fit for a princess: Princess Charlotte shows off her dainty footwear and, right, Paul Bolton, of Michael Bolton and Sons Shoe firm to Princess Charlotte expands and creates jobs X \nCopy link to paste in your message / Shoes fit for a princess: Princess Charlotte shows off her dainty footwear and, right, Paul Bolton, of Michael... Comments (1) \nA children's footwear manufacturer is investing in new equipment and technology in a move which will create 11 jobs. \nMichael Bolton and Sons has pledged to invest more than £100,000 upgrading its Oadby premises, with the support of a £38,000 grant from the N Brown Textiles Growth Programme. \nFounded in 1952, Michael Bolton and Sons designs and makes children's shoes for the luxury retail market from its Leicester base. \nDemand for the business's products spiked in 2014 when Prince George was spotted wearing the brand. \nSales were again boosted after Princess Charlotte wore the new line in photos released by Kensington Palace earlier this year. \nThe £100,000 investment will bring business back to the UK, and reaffirms Michael Bolton and Son's commitment to the future of manufacturing in the UK. \nSet up by the Manchester Growth Company for the Combined Authority in Greater Manchester and the Alliance Project, The N Brown Textiles Growth Programme is delivered across the UK and funded by the Regional Growth Fund. \nIt has so far supported 11 companies In Leicestershire, creating and safeguarding 215 jobs in the area. \nPaul Bolton, managing director at Michael Bolton and Sons said: \"Over the last 24 months, sales have increased by over 40 per cent. However, due to our limited production capacity we have been forced to extend our delivery times and turn some business away. \n\"With the investment we have secured through the Textiles Growth Programme we are now installing new machinery which will enable the company to supply both existing and new customers. New staff have been recruited with further recruitment planned throughout the expansion programme. The new plant and staff will also enable the company to launch a new first walker range of shoes that had been put on hold due to the limited capacity. \n\"The company is now facing very exciting times ahead and we are extremely grateful for the invaluable assistance provided by Adrian, our adviser at the Textiles Growth Programme, in enabling us to implement this expansion.\" \nSince the start of the N Brown Textiles Growth Programme in 2014, 237 companies have been supported, creating and safeguarding nearly 3,500 jobs and securing £87 million private sector investment through £20 million grant support. Further grant funding is available until early next year. \nLorna Fitzsimons, a director of N Brown Textiles Growth Programme, said: \"Although it's still early days after the Brexit vote, the textile industry is still showing the confidence to invest, which is a healthy indicator that the sector is still growing. \n\"This is helped, in part, by Government funding, and a strategy to invest in this industry which is so important to Leicester.\"", "external_links": [], "published": "2016-09-09T17:11:00.000+03:00", "crawled": "2016-09-09T13:02:07.088+03:00", "highlightTitle": ""}