{"organizations": [], "uuid": "dfb5345f6e692e6b0a7bf408d2108ef60d367e1d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/29750856/15577282.jpg", "site_section": "http://www.thisisleicestershire.co.uk/specialolympics/rss.html?chid=181121", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/norton-boss/story-29750856-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "TomPegden published Norton boss reveals new superbike sold out before release", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "TomPegden published Norton boss reveals new superbike sold out before release", "spam_score": 0.0, "site_type": "news", "published": "2016-09-27T13:00:00.000+03:00", "replies_count": 0, "uuid": "dfb5345f6e692e6b0a7bf408d2108ef60d367e1d"}, "author": "TomPegden", "url": "http://www.leicestermercury.co.uk/norton-boss/story-29750856-detail/story.html", "ord_in_thread": 0, "title": "TomPegden published Norton boss reveals new superbike sold out before release", "locations": [], "entities": {"persons": [{"name": "norton", "sentiment": "negative"}, {"name": "tompegden", "sentiment": "negative"}, {"name": "bob bob ricard", "sentiment": "none"}, {"name": "tom pegden", "sentiment": "none"}, {"name": "stuart garner", "sentiment": "none"}, {"name": "stuart", "sentiment": "none"}, {"name": "paul smith", "sentiment": "none"}, {"name": "ollie curme", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}, {"name": "castle donington", "sentiment": "none"}, {"name": "donington park", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}, {"name": "donington hall", "sentiment": "none"}, {"name": "madrid", "sentiment": "none"}, {"name": "barcelona", "sentiment": "none"}, {"name": "dover street", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "soho", "sentiment": "none"}, {"name": "norton", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "beak street", "sentiment": "none"}, {"name": "vinoteca", "sentiment": "none"}, {"name": "donington", "sentiment": "none"}, {"name": "hastings house", "sentiment": "none"}, {"name": "dominator", "sentiment": "none"}], "organizations": [{"name": "stuart", "sentiment": "none"}, {"name": "international airlines group", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "norton", "sentiment": "none"}, {"name": "norton motorcycles", "sentiment": "none"}, {"name": "stuart garner", "sentiment": "none"}, {"name": "nec", "sentiment": "none"}, {"name": "british motorcycle manufacturing academy", "sentiment": "none"}, {"name": "hastings house", "sentiment": "none"}, {"name": "pepe jeans group", "sentiment": "none"}, {"name": "norton clothing", "sentiment": "none"}, {"name": "aston martin", "sentiment": "none"}, {"name": "advanced manufacturing supply chain initiative", "sentiment": "none"}, {"name": "bmma", "sentiment": "none"}, {"name": "norton owners club", "sentiment": "none"}, {"name": "british airways", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Norton boss reveals new superbike sold out before release X \nCopy link to paste in your message / Comments (0) \nThese are exciting times for Stuart Garner, the man who turned Norton bikes into a success story. Business Editor Tom Pegden caught up with him \nStuart Garner is not just the custodian of one of Britain's best loved motorcycle brands. He's a supporter of great British manufacturing, the man behind a stylish clothes range, and more recently, a hotelier. \nThese are busy times for the 47-year-old who took Norton from the scrapheap of British manufacturing less than a decade ago and turned it into a modern classic. \nRight now he is snowed under with new projects, not least of which is a new 1,200 V4 road-going superbike – a spin-off of the racer that saw Norton gain a seventh place in this year's Isle of Man Superbike TT. Related content Brexit: What do industry leaders in Leicestershire predict will happen? \nProduction is getting under way and the bike will be launched at the prestigious Motorcycle Live event at the NEC this autumn. \nThe first limited edition of 200, costing a not inconsiderable £44,000 a piece, has already sold out – adding a healthy bonus to the Donington company's balance sheets. \nThe future base model is expected to cost around £28,000. \nTo show how keen the bike-loving public is for all things Norton, a Facebook update on the launch had 750,000 hits in just 48 hours. \nStuart, just heading off on a trip to Barcelona, told the Business Monthly: \"We roll that out to the public in the third week of November. \n\"The majority will be sold in the UK – we are a very British company and prefer for them to be sold here, but they will also be going out around the world.\" \nBuilding each bike is a two-day process from start to finish and the new models will be built in a new 10,000 sq ft factory that has just been completed next to Norton's base at Hastings House. It sits on the Donington Hall estate, a stone's throw from Donington Park race track. \nHe bought Norton in 2008, from American businessman Ollie Curme, who had tried and failed to re-launch it in North America. \nStuart has since invested millions in the venture, initially opening a factory at Donington Park, where the first bikes rolled off the production line in 2010. \nThen, in early 2013, Norton announced it had bought Donington Hall – the former headquarters of BMI – from International Airlines Group, parent company of British Airways. \nThat deal included the 18th century hall, and the Hastings House office block, as well as 25 acres of grounds. \nThe business moved into Hastings House later that year, while Stuart made the historic 203-room hall his home. \nTwo years ago, Norton had 40 staff. Today it has more than three times that. \nThe next stage in the story is the new-build production block, which came about as a result of a £7.5 million project announced last year to help push Norton's ongoing bid for global growth. \nThat included £4 million from the Government's Advanced Manufacturing Supply Chain Initiative (AMSCI) – a scheme set up to improve the global competitiveness of UK advanced manufacturing supply chains. \nIt is helping Norton overcome the problem of a lack of traditional suppliers of things such as seats, wheels and exhaust pipes. \nAs a result, the business has been able to build the new plant and launch the British Motorcycle Manufacturing Academy (BMMA) to train and supply the next generation of engineering apprentices for Norton Motorcycles and its suppliers. \nIt is also developing new clean motorcycle engine technology in the UK to power a new green motorcycle. \nStuart said: \"The new factory is all part of that scheme and has been in the build stages for the last four or five months. \n\"We are fitting it out just now so it will be open for business in the next couple of weeks.\" \nIt will become the company's main weld shop and will also have things such as computer-controlled cutting equipment operating out of it as well as storage and other facilities. \nHe said: \"Part of the overall plan will be providing training, and the second floor of Hastings House will be our new academy. \n\"We are doing about 40 apprenticeships a year, and have just taken on our third tranche of 40. \n\"The first tranche have moved to full time jobs within the business and that has been a real success. \n\"They do things ranging from welding and engine building to sub-assembly, production and even some design – it's pretty much a broad mix, for a fully fitted out motorcycle.\" \nToday the business has more than 120 staff and is growing turnover exponentially thanks to bikes such as the Dominator and three versions of the Commando. \nThe models range in price from £14,495 to £26,000, reflecting Norton's place at the premium end of the market. \nSince relaunching the brand, the business has produced around 2,000 bikes. \nStuart said: \"Everything is made to order and we are on course to do about 1,000 a year and have ambitions to take that to 4-5,000 in the next few years. \n\"But alongside that we are trying to grow the supply trade. We have to help our suppliers grow at the same time as building their confidence in us. \n\"It's been a long journey, but 83 per cent of the parts on our bikes are British-made and we are very proud of that and want to push that even further. \n\"So in things like wheel building we have trained our senior staff and are now teaching what they know in the academy, so that as a nation we do not lose those skills. \n\"It is sad that some of those skilled jobs are fading away. \n\"We acknowledge that we would not be here without the supply chain, and vice-versa. \n\"We have an open mind on making sure our suppliers are happy. If you lose your exhaust supplier, there is nowhere else to go.\" \nThe business is much more than just a bike builder and has tried to copy the best elements of business from around the world – elements such as British design, Japanese manufacturing, Italian brand values and American marketing. \nThat is reflected in three new Norton shops opening in London, Barcelona and Madrid. \nNorton Clothing, part of the Pepe Jeans Group stable of brands, has already opened a trendy store in Barcelona and is in the process of repeating that in Madrid. \nA new Norton store at 47 Beak Street, Soho, opens on Thursday and will go one step further. \nOn top of giving people the chance to pick up biker-inspired clothing, there will also be a whisky bar. \nAnd on top of that, bikers not enjoying the bar will be able to take a Norton for a test drive from the shop and buy one. \nStuart hopes it will tap into an inner London clientele with cash in their pockets. \nThe shop's trendy neighbours include Bob Bob Ricard and Vinoteca restaurants, and Paul Smith and Sweaty Betty stores. \nStuart said: \"We will be doing bike sales from the store, and there will be bike rides and chats and a branch of the Norton Owners Club. \n\"It's a new proposition, and Norton clothing will be there too and the Glenfiddich bar. Aston Martin has just moved in around the corner to Dover Street, so we are right in the place to be. \n\"Taking the brand into London gives us a much wider audience. \n\"There is obviously a lot of money in London and although we're looking for that money, we also want the brand window to show people that Norton is back. \n\"We have been living down in London for the past two weeks – the weld shop at Castle Donington has made a lot of the furniture, for instance, to give it a real bike shop feel. \n\"It's a reasonably chunky investment, but we feel it's good value in terms of brand investment.\"", "external_links": [], "published": "2016-09-27T13:00:00.000+03:00", "crawled": "2016-09-27T08:15:51.116+03:00", "highlightTitle": ""}