{"organizations": [], "uuid": "e4bec66390f10b94e10bc1076daf4bea2bc16f84", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article11851946.ece/ALTERNATES/s1200/JS98821073.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/north-east-devolution-what-happens-11851928", "country": "GB", "domain_rank": 21960, "title": "North East devolution: What happens next after Government deadline is missed?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "North East devolution: What happens next after Government deadline is missed?", "spam_score": 0.0, "site_type": "news", "published": "2016-09-07T03:35:00.000+03:00", "replies_count": 0, "uuid": "e4bec66390f10b94e10bc1076daf4bea2bc16f84"}, "author": "Keiran Southern", "url": "http://www.chroniclelive.co.uk/news/north-east-news/north-east-devolution-what-happens-11851928", "ord_in_thread": 0, "title": "North East devolution: What happens next after Government deadline is missed?", "locations": [], "entities": {"persons": [{"name": "mike barker", "sentiment": "none"}, {"name": "terry collins", "sentiment": "none"}, {"name": "cllr martin gannon", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "north tyneside", "sentiment": "none"}, {"name": "sheffield", "sentiment": "none"}, {"name": "sunderland civic centre  the north east", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "south tyneside", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}], "organizations": [{"name": "sunderland", "sentiment": "none"}, {"name": "liverpool", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "north east combined authority", "sentiment": "none"}, {"name": "local government", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The Government had given North East authorities a strict deadline - sign up or the deal is off - and that has now passed Shares Comments Get daily news by email L-R Terry Collins, Cllr Martin Gannon and Mike Barker during a North East Combined Authority meeting at Sunderland Civic Centre \nThe North East devolution deal has been thrown into doubt after council leaders voted against moving with the plans. \nThe Government had set a deadline for the deal to be pushed through - a deadline that has now passed. \nIt means the future of devolution in the region is up in the air. \nSo here is what we know. What happened today? \nThe leaders of the North East Combined Authority , made up of the region’s seven councils, held a vote on moving the devolution deal forward to the public consultation stage. They were split 4-3, with Newcastle, Northumberland and North Tyneside voting in favour while Sunderland, Durham, South Tyneside, Gateshead voted against. \nThey had already signed off on the devolution deal, this was just the next stage. What happens next? \nThat’s the multi million - or should that be £3.4bn - pound question. The Government has been notified of the decision, and now the ball is in their court. Its initial reaction was not particularly illuminating. \nA Department for Communities and Local Government spokesman said: “It is disappointing that some North East councils have been unwilling to support this deal, which would certainly have benefitted local people. \n“If councils in the region wish to discuss devolution proposals further, our door remains open.” What is at stake? Video loading Click to play Tap to play The Live Event you are trying to watch is either unavailable or has not started Please refresh this page in your browser to reload this live event video \nBillions of pounds for the region. The money is a mix of new funds as well as greater control over existing cash. \nElsewhere in the country in the likes of Manchester, Liverpool and Sheffield, the devolution process is going a lot smoother than in the North East, and it is expected their regional mayors will be in place in 2017. Why did some leaders say no? \nThe leaders of the region’s local authorities have consistently failed to come to an agreement over the multi-billion pound deal - with some accepting it in its current form and others wanting more assurances from the Government on post-Brexit funding. The region benefited greatly from European funding which it is soon to lose. And the non-negotiable requirement of an elected Mayor was a major bone of contention too. Could the North East get a mayor in 2017? \nIt’s possible, but highly unlikely. That would mean the Government rushing through the process and offering another deal to satisfy the authorities who voted no on Tuesday. Could we see a North/South split between the authorities who voted yes and the ones who voted no? \nYes. \nAs it stands, the law states two combined authorities cannot overlap, and devolution depends on having a mayoral combined authority. \nBut it is possible we could see a split between consenting authorities and non-consenting authorities. \nThis would not happen overnight and if it was to come about would take many years.", "external_links": [], "published": "2016-09-07T03:35:00.000+03:00", "crawled": "2016-09-06T23:18:33.838+03:00", "highlightTitle": ""}