{"organizations": [], "uuid": "c3e90586735facda87d9ea0250bca3cf38b5b7a1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article11844682.ece/ALTERNATES/s1200/Sainsburys-management-training.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/business-breakfast-live-sainsburys-sales-11943400", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Sainsbury's sales suffer in price war, UK Mail acquired, plus other latest news", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast LIVE: Sainsbury's sales suffer in price war, UK Mail acquired, plus other latest news", "spam_score": 0.0, "site_type": "news", "published": "2016-09-28T07:00:00.000+03:00", "replies_count": 0, "uuid": "c3e90586735facda87d9ea0250bca3cf38b5b7a1"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/business-breakfast-live-sainsburys-sales-11943400", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Sainsbury's sales suffer in price war, UK Mail acquired, plus other latest news", "locations": [], "entities": {"persons": [{"name": "coreena ford", "sentiment": "negative"}, {"name": "mike coupe", "sentiment": "none"}, {"name": "margherita", "sentiment": "none"}, {"name": "coun paul watson", "sentiment": "none"}, {"name": "jurgen gerdes", "sentiment": "none"}, {"name": "cllr paul watson", "sentiment": "none"}, {"name": "dan o’donoghue", "sentiment": "none"}, {"name": "bob mackenzie", "sentiment": "none"}, {"name": "ross mcewan", "sentiment": "none"}, {"name": "argos", "sentiment": "none"}, {"name": "coupe", "sentiment": "none"}, {"name": "coun watson", "sentiment": "none"}], "locations": [{"name": "uk mail", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "sunderland civic centre", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north tyneside", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "south tyneside", "sentiment": "none"}, {"name": "neca", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}], "organizations": [{"name": "north east combined authority", "sentiment": "negative"}, {"name": "sainsbury", "sentiment": "negative"}, {"name": "deutsche post", "sentiment": "none"}, {"name": "coreena ford rbs", "sentiment": "none"}, {"name": "sunderland council", "sentiment": "none"}, {"name": "uk mail", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "rbs", "sentiment": "none"}, {"name": "royal bank of scotland", "sentiment": "none"}, {"name": "royal mail", "sentiment": "none"}, {"name": "deutsche bank", "sentiment": "none"}, {"name": "doj", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "the north east combined authority", "sentiment": "none"}, {"name": "national credit union administration board", "sentiment": "none"}, {"name": "us central federal credit union and western corporate federal credit union", "sentiment": "none"}, {"name": "neca", "sentiment": "none"}, {"name": "argos", "sentiment": "none"}, {"name": "federal housing finance agency", "sentiment": "none"}, {"name": "us department of justice", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "8.50 Coreena Ford Is the North East Combined Authority now on the verge of collapse \nThe body supposed to unite the region’s seven local authorities now appears to be on the verge of collapse. \nThree members of the North East Combined Authority (NECA) - Newcastle, Northumberland and North Tyneside - held breakaway talks with the Government to sign an alternative devolution deal after plans for a wider regional package fell through. \nOn hearing the news, Coun Paul Watson, the chairman of NECA and leader of Sunderland council, said it “would not be right” to stand in their way if they wanted to go it alone. \nThe original devolution plan was abandoned after Gateshead, Sunderland, Durham and South Tyneside councils voted to delay implementation. It would have included the creation of a regional North East mayor. \nCoun Watson said: “The North East Combined Authority continues to support the principle of a devolution deal that would benefit the whole of the North East region. \n“Personally I believe we stand more chance of creating a stronger regional economy and increasing our health, wealth and prosperity by continuing to work together. \n“But if any of the member authorities decide they want to go it alone I don’t believe it would be right or proper to stand in their way.” \nRead the full story by Dan O’Donoghue here . Cllr Paul Watson during a North East Combined Authority meeting at Sunderland Civic Centre 8.45 Coreena Ford RBS agrees £845m deal with US regulator \nRoyal Bank of Scotland is to pay 1.1 billion US dollars (£845 million) to a US regulator to settle two claims over mis-sold mortgage bonds in the run-up to the financial crisis. \nThe taxpayer-backed lender reached the agreement with the National Credit Union Administration Board, which regulates credit unions in America. \nRBS sold the mortgage securities to the US Central Federal Credit Union and Western Corporate Federal Credit Union, but the bonds later proved toxic and failed after the US housing bubble burst in 2008. \nThe bank, which does not admit fault under the deal, said the settlement is “substantially” covered by the £3.8 billion already put aside to cover upcoming litigation. \nBut RBS still faces potentially mammoth settlements over mis-selling of mortgage securities turned sour in the US, with claims still outstanding with the Federal Housing Finance Agency and US Department of Justice (DoJ). \nRBS boss Ross McEwan said at a conference in London on Tuesday that the group was working to resolve outstanding claims this year and into 2017, but warned it could create “substantial additional conduct provisions and noise”. \nBanking experts believe the DoJ settlement could total around £9 billion. Its shares have been under pressure after the DoJ hit German rival Deutsche Bank with a 14 billion US dollar (£10.8 billion) penalty for mis-selling mortgage-backed securities. \nFears over the impact on Deutsche Bank have sent its shares tumbling close to 30-year lows. RBS, which is still 73% owned by the Government, reiterated in the latest settlement announcement that ongoing lawsuits might force it to put more cash aside. Ross McEwan Chief Executive Of RBS 8.40 Coreena Ford AA back in the black \nThe AA has driven back into profit after the breakdown service said it has reversed a decline in falling membership numbers. \nThe group said pre-tax profits came in at £48 million for the first half of the year, compared with a £69 million loss in the same period last year. \nAA said paid personal members grew in every month in the second quarter to 3.3 million, reversing a trend of falling numbers. \nRevenue rose 2.2% to £467 million and Chief executive Bob Mackenzie brushed aside any Brexit fears. \nHe said: \nWe are extremely encouraged by the reversal of the decline in paid personal members over the last few months. \nThe marketing strategy is achieving a significant impact on new business, and we are continuing to improve customer experience through digital innovation. \nOverall the performance of the business has been robust in the first half and we continue to trade in line with expectations. \nTo date we see no impact on our operations from any Brexit-related issues and, as we look forward, we believe we are creating significant momentum for the 2018 financial year. The AA has driven back into profit 8.35 Coreena Ford German giant takes over UK Mail in £242.7m deal \nDeutsche Post has wrapped up a £242.7m deal to acquire UK Mail for £242.7 million, a move that will see it go parcel-to-parcel with Royal Mail. \nThe German postal giant said that it is snapping up UK Mail as part of a European expansion drive. \nDeutsche Post board member Jurgen Gerdes said: \nThe ongoing expansion of our parcel network in Europe is driven by increasing demand within our e-commerce customer base for cross-border deliveries. UK Mail is a well-run business and an established provider of quality delivery services in the UK and offers a complementary fit with our integrated offering. \nUK Mail was dogged by technical problems at a new sorting centre last year which meant bulky parcels had to be handled manually, resulting in higher costs that ate into profits. \nThe tie-up will see UK Mail shareholders receive 440p a share in cash and the offer assumes that they will also be entitled to receive an interim dividend of 5.5 pence per UK Mail share. \nUK Mail directors are advising shareholders to vote in favour of the deal as they deem it “fair and reasonable”. UK Mail premises Sainsbury's sales falter in battle of the shopping baskets. . . \nFirst up this morning is a Sainsbury’s trading statement. \nThe supermarket chain has posted a second consecutive quarterly fall in sales as it remains under pressure amid the bitter supermarket war and food price deflation. \nBritain’s second biggest supermarket, which recently completed a £1.4 billion takeover of Argos, reported a 1.1% drop in like-for-like sales excluding fuel for the second quarter. \nBoss Mike Coupe said: “We continue to make progress against our strategy and, while like-for-like sales were down 1.1%, driven by food price deflation, we delivered like-for-like transaction growth across all channels and total volume growth.” \nSainsbury’s added that Argos notched up like-for-like sales growth of 2.3% during the period, with Mr Coupe saying the group will open 200 new digital collection points by the end of the year. \nThirty Argos digital outlets will be open in Sainsbury’s stores by Christmas. \nThe grocer is slugging it out with rivals in a brutal price war which has eroded margins at all of the so-called big four supermarkets. \nSainsbury’s pledged to “remain competitive”, adding that it has made further investments in the prices of everyday items such as broccoli, onions and its frozen deep pan Margherita pizza. \n“We expect the market to remain competitive and the effect of the devaluation of sterling remains unclear. \nHowever, Sainsbury’s is well positioned to navigate the changing marketplace and we are confident that our strategy will enable us to continue to outperform our major peers,” Mr Coupe said. Sainsbury's has pledged to remain competitive", "external_links": [], "published": "2016-09-28T07:00:00.000+03:00", "crawled": "2016-09-28T11:05:07.471+03:00", "highlightTitle": ""}