{"organizations": [], "uuid": "99969261b113c2daa00e0b4f655a86059a9c2531", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article11957446.ece/ALTERNATES/s1200/JS101022819.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/more-1000-jobs-planned-port-11957398", "country": "GB", "domain_rank": 21960, "title": "More than 1,000 jobs planned in Port of Tyne energy plant scheme", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "More than 1,000 jobs planned in Port of Tyne energy plant scheme", "spam_score": 0.0, "site_type": "news", "published": "2016-09-29T23:13:00.000+03:00", "replies_count": 0, "uuid": "99969261b113c2daa00e0b4f655a86059a9c2531"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/more-1000-jobs-planned-port-11957398", "ord_in_thread": 0, "title": "More than 1,000 jobs planned in Port of Tyne energy plant scheme", "locations": [], "entities": {"persons": [{"name": "tyne", "sentiment": "none"}, {"name": "andrew moffat", "sentiment": "none"}], "locations": [{"name": "port of tyne", "sentiment": "none"}, {"name": "north tyneside", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "tyne tunnel", "sentiment": "none"}, {"name": "howdon", "sentiment": "none"}, {"name": "wallsend", "sentiment": "none"}, {"name": "east howdon community centre", "sentiment": "none"}], "organizations": [{"name": "port of tyne", "sentiment": "none"}, {"name": "galliford try", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "More than 1,000 jobs planned in Port of Tyne energy plant scheme 16:13, 29 Sep 2016 Plans for the renewable energy plant at Wallsend are to go on display to the public Share Get business news by email How the proposed energy plant at Howdon would look \nMore than 1,000 jobs could be created through a new renewable energy plant planned for North Tyneside . \nThe Port of Tyne is seeking planning permission to develop a 25 megawatt power plant in Howdon , which would generate enough electricity to power 50,000 homes using technology that converts waste into energy. \nThe project would create 470 jobs in construction, 50 new permanent jobs once in operation and 732 jobs in the regional supply chain. \nConsultations are now under way on the application to build the 25 megawatt power plant on the site of the former Howdon Yard. \nThe proposals have the potential to regenerate a site that has not had a permanent use for decades, and is limited for other types of development due to its proximity to the Tyne Tunnel and other major utility service channels under the surface. \nThe Port of Tyne said the proposals – due to go on show to the public next week – will also deliver the opportunity to use heat generated from the plant to create a direct heating scheme for a building or project nearby. \nPort of Tyne chief executive Andrew Moffat said: “This proposal would bring the site back into viable use, sustaining local employment and creating further economic benefits for the local economy. It would be an important contributor to the UK’s energy supply. \n“We are keen that the local community also benefits from this project not only in terms of the jobs being created but by other means and that’s why we are establishing a community fund specifically for the purpose of making a difference in the nearby local community.” Read More Construction firm Galliford Try brushes off Brexit with contracts worth £60m \nThe proposed power plant uses gasification processes which turn waste into gas without actually burning it. No waste externally would be stored on the site as it would be transported in sealed bales directly into the fully enclosed facility. \nThe plant is designed to minimise any environmental impacts such as smell, dust or noise so that any potential emissions are well within national and European air quality standards. If plans are approved, the facility could be under construction by autumn 2017. \nThe Port of Tyne will have the plans on display and the project team on hand to answer questions at East Howdon Community Centre on October 5 between 2.30 pm and 7pm. \nInterested in North East jobs? Find job vacancy listings across a range of sectors here .", "external_links": [], "published": "2016-09-29T23:13:00.000+03:00", "crawled": "2016-09-29T18:34:53.583+03:00", "highlightTitle": ""}