{"organizations": [], "uuid": "0873a236ef698866e8ca361e41323a13077e1927", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article11839619.ece/ALTERNATES/s1200/ECP_NEC_200516council_012JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/north-east-agree-elected-mayor-11838937", "country": "GB", "domain_rank": 21960, "title": "Will the North East agree to an elected Mayor and does it really want one?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Will the North East agree to an elected Mayor and does it really want one?", "spam_score": 0.0, "site_type": "news", "published": "2016-09-04T17:05:00.000+03:00", "replies_count": 0, "uuid": "0873a236ef698866e8ca361e41323a13077e1927"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/north-east-agree-elected-mayor-11838937", "ord_in_thread": 0, "title": "Will the North East agree to an elected Mayor and does it really want one?", "locations": [], "entities": {"persons": [{"name": "martin gannon", "sentiment": "none"}, {"name": "michael heseltine", "sentiment": "none"}, {"name": "farr", "sentiment": "none"}, {"name": "martin farr", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "cllr nick forbes", "sentiment": "none"}, {"name": "george osborne", "sentiment": "none"}, {"name": "north", "sentiment": "none"}, {"name": "osborne", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "gateshead civic centre", "sentiment": "none"}, {"name": "durham county hall", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "durham county hall  while", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "south tyneside", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "liverpool", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "neca", "sentiment": "none"}, {"name": "teesside", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "none"}, {"name": "newcastle university", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "gateshead council", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "neca", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "north east combined authority", "sentiment": "none"}, {"name": "gateshead council annual meeting", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Will the North East agree to an elected Mayor and does it really want one? 10:05, 4 Sep 2016 On Tuesday, the region's seven local authorities must decide whether to commit to the 'Northern Powerhouse' Shares Get daily news by email Gateshead Council Annual Meeting at Gateshead Civic Centre, Martin Gannon, new leader of Gateshead Council \nIt’s D-Day for devolution on Tuesday and a local Government shake-up which could see two newly established elected Mayors in the region. \nA strict deadline has been set for that day by the Government to the North East - either sign up or the deal is off. \nThe agreement would guarantee £30m a year for the region to spend – in addition to being given control of a £3.4bn pool of investment cash. \nThe North East would also get new powers covering employment and skills, transport and planning and business activity – all intended to drive economic growth. \nHowever, an integral part of the deal is an elected Mayor which, to understate, has caused much disquiet. \nEven at the eleventh hour, there is still an element of doubt over whether the North East Combined Authority (NECA) will agree to the move. \nAnd to further muddy the waters, last week there was a suggestion the Government was perhaps cooling on the idea. \nOf the seven local authorities which make up NECA - Newcastle, Gateshead, Sunderland, North and South Tyneside, Durham, Northumberland - Gateshead actually rejected the idea although there are suggestions it now wants to rejoin the process. \nThen last week the Government withdrew legislation to create an elected mayor. The NECA leadership board meeting on the devolution decision at Durham County Hall \nWhile it claimed there was nothing suspicious about it and the legislation would be put back on the statute book when the councils give the go ahead, opponents pounced saying it was evidence the Government was backtracking on the idea, the centrepiece of former Chancellor George Osborne’s Northern Powerhouse initiative. \nOne political expert said he would not be surprised if new Prime Minister Theresa May might be having second thoughts. \nDr Martin Farr, of Newcastle University, said: “It was George Osborne’s idea in the first place and also most of the elected Mayors will be from the Labour party. \n“This gives Labour an alternative power base outside Parliament and if they do the job well it might make the party seem competent and thereby electable. I don’t think this is what Theresa May would want.” \nDr Farr added: “It is seen as a way of energising local democracy which has been emasculated for decades. \n“The idea (for devolving power to the regions) isn’t new - Michael Heseltine had it in the 1980s and he has been Osborne’s political inspiration.” \nHowever devolution, and in particular elected Mayors, are not something that have fired the imagination of the public. \nThe leaders of the region’s local authorities have consistently failed to come to an agreement over the multi-billion pound deal - with some accepting it in its current form and others wanting more assurances from the Government. The NECA leadership board meeting on the devolution decision at Durham County Hall, Cllr Nick Forbes \nBut what would happen if there is no agreement on Tuesday? \n“If there is no agreement then the government has indicated there will be no deal, that is the end of it,” we have been told. \nNeighbouring Teesside would get its elected mayor and join the likes of Manchester and Liverpool. \nThe North East will be left behind and the immediate consequence would be no job creation funding or powers in a region with highest unemployment rate in the UK. \nSome have speculated if there is no unanimous agreement there would be fresh negotiations on a new deal between those who want the deal. However that, to say the least, would be a long shot. \nIt was in May that Gateshead Council walked out on negotiations saying the Government’s financial settlement for the region was “not good enough”. Read More Devolution bust-up: North East mayor will go ahead insists senior Conservative \nA report set to go before Gateshead’s cabinet on Tuesday - the same day as the Government’s deadline for a decision - recommends that the authority rejoins the process. \nGateshead Council leader Martin Gannon said last week: “There will be a report before cabinet on Tuesday which will give us the option to remain part of the process. \n“We made the decision we did back in May as we wanted more assurances. \n“We don’t like the idea of the elected mayor without some kind of referendum and mandate from the people, it is a governance change for the whole region. \n“The financial position is worse if anything post-Brexit, but there have been assurances given and we have been told that one fifth of the schemes funded by the EU will be met by the Government, beyond 2020 we don’t know what will happen.”", "external_links": [], "published": "2016-09-04T17:05:00.000+03:00", "crawled": "2016-09-04T12:53:10.861+03:00", "highlightTitle": ""}