{"organizations": [], "uuid": "5ea8c328e4d68c981675a6929c272b1a9b412634", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article10396740.ece/ALTERNATES/s1200/JS75068169.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/north-east-devolution-scrapped-start-11866134", "country": "GB", "domain_rank": 21960, "title": "North East devolution scrapped: Where did it start and how did it go wrong?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "North East devolution scrapped: Where did it start and how did it go wrong?", "spam_score": 0.0, "site_type": "news", "published": "2016-09-09T23:24:00.000+03:00", "replies_count": 0, "uuid": "5ea8c328e4d68c981675a6929c272b1a9b412634"}, "author": "Laura Hill", "url": "http://www.chroniclelive.co.uk/news/north-east-news/north-east-devolution-scrapped-start-11866134", "ord_in_thread": 0, "title": "North East devolution scrapped: Where did it start and how did it go wrong?", "locations": [], "entities": {"persons": [{"name": "coun martin gannon", "sentiment": "none"}, {"name": "jack", "sentiment": "none"}, {"name": "david cameron", "sentiment": "none"}, {"name": "coun simon henig", "sentiment": "none"}, {"name": "phillip hammond", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "sajid javid", "sentiment": "none"}, {"name": "coun mick henry", "sentiment": "none"}, {"name": "javid", "sentiment": "none"}, {"name": "george osborne", "sentiment": "none"}, {"name": "gareth fuller/pa wire sajid javid", "sentiment": "none"}, {"name": "john prescott", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north tyneside", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "south tyneside", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "neca", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}], "organizations": [{"name": "cabinet", "sentiment": "none"}, {"name": "durham county council", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "northern powerhouse", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "gateshead council", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "museum of science and industry", "sentiment": "none"}, {"name": "assembly", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "north east combined authority", "sentiment": "none"}, {"name": "whitehall", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "As the North East devolution deal is scrapped we look back over the last twelve years of political decision making Shares Get daily news by email Chancellor George Osborne signs the Devolution agreement for the North East \nA timeline of devolution proposals for the North East and the countdown to how the latest deal went wrong. November, 2004 - North East votes ‘no’ to a regional assembly \nThe first time the region was offered a devolution deal of sorts was twelve years ago. \nDeputy prime minister John Prescott pushed the idea of English regional assemblies, following the creation of the London Assembly and election of a London Mayor in 1998. \nThe North East of England was the first to have its say on whether it wanted a regional assembly, and the answer was a resounding no, with 77% of voters shunning the idea. May, 2010 - Coalition Government elected \nWith the Liberal Democrats taking some power in 2010, local government reform was back on the agenda. \nTory Chancellor George Osborne became the unlikely champion of decentralising power from Whitehall out to regions during his six years as Chancellor of the Exchequer. Gareth Fuller/PA Wire Sajid Javid arriving in Downing Street November 2011 - City deals \nParliament passed the Localism Act in 2011 with the aim of devolving powers out to the regions. \nPlanning, housing and business rates were key issues that Whitehall hoped to see dealt with on a local level. April 2014 - North East Combined Authority formed \nThe North East Combined Authority (NECA) came into being, made up of the region’s seven councils - Durham, Gateshead, South Tyneside, North Tyneside, Sunderland, Newcastle and Northumberland. \nIt is a strategic authority with powers over transport, economic development and regeneration. \nIt was formed amid calls for the region to have a united voice in the wake of the Government’s abolition of regional development agencies such as One North East. \nPlans to “wrestle more control from Whitehall” were swiftly put into action by the group’s first chair, Durham County Council leader Coun Simon Henig. June 2014 - The “Northern Powerhouse” is born. \nChancellor George Osborne coins the phrase, Northern Powerhouse , in a speech at Manchester’s Museum of Science and Industry, using it to describe his vision of a prosperous new north of England. \nIt soon gathered traction and though doubters dismissed it as a meaningless phrase, the former Chancellor’s subsequent devolution deals are often seen as part of the “Northern Powerhouse” ideal. Rui Vieira/PA Wire A voter placing a ballot paper in the ballot box September 2014 - Scottish referendum \nAfter a tightly fought political battle Scotland chose to remain as part of the UK, voting 55.3% to 44.7% in favour. \nTwo days before the referendum, the leaders of the three main UK political parties publicly pledged to devolve “extensive new powers” to the Scottish Parliament. The ‘bandwagon’ of devolution begins to gather pace. October 2015 - Done deal? \nChancellor George Osborne hailed the ‘unstoppable momentum’ in the drive to strike devolution deals with cities and regions as the North East became the latest region to make a historic agreement with the government to take on new powers. \nThe deal, which had to include an elected Mayor, would see the North East receive £30m a year over the next 30 years. \nIt provided for the transfer of significant powers over transport, strategic planning, employment and skills from central government to the region. It was also said to pave the way for further devolution over time, and for the reform of public services, including potentially health and social care, to be led by the North East. \nThe document stressed that final agreement on the deal relied on the bill passing, public opinion and agreement from each of the councils. Read More North East devolution - council leaders slammed as public has its say on collapse of deal March 2016 - Gateshead rejection raises doubts \nAround six months after signing on the dotted line, Gateshead Council threw the deal into doubt after the Cabinet voted to reject the proposals. \nA motion was moved by deputy leader Coun Martin Gannon - who subsequently became leader after Coun Mick Henry stood down - in which he said that the deal on the table “does not represent genuine devolution, poses a threat to democracy and proposes governance that lacks accountability”. Yui Mok/PA Wire The Union Jack pictured next to the European Union flag June 2016. Brexit \nThe UK vote to leave the European Union caused massive Government upheaval leading to the resignation of Prime Minister David Cameron, Chancellor George Osborne being pushed out and dozens of unanswered questions about the future of EU funding upon which this region heavily depended. \nLeaders of the region’s seven councils chose to freeze discussions over devolution for the North East looking for further assurances over funding in the aftermath of the EU referendum result. August 2016 - Reassurances \nReassurances were offered by new Prime Minister Theresa May , Chancellor of the Exchequer Phillip Hammond and Secretary of State for Communities and Local Government Sajid Javid about devolution. \nMr Javid, held talks with council leaders, though the members of NECA were divided on how positive the talks had been. September 2016 - The deal is off \nBy a 4-3 vote, NECA chose not to push ahead straight away with the devolution deal. Although claiming to back the idea in principle, they wanted it to be put out to public consultation. \nThe decision meant it missed the Government’s deadline to sign up and, while initially Mr Javid said the door was open” in the future, he withdrew the deal on Thursday.", "external_links": [], "published": "2016-09-09T23:24:00.000+03:00", "crawled": "2016-09-09T19:09:04.115+03:00", "highlightTitle": ""}