{"organizations": [], "uuid": "5e52825c1c5cebe38ec684002462aae1a569c4df", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article11826289.ece/ALTERNATES/s1200/JS91507950.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/business-breakfast-live-wetherspoons-chief-11858702", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Devolution deal collapse \"bad news\" for North East", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast LIVE: Devolution deal collapse \"bad news\" for North East", "spam_score": 0.0, "site_type": "news", "published": "2016-09-09T15:20:00.000+03:00", "replies_count": 0, "uuid": "5e52825c1c5cebe38ec684002462aae1a569c4df"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/business-breakfast-live-wetherspoons-chief-11858702", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Devolution deal collapse \"bad news\" for North East", "locations": [], "entities": {"persons": [{"name": "andy griffiths", "sentiment": "none"}, {"name": "keith hellawell", "sentiment": "none"}, {"name": "greene king", "sentiment": "none"}, {"name": "simon hanson", "sentiment": "none"}, {"name": "gary elden", "sentiment": "none"}, {"name": "ross smith", "sentiment": "none"}, {"name": "elden", "sentiment": "none"}, {"name": "george osborne", "sentiment": "none"}, {"name": "anna", "sentiment": "none"}, {"name": "mike ashley-owned", "sentiment": "none"}, {"name": "wetherspoon tim martin", "sentiment": "none"}, {"name": "martin", "sentiment": "none"}, {"name": "paul lancaster", "sentiment": "none"}, {"name": "wetherspoon", "sentiment": "none"}, {"name": "sajid javid", "sentiment": "none"}, {"name": "tim martin", "sentiment": "none"}, {"name": "coreena ford wetherspoon", "sentiment": "none"}, {"name": "javid", "sentiment": "none"}, {"name": "jd wetherspoon", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "tees valley", "sentiment": "none"}, {"name": "north east england", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "usa", "sentiment": "none"}, {"name": "south east", "sentiment": "none"}, {"name": "south tyneside", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}], "organizations": [{"name": "coreena ford pound", "sentiment": "negative"}, {"name": "cbi", "sentiment": "none"}, {"name": "greene king", "sentiment": "none"}, {"name": "north east combined authority - durham", "sentiment": "none"}, {"name": "coreena ford finance", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}, {"name": "dclg", "sentiment": "none"}, {"name": "chamber of commerce", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "north east combined authority", "sentiment": "none"}, {"name": "council leaders", "sentiment": "none"}, {"name": "coreena ford greene king", "sentiment": "none"}, {"name": "federation of small businesses", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "wto", "sentiment": "none"}, {"name": "fsb", "sentiment": "none"}, {"name": "northern powerhouse", "sentiment": "none"}, {"name": "oecd", "sentiment": "none"}, {"name": "necc", "sentiment": "none"}, {"name": "coreena ford", "sentiment": "none"}, {"name": "coreena ford devo", "sentiment": "none"}, {"name": "imf", "sentiment": "none"}, {"name": "agm", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "9.17 Coreena Ford Pound and FTSE latest \nThe pound at 9am was 1.3297 dollars compared to 1.3299 dollars at the previous close. The euro at 9am was 0.8475 pounds compared to 0.8467 pounds at the previous close. \nThe FTSE-100 index at 8:45am was down 19.45 at 6839.25. 9.14 Coreena Ford Finance recruitment in slowdown \nRecruitment firm SThree has said a hiring slowdown in Britain’s banking and finance sector following the EU referendum has dented its profits. \nThe company reported an overall 2% drop in gross profit to £66 million in the three months to August 31, while its UK business saw a 9% fall compared with the same period last year. \nChief executive Gary Elden said “mixed trading conditions” continued into the third quarter. \n“The uncertainty created by the EU referendum impacted our UK business, and our USA growth rate reflects the ongoing weakness in the energy and banking and finance markets,” Mr Elden said. \nSThree has downsized its operations in the UK and Ireland, which now account for 24% of the total business, down from 28% during the same period last year. It was part of a strategic decision to reduce permanent staff in the region, with sales staff cut by 10% since last year. \nMr Elden cheered strong growth in the company’s continental European business, which saw a 12% rise in gross profit to £32.9 million. \nAbout 50% of SThree’s business is conducted in Europe. \n“Looking ahead, the continued momentum of our contract business, the strength of our performance in continental Europe and the benefit of restructuring measures taken earlier in the year, leave us well-positioned for our seasonally most significant fourth quarter,” Mr Elden said. \nThe company has left its full-year outlook unchanged. 9.12 Coreena Ford Sports Direct shareholder holds \"trust\" talks \nAn influential shareholder group has said that it held “constructive” talks with the board of Sports Direct following the retailer’s annual general meeting and open day on Wednesday. \nThe Investor Forum, consisting of investors holding assets worth more than £14 trillion, said discussions centred on how “trust can be re-built in the company and board”. \nThe announcement comes after independent shareholders rebelled at the Mike Ashley-owned retailer’s AGM, with 53% opposing the re-election of chairman Keith Hellawell. \nAndy Griffiths, Forum’s executive director, said: \nIndependent shareholders have sent a clear message to the board of Sports Direct through their votes at the AGM and in their public statements. \nWe are encouraged by Sports Direct’s recent open approach, publishing the working practices report and hosting an open day. These, however, are only the first steps in a long journey towards rebuilding trust and shareholder value. 9.04 Coreena Ford Greene King cheers \"strong start\" \nMore pub news, this time from Greene King which has said consumer confidence took a hit after the Brexit vote and warned spending could slow in the months ahead. \n“As expected, uncertainty surrounding the UK’s future withdrawal from the European Union has translated into a softening of some economic indicators and a reduction in consumer confidence,” it said. \nThe pub group said the “broader implications” of the Brexit vote were still unclear, but noted that recent industry surveys “have flagged risks to leisure spend and we are alert to a potentially tougher trading environment ahead”. \nNevertheless, Greene King celebrated a “strong start” to the financial year thanks to better weather and the Euro 2016 football championships. \nLike-for-like sales grew 1.7% in the 18 weeks to September 4. \nGreene King is set to hold its annual general meeting today. 8.57 Coreena Ford Devo deal - reaction \nPaul Lancaster of Plan Digital, and Simon Hanson from the FSB have been voicing their opinions on Twitter. \nWhat are your thoughts? Tweet us at @jnlbusiness 8.53 Coreena Ford The shelving of the devo deal - a recap of Sajid Javid's statement \nCommunities Secretary Sajid Javid has confirmed that a planned devolution deal for the North East will not go ahead after a majority of local leaders voted against it. \nMr Javid said he was disappointed that four of the seven councils to form a planned North East Combined Authority - Durham, Gateshead, Sunderland, and South Tyneside - voted against the deal. \nHe insisted they would have received guaranteed investment of more than £1 billion and powers over transport, skills and regeneration. Legislation to devolve the powers and enable 2017 elections for a North East mayor has now been shelved. \nMr Javid said: \nLocal leaders in the North East Combined Authority have made a clear decision not to proceed with this ambitious and far-reaching devolution deal for their region - while I am disappointed, it is a decision I respect and so that deal is now off the table. \nIt is with regret that we have therefore withdrawn the legislation that would have brought this deal to life, which means local people will miss out on over £1 billion of investment, and new powers on transport, planning, and skills. \nHanding power back to Northerners is a key part of our plans to build a Northern Powerhouse and our focus now will be on working to secure a new agreement for residents in those areas committed to progressing with devolution. Anna Gowthorpe/PA Wire 8.46 Coreena Ford Devo deal failure \"bad news for the North East\" - The Chamber \nRoss Smith, Director of Policy, North East England Chamber of Commerce said the Chamber is baffled by the deal’s collapse. \nWe’re at a loss to understand why, after a year of negotiations, it has not been possible to strike a deal. It’s extremely disappointing and bad news for the North East and UK economy. \nWe sincerely hope something can be salvaged and will play whatever part we can to help. \nIt’s positive that a deal is going forward in Tees Valley though and we look forward to continuing our constructive relationship with the combined authority there as that’s implemented. Ross Smith, Director of policy NECC 8.41 Coreena Ford Devolution deal collapse - reaction \nThe North East devolution is now off the table, despite a DCLG spokesman saying that its “door remains open” for further discussion.. \nThe vote not to move ahead with the current deal means the region is unlikely to have a mayoral election and join the first phase of regional devolution next year - and leaders of five business groups have already made their feelings known about the collapse , which came when, by a vote of four to three, members of the North East Combined Authority yesterday decided not to put the plan out to public consultation. \nIn an individual statement, the Federation of Small Businesses has told of its huge disappointment - and belief that lack of a regional deal will hold us back. \nSimon Hanson, North East Development Manager, FSB said: \nIt is hugely disappointing that the North East has missed out on the opportunity to get more powers and funding to grow our economy. After a year of negotiating smaller businesses will be at a loss to understand why a deal hasn’t been possible. \nThis decision will hold back the North East and have a detrimental impact on future regional and national economic growth especially with Scotland getting more powers through its devolution deal and a deal progressing in the Tees Valley. The North East has lost the chance to deliver some real clout in growing our economy through tailored solutions like Scotland and the Tees Valley on skills, transport and investment putting it at a huge disadvantage. \nHopefully something can be salvaged from this for smaller businesses and we’ll continue to work with local Council Leaders and other business representatives in any way we can. 8.32 Coreena Ford The Union Rooms - an update on its sale \nAnd a quick update on the Union Rooms, JD Wetherspoon’s flagship building in Newcastle which has been on the market for a couple of months as part of a huge portfolio of pubs the firm is flogging. \nA spokesman told me it’s still on the market - but there has been a lot of interest. No offers have been made yet though. \nStonegate pubs yesterday announced it had bought a chunk of the portfolio, predominantly in the South East. Union Rooms - still on the market 8.28 Coreena Ford Wetherspoon raises a glass to profits of £66m \nThe Brexit-backing chairman of JD Wetherspoon Tim Martin is a happy man this morning and he’s once again launched an invective against prominent backers of the Remain campaign. \nHe’s poured scorn on their “gloomy economic forecasts” as the firm notched up solid sales and profits. \nTim Martin called out the CBI, the IMF, the OECD, the Treasury and former chancellor George Osborne - among others - for failing to “see through the flaws” of the EU, and said their economic forecasts “have been proven to be false”. \nHe said: \nAs in the case of the euro, the general public has a much better perception about this overriding factor than the consensus of intellectual opinion. \nHe also suggested that the UK does not need a trade deal with the EU, adding: “Common sense ... suggests that the worst approach for the UK is to insist on the necessity of a ‘deal’ - we don’t need one and the fact that EU countries sell us twice as much as we sell them creates a hugely powerful negotiating position. If WTO tariffs apply, the UK will receive twice as much as it pays.” \nThe prominent Leave backer made the comments alongside full-year results for the pub chain, which saw pre-tax profits rise 12.5% to £66 million after exceptional items. \nRevenues rose 5.4% to £1.6 billion and like-for-like sales grew 3.4% over the year to July. \nMr Martin said: \nI am pleased to report a year of progress for the company, with record sales, profit and earnings per share before exceptional items. \nSince the year end, Wetherspoon’s sales have continued to be encouraging and increased by 4.1%. \nHowever, he added that it remains to be seen whether this will continue over the remainder of the year, given a low-inflation environment. JD Wetherspoon chairman Tim Martin", "external_links": [], "published": "2016-09-09T15:20:00.000+03:00", "crawled": "2016-09-09T11:41:52.029+03:00", "highlightTitle": ""}