{"organizations": [], "uuid": "e230925eb4ef9e60d57d101af74c964a03907821", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article11881861.ece/ALTERNATES/s1200/JS96355993.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-losing-ground-rest-11945758", "country": "GB", "domain_rank": 21960, "title": "North East is losing ground on rest of country in attracting foreign investment", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "North East is losing ground on rest of country in attracting foreign investment", "spam_score": 0.0, "site_type": "news", "published": "2016-09-27T23:00:00.000+03:00", "replies_count": 0, "uuid": "e230925eb4ef9e60d57d101af74c964a03907821"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-losing-ground-rest-11945758", "ord_in_thread": 0, "title": "North East is losing ground on rest of country in attracting foreign investment", "locations": [], "entities": {"persons": [{"name": "ross lillico", "sentiment": "none"}, {"name": "lichfield", "sentiment": "none"}, {"name": "leps", "sentiment": "none"}, {"name": "nathaniel litchfield", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "newton aycliffe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "north west", "sentiment": "none"}, {"name": "sunderland  the north east", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}], "organizations": [{"name": "partners", "sentiment": "none"}, {"name": "department of international trade", "sentiment": "none"}, {"name": "northern powerhouse", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "redcar", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "nathaniel lichfield & partners", "sentiment": "none"}, {"name": "hexham", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "North East is losing ground on rest of country in attracting foreign investment 16:00, 27 Sep 2016 Report from economy consultancy Nathaniel Litchfield and Partners warns of duplication of effort Share Get business news by email Owen Humphreys/PA Wire Workers at Nissan's plant in Sunderland \nThe North East is losing the advantage it held over the rest of the country when it comes to foreign investment into the region’s economy , a new study suggests. \nThe report by planning and economy consultancy Nathaniel Lichfield & Partners shows that foreign direct investment (FDI) into the region declined from 14.3% of national jobs in 2009 to just 7.8% in 2015. \nForeign investment has brought in £12bn of capital investment to the North East and created 36,000 new jobs in the last decade. \nBut the Lichfield report warns that at least 14 separate organisations are working to attract foreign investment into the region and says that there is a “significant level of cross-over in targeted sectors” which could be harming efforts to bring in foreign companies. \nCiting the example of Nissan, where all 12 local authorities in the North East are benefiting from employment and supply chain opportunities to the plant after 30 years of operation, the report says that securing inward investment in any one location can benefit the region as a whole. \nIt adds that the Brexit vote in June’s EU referendum has made the need for the region to speak with one voice more pressing than ever. \nRoss Lillico, associate director economics at Nathaniel Lichfield & Partners in Newcastle, said: “With Britain’s impeding exit from the EU playing a key role in investment considerations, it is imperative that the UK and its regions are in the strongest possible position to capitalise on future and existing opportunities. \n“Our report shows the North East lagging behind regions such as the North West and Scotland in terms of the number of FDI projects attracted in recent years and a more co-ordinated approach is crucial to establishing the region as a key player in the Northern Powerhouse and supporting our economy post-Brexit. Ross Lillico, associate director of Nathaniel Lichfield & Partners \n“However, the high number of organisations involved in the FDI process and the significant level of cross-over between the sectors targeted at a local level is weakening the North East’s overall message to potential investors. \n“Addressing this through the introduction of a more co-ordinated, pan-regional approach to inward investment could strengthen the region’s offer in an increasingly competitive environment. The economic benefits that this could unlock – in terms of capital investment and new employment opportunities – are clear.” \nThe report highlights the region’s success in attracting foreign investment into the transport, professional services and environmental technology services. \nEU countries were responsible for 126 investment projects between 2003 and 2015, while there 105 from the US and 38 from Japan. Newcastle and Sunderland received the most investment in the region, though there were also high levels of investment into Newton Aycliffe, Hexham and Redcar. \nThe report concludes: “Drawing upon the example of Nissan in Sunderland, it is clear that inward investment secured in any one location can benefit the region as a whole. \n“Recognising this potential, it is recommended that FDI partners based across the region – including the Department of International Trade, LEPs and local authorities – work together to maximise the impact of FDI activity to a wider investor audience and provide a consistent message.”", "external_links": [], "published": "2016-09-27T23:00:00.000+03:00", "crawled": "2016-09-27T18:26:01.476+03:00", "highlightTitle": ""}