{"organizations": [], "uuid": "b21785d0ba53d1a95a6b6b1a826ff192fb06935a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article11851947.ece/ALTERNATES/s1200/JS98821122.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/north-east-devolution-still-possibility-11851833", "country": "GB", "domain_rank": 21960, "title": "North East devolution still a possibility says government despite vote by local authority leaders", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "North East devolution still a possibility says government despite vote by local authority leaders", "spam_score": 0.0, "site_type": "news", "published": "2016-09-07T03:29:00.000+03:00", "replies_count": 0, "uuid": "b21785d0ba53d1a95a6b6b1a826ff192fb06935a"}, "author": "Laura Hill", "url": "http://www.chroniclelive.co.uk/news/north-east-news/north-east-devolution-still-possibility-11851833", "ord_in_thread": 0, "title": "North East devolution still a possibility says government despite vote by local authority leaders", "locations": [], "entities": {"persons": [{"name": "sheffield", "sentiment": "none"}, {"name": "coun henig", "sentiment": "none"}, {"name": "philip hammond", "sentiment": "none"}, {"name": "jeremy middleton", "sentiment": "none"}, {"name": "mike barker", "sentiment": "none"}, {"name": "terry collins", "sentiment": "none"}, {"name": "joyce mccarty", "sentiment": "none"}, {"name": "norma redfearn", "sentiment": "none"}, {"name": "george osborne", "sentiment": "none"}, {"name": "coun watson", "sentiment": "none"}, {"name": "cllr joyce mccarty", "sentiment": "none"}, {"name": "alexandra jones", "sentiment": "none"}, {"name": "paul watson", "sentiment": "none"}, {"name": "cllr martin gannon", "sentiment": "none"}, {"name": "sajid javid", "sentiment": "none"}, {"name": "simon henig", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "north tyneside", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "south tyneside", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "sunderland civic centre", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "teesside", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}], "organizations": [{"name": "sunderland civic centre  newcastle city council", "sentiment": "none"}, {"name": "durham council", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "north east mayoral candidate", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "neca", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "whitehall", "sentiment": "none"}, {"name": "north east combined authority", "sentiment": "none"}, {"name": "centre for cities", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "North East devolution still a possibility says government despite vote by local authority leaders 20:29, 6 Sep 2016 The region's council leaders were split 4-3 over whether to push ahead with the £3.4bn deal for the region missing government deadline Shares The video will start in 8 s Cancel Click to play Tap to play The Live Event you are trying to watch is either unavailable or has not started Please refresh this page in your browser to reload this live event video \nThe government has said “the door remains open” for North East devolution despite council leaders today voting against plans to move forward with the deal. \nBy a vote of 4 to 3, members of the North East Combined Authority decided not to put the plan out to public consultation despite a deadline from Whitehall to do so by Tuesday. \nBoth Durham council leader, Simon Henig and Sunderland council leader Paul Watson said that while they were for devolution, they had not been given enough reassurances from the government over funding after the Brexit vote. \nThe NECA leadership board meeting took place at Sunderland Civic Centre. While Newcastle, Northumberland and North Tyneside councils, voting to push ahead with the consultation process, the rest - Gateshead , Sunderland, Durham and South Tyneside voted not to. \nA Department for Communities and Local Government (DCLG) spokesperson said it was “disappointing that some North East councils have been unwilling to support this deal, which would certainly have benefitted local people”. \nThe spokesperson added: “If councils in the region wish to discuss devolution proposals further, our door remains open.” \nNorth Tyneside’s Mayor Norma Redfearn told the committee she feared the region was being left behind as Manchester, Sheffield and Teesside stride ahead with their devolution deals. Cllr Joyce McCarty during a North East Combined Authority meeting at Sunderland Civic Centre \n“It has been a long difficult process at times and it has felt like we have taken two steps forward and then three steps back,” she said. \n“This is the one opportunity for the North East to take control of our destiny. We’re stuck in the middle, where does that leave us?” \nThe £3.4bn deal was initially put on hold following the outcome of the EU referendum vote. \nAlthough the Chancellor Philip Hammond issued some assurances over EU funding last month and positive talks have been held between the council leaders and the Secretary of State for Communities and Local Government Sajid Javid, it simply wasn’t enough for four of the council leaders. \nCoun Henig said: “We would hope that the government would match promised EU funding pound for pound but without reassurance on that we don’t feel in a position to move forward. We want to get the best deal for the North East.” \nAfter the meeting NECA chairman Coun Watson said it would now “write a letter” to the DCLG which had warned if an agreement on the deal - signed with former Chancellor George Osborne last October - was not reached by Tuesday the process would be scrapped. \nWhen asked what would happen if Whitehall withdrew the offer Coun Watson said: “We will still be part of the country, we will still receive funding and we will still be a combined authority.” L-R Terry Collins, Cllr Martin Gannon and Mike Barker during a North East Combined Authority meeting at Sunderland Civic Centre \nNewcastle City Council’s deputy leader Joyce McCarty said she was “very, very disappointed” by the decision, and pointed out that the authorities north of the Tyne had voted the same way, fuelling speculation there could be a splinter group in the future. \nShe said: “We think this puts at risk the whole deal. We have potentially picked nothing - we don’t know the consequences.” \nThe idea of devolution for a Newcastle city region rather than an all encompassing North East deal has also been mooted by think tank Centre for Cities. \nReacting to news of the vote Centre for Cities chief executive Alexandra Jones said: “Now may be the time to think instead about devolving power on a different basis within the region – for example, to a ‘Newcastle city region’, which would more closely reflect the geography over which people in that area live, work and access public services.” \nThe only politician to put himself forward as a North East Mayoral Candidate, independent Jeremy Middleton, slammed the council leaders for “squabbling amongst themselves”. \nHe said: “This is an absolutely terrible decision. Their behaviour has divided the region, but it will be ordinary people that suffer because of their actions, not them. \n“The opportunities that come with devolution are clear and rejecting it will make us worse off in the long run. The political establishment that have run the region for decades have little to show for it.” More on the North's devolution deal", "external_links": [], "published": "2016-09-07T03:29:00.000+03:00", "crawled": "2016-09-06T23:18:35.153+03:00", "highlightTitle": ""}