{"organizations": [], "uuid": "ff430671b56533174ba2071a8da5a6082243fb49", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bostonstandard.co.uk", "main_image": "http://res.cloudinary.com/jpress/image/fetch/w_300,f_auto,ar_3:2,c_fill/http://www.bostonstandard.co.uk/webimage/1.7606675.1475234423!/image/image.jpg", "site_section": "http://www.bostonstandard.co.uk/rss/cmlink/1.5179319", "section_title": "Boston Standard Feed", "url": "http://www.bostonstandard.co.uk/whats-on/arts/immigration-and-brexit-lead-debates-on-question-time-1-7606681", "country": "GB", "title": "Immigration and Brexit lead debates on Question Time", "performance_score": 0, "site": "bostonstandard.co.uk", "participants_count": 0, "title_full": "Immigration and Brexit lead debates on Question Time", "spam_score": 0.0, "site_type": "news", "published": "2016-09-30T19:20:00.000+03:00", "replies_count": 0, "uuid": "ff430671b56533174ba2071a8da5a6082243fb49"}, "author": "", "url": "http://www.bostonstandard.co.uk/whats-on/arts/immigration-and-brexit-lead-debates-on-question-time-1-7606681", "ord_in_thread": 0, "title": "Immigration and Brexit lead debates on Question Time", "locations": [], "entities": {"persons": [{"name": "bonnie gree", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "steven woolfe", "sentiment": "none"}, {"name": "rod liddle", "sentiment": "none"}, {"name": "ms greer", "sentiment": "none"}, {"name": "patel", "sentiment": "none"}, {"name": "bonnie greer", "sentiment": "none"}, {"name": "burgon", "sentiment": "none"}, {"name": "woolfe", "sentiment": "none"}, {"name": "richard burgon", "sentiment": "none"}, {"name": "priti patel", "sentiment": "none"}, {"name": "david dimbleby", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "boston", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "boston high school", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "conservative", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Immigration and Brexit lead debates on Question Time Pictured, from left, Steven Woolfe, Bonnie Greer, Priti Patel, host David Dimbleby, Richard Burgon and Rod Liddle. 12:20 Friday 30 September 2016 Have your say \nPictured, from left, Steven Woolfe, Bonnie Greer, Priti Patel, host David Dimbleby, Richard Burgon and Rod Liddle. \nThe political panel show’s host David Dimbleby set the tone for Thursday evening’s debate, introducing the nation to the town which recorded ‘the highest Brexit vote in the UK’. Question Time. \nPanelists first clashed over immigration with Secretary of State for International Development Priti Patel blaming the ‘failure of successive Labour governments when it comes to free movement, the lack of transitional controls when Eastern European countries were joining the European Union when accession states were joining Europe and quite frankly when it came to access to public services they were in utter denial about the pressures uncontrolled immigration was putting on our public services’. \nLabour Shadow Lord Chancellor and Shadow Secretary of State for Justice Richard Burgon attacked the current government for being ‘hell bent on making cuts to public services’. \nHe said: “The Coservative Government abolished the migration impact fund which was meant to help areas like Boston that have a large share of immigrants coming to it and Labour...will restore the migration impact fund.” \nUKIP’s spokesman on migration Steven Woolfe pushed for ‘a visa system that controls the numbers of people coming into this country’. Question Time. \nHe added: “Migration into this country is necessary and important, all we have ever simply said is that we must not have uncontrolled mass migration because it pushes down wages.” \nHowever, an audience member disagreed, saying such numbers were needed claiming without them ‘fields would be empty and wouldn’t have the economy in Boston we do’. \nNational newspaper columnist Rod Liddle said there had been ‘hideous exploitation of migrant workers’ and ‘British workers will not put up with that’. \nMeanwhile fellow panelist, novelist Bonnie Greer, said she felt like the ‘town and maybe this rejoin has been left on its own’ and said ‘your town and your concerns need to be addressed’. \nThis was echoed by members of the audience, with one stating: “What we need to do is invest heavily in the frontline services.” \nMeanwhile, another woman claimed pressure and child places and social housing, due to the town’s population rise had caused problems for her family. \nWhen it came to Brexit the panel was asked if the government was ‘dithering’ on leaving Europe, all panelists were in agreement the vote had to be respected. \nMs Patel assured:”The Govenment is focused on getting the best deal and the right deal for Britain.” \nMeanwhile, Mr Woolfe said the government needed to move ‘extremely rapidly’ and Mr Burgon told his Conservative colleague that ‘we need a clear vision of what a Britain post-Brexit looks like’. \nGiven the show was broadcast from Boston High School, it appeared apt there was a question over grammar schools. With the audience member asking why more low-income children could not receive the benefits of selective education. \nMr Woolfe questioned the grammar system, fearing the 11-plus, which determines if a child goes into selective education, could ‘scar some people for life’ and was ‘deeply divisive’. \nMs Patel emphasised the Goverment’s stance on creating grammar schools would help create ‘good and outstanding school places for children of disadvantaged backgrounds’. \nHowever, Ms Greer questioned why everyone couldn’t have access to ‘top level education’. She added: “I think we need to build schools that everybody can go to,” Sign in", "external_links": [], "published": "2016-09-30T19:20:00.000+03:00", "crawled": "2016-09-30T14:30:39.858+03:00", "highlightTitle": ""}