{"organizations": [], "uuid": "a07c4460348ca5f7e47c7b36f250fa7c433fbb1c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article11875342.ece/ALTERNATES/s1200/JS47214243.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/news-opinion/council-leaders-north-east-nit-11875332", "country": "GB", "domain_rank": 21960, "title": "Council leaders in the North East have nit-picked the devo deal to death - so where do we go now?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Council leaders in the North East have nit-picked the devo deal to death - so where do we go now?", "spam_score": 0.0, "site_type": "news", "published": "2016-09-13T01:30:00.000+03:00", "replies_count": 0, "uuid": "a07c4460348ca5f7e47c7b36f250fa7c433fbb1c"}, "author": "Graham Robb", "url": "http://www.chroniclelive.co.uk/news/news-opinion/council-leaders-north-east-nit-11875332", "ord_in_thread": 0, "title": "Council leaders in the North East have nit-picked the devo deal to death - so where do we go now?", "locations": [], "entities": {"persons": [{"name": "graham robb", "sentiment": "neutral"}, {"name": "andrew percy", "sentiment": "none"}, {"name": "george osborne", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "north tyneside", "sentiment": "none"}, {"name": "sheffield", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "north east councils", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "tees valley", "sentiment": "none"}, {"name": "north east combined authority", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "none"}, {"name": "t&c", "sentiment": "none"}, {"name": "combined authority", "sentiment": "none"}, {"name": "recognition pr", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "recognition marketing", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Graham Robb says a 'Northern Three' of local authorities still have a slender chance to go for devolution Shares Get daily news by email Graham Robb, Senior Partner of Recognition Marketing and PR \nI had hoped to write about some positive things this week, not least the great potential for Newcastle and Gateshead to stage the 2018 Great North exhibition after shortlisting (write to your MP and ministers to back this bid!) \nHowever, one issue looms large for everyone involved in business in the North East Combined Authority area; the potential loss of £900m of newly-devolved money to this region as a result of the council leaders’ decision to vote by a narrow margin not to progress the deal. \nTo say I was exasperated is an understatement. \nI, along with the leaders of other business organisations had represented the wishes of hundreds of businesses in urging the North East to be in the first wave of devolution. \nThankfully, all the council leaders had signed up to a deal with George Osborne that put us at the front of the queue alongside Manchester, Tees Valley and Sheffield. \nBut throughout the year politics have started to paralyse the arrangements. \nIt started with pressure from left-wing MPs, circulating open letters to the council leaders, next we had political activity as a result of the realignment of the Labour Party relating to the current leadership election and Gateshead withdrew. \nThis was OK because up to one council could withdraw with having veto power. People in business have not really taken this in as, for the most part, we do not understand the internal working of the Labour machine. \nAs a result of political pressure the council leaders have nit-picked the deal to death. When you hear the excuses and so-called reasons, they relate to a lack of assurances on this point or that. \nIt’s like trying to buy your dream house from a willing vendor, but walking away because the surveyor was worried about a loose drainpipe or some minor works. \nThe reality is the Labour Party in the North East was lukewarm at best, and hostile at worst, on the issue of a Mayor. \nThey willfully ignored the fact that the Conservative manifesto was clear that devolution, money and power would only be accompanied by structural change involving an elected Mayor. \nThe Conservatives winning an outright majority last year was a surprise to them (and, frankly a surprise to me too) and the councils failed to adapt. \nIn the examination of what has gone wrong I would exempt our council officers from much of the blame. \nThey have negotiated in good faith, worked to extremely tight deadlines and, in private, will tell you that, although imperfect, the deal provided a vehicle for the region to catch up with Manchester. \nThe problem has come because some Labour council leaders have misunderstood the national political landscape and wrongly played a weak hand. \nThe Government needs to deal with the UK economy post-brexit and ministers are under pressure to keep an eye on the cash. We had the money within our grasp and appear to have let it go. Four out of seven council leaders seem to have perfected the art of looking a gift horse in the mouth. \nI was so concerned on Friday that I spoke to the Northern Powerhouse Minister, Andrew Percy MP. He is clear, the North East Councils had signed a deal, they kept prevaricating on its ratification and throwing more hurdles in the way. They have stretched the argument to the issue of post-brexit EU funds, which aren’t even part of the deal. \nFinally they voted 4-3 against going forward to the next stage of the process and the Government has pulled it. They were warned this would happen, and appear to have engaged in a game of brinkmanship with the Government that we have lost! \nHowever, there is some hope that the situation can be rescued in part only. The Government minister has made perfectly clear to me that he wants devolution in both Tees Valley and elsewhere in the North East and if that means the ‘Northern Three’ council areas – Newcastle, North Tyneside and Northumberland (which voted for the deal), so be it. \nThere appears to be the most slender of opportunities to pull something out of the wreckage. As I understand it, due to the way the legislation is drafted, a deal can’t be struck with a Combined Authority that had more than one member drop out, but a new Combined Authority can add members who sign up to the deal. Sounds daft, but its worth a shot. \nTo accomplish ‘Mission Impossible’ they would have to agree to all the previously agreed terms, but in order to stay within the legislation they might have to form a new Combined Authority. \nIf it can be rushed through the Government appears willing to try but it is not interested in any more messing about over revising the T&Cs! This is not perfect but if it worked, the other four councils could join in later. \nI’m sure that Newcastle, and all the Northern 3, are working at speed to get things moving, let’s hope they succeed! \nGraham Robb is Senior Partner of Recognition PR and Chair IoD NE \n@GrahamRobb \n(Full disclosure: Although this article is a personal view, a member of the team at Recognition PR provides press office support to Jeremy4Mayor.)", "external_links": [], "published": "2016-09-13T01:30:00.000+03:00", "crawled": "2016-09-12T20:46:15.012+03:00", "highlightTitle": ""}