{"organizations": [], "uuid": "2a7c468e3697b0a3dbd7aec311095ba002a3c700", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article11947801.ece/ALTERNATES/s1200/JS100808970.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/jeremy-corbyn-outline-immigration-policy-11947622", "country": "GB", "domain_rank": 21960, "title": "Jeremy Corbyn to outline immigration policy at Labour party conference", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Jeremy Corbyn to outline immigration policy at Labour party conference", "spam_score": 0.0, "site_type": "news", "published": "2016-09-28T12:00:00.000+03:00", "replies_count": 0, "uuid": "2a7c468e3697b0a3dbd7aec311095ba002a3c700"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/jeremy-corbyn-outline-immigration-policy-11947622", "ord_in_thread": 0, "title": "Jeremy Corbyn to outline immigration policy at Labour party conference", "locations": [], "entities": {"persons": [{"name": "jonatha", "sentiment": "negative"}, {"name": "jeremy corbyn", "sentiment": "negative"}, {"name": "andy burnham", "sentiment": "none"}, {"name": "andy burnham  mr burnham", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "gareth", "sentiment": "none"}, {"name": "westminster", "sentiment": "none"}], "locations": [{"name": "brussels", "sentiment": "none"}, {"name": "liverpool", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "negative"}, {"name": "acc liverpool  a labour", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "stefan rousseau/pa wire labour", "sentiment": "none"}, {"name": "walker labour", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jeremy Corbyn to outline immigration policy at Labour party conference 05:00, 28 Sep 2016 By Jonathan Walker Labour leader Jeremy Corbyn to promise funding for schools and hospitals struggling to cope with immigration Share Get daily news by email Stefan Rousseau/PA Wire Labour leader Jeremy Corbyn prepares his keynote speech in his hotel, which he will deliver on Wednesday during the Labour Autumn Conference at the ACC Liverpool \nA Labour government would send extra funding to regions with high levels of immigration to compensate for the stress placed on public services, leader Jeremy Corbyn is to announce. \nThe cash for services such as schools and hospitals would come from visa fees paid by people coming to the UK, and charges paid by people applying for citizenship. \nIn his speech to the Labour Party conference in Liverpool, Mr Corbyn will promise a Labour government would “ease the pressure on hard pressed public services” with extra funds. \nAnd he will also say that Labour will prevent migrants undercutting British workers by accepting lower wages. \nHe will say: “A Labour government will not offer false promises. We will not sow division or fan the flames of fear. We will instead tackle the real issues of immigration – and make the real changes that are needed. \n“We will act to end the exploitation of migrant labour to undercut workers’ pay and conditions. And we will ease the pressure on hard pressed public services - services that are struggling to absorb Tory austerity cuts, in communities absorbing new populations. Jeremy Corbyn MP waves to supporters after being announced as the leader of the Labour Party \n“Labour will reinstate the migrant impact fund, abolished by the Tory government. That will give extra support to areas of high migration. We will use the visa levy for its intended purpose. And we will add a citizenship application fee levy to boost the fund.” \nThe speech follows Mr Corbyn’s victory in Labour’s recent leadership election and he will insist the party is now committed to the policies he set out during the contest, including creating a “national education service” and public control of services. \nBut he will admit Labour has been through a period of civil war - which must end if Labour is to form the next government. \nMr Corbyn will say: “Every one of us knows that we will only get there if we accept the decision of the members, end the trench warfare and work together to take on the Tories.” \nAndy Burnham, Labour’s Shadow Home Secretary, is expected to strike a more sceptical tone on immigration in his own speech to the party conference. \nHe will criticise Theresa May , the Prime Minister, for ruling out failing to back the introduction of a points-based migration system once the UK leaves the EU. \nAnd he will suggest that Labour should take seriously the concerns over people who voted to leave the EU because of concern about immigration. Gareth Fuller/PA Wire Shadow home secretary Andy Burnham \nMr Burnham is expected to say: “Labour must face up fully to this fact: millions of our lifelong supporters voted to leave the EU and voted for change on immigration. \n“The truth is the EU was working better for some parts of our country than it was for others. For some of our country’s least affluent areas, it wasn’t working well at all. \n“These were the places that lost industry, got no real help to replace those good jobs and saw a collapse in property prices and whole streets bought up by absent private landlords. When the EU expanded, they experienced rapid change but were left to deal with by Westminster and Brussels. \n“No wonder some places feel taken for granted and abandoned by the political class. \n“Europe wasn’t working for them - and we were way too slow to see it. We must now put that right and develop fair Brexit plans that respond to their concerns.”", "external_links": [], "published": "2016-09-28T12:00:00.000+03:00", "crawled": "2016-09-28T07:25:03.792+03:00", "highlightTitle": ""}