{"organizations": [], "uuid": "b8ec92046fa5bb0e815b457e56ad0d189cf5d694", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article11861594.ece/ALTERNATES/s1200/JS98988052.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/newcastle-launches-25-day-celebration-11861524", "country": "GB", "domain_rank": 21960, "title": "Newcastle launches 25-day celebration to welcome international students to the city", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Newcastle launches 25-day celebration to welcome international students to the city", "spam_score": 0.0, "site_type": "news", "published": "2016-09-09T01:30:00.000+03:00", "replies_count": 0, "uuid": "b8ec92046fa5bb0e815b457e56ad0d189cf5d694"}, "author": "Katie Dickinson", "url": "http://www.chroniclelive.co.uk/news/north-east-news/newcastle-launches-25-day-celebration-11861524", "ord_in_thread": 0, "title": "Newcastle launches 25-day celebration to welcome international students to the city", "locations": [], "entities": {"persons": [{"name": "nick forbes", "sentiment": "none"}, {"name": "sean bullick", "sentiment": "none"}, {"name": "lee charnley", "sentiment": "none"}, {"name": "jon reast", "sentiment": "none"}], "locations": [{"name": "grey", "sentiment": "none"}, {"name": "northumbria", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "civic centre", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "positive"}, {"name": "civic centre  newcastle", "sentiment": "none"}, {"name": "newcastle college", "sentiment": "none"}, {"name": "northumbria university", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "newcastle united", "sentiment": "none"}, {"name": "newcastle city council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Newcastle launches 25-day celebration to welcome international students to the city 18:30, 8 Sep 2016 The city is marking its international status in the face of the Brexit vote and tighter controls on non-EU migrants Shares Get daily news by email Flag-raising ceremony to welcome international students to Newcastle at the Civic Centre \nNewcastle has launched 25 days of celebrations to let students from around the globe know they are welcome. \nThe city is marking its international status in the face of the Brexit vote and tighter controls on non-EU migrants. \nAs students from 152 countries begin to arrive in Newcastle over the next months, 25 days of festivities have been planned to welcome them to the city. \nOrganised to coincide with the International Welcome Weeks of the city’s three Higher Education (HE) institutions - Newcastle and Northumbria universities and Newcastle College - the celebrations kicked off with a flag-raising ceremony organised by Newcastle NE1, the city’s Business Improvement District (BID). Flag-raising ceremony to welcome international students to Newcastle at the Civic Centre \nThe ceremony marked the start of a 25 day-long welcome to Newcastle’s new and returning students, during which the flags of all 152 countries will be displayed in rotation on 30 flagpoles outside the Civic Centre and around the city. \nThroughout the period seven spotlights, located at prominent locations throughout the city, will light up the sky each evening, with their beams converging above Grey’s Monument. Lee Charnley MD of Newcastle United who attended the flag-raising ceremony \nThe opening and closing of the student welcome will be marked by spectacular firework displays on the evenings of Thursday, September 8, and October 2. \nSean Bullick, Newcastle NE1 chief executive, said: “Today’s ceremony and the upcoming student welcome celebrations show that despite a change in the UK’s relationship with the European Union, we are open for study, business and tourism. \n“As one of the UK’s best known and most well regarded cities, it is essential that students from around the globe know they are welcome in Newcastle.” Flag-raising ceremony to welcome international students to Newcastle at the Civic Centre \nJon Reast, pro-vice chancellor (International) at Northumbria University, said: “Newcastle is a fantastic destination to work and study, and I’m sure that the welcome events planned over the coming weeks will help our new students realise how important they are, not only to the academic institutions, but also for the city as a whole.” \nNick Forbes, leader of Newcastle City Council , said: ““Newcastle is a global city, and every year we welcome thousands of students from across the world to study here. \n“These students enrich our city while they are here, and many go on to be ambassadors for Newcastle when they graduate. \n“Every successful city in the world has vibrant, talented and diverse universities and students. With Brexit it is still early days, but it is clear that any restrictions the Government makes on overseas students studying here will harm the competitive edge we currently have.”", "external_links": [], "published": "2016-09-09T01:30:00.000+03:00", "crawled": "2016-09-08T21:05:35.867+03:00", "highlightTitle": ""}