{"organizations": [], "uuid": "60037952f6cf65e8b5fc40b1646f59fe680d029b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/29730902/15549534.jpg", "site_section": "http://www.thisisleicestershire.co.uk/specialolympics/rss.html?chid=181121", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/company-car-man-get-amy-schumer-for-city-8217-s-comedy-festival/story-29730902-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "Leicester Mercury published Company car man: Get Amy Schumer for city's comedy festival", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "Leicester Mercury published Company car man: Get Amy Schumer for city's comedy festival", "spam_score": 0.0, "site_type": "news", "published": "2016-09-20T13:07:00.000+03:00", "replies_count": 0, "uuid": "60037952f6cf65e8b5fc40b1646f59fe680d029b"}, "author": "Leicester Mercury", "url": "http://www.leicestermercury.co.uk/company-car-man-get-amy-schumer-for-city-8217-s-comedy-festival/story-29730902-detail/story.html", "ord_in_thread": 0, "title": "Leicester Mercury published Company car man: Get Amy Schumer for city's comedy festival", "locations": [], "entities": {"persons": [{"name": "paul clements", "sentiment": "negative"}, {"name": "amy schumer", "sentiment": "negative"}, {"name": "angela merkel", "sentiment": "none"}, {"name": "john richardson", "sentiment": "none"}], "locations": [{"name": "wastecycle", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "dover street", "sentiment": "none"}], "organizations": [{"name": "leicester mercury", "sentiment": "negative"}, {"name": "bank", "sentiment": "none"}, {"name": "bmw", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "bank of england", "sentiment": "none"}, {"name": "mercedes", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Paul Clements is the commercial director of Wastecycle. He drives a Mercedes C250 \nWhat is it about the Mercedes C250 that you like? \nAs a long time BMW driver, the change to Mercedes was one that took some persuading. However, what a good decision. The classy interior, smooth drive and sporty design definitely matches the image that I remember as a child of 'owning a Mercedes'. \nPlans recently fell through to create a recovery centre for street drinkers in the run-down Anchor Centre in Dover Street, Leicester. How do you think the issue of street drinkers could best be addressed? \nWhether it's drinking or anti-social behaviour in general, this is now a fact of life in our town centres across the county and a very unwelcome trend. To me, it seems that street drinking is a complex issue in which there are unfortunately no quick wins. Controlled drinking zones, underpinned by assisting the police's powers to confiscate alcohol and enforce individuals to leave specific areas, seems an immediate approach. \nAngela Merkel, the German Chancellor, has warned the EU is in \"critical condition\" and it's been said the bloc has an \"existential crisis\" following the Brexit vote. Do you agree with her and if so what impact could this have for UK businesses? \nThe only certainty for UK businesses is the uncertainly of the future. It is important that the relationship between the EU and Britain remains strong. However, it is important that we continue to push for the strongest deal possible. We are in a unique position of negotiation allowing the country to shape its future for the benefit of the UK economy. Either way the optimum outcome for UK businesses is for decisions and directions to be made reinvigorating confidence in the decision-making and investment market, stimulating the growth that we have seen over the past two years. \nWhat do you think about the Bank of England cutting interest rates ever lower, given that it has revised up its growth forecasts? \nAs above, I am pleased that someone, albeit the Bank of England, believes that it is their job to create permanent growth and ensure that GDP always expands every quarter. Can it do this through continuing cutting rates? I am not sure. The benefits of doing this, even when rates are so close to zero, outweigh the costs in terms of increasing pension shortages. Finally, and not surprisingly, inflation is expected to rise rapidly (in part due to the increased price of imports as a result of the weaker pound). will not be enough to stop the Bank from cutting rates further. \nWhat is your favourite building in Leicester and Leicestershire and why? \nThere are many more impressive buildings in the city I know, but for nostalgic reasons the first building that I saw when I came to Leicester was the National Space Centre. \nPlans are under way for the 2017 Leicester Comedy Festival. Which comedians would you like to see here and why? \nCome 2017, I am sure my choices would have changed. Topping the list for me at the moment include the two polar opposites of John Richardson and Amy Schumer.", "external_links": [], "published": "2016-09-20T13:07:00.000+03:00", "crawled": "2016-09-20T08:39:21.428+03:00", "highlightTitle": ""}