{"organizations": [], "uuid": "60b04b0c4fea3130912aacd10312e44f4304873f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article11904446.ece/ALTERNATES/s1200/ECP_NEC_200516council_015JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/bickering-left-north-east-no-11903273", "country": "GB", "domain_rank": 21960, "title": "Bickering left North East in the 'no lane' when it came to devolution, Lib Dems claim", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Bickering left North East in the 'no lane' when it came to devolution, Lib Dems claim", "spam_score": 0.0, "site_type": "news", "published": "2016-09-19T15:30:00.000+03:00", "replies_count": 0, "uuid": "60b04b0c4fea3130912aacd10312e44f4304873f"}, "author": "Dan O'Donoghue", "url": "http://www.chroniclelive.co.uk/news/north-east-news/bickering-left-north-east-no-11903273", "ord_in_thread": 0, "title": "Bickering left North East in the 'no lane' when it came to devolution, Lib Dems claim", "locations": [], "entities": {"persons": [{"name": "paul watson", "sentiment": "none"}, {"name": "jonathan wallace", "sentiment": "none"}, {"name": "john shipley", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "south tyneside", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "durham county hall  he", "sentiment": "none"}], "organizations": [{"name": "employment and skills", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "newcastle city council", "sentiment": "none"}, {"name": "gateshead council", "sentiment": "none"}, {"name": "neca", "sentiment": "none"}, {"name": "north east combined authority", "sentiment": "none"}, {"name": "lib dem", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Bickering left North East in the 'no lane' when it came to devolution, Lib Dems claim 08:30, 19 Sep 2016 Opposition leaders are planning to mount a bid to resuscitate devolution with the help of business and the voluntary sector   Jonathan Wallace, Lib Dem opposition leader on Gateshead Council \nDevolution can be resuscitated if it is taken out of the hands of the region’s big political players, it has been claimed. \nThe multi-billion pound deal, which would have given extra powers and cash to the North East, was killed off earlier this month when the leaders of four councils failed to agree on terms with the Government. \nNow the region’s Liberal Democrats are demanding the creation of a “constitutional convention” to take the negotiations out of the hands of those at the top of North East politics and to bring in business and the voluntary sector. \nJonathan Wallace, Lib Dem opposition leader on Gateshead Council , said: “The failure of leadership in the North East and the intransigence of the Government in demanding a one-size-fits-all elected mayoral model caused the collapse in plans to give the region a greater say over our own destiny. \n“Bickering has not even left us in the slow lane. Instead, we are in the ‘no’ lane – going nowhere while other regions power ahead. \n“There is now an urgent need to get the North East back on track. The mistake of leaving the creation of a suitable model of devolution in the hands solely of Labour council leaders and Tory ministers must not be repeated.” The NECA leadership board meeting on the devolution decision at Durham County Hall \nHe added: “Liberal Democrats are therefore calling for the North East Combined Authority to back the establishment of a constitutional convention to gather the views of stakeholders in the North East, such as businesses, the voluntary sector and, crucially, political parties other than just Labour.” \nLeaders of three councils voted in favour of putting the package out to a public consultation – the next step in making it a reality – but the proposal was defeated when the four leaders of Gateshead, Sunderland, Durham and South Tyneside councils voted not to go ahead unless they received more reassurances from the government over funding after the Brexit vote. \nThe North East deal included an infrastructure fund of £30m per year for 30 years; powers over bus franchising; strategic planning powers; joint responsibility for an Employment and Skills board and devolved skills funding for adults aged over 19. \nLord John Shipley, former Leader of Newcastle City Council , endorsed the call. Read More \nHe said: “The North East is in serious danger of falling behind other regions. We need powers over transport, the economy, skills and planning to be exercised in the North East.” \nLast week, Paul Watson, NECA chairman, said that council leaders remained committed to the principle of devolution. \nHe said: “As we stated quite clearly in correspondence with the Communities Secretary, we remained keen to find a way to move ahead with the devolution process, and to continue to discussions with the Government to try to reach an agreement which all seven councils could support. \n“Unfortunately, however, the Government has announced its decision to end these current discussions.”", "external_links": [], "published": "2016-09-19T15:30:00.000+03:00", "crawled": "2016-09-19T10:34:59.677+03:00", "highlightTitle": ""}