{"organizations": [], "uuid": "21cdfe395f64e08cd347ee7bf9b50b5f2d005b23", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article11828805.ece/ALTERNATES/s1200/JS52094250.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/government-urged-avoid-clumsy-brexit-11913344", "country": "GB", "domain_rank": 21960, "title": "Government has been urged to avoid 'clumsy' Brexit plan", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Government has been urged to avoid 'clumsy' Brexit plan", "spam_score": 0.0, "site_type": "news", "published": "2016-09-21T07:01:00.000+03:00", "replies_count": 0, "uuid": "21cdfe395f64e08cd347ee7bf9b50b5f2d005b23"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/government-urged-avoid-clumsy-brexit-11913344", "ord_in_thread": 0, "title": "Government has been urged to avoid 'clumsy' Brexit plan", "locations": [], "entities": {"persons": [{"name": "graeme whitfield manuf", "sentiment": "negative"}, {"name": "rob elvin", "sentiment": "none"}, {"name": "liz mayes", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}], "organizations": [{"name": "eef", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "squire patton boggs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Government has been urged to avoid 'clumsy' Brexit plan 00:01, 21 Sep 2016 By Graeme Whitfield Manufacturers' organisation EEF calls on Government to maintain access to the single market as Britain leaves the EU Share Get business news by email Liz Mayes \nThe Government is being urged not to rush through a “clumsy” Brexit plan amid calls for manufacturers to retain access to the single market. \nProtecting industry will be “critical” in the negotiations to leave the EU and firms must continue to be able to employ workers from other European countries, said the EEF. \nA survey of 2,000 members of the public by the manufacturers’ group found that only 5% believed that damaging the sector was a price worth paying for leaving the EU. \nThe EEF urged ministers to “hold their nerve” and work out a plan to help manufacturing companies cope with life outside the EU . \nThere could be opportunities to trade with other countries post-Brexit, said the EEF. \nLiz Mayes, North East region director at EEF, said: “Rushing through a clumsy Brexit is not in the interests of our sector or the wider UK economy. The Prime Minister is right to hold her nerve and to allow adequate time for the UK’s negotiation strategy to be developed in close consultation with business to ensure the UK’s long-term economic interests are not harmed. \n“Manufacturers see great opportunity for jobs, growth and wealth generation from the expansion of global trade outside of the EU. These ambitions tally with those of the Government and the voting public, who want to see post-Brexit Britain exporting and manufacturing more, as well as achieving a better balanced economy. \n“At the same time, our report identifies concerns that our sector’s future success and ability to play its full part could be damaged if the UK fails to secure the right deal. \n“The negotiations will inevitably require compromise, but manufacturing has a key role to play in the success of post-Brexit Britain. I would urge the Prime Minister to ensure that any new relationship works for our sector. \n“This means maintaining unrestricted access to the single market and ensuring companies have the ability to hire and post employees across the EU – albeit with more controls in place. In the short-term we want Government to provide regulatory and policy certainty, but in the longer-term there is clearly opportunity to pull back from EU regulation where it does not work for the UK.” \nRob Elvin, of law firm Squire Patton Boggs, which helped with the report, added: “While our ability to trade freely with Europe is naturally of immediate concern to UK manufacturers, Brexit has provided an opportunity to create a longer term vision for international trade.”", "external_links": [], "published": "2016-09-21T07:01:00.000+03:00", "crawled": "2016-09-21T03:10:06.710+03:00", "highlightTitle": ""}