{"organizations": [], "uuid": "288e697f3f64f5630c40733dc45e3f43269b722d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article11053411.ece/ALTERNATES/s1200/JS18430811.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/students-worth-more-region-entire-11896262", "country": "GB", "domain_rank": 21960, "title": "Our students are worth more to the region that the entire Premier League is to the UK", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Our students are worth more to the region that the entire Premier League is to the UK", "spam_score": 0.0, "site_type": "news", "published": "2016-09-17T18:30:00.000+03:00", "replies_count": 0, "uuid": "288e697f3f64f5630c40733dc45e3f43269b722d"}, "author": "Hannah Graham", "url": "http://www.chroniclelive.co.uk/news/north-east-news/students-worth-more-region-entire-11896262", "ord_in_thread": 0, "title": "Our students are worth more to the region that the entire Premier League is to the UK", "locations": [], "entities": {"persons": [{"name": "chris brink", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "koen lamberts", "sentiment": "none"}, {"name": "north", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "north", "sentiment": "none"}], "organizations": [{"name": "premier league", "sentiment": "positive"}, {"name": "european union", "sentiment": "none"}, {"name": "university of york", "sentiment": "none"}, {"name": "northern powerhouse", "sentiment": "none"}, {"name": "newcastle university", "sentiment": "none"}, {"name": "durham university", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Our students are worth more to the region that the entire Premier League is to the UK 11:30, 17 Sep 2016 University bosses demand investment in the North and support for powerhouse scheme, as the institution's economic impact is revealed Shares Get daily news by email Newcastle University campus \nThe North’s top universities ploughed billions of pounds into the region last year — almost double the amount of cash the entire Premier League contributed to the nation. \nBut university bosses say further investment in the region’s infrastructure is needed if that’s to continue, and urged Government to make up any funding lost after Brexit. \nThe N8 group of universities — the North’s eight most research-focused institutions, which includes Newcastle and Durham universities — were worth a total of £12.2bn to the Northern economy in 2015, according to a report published by the group on Friday. \nThey contributed more Gross Value Added (GVA) cash to the region than motor vehicle manufacturing, agriculture or the media industry. \nThe report also highlighted the 119,000 jobs the institutions brought the North in 2015, as well as the economic boost provided by consultancy services provided to more than 17,000 small and medium-sized businesses by N8 members. Durham University students gather to be conferred with their degrees at the University's first academic congregation of the summer. #NorthNewsAndPictures/2daymedia \nProfessor Chris Brink, Vice Chancellor, Newcastle University, said: “This report demonstrates the very significant positive contribution of the N8 Partnership across the North of England, helping to create jobs and prosperity in our local communities. \n“At Newcastle University we take particular pride in our civic engagement role within our own city and region.” \nBut while the universities look to be in a strong economic position, the report also highlighted the significant impact of EU membership on university budgets. Around 13% of competitive research funding for the N8 universities comes from the European Union , and this cash may be under-threat after Brexit. \nThese findings prompted Professor Koen Lamberts, Vice-Chancellor of the University of York and Chair of N8, to call on Prime Minister Theresa May to boost Government investment in the North, and to commit to the under-question Northern Powerhouse initiative. \nHe said: ““The Government’s Northern Powerhouse agenda can and should play a major role in creating an environment that enables our universities to generate even more benefit to the Northern and wider UK economy. \n“Such benefit can only come, however, if there is further investment in innovation in the North: in inward investment, in transport and infrastructure.” Durham University students gather to be conferred with their degrees at the University's first academic congregation of the summer. #NorthNewsAndPictures/2daymedia \nHe insisted that the N8 group would continue to flourish in post-Brexit Britain, but that Government money would have to make up the shortfall created by leaving the union. \nHe added: “While some uncertainties remain because of the Brexit vote, we should be confident that we can face the challenges this may bring. The N8 universities have always been global in outlook, focused on contributing to the world beyond the lecture hall or campus and this will continue despite the referendum result... \n“However, we believe the Government must act swiftly to address the potential gap in research funding that might arise through our withdrawal from the EU. \n“Such funding is essential if we are to retain our global standing and attract the brightest and best talent. It also plays a significant role in research and innovation, which directly leads to UK business creation and employment growth.” More on the EU Referendum", "external_links": [], "published": "2016-09-17T18:30:00.000+03:00", "crawled": "2016-09-17T13:47:17.704+03:00", "highlightTitle": ""}