{"organizations": [], "uuid": "1694233524a7bc7783943d0aa457415063223137", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article11904457.ece/ALTERNATES/s1200/CLA-North-regional-director-Dorothy-Fairburn.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/warning-north-east-areas-outstanding-11904382", "country": "GB", "domain_rank": 21960, "title": "Warning: North East areas of outstanding beauty could be at risk", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Warning: North East areas of outstanding beauty could be at risk", "spam_score": 0.0, "site_type": "news", "published": "2016-09-19T18:30:00.000+03:00", "replies_count": 0, "uuid": "1694233524a7bc7783943d0aa457415063223137"}, "author": "Tony Henderson", "url": "http://www.chroniclelive.co.uk/news/north-east-news/warning-north-east-areas-outstanding-11904382", "ord_in_thread": 0, "title": "Warning: North East areas of outstanding beauty could be at risk", "locations": [], "entities": {"persons": [{"name": "dorothy fairburn  top", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "dorothy fairburn", "sentiment": "none"}], "locations": [{"name": "northumberland coast", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "north pennines", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "wales", "sentiment": "none"}], "organizations": [{"name": "country land and business association", "sentiment": "none"}, {"name": "business association", "sentiment": "none"}, {"name": "cla", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Warning: North East areas of outstanding beauty could be at risk 11:30, 19 Sep 2016 The Country Land and Business Association is warning North landscapes could be at risk following post-Brexit fears Shares Get daily news by email Publicity Pic CLA North regional director Dorothy Fairburn \nTop landscapes in the North East could be at risk if the Government does not devise an effective policy for food, farming and the environment post-Brexit, it is claimed. \nThe warning comes from the Country Land and Business Association in the region. \nForty six Areas of Outstanding Natural Beauty (AONB) across England and Wales are being celebrated during “Outstanding Week” from September 17-25 to highlight their national importance and ensure their character and qualities are protected. \nThey include the North Pennines and Northumberland Coast AONBs. \nBut the CLA which represents landowners, farmers and rural businesses in the region says any uncertainty over the future funding for food, farming and the environment after 2020 could lead to these areas at risk of becoming economically and environmentally unviable. \nCLA North regional director Dorothy Fairburn said: “It is right to celebrate these naturally breathtaking rural areas. We are always keen to welcome more visitors into the countryside. \n“But it should not be forgotten that AONBs are living, working landscapes. It is critical that the right Government policies and funds are designed which will enable farmers and land managers to sustain these distinctive landscapes for future generations. \n“Brexit has created a period of uncertainty. Although we are assured the current support for agriculture and rural development will continue at the same level until the end of 2020, after that is unknown. \n“The Government has a duty to ensure food, farming and the environment are not let down by a lack of funding challenge because communities, businesses, landscapes and wildlife are all dependent on the viability of the rural economy.” \nThe CLA has recommended six fundamental principles for a new Food, Farming and Environmental Policy: \n• A productive, competitive farming and forestry sector: the policy must enable UK farmers to be competitive on international markets \n• Food security: the policy must promote innovative, sustainable ways to increase production and manage risk \n• Enhancing the environment: the policy must be more ambitious than its predecessors in meeting environmental challenges \n• A dedicated UK budget: Government must provide sufficient funds for the policy across the whole of the UK \n• Value for Money: the policy must deliver value for money in the way it is implemented and in the outcomes it delivers to the benefit of everyone \n• Clear, proportionate regulation: the standards that must be met should be clear, with support provided to help businesses achieve compliance.", "external_links": [], "published": "2016-09-19T18:30:00.000+03:00", "crawled": "2016-09-19T14:08:19.681+03:00", "highlightTitle": ""}