{"organizations": [], "uuid": "637c2a94bda5d386eaeda401f89813f1b5c9a00a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article8603059.ece/ALTERNATES/s1200/JS52861360.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/nick-forbes-am-not-going-11865624", "country": "GB", "domain_rank": 21960, "title": "Nick Forbes: I am not going to give up on North East devolution", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Nick Forbes: I am not going to give up on North East devolution", "spam_score": 0.0, "site_type": "news", "published": "2016-09-10T01:30:00.000+03:00", "replies_count": 0, "uuid": "637c2a94bda5d386eaeda401f89813f1b5c9a00a"}, "author": "nechronicle", "url": "http://www.chroniclelive.co.uk/news/north-east-news/nick-forbes-am-not-going-11865624", "ord_in_thread": 0, "title": "Nick Forbes: I am not going to give up on North East devolution", "locations": [], "entities": {"persons": [{"name": "nick forbes", "sentiment": "negative"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}], "organizations": [{"name": "newcastle council", "sentiment": "negative"}, {"name": "newcastle city council", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "whitehall", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "In the wake of the devolution debacle, Newcastle Council leader Nick Forbes says the city will seek new a new deal with the Government Shares Get daily news by email Leader of Newcastle City Council, Nick Forbes \nThis week saw the depressing end to Act II of the great North East devolution saga. It is imperative we do not let this be the closing scene. \nIn 2004 voters across the region decided there was not enough power on offer to justify a regional assembly. Fast forward 12 years and council leaders have failed to agree a deal which would have started clawing back those much-needed powers from Whitehall. \nThe deal we thought we had agreed had new money and a greater say over existing funds, but it also gave us the chance to finally hand our region control of its destiny. It was about the tools to deliver on our identity and our ambitions. \nIt was not just a devolution deal for a £1bn job creation fund in a £3bn pot, it was about taking control of buses, about putting on big cultural and sporting events to the region, about supporting business to grow and create jobs. \nDespite this the combined authority has not been able to agree a way forward after two years of talks with Government. \nThis leaves us with a real challenge. There was agreement all the way through that what we wanted was not just more money but more powers. More decisions about the North East should be taken in the North East, a view voters and politicians agree on. \nWhen you ask people around the region for their views on devolution they consistently tell you they want the region to have a bigger say over its future. \nBut I suspect if you ask them what they think the reason is for this deal being rejected, I doubt many would be able to say why their expectations have not been met. \nSome people have cited the cost as their reason for opposing devolution. \nLet us be clear how we would have paid for this deal. Everything in it, from the mayor’s office to training up the workers of the future, would have been paid for out of central government funds clawed back by the North East. \nThere is no bill passed on to council tax payers, and any plans to do that in future would have needed council leaders to sign it off, something they have already said they are unlikely to do. \nOthers have raised concerns about EU funds. They are right, the North East urgently needs that £400m put at risk by Brexit. But that EU funding formed part of a pot worth some £3bn. Why not take the rest of the money and fight for more? \nWhere are we now? There is understandably some confusion. There is no denying we as a region and Newcastle as a city face a real challenge. Put bluntly, as a result of this devolution vote Manchester and other progressive cities will find it easier to attract investment. Whether you are for or against the current devolution model that is a simple and unavoidable truth. \nNewcastle will still grow, the council will pursue an ambitious programme of job-creating investment. But we will do so at a disadvantage when compared to some, and that is not a position we want to be in. \nThe Government has at least left the door open to alternative proposals from those who want to work on them. \nI am not going to give up on devolution. It is clear there is no consensus on a deal among the seven council leaders in our combined authority, but Newcastle does not lessen its ambition for growth. Day in day out this council commits itself to job creation as a route to social justice and I, like many others, see devolution as a powerful tool in that task. \nWe will seek further devolution talks with government. Those that want to work together for the region will have to look at their options, but we know we have to move fast. \nThe third act in our devolution battle has to settle the question which for too long had the wrong answer; do people who are brought up in the North East feel as if their future is here? I am determined to make sure the answer is yes.", "external_links": [], "published": "2016-09-10T01:30:00.000+03:00", "crawled": "2016-09-09T21:17:26.108+03:00", "highlightTitle": ""}