{"organizations": [], "uuid": "cd00e5dec820a02a67b29b038510926125a74efa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article11828805.ece/ALTERNATES/s1200/JS52094250.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-manufacturing-recovery-not-11834565", "country": "GB", "domain_rank": 21960, "title": "North East manufacturing recovery not yet secure, latest survey shows", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "North East manufacturing recovery not yet secure, latest survey shows", "spam_score": 0.0, "site_type": "news", "published": "2016-09-05T07:01:00.000+03:00", "replies_count": 0, "uuid": "cd00e5dec820a02a67b29b038510926125a74efa"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-manufacturing-recovery-not-11834565", "ord_in_thread": 0, "title": "North East manufacturing recovery not yet secure, latest survey shows", "locations": [], "entities": {"persons": [{"name": "jason whitworth", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "liz mayes", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "sterling", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "eef", "sentiment": "none"}, {"name": "bdo llp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "North East manufacturing recovery not yet secure, latest survey shows 00:01, 5 Sep 2016 The EEF and BDO LLP research shows a mixed picture is delaying stronger growth despite exchange rate benefits Shares Get business news by email Liz Mayes \nNorth East manufacturers are seeing a mixed picture which will delay the prospect of a return to stronger growth until the end of the year according to latest research. \nA survey published today by EEF, the manufacturer’s organisation and business advisers BDO LLP, sees the region’s firm mirroring the UK picture with output static in the last three months. \nHowever, prospects for the next three months are far more positive with a balance of +40% of companies expecting to increase output. \nThe recent national picture is also reflected in fewer companies in the North East planning to hire new employees with a balance of -20%, while investment plans also remain static. \nAcross the UK, while activity levels remain largely unchanged from the second quarter, manufacturers’ confidence about future prospects for the overall UK economy have taken a knock, leading EEF to downgrade its growth forecasts for both the economy and manufacturing for this year and 2017. \nIn contrast, however, the export picture looks more positive off the back of the fall in Sterling and stronger demand from the EU, US and emerging markets. In fact, export orders have exceeded expectations by moving into positive territory during Q3 to +2% - the highest balance since 2014q2. \nAs a result of the depreciation in Sterling, manufacturers are far more positive about future export orders. A balance of +12% are expecting a boost in the next quarter with the biggest driver appearing to be demand from the EU. \nThe flipside of Sterling’s depreciation, however, has been increased pressure on profits this quarter with price increases planned for the next three months. \nLooking ahead, expectations across the sector are that output and orders balances will finally move into positive territory by the end of the year, which is supporting plans for recruitment across some sectors in the next three months, but is not yet sufficient to prompt a turnaround in investment plans. \nEEF’s forecasts for UK growth were revised in July, following the referendum, and growth projections for the economy this year and next remain unchanged at 1.7% and 0.8% respectively. \nHowever, forecasts for manufacturing output have been revised up to 0.4% in 2016 (from -0.3% in July) and -0.7% in 2017 (from -1.1%). \nLiz Mayes, North East region director at EEF, said: “Manufacturers’ confidence collapsed in the aftermath of the referendum, but our latest survey provides some relief that this has corrected. \n“Signs of an export revival are helping to drive more optimism about activity in the second half of the year, but concerns about whether the UK economy can shrug off post-referendum challenges are still clearly evident. \n“These risks are expected to hit some sectors, such as industries linked to investment goods and construction, harder than others. Despite the short-term outlook for manufacturing remaining broadly stable, the continued downward slide in investment plans should keep policy makers alive to the potential risks facing the sector. \n“The Government needs to proceed quickly in developing an ambitious industrial strategy to make the UK an attractive proposition for future manufacturing investment. This will become even more critical once negotiations to leave the EU begin and Article 50 is triggered.” Read More Risk to growth as UK manufacturers remain 'reluctant' to borrow from banks \nJason Whitworth, corporate finance partner and head of manufacturing at BDO LLP in the North East, added: “While the outlook for the UK economy remains uncertain, manufacturers are more confident about their own business performance. This shows they believe there is a positive way forward from here and that Brexit might not have been the portent of recession. \n“Some sectors are clearly facing longer term structural challenges where global factors are at play and these are unlikely to abate anytime soon. However, history shows that in difficult economic circumstances there are always sectors and companies that thrive on being driven to innovate, develop new products and search out new markets and customers. These are the factors that successful companies will be focusing on to continue this improvement in business performance.”", "external_links": [], "published": "2016-09-05T07:01:00.000+03:00", "crawled": "2016-09-05T02:36:09.199+03:00", "highlightTitle": ""}