{"organizations": [], "uuid": "064d01922087441491c23d558160a2a68b9b81fb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article11837682.ece/ALTERNATES/s1200/JS97797792.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/lack-trust-politicians-public-figures-11837676", "country": "GB", "domain_rank": 21960, "title": "Why our lack of trust in politicians and public figures is starting to damage us all", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Why our lack of trust in politicians and public figures is starting to damage us all", "spam_score": 0.0, "site_type": "news", "published": "2016-09-04T18:30:00.000+03:00", "replies_count": 0, "uuid": "064d01922087441491c23d558160a2a68b9b81fb"}, "author": "Thom Brooks", "url": "http://www.chroniclelive.co.uk/news/north-east-news/lack-trust-politicians-public-figures-11837676", "ord_in_thread": 0, "title": "Why our lack of trust in politicians and public figures is starting to damage us all", "locations": [], "entities": {"persons": [{"name": "jeremy corbyn", "sentiment": "none"}, {"name": "nick clegg", "sentiment": "none"}, {"name": "thom brooks", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "john f. kennedy", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "owen smith", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "owen", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "none"}, {"name": "durham university", "sentiment": "none"}, {"name": "british airways", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "durham law school", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Why our lack of trust in politicians and public figures is starting to damage us all 11:30, 4 Sep 2016 Durham University's Thom Brooks on why we have to look to ourselves to fix what is broken Shares Get daily news by email Gold medalists of Team GB pose for a selfie with a member of British Airways cabin crew \nTrust is political gold dust. Hard to acquire and easy to squander. Once it’s gone, it becomes even more difficult to build up. And don’t our politicians know it? \nMany decisions are made on trust. Leaders who win our confidence also receive our votes. At the last general election, voters had more trust in the Tories to lead the country – fuelled by negative campaigning about how their opponents did not deserve trust. \nFor all the promises that ‘Remain’ offered of a brighter future, a general mistrust of ‘the Establishment’, from seasoned politicians to CEOs of Britain’s most successful companies, contributed to a Brexit vote . Pro-EU voices were not trusted to put Britain’s interests first. \nTrust colours how we perceive politicians, too. Liberal Democrats were almost fatally damaged not by their decision to join a governing coalition with the Tories, but for their reneging their promises on tuition fees. When they agreed that university fees for students should be kept – and be trebled to £9000 per year – this damaged public trust in the party. \nAnyone looking back on their 2015 election campaign remembers two things. First is that every candidate held large signs with promises on tuition fees that were soon broken. Second is the famous television advert with Nick Clegg claiming “no more broken promises” – only to go on and do so on tuition fees. \nNotably, the trust that was lost is not only among those that voted for the party – it was by the public at large. Trust is something both friends and opponents can share even if they disagree on much else. \nThe recent #traingate curiosity is an illuminating case study. Labour leader Jeremy Corbyn has built an enormous store of trust among his many supporters for his opposition to the Iraq War and the continuation of Trident. Whatever else his critics might charge, he has been trusted to act in principled ways. \nThis is why the disputed incident on his train journey to Newcastle for a leadership debate against challenger Owen Smith MP is so potentially damaging. It is because it has the potential to weaken his greatest strength: the trust friends and foes have in the positions he supports. Decades of dedicated service can be brought into question from a brief clip. \nAnd as usual it was not what took place that has done the most damage, but how it has been handled. While this one event does not appear to have moved the goalposts for either Corbyn or Owen, the first signs are that trust and public confidence in the leadership has not been enhanced. Winning over much-needed voters is made more difficult by a one-off media storm that challenges trust. \nThis feeds into something deeper. Our lives are built on trust. No child can survive without the support of someone else. While we may become more dependent over time, we also become interdependent. Our reliance on others does not end with growing out of infancy. Trust does not become less important over time. \nJeremy Corbyn is right to say we’re heading for a new kind of politics – even if it is not kinder or gentler. Ours is a cynical time of mistrust of each other. This breeds antagonism and division. The terrible online trolling and abuse seen in recent years is a predictable result. \nSo what to do for a public that mistrusts elites? We place our hopes and dreams in their opponents. \nDonald Trump’s greatest asset for Republicans is that he’s not a Republican politician. Likewise, Corbyn’s best attribute for his many Labour supporters is that no Labour MP has voted against his party more often. In becoming the anti-Republican or anti-Labour they somehow rise above them to become a purer or at least better brand than all the rest – who are tarred for being more of the same. \nIf this outcome looks bleak, it’s because for many people that is how the future looks – bleak. Parents don’t expect their children to do better than they did. Young adults get on the housing ladder later and later – and through no fault of their own. A land of plenty looks more and more like a land of plenty for someone else. And I’ve said nothing of financial insecurity or immigration. \nPoliticians and the media have much to answer for in how we got to where we are. Daily attacks and cheap stunts may score political points today, but they damage the wider institution over time benefiting few of us. \nYet we the People have the government we deserve. If left as a political class, we can all continue to mistrust their every move – or we can do something constructive about it. \nJohn F. Kennedy was right that we should ask more about what we can do for our community instead of what can others do for us. I don’t mean to downplay the importance of a social safety net or ignore the common values and ideals that make us a community. \nBut the most damaging thing of all arising from the increasing lack of trust in public officials is that fewer of us are inspired to work in the public interest for the betterment of our community and our great country. We can have public figures to believe in again – but they will come from you and me, not from nowhere. \nAnd I have hope. The incredible achievements of Team GB in the Rio Olympics was inspirational. We don’t need medals to fix our political system. But we do need more citizens with a willingness to do so. \nThom Brooks is Head of Durham Law School at Durham University.", "external_links": [], "published": "2016-09-04T18:30:00.000+03:00", "crawled": "2016-09-04T13:43:42.259+03:00", "highlightTitle": ""}