{"organizations": [], "uuid": "6499b10990265ea5962935c03359174217c2cd03", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article11886854.ece/ALTERNATES/s1200/TKR_NJL_240315NigelWrightPaulWilson.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/shortage-skills-professionals-key-challenge-11886608", "country": "GB", "domain_rank": 21960, "title": "Shortage of skills professionals will be key challenge to North East businesses", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Shortage of skills professionals will be key challenge to North East businesses", "spam_score": 0.0, "site_type": "news", "published": "2016-09-14T22:20:00.000+03:00", "replies_count": 0, "uuid": "6499b10990265ea5962935c03359174217c2cd03"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/shortage-skills-professionals-key-challenge-11886608", "ord_in_thread": 0, "title": "Shortage of skills professionals will be key challenge to North East businesses", "locations": [], "entities": {"persons": [{"name": "graeme whitfield", "sentiment": "none"}, {"name": "paul wilson", "sentiment": "none"}, {"name": "monica molesag paul wilson", "sentiment": "none"}, {"name": "nigel wright", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Shortage of skills professionals will be key challenge to North East businesses 15:20, 14 Sep 2016 15:20, 14 Sep 2016 By Graeme Whitfield Survey by recruitment firm includes data on pay rates and job satisfaction across a range of industries Shares Get business news by email Monica Molesag Paul Wilson, the chief executive officer of Nigel Wright \nA shortage of skilled professionals will be one of the key challenges for businesses in the North East this year, a new survey suggests. \nThe annual salary survey by Newcastle recruitment firm Nigel Wright is based on the replies of more than 1,000 professionals working in the region, plus information from the company’s regional database on things like job satisfaction, the reasons for leaving jobs, gender differences in pay, and the methods used by candidates in their job search. \nThey survey showed that professionals in the region enjoyed an average 3% pay rise in the past year, with executive pay rising at the fastest rate at 4.9%. Above average rises were also seen in finance (3.7%) and manufacturing (3.4%) with other disciplines coming in between 2.1% and 2.9%. \nThe survey found that the number of people who said they received a guaranteed bonus declined by 2%, though the average guaranteed bonus received increased from 7% to 11% of salary. \nOverall job satisfaction has remained static in the North East during the last 12 months, with 78% of people saying they were either satisfied or very satisfied in their current role. Job satisfaction had previously fallen by 12% between 2014 and 2015. \nPaul Wilson, CEO at Nigel Wright, said: “The market is moving forward again after a period of relative stability. Companies are becoming used to diversifying into related markets and where growth is driven by finance, there is ready access to private equity. Consequently, there are more opportunities emerging, particularly at the mid-level and more senior ends of the market. \n“At the same time, companies can’t afford to lose key people. Because of this, we’re seeing a significant increase in the number of counter offers. \n“At the extreme end of the scale, firms are offering up to 40% pay rises to persuade their star people to stay. It is then down to our skills as a recruiter to manage these situations. Firms have also put succession planning very much back on the agenda. \n“There’s an increasing awareness of the importance of strategic talent. Employers need to consider not just the basic salary but also bonuses and other flexible benefits if they want to retain and attract the right sort of talent. Professionals want to work for companies with the right attitude and as a brand they believe in and want to work for. \n“It’s worth noting that our survey was conducted prior to the Brexit vote, but it was reassuring to see that recruiting talent from overseas wasn’t a major priority for firms seeking to increase headcount this year. We are not experiencing any less activity by clients or candidates since the Brexit vote. \n“Finally, as more individuals are now using online media in their job search, it is increasingly important for businesses to invest in their employer brand and in resources that can maximise their potential of attracting the best candidates.” \nThe survey found that the gender pay gap between male and female salaries was 12%, the same as last year, which is below the current national average of 18%. \nDespite that, women were slightly happier in their jobs, with 81% of female respondents content in their position compared to 76% of men. \nMore than a fifth (21%) of those questioned said they would be tempted to change jobs if offered better flexible working conditions elsewhere, while 71% said they already enjoy some flexible working arrangements in their current role, the most popular being flexi-time (39%) and being able to work from home (38%). \nThe greatest area of dissatisfaction in the survey (43%) was the length of people’s working hours and the detrimental effect this has on their work life balance. Where respondents highlighted other issues, the keys things mentioned were that people would prefer less stress and a greater ability to work from home.", "external_links": [], "published": "2016-09-14T22:20:00.000+03:00", "crawled": "2016-09-14T17:47:38.205+03:00", "highlightTitle": ""}