{"organizations": [], "uuid": "2b5576e4fa91c93f3d853dd0d57303e0d9bc4a65", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.liverpoolecho.co.uk/incoming/article11879485.ece/ALTERNATES/s1200/flim.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/business-breakfast-live-new-11883560", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast RECAP: When will new £5 notes come to Newcastle? Plus latest news", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast RECAP: When will new £5 notes come to Newcastle? Plus latest news", "spam_score": 0.0, "site_type": "news", "published": "2016-09-14T15:00:00.000+03:00", "replies_count": 0, "uuid": "2b5576e4fa91c93f3d853dd0d57303e0d9bc4a65"}, "author": "Daniel Milligan", "url": "http://www.chroniclelive.co.uk/business/business-news/business-breakfast-live-new-11883560", "ord_in_thread": 0, "title": "Business Breakfast RECAP: When will new £5 notes come to Newcastle? Plus latest news", "locations": [], "entities": {"persons": [{"name": "daniel milligan", "sentiment": "neutral"}, {"name": "ms de rojas", "sentiment": "none"}, {"name": "sean bullick", "sentiment": "none"}, {"name": "christon park", "sentiment": "none"}, {"name": "sage", "sentiment": "none"}, {"name": "tony ball", "sentiment": "none"}, {"name": "hull", "sentiment": "none"}, {"name": "daniel milligan gin", "sentiment": "none"}, {"name": "daniel milligan dunelm", "sentiment": "none"}, {"name": "andy harrison", "sentiment": "none"}, {"name": "greggs", "sentiment": "none"}, {"name": "jacqueline de rojas", "sentiment": "none"}, {"name": "james mccauley", "sentiment": "none"}], "locations": [{"name": "leeds", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "cardiff", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "ouseburn", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "tyneside", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "south east", "sentiment": "none"}, {"name": "gosforth", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}, {"name": "northern europe", "sentiment": "none"}, {"name": "liverpool", "sentiment": "none"}, {"name": "durham distillery", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "neutral"}, {"name": "ward hadaway fastest", "sentiment": "none"}, {"name": "sage group jacqueline de rojas  jacqueline", "sentiment": "none"}, {"name": "business improvement district company", "sentiment": "none"}, {"name": "newcastle gin company", "sentiment": "none"}, {"name": "fitness chain pure gym", "sentiment": "none"}, {"name": "dunelm", "sentiment": "none"}, {"name": "newcastle quayside", "sentiment": "none"}, {"name": "ne1 ltd", "sentiment": "none"}, {"name": "bealim house", "sentiment": "none"}, {"name": "la fitness", "sentiment": "none"}, {"name": "vaulkhard group", "sentiment": "none"}, {"name": "adderstone group", "sentiment": "none"}, {"name": "newcastle gin", "sentiment": "none"}, {"name": "customs", "sentiment": "none"}, {"name": "citrix", "sentiment": "none"}, {"name": "newcastle gin company ltd.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "09:00 Daniel Milligan Have a nice day \nThat’s all for the Business Breakfast blog today - we’ll be back again from 8am tomorrow. 09:00 Daniel Milligan New Sage boss to be guest speaker \nLeading tech industry figure and Sage’s new EVP for Northern Europe, Jacqueline de Rojas, will be the guest speaker at the Ward Hadaway Fastest 50 Awards for 2016. \nMs de Rojas will give the keynote address at the event in October when the fastest growing companies across the North East will be revealed. \nAcclaimed as the most influential woman in IT in the UK, Jacqueline de Rojas has more than 25 years’ operational experience in the software industry including as general manager and area VP for Northern Europe for Citrix, the role she held before taking up her new post as EVP Northern Europe at Newcastle-based FTSE 100 software giant Sage which she starts on 1st October. Sage Group Jacqueline de Rojas \nJacqueline is the current president of UK technology industry body techUK and is the organisation’s board champion for women and diversity. 08:52 Daniel Milligan Luxury Quayside apartment tower \nMore than 1,500 jobs could be created through a hat-trick of Newcastle housing schemes which include a landmark Quayside apartment scheme. \nProperty developer Adderstone Group is seeking approval for the three large schemes in Gosforth , Ouseburn and the East Quayside, which together represent an investment of £100m. \nThe proposed developments have been welcomed by NE1 Ltd, the city centre Business Improvement District Company. \nSean Bullick, NE1’s chief executive, said: “Adderstone Group’s development pipeline, whilst still subject to planning, potentially represents one of the most significant commitments by a private developer into Newcastle’s urban core. How the Adderstone Group residential development at Plot 12 will look on Newcastle Quayside \n“As the city’s population continues to grow and become ever more diverse, it is essential that we continue to develop a range of quality new housing stock. It is great to see a local developer as a key player taking up that challenge.” \nIn Gosforth, a planning application has been submitted to build 51 homes on land which was the original Greggs’ Plc headquarters, a site the group acquired in 2012. \nThe scheme, to be known as Christon Park, would see 51 four and five-bedroom family homes on the four-acre brownfield site. \nThe firm said Christon Park has been architecturally designed around a grand crescent and features wildlife corridors and communal “pocket parks”. 08:45 Daniel Milligan Gin distillery secures its license to distill \nA leisure firm has been given a license to distill at Newcastle city centre’s only working in-house gin still after more than a year of battling red tape. \nThe Vaulkhard Group, which owns a string of bars on Tyneside and Northumberland, launched the Newcastle Gin Company in September 2015, to distill and sell the spirit from its re-furbished Bealim House bar at Newcastle’s Gallowgate. \nThe firm had hoped to start distilling gin ins its 400-litre custom-built still – kept encased behind bullet proof glass within the bar – within weeks of opening. \nBut it has only now received its full compounders and rectifier’s license and bonding trading facility license from HM Revenue and Customs (HMRC), paving the way for the still to finally get going. \nThe licences mean Bealim House can legally start to distil its Newcastle Gin on site under duty suspension, where previously its recipe had been made at Durham Distillery, following a partnership with Vaulkhard Group to create Newcastle Gin Company Ltd. 08:40 Daniel Milligan New fivers next week? \nThe new five pound note went into circulation yesterday.. but not in Newcastle. \nDespite big city branches in Manchester and Liverpool getting their hands on the plastic bills, it seems that the North East is not yet at the front of the queue. \nHowever, most bank branches are expected to have the notes within a week or so, suggesting those who want to obtain one may have to go into a bank and ask for one. \nBut only about 7% of cash machines dispense £5 notes in any case. \nThe polymer note - which is much more durable than the old fiver - will initially only be available from a handful of banks and cash points. \nATMs in London, Manchester, Birmingham, Leeds, Hull and Cardiff are among the first to stock them. Video loading Click to play Tap to play The Live Event you are trying to watch is either unavailable or has not started Please refresh this page in your browser to reload this live event video 08:31 Daniel Milligan Dunelm notches up rise in full-year profits \nHomewares retailer Dunelm has notched up a rise in full-year profits and pledged to press ahead with expansion plans, despite uncertainty created by the Brexit vote. \nDunelm reported a 6.2% rise in pre-tax profits to £128.9 million, while revenue ticked up 7.1% to £880.9 million. \nChairman Andy Harrison said: “Post-Brexit, we are confident the same opportunities exist now. We have ambitious plans to continue to grow our business.” \nThe firm plans to ramp up expansion in London and the South East, taking its store numbers from 157 to 200 in the process. \nThe company, which saw like-for-like sales in its stores grow 1% over the year, is planning to open nine new stores this year, with three in London. 08:23 Daniel Milligan Pure Gym plans for stock market flotation \nFitness chain Pure Gym has unveiled plans for a stock market flotation as it hailed the latest step in its journey from start-up to “undisputed market leader”. \nThe group is aiming to raise £190 million from its initial public offering (IPO) to further seal its position as the biggest gym group in the UK’s £4.4 billion health and fitness market. \nPure Gym was founded in 2008 and now has 163 gyms and nearly 786,000 members nationwide, boosted by the takeover last year of rival LA Fitness. \nThe group now wants to roll out its affordable and flexible gym membership model further across the UK, while also looking at other areas of the fitness market and possible acquisitions. \nTony Ball, chairman of Pure Gym, said: “Pure Gym’s growth from a start-up company in 2008 to undisputed market leader today is a story of disruption and shows how entrepreneurial vision can build real business success.” James McCauley", "external_links": [], "published": "2016-09-14T15:00:00.000+03:00", "crawled": "2016-09-14T12:31:57.478+03:00", "highlightTitle": ""}