{"organizations": [], "uuid": "1bd9dd509403d569fee6f5987b0e91ac4a588d3b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article11895377.ece/ALTERNATES/s1200/JS99744223.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/northern-powerhouse-george-osborne-fights-11895205", "country": "GB", "domain_rank": 21960, "title": "Northern Powerhouse - George Osborne fights to save his pet project", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Northern Powerhouse - George Osborne fights to save his pet project", "spam_score": 0.0, "site_type": "news", "published": "2016-09-16T19:21:00.000+03:00", "replies_count": 0, "uuid": "1bd9dd509403d569fee6f5987b0e91ac4a588d3b"}, "author": "Katie Dickinson", "url": "http://www.chroniclelive.co.uk/news/north-east-news/northern-powerhouse-george-osborne-fights-11895205", "ord_in_thread": 0, "title": "Northern Powerhouse - George Osborne fights to save his pet project", "locations": [], "entities": {"persons": [{"name": "george osborne", "sentiment": "negative"}, {"name": "steve rotheram", "sentiment": "none"}, {"name": "andy burnham", "sentiment": "none"}, {"name": "richard leese", "sentiment": "none"}, {"name": "margaret thatcher", "sentiment": "none"}, {"name": "hull", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "sajid javid", "sentiment": "none"}, {"name": "joe anderson", "sentiment": "none"}, {"name": "ed cox", "sentiment": "none"}, {"name": "osborne", "sentiment": "none"}, {"name": "dame nancy rothwell", "sentiment": "none"}], "locations": [{"name": "sheffield", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "liverpool", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "manchester town hall", "sentiment": "none"}, {"name": "teesside", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}], "organizations": [{"name": "northern powerhouse", "sentiment": "negative"}, {"name": "labour", "sentiment": "none"}, {"name": "ippr north", "sentiment": "none"}, {"name": "northern powerhouse partnership", "sentiment": "none"}, {"name": "institute of public policy research north", "sentiment": "none"}, {"name": "ippr", "sentiment": "none"}, {"name": "leeds", "sentiment": "none"}, {"name": "liverpool", "sentiment": "none"}, {"name": "whitehall", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Former Chancellor launches the Northern Powerhouse Partnership to promote his devolution initiative Shares Get daily news by email Peter Byrne/PA Wire (Left to right) Sir Richard Leese, Joe Anderson, former Chancellor George Osborne and Dame Nancy Rothwell during an announcement about the Northern Powerhouse project \nFormer Chancellor George Osborne today launched a new think-tank to promote his ‘Northern Powerhouse’ project. \nMr Osborne will also chair the Northern Powerhouse Partnership, an independent group, including politicians and business leaders, to help push the agenda of greater powers and investment for the regions to boost jobs and growth. \nHe said: “When I launched the idea of Northern Powerhouse I said I would work tirelessly with anyone and everyone to make it a reality. \n“But even I have been taken aback by the huge support it’s attracted, across political parties, businesses and communities. Neil Hall/PA Wire Former Chancellor George Osborne \n“In the space of just two years, we’ve created powerful new mayors, committed to huge new transport and science projects, and attracted investment from around the world. \n“There’s a real excitement now in the north about what we can achieve if we work together. Read More North East mayor and £900 million devolution deal is scrapped \n“I don’t want us to lose that. That’s why I’m so pleased major businesses, civic leaders and others have worked with me to create this new Northern Powerhouse Partnership. I’m also glad that the Government has given its support.” \nHowever the ‘devolution’ initiative he first introduced in 2014 is now being questioned after he was sacked as chancellor by new Prime Minister Theresa May who has spoken of a broader “proper” industrial strategy, nationwide, rather than a regional focus solely on the north. Peter Byrne/PA Wire An announcement about George Osborne's Northern Powerhouse project at Manchester Town Hall, Manchester \nMeanwhile, senior Labour politicians in the North have recently spoken of Whitehall briefings casting doubt on the new Prime Minister’s commitment to the agenda. \nAnd earlier this month, after North East council leaders voted 4-3 against proceeding with the devolution deal without reassurances over funding, the offer to the region was withdrawn. \nThe Northern Powerhouse aims to devolve powers and money from Whitehall to northern city regions in a bid to boost their economic performance. \nPlans included new investment in north-south high-speed rail, HS2 , and an east-west version, HS3, linking the belt of northern cities from Liverpool to Hull, via Manchester and Leeds. Joe Giddens/PA Wire Andy Burnham \nThe plans also included the election of ‘metro’ mayors for bigger city-regions, including for Manchester, Liverpool, Teesside and Sheffield. \nAndy Burnham and Steve Rotheram, both MPs and Labour’s candidates for the mayoral elections in Manchester and Liverpool respectively, recently warned Mrs May that pulling the plug on the “Northern Powerhouse” agenda would be, “as big a betrayal as the 1980s when Margaret Thatcher pulled the plug on our industries”. \nSajid Javid MP, Secretary of State for Communities and Local Government, said: “This Government realises the huge untapped potential of our great northern towns and cities. \n“That is why I warmly welcome the launch of the Northern Powerhouse Partnership. \nEd Cox, director of the Institute of Public Policy Research North (IPPR North), said it also welcomed Mr Osborne’s move. \nHe said: “IPPR North has long argued that to make the North the most progressive place in Europe, we need more policy ideas, not fewer. \n“This can only reinforce the reality that the Northern Powerhouse is far less a Whitehall programme and far more an initiative driven by northern business, innovation and leadership. \n“It remains to be seen whether this new think-tank will develop an inclusive approach to the Northern economy because to date, George Osborne’s Northern Powerhouse has been too narrowly focused on big cities and metro mayors - vital as these are, they will not address the economic and social challenges raised by the Brexit vote.”", "external_links": [], "published": "2016-09-16T19:21:00.000+03:00", "crawled": "2016-09-16T14:36:55.664+03:00", "highlightTitle": ""}