{"organizations": [], "uuid": "8a9879a0a7eb553f64ad59729cec7a9f7506f46a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article11235930.ece/ALTERNATES/s1200/JS75068230.jpg", "site_section": "", "section_title": "", "url": "http://www.chroniclelive.co.uk/news/local-news/north-east-devolution-recap-leaders-11848576", "country": "IE", "domain_rank": 21960, "title": "North East Devolution RECAP: Leaders vote against next stage of deal due to post-Brexit funding concerns - Chronicle Live", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 0, "title_full": "North East Devolution RECAP: Leaders vote against next stage of deal due to post-Brexit funding concerns - Chronicle Live", "spam_score": 0.001, "site_type": "news", "published": "2016-09-07T03:37:00.000+03:00", "replies_count": 0, "uuid": "8a9879a0a7eb553f64ad59729cec7a9f7506f46a"}, "author": "Daniel Milligan", "url": "http://www.chroniclelive.co.uk/news/local-news/north-east-devolution-recap-leaders-11848576", "ord_in_thread": 0, "title": "North East Devolution RECAP: Leaders vote against next stage of deal due to post-Brexit funding concerns - Chronicle Live", "locations": [], "entities": {"persons": [{"name": "alexandra jones", "sentiment": "none"}, {"name": "paul watson", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "cllr paul watson", "sentiment": "none"}, {"name": "mike kelly", "sentiment": "none"}, {"name": "daniel milligan", "sentiment": "none"}, {"name": "george osborne", "sentiment": "none"}, {"name": "laura hill", "sentiment": "none"}], "locations": [{"name": "north tyneside", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "south tyneside", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "neca", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "none"}, {"name": "gateshead council", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "north east combined authority", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "So, to summarise \nIf you’re just joining the blog, here’s what you should know about: The leaders of Sunderland, Durham, South Tyneside, Gateshead local authorities voted against the devolution deal as it stands Newcastle, Northumberland and North Tyneside voted to press forward with the multi-million pound plan NECA, the North East Combined Authority, could not agree on a decision as four authorities wanted to consult members of the public first The agreement would guarantee £30m a year for the region to spend – in addition to being given control of a £3.4bn pool of investment cash A strict deadline had been set for today by the Government - either sign up or the deal is off - and reporter Laura Hill says the deal has been left in limbo. 16:14 Mike Kelly How much patience will Government have? \nMore analysis on today’s decision from our social affairs writer Mike Kelly: \nSome have speculated if there was no unanimous agreement there would be fresh negotiations on a new deal between those who wanted the deal. That was only remotely feasible when Gateshead was the only dissenting voice. \nIt was in May that Gateshead Council walked out on negotiations saying the Government’s financial settlement for the region was “not good enough”. \nHowever today Sunderland, Durham and South Tyneside have joined Gateshead which surely makes even the thought of a separate arrangement a no-go. \nHow much patience will a Tory government without former Chancellor George Osborne have with the North East? The ‘Northern Powerhouse’ initiative of which this devolution deal was a central plank was his baby. There were suggestions that new Prime Minister Theresa May was suspicious about the principle of elected Mayors. \nMost would be Labour supporting and, if they did a good job, would make the beleaguered party look electable. We can now only wait for the government’s response to the news and find out if NECA has done her a big favour. \n- Mike Kelly Think tank calls to explore more options \nAn independent think tank, called Centre for Cities, say today’s decision is regrettable. \nThey provide economic data on UK cities, from population and jobs to housing and transport, in order to produce research and run events that support city policies and urban economies. \nChief Executive Alexandra Jones said:“It is deeply regrettable that local leaders in the North East have been unable to agree upon taking forward the proposed devolution deal for the area, which could have boosted the region’s long-term economic prospects. \n“But this should not signal the end of devolution in the North East. Now may be the time to think instead about devolving power on a different basis within the region – for example, to a ‘Newcastle city region’, which would more closely reflect the geography over which people in that area live, work and access public services. \n“National and local leaders must continue to work together to explore these options, and to ensure that devolution in the North East does not come to a standstill.” 15:50 Daniel Milligan Decision is \"disappointing\" - NECA chair \nFollowing the decision at the meeting, Cllr Paul Watson, chair of the North East Combined Authority (NECA), said: \n“Each of the seven councils which make up the NECA has always made clear that they support the principle of devolution for the North East. \n“Following the outcome of the EU referendum and the subsequent changes within Government, council leaders have been equally clear that to move forward, the new Government must provide assurances regarding the terms of the region’s devolution deal. \n“Extensive discussions and negotiations have taken place with Government and within the region over recent months but unfortunately, despite our best efforts, it has not been possible to reach an agreement which all of the seven local authorities feel able to support. \n“Although this is disappointing we will continue to work together with Government to achieve our ambition of a stronger regional economy with improved opportunities for residents and businesses.” Paul Watson ", "external_links": [], "published": "2016-09-07T03:37:00.000+03:00", "crawled": "2016-09-07T20:05:07.364+03:00", "highlightTitle": ""}