{"organizations": [], "uuid": "6de8c280336343a4f4abc1483400b0988f01e9f0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article11844682.ece/ALTERNATES/s1200/Sainsburys-management-training.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/business-breakfast-recap-sainsburys-sales-11943400", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast RECAP: Sainsbury's sales fall, UK Mail acquired, plus other latest news", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast RECAP: Sainsbury's sales fall, UK Mail acquired, plus other latest news", "spam_score": 0.0, "site_type": "news", "published": "2016-09-28T07:00:00.000+03:00", "replies_count": 0, "uuid": "6de8c280336343a4f4abc1483400b0988f01e9f0"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/business-breakfast-recap-sainsburys-sales-11943400", "ord_in_thread": 0, "title": "Business Breakfast RECAP: Sainsbury's sales fall, UK Mail acquired, plus other latest news", "locations": [], "entities": {"persons": [{"name": "coreena ford", "sentiment": "negative"}, {"name": "simon johnson", "sentiment": "none"}, {"name": "jurgen gerdes", "sentiment": "none"}, {"name": "benny", "sentiment": "none"}, {"name": "ross mcewan", "sentiment": "none"}, {"name": "richard", "sentiment": "none"}, {"name": "mike coupe", "sentiment": "none"}, {"name": "catherine furze", "sentiment": "none"}, {"name": "thomas cook", "sentiment": "none"}, {"name": "coreena ford jesmond", "sentiment": "none"}, {"name": "frankie", "sentiment": "none"}, {"name": "george davies", "sentiment": "none"}, {"name": "argos", "sentiment": "none"}, {"name": "davies", "sentiment": "none"}, {"name": "kanter worldpanel", "sentiment": "none"}, {"name": "george", "sentiment": "none"}, {"name": "ed", "sentiment": "none"}, {"name": "sanderson weatherall", "sentiment": "none"}, {"name": "dan o’donoghue", "sentiment": "none"}, {"name": "cllr paul watson", "sentiment": "none"}, {"name": "coupe", "sentiment": "none"}, {"name": "coun watson", "sentiment": "none"}, {"name": "ward hadaway", "sentiment": "none"}, {"name": "tui", "sentiment": "none"}, {"name": "fiona davis", "sentiment": "none"}, {"name": "crepeaffaire", "sentiment": "none"}, {"name": "coun paul watson", "sentiment": "none"}, {"name": "bob mackenzie", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "cuba", "sentiment": "none"}, {"name": "baltic", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "chiquito", "sentiment": "none"}, {"name": "uk mail", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "sri lanka", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}, {"name": "eldon square", "sentiment": "none"}, {"name": "north tyneside", "sentiment": "none"}, {"name": "spencer", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "grey", "sentiment": "none"}, {"name": "jesmond", "sentiment": "none"}, {"name": "continental europe", "sentiment": "none"}, {"name": "cape verde", "sentiment": "none"}, {"name": "cyprus", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "netherlands", "sentiment": "none"}, {"name": "kuwait", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "sunderland civic centre", "sentiment": "none"}, {"name": "turkey", "sentiment": "none"}, {"name": "egypt", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "crepeaffaire", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "south tyneside", "sentiment": "none"}, {"name": "chaophraya", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}, {"name": "dominican republic", "sentiment": "none"}, {"name": "neca", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "birmingham mail crepeaffaire", "sentiment": "none"}], "organizations": [{"name": "sainsbury", "sentiment": "negative"}, {"name": "deutsche post", "sentiment": "none"}, {"name": "coreena ford rbs", "sentiment": "none"}, {"name": "thomson", "sentiment": "none"}, {"name": "uk mail", "sentiment": "none"}, {"name": "rbs", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "tesco", "sentiment": "none"}, {"name": "coreena ford uk", "sentiment": "none"}, {"name": "nordics", "sentiment": "none"}, {"name": "arriva", "sentiment": "none"}, {"name": "home retail group", "sentiment": "none"}, {"name": "journal", "sentiment": "none"}, {"name": "deutsche bank", "sentiment": "none"}, {"name": "national credit union administration board", "sentiment": "none"}, {"name": "bbc radio", "sentiment": "none"}, {"name": "north east angel fund", "sentiment": "none"}, {"name": "argos", "sentiment": "none"}, {"name": "us department of justice", "sentiment": "none"}, {"name": "handmade burger co", "sentiment": "none"}, {"name": "coreena ford sainsbury", "sentiment": "none"}, {"name": "coreena ford", "sentiment": "none"}, {"name": "sunderland council", "sentiment": "none"}, {"name": "consett popcorn", "sentiment": "none"}, {"name": "bella italia", "sentiment": "none"}, {"name": "coreena ford crepe", "sentiment": "none"}, {"name": "north east combined authority", "sentiment": "none"}, {"name": "royal bank of scotland", "sentiment": "none"}, {"name": "asda", "sentiment": "none"}, {"name": "spreadex.com", "sentiment": "none"}, {"name": "royal mail", "sentiment": "none"}, {"name": "ward hadaway north east fastest", "sentiment": "none"}, {"name": "doj", "sentiment": "none"}, {"name": "the north east combined authority", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "us central federal credit union and western corporate federal credit union", "sentiment": "none"}, {"name": "neca", "sentiment": "none"}, {"name": "federal housing finance agency", "sentiment": "none"}, {"name": "rivers capital partners", "sentiment": "none"}, {"name": "consett popcorn company limited", "sentiment": "none"}, {"name": "coreena ford travel", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "9.37 Coreena Ford Have a great day... \nThat’s all for today. No pet picture today I’m afraid - this blog is a serious business you know... \nBack again tomorrow. FTSE and pound latest \nThe FTSE-100 index at 8:45am was up 49.08 at 6856.75. \nThe pound at 9am was 1.3008 dollars compared to 1.3003 dollars at the previous close. The euro at 9am was 0.8605 pounds compared to 0.8618 pounds at the previous close. 9.30 Coreena Ford Travel giant Tui enjoys strong summer \nThomson owner Tui signalled that British holidaymakers had shrugged off any worries over the Brexit vote and plunging pound as it reported strong demand for trips abroad. \nThe travel giant revealed the UK was its best performing region over the summer season, with revenues up 5%, while bookings from Britain have also surged by 22% so far for the winter as sun-seekers head to long-haul destinations such as Mexico and the Dominican Republic. \nA weaker performance in the Nordics and Germany left overall revenues 1% higher for the summer, but Tui said bookings were 7% higher excluding Turkey, where an attempted military coup was thwarted in July. \nTui hiked its earnings outlook for the full year after the better-than-expected trading. It said underlying earnings are now set to grow by 12% and 13% over the year to September 30 - up from August’s prediction for growth of at least 10%. \nRival Thomas Cook also revealed robust demand from UK holidaymakers in its update on Tuesday, but its sales were hit hard in Germany and across Continental Europe, tumbling by 9%, in the wake of Turkey’s woes and recent terrorist attacks. \nTui said long-haul bookings from the UK are up 26% so far for the winter as it switches its focus to far-flung destinations, having recently added planes flying to Cuba and Sri Lanka. \nIt said trips to the Canaries, Cyprus and Cape Verde were also in demand as holidaymakers continue to stay away from Turkey and Egypt. Overall winter bookings are up 5%, with revenues up 11% so far. Shares lifted around 2% after Tui’s earnings upgrade. (c) Medioimages/Photodisc Mexico has been a big seller for Tui 9.21 Coreena Ford Crepe restaurant coming to Newcastle city centre \nSay hello to Crepeaffaire , one of the last restaurants to be named in the line-up for intu Eldon Square’s £25m dining zone. \nThe firm is creating jobs after joining the lengthy menu of eateries at the multi-million pound restaurant area called Grey’s Quarter. \nCrepeaffaire already serves up freshly-made, sweet and savoury pancakes in 14 restaurants across the UK, Netherlands and Kuwait. \nThe current line-up also includes TGI Fridays, Chiquito, Smashburger, Tapas Revolution, pizza restaurant Inferno, fresh tea specialist Chatime, Chaophraya, Frankie & Benny’s, Giraffe, The Alchemist, Bella Italia, Tortilla, Red’s True Barbecue, George’s Great British Kitchen, Handmade Burger Co, Ed’s Diner and ASK. Birmingham Mail Crepeaffaire in Birmingham - the firm will soon open in Newcastle 9.15 Coreena Ford Jesmond bus depot ripe for redevelopment \nHere’s one for the developers out there...fancy turning the Grade II listed bus depot in Jesmond, Newcastle, into something new? \nThe wheels are in motion for the redevelopment of the bus depot in Newcastle after it was placed on the market. \nNewcastle-based property consultancy Sanderson Weatherall has been appointed to sell the Grade II listed Arriva depot in Jesmond, Newcastle, a large site that the firm expects to generate a lot of interest. \nArriva, the current owners of the site, is vacating the premises as part of the transport company’s relocation plan, leaving a large plot of land ripe for potential redevelopment. Sanderson Weatherall The former Arriva bus depot in Jesmond is up for sale 9.13 Coreena Ford UK's first posh popcorn firm is on the rise \nA gourmet popcorn maker in County Durham has conquered a niche sector of the health food market following a £150,000 investment boost. \nConsett Popcorn Company Limited has quadrupled its turnover and created four new jobs following the investment from the North East Angel Fund, managed by Rivers Capital Partners. \nThe firm was the UK’s very first gourmet savoury and sweet popcorn manufacturer when it was founded in 2009 by husband-and-wife team Richard and Catherine Furze, who had a vision to make and brand clean label popcorn to suit all tastes. Simon Johnson, Rivers Capital Partners and Catherine Furze, Consett Popcorn 9.10 Coreena Ford Sainsbury's - is the firm falling behind in the supermarket battle? \nA senior market analyst at Spreadex.com feels the supermarket giant is dropping behind the competition. \nHe said: \nIt looks like Sainsbury’s might be starting to lag behind in the supermarket price war. \nWhile Morrisons, traditionally the weakest of the Big Four, managed a 3rd consecutive quarter of like-for-like sales earlier in the month and, according to Kanter Worldpanel, Tesco is at a 2 year sales high, Sainsbury’s revealed yet another disappointing update , with a 1.1% drop in comparable sales joined by a 0.4% decline in total growth. \nThe only plus point was the performance of Home Retail Group, which saw a 2.3% rise in like-for-likes, though even that news is tempered by the fact that increase came in the quarter before Sainsbury’s bought the Argos-owner. \nThis sparked a near 2% decline, with investors dragging the stock away from its recent £2.50 peak. 9.02 Coreena Ford \"Fashion needs more women in top posts\" - Next founder \nRetail grandee George Davies has called for more women to be appointed to top jobs in British fashion, a move he believes will help boost the high street. The veteran retailer, founder of Next and the man behind George At Asda and Marks and Spencer’s Per Una range, said women have “more vision than men” and that men over 30 “dress like their dads”. \nSpeaking to BBC Radio 4’s You And Yours programme, Mr Davies said: \nIf there was better representation of them (women) in executive teams, maybe the high street wouldn’t be struggling as much as it is. \n(Women) work quicker and harder than men. The retail industry needs people who visit stores and understand customers and that’s why I think the gender mix on executive boards should be at least equal. \nThe 75-year-old added that he has always “surrounded himself with women” at work. \nThe board of Mr Davies’ current venture, fashion chain FG4, is made up of 51 women and 19 men, a 67%-33% split. He added: \nI always say about men, when it comes to fashion they can be as trendy as hell until they’re 20 years old but as soon as they’re 30 they dress like their dads - that’s why retail is struggling. \nEarlier this year, campaign group Women In Retail published research that showed only 20% of executive teams and 10% of executive boards are female - and that’s despite 60% of those employed in the industry being women and 85% of all retail purchases being made or influenced by females. \nThe research suggested retail is often perceived as a “boys’ club”, that women lack confidence when applying for top jobs and that there is a lack of provision for flexible working. \nFiona Davis, director of Women In Retail, said: \nRetailers are missing an opportunity to maximise their talent pool. \nThey need to walk in the shoes of their customers and they’re not doing that without the right gender balance in their board rooms. \nEncouraging more women into top jobs is a subject we feel passionately about on the Journal, having looked into the board membership of our region’s own top performing companies and found that women make up just 15% of directors in our top 200 companies . \nHave a look at our dedicated women in business section . 8.56 Coreena Ford The Fastest 50 list is revealed...! \nToday we reveal the definitive list of the fastest growing companies in the region with the 2016 Ward Hadaway North East Fastest 50 for 2016. \nOrganised by leading law firm Ward Hadaway and backed by The Journal, the list highlights and celebrates the achievements of the profitable, privately-owned companies in the region who have grown their turnover by the largest amount in recent years. \nThis year’s Ward Hadaway North East Fastest 50 spans a wide range of sectors from manufacturers and retailers to construction companies and IT businesses. \nWant to see the list in full? Go here now .... The Journal and Ward Hadaway's 2015 Fastest 50 Business Awards held last year at the Baltic, Gateshead 8.50 Coreena Ford Is the North East Combined Authority now on the verge of collapse \nThe body supposed to unite the region’s seven local authorities now appears to be on the verge of collapse. \nThree members of the North East Combined Authority (NECA) - Newcastle, Northumberland and North Tyneside - held breakaway talks with the Government to sign an alternative devolution deal after plans for a wider regional package fell through. \nOn hearing the news, Coun Paul Watson, the chairman of NECA and leader of Sunderland council, said it “would not be right” to stand in their way if they wanted to go it alone. \nThe original devolution plan was abandoned after Gateshead, Sunderland, Durham and South Tyneside councils voted to delay implementation. It would have included the creation of a regional North East mayor. \nCoun Watson said: “The North East Combined Authority continues to support the principle of a devolution deal that would benefit the whole of the North East region. \n“Personally I believe we stand more chance of creating a stronger regional economy and increasing our health, wealth and prosperity by continuing to work together. \n“But if any of the member authorities decide they want to go it alone I don’t believe it would be right or proper to stand in their way.” \nRead the full story by Dan O’Donoghue here . Cllr Paul Watson during a North East Combined Authority meeting at Sunderland Civic Centre 8.45 Coreena Ford RBS agrees £845m deal with US regulator \nRoyal Bank of Scotland is to pay 1.1 billion US dollars (£845 million) to a US regulator to settle two claims over mis-sold mortgage bonds in the run-up to the financial crisis. \nThe taxpayer-backed lender reached the agreement with the National Credit Union Administration Board, which regulates credit unions in America. \nRBS sold the mortgage securities to the US Central Federal Credit Union and Western Corporate Federal Credit Union, but the bonds later proved toxic and failed after the US housing bubble burst in 2008. \nThe bank, which does not admit fault under the deal, said the settlement is “substantially” covered by the £3.8 billion already put aside to cover upcoming litigation. \nBut RBS still faces potentially mammoth settlements over mis-selling of mortgage securities turned sour in the US, with claims still outstanding with the Federal Housing Finance Agency and US Department of Justice (DoJ). \nRBS boss Ross McEwan said at a conference in London on Tuesday that the group was working to resolve outstanding claims this year and into 2017, but warned it could create “substantial additional conduct provisions and noise”. \nBanking experts believe the DoJ settlement could total around £9 billion. Its shares have been under pressure after the DoJ hit German rival Deutsche Bank with a 14 billion US dollar (£10.8 billion) penalty for mis-selling mortgage-backed securities. \nFears over the impact on Deutsche Bank have sent its shares tumbling close to 30-year lows. RBS, which is still 73% owned by the Government, reiterated in the latest settlement announcement that ongoing lawsuits might force it to put more cash aside. Ross McEwan Chief Executive Of RBS 8.40 Coreena Ford AA back in the black \nThe AA has driven back into profit after the breakdown service said it has reversed a decline in falling membership numbers. \nThe group said pre-tax profits came in at £48 million for the first half of the year, compared with a £69 million loss in the same period last year. \nAA said paid personal members grew in every month in the second quarter to 3.3 million, reversing a trend of falling numbers. \nRevenue rose 2.2% to £467 million and Chief executive Bob Mackenzie brushed aside any Brexit fears. \nHe said: \nWe are extremely encouraged by the reversal of the decline in paid personal members over the last few months. \nThe marketing strategy is achieving a significant impact on new business, and we are continuing to improve customer experience through digital innovation. \nOverall the performance of the business has been robust in the first half and we continue to trade in line with expectations. \nTo date we see no impact on our operations from any Brexit-related issues and, as we look forward, we believe we are creating significant momentum for the 2018 financial year. The AA has driven back into profit 8.35 Coreena Ford German giant takes over UK Mail in £242.7m deal \nDeutsche Post has wrapped up a £242.7m deal to acquire UK Mail for £242.7 million, a move that will see it go parcel-to-parcel with Royal Mail. \nThe German postal giant said that it is snapping up UK Mail as part of a European expansion drive. \nDeutsche Post board member Jurgen Gerdes said: \nThe ongoing expansion of our parcel network in Europe is driven by increasing demand within our e-commerce customer base for cross-border deliveries. UK Mail is a well-run business and an established provider of quality delivery services in the UK and offers a complementary fit with our integrated offering. \nUK Mail was dogged by technical problems at a new sorting centre last year which meant bulky parcels had to be handled manually, resulting in higher costs that ate into profits. \nThe tie-up will see UK Mail shareholders receive 440p a share in cash and the offer assumes that they will also be entitled to receive an interim dividend of 5.5 pence per UK Mail share. \nUK Mail directors are advising shareholders to vote in favour of the deal as they deem it “fair and reasonable”. UK Mail premises Sainsbury's sales falter in battle of the shopping baskets. . . \nFirst up this morning is a Sainsbury’s trading statement. \nThe supermarket chain has posted a second consecutive quarterly fall in sales as it remains under pressure amid the bitter supermarket war and food price deflation. \nBritain’s second biggest supermarket, which recently completed a £1.4 billion takeover of Argos, reported a 1.1% drop in like-for-like sales excluding fuel for the second quarter. \nBoss Mike Coupe said: “We continue to make progress against our strategy and, while like-for-like sales were down 1.1%, driven by food price deflation, we delivered like-for-like transaction growth across all channels and total volume growth.” \nSainsbury’s added that Argos notched up like-for-like sales growth of 2.3% during the period, with Mr Coupe saying the group will open 200 new digital collection points by the end of the year. \nThirty Argos digital outlets will be open in Sainsbury’s stores by Christmas. \nThe grocer is slugging it out with rivals in a brutal price war which has eroded margins at all of the so-called big four supermarkets. \nSainsbury’s pledged to “remain competitive”, adding that it has made further investments in the prices of everyday items such as broccoli, onions and its frozen deep pan Margherita pizza. \n“We expect the market to remain competitive and the effect of the devaluation of sterling remains unclear. \nHowever, Sainsbury’s is well positioned to navigate the changing marketplace and we are confident that our strategy will enable us to continue to outperform our major peers,” Mr Coupe said. Sainsbury's has pledged to remain competitive", "external_links": [], "published": "2016-09-28T07:00:00.000+03:00", "crawled": "2016-09-28T11:57:54.607+03:00", "highlightTitle": ""}