{"organizations": [], "uuid": "7fcc93b30bf8487a375d562e50e366f75d9b9898", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/29697398/15409858.jpg", "site_section": "http://www.thisisleicestershire.co.uk/specialolympics/rss.html?chid=181121", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/help-shape-bank-of-england-policy-at-leicester-roundtable/story-29697398-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "TomPegden published Help shape Bank of England policy on Brexit and other matters", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "TomPegden published Help shape Bank of England policy on Brexit and other matters", "spam_score": 0.0, "site_type": "news", "published": "2016-09-08T18:28:00.000+03:00", "replies_count": 0, "uuid": "7fcc93b30bf8487a375d562e50e366f75d9b9898"}, "author": "TomPegden", "url": "http://www.leicestermercury.co.uk/help-shape-bank-of-england-policy-at-leicester-roundtable/story-29697398-detail/story.html", "ord_in_thread": 0, "title": "TomPegden published Help shape Bank of England policy on Brexit and other matters", "locations": [], "entities": {"persons": [{"name": "tompegden", "sentiment": "negative"}, {"name": "shafik", "sentiment": "none"}, {"name": "dudley", "sentiment": "none"}, {"name": "mark carney", "sentiment": "none"}, {"name": "minouche shafik", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "nottingham", "sentiment": "none"}, {"name": "national space centre", "sentiment": "none"}, {"name": "birmingham town hall", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "derby", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "threadneedle street", "sentiment": "none"}], "organizations": [{"name": "bank of england", "sentiment": "negative"}, {"name": "european union", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "bank", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "leicester mercury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Help shape Bank of England policy on Brexit and other matters By TomPegden | Posted: September 08, 2016 0 COMMENTS SHARES Minouche Shafik, Deputy Governor for markets and banking VIEW GALLERY Help shape Bank of England policy on Brexit and other matters X \nCopy link to paste in your message / Minouche Shafik, Deputy Governor for markets and banking Bank of England Governor Mark Carney Venue: The National Space Centre Comments (0) \nLeicester Mercury readers are being invited to help shape the future policy of the Bank of England. \nAs Britain faces one of the most significant periods in its economic history with the vote to leave the EU, governors are leaving Threadneedle Street in the City of London and coming to the provinces. \nA series of roundtable events are taking place in Birmingham, Derby, Dudley, Leicester and Nottingham next month to way up public feelings about everything from interest rates to business confidence, imports, exports, helping small businesses with funding and even helping students to understand the Bank's role in Britain's finances. \nIt comes after Bank Governor Mark Carney went before MPs on Wednesday to explain why the Bank had been so negative about the consequences of Brexit prior to the EU vote – when the economy has yet to have suffered any major knocks. \nHe said he believed the Bank's post-referendum actions – including cutting interest rates to a historic low of 0.25 per cent – had helped reduce the impact of Brexit. \nAround 30 members of the public are being invited to join Minouche Shafik, Deputy Governor for markets and banking, at a round table discussion at the National Space Centre in Leicester on October 14. \nAnyone who would like to take part can fill in a ballot form online.Ms Shafik said: \"The work of the Bank of England really matters to households and companies in Leicester. \n\"Our decisions affect the prices of what you buy, the interest rate on your mortgages, and the health of the economy in which you work. \n\"That is why it's crucial that we get a chance to listen to you and hear your concerns to inform the decisions we make. \n\"I am looking forward to meeting with a cross-section of the community, and am sure it will be a lively and fascinating discussion. Please sign up!\" \nThe Bank's role ranges from issuing bank notes to setting interest rates, trying to meet inflation targets, regulating payment systems, buying and selling assets in times of financial crisis and even intervening to prop-up failing financial firms. \nAt all of the October sessions the governors will hear from business leaders, innovators, educators, students, civil society and the wider public. \nThe roundtables will be followed by a wider public session in Birmingham Town Hall. \nFeedback will be used to shape Bank policy. \nA Bank spokesman said: \"The decisions we take affect every household and every company. \n\"The responsibilities given to us by Parliament – to maintain monetary and financial stability – are more wide-ranging than ever before. \n\"They determine our role in supporting the necessary adjustments of the UK economy during the period of heightened uncertainty following the decision to leave the European Union. \n\"To be effective in this role, and in face of the many other changes to the economic landscape, we must be widely understood and trusted to do the right thing.\" \nThe session at the National Space Centre, runs from 10am to 12.30pm on October 14 and includes a buffet lunch. \nThe ballot can be entered by visiting:", "external_links": [], "published": "2016-09-08T18:28:00.000+03:00", "crawled": "2016-09-08T17:07:03.000+03:00", "highlightTitle": ""}