{"organizations": [], "uuid": "bb1c69dc66bfa105830c989f83d0515f539b4f65", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article11595517.ece/ALTERNATES/s1200/JS94026548-1.jpg", "site_section": "http://www.thejournal.co.uk/business/?service=rss", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-leaders-call-11842839", "country": "GB", "domain_rank": 21960, "title": "North East business leaders call for guarantees of foreign workers and students", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "North East business leaders call for guarantees of foreign workers and students", "spam_score": 0.0, "site_type": "news", "published": "2016-09-05T18:45:00.000+03:00", "replies_count": 0, "uuid": "bb1c69dc66bfa105830c989f83d0515f539b4f65"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-leaders-call-11842839", "ord_in_thread": 0, "title": "North East business leaders call for guarantees of foreign workers and students", "locations": [], "entities": {"persons": [{"name": "paul carbert", "sentiment": "none"}, {"name": "graeme whitfield", "sentiment": "none"}, {"name": "adam marshall", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "daniel", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "bcc", "sentiment": "none"}, {"name": "british chambers of commerce", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "chamber of commerce", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "north east england chamber of commerce", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "North East business leaders call for guarantees of foreign workers and students 11:45, 5 Sep 2016 11:45, 5 Sep 2016 By Graeme Whitfield Uncertainty caused by the Brexit vote is creating uncertainty in the region's economy, the Chamber of Commerce says Shares Get business news by email Daniel Leal-Olivas/PA Wire A European Union flag in front of Big Ben \nThe Government needs to reassure European workers and students living in the North East about their future, business leaders say. \nThousands of workers from the European Union have expressed concern about their status following the Brexit vote, and some have already resigned, the survey by the British Chambers of Commerce reveals. \nThe North East England Chamber of Commerce says Government assurances on residence rights are now vital given the importance of foreign workers to some sections of the economy, plus the numbers of foreign students contributing to the region. \nPaul Carbert, policy adviser at the chamber, said: “Our members have expressed concern over the future status of their existing EU workforce. The Government should reassure them as soon as possible that they will have the right to remain in the UK, to provide much-needed certainty both for EU employees and UK employers. \n“The North East is also home to thousands of students from the EU, who generate millions of pounds for our regional economy and support hundreds of jobs. It would be damaging if the Government was to make it more difficult for international students to come to the North East to study, or for our employers to retain skilled graduates in the region. \n“The Government should now look to develop an immigration policy that allows businesses in the North East to attract global talent and address the skills shortages present in our region, alongside continued investment in training for UK workers.” \nThe study of 800 firms revealed that one in 10 have been told by EU staff that they intend to leave the country as a result of the referendum vote. \nTwo fifths of companies said their EU staff were worried about their residency status and one in 20 had already lost workers. \nThe loss of skilled employees would hamper businesses when they are already suffering recruitment problems, said the BCC. \nActing director-general Adam Marshall said: “Since the referendum many firms have expressed concern over the future status of their existing EU workforce. These hardworking people are absolutely vital to the success of businesses, and must be retained because we cannot afford to lose talented and skilled workers. \n“Theresa May should reassure them as soon as possible that they will have the right to remain in the UK, to provide much-needed certainty both for EU employees and UK employers. \n“The Government must also clarify how new EU hires will be treated, as many businesses also say they are uncertain about whether the people they wish to recruit will be able to continue working with them in future. A sensible immigration policy that allows businesses to plug difficult skills gaps should go hand in hand with sustained investment in training UK workers for the jobs of the present and the future. \n“Guaranteeing the rights of EU workers is just one of the major issues that the new Government needs to make, and quickly.”", "external_links": [], "published": "2016-09-05T18:45:00.000+03:00", "crawled": "2016-09-05T13:59:34.250+03:00", "highlightTitle": ""}