{"organizations": [], "uuid": "255a1e2b8723ecba564473e34d3304b69b5ec9d1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/29727052/15535116.jpg", "site_section": "http://www.thisisleicestershire.co.uk/generalelection2010/rss.html?chid=182803", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/nurses-to-be-recruited-from-india-and-philippines-to-help-fill-300-jobs-at-leicester-s-hospitals/story-29727052-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "Merc_Reporter published Nurses from India and Philippines to fill 300 Leicester jobs...", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "Merc_Reporter published Nurses from India and Philippines to fill 300 Leicester jobs...", "spam_score": 0.0, "site_type": "news", "published": "2016-09-18T19:16:00.000+03:00", "replies_count": 0, "uuid": "255a1e2b8723ecba564473e34d3304b69b5ec9d1"}, "author": "Merc_Reporter", "url": "http://www.leicestermercury.co.uk/nurses-to-be-recruited-from-india-and-philippines-to-help-fill-300-jobs-at-leicester-s-hospitals/story-29727052-detail/story.html", "ord_in_thread": 0, "title": "Merc_Reporter published Nurses from India and Philippines to fill 300 Leicester jobs...", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Nurses from India and Philippines to fill 300 Leicester jobs after Brexit 'makes EU medics avoid UK' By Merc_Reporter | Posted: September 18, 2016 By Cathy Buss Nurses from the EU are returning home after the Brexit vote. File pic. Nurses from India and Philippines to fill 300 Leicester jobs after Brexit 'makes...   Comments (0) \nHealth bosses are looking to recruit nurses from India and the Philippines in a bid to fill more than 300 empty posts at Leicester's hospitals. \nThey are worried that Leicester is becoming a less attractive option for nurses from countries such as Italy, Spain and Portugal. \nThis follows the Brexit vote which will see Britain leaving the European union. \nIn the past three years around 500 from Europe have arrived in Leicester, but some have now decided to return home. \nJulie Smith, chief nurse at Leicester's hospitals, said: \"About 20 nurses have gone back following Brexit. \n\"Quite a number were about to move their families over there but now feel this is more risky none. \n\"Those from Spain particularly want to go back. People are worried about their ability to return to their home nations.\" \nA further group of 20 nurses are due to arrive from Italy next month (October) and while recruitment from Europe will continue managers are beginning to look further afield. \nMaria McAuley, assistant chief nurse at Leicester's hospitals, said: \"We are looking to India and the Philippines but this will not be a quick fix. It is going to be more difficult. \n\"All the nurses have to pass a new English language test and then undergo a clinical adaptation programme which will take two to three months. \n\"We have begun some Skype interviews but it will be April at the earliest before successful applicants will be with us and with the lead in time it will be at least six to seven months before we see an impact.\" \nA series of other initiatives are also underway to fill nursing vacancies. \nMs McAuley said: \"We regularly attend Royal College of Nursing recruitment fairs and there is a drive to encourage nurses to return to practice and quite a few are now coming in.\" \nKaren Chouhan, chairman of the Healthwatch Leicester, said the health watchdog is keeping a close watch on staff recruitment and retention. \nShe added: \"\"We appreciate the challenges being faced by the NHS in general and Leicester's hospitals in particular, and the potential effects on patient care. \n\"We are mindful of the excellent work being undertaken in our hospitals, but are concerned about the recruitment, utilisation and turnover of staff and the effect this could have on sustainability of services morale and patient care. \n\"It is important that we receive assurance that every effort to improve recruitment and maintain safe staffing remains a top priority.\"", "external_links": [], "published": "2016-09-18T19:16:00.000+03:00", "crawled": "2016-09-18T16:34:05.797+03:00", "highlightTitle": ""}