{"organizations": [], "uuid": "97d3bac4960a25c9159521a704bf1257f6f32788", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article11859801.ece/ALTERNATES/s1200/CFR_NJL_080916nixon_01JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/nixon-hire-beats-fall-uk-11859754", "country": "GB", "domain_rank": 21960, "title": "Nixon Hire beats fall in UK construction output to grow turnover 20%", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Nixon Hire beats fall in UK construction output to grow turnover 20%", "spam_score": 0.0, "site_type": "news", "published": "2016-09-08T20:07:00.000+03:00", "replies_count": 0, "uuid": "97d3bac4960a25c9159521a704bf1257f6f32788"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/nixon-hire-beats-fall-uk-11859754", "ord_in_thread": 0, "title": "Nixon Hire beats fall in UK construction output to grow turnover 20%", "locations": [], "entities": {"persons": [{"name": "nixon hire", "sentiment": "negative"}, {"name": "tyne", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "neil mcdiarmid", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "cumbria", "sentiment": "none"}, {"name": "north", "sentiment": "none"}, {"name": "city west business park", "sentiment": "none"}, {"name": "teesside", "sentiment": "none"}], "organizations": [{"name": "nixon hire", "sentiment": "negative"}, {"name": "newcastle", "sentiment": "negative"}, {"name": "john nixon ltd", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Nixon Hire beats fall in UK construction output to grow turnover 20% 13:07, 8 Sep 2016 The Newcastle company took action after outside factors knocked profits, and is now looking to expand after winning new business Shares Get business news by email Construction equipment hire firm Nixon Hire's headquarters at City West Business Park, Scotswood \nThe collapse of large contractors and a fall in UK construction output knocked profits at John Nixon Ltd last year, triggering an efficiency drive which led to a 20% boost in turnover. \nTrading as Nixon Hire, the Newcastle firm hires out construction plant and tools, portable units and toilets to construction and engineering firms mostly across the North and in Scotland. \nLatest accounts show pre-tax profits at the business dropped by 12% from £4.4m to £3.9m in 2015, a reduction the firm attributes to a range of factors including a fall in construction output between the May general election and late summer, which led to lower hire turnover. \nThe company, which has depots across Northumberland, Cumbria, Teesside and Tyne and Wear, also cited an increase in the level of bad debt, with some larger contractors going into administration with little warning. \nDirectors said haulage costs also had an impact, as they were significantly higher than anticipated, mainly due to the distribution of new equipment from suppliers. \nAs outside factors affected pre-tax profits in 2015, the business launched an efficiency drive and focussed on generating new business – a strategy which led to an increase in turnover, from £44m to £52.7m. \nA spend of £29m was made in new plant, the transplant fleet and the general infrastructure of the business, as well as investments in new staff, predominantly in sales and commercial, taking the workforce up by 14% to an average of 408 employees. \nThe vote to leave the EU came after the end of the firm’s financial year, and while the firm said Brexit makes the trading environment unclear, it is too early to assess any impact. \nIn a strategic report accompanying the accounts, director Neil McDiarmid said directors were pleased with the results and that further expansion will come at the firm in the coming years. \nHe said: “We are pleased with the current performance of the business and are optimistic for the next 12 months. \n“The company will continue to grow by increasing the size of the hire fleet operating from within the existing depot network. \n“Additional depots will be added over the next few years as the depot network expands southwards. \n“The investments and efficiencies made and planned wull also enable the business to continue to grow in terms of turnover, profit, geographical trading area and product offering.”", "external_links": [], "published": "2016-09-08T20:07:00.000+03:00", "crawled": "2016-09-08T15:44:17.517+03:00", "highlightTitle": ""}