{"organizations": [], "uuid": "278084053df4086b6ab8b6fb2a2fe72802daf446", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article11879314.ece/ALTERNATES/s1200/JS91653103.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/wildlife-newcastle-under-threat-hedgehogs-11879244", "country": "GB", "domain_rank": 21960, "title": "Wildlife in Newcastle under threat with hedgehogs and swifts in serious trouble, new report states", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Wildlife in Newcastle under threat with hedgehogs and swifts in serious trouble, new report states", "spam_score": 0.0, "site_type": "news", "published": "2016-09-14T15:30:00.000+03:00", "replies_count": 0, "uuid": "278084053df4086b6ab8b6fb2a2fe72802daf446"}, "author": "Tony Henderson", "url": "http://www.chroniclelive.co.uk/news/north-east-news/wildlife-newcastle-under-threat-hedgehogs-11879244", "ord_in_thread": 0, "title": "Wildlife in Newcastle under threat with hedgehogs and swifts in serious trouble, new report states", "locations": [], "entities": {"persons": [{"name": "david", "sentiment": "none"}, {"name": "david attenborough", "sentiment": "none"}, {"name": "mike pratt", "sentiment": "none"}, {"name": "jim cokill", "sentiment": "none"}, {"name": "mark eaton", "sentiment": "none"}, {"name": "liz charman", "sentiment": "none"}, {"name": "vivien kent", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "cumbria", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "durham wildlife trust", "sentiment": "none"}, {"name": "northumberland wildlife trust", "sentiment": "none"}, {"name": "rspb", "sentiment": "none"}, {"name": "royal society", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Wildlife in Newcastle under threat with hedgehogs and swifts in serious trouble, new report states 08:30, 14 Sep 2016 The 2016 State of Nature report shows that 56% of UK species studied have declined since 1970 Shares Get daily news by email A hedgehog \nNature experts in the North East have sounded the alert after a report revealed that over half of wildlife species in the UK have declined in the last 50 years. \nFollowing on from the groundbreaking State of Nature report in 2013, leading professionals from 53 wildlife organisations have pooled expertise and knowledge to present the latest and clearest picture to date of the status of native species. \nThe 2016 report shows that 56% of UK species studied have declined since 1970, while more than one in 10 (1,199 species) of the nearly 8,000 species assessed in Britain are under threat of disappearing. \nLiz Charman, RSPB conservation officer for the North East and Cumbria , said: “This report shows that while there have been some wonderful conservation successes in recent years, there is still a huge job to do if we want to save nature in the UK. \n“In Northumberland, we are particularly concerned about much of our upland and coastal wildlife. \n“Curlews and lapwings used to breed in abundance in the uplands of Northumberland and County Durham but they’ve suffered huge declines in the past few decades. Niall Carson/PA Wire A Lapwing, one of the world's most threatened birds \n“On the coast, little terns are falling victim to climate change as are other seabirds like kittiwakes. \n“Wildlife in urban areas such as Newcastle and Gateshead is also under threat with hedgehogs, swifts and great crested newts in serious trouble. \n“The RSPB and other nature conservation organisations are working hard to halt the declines of these species but we can’t do it alone and need the Government to take urgent and decisive action to protect our precious wildlife.” \nJim Cokill, director of Durham Wildlife Trust, said: “As a society we need to decide what our priorities are. Have the demands we make of the natural environment been too great? \n“If we push agriculture to produce cheaper food to feed a growing population, with greater demands for housing and resources nature will suffer as a result. This is a question we all need to address, not just the scientists and farmers.” \nMike Pratt, chief executive Northumberland Wildlife Trust, said: “The report certainly shows we are at a turning point in the management of natural systems and how we as society interact with it. \n“We have choices and with the Government looking at new ways forward for the UK in the wake of Brexit, we can collectively choose to put more power and resource into ensuring our impact on nature is positive going forward. A Stone-curlew \n“It is crucial to our wellbeing so it really is about choosing ‘life’ and putting nature first. We should strive to have the best protection and most innovative ways of conserving wildlife for the future across Europe and make the UK a centre of excellence in this regard; there is still a long way to go and it will need political commitment.” \nThe State of Nature 2016 UK report will be launched by Sir David Attenborough and UK conservation and research organisations at the Royal Society in London on Wednesday. \nSir David said: “The natural world is in serious trouble and it needs our help as never before. \n“The rallying call issued after the State of Nature report in 2013 has promoted exciting and innovative conservation projects. Landscapes are being restored, special places defended, struggling species being saved and brought back. But we need to build significantly on this progress if we are to provide a bright future for nature and for people. \n“The future of nature is under threat and we must work together - Governments, conservationists, businesses and individuals, to help it. Millions of people in the UK care very passionately about nature and the environment and I believe that we can work together to turn around the fortunes of wildlife.” \nUsing evidence from the last 50 years, experts have identified that significant and ongoing changes in agricultural practices are having the single biggest impact on nature. \nMark Eaton, lead author on the report, said: “Never before have we known this much about the state of UK nature and the threats it is facing. There is a real opportunity for the Government and devolved administrations to build on these efforts and deliver the significant investment and ambitious action needed to bring nature back from the brink. \n“This report wouldn’t have been possible without the army of dedicated volunteers who brave all conditions to survey the UK’s wildlife. “ \nDurham Wildlife Trust is appealing for volunteers to help track down one of the UK’s most elusive creatures. \nThe trust will be running its annual harvest mouse nest survey in November and December. \nA national survey in the 1970s reported only a handful of harvest mouse records in the North East but recent searches have shown that they may occur more widely than had been thought, although not in great numbers. \nPeople interested in being involved contact Vivien Kent or 0191 584 3112", "external_links": [], "published": "2016-09-14T15:30:00.000+03:00", "crawled": "2016-09-14T10:53:59.950+03:00", "highlightTitle": ""}