{"organizations": [], "uuid": "e094e290fcf3fd7c940aa6ff1177176ec7886140", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bostonstandard.co.uk", "main_image": "http://res.cloudinary.com/jpress/image/fetch/w_300,f_auto,ar_3:2,c_fill/http://www.bostonstandard.co.uk/webimage/1.7607581.1475253425!/image/image.jpg", "site_section": "http://www.bostonstandard.co.uk/rss/cmlink/1.5179319", "section_title": "Boston Standard Feed", "url": "http://www.bostonstandard.co.uk/whats-on/arts/tv-column-question-time-daily-politics-at-labour-party-conference-damned-1-7607582", "country": "GB", "title": "TV COLUMN: Question Time, Daily Politics at Labour Party Conference, Damned", "performance_score": 0, "site": "bostonstandard.co.uk", "participants_count": 0, "title_full": "TV COLUMN: Question Time, Daily Politics at Labour Party Conference, Damned", "spam_score": 0.0, "site_type": "news", "published": "2016-10-01T00:37:00.000+03:00", "replies_count": 0, "uuid": "e094e290fcf3fd7c940aa6ff1177176ec7886140"}, "author": "", "url": "http://www.bostonstandard.co.uk/whats-on/arts/tv-column-question-time-daily-politics-at-labour-party-conference-damned-1-7607582", "ord_in_thread": 0, "title": "TV COLUMN: Question Time, Daily Politics at Labour Party Conference, Damned", "locations": [], "entities": {"persons": [{"name": "james waller-davies", "sentiment": "none"}, {"name": "rod liddle", "sentiment": "none"}, {"name": "barry humphrey", "sentiment": "none"}, {"name": "les patterson", "sentiment": "none"}, {"name": "jo brand", "sentiment": "none"}, {"name": "isy suttie", "sentiment": "none"}, {"name": "alan davies", "sentiment": "none"}, {"name": "cornish", "sentiment": "none"}, {"name": "liddle", "sentiment": "none"}], "locations": [{"name": "birmingham", "sentiment": "none"}, {"name": "liverpool", "sentiment": "none"}, {"name": "boston", "sentiment": "none"}], "organizations": [{"name": "labour party conference", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "western front", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Have your say \nColumnist James Waller-Davies gives his view of some of the recent events on television. \nQuestion Time (BBC1) came once again to Boston, the media’s favourite ‘go-to town’ for wanting to get a splash on Brexit and EU migration. \nAnd sure enough, the opening question went straight for the migration jugular and the heated blood of opinions – informed, ill-informed and just plain strange – flowed freely. \nRod Liddle made a reasonable start, but sadly faded out of the programme as it went on. Always a touch of the rebel, it’s sometimes difficult to know quite where Liddle’s politics are. \nHis dress sense, however, is far easier to pin down. Liddle turned up looking rather dishevelled, with more than a touch of Les Patterson, Barry Humphrey’s slobbish cultural attaché alter ego, about him. \nAs a piece of television, this QT wasn’t the best. A bit tired and could easily have passed for a repeat of the first time the programme came to Boston. The arguments are practised, well-worn and entrenched – it’s the political equivalent of the Western Front in 1916. \nSocial media, however, was far more viperous and condescending. Following television programmes with Twitter to hand is part of modern viewing. Anyone tuning into Twitter during QT last night would have seen open season on Boston and its people. \nMany comments added up to what could only be described as a form of ‘cultural racism’ and it would be interesting to know if the people posting the tweets would be as smugly comfortable if the word ‘Boston’ was swapped for any other minority group of their choice. \nPolitics has become mainstream entertainment in recent years and The Daily Politics (BBC2) has been following the party conference season, this week with Labour in Liverpool. \nPolitical party conferences are a strange ensemble at the best of times. One wonders if they are far more interesting if you’re there in person, though I suspect not. \nThis year’s Labour conference was always going to be a spectacle for fairly obvious reasons and indeed it didn’t disappoint. Each camp merrily took pops at each other with all the subtlety of Cornish shin-kickers. \nFrom the side of the stage the leadership viewed the parade of speakers with the muted distain of a head teacher and governors at school speech day. The delegates, not being entirely sure how to act in a time of such ‘unity’, raucously cheered both sides of the arguments. \nNext week it’s the turn of Birmingham and the Conservative Party. Somewhere, stiletto blades are no doubt being sharped. \nFinally, a new, original and funny sit-com. Damned (Channel 4) was a refreshing addition to the stale mid-week offerings. \nThe cast is great – Jo Brand, Alan Davies, Isy Suttie – and the understated, reality-style production makes this one of the year’s best comedy contributions.. \nSet in the harrowing world of modern social work, Damned is infused with the darkness of society’s troubles, placing it firmly in the lineage of British bitter-sweet comedy. \nDamned isn’t the rarefied world of politics – it’s the real world, where the impact of politics takes place. But after this week, it’s sometimes hard to tell which is the politics and which is the comedy show. Sign in", "external_links": [], "published": "2016-10-01T00:37:00.000+03:00", "crawled": "2016-09-30T21:34:14.256+03:00", "highlightTitle": ""}