{"organizations": [], "uuid": "40af9e57a6c987636638078b73c653fe060d1407", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article11837656.ece/ALTERNATES/s1200/JS98284101.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/wouldnt-silly-mortgage-country-greedy-11837654", "country": "GB", "domain_rank": 21960, "title": "We wouldn't be so silly as as to mortgage our country to greedy multi-nationals, would we?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "We wouldn't be so silly as as to mortgage our country to greedy multi-nationals, would we?", "spam_score": 0.0, "site_type": "news", "published": "2016-09-03T20:30:00.000+03:00", "replies_count": 0, "uuid": "40af9e57a6c987636638078b73c653fe060d1407"}, "author": "Bernard Trafford", "url": "http://www.chroniclelive.co.uk/news/north-east-news/wouldnt-silly-mortgage-country-greedy-11837654", "ord_in_thread": 0, "title": "We wouldn't be so silly as as to mortgage our country to greedy multi-nationals, would we?", "locations": [], "entities": {"persons": [{"name": "bernard trafford", "sentiment": "negative"}, {"name": "jones", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "owen jones", "sentiment": "none"}, {"name": "george osborne", "sentiment": "none"}], "locations": [{"name": "ireland", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "royal grammar school", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}, {"name": "hmrc", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}, {"name": "apple corporation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Newcastle headteacher Bernard Trafford on how Ireland has fallen into a tax trap - and how the UK must not do the same Shares Get daily news by email Niall Carson/PA Wire A map of Ireland beside the Apple logo, as the tech giant vowed to overturn a record 13 billion euro (£11.1 billion) bill after European chiefs found it had a sweetheart tax deal in Ireland \nWhat a good job we’re about to “get our country back” – subject to our politicians working out how to do Brexit . Once out, we won’t have to put up with the kind of monstrous intrusion that Ireland’s suffering right now. \nBrussels has pronounced: Ireland’s cosy tax arrangement with the Apple Corporation , characterised as a sweetheart deal, has been declared illegal. \nThe Irish government’s unhappy. It denies there’s any deal and claims Apple has always paid the 12.5% corporation tax that any business must in Ireland. \nBrussels contests that Apple has paid nothing of the sort and that the firm’s so-called headquarters in Ireland is a sham, without premises or employees. European officials referred on Tuesday to aggressive tax avoidance: they’re moving to stamp it out. \nWe might sympathise with Ireland. Its economy, in meltdown after the credit crunch, is now recovering strongly. The presence (and employing power) of global businesses such as Apple keep the economy ticking over. Brussels, on the other hand, says that any special deal on tax amounts to a state subsidy: that’s anti-competitive, and against the rules of the free trade area. Is this just another example of the European Union overreaching itself and bossing its members around? Surely individual countries must decide how best to do business with multinationals? \nThe UK isn’t immune to temptation. Super-rich individuals and large corporations have, time and again, received favourable treatment from HMRC. There have been well-publicised reports of absurdly generous deals cut. A pragmatist might argue it’s better to get at least some money, rather than see the battles rolling on and on. But that’s a potentially dangerous line to take. \nIn the end, we risk robbing ourselves as a country while simultaneously encouraging the super-rich and the enormous to invest huge sums (lawyers’ and accountants’ fees) in constantly developing new ways of avoiding tax. That leaves all of us the poorer, apart from the fat cats. \nLeft-wing columnist Owen Jones and I don’t have much in common politically. But he was on the money, writing in Tuesday’s Guardian: we all lose out, he insisted, when we allow tax evasion, whether by lazily failing to chase illegal avoidance, or by allowing rules to be circumvented. \nWhen big tax bills are dodged, the country’s revenue is smaller: then we have to cut public services, slash council budgets and suffer austerity – because the big boys (I wonder why it’s the male gender?) get away with it. \nJones is right. At bottom, in a prosperous country where people and businesses are earning, the tax take is greater, allowing the state to provide better services. It is, of course, the argument against former Chancellor George Osborne’s austerity: it also counters those who, by contrast, would see government spend ever more on benefits and grand projects without stimulating a matching growth in earned, taxable, income. \nI should demand that ordinary people like me make a stand. I didn’t know Apple were behaving in a way I find reprehensible: I use an iPhone and a MacBook. But, if I’m honest, I’m not about to give up my Apple products. \nOther major corporations such as Amazon have also been roundly criticised for paying derisory sums in tax. Yet I still buy books and CDs (or their digital alternatives) through that website: it’s just so convenient. \nThe battle between Ireland, Apple and Brussels will rage for some time and arouse strong emotions. As Brexit gets under way, will our government feel the temptation to cut deals with multi-nationals, untrammelled by Europe’s bureaucratic requirements? \nFor my part, I’m in favour of Brussels trying to uphold fair tax laws across a trading area of 500m consumers. I’d rather finance that bureaucracy than be screwed by a corporation with more economic muscle than a whole nation. \nI just hope we don’t “get our country back”, only to mortgage it to greedy multi-nationals. We wouldn’t be that stupid. Would we? \nDr Bernard Trafford is Headmaster of Newcastle’s Royal Grammar School. The views expressed here are personal. \n@bernardtrafford", "external_links": [], "published": "2016-09-03T20:30:00.000+03:00", "crawled": "2016-09-03T15:47:25.204+03:00", "highlightTitle": ""}