{"organizations": [], "uuid": "13c2c1c3aa35490b58a1de6b57d5d661780533eb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article11875670.ece/ALTERNATES/s1200/JS60287380.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/sage-boss-calls-government-action-11875431", "country": "GB", "domain_rank": 21960, "title": "Sage boss calls for Government action to boost small businesses", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Sage boss calls for Government action to boost small businesses", "spam_score": 0.0, "site_type": "news", "published": "2016-09-12T21:03:00.000+03:00", "replies_count": 0, "uuid": "13c2c1c3aa35490b58a1de6b57d5d661780533eb"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/sage-boss-calls-government-action-11875431", "ord_in_thread": 0, "title": "Sage boss calls for Government action to boost small businesses", "locations": [], "entities": {"persons": [{"name": "graeme whitfield stephen kelly", "sentiment": "none"}, {"name": "sage", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "stephen kelly", "sentiment": "none"}, {"name": "kelly", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "silicon valley", "sentiment": "none"}, {"name": "bucharest romania", "sentiment": "none"}, {"name": "bucharest", "sentiment": "none"}, {"name": "romania", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "hollywood", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Sage boss calls for Government action to boost small businesses 14:03, 12 Sep 2016 14:03, 12 Sep 2016 By Graeme Whitfield Stephen Kelly says authorities should take inspiration from Bucharest to provide best environment for tech start-ups Shares Get business news by email Stephen Kelly, the new CEO of Sage \nThe head of North East technology giant Sage has called for Government action to boost small businesses - citing an unexpected location the UK should follow if it is to achieve success. \nStephen Kelly, Sage’s global CEO, has written a blog calling on politicians in both the UK and the US to do more to support entrepreneurs, whom he calls “the key to propelling global economies”. \nBut rather than looking to places like Silicon Valley, Mr Kelly advises them to copy the Romanian capital, Bucharest, citing its excellent broadband connectivity and emphasis on skills training. \nThose politicies mean Romania, despite being relatively deprived in comparison to other European countries, has nine of the top 15 cities in the world for fast broadband, giving the country an economic advantage over its competitors, Mr Kelly said. \nHe added: “At her small business roundtable , Theresa May confirmed that she would not renege on the promise to reform business rates from the last budget, and assured businesses that funding for small business and entrepreneurs lost as a result of a Brexit would be replaced by the UK government. The Arc of Triumph, Bucharest Romania \n“A promising start, but there’s more to do, particularly when it comes to encouraging technology start-ups that make up so many new businesses. \n“I’d urge US and UK policymakers and economists to look for examples overseas – no, not in Silicon Valley, but in Bucharest, Romania. \n“Romania is the second-fastest growing economy in Europe, and Bucharest has bloomed as a start-up scene over the past five years. Several key factors contribute to its success – not least of which its super high internet speeds. \n“Romania’s peak internet speeds are the highest in Europe and sixth highest worldwide, and last year Romanian cities made up an incredible nine of the top 15 best cities for fast internet on the planet. \n“The Romanian education system also strongly favours STEM subjects like maths and engineering, creating generations of brilliant developers. And in light of the revelation earlier this summer that the UK’s digital skills gap is costing our economy £63bn a year, this is clearly an area in which the UK could stand to learn a lot. \n“I’d like to see the UK Government take action in both of these pivotal areas.” \nMr Kelly has tried to position Sage as the ‘voice of small business’ since taking over the Newcastle company in 2014. \nThe company made waves earlier this year with its glitzy Sage Summit in Chicago that featured presentations from Hollywood stars and business moguls, plus a private concert from rock band The Killers.", "external_links": [], "published": "2016-09-12T21:03:00.000+03:00", "crawled": "2016-09-12T16:35:06.284+03:00", "highlightTitle": ""}