{"organizations": [], "uuid": "62df0aa3fb68d24403c6a3d6b0990466bde21b41", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article8995443.ece/ALTERNATES/s1200/JS60261225.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/business-breakfast-live-carrs-group-11827462", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Carr's Group in £36m deal to dispose of food division", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast LIVE: Carr's Group in £36m deal to dispose of food division", "spam_score": 0.0, "site_type": "news", "published": "2016-09-05T15:30:00.000+03:00", "replies_count": 0, "uuid": "62df0aa3fb68d24403c6a3d6b0990466bde21b41"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/business-breakfast-live-carrs-group-11827462", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Carr's Group in £36m deal to dispose of food division", "locations": [], "entities": {"persons": [{"name": "carr", "sentiment": "negative"}, {"name": "tim davies", "sentiment": "none"}, {"name": "nelson", "sentiment": "none"}, {"name": "richard howson", "sentiment": "none"}, {"name": "martin george", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "coreena ford carr", "sentiment": "none"}, {"name": "whitworths", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "john nelson", "sentiment": "none"}, {"name": "coreena ford", "sentiment": "none"}, {"name": "carillion", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "south east", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "whitworths", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "republic of ireland", "sentiment": "none"}], "organizations": [{"name": "centrica  carillion", "sentiment": "neutral"}, {"name": "agriculture and engineering", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "centrica", "sentiment": "none"}, {"name": "lloyd", "sentiment": "none"}, {"name": "group", "sentiment": "none"}, {"name": "london stock exchange", "sentiment": "none"}, {"name": "carr’s board", "sentiment": "none"}, {"name": "whitworths holdings limited", "sentiment": "none"}, {"name": "carr’s flour mills ltd", "sentiment": "none"}, {"name": "coreena ford carr", "sentiment": "none"}, {"name": "bbc radio", "sentiment": "none"}, {"name": "european economic area", "sentiment": "none"}, {"name": "carr’s flour mills", "sentiment": "none"}, {"name": "disposal of food division and return of capital", "sentiment": "none"}, {"name": "carillion", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "8.43 Coreena Ford Carillion in £90m deal with Centrica \nCarillion has announced to shareholders that it’s been selected by Centrica plc as its preferred partner to deliver facilities management and project services for an initial period of five years, which can be extended to seven years. \nThe contract has an estimated value to Carillion of some £90m over five years, starting in December 2016. \nCarillion has worked in close partnership with Centrica for over a decade as managing agent, helping to deliver significant value to Centrica’s British Gas business. \nThe new contract builds on this successful relationship with an extension of scope to a Total Facilities Management service. \nUnder the new contract Carillion will provide a wide range services, including asset surveys and planning, planned and reactive maintenance, cleaning, security and catering for Centrica’s 115 locations in the UK and Republic of Ireland, together with the delivery of certain construction projects for Centrica. \nCarillion’s chief executive, Richard Howson, said \nWe have worked closely with Centrica since 2005 and built a strong partnership. We are delighted to be extending this relationship, which is based on a one-team approach in which Carillion and Centrica work together to deliver award-winning standards of facilities management and customer service across all Centrica and British Gas sites. Carillion Could Lloyd's of London be forced to move...? \nThe chairman pf the insurance market certainly believes it’s possible. \nHe said the firm could be forced to move parts of its business to the EU unless single market access is secured in a post-Brexit Britain, \nChairman John Nelson has called for clarity on the issue as Prime Minister Theresa May continues to thrash out with ministers what Brexit will mean in practical terms. \nSpeaking to the BBC Radio 4 Today programme, Mr Nelson said: \nLondon, the UK, is the global hub for specialist insurance and reinsurance. It’s one of the very few industries where the UK is right at the forefront. “Access to the single market is important - it’s about 11% of our business. \nThere will be bits of the business, if we don’t get access to the single market, where it might be better for us and more efficient for us where we write it in the EU. \nBanks and financial firms wanting to trade with a country in the European Economic Area (EEA) must apply for a passport. Once authorisation has been granted, businesses then have licence to sell their products to any other country within the EEA. Companies benefit because they do not have to apply for authorisation in each separate country once their initial passport has been approved. \nWithout having access to a passport, UK-based financial firms would face a barrier when attempting to trade with countries within the European single market. \nMr Nelson added: \nAccess to the single market and passporting rights is obviously critical, not just for Lloyd’s but to the London insurance market and to large parts of the financial services industry. \nHe said if access could not be assured, or if there was a prolonged period of uncertainty, Lloyd’s would have to consider “contingency plans”, warning that the “loser won’t be Lloyd’s, it will be London”. 8.36 Coreena Ford FTSE opening - and how the deal affects Carr's share price \nThe FTSE-100 index opened at 6894.60. \nAnd a quick look at Carr’s share price in early trading shows a healthy rise of 8.5% to 157.34, as investors digest news of the flour mills business. 8.35 Coreena Ford Carr's chief executive on food sale \nTim Davies, Chief Executive of Carr’s. said: \nThe sale of Carr’s Flour Mills Ltd represents an exciting stage in Carr’s strategic development. At a time of increasing competition and volatility in the flour market, consolidation is essential and inevitable. \nThis acquisition by Whitworths presents a great opportunity for the Food division to continue building on the strong foundations laid over many years. On behalf of the Carr’s Board, I would like to thank everyone who has contributed to the division’s success. \nWe will continue to focus on our strategy of delivering growth in our UK agriculture business, the development of our international feed supplement businesses and building our specialist engineering division in niche markets across the globe. \nCarr’s continues to benefit from both operational and geographic diversity and a strong balance sheet and we look forward to an exciting future focussed on delivering growth in our higher margin products and services within the Agriculture and Engineering divisions. Tim Davies 8.30 Coreena Ford Carr's sells off food division in multi-million pound deal \nFirst up this morning is a deal by Carr’s, the agriculture, food and engineering group. \nThe Carlisle-headquartered firm has disposed of Carr’s Flour Mills Ltd, its food division, to milling business Whitworths Holdings Limited for a gross consideration of £36.0m and net consideration of £24.9m after adjustments for working capital and net debt. \nThe firm said the disposal is to: \nSupport our ambition to achieve growth and development in line with the group’s strategic goal of being an international company at the forefront of innovation and technology across both of its remaining businesses of agriculture and engineering. \nThe disposal will returning £16.0m to shareholders in the form of a Special Dividend of 17.54 pence per share, and the remaining £8.9m will provide balance sheet strength and the opportunity to expand the Group’s continuing businesses, both by acquisition and organic growth. \nThe firm said its ongoing focus is on high value markets within agriculture and engineering. \nDisposal of Food Division and Return of Capital - RNS - London Stock Exchange \nMartin George, chairman of Whitworths Holdings Limited, said he welcomes the employees joining the firm from Carr’s Flour Mills. \nHe said: \nCarr’s Flour Mills Ltd shares a similar history to Whitworths in that it is a long standing business which has received material investment in recent years. \nThe business is a great fit geographically and will give us access to the South East, North of England and Scottish markets that would otherwise not be available and means we have national reach.", "external_links": [], "published": "2016-09-05T15:30:00.000+03:00", "crawled": "2016-09-05T10:59:21.354+03:00", "highlightTitle": ""}