{"organizations": [], "uuid": "6a96298dcefe51d4d5bae7f0b3e95a32fba878a9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article11927891.ece/ALTERNATES/s1200/JS39138120.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/special-features/northern-law-firm-ward-hadaway-11927843", "country": "GB", "domain_rank": 21960, "title": "Northern law firm Ward Hadaway celebrates continuing success in the Legal 500", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Northern law firm Ward Hadaway celebrates continuing success in the Legal 500", "spam_score": 0.0, "site_type": "news", "published": "2016-09-26T07:01:00.000+03:00", "replies_count": 0, "uuid": "6a96298dcefe51d4d5bae7f0b3e95a32fba878a9"}, "author": "Vicky Robson", "url": "http://www.chroniclelive.co.uk/special-features/northern-law-firm-ward-hadaway-11927843", "ord_in_thread": 0, "title": "Northern law firm Ward Hadaway celebrates continuing success in the Legal 500", "locations": [], "entities": {"persons": [{"name": "ward hadaway", "sentiment": "positive"}, {"name": "martin", "sentiment": "none"}, {"name": "lesley fairclough", "sentiment": "none"}, {"name": "jamie martin", "sentiment": "none"}, {"name": "alex shiel", "sentiment": "none"}, {"name": "martin hulls", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "leeds", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}], "organizations": [{"name": "dynamo", "sentiment": "none"}, {"name": "professional practice group", "sentiment": "none"}, {"name": "deloitte", "sentiment": "none"}, {"name": "geneva group international", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Northern law firm Ward Hadaway celebrates continuing success in the Legal 500 00:01, 26 Sep 2016 Latest edition cites company's enduring commitment to the region and focus on its heartland with impressive growth throughout the North Share Get daily news by email Jamie Martin, managing partner at Ward Hadaway \nThe continuing success of Top 100 UK law firm Ward Hadaway is firmly rooted in the North. \nThe firm’s proud status as a Northern law firm for national business is reflected in its continued growth, its impressive showing in the latest edition of Legal 500 and in its enduring commitment to the region, its companies, organisations and people. \nWard Hadaway was established in Newcastle in 1988 and the firm’s North East roots have enabled it to grow its operations across the whole of the North of England, with offices in Leeds and Manchester, while keeping its focus on its heartland. \nJamie Martin, managing partner at Ward Hadaway, said: “We have always been proud to be based in the North East and to serving our expanding client base across the region. \n“The North East is of crucial importance to us as we look to further grow our business and help more and more clients meet the many challenges which they face. \n“In a very real sense, our success is built on their achievements – without their drive, vision and determination, we would not be in the position we are in today as a leading legal presence in the North of England and further afield. \n“This is something we keep at the forefront of our minds when developing our practice and planning for the years ahead.” \nWard Hadaway has enjoyed significant success over the past year on a number of fronts. \nThe firm saw annual turnover rise by more than 7% to a record £35.8m in the year to the end of April 2016, outperforming the average growth achieved by the Top 100 UK law firms according to Deloitte’s Professional Practice Group. \nIn the North East, the firm saw particularly marked growth in its corporate, commercial and property departments, with a 41.5% jump in corporate fee income a stand-out performer. \nAcross the firm as a whole, all five of Ward Hadaway’s departments – litigation, private client, corporate, commercial and property – grew their fee income during the course of the year. \nWard Hadaway has also continued to garner awards for the quality of its work in the legal sector. \nEarlier this month Ward Hadaway head of corporate, Martin Hulls, was named Corporate Lawyer of the Year at the North East Dealmakers Awards with judges praising Martin for his work with a wide range of clients, from large to small, and noting his specialist expertise in private equity transactions. \nIn June, the firm was named Corporate and Commercial Team of the Year in the Northern Law Awards 2016 in recognition of the pioneering work carried out by the firm’s specialist public sector commercial team on a wide range of transactions involving the public and private sectors. \nThe same team secured Ward Hadaway the national 2016 PFI Law Firm of the Year award. \nWard Hadaway’s head of intellectual property Alex Shiel was named Partner of the Year at the Dynamites Awards, organised by North East IT and technology support organisation Dynamo, in October in recognition of more than 20 years’ work supporting IT and technology companies in the region. \nThe firm’s top-rated commercial litigation team was named by independent legal guide Legal 500 as the UK Regional Law Firm of the Year 2015 for dispute resolution, Ward Hadaway’s education team has been shortlisted in the Legal Advisors to Education Institutions category of the national Education Investor Awards 2016 and head of development Lesley Fairclough has been shortlisted for the Woman Lawyer of the Year Award in the national Law Society Excellence Awards 2016. \nJamie Martin said: “While these awards and nominations are naturally gratifying to the individuals and teams involved and the firm as a whole what is most pleasing \nis that they are independent validations of the quality of work which we do for our clients. \n“We see ourselves as very much part of the clients’ team and we pride ourselves in enjoying long-running relationships with many clients across the region, as well as relishing the opportunity to work with new people. \n“We also believe in being pro-active and helping clients to face challenges wherever they arise – something of particular importance given the current economic and political climate.” \nThe aftermath of the Brexit vote in June has given rise to an uncertain situation, but Ward Hadaway has been aiming to help inform clients’ thinking on the situation. \nThe firm has kept keeping clients comprehensively and regularly updated with a guide to the practicalities and potential effects of Brexit. \nMore recently, it has been giving an insight into global attitudes to the situation. The firm invited fellow members of Geneva Group International (GGI), its international network and one of the world’s largest alliance of independent professional services firms, to write about their reaction to Brexit and its potential effects on business in the UK and across the world. \nThe resulting series of articles – which can be seen at http://www.wardhadaway.com/knowledge/brexit-view-abroad/ - provide a spectrum of views on what companies might expect from major trading partners around the world. \nJamie Martin said: “These initiatives exemplify what we aim to do as a firm – to use our size, scale and expertise to help our clients to fulfill their goals, whether those are commercial, organisational or personal. This is the essence of high quality legal support and it is what we strive to deliver every working day.”", "external_links": [], "published": "2016-09-26T07:01:00.000+03:00", "crawled": "2016-09-26T10:14:04.637+03:00", "highlightTitle": ""}