{"organizations": [], "uuid": "43d9007f02680c927b465196da7467d4c62183b5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article11954788.ece/ALTERNATES/s1200/IAG-and-Qatar-Airways-partnership.jpg", "site_section": "http://www.thejournal.co.uk/business/?service=rss", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-welcomes-heathrow-airport-11954700", "country": "GB", "domain_rank": 21960, "title": "North East welcomes Heathrow Airport plans to increase domestic flights", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "North East welcomes Heathrow Airport plans to increase domestic flights", "spam_score": 0.0, "site_type": "news", "published": "2016-09-29T18:08:00.000+03:00", "replies_count": 0, "uuid": "43d9007f02680c927b465196da7467d4c62183b5"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-welcomes-heathrow-airport-11954700", "ord_in_thread": 0, "title": "North East welcomes Heathrow Airport plans to increase domestic flights", "locations": [], "entities": {"persons": [{"name": "roberta blackman-woods", "sentiment": "none"}, {"name": "anne-marie trevelyan", "sentiment": "none"}, {"name": "graeme mason", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "john holland-kaye", "sentiment": "none"}, {"name": "james ramsbotham", "sentiment": "none"}], "locations": [{"name": "heathrow", "sentiment": "none"}, {"name": "heathrow airport", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "dubai", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "newcastle airport", "sentiment": "none"}, {"name": "heathrow airport  north east", "sentiment": "none"}, {"name": "amsterdam", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north east england", "sentiment": "none"}, {"name": "newcastle international airport", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}, {"name": "newquay", "sentiment": "none"}, {"name": "london heathrow", "sentiment": "none"}], "organizations": [{"name": "airports commission", "sentiment": "none"}, {"name": "chamber of commerce", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "north east labour group roberta blackman-woods", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk plc", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "north east labour group", "sentiment": "none"}, {"name": "north east england chamber of commerce", "sentiment": "none"}, {"name": "newcastle airports", "sentiment": "none"}, {"name": "newcastle international airport", "sentiment": "none"}, {"name": "ryanair", "sentiment": "none"}, {"name": "british airways", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "North East welcomes Heathrow Airport plans to increase domestic flights 11:08, 29 Sep 2016 Heathrow has unveiled plans to grow its domestic route network, which could deliver a huge boost to the region Share Get business news by email Steve Parsons/PA Wire A British Airways aircraft at Heathrow Airport \nNorth East business leaders and politicians have welcomed proposals by Heathrow Airport to boost its domestic route network, potentially delivering huge rewards for the region. \nHeathrow has unveiled plans to grow domestic route network from 2021 if selected for expansion – four years before a new runway would open – creating up to 21 new daily domestic services. \nThe North East stands to reap the rewards of the plans which will boost connections to Newcastle International Airport and ultimately drive forward growth within the region’s economy. \nThe proposals to pump up connectivity have been widely welcomed, by Newcastle International Airport , the North East England Chamber of Commerce, Durham MP and incoming Head of the North East Labour Group Roberta Blackman-Woods and Berwick-upon-Tweed MP Anne-Marie Trevelyan. \nIf Heathrow expansion is approved by Government, the airport will work alongside ministers and consult with the community to refine current expansion plans and increase existing capacity by up to an additional 25,000 flights a year from 2021. \nThe proposals include looking to create up to 21 additional daily domestic services whilst the new runway is under construction, boosting connections to Newcastle International Airport and enabling more onward connections to destinations across the globe. \nThe airport said the package represents a huge win for the North East, supporting small and large exporters, boosting competition and reducing prices to consumers. \nIf granted consent, the additional 25,000 flights are expected to generate up to £1.5 billion in additional economic growth in the first five years after Brexit, on top of the up to £211 billion projected by the Airports Commission. \nIf the greenlight is given to an expanded Heathrow, the full package of measures the airport proposes to support regional growth would also include continuing the new £10 discount for all flights to UK destinations from Heathrow until at least 2037 as long as there is a justification and it is deemed to be in the public interest. \nGraeme Mason, planning and corporate affairs director at Newcastle International Airport, said: “Newcastle Airport is the international gateway for the North East. It provides access to the world via key hubs, including Dubai, Amsterdam and Paris, but London Heathrow is the largest. \n“Our BA Heathrow route serves over half a million passengers and gets North East customers not just to London but to cities on every continent. \n“Expansion at Heathrow will help safeguard a quality, high frequency link from Newcastle Airport and an even greater number of onward connections to choose from.” Read More Sangria at the ready as Ryanair announces new flights from Newcastle Airport \nJames Ramsbotham, chief executive of the North East England Chamber of Commerce said Heathrow provides a vital link for businesses in the North East, connecting exporters to overseas markets, attracting inward investment and delivering foreign tourists. \nHe said: “For the more than 500,000 passengers that travel between Heathrow and Newcastle Airports annually, the opportunity to strengthen this vital route is too important to pass up. \n“In the post EU Referendum climate it is more important than ever to ensure Britain is open for business and that the impressive exporting performance of North East England is enabled so that it delivers to its full potential on behalf of UK PLC. \n“The benefits of a third runway at Heathrow are clear, they were clear when the Airports Commission made its unanimous recommendation and they have only become clearer. It is now up to the Government to get on with this decision on behalf of businesses in the North East and across the entire United Kingdom.” \nRoberta Blackman-Woods, Durham MP and incoming Chair of the North East Labour Group said: “The proposals from Heathrow that will help to boost the vital air-link from Newcastle Airport that connects the North East to the world are to be very much welcomed. \n“Connectivity with Heathrow is vital for economic growth and expanding tourism in the North East and is necessary to help our businesses compete globally. The government must acknowledge the link between stronger regional growth and expanding Heathrow and approve the third runway as soon as possible.” Read More Airline Jet2 set for expansion at Newcastle after taking delivery of new planes \nAnne-Marie Trevelyan, Berwick-upon-Tweed MP added: “Businesses in the North East have long benefitted from the direct connection between Heathrow and Newcastle Airport. I want to see expansion at Heathrow, and all the UK’s airports, to provide the connections our regions need to thrive.” \nHeathrow CEO John Holland-Kaye said the “Brexit Boost Plan” marks the hub’s commitment to making the UK stronger and fairer for everyone – faster. \nHe said: “Our proposals for an additional 25,000 flights a year from 2021 would help businesses and families from Newcastle to Newquay benefit earlier from Heathrow expansion, while protecting our commitment to meet and exceed the Airports Commission’s environmental conditions.”", "external_links": [], "published": "2016-09-29T18:08:00.000+03:00", "crawled": "2016-09-29T13:29:13.387+03:00", "highlightTitle": ""}