{"organizations": [], "uuid": "4c5bfbea1cd050023392d2a9de88ddda24e6b9c8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article11161095.ece/ALTERNATES/s1200/JS84713466.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/business-breakfast-live-jd-sports-11904786", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Warning against apprenticeship levy; plus latest news", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast LIVE: Warning against apprenticeship levy; plus latest news", "spam_score": 0.0, "site_type": "news", "published": "2016-09-20T15:00:00.000+03:00", "replies_count": 0, "uuid": "4c5bfbea1cd050023392d2a9de88ddda24e6b9c8"}, "author": "Kathryn Riddell", "url": "http://www.chroniclelive.co.uk/business/business-news/business-breakfast-live-jd-sports-11904786", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Warning against apprenticeship levy; plus latest news", "locations": [], "entities": {"persons": [{"name": "kathryn riddell newcastle", "sentiment": "negative"}, {"name": "alison watson", "sentiment": "none"}, {"name": "nick forbes", "sentiment": "none"}, {"name": "kathryn riddell", "sentiment": "none"}, {"name": "david horne", "sentiment": "none"}, {"name": "mike ashley-owned", "sentiment": "none"}, {"name": "newburn", "sentiment": "none"}, {"name": "screwfix", "sentiment": "none"}, {"name": "david harrison", "sentiment": "none"}, {"name": "joe giddens/pa wire mike ashley", "sentiment": "none"}, {"name": "veronique laury", "sentiment": "none"}, {"name": "mike ashley", "sentiment": "none"}], "locations": [{"name": "mumbai", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "virgin money", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "india", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "east coast", "sentiment": "none"}, {"name": "tyneside", "sentiment": "none"}, {"name": "shirebrook", "sentiment": "none"}, {"name": "derbyshire", "sentiment": "none"}, {"name": "gosforth", "sentiment": "none"}], "organizations": [{"name": "uk national champion", "sentiment": "negative"}, {"name": "virgin trains east coast", "sentiment": "none"}, {"name": "sports direct", "sentiment": "none"}, {"name": "rpc", "sentiment": "none"}, {"name": "b&q", "sentiment": "none"}, {"name": "british chambers of commerce", "sentiment": "none"}, {"name": "construction industry training board", "sentiment": "none"}, {"name": "screwfix", "sentiment": "none"}, {"name": "citb", "sentiment": "none"}, {"name": "newcastle  virgin trains", "sentiment": "none"}, {"name": "virgin trains", "sentiment": "none"}, {"name": "kingfisher", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "north east england chamber of commerce", "sentiment": "none"}, {"name": "castorama", "sentiment": "none"}, {"name": "true potential llp", "sentiment": "none"}, {"name": "newcastle council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Kathryn Riddell Newcastle firm named UK National Champion in European competiton \nA Newcastle-based “fintech” company has been chosen as a National Champion for the UK in Europe’s largest business competition. \nNewburn financial services firm True Potential LLP has been recognised in the latest European Business Awards, winning praise for its innovative methods, ethics and all-round success. David Harrison of True Potential \nThe continent-wide awards celebrate excellence and best practice in the business community across Europe, with more than 33,000 businesses from 34 countries entering for the 2016/17 awards. \nTrue Potential – which employs more than 300 people spread between its Tyneside headquarters, a London office and premises in Northern Ireland – works with around 20% of the UK’s financial advisors to provide technology, products and information to almost 2m private clients. 08:40 Kathryn Riddell Sports Direct taking action after criticism \nThe company has faced sharp criticism over corporate governance and working practices at its warehouse in Shirebrook, Derbyshire, after it was revealed that some warehouse staff were paid below the national minimum wage. \nSports Direct has moved to address concerns by offering casual retail staff guaranteed hours instead of zero hours contracts and ensuring all warehouse staff are paid above the national minimum wage following an initial review by RPC. Joe Giddens/PA Wire Sports Direct founder Mike Ashley outside the Sports Direct headquarters in Shirebrook, Derbyshire \nIn addition, the company said that the selection process for having a workers’ representative on the retailer’s board will be via “democratic staff elections, in which it is anticipated that all staff directly engaged or employed by Sports Direct may vote”. 08:33 Kathryn Riddell Shareholders ask Sports Direct to hold independent review \nSports Direct is to undertake an independent review of working practices and corporate governance, following concerns raised by shareholders. \nThe so-called “360 degree” review was initially to be led by the retailer’s law firm RPC. However, the Mike Ashley-owned firm said on Tuesday that following discussions with shareholders, including the influential Investor Forum, the review “will now be led by an independent party other than RPC”. Joe Giddens/PA Wire Mike Ashley \n“The board has made this decision after listening to shareholder feedback at the recent AGM/Open Day and during subsequent consultation with a number of the company’s long-standing shareholders via the Investor Forum,” Sports Direct said. 08:25 Kathryn Riddell Virgin Trains creates 85 jobs in Newcastle \nVirgin Trains has opened a new customer call centre in Newcastle, which will create up to 85 new jobs in the city. \nThe company’s decision to bring back jobs to Newcastle is designed to improve customer service by bringing roles in-house and having inquiries handled by employees who work and travel along its east coast route. \nThe move - which sees Virgin Trains taking space at Virgin Money’s headquarters in Gosforth - reverses a move by former line operators East Coast, which in 2011 closed a call centre in Newcastle and switched the jobs to Plymouth, on the south coast, and to Mumbai, in India. www.crestphotography.co.uk Opening of Virgin Trains customer centre: Newcastle Council leader Nick Forbes, Virgin Trains' customer experience director Alison Watson and David Horne, managing director of Virgin Trains East Coast \nThe new centre, whose opening yesterday was attended by business and civic leaders, will handle a range of customer inquiries, including bookings, special assistance, repayments for delays and customer feedback. 08:15 Kathryn Riddell First-half profit rise for B&Q owner \nB&Q owner Kingfisher has reported a rise in first-half profits following a “productive” six months, adding that there has been no clear evidence of a Brexit-induced slowdown in demand. \nPre-tax profits at the group, which also owns Screwfix, rose 10.6% to £427 million during the period. \nLike-for-like sales grew 3.3% across the company, driven by another strong performance by Screwfix, where comparable sales rocketed 14.7%. B&Q’s like-for-like sales rose 4.6%. A B&Q store \nGroup sales grew 2.7% to £5.75 billion on a constant currency basis. \nChief executive Veronique Laury said: “It has been a productive first half. We have delivered a good ‘business as usual’ result with both sales and profit growth. \n“In the UK, the EU referendum has created uncertainty for the economic outlook, even though there has been no clear evidence of an impact on demand so far on our businesses. In France we remain cautious on the short-term outlook.” \nIn France, where it trades as Castorama, Kingfisher has been hit by industrial action and wet weather and the firm said it remains cautious on the country’s short-term outlook. 08:07 Kathryn Riddell Concern over apprenticeship levy \nGovernment moves to boost the number of young people taking apprenticeships could end up having the opposite affect, the region’s largest business organisation has warned. \nA survey of businesses by the North East England Chamber of Commerce and its parent organisation, the British Chambers of Commerce, has shown there is little awareness of the new Apprenticeship Levy, which compels businesses with a wage bill of more than £3m to pay 0.5% of its payroll costs towards training. Construction Industry Training Board (CITB) \nCompanies are able to claim money back from that payment to be spent on apprenticeship training, but there has been widespread concern in the business community that the scheme has not been properly thought through and is an added cost for firms at a time of economic uncertainty. \nThe scheme is due to come into effect next April, but the Chamber’s survey reveals that almost a third of firms either haven’t heard of it or do not understand how it will work, and most believed the new levy felt more like a tax. 08:00 Kathryn Riddell Grab a coffee and a chair \nGood morning and welcome to the Journal Business team’s morning live blog for Monday, September 19. \nI’m Kathryn Riddell and I’m in the live blog chair this week to bring you regular updates on all the breaking business news from across the North East and beyond. \nThe business breakfast live blog covers the latest big stories from the region’s business community, as well as national news, FTSE updates and stock exchange announcements from the Journal region’s listed companies and national firms - anything and everything from the world of business basically.", "external_links": [], "published": "2016-09-20T15:00:00.000+03:00", "crawled": "2016-09-20T10:51:48.194+03:00", "highlightTitle": ""}