{"organizations": [], "uuid": "718f5c6a0c8a962a941e403bf825a88807cbbab1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/29755649/15580744.jpg", "site_section": "http://www.thisisleicestershire.co.uk/specialolympics/rss.html?chid=181121", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/it-s-still-the-same-old-nasty-tory-party-jon-ashworth-speech-to-the-labour-conference/story-29755649-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "danjmartin published \"It's still the same old nasty Tory Party' Jon Ashworth's...", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "danjmartin published \"It's still the same old nasty Tory Party' Jon Ashworth's...", "spam_score": 0.0, "site_type": "news", "published": "2016-09-27T23:24:00.000+03:00", "replies_count": 0, "uuid": "718f5c6a0c8a962a941e403bf825a88807cbbab1"}, "author": "danjmartin", "url": "http://www.leicestermercury.co.uk/it-s-still-the-same-old-nasty-tory-party-jon-ashworth-speech-to-the-labour-conference/story-29755649-detail/story.html", "ord_in_thread": 0, "title": "danjmartin published \"It's still the same old nasty Tory Party' Jon Ashworth's...", "locations": [], "entities": {"persons": [{"name": "jon ashworth", "sentiment": "negative"}, {"name": "hucknall", "sentiment": "none"}, {"name": "jeremy", "sentiment": "none"}, {"name": "george osborne chancellor", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "jeremy hunt", "sentiment": "none"}, {"name": "iain duncan smith", "sentiment": "none"}, {"name": "liam fox", "sentiment": "none"}, {"name": "david cameron", "sentiment": "none"}, {"name": "davis", "sentiment": "none"}, {"name": "hunt", "sentiment": "none"}, {"name": "david davis", "sentiment": "none"}, {"name": "dave prentice", "sentiment": "none"}, {"name": "fox", "sentiment": "none"}, {"name": "boris", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "southampton", "sentiment": "none"}, {"name": "samworths", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "liverpool", "sentiment": "none"}], "organizations": [{"name": "tory party", "sentiment": "negative"}, {"name": "labour", "sentiment": "negative"}, {"name": "tory", "sentiment": "none"}, {"name": "cabinet", "sentiment": "none"}, {"name": "leicester south", "sentiment": "none"}, {"name": "climate change department", "sentiment": "none"}, {"name": "national health service", "sentiment": "none"}, {"name": "jsa", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "\"It's still the same old nasty Tory Party' Jon Ashworth's speech to the Labour conference By danjmartin | Posted: September 27, 2016 0 COMMENTS SHARES \"It's still the same old nasty Tory Party' Jon Ashworth's speech to the... X \nCopy link to paste in your message / \nLeicester South MP and shadow cabinet member without portfolio has addressed Labour delegates in Liverpool. \nHere is his speech. \n\"Last year Jeremy asked I work with you on our campaigns against this Tory government. \n\"Back then David Cameron was Prime Minister; George Osborne Chancellor; Iain Duncan Smith - you remember him? Pensions Secretary. They wanted to cut benefits for disabled people and slash tax credits for millions of families. \n\"We said no, we fought back, we defeated them. \n\"Doesn't that show you what we achieve when fully effective in parliament - united, working together, focused on the Tories and in touch with our constituents. \n\"Now we have a new Prime Minister and a new Cabinet who tell us they are the friends of ordinary working class people. This is what they like to tell us. \n\"Fine words, but it's by their deeds they shall be known. \n\"This Prime Minister and Cabinet have an economic policy to slash public services, cut support for those on lower and middle incomes to fund tax cuts for the very rich. \n\"This Prime Minister has appointed David Davis - a man who branded the social chapter 'job destroying'; \n\"This Prime Minister has brought back Dr Liam Fox a man who called the minimum wage a 'mistake'. \n\"A Prime Minister who appoints Dr Fox and Mr Davis is no friend of ordinary working class people. \n\"Not all the ministers changed of course. \n\"Jeremy Hunt is still there – a man who hasn't met a junior doctor he won't pick a fight with – a Prime Minister who keeps Mr Hunt in place is no friend of our National Health Service. \n\"By the way Dr Fox, David Davis and you Boris – don't think we have forgotten. \n\"You promised us £350 million a year (sic) for our NHS either get on and deliver it or at least have the grace to admit you lied to the British people. \n\"This Prime Minister talks of compassionate conservatism. Have you heard that one? \n\"But it's not compassionate; or fair; or on the side of the many to divide children at 11, branding thousands of them failures. \n\"Parents want the very best for every child, not the return of the 11 plus. \n\"So we will not yield, we will not equivocate, we will fight these new Tory grammar school plans every step of the way. \n\"Whatever the rhetoric, the reality of the Tories in government is clear. \n\"Slower growth, more cuts, no plan for Brexit, an NHS in crisis; Climate Change Department scrapped; rising poverty; the return of the 11 plus; fixing constituency boundaries; attacks on trade unions. \n\"Well they can change the person at the top, appoint a new Cabinet but it is completely clear to us it's still the same old nasty Tory Party and we'll take them on at every turn. \n\"Instead we speak for those who have no voice, remember those too often forgotten and must offer an approach grounded in the realities in which people live their lives. \n\"We challenge the fundamental unfairness of an economy that excludes too many from collective wealth. \n\"We seek a society built around human needs and human wants where through investment in housing, in infrastructure, and education we tackle those savage inequalities that scar our society. \n\"We don't meekly accept that 900,000 of our fellow citizens in work should have to rely on zero hours contracts. \n\"And we don't tolerate an economy where men and women who do work full time and yet still on the way home have to stop at the food bank to pick up an emergency parcel to feed their family. \n\"So this week we reaffirm a very simple principle that this movement has long stood for – when men and women work for a living, they should be paid a genuine living wage. \n\"When confronted with abuses like we've seen at Sports Direct - and I pay tribute to Unite or at Samworths in Leicester where I have been working with the bakers' union, we don't shrug our shoulders like the Tories do. \n\"We don't abdicate responsibility. We say there is a fairer way. We'll ensure every working man and woman the dignity, respect, and the rights they deserve. \n\"And because housing deprivation drives so much of the inequality we see. Here's an idea. When we spend £9 billion under the Tories lining the pockets of private landlords. \n\"It doesn't work. Iisn't it time – as we have committed – to start building council houses again and provide decent homes for all? \n\"And our crusade for social justice doesn't stop at our borders, we deliberately – quite consciously - align ourselves with the poorest of the world and their struggles. \n\"We have a warning for Theresa May. We have seen who you have appointed to DfID. Well will not acquiesce in any attempts to cut development spending and betray some of the very poorest people in the world. \n\"And that also means speaking out firmly against large scale tax avoidance. When governments tolerate tax avoidance it is ordinary people, public services and the world's poor who pay the price. \n\"So rather than closing Sure Start centres, it's time to start closing tax loopholes \n\"Instead of cracking down on our public services let's start cracking down on tax havens and deliver tax justice once and for all. \n\"We are in the Labour Party because we dream of a better world and know a better world is possible. And as one of my favourite poets said \"In dreams begins responsibilities.\" \n\"So when this Conference ends, our responsibility is to scatter across the land speak to people, listen to people and ensure this Party is elected for the people. \n\"And our responsibility is also to unite and that means remembering our opponents don't wear red Labour rosettes – \n\"Our opponents wear blue, green, yellow and purple rosettes. \n\"And it's them we need to focus on. \n\"As Dave Prentice said yesterday Every great progressive reform ever put on the statute books was because of this Labour Party winning elections. \n\"That's why this last year I've travelled 5000 miles campaigning with you on the doorstep, listening to people in your meetings. I've listened to people in communities across Britain. They don't just want sympathy for their plight, they want us in government to change their lives. \n\"Like the man in Southampton who fears he will lose his family home where his children grew up because of the Tory pay to stay 'tenant tax'. \n\"I've met students shackled by huge debts. \n\"The pensioners in Hucknall struggling to pay the electric and who worry for their grandchildren who can't find decent secure jobs. \n\"Or the man in my own Leicester constituency who has serios health problems. He was disallowed ESA was sanctioned on JSA and forced to sleep rough in the local park. \n\"In their name and thousands like them, let's pledge ourselves to united effort, to rebuilding, to winning, to seek that brighter and better day. \n\"In their name keep the faith with our Labour values. \n\"Leave the sneers and slurs to our opponents. \n\"So yes in dreams begin responsibilities. \n\"Optimism always defeats despair. \n\"And for the country and the people we want to serve. \n\"I will never give up, we will never give up. \n\"Labour never gives up.\"", "external_links": [], "published": "2016-09-27T23:24:00.000+03:00", "crawled": "2016-09-27T18:52:08.933+03:00", "highlightTitle": ""}