{"organizations": [], "uuid": "cb626e1ca9b89f83f8b0d44469c8a30d729f6557", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article11914114.ece/ALTERNATES/s1200/JS100187012.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/tim-farrons-plea-labour-moderates-11914095", "country": "GB", "domain_rank": 21960, "title": "Tim Farron's plea to Labour moderates - join Lib Dems as only it can stop the Tories", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Tim Farron's plea to Labour moderates - join Lib Dems as only it can stop the Tories", "spam_score": 0.0, "site_type": "news", "published": "2016-09-21T01:00:00.000+03:00", "replies_count": 0, "uuid": "cb626e1ca9b89f83f8b0d44469c8a30d729f6557"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/tim-farrons-plea-labour-moderates-11914095", "ord_in_thread": 0, "title": "Tim Farron's plea to Labour moderates - join Lib Dems as only it can stop the Tories", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tim Farron's plea to Labour moderates - join Lib Dems as only it can stop the Tories 18:00, 20 Sep 2016 By Jonathan Walker Lib Dem leader vows to raise taxes to save the NHS and talks of another EU referendum over Brexit terms in passionate conference speech Share Get daily news by email Gareth Fuller/PA Wire Liberal Democrat Leader Tim Farron delivers his keynote speech on the final day of the Liberal Democrats Autumn Conference in Brighton \nLiberal Democrat leader Tim Farron issued an audacious invitation to Labour Party members and supporters to join his party as only it was capable of preventing a Tory landslide at the next election. \nThe appeal to frustrated Labour members was the culmination of his speech at the Lib Dem conference in Brighton - delivered while Labour’s National Executive Committee, including party leader Jeremy Corbyn , were locked in talks in London about reforms designed to end their brutal civil war. \nMr Farron said: “The only movement with the desire and the potential to stop the calamity of Brexit and the tragedy of a generation of Conservative majority rule, is this movement, is the Liberal Democrats.” \nThe speech included a promise to raise taxes if required to give the NHS the funding it needs, and to axe SATs in primary schools in a bid to create an education system focused on “developing young people for later life” instead of “getting them through the wrong kinds of tests”. Gareth Fuller/PA Wire Liberal Democrat Leader Tim Farron delivers his keynote speech on the final day of the Liberal Democrats Autumn Conference in Brighton \nMr Farron highlighted his commitment to another referendum on European Union membership, and suggested June’s Brexit vote was prompted partly by “anger” at Westminster-based politicians and media, as well as massive divides between “those who win and those who lose” in British society. \nIn a fierce attack on Brexit campaigners, he said: “I’m angry at the calculating forces of darkness who care nothing for the working people of this country, nothing for our NHS, nothing for those who struggle to get by, and who exploited that anger to win an exit from Europe that will hurt the poorest the hardest.” \nMr Farron also insisted his party wanted to get back into power - despite being “crushed” at the last general election, which followed five years of Conservative and Liberal Democrat coalition government. \nThe party was reduced to just eight MPs in the May 2015 poll, after winning 57 seats in 2010. Gareth Fuller/PA Wire Liberal Democrat Leader Tim Farron is congratulated after he delivered his keynote speech on the final day of the Liberal Democrats Autumn Conference in Brighton \nBut Mr Farron insisted he wanted to be back in Government, telling activists: “Our destiny is to once again become one of the great parties of government, to be the place where liberals and progressives of all kinds gather to provide the strong opposition that our country needs.” \nIn the meantime, he said he was willing to work “across party lines” with politicians from other parties. \nMr Farron said: “The Government needs an Opposition, and that means progressives should be prepared to put our differences aside in order to hold them to account.” \nHere are some key passages from his speech: * Why Labour supporters should join the Liberal Democrats. \n“The only movement with the desire and the potential to stop the calamity of Brexit and the tragedy of a generation of Conservative majority rule, is this movement, is the Liberal Democrats.” Gareth Fuller/PA Wire Liberal Democrat Leader Tim Farron delivers his keynote speech on the final day of the Liberal Democrats Autumn Conference in Brighton * Raising taxes if needed to save the NHS \n“If the only way to fund a health service that meets the needs of everyone, is to raise taxes, Liberal Democrats will raise taxes.” * Reforming education - but not with grammar schools \n“...I want to end the current system of SATS in primary schools that are a distraction from the real education that professional teachers want to give their children; that weigh heavy on children as young as six and add nothing to the breadth of their learning. . . \n“And what are we doing, in 2016, threatening to relegate 80% of our children to education’s second division by returning to the 11-plus? . . . \n“We need better schools for all our children, not just those who can pass an exam at the age of 11. We can’t just leave children behind.” * Another EU referendum \n“When Theresa May does agree a deal with the EU, we want the people to decide. \n“Not a re-run of the referendum, not a second referendum, but a referendum on the terms of the as-yet-unknown Brexit deal. \n“And if the Tories say, ‘we’ve had enough referendums’, I say ‘you started it!’ \n“We had a democratic vote in June. We can’t start this process with democracy and end it with a stitch up. \n“If we trusted the people to vote for our departure then we must trust the people to vote for our destination.” * Liberal Democrats can return to power \n“A century ago, the Liberals lost touch with their purpose and their voters, and Labour took their chance and became Britain’s largest progressive party. \n“Today I want us utterly ready and determined to take our chance as the tectonic plates shift again.", "external_links": [], "published": "2016-09-21T01:00:00.000+03:00", "crawled": "2016-09-20T20:28:32.590+03:00", "highlightTitle": ""}