{"organizations": [], "uuid": "06ef5d3a461abcb86575e046d1042134661aa055", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article11881861.ece/ALTERNATES/s1200/JS96355993.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/government-urged-act-europe-after-11963000", "country": "GB", "domain_rank": 21960, "title": "Government urged to act on Europe after investment warning from Nissan", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Government urged to act on Europe after investment warning from Nissan", "spam_score": 0.0, "site_type": "news", "published": "2016-09-30T23:15:00.000+03:00", "replies_count": 0, "uuid": "06ef5d3a461abcb86575e046d1042134661aa055"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/government-urged-act-europe-after-11963000", "ord_in_thread": 0, "title": "Government urged to act on Europe after investment warning from Nissan", "locations": [], "entities": {"persons": [{"name": "graeme whitfield", "sentiment": "none"}, {"name": "ghosn", "sentiment": "none"}, {"name": "ross smith", "sentiment": "none"}, {"name": "carlos ghosn", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "qashqai", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "north east england", "sentiment": "none"}], "organizations": [{"name": "nissan government", "sentiment": "negative"}, {"name": "nissan", "sentiment": "negative"}, {"name": "european union", "sentiment": "none"}, {"name": "paris motor show", "sentiment": "none"}, {"name": "north east england chamber of commerce", "sentiment": "none"}, {"name": "renault", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Government urged to act on Europe after investment warning from Nissan 16:15, 30 Sep 2016 16:19, 30 Sep 2016 By Graeme Whitfield Warning that Nissan will stall on future investment at Sunderland has sent shockwaves through the North East economy Share Get business news by email Owen Humphreys/PA Wire Workers at Nissan's plant in Sunderland \nThe Government has been urged to private clarity on the UK’s future outside Europe after Nissan’s chief executive raised doubt about future investment at its Sunderland plant. \nBusiness chiefs in the region urged the company to continue investing in the region after it said delays in Brexit negotiations could have a negative impact. \nBut they have also called on Ministers to be “as clear as possible as soon as possible” to protect investment in the local economy. \nNissan chief executive Carlos Ghosn spoke out to ask for guarantees from the Government, including compensation in case tax barriers are raised as a result of the UK leaving the European Union. Read More Nissan wants guarantee of Brexit compensation before investing in Sunderland plant, says boss \nHis company’s record-breaking plant in Sunderland, which has been active since 1986, employs almost 7,000 people who produce the Juke, Qashqai and Leaf models, while it is responsible for a further 20,000 jobs in the supply chain. \nTalking at the Paris Motor Show, Mr Ghosn, who also runs France’s Renault, said “important investment decisions will not be made in the dark”. \nHe said: “If I need to make an investment in the next few months and I can’t wait until the end of Brexit, then I have to make a deal with the UK Government. \n“You can have commitments of compensation in case you have something negative. If there are tax barriers being established on cars, you have to have a commitment for carmakers who export to Europe that there is some kind of compensation.” Read More 30 years of Nissan: How the Sunderland plant transformed the North East \nBut he was pressed to continue investing by the North East England Chamber of Commerce, which also called for the Government to provide clarity as soon as possible. \nThe Chamber’s director of policy Ross Smith, of the North East England Chamber of Commerce, said: “There are a great number of reasons for Nissan to continue to invest in the Sunderland plant, including the local management team, the workforce and excellent supply chain in North East England. \n“However, anyone making a long-term investment decision will want certainty over trading conditions and the tax framework. \n“For the good of the North East economy, we need the Government to be as clear as possible as soon as possible.” \nIn the June 23 referendum, the people of Sunderland voted to leave the European Union, with 61% backing the Out campaign. More on the EU Referendum", "external_links": [], "published": "2016-09-30T23:15:00.000+03:00", "crawled": "2016-09-30T18:47:40.773+03:00", "highlightTitle": ""}