{"organizations": [], "uuid": "91fa1ed7ab39881d05db4baa7da12cc445140d34", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article10911302.ece/ALTERNATES/s1200/JS82657050.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/northumberland-mps-criticise-government-over-11831986", "country": "GB", "domain_rank": 21960, "title": "Northumberland MPs criticise the Government over delayed flood defence review", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Northumberland MPs criticise the Government over delayed flood defence review", "spam_score": 0.0, "site_type": "news", "published": "2016-09-02T20:30:00.000+03:00", "replies_count": 0, "uuid": "91fa1ed7ab39881d05db4baa7da12cc445140d34"}, "author": "Michael Muncaster", "url": "http://www.chroniclelive.co.uk/news/north-east-news/northumberland-mps-criticise-government-over-11831986", "ord_in_thread": 0, "title": "Northumberland MPs criticise the Government over delayed flood defence review", "locations": [], "entities": {"persons": [{"name": "david cameron", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "ian lavery", "sentiment": "none"}, {"name": "ronnie campbell", "sentiment": "none"}], "locations": [{"name": "northumberland", "sentiment": "none"}, {"name": "killingworth", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "blyth", "sentiment": "none"}, {"name": "corbridge", "sentiment": "none"}, {"name": "greatham south", "sentiment": "none"}, {"name": "teesside", "sentiment": "none"}], "organizations": [{"name": "food and rural affairs", "sentiment": "none"}, {"name": "hartlepool", "sentiment": "none"}, {"name": "blyth", "sentiment": "none"}, {"name": "northumbria regional flood and coastal committee", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Northumberland MPs criticise the Government over delayed flood defence review 13:30, 2 Sep 2016 The report was expected in July and politicians are concerned there will not be enough time to act on recommendations before the winter Shares Get daily news by email The aftermath of Storm Desmond in Corbridge after the River Tyne burst its banks \nTwo Northumberland MPs have criticised the Government over delays in publishing a crucial report on improving flood defences. \nThe national flood resilience review was announced in January after Storm Desmond caused devastation across the country. \nParts of the North East were battered by the storms and in Corbridge, Northumberland , more than 50 homes flooded after the river Tyne burst its banks. \nThe review was launched to assess how the country could be better protected from future flooding but the report, which was due in July, has not yet been published. \nWansbeck MP Ian Lavery said: “The winter floods were a huge source of distress to families up and down the country, including many in the Wansbeck constituency. \n“It is incredibly disappointing that the Government have let down all those who were affected by the flooding, and who continue to be at risk of flooding by delaying the release of the review. \n“The Government should reinstate the scrapped flood envoys to affected counties and release the national flood resilience review at the earliest possible opportunity.” The aftermath of Storm Desmond in Corbridge after the River Tyne burst its banks \nBlyth MP Ronnie Campbell is also seeking assurances from Prime Minister Theresa May over the progress of the report. \nHe said: “It is really important to the people who need flood defences, who had their lives were destroyed in a matter of months. \n“It looks like the bad weather is going to happen annually so the report is vital to counteract future flooding.” \nPoliticians across the country expressed concerns that delays in publishing the report \ncould mean there will not be enough time to implement the recommendations before winter. \nIt is understood that the delays are due to political changes after the Brexit vote and the departure of David Cameron. Read More Multi-million pound flood repairs project starts in Northumberland town \nThe Department for Environment, Food and Rural Affairs said the report would be published this summer - which could mean up to the end of September. \nIn July, the Northumbria Regional Flood and Coastal Committee revealed more than £24m will be spent to protect hundreds of homes at Blyth , Killingworth, Hartlepool and Greatham South, in Teesside. \nThe committee said when all the work is complete it will have reduced the risk to 1,458 properties, while also making improvements to the environment.", "external_links": [], "published": "2016-09-02T20:30:00.000+03:00", "crawled": "2016-09-02T15:49:06.124+03:00", "highlightTitle": ""}