{"organizations": [], "uuid": "03c9c22b870c53938910809204a6a37944ff688a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article11838181.ece/ALTERNATES/s1200/JS98265963.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/apple-tax-story-shows-cool-11838172", "country": "GB", "domain_rank": 21960, "title": "Apple tax story shows the cool company has a darker side", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Apple tax story shows the cool company has a darker side", "spam_score": 0.0, "site_type": "news", "published": "2016-09-03T21:40:00.000+03:00", "replies_count": 0, "uuid": "03c9c22b870c53938910809204a6a37944ff688a"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/apple-tax-story-shows-cool-11838172", "ord_in_thread": 0, "title": "Apple tax story shows the cool company has a darker side", "locations": [], "entities": {"persons": [{"name": "steve jobs", "sentiment": "none"}, {"name": "cook", "sentiment": "none"}, {"name": "tim cook", "sentiment": "none"}], "locations": [{"name": "california", "sentiment": "none"}, {"name": "san francisco", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "brexit britain", "sentiment": "none"}], "organizations": [{"name": "apple", "sentiment": "negative"}, {"name": "european union", "sentiment": "none"}, {"name": "apple store", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "european commission", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Apple tax story shows the cool company has a darker side 14:40, 3 Sep 2016 Threats made by the super rich tech giant's boss might see some of its idealistic customers go elsewhere Shares Comments Get daily news by email The Apple logo is displayed on the exterior of an Apple Store on April 23, 2013 in San Francisco, California \nI’ve never owned an Apple product - not an iPad, iPod, iMac, not even an Apple Watch. \nThis to some makes me an uncool, low tech Neanderthal who lives in a subterranean analogue world, oblivious to the technicolour, technological revolution spearheaded by the visionary Steve Jobs who co-founded the company. \nApple is like a religion to those who buy its products who display a devotion usually reserved for the followers of boybands. \nJobs during his life was a Yoda-like figure to techies. While owning his products is a statement of style, working for his company making clever stuff was the pinnacle for some. It is where everybody rides around on Segways daydreaming and then turning these dreams into a reality of faster, sleeker, smarter and ever more desirable devices which made the little world of their customers an even better place. Apple CEO Tim Cook speaks during an Apple special event \nTake a peek inside an Apple store and you see these customers huddling round the products like they are some religious artefact. If the world was run like Apple it would be a shinier place. \nOr maybe not. Scratch the surface and the story is rather different - of a ruthless, profit-hungry multi-national corporation which can get its boots dirty with the best of them. \nThe European Commission has hit the company with an £11bn fine after it claimed Apple had a deal with Ireland which meant the technology giant paid as little as 0.005% tax on its European profits for more than a decade. The current rate of corporation tax in Ireland is 12.5%. \nAccording to the European Commission, these tax arrangements enabled Apple to pay a rate of as little as £50 in taxes on every £1m in European profits in 2014. \nThis was bad enough but then you had the reaction of Tim Cook, Apple’s chief executive, to it. After denying any sort of ‘sweetheart’ deal, he talked darkly about the decision having a “profound and harmful effect” on investment and jobs in the European Union. \nI’ve read it employs around 500,000 workers in the EU so that is quite a threat. \nWhile Cook and Apple have sympathy in certain right wing circles - come to Brexit Britain they are saying - not so elsewhere. \nTax avoidance and evasion amongst the super rich is a major political issue these days. That’s basically because if companies paid their tax at the rate ordinary people like you and me do, the world would not be in the mess it is. \nAnd if Cook carries on bellyaching and threatening the livelihoods of his company’s staff whose education and health have been paid for from taxes, I suspect Apple might lose its place as the coolest brand in town and some of its more idealistic customers might shuffle off to one of its competitors.", "external_links": [], "published": "2016-09-03T21:40:00.000+03:00", "crawled": "2016-09-03T17:10:24.924+03:00", "highlightTitle": ""}