{"organizations": [], "uuid": "58c4017dd28dcc08e21043ed50f2409071ce3968", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article11877525.ece/ALTERNATES/s1200/JS98821117.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/thanks-no-thanks-how-devolution-11877467", "country": "GB", "domain_rank": 21960, "title": "'Thanks, but no thanks': How devolution for the North East was ended in 155 words", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "'Thanks, but no thanks': How devolution for the North East was ended in 155 words", "spam_score": 0.0, "site_type": "news", "published": "2016-09-13T01:30:00.000+03:00", "replies_count": 0, "uuid": "58c4017dd28dcc08e21043ed50f2409071ce3968"}, "author": "Dan O'Donoghue", "url": "http://www.chroniclelive.co.uk/news/north-east-news/thanks-no-thanks-how-devolution-11877467", "ord_in_thread": 0, "title": "'Thanks, but no thanks': How devolution for the North East was ended in 155 words", "locations": [], "entities": {"persons": [{"name": "chroniclelive", "sentiment": "none"}, {"name": "cllr martin gannon", "sentiment": "none"}, {"name": "paul watson", "sentiment": "none"}, {"name": "sajid javid", "sentiment": "none"}, {"name": "cllr paul watson", "sentiment": "none"}, {"name": "javid", "sentiment": "none"}, {"name": "george osborne", "sentiment": "none"}, {"name": "coun watson", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "north tyneside", "sentiment": "none"}, {"name": "sunderland civic centre  the north east", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "south tyneside", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "sunderland civic centre", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}], "organizations": [{"name": "employment and skills", "sentiment": "none"}, {"name": "newcastle college’s rail academy", "sentiment": "none"}, {"name": "state", "sentiment": "none"}, {"name": "northern powerhouse", "sentiment": "none"}, {"name": "gateshead council", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "leadership board", "sentiment": "none"}, {"name": "north east combined authority", "sentiment": "none"}, {"name": "whitehall", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "'Thanks, but no thanks': How devolution for the North East was ended in 155 words 18:30, 12 Sep 2016 A letter seen exclusively by ChronicleLive from the North East to Whitehall explains why the region rejected devolution Shares Get daily news by email Cllr Paul Watson during a North East Combined Authority meeting at Sunderland Civic Centre \n‘Thanks, but no thanks’ - so went the 155 word devolution letter from the North East to Whitehall. \nThe letter sent to the Secretary of State for Communities and Local Government, Sajid Javid, on Thursday - after regional leaders failed to agree on the multi-billion pound deal - consigned devolution to the dustbin. \nSeen exclusively by us, the letter from Paul Watson, the North East Combined Authority chairman, to Mr Javid states that the region supported the devolution of extra powers and funding “in principle”. \nLeaders of three councils voted in favour of putting the package out to a public consultation – the next step in making it a reality – but the proposal was defeated when the four leaders of Gateshead, Sunderland , Durham and South Tyneside councils voted not to go ahead unless they received more reassurances from the Government over funding after the Brexit vote. \nAnd explaining the decision to the Secretary of State, Coun Watson wrote: “I am writing to let you know that the Leadership Board decided not to progress with the publication and consultation of the Governance Review and Scheme at this stage. \n“I want to reiterate that each of the seven councils which make up the North East Combined Authority unambiguously support the principle of devolution for the North East. North East Combined Authority meeting at Sunderland Civic Centre \n“We are keen to progress with the next stage in devolving powers and functions to the region, however at this point in time, it has not been possible to reach a majority decision to proceed with the deal and launch the consultation. \n“We are keen to continue to work with you to achieve our ambition of a stronger regional economy with improved opportunities for residents and businesses.” \nThe response from Government was one of disappointment as Mr Javid announced “the deal is off the table”. \nMr Javid said: “Local leaders in the North East Combined Authority have made a clear decision not to proceed with this ambitious and far-reaching devolution deal for their region – while I am disappointed, it is a decision I respect and so that deal is now off the table. \n“It is with regret that we have therefore withdrawn the legislation that would have brought this deal to life, which means local people will miss out on over £1bn of investment, and new powers on transport, planning, and skills. \n“Handing power back to Northerners is a key part of our plans to build a Northern Powerhouse and our focus now will be on working to secure a new agreement for residents in those areas committed to progressing with devolution.” Cllr Martin Gannon during a North East Combined Authority meeting at Sunderland Civic Centre \nThe North East deal included an infrastructure fund of £30m per year for 30 years, making £900m in total, powers over bus franchising powers, strategic planning powers, joint responsibility for an Employment and Skills board and devolved skills funding for adults aged over 19. \nThe North East Combined Authority, led by the seven council leaders and chaired by the regional mayor, was due to run the infrastructure fund while the mayor would exercise other powers, such as control of bus services, in their own right. \nGeorge Osborne, the former Chancellor, signed an interim deal with council leaders at Newcastle College’s Rail Academy in Gateshead in October 2015 – but progress was then delayed by a series of rows. \nGateshead Council pulled out in March, while South Tyneside and Durham councils also expressed doubts, saying more talks with Government were needed. \nSome councillors objected to the idea of a regional mayor, but Ministers argue a significant package of funding and powers can only be devolved if there is an individual clearly responsible for them. \nAfter the deal was scrapped, it emerged that Newcastle, Northumberland and North Tyneside - which all supported the devolution plan - could mount their own bid. Read More North East mayor and £900 million devolution deal is scrapped \nOn Monday, Coun Watson said: “Council leaders in the North East remain committed to the principle of devolution. \n“At this moment in time however, we have been unable to reach a position where all seven councils agree on the terms under which the Government was asking us to move forward. \n“These terms are important because they would form the basis of North East devolution and would have an impact on what we, as a region, could expect in terms of future funding from the Government. \n“There is nothing contradictory about being in support of devolution in principle while also wanting to ensure that we move forward in a manner that all seven councils feel is right for our region. \n“As we stated quite clearly in correspondence with the Communities Secretary, we remained keen to find a way to move ahead with the devolution process, and to continue to discussions with the Government to try to reach an agreement which all seven councils could support. \n“Unfortunately, however, the Government has announced its decision to end these current discussions.” More on the North's devolution deal", "external_links": [], "published": "2016-09-13T01:30:00.000+03:00", "crawled": "2016-09-12T20:46:37.160+03:00", "highlightTitle": ""}