{"organizations": [], "uuid": "8e3ca8641d5e0a4a81a86e0d5723d2d42098fe26", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article11942606.ece/ALTERNATES/s1200/JS100729865.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/business-breakfast-live-top-200-11937791", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Top 200 launch, plus Thomas Cook feels terror attack pressure", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast LIVE: Top 200 launch, plus Thomas Cook feels terror attack pressure", "spam_score": 0.0, "site_type": "news", "published": "2016-09-27T15:20:00.000+03:00", "replies_count": 0, "uuid": "8e3ca8641d5e0a4a81a86e0d5723d2d42098fe26"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/business-breakfast-live-top-200-11937791", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Top 200 launch, plus Thomas Cook feels terror attack pressure", "locations": [], "entities": {"persons": [{"name": "coreena ford thomas cook", "sentiment": "negative"}, {"name": "thomas cook", "sentiment": "negative"}, {"name": "liam fox", "sentiment": "none"}, {"name": "gazette top", "sentiment": "none"}, {"name": "peter fankhauser", "sentiment": "none"}, {"name": "owen", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "cuba", "sentiment": "none"}, {"name": "canary islands", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "balearic", "sentiment": "none"}, {"name": "belgium", "sentiment": "none"}, {"name": "north east top", "sentiment": "none"}, {"name": "continental europe", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "turkey", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "bulgaria", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "journal", "sentiment": "none"}, {"name": "north east england chamber of commerce", "sentiment": "none"}, {"name": "coreena ford", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "8.35 Coreena Ford Thomas Cook feeling effects of terror attacks \nTour operator Thomas Cook said bookings remained under pressure as the travel market continues to be hit by recent terror attacks. \nThe holiday giant revealed that while demand from British sunseekers was robust over the summer, with bookings up 1%, sales were hit hard in Germany and across Continental Europe, tumbling by 9%. \nIt said bookings were also “significantly down” in Belgium after the terrorist attacks at Brussels airport in March. \nBut stripping out the impact of sharply lower demand for trips to previously popular destination Turkey, it said bookings surged by 13% over the summer in the UK and were 8% higher overall. \nChief executive Peter Fankhauser insisted travellers still wanted to holiday overseas, but have switched to destinations such as the Balearic and Canary Islands and the United States, alongside smaller destinations like Bulgaria and Cuba. \nHe said: “Customers’ desire to go abroad on holiday has remained strong, with the exception of Turkey where demand continues to be volatile.” \nThomas Cook cut its annual earnings outlook in July as it warned over the impact of the terrorist incidents. Owen Humphreys/PA Wire 8.30 Coreena Ford Could your firm make it into the Top 200? \nThe search is on to find which companies will earn the prestige of a place in the latest annual North East Top 200 – and with it, perhaps, an award. \nOur updated business list of distinction – once more organised by The Journal and The Gazette, and run with associate sponsor North East England Chamber of Commerce - will be published exclusively soon. \nThis will come in a free supplement with The Journal and The Gazette of Wednesday, November 16, and will contain the full table with further facts, figures and background. Surprises in the table are certain. \nBesides pinpointing the region’s corporate success stories, the table will give good indications of the region’s current business performance over all, and its various sectors. Expert opinion suggests portents are good. \nCompanies that think they may merit a place in the table should follow guidelines set out here , where you’ll also find the all-important deadline. \nSeldom before, if ever, has the distinction of an appearance in the list promised greater benefit. \nWith Brexit upon us, the priority in coming months is to find rewarding new markets - particularly abroad, as Trade Secretary Liam Fox has trenchantly reminded business bosses. \nFirms that can say they’re in their region’s Top 200 immediately win attention, according to those already thriving on overseas business - and it works well at home too. The Journal and Gazette Top 200 Breakfast took place at the Stadium of Light, Sunderland, last year and it will host the event again this year", "external_links": [], "published": "2016-09-27T15:20:00.000+03:00", "crawled": "2016-09-27T10:39:40.846+03:00", "highlightTitle": ""}