{"organizations": [], "uuid": "e1485f80a6f07f563a73b22fff9736aec201558b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article10294000.ece/ALTERNATES/s1200/JS74806133.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-top-200-2016-11940748", "country": "GB", "domain_rank": 21960, "title": "The North East Top 200 2016 is under way - does your company merit a place?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "The North East Top 200 2016 is under way - does your company merit a place?", "spam_score": 0.0, "site_type": "news", "published": "2016-09-27T07:01:00.000+03:00", "replies_count": 0, "uuid": "e1485f80a6f07f563a73b22fff9736aec201558b"}, "author": "nechronicle", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-top-200-2016-11940748", "ord_in_thread": 0, "title": "The North East Top 200 2016 is under way - does your company merit a place?", "locations": [], "entities": {"persons": [{"name": "br", "sentiment": "negative"}, {"name": "berghaus", "sentiment": "none"}, {"name": "sage", "sentiment": "none"}, {"name": "utilitywise", "sentiment": "none"}, {"name": "mcaleer", "sentiment": "none"}, {"name": "susan hart", "sentiment": "none"}, {"name": "brian nicholls", "sentiment": "none"}, {"name": "liam fox", "sentiment": "none"}, {"name": "ben burgess", "sentiment": "none"}, {"name": "amy evans", "sentiment": "none"}, {"name": "james ramsbotham", "sentiment": "none"}, {"name": "bond dickinson", "sentiment": "none"}, {"name": "sintons", "sentiment": "none"}, {"name": "bill macleod", "sentiment": "none"}], "locations": [{"name": "east anglia", "sentiment": "none"}, {"name": "snop uk", "sentiment": "none"}, {"name": "north tyneside", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "north east top", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "north shields", "sentiment": "none"}, {"name": "kavli uk", "sentiment": "none"}], "organizations": [{"name": "north east top", "sentiment": "negative"}, {"name": "aberdeen", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "durham university business school", "sentiment": "none"}, {"name": "north shields", "sentiment": "none"}, {"name": "sunderland college", "sentiment": "none"}, {"name": "pwc newcastle", "sentiment": "none"}, {"name": "journal", "sentiment": "none"}, {"name": "heerema hartlepool ltd", "sentiment": "none"}, {"name": "business school", "sentiment": "none"}, {"name": "technip umbilicals", "sentiment": "none"}, {"name": "priory group", "sentiment": "none"}, {"name": "glaxosmithkline", "sentiment": "none"}, {"name": "sintons sunderland college", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "north east business & innovation centre", "sentiment": "none"}, {"name": "north east england chamber of commerce", "sentiment": "none"}, {"name": "siemens", "sentiment": "none"}, {"name": "fastflow group", "sentiment": "none"}, {"name": "global navigation solutions holdings", "sentiment": "none"}, {"name": "bellway", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}, {"name": "ca group holdings", "sentiment": "none"}, {"name": "richard irvin & sons", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "companies house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The North East Top 200 2016 is under way - does your company merit a place? 00:01, 27 Sep 2016 By Brian Nicholls There’s never been a better time strategically to stake a claim in the Top 200, Brian Nicholls suggests Share Get business news by email The Journal and Gazette Top 200 Breakfast at the Stadium of Light, Sunderland \nThe search is on to find which companies will earn the prestige of a place in the latest annual North East Top 200 – and with it, perhaps, an award. \nOur updated business list of distinction – once more organised by The Journal and The Gazette, and run with associate sponsor North East England Chamber of Commerce - will be published exclusively soon. \nThis will come in a free supplement with The Journal and The Gazette of Wednesday, November 16, and will contain the full table with further facts, figures and background. Surprises in the table are certain. \nBesides pinpointing the region’s corporate success stories, the table will give good indications of the region’s current business performance over all, and its various sectors. Expert opinion suggests portents are good. \nCompanies that think they may merit a place in the table should follow guidelines set out below. The Journal and Gazette Top 200 Breakfast at the Stadium of Light, Sunderland \nSeldom before, if ever, has the distinction of an appearance in the list promised greater benefit. \nWith Brexit upon us, the priority in coming months is to find rewarding new markets - particularly abroad, as Trade Secretary Liam Fox has trenchantly reminded business bosses. \nFirms that can say they’re in their region’s Top 200 immediately win attention, according to those already thriving on overseas business. It works well at home too. \nA listing can help firms seeking funds to grow. It can attract the cream of career seekers. Indeed, it does no harm anywhere to say one’s on a list that includes big guns of the North East battery – firms regularly high up there like Nissan, Bellway, Sage and the giant public transport groups based in the North East. Top 200 Merely being in the same table will be an objective well worthwhile, since the table highlights also: Leading companies of any size that show highest percentage turnover in a year Leading plcs and private companies Private equity backed companies, and companies with a parent outside the region. \nSo recognition and awards await at many levels. Not for nothing has the North East Top 200 been described as “prime prestige costing not a penny”. \nLast year’s minimum qualifying turnover was £33,042,000. It’s not possible yet to pinpoint the key figure this time round, but any company turning over £30m or thereabouts should consider their chances. \nThere’ll be lots of interest in whether there’s further sparkle in last year’s shooting stars – new entries and highest climbers. The top four newcomers then were: Global Navigation Solutions Holdings (shipping industry services, North Shields), Fastflow Group (asset maintenance, Washington), Utilitywise (energy and water management support, North Tyneside), and Snop UK (pre-assembled parts processor, Washington). \nThe four biggest climbers were: Heerema Hartlepool Ltd (offshore engineering), Bond Dickinson (law firm, Newcastle), Kavli UK (food producers, Gateshead), and CA Group Holdings (metal roof manufacturers, Durham). \nSponsors of the Top 200, besides the Chamber and PwC include Durham University Business School, North East Business & Innovation Centre , which sponsor the highest new entry, Sintons, sponsor of the privately owned category, and Sunderland College, which sponsors the number one company. Sintons Sunderland College \nBill MacLeod, senior partner at Newcastle’s office of PwC, one of our sponsors, said: “PwC Newcastle is proud to continue its association with the Top 200. This year, more than ever, we find ourselves presented with a changing environment, whether it’s the long-term effects of leaving the EU or uncertainty about devolution. However, the businesses I speak to are generally optimistic and determined to focus on the opportunities. \n“This is reflected in the Top 200 where we see businesses from a broad spectrum of sectors performing well and delivering strong growth - testament to the health of North East business.” \nJames Ramsbotham, chief executive of associate sponsor North East England Chamber of Commerce says: “The top 200 is a perfect example of how dynamic and successful our business community is here in the North East. We have fantastic examples of innovative companies that regularly punch above their weight and put our region on the national and international map. As a Chamber we are proud to support many of our members who have been selected for this prestigious showcase.” \nProfessor Susan Hart, the dean at fellow sponsor Durham University Business School, added: “On behalf of Durham University Business School, I am very proud to be part of such a prestigious, annual event. \n“As an international triple accredited Business School, Durham supports businesses to meet their challenges, and produces international connections and innovative opportunities to grow. \n“Durham University Business School delivers exceptional education by infusing research focused on significant issues facing business and society, with practical insight from our extensive network of partner businesses - such that our collective energy and leadership benefits business, economy, communities and society.” pwc logo HOW THE TABLE IS COMPILED \n…and the deadline to meet. \nThe Top 200 table is compiled by PwC in Newcastle from publicly available sources. All information is taken from the published audited accounts of companies filed at Companies House, or made available on the company website. Companies in the list are ranked in order of latest turnover. The aim of the table is to identify companies which not only have a significant presence in the region but also have a significant decision making process in the region. \nBy taking all the information from publicly available sources we hope to make the Top 200 robust and transparent, and to remove as much subjectivity as possible. However, a number of issues have to be considered when we compile the table. \nCompanies are identified as having a registered office address in the region (i.e. the postcode area is one of the following; NE, SR, DH, DL or TS). Due to this criteria, a number of companies while large employers in the region - Siemens and GlaxoSmithKline for example - do not appear in this list. This is because their operations in the region could be restricted to a factory or division but are not discreet companies in their own right publishing separate accounts. The Journal and Gazette Top 200 Breakfast at the Stadium of Light, Sunderland \nThere are some exceptions to this where, although a company has a registered address in the region, it will have been excluded from the list following further scrutiny. For example, Richard Irvin & Sons was established in North Shields in 1871 and still has a registered office address there. But although the business originally operated in fishing and nautical industries, by the 1970s and 1980s it diversified away from these and invested in oil and gas related activities - finally moving its headquarters to Aberdeen in 2008. \nSimilarly Ben Burgess has its registered office in Newcastle but is based in East Anglia. McAleer & Rushe are headquartered in Northern Ireland. \nFurther adjustments to the list are also made where the registered office of the company is outside the region, but the controlling base of the company can be demonstrated to be in the region by checking the published accounts and company websites. Examples from the Top 200 list for last year include Priory Group, Berghaus and Technip Umbilicals. \nTo compare the turnover of the companies listed in the Top 200, calculations need to be made to some of the published figures in accounts. This is because certain companies publish their accounts in a different currency (eg, euros) in which case the exchange rate is taken as at the reporting year end date (eg, December 31). Also, some companies change their accounting reference dates, resulting in a turnover figure for more or less than a full calendar year. Here the turnover figure is pro-rated in order to rank the companies in the Top 200. VIEW GALLERY \nPrivate companies are given nine months from the end of the accounting reference period to deliver their accounts to the Registrar at Companies House, after which the accounts are deemed to be overdue. To make the published table as accurate as possible no overdue accounts will be used, and the deadline for inclusion for this year is Monday, October 24. JOIN THE CELEBRATION \nAn awards presentation breakfast, open to everyone, will be held at the Stadium of Light , Sunderland , on Tuesday, November 15. Guests will receive their copy of the Top 200 supplement a day ahead of publication. For table and ticket bookings, or to find out about sponsorship opportunities, please contact Amy Evans, events manager, on 0191 201 609, or email amy.evans@trinitymirror.com", "external_links": [], "published": "2016-09-27T07:01:00.000+03:00", "crawled": "2016-09-27T02:18:24.020+03:00", "highlightTitle": ""}