{"organizations": [], "uuid": "e735e6114741913e8a86b0e55fa6ae2ebf470121", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article10240338.ece/ALTERNATES/s1200/JS53457304.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/petards-grow-profits-fifth-successful-11854932", "country": "GB", "domain_rank": 21960, "title": "Petards grow profits for fifth successful half-year trading period", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Petards grow profits for fifth successful half-year trading period", "spam_score": 0.0, "site_type": "news", "published": "2016-09-07T21:47:00.000+03:00", "replies_count": 0, "uuid": "e735e6114741913e8a86b0e55fa6ae2ebf470121"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/petards-grow-profits-fifth-successful-11854932", "ord_in_thread": 0, "title": "Petards grow profits for fifth successful half-year trading period", "locations": [], "entities": {"persons": [{"name": "raschid abdullad", "sentiment": "none"}, {"name": "abdullah", "sentiment": "none"}], "locations": [{"name": "team valley", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "electrostar", "sentiment": "none"}, {"name": "stansted express  profits", "sentiment": "none"}, {"name": "electrostar", "sentiment": "none"}, {"name": "provida", "sentiment": "none"}, {"name": "hitachi rail europe", "sentiment": "none"}, {"name": "qro solutions", "sentiment": "none"}, {"name": "bombardier transportation", "sentiment": "none"}, {"name": "qro", "sentiment": "none"}, {"name": "auto number plate recognition systems", "sentiment": "none"}, {"name": "group", "sentiment": "none"}, {"name": "apc", "sentiment": "none"}, {"name": "emu", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Revenues are up 22% at the Team Valley technology firm which made a key acquisition in April Shares Get business news by email Petards eyeTrain systems are used on Electrostar trains, like this one in use at the Stansted Express \nProfits have grown for a fifth successive six-month trading period at security specialists Petards, which is starting to reap the rewards of a recent acquisition. \nThe Team Valley firm , which designs and makes advanced security and surveillance systems, has issued a half-year report in which it describes a strong trading period, with a 22% rise in revenues to £7.4m in the six months to June 30. \nThe firm said it has been very busy over the six months, its activities including the acquisition of QRO Solutions - which makes software for Auto Number Plate Recognition Systems - and that a number of exciting order prospects are under negotiation. \nThe firm said its pre-tax profits were up by a third to £475,000 over the corresponding period in 2015, making this the fifth successive six-month period in which the Group has recorded an increase in its profitability. \nRevenues from continuing operations also increased by 17% on the back of increased deliveries of the Group’s eyeTrain surveillance products. \nFollowing the QRO acquisition the Group said its operations continue to be focused upon the development, supply and maintenance of technologies to be used in the transport, emergency services and defence markets. \nPetards chairman Raschid Abdullad said the Group’s trading performance has been strong, but that order intake during the period was slower than had been anticipated for two of its products used within the transport sector - the eyeTrain security system and ProVida, the series of mobile surveillance and speed limit enforcement systems. \nThis contrasted with a better than anticipated order intake for Defence products following receipt of the £800,000 MOD radio order. \nMr Abdullah said: “The board believes the slower order intake was due to the timing of specific customer projects rather than any Brexit effect. \n“Since the start of the third quarter, orders totalling over £4m have been received. \n“These orders have included two previously announced orders from Bombardier Transportation totalling in excess £2.5m for the supply of eyeTrain systems on two UK projects for fitment to ELECTROSTAR and the new AVENTRA EMU trains for delivery in 2017 and 2018. \n“A further order of approximately £0.6m has been received from Hitachi Rail Europe for eyeTrain automatic passenger counting (APC) systems for delivery over the next three years.” \nThe group’s order book at 30 June was £12m, of which just under half is scheduled for delivery in the second half of 2016.", "external_links": [], "published": "2016-09-07T21:47:00.000+03:00", "crawled": "2016-09-07T17:08:06.219+03:00", "highlightTitle": ""}