{"organizations": [], "uuid": "8969815c607e61c9d81da7cd3c656a2aa70a04a3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/29688655/15380442.jpg", "site_section": "http://www.thisisleicestershire.co.uk/specialolympics/rss.html?chid=181121", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/east-midlands-bank-of-england-agent-says-leicestershire-businesses-can-survive-brexit/story-29688655-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "Leicester Mercury published East Midlands Bank of England agent says Leicestershire...", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "Leicester Mercury published East Midlands Bank of England agent says Leicestershire...", "spam_score": 0.0, "site_type": "news", "published": "2016-09-06T19:27:00.000+03:00", "replies_count": 0, "uuid": "8969815c607e61c9d81da7cd3c656a2aa70a04a3"}, "author": "Leicester Mercury", "url": "http://www.leicestermercury.co.uk/east-midlands-bank-of-england-agent-says-leicestershire-businesses-can-survive-brexit/story-29688655-detail/story.html", "ord_in_thread": 0, "title": "Leicester Mercury published East Midlands Bank of England agent says Leicestershire...", "locations": [], "entities": {"persons": [{"name": "alastair cunningham", "sentiment": "none"}, {"name": "pam", "sentiment": "none"}], "locations": [{"name": "leicester", "sentiment": "none"}, {"name": "east midlands", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}, {"name": "spalding", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "mansfield", "sentiment": "none"}], "organizations": [{"name": "leicester mercury", "sentiment": "negative"}, {"name": "leicestershire", "sentiment": "negative"}, {"name": "east midlands bank of england", "sentiment": "negative"}, {"name": "bank rate", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "mpc", "sentiment": "none"}, {"name": "east midlands​ east midlands bank of england", "sentiment": "none"}, {"name": "bank's monetary policy committee", "sentiment": "none"}, {"name": "bank", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "bank of england", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "East Midlands Bank of England agent says Leicestershire businesses can survive Brexit By Leicester Mercury | Posted: September 06, 2016 0 COMMENTS SHARES Alastair Cunningham, Bank of England's agent for the East Midlands​ East Midlands Bank of England agent says Leicestershire businesses can survive...   Comments (0) \nAlastair Cunningham, Bank of England's agent for the East Midlands​ \nWe are entering what is likely to be a period of significant change for our economy, with the vote to leave the European Union ushering in a new era for the UK's relationship with the rest of the world. \nSome of the adjustments to this new reality may prove difficult and many will take time. \nAnd, while the Bank of England firmly believes that the UK – one of the most flexible economies in the world – can handle this change, there will inevitably be a period of heightened uncertainty as this process takes place. \nIn August, the Bank published its latest Inflation Report which explained how the vote to leave the EU has resulted in a material change in the economic outlook. \nFor example, the big fall in the value of sterling since the referendum will push up import and consumer prices notably over the next three years. \nWe also now expect growth to be weaker and unemployment higher over the next couple of years than at the time of our last forecast in May. \nImportantly, there are signs that this is already materialising: some uncertainty indicators have risen, property markets appear to be weakening, and surveys of activity growth have fallen. \nIn response, the Bank's Monetary Policy Committee (MPC) has unveiled a comprehensive package of measures to support the economy. \nThe package includes a reduction in Bank Rate from 0.5 per cent to 0.25 per cent – the first change in interest rates for seven years – along with a new Term Funding Scheme, worth up to £100 billion, to ensure that this cut is passed on by lenders to households and businesses. \nThe Bank is also expanding its programme of purchases of Government bonds by £60 billion and launching a new scheme to buy £10 billion of UK corporate bonds. \nTaken together, these measures should provide a significant stimulus to economic activity, bolstering confidence and blunting the slowdown. And there is scope to extend them if circumstances require. \nRead more: OPINION: Brexit, what does it mean for the Leicestershire property market? \nThis package of measures should have a real beneficial impact for businesses and households here in the East Midlands. \nFor example, cutting Bank Rate will immediately ease financing conditions as around half of mortgages by value are floating rate contracts and four fifths of bank loans held by firms are at floating rates. \nIn the current absence of much \"hard\" data on the economic impact of the referendum, the evidence gathered by our regional agents was particularly important as the MPC tried to assess the state of the economy. \nWe are really grateful for the time that business leaders have given us over the last few weeks as we have sought to better understand how they are being affected by this period of heightened uncertainty. \nOver the past month, my colleague, Pam, and I have visited companies large and small from Mansfield to Spalding (and plenty of points in between) to hold detailed conversations with those people who are making decisions on investment and jobs. \nAlthough some contacts tell us that they have not changed their plans as a result of the referendum outcome, others are more cautious about decisions on investment and hiring. \nIn July, we published our latest Agents' Summary of Business Conditions which included the findings of our survey on the impact of the EU referendum on our contacts across the UK. \nThe clear result was that the outcome would have a negative effect, overall, on capital spending, hiring and turnover over the coming year. \nOur report also highlights a slowdown in growth in business services, partly reflecting a pause in commercial property investment and corporate transactions. \nMore positively, annual growth in manufacturing exports had turned positive after a period of declining output, helped by the recent depreciation in sterling. \nBut the weaker pound has already pushed up the price of imported goods for some businesses, leading to expectations of price increases in due course. \nAt challenging times like this, what is always striking is the resilience and versatility of our region's business community. As circumstances change, companies will adapt to take on new challenges and embrace new opportunities. \nWe hope the actions taken by the Bank of England over the past week will play a small part in helping them to do that.", "external_links": [], "published": "2016-09-06T19:27:00.000+03:00", "crawled": "2016-09-06T15:14:55.378+03:00", "highlightTitle": ""}