{"organizations": [], "uuid": "48c19cea02be6616dd11761ff41dee3404d9c58e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article11937383.ece/ALTERNATES/s1200/Labour-leadership-challenge.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/labour-lead-manufacturing-renaissance-intervening-11937373", "country": "GB", "domain_rank": 21960, "title": "Labour will lead a 'manufacturing renaissance' by intervening in the economy says John McDonnell", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Labour will lead a 'manufacturing renaissance' by intervening in the economy says John McDonnell", "spam_score": 0.0, "site_type": "news", "published": "2016-09-26T15:27:00.000+03:00", "replies_count": 0, "uuid": "48c19cea02be6616dd11761ff41dee3404d9c58e"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/labour-lead-manufacturing-renaissance-intervening-11937373", "ord_in_thread": 0, "title": "Labour will lead a 'manufacturing renaissance' by intervening in the economy says John McDonnell", "locations": [], "entities": {"persons": [{"name": "john mcdonnell", "sentiment": "negative"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "mcdonnell", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "liverpool", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "john mcdonnell labour", "sentiment": "negative"}, {"name": "labour", "sentiment": "negative"}, {"name": "daniel leal-olivas/pa wire john mcdonnell  labour", "sentiment": "none"}, {"name": "jonathan walker labour", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Labour will lead a 'manufacturing renaissance' by intervening in the economy says John McDonnell 08:27, 26 Sep 2016 08:28, 26 Sep 2016 By Jonathan Walker Labour's Shadow Chancellor John McDonnell argues that people are losing faith in free markets across the world Share Get daily news by email Daniel Leal-Olivas/PA Wire John McDonnell \nLabour Shadow Chancellor John McDonnell will say that Britain needs a “manufacturing renaissance” post-Brexit to rebuild and transform the nation’s economy. \nIn his speech to the Labour conference in Liverpool, Mr McDonnell will argue that people across the world are losing faith in market forces - and there is a growing realisation that governments must be ready to intervene. \nHe will say: “The old rules of the global economy are being rewritten for us. \n“The winds of globalisation are blowing in a different direction. They are blowing against the belief in the free market, and in favour of intervention.” \nThe Shadow Chancellor, a close ally of Labour leader Jeremy Corbyn, will argue that the government has a role to play supporting businesses, and warn that Britain risks being left behind in growing digital technology market because the present Government is cutting investment in research. \nAnd he will pledge that Labour will act to save jobs if needed, in contrast to the Conservative Government’s reluctance to intervene to save the UK steel industry. \nHe will say: “Be certain the next Labour government will be an interventionist government.” \nMr McDonnell will the Labour conference: “Look at the steel crisis. With the world market flooded by cheap steel, major governments moved to protect their domestic steel industries. \n“Ours did not, until we pushed them to.” \nHe will argue that manufacturing is making a comeback after years of decline, but modern manufacturing requires a highly-skilled workforce. \n“For decades, manufacturing jobs disappeared as producers looked for the cheapest labour they could find. \n“Today, one in six manufacturers in the UK are bringing jobs back to Britain. \n“That’s because production today is about locating close to markets and drawing on highly-skilled labour and high-quality investment. \n“Digital technology means production can be smaller-scale, in smaller, faster firms dependent on co-operation and collaboration, not dog-eat-dog competition.” \nBut although there is “huge potential” for advanced manufacturing in this country, the industry is failing to reach its potential due to a lack of government support, Mr McDonnell will argue. \nHe is expected to say: “It has cut scientific research spending. \n“It has slashed subsidies to renewables, threatening tens of thousands of jobs. \n“And it plans to cut essential public investment in transport, energy, and housing across the whole country.” \nMr McDonnell will say: “After Brexit, we want to see a renaissance in British manufacturing. \n“And as we’ve committed ourselves, our government will create an entrepreneurial state that works with the wealth creators, the workers and the entrepreneurs to create the products and the markets that will secure our long term prosperity.”", "external_links": [], "published": "2016-09-26T15:27:00.000+03:00", "crawled": "2016-09-26T11:08:12.210+03:00", "highlightTitle": ""}