{"organizations": [], "uuid": "f9dd0002cd1ca5fda90dc9570fca1d174e815517", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article11614514.ece/ALTERNATES/s1200/JS94888543.jpg", "site_section": "", "section_title": "", "url": "http://www.chroniclelive.co.uk/business/farming/co-op-switches-100-british-11895849", "country": "IE", "domain_rank": 21960, "title": "Co-op switches to 100% British lamb and bacon to back UK farming - Chronicle Live", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 0, "title_full": "Co-op switches to 100% British lamb and bacon to back UK farming - Chronicle Live", "spam_score": 0.0, "site_type": "news", "published": "2016-09-17T08:00:00.000+03:00", "replies_count": 0, "uuid": "f9dd0002cd1ca5fda90dc9570fca1d174e815517"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/farming/co-op-switches-100-british-11895849", "ord_in_thread": 0, "title": "Co-op switches to 100% British lamb and bacon to back UK farming - Chronicle Live", "locations": [], "entities": {"persons": [{"name": "graeme whitfi", "sentiment": "negative"}, {"name": "meurig raymond", "sentiment": "none"}, {"name": "andrea leadsom", "sentiment": "none"}, {"name": "andrew forgrave", "sentiment": "none"}, {"name": "steve murrells", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "wales", "sentiment": "none"}, {"name": "westminster", "sentiment": "none"}], "organizations": [{"name": "sheep  nfu", "sentiment": "none"}, {"name": "nick ansell/pa wire a co-operative", "sentiment": "none"}, {"name": "love british food fortnight", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Co-op switches to 100% British lamb and bacon to back UK farming 00:00, 17 Sep 2016 By Graeme Whitfield The move comes at the start of Love British Food Fortnight, which aims to boost domestic producers Shares Get business news by email Nick Ansell/PA Wire A Co-operative food store \nFarming leaders have welcomed a decision by the Co-op group to extend its backing for British farmers with a 100% switch to fresh bacon and lamb from the UK. \nThe new initiative will mean the Co-op is the only major UK food retailer to stock 100% own-brand fresh British beef, chicken, pork, lamb, bacon and turkey. It is already the only retailer to use British meat in all its chilled ready meals, pies and sandwiches. \nUnder a three-year plan, the convenience retailer pledged to invest a minimum of £1.5bn sourcing UK meat and vegetables. The announcement comes at the start of Love British Food Fortnight, which runs from today until October 2. \nWelcoming the announcement, Environment Secretary Andrea Leadsom said: \n“The Great British brand is renowned across the globe for its quality, innovation and tradition. From our world-famous Welsh lamb to the classic bacon sandwich, British meat is not only delicious but also produced to the highest standards of quality, welfare and safety. \n“We should rightly have pride in Britain’s reputation for producing quality meat and today’s announcement is a real vote of confidence in our farmers and an industry that is the bedrock of our economy. It’s great to see the Co-op taking the lead to celebrate the best of British and supporting our Great British Food campaign.” \nSteve Murrells, retail chief executive at The Co-op, said: “We are a major supporter of British farming. This move is a first for a major food retailer and will see us invest millions more into sourcing home produced goods. \n“It’s an exciting time at the Co-op and our growing confidence is shown by our investment in UK farming as we do business a better way to meet consumer demand.” Andrew Forgrave Sheep \nNFU president Meurig Raymond said: “We applaud this bold move by the Co-op to sell only British lamb and bacon. In a week that saw farmers and politicians unite at Westminster to back our industry, this decision shows a real commitment to quality British food and the farmers that produce it. \n“The public tells us time and again that they want to see more British food on supermarket shelves and it’s fantastic to see that the co-op has recognised this and realised that it makes strong business sense to support British farmers. \n“In the face of market uncertainty post-Brexit, the Co-op’s commitment to source British lamb all year round is particularly important in providing the support and stability to help British sheep farming thrive and sends a clear message that British lamb really is the best in the world.” \nThe change to 100% British Lamb will see the Co-op support around 1,700 British sheep farms each year across England, Scotland and Wales. \nThe all-year round supply will be achieved by farming a variety of native breeds that produce lambs at different times of the year, promoting breed diversity across British lamb producers. ", "external_links": [], "published": "2016-09-17T08:00:00.000+03:00", "crawled": "2016-09-17T02:15:48.577+03:00", "highlightTitle": ""}