{"organizations": [], "uuid": "63dc14ccc4771c0eaab3dfce5ef849de0d17fd31", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/29685134/15376929.jpg", "site_section": "http://www.thisisleicestershire.co.uk/elections2009/rss.html?chid=181299", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/up-to-150-jobs-to-be-axed-at-caterpillar-desford/story-29685134-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "TomPegden commented Up to 150 jobs to be axed at Caterpillar, Desford", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "TomPegden commented Up to 150 jobs to be axed at Caterpillar, Desford", "spam_score": 0.0, "site_type": "news", "published": "2016-09-05T17:59:00.000+03:00", "replies_count": 0, "uuid": "63dc14ccc4771c0eaab3dfce5ef849de0d17fd31"}, "author": "TomPegden", "url": "http://www.leicestermercury.co.uk/up-to-150-jobs-to-be-axed-at-caterpillar-desford/story-29685134-detail/story.html", "ord_in_thread": 0, "title": "TomPegden commented Up to 150 jobs to be axed at Caterpillar, Desford", "locations": [], "entities": {"persons": [{"name": "tompegden", "sentiment": "negative"}, {"name": "keith vaz", "sentiment": "none"}, {"name": "doug oberhelman", "sentiment": "none"}], "locations": [{"name": "desford", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "peckleton lane", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "gosselies", "sentiment": "none"}, {"name": "africa", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}, {"name": "desford view", "sentiment": "none"}], "organizations": [{"name": "caterpillar", "sentiment": "negative"}, {"name": "commen", "sentiment": "negative"}, {"name": "caterpillar uk", "sentiment": "none"}, {"name": "caterpillar inc", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}, {"name": "leicester tigers", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Up to 150 jobs to be axed at Caterpillar, Desford By TomPegden | Posted: September 05, 2016 3 COMMENTS SHARES Cuts planned: Caterpillar in Desford VIEW GALLERY Up to 150 jobs to be axed at Caterpillar, Desford X \nCopy link to paste in your message / Cuts planned: Caterpillar in Desford Up to 150 jobs will go at Caterpillar UK, Desford Comments (3) \n​As many as 150 jobs could be lost at Leicestershire's Caterpillar factory following a downturn in sales. \nThe job cuts will hit permanent staff in the mechanical excavator – or backhoe loader division – at the plant in Peckleton Lane, Desford. \nCaterpillar UK currently has around 1,200 workers in the village and a consultation over the voluntary redundancies is now underway. \nA spokesman said: \"We understand this is difficult for our employees and their families, but we have to take these actions to maintain long-term competitiveness.\" \nThe US-based parent company has been hit badly in the last couple of years by a downturn in global orders for its machinery. \nOn Friday it announced it was considering closing a construction machinery plant in Gosselies, 35 miles south of Brussels, with the potential loss of 2,000 jobs . \nThe spokesman said that was part of a global restructuring and cost-savings process announced a year ago. \nHe said the Desford redundancies were due to a drop in demand rather than the global plans. \nRead more: Foreign-owned Caterpillar UK remains committed to Britain despite Brexit result \nAt the start of this year the parent company reported a $3 billion (£2 billion) drop in turnover in the last three months of 2015. \nSales and revenue went from $14 billion in the last three months of 2014 to $11 billion a year later. \nHowever, the company's supplies to the construction sector in Europe, Africa and the Middle East – which account for much of the business from its Desford factory – were down just 2 per cent at $913 million (£635 million). \nAt that time, Caterpillar Inc chairman and chief executive Doug Oberhelman said cost management, restructuring and operational changes were helping the company while sales and revenues were under pressure. \nThe global business has particularly been affected by the slowdown of growth in China. \nLast September, the business announced 10,000 job losses globally, and about 5,000 posts – mostly in the US – have already gone. \nMore cuts are planned. \nThe Desford spokesman said: \"In response to a reduction in orders, Caterpillar initiated a collective consultation with employee representatives on Thursday regarding a reduction of the number of factory-based employees at the building construction products division facility at Desford. \n\"A voluntary severance programme (VSP) is currently open. \"The current anticipated number of proposed redundancies is up to 150. \n\"These figures include successful VSP applications.\" \nRead more: Keith Vaz stands down as Home Affairs chair following sex and drug allegations \nIn mid-2015 the business axed 200 temporary agency workers at Desford. \nBackhoe loaders and compact wheel loaders made there are typically used in the building and construction trade, as well as earth-moving, aggregates and mining. \nIn October Caterpillar UK announced it was ending its sponsorship with Leicester Tigers as of the current season which kicked off this weekend. \nThat decision was also down to cost-cutting.", "external_links": [], "published": "2016-09-05T17:59:00.000+03:00", "crawled": "2016-09-05T14:43:00.591+03:00", "highlightTitle": ""}