{"organizations": [], "uuid": "4e1ea9e3711aa3d783d6cf20289273babf598632", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article11501206.ece/ALTERNATES/s1200/JS93063495.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/better-roads-rail-air-links-11848771", "country": "GB", "domain_rank": 21960, "title": "Better roads, rail and air links at the heart of UKIP's manifesto for the North East", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Better roads, rail and air links at the heart of UKIP's manifesto for the North East", "spam_score": 0.0, "site_type": "news", "published": "2016-09-06T22:28:00.000+03:00", "replies_count": 0, "uuid": "4e1ea9e3711aa3d783d6cf20289273babf598632"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/better-roads-rail-air-links-11848771", "ord_in_thread": 0, "title": "Better roads, rail and air links at the heart of UKIP's manifesto for the North East", "locations": [], "entities": {"persons": [{"name": "pat ritchie", "sentiment": "none"}, {"name": "jonathan arnott", "sentiment": "none"}, {"name": "nigel farage", "sentiment": "none"}], "locations": [{"name": "north east better", "sentiment": "none"}, {"name": "leeds", "sentiment": "none"}, {"name": "tees valley airport", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "darlington", "sentiment": "none"}, {"name": "tees valley", "sentiment": "none"}, {"name": "ashington", "sentiment": "none"}, {"name": "north west", "sentiment": "none"}, {"name": "durham tees valley airport", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "brexit scrapping", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}], "organizations": [{"name": "ukip", "sentiment": "neutral"}, {"name": "central first school", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "northern powerhouse", "sentiment": "none"}, {"name": "newcastle city council", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "northern rail", "sentiment": "none"}, {"name": "united kingdom independence party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Better roads, rail and air links at the heart of UKIP's manifesto for the North East 15:28, 6 Sep 2016 UKIP hope to prove they're the party for the North East while Labour remains divided Shares Get daily news by email Former Ukip leader Nigel Farage speaks at a Brexit rally at the Sage \nAmbitious plans to upgrade key North East roads, replace Pacer trains and back Tees Valley Airport have been published by UKIP. \nThe United Kingdom Independence Party has drawn up a detailed manifesto to create a real Northern Powerhouse - and one which includes the North East. \nUKIP politicians say they hope to show the party has a vision for the region at a time when Labour , which traditionally dominates politics in much of the region, is divided. \nThe document is also an attempt by senior UKIP figures in the North East to push the region’s needs to the top of their own party’s agenda, as UKIP holds a contest to replace outgoing leader Nigel Farage. \nCalled “A Vision for the North East”, the manifesto sets out plans which include full dualling of the A1 , linking the North East with Scotland, and both the A69 and A66, which link the region with the North West. \nIt says existing plans to replace outdated Pacer trains on Northern Rail services should be speeded up. \nAnd the party also says that mainline passenger route from Ashington to Newcastle should be reopened. \nUKIP also says it is committed to helping Durham Tees Valley Airport, near Darlington , achieve its full potential. Jonathan Arnott MEP \nThe document states: “We believe that Tees Valley Airport is a viable venture. We want to see a vibrant airport for both passenger and freight flights operating on the Tees Valley site. We would explore different mechanisms and models for providing the necessary assistance to ensure that this happens.” \nTransport improvements would be funded partly by scrapping High Speed Two (HS2), the planned high speed rail line linking London, Birmingham, Manchester and Leeds. \nAnd UKIP says that it believes some measures could be funded simply by giving the North East “a fair deal” so that it receives a fairer share of national funding. Currently, London receives more than six times as much funding per capita for transport. Other key pledges include: Backing North East industry, including by scrapping or cutting “green taxes” which increase the cost of energy, and introducing a presumption of Buying British for all public sector procurement. Replacing 100% of EU funding currently going to the North East, using cash the UK will no longer need to contribute to the EU budget after Brexit Scrapping current devolution plans including a North East mayor, on the grounds that power should be devolved to local councils Tackling “disproportionately high pay” for senior council staff, after it emerged Newcastle City Council chief executive Pat Ritchie is to get a £24,000 rise on top of her £151,000 salary. \nUKIP’s plans include measures to boost the region’s schools, such as providing more funding from central government to create places where they are needed. \nThe party highlighted the example of Central First School in Ashington which was forced to teach children in make-shift classrooms including a double decker bus, a garden shed and toilets. \nIt said: “We do not wish to ever see a repeat of a school in our region having to convert toilets and cupboards for use as classrooms.” \nNorth East UKIP MEP Jonathan Arnott said, “For far too long the North East has been abandoned and ignored by our governments. It’s time for us to fight for a fair deal in terms of funding, but also for our national government to understand the needs of local business and manufacturers. \n“We’re a region that builds things, that makes things, that sells things. Our government and councils should be doing everything they can to make that easier.”", "external_links": [], "published": "2016-09-06T22:28:00.000+03:00", "crawled": "2016-09-06T17:48:58.904+03:00", "highlightTitle": ""}