{"organizations": [], "uuid": "fcdb5dedb4f85636a144f42e5733c58304218c5d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/29751643/15578071.jpg", "site_section": "http://www.thisisleicestershire.co.uk/weathernews/rss.html?chid=182806", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/mattioli-woods-boss-says-uk-economy-is-robust-enough-to-enable-brexit-to-happen/story-29751643-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "TomPegden published Mattioli Woods boss says UK economy is robust enough to enable...", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "TomPegden published Mattioli Woods boss says UK economy is robust enough to enable...", "spam_score": 0.0, "site_type": "news", "published": "2016-09-27T13:22:00.000+03:00", "replies_count": 0, "uuid": "fcdb5dedb4f85636a144f42e5733c58304218c5d"}, "author": "TomPegden", "url": "http://www.leicestermercury.co.uk/mattioli-woods-boss-says-uk-economy-is-robust-enough-to-enable-brexit-to-happen/story-29751643-detail/story.html", "ord_in_thread": 0, "title": "TomPegden published Mattioli Woods boss says UK economy is robust enough to enable...", "locations": [], "entities": {"persons": [{"name": "mattioli woods", "sentiment": "negative"}, {"name": "tompegden | poste", "sentiment": "negative"}, {"name": "tompegden", "sentiment": "negative"}, {"name": "grove park", "sentiment": "none"}, {"name": "roy coley", "sentiment": "none"}, {"name": "tom pegden", "sentiment": "none"}, {"name": "peter soulsby", "sentiment": "none"}, {"name": "pick everard", "sentiment": "none"}, {"name": "ian mattioli", "sentiment": "none"}, {"name": "mattioli", "sentiment": "none"}, {"name": "bob", "sentiment": "none"}, {"name": "woods", "sentiment": "none"}, {"name": "bob woods", "sentiment": "none"}, {"name": "joanne lake", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "newmarket", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "new walk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "grove park", "sentiment": "none"}, {"name": "buckingham", "sentiment": "none"}, {"name": "east midlands", "sentiment": "none"}, {"name": "west midlands", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "welford road", "sentiment": "none"}, {"name": "glasgow", "sentiment": "none"}, {"name": "mattioli woods", "sentiment": "none"}], "organizations": [{"name": "aberdeen", "sentiment": "none"}, {"name": "leicestershire companies", "sentiment": "none"}, {"name": "leicester tigers", "sentiment": "none"}, {"name": "leicester city council hq", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "mc trustees", "sentiment": "none"}, {"name": "bank of england", "sentiment": "none"}, {"name": "european commission", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Mattioli Woods boss says UK economy is robust enough to enable Brexit to happen By TomPegden | Posted: September 27, 2016 0 COMMENTS SHARES Mattioli Woods boss says UK economy is robust enough to enable Brexit to happen X \nCopy link to paste in your message / Comments (0) \nBusiness Editor Tom Pegden catches up with the team at one of the county's most successful businesses, Mattioli Woods \nIt's been a remarkable year for the service sector. Things were looking up in the first half as the economy continued to move out of the doldrums following the credit crunch. \nThen came the EU referendum and everyone started to get very, very nervous. \nWhat would be the impact on financial institutions reliant on maintaining confidence among customers? Related content Mattioli Woods to benefit from Brexit \nWould the big banks relocate to Europe if and when we decided to quit the EU? Would recruitment slow or even contract if we voted to leave? \nChief executives were edgy to say the least, not least following the horror scenarios coming out of Government, the Bank of England and, obviously, the European Commission. \nWhen the Brexit vote finally came, many thought it was the end of the world. \nThe stock markets dipped, but have bounced back. The economy didn't crumble. \nWhatever is coming over the next two to five years, businesses haven't significantly contracted and employment continues to rise. \nOne company that has fared even better than most is Mattioli Woods – 128 on our 2016 list of Top 200 Leicestershire Companies, and destined to be even higher this time next year. \nEarlier this month, the Grove Park-based wealth management and employee benefits business announced a massive jump in revenues and profits on the back of organic growth, acquisitions and a broader offering of services. \nThe business grew 25 per cent in the year to May 31, with revenue up to £43 million from £34.6 million a year earlier. \nAdjusted earnings before interest, tax, depreciation and other costs were £9.3 million – up from £7.4 million. \nTotal assets under management were also significantly up by 22.2 per cent to £6.61 billion, compared with £5.41 billion a year earlier. \nIt couldn't have come at a better time for the business, launched by chief executive Ian Mattioli and outgoing chairman Bob Woods in Hinckley in 1991, which floated on the Alternative Investment Market 11 years ago. \nMattioli Woods is continuing to take on people and looking forward to making an even bigger impression on the city's business and its sporting communities. \nThis season it struck a deal to sponsor the east stand at Leicester Tigers' Welford Road ground. \nMattioli Woods' branding has also gone onto the team's home and away playing kits. \nThe business is also planning to relocate to new offices on the site of the former Leicester City Council HQ in New Walk. \nIt will occupy 50,000 sq ft of offices in the new development, and hopes to be settled in within a year-and-a-half. \nThe business has expanded from 400 to 500 staff in the past year, with 320 in Leicester. The new offices have space for 665 employees. \nMr Mattioli said: \"We work really hard at what we do and the group has continued to grow. \n\"These are the best results to date. We used to grow at 50 or 60 per cent a year, but you can do that when revenues are at £100,000. This is a whole new level.\" \nMattioli Woods now has offices around the UK, including Aberdeen, Buckingham, Glasgow, London and Newmarket. \nThe wealth management services it offers embrace pensions and personal investment, coupled with estate planning. \nThe firm's graduate and apprenticeship team has also grown and it has a policy of bringing in ex-service people and people looking for a career change. It takes on around 50 trainees a year. \nMr Mattioli said the relocation to New Walk would bring a whole new impetus, not just to the business but to the city's service sector as a whole, following years of companies – just like Mattioli Woods – moving to out-of-town office parks. \nHe said: \"We are still not out of the ground in New Walk, but it's all looking really exciting and it's also great that there are local people working on the new offices – such as [developer] Roy Coley and [Leicester property consultants] Pick Everard. \n\"Leicester mayor Sir Peter Soulsby has been fantastic. \n\"We are all really excited and the move will bring millions of pounds of salaries back into the city. \n\"The building itself is a couple of weeks out of sync with the time scale, but they believe they will catch up so we will be in within 18 months. We need to be because we are running out of space. \n\"Having said all that, Grove Park is a great location and central to the whole of the UK, with great parking. \n\"We will be here in Grove Park for 18 months then will look for new tenants here. We have already had some interest from businesses coming into the area. \n\"The move will see us go from 25,000 to 50,000 sq ft, although we might only be using 40,000 sq ft on day one. \n\"That part of town around New Walk is really exciting. Leicester is my home and my first job was in New Walk.\" \nThis year's growth was helped by five acquisitions, including the purchase of West Midlands pensions business MC Trustees this month for £2.2 million. \nIt provides pension administration and trustee services to more than 1,500 self-invested personal pension and small self-administered scheme clients, with more than £400 million of assets under administration. Last year it made a profit before tax of £400,000 on revenues of £1.6 million. \nMr Mattioli said: \"This acquisition is another important step forward for Mattioli Woods. \n\"MC Trustees is a great fit culturally and strategically, serving a similar client base to our existing business, while complementing our operations in the East Midlands. \n\"The MC Trustees team has a proven ability to win high-quality new business.\" \nOn the matter of Brexit, Mr Mattioli said there had been a mixed reaction from their clients. \nHe said: \"Some initially panicked, but are no longer panicking and there is now acceptance that there will be change. \n\"People do not like change, but adapt to it over time. The UK economy is robust enough to enable Brexit to happen and we continue to be successful. \n\"Leicester is multi-cultural, open and honest. It likes trade and fairness and that's not going to disappear. \n\"We've just had a new acquisition which brings with it £400 million of assets under management and we will have seen some growth since Brexit in existing assets because the stock markets have moved up. \n\"We always try to plan for the good and plan for the bad, so nothing comes at us unexpectedly. \n\"We look after other people's money and do that through a whole network of really passionate people who understand, and get involved in the markets and the thinking behind the markets.\" \nJoanne Lake, who will become non-executive chairman when Mr Woods retires this year, said she was looking forward to the challenges ahead. \nShe said: \"It's a fantastic time to be able to step into Bob's shoes. \n\"There are so more opportunities for the group than ever. \n\"We have just posted a record set of results and the proposition we offer is better than it's ever been.\"", "external_links": [], "published": "2016-09-27T13:22:00.000+03:00", "crawled": "2016-09-27T08:57:10.349+03:00", "highlightTitle": ""}