{"organizations": [], "uuid": "19692647eb56373b7b273792f255c35538bccb97", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14134259.ece/ALTERNATES/s1200/JS140491559.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14132467", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Lidl claims crown in supermarket battle for biggest Christmas sales rise", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T10:10:00.000+02:00", "replies_count": 0, "uuid": "19692647eb56373b7b273792f255c35538bccb97"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14132467", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Lidl claims crown in supermarket battle for biggest Christmas sales rise", "locations": [], "entities": {"persons": [{"name": "lidl", "sentiment": "negative"}, {"name": "brian brick", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}], "organizations": [{"name": "coreena ford moss bros", "sentiment": "negative"}, {"name": "moss bros", "sentiment": "none"}, {"name": "bros", "sentiment": "none"}, {"name": "coreena ford fashion", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford Newcastle's Winn Solicitors sees turnover fall amid personal injury market changes \nWinn Solicitors suffered a fall in turnover last year after tough market conditions led to the business completing fewer cases. \nTurnover at the Byker -based firm fell by 3.2%, from £13.9m to £13.5m for the year ending March 2017. \nThe firm blamed its reduced revenue on uncertainty in the market, caused by the prospect of further legislative changes affecting the personal injury market. \nSpeaking in the accounts, managing director Jeff Winn said: “Winn Solicitors Limited saw another year of stable legal fees per case; however the number of settled files in the year was less than anticipated, largely due to uncertainty created within the market around further legislative changes, resulting in a reduction of turnover. \n“Despite this fall in turnover due to a number of measures put in place during the year, operating profit improved and the directors believe that the company remains in a strong financial position and well placed to move forward if the anticipated legislative changes are introduced.” Jeff Winn Coreena Ford Asda's Halloween advert cleared despite complaints \nA Halloween ad for Asda has been cleared following 62 complaints from viewers that it should have been given a timing restriction and distressed their children. \nThe television ad showed green lightning entering a house where a young girl dressed as a witch was standing in front of a mirror, followed by her dancing with jerky movements as her eyes glowed green. \nIt then showed adults dancing in the same style and the girl’s eyes changing into the Asda logo. \nThe Advertising Standards Authority (ASA) said many of the 62 complainants reported that their young children had been distressed by the ad. Asda said the advert was intended to be fun and to represent a typical social gathering at Halloween. \nIt said the ad did not feature any scenes that were “gory” or show blood or people who were visibly distressed, or anything that was likely to make the audience “jump”. \nThe ASA said that while the movements and demeanour of the characters, as well as the green eyes, made reference to tropes from scary films, they were presented in a context of fun and enjoyment as they performed a choreographed dance routine. \nHowever, it noted that a large number of complainants said their children had been upset by the ad. The Halloween ad for Asda. 9.00 Coreena Ford Demolition contracts spark huge £11m growth for the MGL Group \nConstruction and demolition company The MGL Group has boosted its turnover by £11m after winning a series of major contracts. \nThe Durham-headquartered group saw its turnover soar by 20% from £55.1m to £66.1m for the year ending March 2017. \nThe group’s demolition arm, MGL Demolition Limited, fuelled the turnover growth after winning a large contract in Barrow. The new contract helped sales from demolition and plant hire work grow from £13.4m to £21.9m. \nMGL’s asphalt division also grew by 1.8% to £15.2m, while its civil engineering arm jumped 8.4% to £29m. \nIn the company accounts, group finance director Gary Smith said: “During the year MGL Demolition was appointed as a principal contractor to BAE System on a large refurbishment scheme, which remains ongoing and Rainton Construction in June 2017 were successful in retaining the Durham County Council annual surfacing contract for a period of up to four years. \n“As a result of this the directors believe the group is well placed for the next financial year with strong order books throughout all businesses and expect the group to remain profitable for the forthcoming financial year and beyond.” \nThe contract wins also allowed MGL to grow its operating profit, which jumped from £2.6m to £3.1m. The MGL Group has boosted its turnover by £11m (Image: MGL Group) 8.53 Coreena Ford Moss Bros share price plummets as CEO warns of ' extremely challenging' year ahead \nMoss Bros shares fell as much as 22% after its profit warnings, later settling around 17% lower. \nBrian Brick, chief executive of Moss Bros, said: “We faced a very tough December trading environment, which led to a significant reduction in store footfall and a hardening of the corresponding competitive environment in which we operate. \nThis, coupled with strong cost headwinds and a desire to protect margins, led to a disappointing year-end shortfall to sales and subsequently to our anticipated profits for the full year. \nIn common with many UK retailers, the year ahead looks like being an extremely challenging one, not least because of the uncertain consumer environment, wider political backdrop and significant cost headwinds we face from a weaker pound, business rates and increasing employee related costs.” 8.50 Coreena Ford Fashion retailer Moss Bros issues profit warning \nMenswear retailer Moss Bros has warned over profits after a tough December saw fewer shoppers visit its stores. \nIt warned 2018 earnings will also be hit in an “extremely challenging” year ahead. \nThe group said like-for-like store sales had slumped 8% since the start of December amid intense competition on the high street as retailers slashed prices to offset tough trading. \nIt saw overall retail comparable sales edge 0.4% higher in the 23 weeks of its second half to January 6 thanks to a 12.3% leap in online sales and a better performance in stores between August and November. \nBut the poor trading over the crucial festive period means it now expects full-year profits for the year to the end of January to come in slightly below market expectations, at between £6.5 million and £6.8 million. \nIt added that profits for 2018-19 are also expected to be impacted as it plans to continue investing in the business in the face of ongoing high street woes. Moss Bros joins a growing list of high street firms that have suffered amid a highly promotional and difficult December, with profit warnings from Debenhams last week and Mothercare on Monday. A Moss Bros' fashion campaign. 8.47 Coreena Ford Taylor Wimpey toasts 'solid' housing market \nHousebuilding giant Taylor Wimpey has said Britain’s property market remains “solid” despite wider economic uncertainty. \nIn a full-year trading update, the group reported a 5% rise in completions to 14,541 over 2017, while average prices on private sales lifted 3% to £296,000. Taylor - the UK’s third biggest housebuilder - said it saw “good demand and trading” throughout 2017 and expects further growth in the year ahead. \nIts bullish remarks come in spite of mounting worries over a housing market slowdown after a run of recent downbeat reports. \nThe latest data from mortgage group Halifax showed the first monthly decline for six months in December as falling wages and Brexit fears weighed. \nIt said house prices fell 0.6% month-on-month in December, following a 0.3% increase in both October and November. Taylor Wimpey signs at a housing development 8.40 KEY EVENT 6,000-jobs to be created with plan for Aykley Heads site in Durham \nA ‘once in a generation’ scheme that could create 6,000 new jobs and deliver a £400m boost to the local economy has been outlined . \nDurham County Council plans to demolish its headquarters at Aykley Heads and develop the site as a centre for high-tech and high-paying jobs. \nThe council would invest up to £50m in a new h", "external_links": [], "published": "2018-01-10T10:10:00.000+02:00", "crawled": "2018-01-10T11:02:01.011+02:00", "highlightTitle": ""}