{"organizations": [], "uuid": "8f6f77695272a3eb4804f0a561fecd43e69cf654", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.bristolpost.co.uk/incoming/article1001319.ece/ALTERNATES/s1200/Celebrity-Big-Brother-eye-revealed.jpg", "site_section": "http://www.leicestermercury.co.uk/rss.xml", "section_title": "leicestermercury - frontpage", "url": "http://www.leicestermercury.co.uk/news/celebs-tv/female-celebrity-big-brother-contestants-1001233", "country": "GB", "domain_rank": 48128, "title": "What time does Celebrity Big Brother 2018 start? And who has been confirmed so far?", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T18:04:00.000+02:00", "replies_count": 0, "uuid": "8f6f77695272a3eb4804f0a561fecd43e69cf654"}, "author": "leicestermercury", "url": "http://www.leicestermercury.co.uk/news/celebs-tv/female-celebrity-big-brother-contestants-1001233", "ord_in_thread": 0, "title": "What time does Celebrity Big Brother 2018 start? And who has been confirmed so far?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "cbb", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "What time does Celebrity Big Brother 2018 start? And who has been confirmed so far? Everything you need to know about CBB January Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nCelebrity Big Brother is back, but what's the theme of series 21? Who is in the line-up? And what's the shock twist promised by Channel 5 bosses? \nAll will be revealed in due course. For the time being, here's everything you need to know about Celebrity Big Brother 2018... When does Celebrity Big Brother 2018 start? \nThe series will start tonight (Tuesday 2 January 2018) at 9pm on Channel 5. The launch show finishes at 10.30pm, then Celebrity Big Brother's Bit On The Side starts at 11.35pm for 55 minutes. What's the theme of CBB 2018? \nThis month will see the first ever all-female Celebrity Big Brother line-up - at least to start with. \nChannel 5 bosses have declared that they will be celebrating the centenary of women's suffrage - when some women were granted the vote in 2018 - by pulling in a batch of female celebrities. \nIn their announcement, CBB producers said: \"In January 2018, as the nation marks 100 years since women won the right to vote for the very first time, Celebrity Big Brother launches this series with an all-female cast of celebrity housemates in a salute to a centenary of women's suffrage on Channel 5.\" Sarah Harding won the last series of CBB in summer 2017 \nHowever, male celebrities will be added to the line-up throughout the duration of the series. \n\"Presented by Emma Willis, Celebrity Big Brother will initially explore how the all-female housemates interact, from politicians to performing artists, as they enter the house first, ahead of the celebrity male housemates,\" the producers went on. \n\"Over the course of the series, as the male counterparts enter the house, the housemates will take part in a series of entertaining tasks and hidden experiments which will test their - and our - assumptions, challenge gender stereotypes and reveal fascinating truths about what it is to be a woman - and man - in the 21st century. \n\"See what happens when women hold the power, as Celebrity Big Brother January 2018 is set to be celebratory, surprising and insightful.\" What's the CBB 2018 logo? CBB logo \nThe Celebrity Big Brother eye has undergone a whole makeover since the last series, this time sporting a colourful iris and thick eyelashes. \nIt's made to look like a woman's eye, with a lick of eyeliner and even mascara to make it pop. \nBut right at the centre of the pupil is a camera lens - to remind the housemates that Big Brother is always watching... How to watch Celebrity Big Brother live \nYou can tune in to Channel 5 on the telly or watch live on Demand 5 from your PC or mobile device. \nIf you miss any episodes you can catch up on Demand 5 online 24 hours later. How long is Celebrity Big Brother on for? \nThe celeb edition of the Big Brother series is always shorter than BB and usually lasts about a month. \nIt doesn't sound long but it's plenty of time for stars to make a fool out of themselves. \nThe summer CBB 2017 was the shortest series since 2013 lasting just 25 days. Who will be in CBB 2018? Time Line Who will be in CBB 2018? Rachel Johnson is confirmed! \nThe first Celebrity Big Brother housemate has been confirmed as journalist Rachel Johnson. \nFormer The Lady editor Rachel, 52, is the sister of Foreign Secretary Boris Johnson and daughter of I'm A Celebrity favourite Stanley Johnson . \nChannel 5 announced her involvement in the reality show, tweeting: \"We can confirm that journalist RachelSJohnson will be one of the female Celebrity Big Brother housemates entering the House live at 9pm, Tuesday 2nd January on channel5_tv!\" \nRachel is married to National Trust director Ivo Dawnay and has three children. Jonny Mitchell \nThe handsome Love Island hunk, 26, was snapped up by Channel 5 bosses after becoming single again earlier this month when he split from Stephanie Pratt. \nAs the first male contestant to be confirmed for the new series, producers hope he'll be his typical flirtatious self and create sexual tension in the infamous surveillance house. \nFamous for his appearance on Love Island, we're pretty confident he'll be able to do that. \nEspecially after he deftly demonstrated his skills with Camilla Thurlow . Malika Haqq \nKhloe Kardashian's best pal Malika Haqq, 34, has reportedly been spotted at Heathrow Airport ahead of the show's launch. \nMalika, who has been close friends with Khloe Kardashian since they were 15, is believed to have been paid a \"huge amount\" to appear on the show. \nMalika used to be Khloe's PA but now appears on a number of reality TV series including Real Husbands of Hollywood, Dash Dolls and Hollywood Divas. She is also a brand ambassador of Pretty Little Things. \nHer entrance into the CBB house has come at a perfect time for Kardashian fans, who will hope that Malika will let slip some gossip on the sisters' pregnancies. Charlotte Leslie \nThe Tory politician was the member of parliament for Bristol North West - until she lost her seat in June's snap election, which serendipitously freed her up to do CBB. \nThe pro- Brexit Conservative is said to be earning a six-figure fee for her appearance, which will surely pay for her Christmas. \nThe 39-year-old was once named the \"sexiest MP in parliament\" and is a keen swimmer, so we suspect she'll do well. \nOriginally born in Liverpool, she was formerly the editor of think-tank magazine Crowwbow. India Willoughby \nTransgender newsreader India, 51, is also said to be joining the line-up. \nShe had a successful career as a regional newsreader but, born Jonathan, felt she was in the wrong body from a young age. \nShe underwent full gender reassignment surgery last year and got a job again with ITV Border in Cumbria, where she had once worked as Jonathan. \nWilloughby has previously said: \"Growing up there was only about 50 per cent of me that was actually alive. It's such a complex subject being transgender to explain. \n\"When I was young I was aware something wasn't quite right. I was about three or four but I didn't know it was gender.\" Louise Thompson \nThe Made in Chelsea star is set follow in the footsteps of her younger brother, Sam Thompson, who took part in last summer's Celebrity Big Brother. \nLouise, 26, has been a regular on the E4 series since joining back for the second season back in 2011 but could be swapping the streets of SW3 for the Borehamwood bungalow. \nShe recently revealed how her \"unhealthy\" relationship with alcohol would see her drink until she blacked out when she first started on Made In Chelsea. \nBut potential housemates better watch out, as Louise will be keeping them up with her snoring. \nRyan Libbey revealed that he has to wear ear plugs because his girlfriend is so loud. \nHe said: \"She's a little terror for snoring. It's shocking for someone so sweet and little to snore as much as she does!\" Sinit", "external_links": [], "published": "2018-01-02T18:04:00.000+02:00", "crawled": "2018-01-02T19:10:36.001+02:00", "highlightTitle": ""}