{"organizations": [], "uuid": "123f82e121498989a79ff8fa827f8a4dca4f5501", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/business/article1079336.ece/ALTERNATES/s1200/robindaniels.jpg", "site_section": "http://www.devonlive.com/rss.xml", "section_title": "devonlive - frontpage", "url": "http://www.devonlive.com/news/business/meet-new-boss-devon-cornwall-1079306", "country": "US", "title": "Meet the new boss of the Devon and Cornwall Business Council", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T18:20:00.000+02:00", "replies_count": 0, "uuid": "123f82e121498989a79ff8fa827f8a4dca4f5501"}, "author": "Hannah Finch", "url": "http://www.devonlive.com/news/business/meet-new-boss-devon-cornwall-1079306", "ord_in_thread": 0, "title": "Meet the new boss of the Devon and Cornwall Business Council", "locations": [], "entities": {"persons": [{"name": "devon", "sentiment": "none"}, {"name": "devo", "sentiment": "none"}, {"name": "robin daniels", "sentiment": "none"}, {"name": "daniels", "sentiment": "none"}, {"name": "ben rhodes", "sentiment": "none"}], "locations": [{"name": "devon", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}], "organizations": [{"name": "cornwall business council", "sentiment": "none"}, {"name": "cornwall business council meet", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "plymouth science park", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Meet the new boss of the Devon and Cornwall Business Council Share Dr Robin Daniels, new CEO of Devon and Cornwall Business Council based at Plymouth Science Park. Share   \nTaking an astronaut’s eye view of the South West is key to identifying its strengths, says the new boss at Devon and Cornwall Business Council. \nDr Robin Daniels, the founder of Plymouth’s Redpill , a consultancy that specialises in innovation and growth for cities, companies and universities, took up the post of chief executive at the beginning of January. \nHe replaces Ben Rhodes who left last year. \nAnd he says that creating a strong identity is vital to putting the regional on a national and international stage. Read More \nHe said: “I have started by imagining looking down on the South West from space and thinking about what makes it exciting and special. The Met office supercomputer has been heralded as a major driver for growth in Exeter \n“There are world class areas of expertise in any area of the UK and the more areas that set us apart as a region, the better.” \nDr Daniels was the founding CEO at Norwich Research Park, Europe’s largest single-site life science park and founding COO of the Centre for Scientific Enterprise Ltd, a joint venture between London Business School and University College London. \nWith a track record of leading rapid business growth and innovation across technologies, sectors and countries, he believes that it’s vital to pull together the region’s strengths from food and farming, tourism and technology. Read More \nHe said it is ‘not enough’ to rely on the quality of life message in the South West. Quality of life makes the region attractive but people need good jobs as well \n“People who are born in the South West would really like too stay but tend to leave in search of the right jobs. \n“Our job is to support the creation of high quality jobs right here so we can retain and attract talented people.” \nA brand identity like the Northern Powerhouse or Midlands Engine has paid dividends for campaigners. Read More Business park expansion plans to create 50 new jobs \nHe said: “There is no doubt that HS2 has come about through lobbying and I do think that creating an identity and branding is very powerful. \n“If we had an equivalent big economic engine in the South West, then I think that would better our chances for railway investment.” Damage to the Dawlish rail line in 2014 \nInfrastructure remains a key priority for the business council alongside digital connectivity – including 5G – to help the region leapfrog its road and rail challenges. \n“Grand challenges for us continue to be infrastructure and innovation and we also plan to set up specialist interest groups to look at marine and maritime, technology including AI and VR and the skills agenda. \n“Brexit is the biggest challenge we face in the short term because it is an unknown. \n“The best antidote to that is ‘do it anyway’, carry out the plans you have for your business because the best outcome is that you are better prepared for what lies ahead.” \nDr Daniels said his first job will be to go out and talk to members about their priorities and how the DCBC can improve. \nHe said: “The role of the DCBC is about taking the region out into the world while supporting small business at the same time. \n“By joining the dots between these pockets of opportunity, we can create a strong identity for the South West and DCBC has a vital role to play.” Like us on Facebook", "external_links": [], "published": "2018-01-17T18:20:00.000+02:00", "crawled": "2018-01-17T19:54:43.025+02:00", "highlightTitle": ""}