{"organizations": [], "uuid": "8599023840e5a8cb0e3cca4395ce5373f7dc3f32", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14224519.ece/ALTERNATES/s1200/Bad-behaviour-cuts-learning-time.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/teacher-crisis-more-more-staff-14224095", "country": "GB", "domain_rank": 21960, "title": "Teacher crisis: Why are more and more staff leaving the profession?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T07:00:00.000+02:00", "replies_count": 0, "uuid": "8599023840e5a8cb0e3cca4395ce5373f7dc3f32"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/teacher-crisis-more-more-staff-14224095", "ord_in_thread": 0, "title": "Teacher crisis: Why are more and more staff leaving the profession?", "locations": [], "entities": {"persons": [], "locations": [{"name": "north east", "sentiment": "none"}], "organizations": [{"name": "national audit office", "sentiment": "none"}, {"name": "department for education", "sentiment": "none"}, {"name": "commons public accounts committee", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Teachers are quitting the profession because of a heavy workload (Image: PA) Share Get daily   \nTeachers are quitting the profession because of a heavy workload, leaving schools with a staff shortage as pupil numbers increase. \nThe teacher shortage is contributing to a “growing sense of crisis for schools”, MPs have warned. \nIn the North East, 16% of secondary headteachers say they have vacant posts, up from 11% in 2010, a study by the National Audit Office found. \nAnd it said that “workload is the most important factor” in the struggle to retain teachers. \nThe average classroom teacher and head of department works 54.4 hours a week - the equivalent of almost 11 hours a day if they stuck to a five-day week, though in practice many of them work over weekends too. \nThe Department for Education said there were a record number of teachers in schools and it was looking for ways to cut teachers’ workload. \nBut the Commons Public Accounts Committee, which includes Conservative, Labour and Liberal Democrat MPs, warned: “The failure of the Department to get to grips with the number of teachers leaving puts additional pressure on schools faced with rising numbers of children needing a school place and the teachers to teach them.” Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nMPs on the Committee, including Houghton and Sunderland South MP Bridget Phillipson, said the DfE was spending £555 each year on training new teachers, but was failing to look for ways of encouraging existing teachers to stay in the profession. \nThey said in a new report: “Many teachers have cited heavy workloads as a reason for their departure. At the same time pupil numbers are rising and the Department for Education expects schools to make significant savings from using their staff more efficiently. \n“The Department should have been able to foresee this situation and take action to address it.” \nMPs also raised concern about what appear to be large differences in teaching quality in different parts of the country. \nAn analysis of reports from Ofsted found that 24% of North East secondary school pupils, almost one in four, were in schools rated as less than good in 2016. \nThis is lower than in other parts of the North of England, but higher than in the South. \nThe Committee said: “In five of the nine English regions, all in the Midlands or the North of England, more than 20% of pupils were in secondary schools rated as requires improvement or inadequate for teaching, learning and assessment.” \nAnd it added: “The Department could not explain why the quality of teaching varies so much across the country, and what action it would take to improve quality in the Midlands and the North of England in particular.” Labour Party's Bridget Phillipson (Image: PA) \nMs Phillipson said: “Today’s report confirms the fears I raised last year about the plummeting numbers of secondary school teachers in England and Wales. \n“It’s also clear that the Government is failing to tackle the widening educational divide in our country that has left regions like the North East falling further behind. We need to see a relentless focus on driving up educational standards, teaching quality and leadership in each and every school. \n“Parents will be well aware that schools in the North East are really struggling to recruit and retain experienced teachers. \n“Despite this, not a single one of the Government’s new ‘opportunity areas’ has been created in the North East, and no school in our region has been allocated any new funding as part of this initiative. \n“To make matters worse, our schools are facing an exodus of teachers from the profession, and it’s not clear that ministers have a clue what to do about it. Read More Former Newcastle Council leader John Shipley explains why he wants another Brexit referendum \n“We can’t go on like this. Our children only get one shot at a decent education; ministers should be doing all they can to give them the best possible start in life.” \nA Department for Education spokesperson said: “There are now a record number of teachers in our schools – 15,500 more than in 2010 – and last year, despite a competitive labour market with historic low unemployment rates and a growing economy, 32,000 trainee teachers were recruited. \n“Retention rates have been broadly stable for the past 20 years, and the teaching profession continues to be an attractive career. Read More Labour council leaders warn party National Executive not to to give them orders \n“We want to continue to help schools recruit and retain the best teachers. We are consulting on proposals to improve and increase development opportunities for teachers across the country and working with teachers, unions and Ofsted to tackle unnecessary workload with specific support for teachers at the start of their careers. \n“Alongside this we continue to offer financial incentives to attract the brightest and best into our classrooms.” Like us on Facebook", "external_links": [], "published": "2018-01-31T07:00:00.000+02:00", "crawled": "2018-01-31T07:44:14.000+02:00", "highlightTitle": ""}