{"organizations": [], "uuid": "d6864ace7d83c9672dc9bc3596e659444c043005", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14106342.ece/ALTERNATES/s1200/Brexit.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/minister-assures-north-east-over-14106299", "country": "GB", "domain_rank": 21960, "title": "Minister assures North East over post-Brexit cash to help make up for lost EU millions", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T15:00:00.000+02:00", "replies_count": 0, "uuid": "d6864ace7d83c9672dc9bc3596e659444c043005"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/minister-assures-north-east-over-14106299", "ord_in_thread": 0, "title": "Minister assures North East over post-Brexit cash to help make up for lost EU millions", "locations": [], "entities": {"persons": [{"name": "peter jackson", "sentiment": "none"}, {"name": "jackson", "sentiment": "none"}, {"name": "jake berry", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "northumberland county council", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "northern powerhouse", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "EU and Union flags (Image: PA) Share Get daily   \nA leading North East Tory politician has welcomed personal assurances from the Government it will compensate the region for the loss of EU cash after the UK leaves Europe. \nHowever Coun Peter Jackson, the leader of Northumberland County Council , said he will still campaign for fully devolved, local control over structural funding post- Brexit which could be worth hundreds of millions to our region. \nHe wrote to Northern Powerhouse Minister Jake Berry following a motion at full council regarding new funding which will be available when the country leaves the EU. From 2014 to 2020 the region will receive £420m from Europe. Read More Newcastle seeks assurances about £80 million European Union funding \nCoun Jackson said: “Since Britain joined the EU, Structural Funds have co-financed a vast range of initiatives in Northumberland to promote economic growth, particularly in older industrial areas. \n“With Brexit, that source of funding will disappear but we welcome the Government’s commitment to match that by establishing a UK Shared Prosperity Fund as a potential source of new funding. \n“However, several issues are unresolved that could play a pivotal role in delivering growth and jobs in the places that need this the most.” Councillor Peter Alan Jackson, leader of Northumberland Council (Image: Newcastle Chronicle) \nAt full council, members agreed with the Industrial Communities Alliance the following proposals be incorporated into the structure of the new UK Shared Prosperity Fund: \n• The fund’s budget should be set at a level that not only compensates for the loss of EU funding (£1.5bn a year) but also provides additional resources to match the scale of the challenge to deliver growth and prosperity across Britain. \n• The fund should focus on narrowing local and regional differences in economic well-being. \n• Local authorities should have a strong hand in the management of the new fund as they are most closely attuned to local needs and should take the key decisions about spending priorities. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nCoun Jackson has now had a response from the Northern Powerhouse Minister on behalf of Government in which he recognises local areas require certainty over funding and says the Government plans to consult with local authorities and local enterprise partnerships on priorities for the new fund. \nThe council leader added: “It is my priority to put Northumberland first, particularly given the north-south divide which, post-Brexit, will be of importance to the whole country. \n“It is crucial we have local control over this funding so it can be used to benefit our county through regeneration projects, business and jobs. \n“The new Shared Prosperity Fund must have at its heart a mission to bridge the gap in the economic fortunes between the south and the north of our country.” Like us on Facebook", "external_links": [], "published": "2018-01-03T15:00:00.000+02:00", "crawled": "2018-01-03T16:01:42.079+02:00", "highlightTitle": ""}