{"organizations": [], "uuid": "1322b435c9252a744711e841a1f792ac8d5b62b7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.nottinghampost.com/incoming/article821245.ece/ALTERNATES/s1200/This-Morning-TV-show-London-UK-14-Nov-2016.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/news/celebs-tv/valid-uk-passport-still-not-1100311", "country": "US", "domain_rank": 48128, "title": "Why a valid UK passport may still not be accepted abroad according to Money Saving Expert Martin Lewis - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.993, "site_type": "news", "published": "2018-01-22T15:03:00.000+02:00", "replies_count": 0, "uuid": "1322b435c9252a744711e841a1f792ac8d5b62b7"}, "author": "Katie Fitzpatrick", "url": "http://www.leicestermercury.co.uk/news/celebs-tv/valid-uk-passport-still-not-1100311", "ord_in_thread": 0, "title": "Why a valid UK passport may still not be accepted abroad according to Money Saving Expert Martin Lewis - Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "martin lewis", "sentiment": "negative"}, {"name": "martin lew", "sentiment": "negative"}, {"name": "narstie", "sentiment": "none"}, {"name": "martin", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}], "organizations": [{"name": "itv", "sentiment": "none"}, {"name": "manchester evening news", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Why a valid UK passport may still not be accepted abroad according to Money Saving Expert Martin Lewis You might need to check before you travel Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nPacking a valid UK passport might not be enough to ensure you can enter a country when travelling, consumer rights expert Martin Lewis has warned. \nBecause the rules in place in many countries require people's passports to be well within date. \nMany borders will refuse access to UK passport holders if they have documentation that's set to expire in the space of a few months. \nThe Money Saving Expert appeared on ITV's This Morning to warn travellers to renew their passports in good time, reports the Manchester Evening News . \nMartin recalled one case when parents had to return home from their planned trip because their child only had two months left on their passport. Read More 'Bag of snow': Watch Big Narstie's hilarious Good Morning Britain weather forecast \nMost countries require that passports should have at least six months of validity when traveling internationally and will not permit a traveller to enter the country unless their passport is set to expire at least six months after the final day of travel. \nMartin said: “Check the expiry date and if it’s less than six months you need to go about renewing it.” \nThe new navy passports introduced after Brexit will be phased in slowly, but current British passport holders will able to continue using their burgundy passports until they expire. \nMartin also urged people to check the expiry on their European Health Insurance Card, which gives travellers the right to access state-provided healthcare during a temporary stay in another European Economic Area country or Switzerland. Read More \nThe EHIC covers treatment that is medically necessary and covers the treatment of pre-existing medical conditions and routine maternity care. \nTravellers can apply for or renew an EHIC online free of charge at ehic.org.uk Like us on Facebook", "external_links": [], "published": "2018-01-22T15:03:00.000+02:00", "crawled": "2018-01-22T16:10:47.003+02:00", "highlightTitle": ""}