{"organizations": [], "uuid": "9cdf93dd46a6b36ef3101e2670065d2180c613a1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article10689961.ece/ALTERNATES/s1200/JS79696767.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/south-tyneside-shipbuilder-ap-sinks-14107909", "country": "GB", "domain_rank": 21960, "title": "South Tyneside shipbuilder A&P sinks into the red after disappointing year", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T15:26:00.000+02:00", "replies_count": 0, "uuid": "9cdf93dd46a6b36ef3101e2670065d2180c613a1"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/south-tyneside-shipbuilder-ap-sinks-14107909", "ord_in_thread": 0, "title": "South Tyneside shipbuilder A&P sinks into the red after disappointing year", "locations": [], "entities": {"persons": [{"name": "john carey", "sentiment": "none"}, {"name": "hebburn", "sentiment": "none"}], "locations": [{"name": "south tyneside", "sentiment": "none"}], "organizations": [{"name": "a&p", "sentiment": "negative"}, {"name": "navy", "sentiment": "none"}, {"name": "ap group limited", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "South Tyneside shipbuilder A&P sinks into the red after disappointing year The Hebburn shipyard is currently building sections of the Navy's Astute class submarines Share Click to play Tap to play The video will start in 8 Cancel Play now Get business   \nEngineering and ship repair company AP Group Limited made a loss of £22,000 last year after a “disappointing” year that included the delay of a major contract. \nTurnover at the Hebburn firm fell 4.8% to £77.6m during the year ending March 31 2017. The fall in turnover had a direct impact on the firm’s bottom line, which fell from a profit of £2.7m in 2016 to a loss of £22,000 last year. \nSpeaking in the company accounts director John Carey said the revenue dip was due to the delay of a major contract. \nHe said: “The decrease in turnover and in profitability arises in part due to the ongoing depressed commercial ship repair market coupled with ongoing delays in the commencement of a significant contract which was originally expected to commence in January 2016.” Read More Jobs hopes as Hebburn's A&P yard named 'strong contender' to build Navy frigates \nAP’s results were also affected by the loss of a contract with the Commonwealth of Australia, which was awarded to the firm’s sister company Atlantic Peninsula Australia Pty Limited. The contract was worth £6.4m in turnover and £1.1m in operating profit each year. \nMr Carey added: “These results are regarded as disappointing although the expectations at the beginning of the year were for a difficult economic climate to affect profitability, a tight market in the core shop repair business, and little activity in the offshore sector. \n“These factors couple with a significant decrease in activity in the oil and gas sector has placed greater emphasis on the need to concentrate on the core larger ticket shop repair and conversion activities and secure significant fabrication contracts, whilst improving performance in respect of previously acquired long term work.” Read More UK facing 'skills emergency' while politicians focus on Brexit, CBI claims \nHowever, the firm saw success in its North East division which won a contract to build sections of the Astute Class submarines. AP then used this experience to win a £10m contract to build further submarine modules. \nIn October AP was also named as a “strong contender” to build a new fleet of Navy frigates when the company hosted then Defence Secretary Sir Michael Fallon at its Hebburn shipyard. \nIf AP wins the contract it would be involved in the building of five Type 31E frigates. The warships would be built in blocks across several British shipyards and then assembled at a central hub. \nThe year covered by the accounts saw the company’s headcount drop from 544 to 513, taking £1.5m off the firm’s staff costs. Like us on Facebook", "external_links": [], "published": "2018-01-03T15:26:00.000+02:00", "crawled": "2018-01-03T16:09:59.025+02:00", "highlightTitle": ""}