{"organizations": [], "uuid": "b096de50d7b0ada8705d77c459fd733867ba1d0d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article265003.ece/ALTERNATES/s1200/Electrification.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/news/business/midland-mainline-upgrade-continues-despite-1068239", "country": "US", "domain_rank": 48128, "title": "Midland Mainline upgrade continues despite contractor Carillion going into liquidation - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.261, "site_type": "news", "published": "2018-01-15T18:35:00.000+02:00", "replies_count": 0, "uuid": "b096de50d7b0ada8705d77c459fd733867ba1d0d"}, "author": "Tom Pegden", "url": "http://www.leicestermercury.co.uk/news/business/midland-mainline-upgrade-continues-despite-1068239", "ord_in_thread": 0, "title": "Midland Mainline upgrade continues despite contractor Carillion going into liquidation - Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "carillion", "sentiment": "negative"}, {"name": "carillio", "sentiment": "negative"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "midlan", "sentiment": "none"}], "organizations": [{"name": "leicester mercury news midland mainline", "sentiment": "negative"}, {"name": "midland mainline", "sentiment": "negative"}, {"name": "invalid email  network rail", "sentiment": "none"}, {"name": "network rail", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Midland Mainline upgrade continues despite contractor Carillion going into liquidation Carillion has billions of pounds of public sector contracts, from work on HS2 to managing schools, prisons and health services Share Click to play Tap to play The video will start in 8 Cancel Play now Get Business   Thank you for subscribing!   \nNetwork Rail is trying to ensure work upgrading the Midland Mainline continues despite contractor Carillion going into liquidation. \nNationally 20,000 jobs are at risk after the construction giant collapsed with debts of around £1.5 billion. \nCarillion has billions of pounds worth of public sector construction contracts up and down the UK with the likes of the HS2 high-speed rail line and Network Rail, as well as managing many of our schools, prisons and health support services. \nThe business is still being run as a going concern while in the hands of the official receivers. \nCloser to home it signed a £62 million, two year deal last November to upgrade the Midlands Mainline from London to Corby. \nCarillion Powerlines – a partnership with Powerlines Group – also won £260 million, three year contract with Network Rail to electrify the mainline. \nDespite transport secretary Chris Grayling cancelling electrification through Leicestershire last July, the joint venture was picked to complete electrification of the route from London to Corby. \nIt won those deals despite the “significant challenges” that culminated in news of the collapse. Staff working on electrified train lines \nA Network Rail spokeswoman said their work with Carillion – which has been involved in the electrification plans since 2014 – would continue “for the time being”. \nShe said when the final contracts were awarded last autumn, Carillion was in “by far the best position to do this with an experienced team already on the ground”. \nBut should Carillion bail out of the £260 million electrification joint venture, she said Powerlines Group would have to step in and complete the project. \nShe said: “ Network Rail does not pay for any work in advance with any contractor, so in the event of insolvency only works completed would be paid for and our contingency plans would enable delivery through another route.” \nDuncan Green, managing partner of the Leicester-based civil engineering consultancy Pick Everard, said repercussions of Carillion’s problems could be devastating for smaller suppliers. \nHe said his company had worked in parallel with Carillion over the years “right across” the public sector. \nBut he said his firm – headquartered in the city’s Charles Street – would not be hit. \nHe said: “It is massively disappointing that a contractor like Carillion can get into this sort of difficulty and it’s sad for the industry as well. \n“They are a huge player, but what we have seen over the past few years is aggressively low pricing policies that Carillion have had – pricing that clearly cannot be sustained. \n“We are OK, but there will be hundreds of companies that are suppliers to Carillion that will be affected and might not have their accounts settled. \n“Some will not be able to sustain that, and no doubt some will go out of business. Read More \n“This is not good news in terms of the UK forging ahead with investment in infrastructure in the face of Brexit. Read More Will Leicester, Loughborough and Harborough get a direct link to proposed HS2 high-speed track? \n“I think the industry would always say there has been too much focus on getting the lowest price, rather than good value and sustainability of service.” \nAlthough Carillion is a huge player within the health service nationally, a spokeswoman for Leicester’s hospitals said they did not work with the business, while the Leicestershire NHS Partnership Trust which provides mental health service, said they had only one member of maintenance staff subcontracted from Carillion. \nChris Hobson, director of policy at East Midlands Chamber said many Carillion projects fed the region - notably the Midlands Mainline south of Corby and the HS2 Phase 1. \nHe said: \"There are many local firms, mostly in the supply chain for major projects elsewhere in the country, which will be impacted by Carillion’s collapse. Read More Battle cry for billions more to improve road and rail links in Leicestershire \n\"The Government has already said that Carillion staff working on Government contracts will continue to be paid but their money will come through the receivers, not from Carillion. \n\"But it’s vital the Government acts immediately, where possible, to reassure the small and medium-sized enterprises in Carillion’s supply chain that the projects will continue, their contracts are safe and their workforces won’t suffer as a result of the collapse.\" Like us on Facebook", "external_links": [], "published": "2018-01-15T18:35:00.000+02:00", "crawled": "2018-01-15T20:13:47.043+02:00", "highlightTitle": ""}