{"organizations": [], "uuid": "e568ff5dce1d739621514b5cabd6701497f88eba", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.plymouthherald.co.uk/whats-on/food-drink/article320145.ece/ALTERNATES/s1200/4730642.jpg", "site_section": "", "section_title": "", "url": "http://www.devonlive.com/news/devon-news/wetherspoon-look-set-open-new-1078005", "country": "US", "title": "Wetherspoon look set to open a new pub in Devon - Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "", "spam_score": 0.147, "site_type": "news", "published": "2018-01-17T14:43:00.000+02:00", "replies_count": 0, "uuid": "e568ff5dce1d739621514b5cabd6701497f88eba"}, "author": "William Telford", "url": "http://www.devonlive.com/news/devon-news/wetherspoon-look-set-open-new-1078005", "ord_in_thread": 0, "title": "Wetherspoon look set to open a new pub in Devon - Devon Live", "locations": [], "entities": {"persons": [{"name": "wetherspoon", "sentiment": "none"}, {"name": "milehouse", "sentiment": "none"}], "locations": [{"name": "devon - devon live wetherspoon", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "plymstock", "sentiment": "none"}, {"name": "plymstock broadway", "sentiment": "none"}, {"name": "britannia inn", "sentiment": "none"}], "organizations": [{"name": "herald", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Wetherspoon look set to open a new pub in Devon It is believed the pub is to take over a disused Co-op supermarket Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nWetherspoon is believed to be about to open a new pub in Devon as it considers taking over a disused Co-op supermarket. \nIf the deal is completed it would be the sixth Wetherspoon in Plymouth, this one on the eastern edge of the city in Plymstock. \nThe chain is reported to be looking at moving into the abandoned former Co-operative supermarket on Plymstock Broadway, which has been empty since March 2014. \nA Weterspoon spokesman told The Herald : “We can’t comment on Plymstock – will let you read into that as you wish.” \nIt did confirm it was not looking at sites elsewhere in Plymouth, however. \nWetherspoon already has five Plymouth outlets: The Union Rooms, Union Street; The Mannamead, Mutley Plain; The Gog and Magog, Barbican; The Britannia Inn, Milehouse; and The Stannary Court, Plympton. \nIt also has The Queen’s Head Hotel in Tavistock. \nWetherspoon is planning to open The King Doniert, in Liskeard, Cornwall, in March 2018. Read More Woman fighting for life after crash ... \nThe firm said: “We have opened more new pubs in recent years and will be opening additional venues throughout the coming year and beyond.” \nWhen Wetherspoon chairman Tim Martin, who founded the company in 1979, visited Plymouth in November 2017, he told The Herald it was still “quite possible” to find more Plymouth sites outside the city centre. \nHe said expansion was driven by a combination of looking at areas where the firm has no presence and reacting to buildings that became available. \nOr as Mr Martin, who lives in the Exeter area and spends a large proportion of his time touring the chain’s pubs, put it: “A bit of targeting and a bit of opportunism.” \nBoth of which apply to Plymstock. \nThe Co-op closed its store at Plymstock Broadway in 2014 with the loss of about 40 jobs. \nThe company said the decision had been taken with “the greatest reluctance” and was due to the store’s poor trading performance. \nPlymstock Broadway has since then been hit by several shop closures including the loss of household goods business Homeworkx and Wool Palette in 2017. \nBut it did gain a Costa coffee outlet in February 2017. \nCosta, like Wetherspoon, is also a chain experiencing huge expansion. \nIn November 2017, Wetherspoon said sales growth nearly doubled in the first quarter of its financial year, compared to a year earlier, with like-for-like sales for the 13 weeks to October 29, 2017, rising 6.1 per cent compared to growth of 3.5 per cent a year earlier. \nThe company said sales continued at a “slightly higher-than-expected level” \nIn September 2017, Wetherspoon posted an increase of almost 28 per cent in annual pretax profit, saying the wet British summer last year had boosted sales. \nBut the company, led by staunch Brexiter Mr Martin, has been hit by higher costs related to its purchases made in foreign currencies following the drop in the value of sterling since the Brexit referendum. Like us on Facebook ", "external_links": [], "published": "2018-01-17T14:43:00.000+02:00", "crawled": "2018-01-17T15:56:53.005+02:00", "highlightTitle": ""}