{"organizations": [], "uuid": "6ebf3f754dfc4b1066dd57ac63c350781bf37f22", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14227268.ece/ALTERNATES/s1200/CFR_NJL_260916tombola_01.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/sunderland-online-gambling-firm-tombola-14227209", "country": "GB", "domain_rank": 21960, "title": "Sunderland online gambling firm tombola sees turnover leap after scoring big in Europe", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T14:57:00.000+02:00", "replies_count": 0, "uuid": "6ebf3f754dfc4b1066dd57ac63c350781bf37f22"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/sunderland-online-gambling-firm-tombola-14227209", "ord_in_thread": 0, "title": "Sunderland online gambling firm tombola sees turnover leap after scoring big in Europe", "locations": [], "entities": {"persons": [{"name": "callaghan", "sentiment": "none"}], "locations": [{"name": "europe sale", "sentiment": "none"}, {"name": "gibraltar", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "tombola", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}], "organizations": [{"name": "europe business sunderland", "sentiment": "negative"}, {"name": "sunderland", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Sunderland online gambling firm tombola sees turnover leap after scoring big in Europe Sales are up but the tech firm has sounded a note of caution on Brexit, saying it could affect trading in key countries Share How the new Tombola HQ in Sunderland will look (Image: Callaghan PR) Share Get business updates   Thank you for subscribing!   \nNumbers are up at North East online gaming leaders tombola, which boosted turnover to £73.7m as it continues to thrive in the UK and Europe. \nThe big tech employer, which is around four months away from moving into new £7m headquarters in Sunderland , creates and develops original bingo software and online games, working closely with North East universities and colleges to attract talent. \nThe gaming giant employs almost 450 people across its Sunderland site and in Italy, Spain and Gibraltar. \nThe firm has posted results for the year ended April 30 2017 showing a 24% lift in turnover. Operating profit also jumped 17% to £13.5m, while profit for the financial year ended at £15.3m, a 54% leap on the previous year’s £9.9m. \nThe company’s founder and chief executive Phil Cronin said the figures came as the group “continues to thrive and grow its market share across the UK and Europe”. Phil Cronin, CEO of tombola (Image: tombola) \nIn a review of the business, he said: “The group’s net profit before tax also increased during the year to £13.8m from £11.9m which is also a result of the introduction of Tombola Arcade. \n“The group is focused on the continual research and development of its products and invests much time and resource to ensure the highest quality of its product.” \nThe company, which was the sponsor of the most recent series of ITV’s I’m A Celebrity...Get Me Out Of Here, is the number one site in Italy and Spain and Mr Cronin sounded a note of caution over Brexit, adding that the firm was looking at contingency plans to ensure it isn’t affected. \nHe said: “The principle risk and uncertainty the company faces is Brexit. There are still a number of Brexit scenarios which may cause issues with trade in Spain and Italy, however the management team are currently in the process of reviewing options to ensure the company have contingency plans for business continuity.” \nDividends of £7m were paid out during the year, and charitable donations of more than £140,000 were made to local charities and institutions. Shareholder funds also increased from £19.9m to £28.3m. Read More See how new tombola headquarters is changing the Sunderland skyline \nFollowing the publication of the results, Mr Cronin said expansion into new territories is on the cards. \nHe said: “tombola has continued to grow at an outstanding rate whilst consistently delivering an innovative and original portfolio of online entertainment for our customers and exceptional technical performance, support and customer service. \n“We are nearly three years into our five-year 2020 strategy and ahead of our own projections for the forthcoming year. \n“The opening of our new HQ in Sunderland is a key element of our future development, expansion and growth plans. It will also assist us to achieve our aim to significantly increase the size of our northeast tech team by 2020. \n“tombola also continues to perform well in all international markets. As well as the UK, tombola is the leading bingo site in both Italy and Spain, and we plan to expand into more new territories in the coming months.” Like us on Facebook", "external_links": [], "published": "2018-01-31T14:57:00.000+02:00", "crawled": "2018-01-31T15:09:35.045+02:00", "highlightTitle": ""}