{"organizations": [], "uuid": "f8fdb84ef8c6c2c5ad34dd5a7385fb097d2e07a8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.plymouthherald.co.uk/incoming/article1117633.ece/ALTERNATES/s1200/Richard-Bower.jpg", "site_section": "http://www.middevongazette.co.uk/farming.rss", "section_title": "devonlive - Special Features", "url": "https://www.devonlive.com/news/devon-news/young-farmers-qa-richard-bower-1117589", "country": "GB", "title": "Young Farmers' Q&A with Richard Bower: Great opportunities to shape farming's future for the better", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T15:31:00.000+02:00", "replies_count": 0, "uuid": "f8fdb84ef8c6c2c5ad34dd5a7385fb097d2e07a8"}, "author": "Athwenna Irons", "url": "https://www.devonlive.com/news/devon-news/young-farmers-qa-richard-bower-1117589", "ord_in_thread": 0, "title": "Young Farmers' Q&A with Richard Bower: Great opportunities to shape farming's future for the better", "locations": [], "entities": {"persons": [{"name": "richard bower", "sentiment": "none"}, {"name": "harper adams", "sentiment": "none"}], "locations": [{"name": "staffordshire", "sentiment": "none"}], "organizations": [{"name": "young farmers", "sentiment": "none"}, {"name": "food and fresh produce management", "sentiment": "none"}, {"name": "national farmers' union", "sentiment": "none"}, {"name": "nfu", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Richard Bower has been heavily involved in representing young farmers at not only a local level, but regionally, nationally and internationally   Thank you for subscribing! Could not subscribe, try again later Invalid Email \nInfluential young farmer, Richard Bower, has been nominated to contest the role of Vice President at the National Farmers' Union (NFU) leadership elections next month \nQ: Tell us a bit about yourself – what is your background / interests? \nA: I have grown up on a family beef and cereals farm in Staffordshire. We have a Higher Level Stewardship agreement. The business has diversified since 2004 with a paintball site, maize maze, fun farm, farmhouse bed and breakfast, two care farms and solar panels. This year we are building an anaerobic digester. \nI always knew I was going to be a farmer, but my parents told me to go and work for the supermarkets as there was no money in farming. I studied for a degree in Agri Food Marketing with Business Studies at Harper Adams, followed by a post graduate certificate in Food and Fresh Produce Management called Management Development Services. Read More 'Serious' hygiene breach investigation at Exeter site that supplies meat to Wetherspoons, schools and care homes \nI returned to the family farm in 2011. Many of my colleagues from Management Development Services now have senior roles along the supply chain. I believe we need professionals at every level of the supply chain, farmers are the professional foundation of the supply chain. \nMy grandmother has also had a major influence in my life. She is 94 years old, farmed all of her life and still knows what we are doing on the farm. \nQ: Tell us a bit about your day-to-day work both on and off the farm? \nA: No two days are the same and this is what I love about farming, along with the changing seasons and workloads. \nGrowing up I was interested in machinery and took over the combine driving from dad as soon as I left school. Read More Devon hen avoids death after escaping from a slaughter lorry \nMy role on the farm is still hands on, but I am more involved in the management and financial side of the business. We are not a corporate business so the job role changes. But as I always say, dad likes to buy and I like to sell so we compliment each other. He goes to livestock auction while I deal with the abattoir and grain merchants. \nChairing the NFU Next Generation Policy Forum is a commitment which I enjoy. I believe you get out what you put in. On average I am away from the farm two days per week, but receive around 20 to 30 emails per day. The beauty of smart phones is that you can work on the move and GPS helps when I am doing field work. \nQ: You are currently chairman of the NFU Next Generation Policy Forum. Can you explain what the Forum does and how you became involved in leading it? \nA: The NFU Next Generation Policy Forum was created in 2012 as a way of creating a succession plan for the union and a younger persons lobbying angle. \nI joined in 2014 and became chairman within three months. The forum was still in its infancy then. We soon realised we needed to represent the 26-40 age range. Below 26 is the role of NFYFC, the National Federation of Young Farmers’ Clubs, and 40 is the European age limit of a young farmer. Read More Dartmoor ponies benefit from a \"wee dram\" as whisky distiller teams up with heritage trust \nWe soon collaborated with NFYFC, discussing that we are not trying to do each other’s job but where we can collaborate, we will. We had also created a NFYFC / NFU Next Gen, joint membership of CEJA European Council of Young Farmers. Even though we are leaving the European Union we have been exposed to the expert lobbying of young farmers from across Europe. They also want to hear our views and this collaboration with NFYFC is what our industry needs. \nNext Gen has a representative from each region and each sector. This gives us diversity and good conversation. This year I am stepping away from Next Gen to give others the opportunities I have been given. New members will be selected in May so please speak to your regional NFU office. \nQ: You recently announced that you will be standing for NFU Vice President in the union’s leadership elections, due to take place on February 21. What are you hoping to bring to the team and to the industry if you were to be successful? \nA: The world is changing at a rapid pace and that will be accelerated going forward. From technology, to consumer habits, to social expectations of agriculture. \nThe greatest opportunity from Brexit is to write our own domestic agricultural policy. A policy which is fit for all sectors and farming situations. A policy which puts British food in prime position. A policy which recognises the work farmers do for the environment and social benefits while ensuring food production is not devalued. Read More Glass milk bottles making a comeback on Devon doorsteps \nVoting for me would be a step to give the next generation the responsibility and motivation to drive their future, and engage with our fantastic NFU. The NFU Forums play a huge part in the work of the NFU. They give a voice to the upland, tenant and organic farmers. The Environment Forum is also the platform for us to respond to government. If elected I will ensure the forums are given more resources. \nBrexit is an unprecedented step and we need to make sure agriculture makes the most of every opportunity. Let’s promote British across the world. Let’s educate. Let’s invest in our people to mobilise our talent. There are many things we cannot change, but those we can need 110%. Like us on Facebook", "external_links": [], "published": "2018-01-25T15:31:00.000+02:00", "crawled": "2018-01-29T16:39:47.049+02:00", "highlightTitle": ""}