{"organizations": [], "uuid": "378ec57db7e64f210f3318ec5fb5a9932b0eaab5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article12985477.ece/ALTERNATES/s1200/The-Millstone-pub-GV.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/pub-operator-wear-inns-raises-14102787", "country": "GB", "domain_rank": 21960, "title": "Pub operator Wear Inns raises a glass on a record year as turnover tops £14m", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T13:36:00.000+02:00", "replies_count": 0, "uuid": "378ec57db7e64f210f3318ec5fb5a9932b0eaab5"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/pub-operator-wear-inns-raises-14102787", "ord_in_thread": 0, "title": "Pub operator Wear Inns raises a glass on a record year as turnover tops £14m", "locations": [], "entities": {"persons": [{"name": "simon duckworth", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "yorkshire", "sentiment": "none"}, {"name": "gosforth", "sentiment": "none"}], "organizations": [{"name": "wear inns", "sentiment": "negative"}, {"name": "yorkshire", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Pub operator Wear Inns raises a glass on a record year as turnover tops £14m The North East and Yorkshire pub firm also says there are signs Brexit uncertainty is starting to affect public confidence Share The Millstone in Gosforth is run by Wear Inns (Image: Newcastle Chronicle) Share Get business   Thank you for subscribing!   \nLeisure firm Wear Inns has raised a glass on a record trading year in which strong food and drink sales served up turnover of more than £14m. \nThe pub operator, which has 25 venues across the North East and Yorkshire, posted a 4.2% lift in turnover to £14.2m for the year ended March 31 2017, while operating profit before tax rose 29.6% to £1.5m. \nLast year’s loss before tax of £148,241 was also narrowed considerably, to just under £46,000. \nIn a report accompanying the accounts, managing director Simon Duckworth said directors were pleased with the overall performance in the year and were looking forward to further improvements in the new financial year. \nDuring the trading year the firm, which employed an average of 316 staff over the period, sold the New Inn at Durham and The Turf in Bradford, and added to its portfolio by acquiring The Whistlestop in Leeds. \nThe firm’s 25 venues include The Millstone in Gosforth, Newcastle , The Black Bull in Morpeth, The Guidepost in Gateshead and the Lambton Arms Hotel. \nIn a strategic report alongside the accounts, Mr Duckworth highlighted a record year for the firm, but said Brexit uncertainty continues to cast a shadow over the industry. \nMr Duckworth, who is based at Wear Inns’ Headquarters in Castle Eden, County Durham, said: “The company continued to trade well through the financial year, achieving an overall turnover increase of 4.25% due to excellent performances in both wet and food sales. \n“Whilst 2016/17 was a record year, largely unaffected by the uncertainty created by the Brexit vote, the potential ultimate effects of Brexit can still not be assessed with any certainty. There are signs that the ongoing uncertainty over the final exit deal and UK economic performance in general, including possible further interest rate increases, are beginning to have an effect on public confidence in terms of future disposable incomes, which may ultimately start to feed through into discretionary expenditure.” Simon Duckworth, Managing Director of Wear Inns (Image: Gazette) \nMr Duckworth said the company, as in previous years, has faced competition from other managed and leased pubs, and from the “off trade”: “Principally supermarkets selling alcoholic beveages, particularly beer, at low cost as a loss-leader, thus affecting the consumer’s decision to visit a pub or drink at home. \n“Despite some government action to limit the low prices to a minimum of Duty plus VAT, the major supermarket chains do not appear to have changed their behaviour, as evidenced by continuing low cost offers. \n“The company’s pubs remain competitive due to the good value offer provided both in terms of prices and the quality of the environment and ameneties at each site.” \nLooking ahead, Mr Duckworth said the firm has continued to see good performance following the year end. \nHe also used the accounts report to pay tribute to Wear Inns co-founder and chairman John Sands, who died last summer. \nMr Sands, a former North East Business Executive of the Year, died at the Butterwick Hospice in Stockton in August. His death came a year after Wear Inns co-founder John Weir died. \nIn the accounts, Mr Duckworth said: “Sadly, the chairman, John Sands, died in August 2017 following a struggle with cancer. \n“His wisdom and guidance were invaluable, and the company is currently seeking an appropriate successor.” Like us on Facebook", "external_links": [], "published": "2018-01-02T13:36:00.000+02:00", "crawled": "2018-01-02T14:09:37.058+02:00", "highlightTitle": ""}