{"organizations": [], "uuid": "627cbb3cd7dd831f975aa6565af16e7c2b3fa2d7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article12796986.ece/ALTERNATES/s1200/FILE-Tesco-Posts-Record-Loss.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14138956", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Tesco turnaround continues as festive sales rise 1.9%", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T09:58:00.000+02:00", "replies_count": 0, "uuid": "627cbb3cd7dd831f975aa6565af16e7c2b3fa2d7"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14138956", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Tesco turnaround continues as festive sales rise 1.9%", "locations": [], "entities": {"persons": [{"name": "dave lewis", "sentiment": "none"}, {"name": "yui mok/pa wire", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}], "organizations": [{"name": "tesco", "sentiment": "negative"}, {"name": "coreena ford", "sentiment": "negative"}, {"name": "incorporating palmer & harvey", "sentiment": "none"}, {"name": "london stock exchange", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford Plans for creative hub in Newcastle's Ouseburn made from shipping containers \nPlans to reinvigorate a derelict corner of Newcastle’s cultural quarter with a shipping container village for creative businesses have emerged. \nProposals have been submitted which would see a steel and glass structure and 38 shipping containers become Canvas Works, affordable and high quality work space for creatives in Ouseburn Valley’s Lime Street. \nThe site earmarked for the scheme is now half covered in overgrown shrubbery, with a remaining structure supported by scaffolding, but the original Ouseburn Canvas Works building there was once home to a sailcloth maker in the 1870s, a mattress manufacturer in the 1930s and industrial firms until it became derelict in the 1980s. \nApplicant Raskl, a design studio and workshop, has submitted detailed documents showcasing how a new building, and 38 steel shipping containers could be used to create a two, three and four storey block with 28 studios, a roof terrace and three cafes and restaurants, providing a base for the community which gave the area its reputation as a cultural quarter long before the arrival of student accommodation schemes. \nIn a design document, Raskl said: “The Canvas Works scheme will create 28 affordable studio spaces aimed primarily at the cultural and creative sector. This will be augmented with shared external outdoor work space and hard landscaping.” A CGI of the proposed Canvas Works scheme in Ouseburn, Newcastle (Image: Raskl - Newcastle city council planning portal) 9.00 Record 5.5m customers switch energy suppliers \nA record 5.5 million energy customers switched electricity supplier last year, figures show. \nThe figure is 15% higher than the 4.8 million who switched to a better deal in 2016, and 2.3 million more than in 2014, Energy UK said. \nIn December alone, more than 400,000 customers switched, a figure reached during 10 out of 12 months last year. Some 28% of customers who switched moved to small and mid-tier providers rather than one of the “big six”. \nLawrence Slade, chief executive of Energy UK said: “It is tremendous to see switching surpassing all expectations during 2017. “Every year more and more customers are seeking out a better deal and potentially saving themselves hundreds of pounds a year. “I would encourage all customers to spend a few minutes checking the deal they are on. You could save a lot of money on your current energy bill - whether it be with a new supplier or your existing provider.” Record numbers of people are switching electricity suppliers. (Image: PA) 8.55 Coreena Ford Firms call to replace apprenticeship levy \nMore than half of employers who pay the apprenticeship levy want it replaced with a training alternative, research shows. \nA survey of more than 1,100 businesses found two out of five levy-payers say it made no difference to the amount of training they offer. \nA third of those questioned by the Chartered Institute of Personnel and Development (CIPD) pay the levy but only a minority support the existing system. More than a third of smaller firms paying the levy do not plan to use it to develop apprenticeships. \nCIPD skills adviser Lizzie Crowley said: \nOur research shows that the straitjacket of the apprenticeship levy is forcing many firms to re-badge a lot of their existing training as apprenticeships, as they seek to claw back the levy they pay. \nIn many instances, this is not adding any additional value and is creating a lot of additional bureaucracy and cost. \nApprenticeships are extremely important but other forms of training are equally valuable and often more flexible and better suited to the needs of organisations. \nA move to a more flexible training levy would have the effect of continuing to prompt greater employer investment in skills, including apprenticeships, but in a way that is much more responsive to employers’ needs. A call has been made to replace the apprenticeship levy. (Image: Christopher Furlong/Getty Images) 8.50 Coreena Ford Customs Bill will create 'endless red tape' for North East firms, MPs warn \nNorth East MPs have warned that the Government’s new Custom Bill will create “endless red tape” for North East importers and exporters. \nNewcastle North MP Catherine McKinnell and Sedgefield’s Phil Wilson have heavily criticised the Bill, which proposes how businesses will pay VAT and excise duties after Brexit. \nIn a speech in Parliament Mrs McKinnell said that it was crucial that North East exporters be given “frictionless” access to European markets, but said she failed to see how the Bill would deliver this to the region. \nShe said: “How will it help to deliver the frictionless and unbureaucratic two-way access to European markets and the minimum disruption which are needed by the North East’s firms and the hundreds of thousands of jobs that they support, with many of the region’s exporters having EU-based firms as part of their supply chain? \n“I do not know the answer to that, but what it does provide is a very real prospect of endless red tape and customs duties on goods traded with the EU , which may or may not be levied after Brexit , and for which those firms may or may not need to prepare and budget. \n“That depends entirely on the Prime Minister’s ability to deliver a Brexit deal to British businesses and consumers.” British Labour Party politician Catherine McKinnell (Image: Newcastle Chronicle) 8.45 Coreena Ford Free computer games to be given away at Newcastle's career school open event \nA new £12.5m career school in Newcastle is enticing in potential new students with the promise of free computer games . \nUbisoft – the global games developer behind the popular Assassin’s Creed, Tom Clancy’s The Division and Watch Dogs games – will give away one of its games to the first 150 young people to attend the open event for the North East Futures University Technical College (UTC). \nThe company is one of the North East companies acting as supporters for the £12.5m technical college, which aims to provide the closest possible link between education and the world of work to develop the next generation of workers in IT and life sciences. \nAs well as the games giveaway, some of Ubisoft’s staff will be at the open day to demonstrate live gaming and answer questions about some of their latest releases. \nWith admissions now open for the school, the open event takes place on January 17 at the Boilershop, in the city’s Stephenson Quarter, where teachers, experts and employers will share more with potential students about how they will work with the UTC to offer support to its students. \nStaff from the school and Ubisoft will be joined by representatives from the city’s NHS services, corporate computing specialist Accenture and FTSE 100 software firm Sage, all of whom support specialised education from age 14 to match huge growth expected in digital tech and health science. \nThe open evening will give students a chance to learn exactly how the school will teach GCSEs, BTEC and A-levels with both classroom and practical lessons. A CGI of the North East Futures UTC (Image: UTC) 8.40 Coreena Ford John Lewis sales up - but profits affected by price matching \nSales at the John Lewis Partnership grew over Christmas but the group warned that profits will be dragged down by attempts to mainta", "external_links": [], "published": "2018-01-11T09:58:00.000+02:00", "crawled": "2018-01-11T10:16:09.018+02:00", "highlightTitle": ""}