{"organizations": [], "uuid": "6ba2eb94897e44d6fd8866d1ce3f83a8753f000b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article941074.ece/ALTERNATES/s1200/Money-by-Getty-Images.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "devonlive - frontpage", "url": "http://www.devonlive.com/news/devon-news/five-easy-steps-asking-your-1012729", "country": "GB", "title": "Five easy steps to asking your boss for a pay rise", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T18:35:00.000+02:00", "replies_count": 0, "uuid": "6ba2eb94897e44d6fd8866d1ce3f83a8753f000b"}, "author": "Edward Oldfield", "url": "http://www.devonlive.com/news/devon-news/five-easy-steps-asking-your-1012729", "ord_in_thread": 0, "title": "Five easy steps to asking your boss for a pay rise", "locations": [], "entities": {"persons": [{"name": "dan", "sentiment": "none"}, {"name": "dan hughes", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Five easy steps to asking your boss for a pay rise It's worth planting the idea - almost half of us have never actually asked for more money Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nDo your New Year Resolutions include increasing your earnings? \nIt's getting tougher out there - Britons are in the longest wage slump ever and facing at least another five years of misery. \nDepressing figures show our average weekly salary is effectively falling. \nIn March 2008 it was £402. Nine years later, in July 2017, it was £474, equivalent to £389 after inflation. Yet 49 per cent of us have never asked for a pay rise. \nBut master negotiator Dan Hughes hopes to ­rectify this by helping us land ­decent wage rises. The Mirror reports. \nDan, who runs the Facebook page Negotiating Guru, said culturally we are reluctant to ask for a rise, fearing it will damage our relationship with the boss. \nBut Dan who also trains civil servants representing the UK at Brexit talks, said: “Don’t worry – the worst that can happen is you’re no worse off.” Read More Anger and debate sparked by dad's photo of kids on rocks next to huge crashing waves Here is his five-point guide to improving your pay \n1 Consider what you do and the value you add to the business, what you are on now and how much you would like. \nIf a body sets your pay, such as for an NHS nurse, negotiate with your manager about working conditions, such as parking spaces and shift patterns. Make a list. \n2 Prepare the ground by emailing your boss or mentioning a rise in a chat. \nIf they are thinking about it before negotiations they’re more likely to be solution focused. \n3 Plan the pay talks carefully. Consider your opening position but also think ­beyond that. Assume they will initially say no but if you’re going to lower your demand also try getting something else. \n4 Don’t worry about feeling ­uncomfortable. Your boss is probably a bit nervous as well and even if they can’t give you a pay rise they don’t want to demotivate you or lose you. \n5 If you don’t get a rise at least you’ve sown the seed. Ask your boss what you need to get in place for a pay rise and for a review in six months. \nDan says avoid talking to bosses about your workmates’ wages because it can give them an easy get-out. And don’t threaten to leave. They may call your bluff. Read More More flooding as Devon river levels rise Chef cooks up a big increase \nTakeaway chef Andy Brown is really cooking after landing a tasty £6.50-an -hour pay rise with Dan’s help. \nThe 18-year-old wanted his £8.50-an- hour wage upped to £16 by offering to help more with the business and promote it on social media. He then dropped his request to £13.50 but his boss at Mushtaq’s in Hamilton, S Lanarks, said he’d pay £15. \nAndy said: “I wasn’t expecting that. I’m really happy.” Read More Tapping up a plumbing deal \nThe wage of a plumbing manager, inspired by Dan’s negotiating tips, has risen £4,000 to £46,000. \nControl room manager Katie Regan, 40, from Waterloo, London, said before the programme, asking for a pay rise was outside her “comfort zone”. \nShe’d have been embarrassed if her boss at Pimlico Plumbers, where she has worked for ten years, said no. She said: “Thanks to Dan I learned the skills of staying calm and not seeing ‘no’ as a negative word.” Like us on Facebook ", "external_links": [], "published": "2018-01-04T18:35:00.000+02:00", "crawled": "2018-01-04T19:41:45.017+02:00", "highlightTitle": ""}