{"organizations": [], "uuid": "f4db906ca3d10bdb4fd40a0045f7e8c82d97b178", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14106342.ece/ALTERNATES/s1200/Brexit.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14185517", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Brexit to impact SMEs most, new study claims", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T10:00:00.000+02:00", "replies_count": 0, "uuid": "f4db906ca3d10bdb4fd40a0045f7e8c82d97b178"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14185517", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Brexit to impact SMEs most, new study claims", "locations": [], "entities": {"persons": [{"name": "stuart young", "sentiment": "none"}, {"name": "young", "sentiment": "none"}, {"name": "owner of the san", "sentiment": "none"}], "locations": [{"name": "gosforth", "sentiment": "none"}, {"name": "san lorenzo", "sentiment": "none"}, {"name": "gosforth high street", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "coreena ford", "sentiment": "negative"}, {"name": "lorenzo north east ltd", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford Durham County Cricket Club declares strongest financial position in years \nDurham County Cricket Club says it has entered 2018 in its strongest financial position for years , giving it the opportunity to pay off its council debt a decade faster than a previous loan. \nThe club last year laid bare financial challenges which saw it record a pre-tax loss of £1.25m, having slipped into the red after losing a £1m one-off payment which had previously been made to all counties by the England and Wales Cricket Board (ECB). \nThat loss followed a financial crisis which resulted in Durham being relegated to the second division of the County Championship after a bailout from the ECB. \nAt the end of 2017, however, the club said its net asset position was the strongest it has been since 2010, its improved financial position resulting from a range of factors including the hosting a T20 match against the West Indies, additional ECB distributions and reduced loan interest payments. \nThe club said its financial plan should see its debt to Durham County Council – now in the form of preference shares – paid off in full, 10 years earlier than under the previous loan. A general view of the Emirates Durham ICG (Image: Getty Images Europe) 9.00 Coreena Ford Two new San Lorenzo restaurants to open as new owners take on popular Gosforth eatery \nThe new owner of a popular Italian restaurant chain is looking to open two new North East venues after the original founders retired. \nSan Lorenzo has been serving up pizzas and pastas to customers in Gosforth High Street and Washington since May 2016, with the two sites employing around 50 people. \nThe chain’s former group operations manager Stuart Young will now head up the business after it was bought from its founders, and the new owners have plans to open two more restaurant venues in the near future, creating another 50 jobs. \nMr Young said the new firm which owns the San Lorenzo restaurants, Lorenzo North East Ltd, will invest more than £500,000 into the expansion plans and he is confident that the takeover will bring further exciting opportunities. \nChanges are set to be made at the Washington site in the short term. And in the longer term, the company is actively seeking suitable sites for expansion and has two under consideration at the moment. Stuart Young, owner of the San Lorenzo restaurants (Image: San Lorenzo) 8.57 Coreena Ford Meet the two men running the biggest firm in Newcastle that you've never heard of \nNorth P&I is one of the biggest companies in Newcastle, and the chances are you’ve never heard of it. \nThe company is one of the biggest shipping liability insurers in the world, and turns over more than $400m every year. But despite its size and prominent location on the Quayside most people in the city are more likely to know its neighbour, the Pitcher and Piano pub. \nP&I clubs, such as North P&I, are hugely important to shipping companies, who must be able to prove that they have liability insurance whenever they enter a port anywhere in the world. \nThe insurance offered by these firms covers any damage that a ship might cause as well as cover for staff accidents and loss of life. There are only 13 clubs in the world who offer this type of insurance, with the Newcastle company being one of the biggest . The North of England P&I association Ltd, Newcastle Quayside (Image: Newcastle Chronicle) 8.49 Coreena Ford Dixons Carphone narrows profit forecast \nDixons Carphone has narrowed its profit forecasts, as it detailed weaker Christmas sales growth from its UK and Ireland electrical business. \nThe company said it had observed like-for-like growth of just 3% in the UK and Ireland division over the 10 weeks to January 6, though overall group like-for-like revenue was up 6%. \nThat is against comparable jumps of 23% and 11% in its Greek and Nordic operations respectively over the period. \nChief executive Seb James said he was happy with the performance given the “more cautious consumer environment”. \nHowever, full-year pre-tax profit is now expected to come in between £365 million and £385 million, having previously been forecast at between £360 million and £400 million. \nMr James said: \nOur UK mobile business had a strong sales period helped by better iPhone X availability and we grew share in SIM free and SIM only over the period. \nCurrent market conditions mean that gross margins continue to be challenged in phone. \nIn short, the whole team did a great job, and my most sincere thanks to everybody for their hard work during this busy period. \nLooking forward, we continue to keep our antennae twitching for any material change in consumer behaviour, but remain relentless in our focus on providing the best value, choice and service to our consumers. \nFor the remainder of this year we have an early Easter, a new Samsung phone and the first week or two of our World Cup promotion to look forward to, and work continues on redefining and refocusing our Carphone Warehouse business to be a simpler, less capital-intensive model. Dixons Carphone has narrowed its profit forecast. 8.40 KEY EVENT DeepOcean wins \"significant\" contract for work on Baltic Sea project \nThe Darlington division of offshore specialist DeepOcean has secured a “significant” contract on a pipeline project in the Baltic Sea. \nDeepOcean 1 UK Limited, a subsidiary of Netherlands headquartered DeepOcean Group Holding BV (DeepOcean), has been awarded the contract for performing ploughing operations on the Nord Stream 2 pipeline in the Baltic Sea. \nThe Nord Stream 2 Project involves the construction of an offshore natural gas transmission system with two 1,220 km pipelines from the Russian Baltic Sea to the German Baltic Coast. \nThe award covers project management, engineering, survey and ploughing activities. \nDeepOcean’s commercial director for cable installation and trenching, Andrew Piasecki, said: “DeepOcean are proud to be selected by Nord Stream 2 AG as their solution for ploughing works on this milestone project. \n“ We shall deploy our AMP500 plough to bury the 48” pipelines, building upon our extensive experience in the offshore trenching market and enhancing our position as a trusted partner for challenging burial projects. \n“We look forward to supporting our client in delivering this key project safely and to specification.” \nThe value of the deal has not been revealed. Darlington's DeepOcean will work on the Nord Stream 2 project in the Baltic Sea. 8.32 Coreena Ford Chancellor's plans to fix housing crisis will fail, MPs say \nChancellor Philip Hammond’s plans to tackle the housing crisis will fail without fresh reforms, a powerful Commons committee has warned. \nA cut in stamp duty to help first-time buyers get on the housing ladder is likely to push prices by at least the amount the reduction is supposed to save, MPs said. \nBorrowing caps on councils must be lifted if the target to build 300,000 new homes a year is to be met, the Treasury select committee found. \nMr Hammond promised to fix the housing crisis in his autumn budget but the Government will “find it very difficult to meet this ambition” without further action. \nThe report states: “Greater measures are needed to increase housing supply. \n“300,000 homes a year will not be achieved with the current measures. \n“The Government will need to show greater commitment to housing supply to achieve its aspiration and will need to bring forward additional policy measures.” \nThe committee’s analysis of the Chancellor’s budget called for “unfair” RPI measures used to calculate interest rates on student loans, rail fares and air passenger duty (APD) to be ditched. \nMPs also called for the Office for Budget Responsibility to issue a special forecast on the economic impact of Brexit before Parliament votes on crucial exit laws. MPs say the Chancellor's housing plans will not work. (Image: PA) 8.25 KEY EVENT Newcastle Falcons' expansion plans set for approval \nGrand plans for expansion at Newcastle Falcons’ home ground in Kingston Park are poised for approval , aiding the club’s mission to bring in hundreds more supporters and attract top players. \nKingston Park Stadium, home to Newcastle Falcons and Newcastle Thunder, has seen much investment over the years to upgrade three of its stands as well as its corporate and hospitality areas. \nBut its current 10,200 capacity makes it one of the smallest Aviva Premiership clubs, triggering the need for expansion and enhanced spectator facilities. \nThe club – currently sixth in the Premiership – unveiled ambitious plans for a new-look ground last October, which would ring in a raft of multi-million-pound changes to help the Falcons compete with rivals. \nThe proposals include the extension to the north stand, the only stand which is currently uncovered, to provide an additional 1,530 covered seats and a hospitality suite, a move which will bring the stadium capacity to 11,730. \nA new players’ facility could also be built beneath the seating to provide improved training, conditioning and changing accommodation. \nThe club also plans to create a full-size all-weather pitch with floodlighting and community changing facilities. All on-site parking is also set to be formalised with a traffic management and full travel plan. \nIn a report prepared ahead of a planning committee meeting next week, Newcastle City Council’s assistant planning director recommends the plans are granted approval, despite some of the scheme impinging upon Green Belt land. A CGI of the proposed North Stand redevelopment by Ryder Architecture (Image: Ryder Architecture ) 8.20 Coreena Ford Young's Seafood eyes China expansion \nYoung’s Seafood is planning to cast its net into the Chinese market as speculation intensifies over a multimillion-pound sale of the business. \nChief executive William Showalter said the company was in talks with potential partners over an export push into the Asian nation after expanding the brand across supermarket shelves in America. \nThe food industry veteran refused to be drawn on rumours suggesting Britain’s biggest seafood firm could be snapped up by Princes’ Japanese-owner Mitsubishi Corporation. A Young's Seafood salmon dish - the firm is casting its net into China. 8.15 Coreena Ford What's the FTSE latest? \nThe pound at 8am was 1.3887 dollars compared to 1.3855 dollars at the previous close. The euro at 8am was 0.8809 pounds compared to 0.8832 pounds at the previous close. \nThe FTSE-100 index opened at 7730.79. Screen displaying the FTSE 100 at the London Stock Exchange (Image: Yui Mok/PA Wire) 8.15 Coreena Ford Ocado seals first foray into North America \nOnline grocer Ocado has confirmed its second major international partnership and its first move into North America after reaching a deal with Canadian retailer Sobeys. \nOcado said the partnership will involve building an online grocery business in Canada, where Sobeys operates more than 1,500 stores under brands including Safeway, IGA and and Thrifty Foods. \nThe two firms are planning to build their first warehouse in the Greater Toronto Area within the first two years of the partnership, but will consider setting up shop in on other cities across Canada. \nOcado said it was “delighted” to be working with one of the leading retailers on the continent. \nThis marks the second major international partnership to be signed by Ocado in recent months, having announced a partnership with French supermarket giant Groupe Casino late last year. \nThe FTSE 250 firm announced a separate international deal in early June, but it has so far kept the customer anonymous. An Ocado home delivery van (Image: Katie Collins/PA Wire) 8.10 Coreena Ford Wetherspoon boss accused of selling out for 'cheap Chardonnay' by Innocent founder \nThe founder of drinks brand Innocent has launched a scathing attack on the Brexit-backing Wetherspoon boss, accusing him of selling Britain’s economy out for “cheap Chardonnay”. \nRichard Reed said Tim Martin, chairman of the pubs chain, has helped to “junk” the UK economy. \nAs part of a stark warning on the impact that leaving the EU is having on business investment, he said: “Brexit is unhelpful, no one I know is saying it’s a good thing. \n“That guy from Wetherspoon (Mr Martin) is talking about it means he can buy cheap Chardonnay from the New World, but I don’t think that’s a reason to junk a country’s economy. \n“It’s just not going to help anything, it’s not a good idea to anyone who uses logic, facts and reason.” As well as the collapse in the pound following the Brexit vote, the British economy has slowed considerably and is now being outpaced by the eurozone. \nUndeterred, the Wetherspoon boss has been an outspoken proponent of Britain’s divorce from the European Union, issuing countless stock exchange announcements extolling the virtues of Brexit. \nHe wants Britain to crash out of the EU without a deal and fall back on to World Trade Organisation rules, allowing the country to “follow free trade champions like New Zealand, Australia”. \n“Richard is being melodramatic,” Mr Martin said in response. \n“Wetherspoon will benefit from leaving the EU, but so will everyone else in the country. \n“History shows that democracy and prosperity are closely aligned, and the EU is becoming more undemocratic.” JD Wetherspoon chairman Tim Martin 8.00 KEY EVENT Brexit may have negative impact on SMEs, new study suggests \nSmall and medium-sized businesses thought to be the most significant for boosting productivity and economic growth may be the most negatively affected by Brexit, new research suggests. \nIn terms of its future impact, Brexit is likely to result in lower levels of capital investment, reduced access to external finance and lower levels of growth, the University of St Andrews study found. \nIt is also likely to lead to reduced product development and lower levels of business internationalisation. \nThe study of nearly 10,000 UK small and medium sized enterprises (SMEs) found that future plans for capital investment within innovative SMEs seem particularly likely to be impacted. \nDr Ross Brown, reader in entrepreneurship and small business finance at the University of St Andrews, said: \nThe results of our analysis suggest that Brexit-related concerns could result in a range of negative consequences for UK SMEs, especially the impact on reduced capital investment, which critically weakens and undermines their ability to grow and prosper. \nMost worryingly, these perceived negative impacts appear to be foremost in the minds of entrepreneurs and managers located in the types of innovative and export-oriented companies, which are often viewed as the high growth ‘superstars’ of tomorrow. \nIn other words, SMEs thought to be the most significant for boosting productivity and economic growth may be the most negatively affected by Brexit. \nThe analysis suggests that Brexit-related uncertainty is likely to affect larger, export-oriented firms and those operating in hi-tech and service-related industries the most. \nInnovative SMEs in particular seem particularly concerned by Brexit. \nThe study was carried out by researchers led by Dr Brown and Professor John Wilson from the Centre for Responsible Banking and Finance, University of St Andrews, in conjunction with Dr Jose Linares Zegarra from the University of Essex. The Union flag and the EU flag flying (Image: PA) More On ", "external_links": [], "published": "2018-01-22T10:00:00.000+02:00", "crawled": "2018-01-22T11:02:14.020+02:00", "highlightTitle": ""}