{"organizations": [], "uuid": "ab58c6d0bc7ff2ac56c97737a71d8b10cd36a81a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14143890.ece/ALTERNATES/s1200/JS140645648.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14155486", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Carillion enters liquidation putting 20,000 jobs at risk", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T10:00:00.000+02:00", "replies_count": 0, "uuid": "ab58c6d0bc7ff2ac56c97737a71d8b10cd36a81a"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14155486", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Carillion enters liquidation putting 20,000 jobs at risk", "locations": [], "entities": {"persons": [{"name": "jonathon manning batchelors", "sentiment": "negative"}, {"name": "batchelors", "sentiment": "none"}, {"name": "mccormick", "sentiment": "none"}], "locations": [{"name": "japan", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "premier foods", "sentiment": "negative"}, {"name": "batchelors", "sentiment": "none"}, {"name": "nissin", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KEY EVENT Unite calls for public inquiry into Carillion's collapse \nTrade union unite has called for a pubic inquiry to be made into the collapse of construction giant Carillion. \nThe comments were made by Jim Kennedy, Unite’s national officer for local government, who questioned the motivations and actions of the company’s directors. \nHe said: \nPublic services, vast amounts of public money, thousands of jobs - including in a lengthy supply chain of insecure agency workers who are also at risk - and workers’ hard-saved pensions are all in danger of being dragged under by yet another bout of reckless corporate irresponsibility. \nThere are also serious questions that need to be asked and answered about Carillion’s conduct. \nDid directors move to protect their bonuses before the financial stability of the company? \nHas the company mushroomed because it built its business on unrealistic undercutting and blacklisting? \nWhy did the government continue to hand over public money to a company that had issued repeated profits warnings? Stack of pound coins on financial figures balance sheet (Image: Getty Images/iStockphoto) 9:12 KEY EVENT Government will fund Carillion's public service work \nThe Government will now provide the fund needed to carry out all of the public services that were being previously being carried out by Carillion staff members, according to the outsourcing giant. \nThe tax payer may be left footing the bill after it was revealed that the UK Government is expected to fork out the cash to maintain the public services that Carillion was responsible for. \nAlong with major construction projects such as HS2, Carillion also provided school dinners, cleaning and catering services for NHS hospitals, and was responsibile for maintaining 50,000 army base homes for the Ministry of Defence. \nAt the same time as Carillion announced its liquidation, chairman Philip Green said: \nIn recent days we have been unable to secure the funding to support our business plan and it is therefore with the deepest regret that we have arrived at this decision. \nWe understand that HM Government will be providing the necessary funding required by the Official Receiver to maintain the public services carried on by Carillion staff, subcontractors and suppliers. \nManuel Cortes, leader of the Transport Salaried Staffs Association said the Public Accounts Committee should now investigate new approaches to essential public infrastructure projects and services. He said: \nCompanies like Carillon have been allowed to mushroom too quickly on the back of public investment without proper public accountable audit trails. \nThis morning 20,000 skilled infrastructure workers are left worrying about their futures, but worse still, the continued building of hospitals, the management of schools, and vital rail infrastructure projects are left hanging in the balance. \nIt is essential that the administrators do not now preside over the asset stripping of public sector projects and instead they must be handed back to public sector bodies as soon as possible. The government must ensure this happens without further delay. Manuel Cortes, leader of the Transport Salaried Staffs Association 8:56 Jonathon Manning Newcastle engineers Cundall Johnston boosts turnover after year of investment \nSpecialist engineering firm Cundall Johnston & Partners has added almost £7m to its turnover after taking on a wider range of projects and hiring more staff. \nThe Newcastle-headquartered firm, which is best known for designing the white water canoe course use at the Rio 2016 Olympic Games, saw its turnover grow from £45.2m to £52.1m for the year ending June 2017. \nThe company said its steady growth had been fuelled by the its decision to hire more staff, which in turn led to it winning more projects. \nGordon Reid, a partner at Cundall Johnston, said: \nEvery year our turnover has increased. We have more people in more offices. That points towards the increased turnover, and as our reputation has grown that has pointed us to other types of projects. Bigger and better projects. \nThe company added 99 members of staff to its headcount during the year, with the biggest boost in numbers benefiting the firm’s technical teams. The firm now employs 690 workers, with 559 staff being working in technical positions. \nBut despite achieving a 15% revenue increase, Cundall saw its operating profit fall by 20%, from £7.2m to £5.7m. \nThe company said that the profit fall was a result of its investing in its business, through updating its computer systems and carrying out a number of office moves. This included moving the firm’s Newcastle office from Horsely House, in the Regent Centre in Gosforth, to the nearby Partnership House. Cundall Johnston & Partners is best known for designing the white water canoe course use at the Rio 2016 Olympic Games (Image: PA) 8:51 Jonathon Manning Batchelors not on the menu, Premier Foods says \nPremier Foods has played down reports that it is weighing up a potential sale of Batchelors, its Cup a Soup brand.The company, which is also behind Ambrosia custard and Bisto gravy, said it “regularly reviews options”, adding that talks have not gone beyond an “exploratory stage”.Premier was responding to reports over the weekend that Batchelors was being readied for a £200m sale to its biggest shareholder, Japan’s Nissin. \nThe firm said: \nOn 29 June 2017 the company confirmed that, in line with good corporate governance, it regularly reviews options to deliver value for all its stakeholders. \nSuch reviews do periodically involve discussions with third parties, including Nissin. \nThere is no current situation where discussions have gone beyond an exploratory stage. \nIn 2016, Premier rejected a £537m takeover bid from the US company McCormick, choosing instead to form a strategic alliance with Nissin.Since then the group, which has over £500m of debt, has had to issue a profit warning linked to the Brexit-hit pound.Premier added: \nAs a matter of normal good governance, the board continues to keep under review any options which could potentially add value for shareholders and other stakeholders, and accelerate the delivery of the Board’s strategic objectives, particularly with respect to reducing gearing. Premier Foods Jonathon Manning Nissan pension plan changes set to affect 2,000 workers in the North East \nAround 2,000 North East workers at car giant Nissan could see their pensions change as part of proposals by the the motor manufacturer. \nStaff at the Japanese giant’s UK plants have been told it wants to end the current defined pension plan in favour of a new scheme. \nNissan put the brakes on new entrants to the defined pension – otherwise known as the final salary pension, which provides a set level of pension at retirement – in 2004. \nIn its place, the firm created the Nissan defined Contribution Pension Plan, a scheme which last year cost the £5bn turnover firm £6.6m, according to accounts. \nNow the firm is proposing those who had been on the original final salary pension scheme move to a new scheme. \nThe CARE (Career Average Revalued Earnings) scheme, in which benefits at retirement are based on a worker’s earni", "external_links": [], "published": "2018-01-15T10:00:00.000+02:00", "crawled": "2018-01-15T10:55:49.007+02:00", "highlightTitle": ""}