{"organizations": [], "uuid": "27e4ab7db17b8a12eb3b87d0a53ab830617123f8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14117748.ece/ALTERNATES/s1200/Office-for-Students-appointments.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/toby-young-row-make-clear-14117699", "country": "GB", "domain_rank": 21960, "title": "Toby Young row - make clear how he got Office for Students job government told", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T18:00:00.000+02:00", "replies_count": 0, "uuid": "27e4ab7db17b8a12eb3b87d0a53ab830617123f8"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/toby-young-row-make-clear-14117699", "ord_in_thread": 0, "title": "Toby Young row - make clear how he got Office for Students job government told", "locations": [], "entities": {"persons": [{"name": "toby young", "sentiment": "negative"}, {"name": "young", "sentiment": "none"}, {"name": "adrian don", "sentiment": "none"}, {"name": "roberta blackman-woods", "sentiment": "none"}, {"name": "jo johnson", "sentiment": "none"}], "locations": [{"name": "durham", "sentiment": "none"}, {"name": "oxford", "sentiment": "none"}], "organizations": [{"name": "office for students", "sentiment": "negative"}, {"name": "labour", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Free school pioneer and writer Toby Young (Image: PA) Share Get daily   Thank you for subscribing!   \nThe government has been called on to make clear how all members of the board of the Office for Students were selected after outrage sparked by the choice of Toby Young. \nIt is a new regulator designed to champion the interests of students and lead the Government’s drive to apply market forces to higher education. \nTwitter comments by Mr Young dating back to 2009 regarding women and columns he has written about the “ghastly inclusivity” of wheelchair ramps in schools and also describing working class students arriving at Oxford as “stains” have raised questions about his suitability. There are also concerns about his experience for the role. \nCity of Durham MP Roberta Blackman-Woods, Labour chair of the parliamentary university group, has written to the Minister for Universities and Science, Jo Johnson, to ask him to make public the process by which Mr Young was chosen and how he meets the job specification. Roberta Blackman-Woods (Image: Adrian Don) \nNow she has said: “Further to this, today I have written to the minister again to ask ALL the details of ALL appointments to the OfS board are put in the public domain.” \nMs Blackman-Woods said she planned to submit an FOI request if information was not forthcoming. \nShe said: “Because it is a new board the Conservative government has put into place which is operational from April, we would expect there to have been a really rigorous process for appointing people to it. \n“High standards and integrity are demanded but a lot of people have said he does not meet those requirements. \n“What I want to know is how was this appointment made? We’re not even sure what the process was. \n“I am asking them to put into the public domain how he was deemed to meet the job description.” \nSince it emerged he had been appointed to the 15 member board, there have been a series of questions about his suitability while a backlash to remove him has seen a petition started which has gathered over 100,000 signatures. \nMr Young himself acknowledged on Tuesday that the Department for Education’s (DfE) claim that he had held teaching posts at two of the world’s most illustrious institutions, Harvard and Cambridge, were not accurate. \n“I taught undergrads at Harvard and Cambridge and was paid to do so but these weren’t academic ‘posts’ and I’ve never made that claim,” he said in an interview. Read More Teenagers from North East least likely to head to university \nIt was also claimed that Mr Young had been appointed ahead of people who appeared better qualified for the role - including the former chief prosecutor for north-west England, Nazir Afzal, leading to accusations of ‘cronyism’. \nMs Blackman-Woods said: “If just a fraction of what people have put on social media about him is correct - and I’m not saying it all is - then I don’t think he suitable for the job.” \nMr Young has said he regrets “politically incorrect” remarks he made in the past - others have call these remarks simply offensive - and said he should be judged on his actions in promoting social mobility in education, saying he had championed meritocracy and rigour in education for decades \nA DfE spokesperson said: “Toby Young’s diverse experience includes time at Harvard and Cambridge as well as co-founding the successful West London Free School. Read More Tory MP's Brexit letter - North East universities to ignore 'sinister' information request \n“This experience will be vital in encouraging new providers and ensuring more universities are working effectively with schools. \n“The appointments to the board reflect the diverse needs of the higher education sector, young people and employers. \n“The OfS board’s broad range of skills and experience across the field of education will ensure it is able to deliver for students.” Like us on Facebook", "external_links": [], "published": "2018-01-05T18:00:00.000+02:00", "crawled": "2018-01-05T18:21:58.029+02:00", "highlightTitle": ""}