{"organizations": [], "uuid": "1c89d35f1da950c501b120fa9586e6964ac6bb5b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article1135792.ece/ALTERNATES/s1200/Fishing-copy-no-brand_smallJPG.jpg", "site_section": "http://www.devonlive.com/rss.xml", "section_title": "devonlive - frontpage", "url": "https://www.devonlive.com/news/devon-news/chinas-taste-crabs-south-devon-1135734", "country": "US", "title": "China's taste for crabs from South Devon is helping award-winning seafood firm grow", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T14:05:00.000+02:00", "replies_count": 0, "uuid": "1c89d35f1da950c501b120fa9586e6964ac6bb5b"}, "author": "Edward Oldfield", "url": "https://www.devonlive.com/news/devon-news/chinas-taste-crabs-south-devon-1135734", "ord_in_thread": 0, "title": "China's taste for crabs from South Devon is helping award-winning seafood firm grow", "locations": [], "entities": {"persons": [{"name": "david markham", "sentiment": "none"}], "locations": [{"name": "asia", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "south devon", "sentiment": "none"}, {"name": "paignton", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "torbay business park", "sentiment": "none"}], "organizations": [{"name": "blue sea food company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nCrab is one of the favourite foods in Asia - and they’ve certainly got a taste for the ones brought ashore from the South Devon coast. \nA live export service started by Torbay-based Blue Sea Food Company has seen rapid growth in the 18 months since it launched. \nThat is one reason the business, based at Torbay Business Park in Paignton, is set for overall growth of around 12 per cent this year - and a turnover of around £12m. \nThe company, which began in 2004, now processes around 2,000 tonnes of crab a year, with a workforce of between 120 and 200 depending on the time of year. Half of its output goes abroad, to Europe, Asia and the United States. \nThe business buys direct from the boat and from merchants around the UK, and boats fishing from South Devon ports such as Kingswear and Salcombe are still important sources for the company. Fishing for crab from the Dartmouth-based Nil Desperandum (Image: Blue Sea Food Company) \nSales director David Markham was reflecting on the fortunes of the company a year since it won the Growth in Overseas Markets section, and was judged overall winner, in the Herald Express South Devon Business Awards . \nMr Markham said: “The Asians love crab. They import it from all round the world, live and frozen, and we happen to have a product they like, at a good price. \n“Part of the reason the Chinese buy from the UK is that it is considered safe, regulated and dependable from an environmental point of view and in terms of production.” \nDevon ladies' business idea could revolutionise the way swimsuits are made forever - and they'll be on Dragon's Den this weekend Taking part in a seafood sales mission in Asia \nThe business has powered ahead despite a major setback in 2008 with a fire at its premises on the business park. The operation was quickly back up and running in the former Browse Brothers factory on Paignton Harbour. \nThe factory in Paignton was rebuilt and the team moved fully back to the business park in August last year. \nThe company is currently recruiting, with vacancies for operational staff. Anyone interested should apply via the company website . Read More How the South Devon Business Awards can give your business a major boost \nThe team is now looking a ways to increase its supply of crab, and aiming to grow the live export side of the business. Mr Markham added: “We are short of raw materials, and are looking at boat ownership or more strategic ties with boats.” David Markham, sales director of the Blue Sea Food Company \nDespite the economic jitters of Brexit, and the potential problems with the exchange rate and employing workers from European countries, the firm is confident that the demand for its products will keep it on its course for growth. \nMr Markham said success in the South Devon Business Awards had been a big boost for staff morale, and helped raise the profile of the business as a local employer. \nHe added: “It was great for the team here, and the award for being best in the Bay was fantastic.” \nYou can find out more and enter the Herald Express South Devon Business Awards here . Like us on Facebook ", "external_links": [], "published": "2018-01-30T14:05:00.000+02:00", "crawled": "2018-01-30T14:26:58.000+02:00", "highlightTitle": ""}