{"organizations": [], "uuid": "df08b3a03b87648b3fb9f1057f7760aee505fd79", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14172765.ece/ALTERNATES/s1200/Donald-Trump-state-visit.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/whats-on/whats-on-news/house-commons-speaker-john-bercow-14172289", "country": "GB", "domain_rank": 21960, "title": "House of Commons Speaker John Bercow to launch new season of free public lectures", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T20:00:00.000+02:00", "replies_count": 0, "uuid": "df08b3a03b87648b3fb9f1057f7760aee505fd79"}, "author": "David Whetstone", "url": "https://www.chroniclelive.co.uk/whats-on/whats-on-news/house-commons-speaker-john-bercow-14172289", "ord_in_thread": 0, "title": "House of Commons Speaker John Bercow to launch new season of free public lectures", "locations": [], "entities": {"persons": [{"name": "john bercow", "sentiment": "negative"}, {"name": "martin luther king", "sentiment": "none"}, {"name": "bercow", "sentiment": "none"}, {"name": "matthew barzun", "sentiment": "none"}], "locations": [{"name": "freedom city", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "house of commons", "sentiment": "negative"}, {"name": "newcastle university", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "What's On House of Commons Speaker John Bercow to launch new season of free public lectures It was in London a year ago that the Speaker promised to speak at Newcastle University and he has proved as good as his word Share Commons Speaker John Bercow (Image: PA) Share Get what's on   Thank you for subscribing!   \nThe Speaker of the House of Commons, John Bercow, is to visit Newcastle to fulfil a promise made in London exactly a year ago. \nIt was at the London launch of Freedom City, last year’s festival marking 50 years since Martin Luther King received an honorary degree at Newcastle University , that Mr Bercow offered to come and give a talk. \nHe was welcoming invited guests, including the then American Ambassador to the UK, Matthew Barzun, and MPs and cultural leaders from the North East, to the event at the grand Speaker’s House at the Commons. \nThe offer was immediately taken up and so Mr Bercow will open the new season of Insights free public lectures with a talk about modern democracy on Thursday, February 1. \nHe will take the chance to explain the role of the Speaker and the changes he has helped to introduce to the House of Commons since he was elected to the post in 2009. \nIn London last January Mr Bercow spoke passionately about an emerging ugly side to politics. \nHe said he had been shocked to see slogans such as “Go home Polish scum” daubed on buildings in the wake of the EU refrendum. \nHe said the values of Dr King, “a sense of fairness, a commitment to decency and a steady insistence on equal treatment”, had never been more pertinent. Outgoing US Ambassador to the UK Matthew Barzun with John Bercow, the Speaker, Newcastle Central MP Chi Onwurah and others at the Westminster launch of Freedom City 2017 (Image: Dawn Tudge, Newcastle University) \nThe Speaker, known for his cry of “Order, order”, makes sure MPs stick within the rules of debate. \nWhile remaining a constituency MP, he or she must be non-partisan. Mr Bercow, elected as Conservative MP for Buckingham in 1997, also served in the shadow cabinet. \nHis talk at the university will take place 100 years after the 1918 Representation of the People Act was passed. \nIt led to significant changes in the electoral system, including extending the right to vote to women over the age of 30 – a step towards equality with men at the ballot box which many women had campaigned long and hard for. \nOn February 8 there will be a lecture by Jane Robinson, author of Hearts And Minds: The Untold Story of the Great Pilgrimage and How Women Won the Vote. \nThe 1913 ‘pilgrimage’ saw hundreds of women taking part in a six-week protest march. They were the suffragists who, unlike the suffragettes, were trying to bring about change peacefully. Read More Enter the dystopian world of Anna Day, clinical psychologist and first-time author \nDr Martin Farr, co-chair of public lectures at Newcastle University, said: “One hundred years after thousands of women and men were given the right to vote, it seems appropriate that we start the new season of Insights public lectures with a look at modern democracy and one of the untold stories of how it came about. \n“Our public lectures are renowned for offering expert insight into a broad range of topical issues and we’re looking forward to welcoming leading public figures and world-class academics who are all recognised authorities on their subject.” \nMark Nichols, chairman of Northern Pride, will give a talk on February 20, coinciding with LGBT History Month. \nLord Hutton of Furness, who as John Hutton was a Labour MP and Defence Secretary under Gordon Brown, will talk on March 13 about Britain’s defence policy post-Brexit. Read More After a hotel fry-up, Kay Mellor is ready to discuss Fat Friends - coming to the Theatre Royal \nNewcastle University academics are also on the Insights programme. \nDr Alton Horsfall will talk about the technology of space exploration on April 19 and on May 3 Dr Rachel Hammersley will shed light on the history of May Day. \nDr Farr said: “The programme also features presentations from some of the university’s early career researchers who will talk about their research around biomedicine. \n“I’d urge people to come along to hear how their findings may underpin the medical treatments of tomorrow.” \nThe lectures take place at 5.30pm in the Curtis Auditorium in the university’s Herschel Building. \nFor details go to http://www.ncl.ac.uk/events/public-lectures/ Like us on Facebook", "external_links": [], "published": "2018-01-18T20:00:00.000+02:00", "crawled": "2018-01-18T21:35:38.000+02:00", "highlightTitle": ""}