{"organizations": [], "uuid": "284b2ce096af846f5efd9eba41ad79d46eb5c74f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article9584084.ece/ALTERNATES/s1200/JS67439477.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/meet-two-men-running-biggest-14179091", "country": "GB", "domain_rank": 21960, "title": "Meet the two men running the biggest firm in Newcastle that you've never heard of", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-21T10:00:00.000+02:00", "replies_count": 0, "uuid": "284b2ce096af846f5efd9eba41ad79d46eb5c74f"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/meet-two-men-running-biggest-14179091", "ord_in_thread": 0, "title": "Meet the two men running the biggest firm in Newcastle that you've never heard of", "locations": [], "entities": {"persons": [{"name": "alan wilson", "sentiment": "none"}, {"name": "paul jennings", "sentiment": "none"}], "locations": [{"name": "newcastle", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "invalid email  north p&i", "sentiment": "none"}, {"name": "north p&i club", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Meet the two men running the biggest firm in Newcastle that you've never heard of North P&I has been based in Newcastle since the 1800s but despite its headquarters on the Quayside it often goes unnoticed Share Paul Jennings and Alan Wilson, joint managing directors of North P&I Club Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nNorth P&I is one of the biggest companies in Newcastle, and the chances are you’ve never heard of it. \nThe company is one of the biggest shipping liability insurers in the world, and turns over more than $400m every year. But despite its size and prominent location on the Quayside most people in the city are more likely to know its neighbour, the Pitcher and Piano pub. \n“We’ve been mistaken for a hotel a few times,” laughs the firm’s managing director Paul Jennings. and its easy to see why. The office, which employs about 270 people, is located above a fairly conspicuous gym and near to a number of bars and restaurants. \nP&I clubs, such as North P&I, are hugely important to shipping companies, who must be able to prove that they have liability insurance whenever they enter a port anywhere in the world. \nThe insurance offered by these firms covers any damage that a ship might cause as well as cover for staff accidents and loss of life. There are only 13 clubs in the world who offer this type of insurance, with the Newcastle company being one of the biggest. Paul Jennings, managing partner at North P&I (Image: Unknown) \nNorth P&I’s roots spread back to 1860, but the business in its current form was formed in 1998 when North P&I merged with the Newcastle P&I Club. \nFollowing the merger, the company insured around two million tonnes of shipping and had less than 1% of the market share. But today the company insures 148m tonnes and has a 12% market share. \nMr Jennings said: “We have grown from just insuring one or two ships with a company when we started out. But some of the companies we have worked with have grown from relatively small businesses a few years ago. \n“For example we are the largest insurance provider in our field to the largest Mediterranean shipping company, MSC. We have grown with them and started with about four or five of there ships. They probably only had about six ships then but they are now running a fleet of 400.” \nBut the huge growth is only the beginning for North P&I, with the company continuing to expand and diversify. The business is also about to undergo a major change when Alan Wilson steps down from his role as joint managing director to take up a role as a non-executive director. \n18 for 2018: Here are the companies to watch in the North East next year \n“I have come to the point where I think it is the right time to step back,” said 62-year-old Mr Wilson, who has worked in the industry for over three decades. “It is quite hard running a business and quite stressful. Certain people can do it forever, some people adapt differently. I felt it was the right time for me personally and the right time for the business as there are new people coming through. \n“It also gives Paul a chance to shape his new leadership team. Although I will be around to help wherever I can.” Alan Wilson (Image: Newcastle Chronicle) \nTogether Mr Jennings and Mr Wilson have led North P&I since the two firms merged in 1998, and Mr Wilson’s retirement from the role will see the company relinquish its unusual joint managing director structure. \nThe pair say that between them they have carried out work that might usually be done by a chief executive, chief financial officer, and chief operations officer. Mr Jennings will now operate as sole CEO, and the firm has now appointed a new CFO and will soon be bringing in a CIO. \nThe new team will now be responsible for delivering North P&I’s growth strategy, which is focused on expanding its Sunderland Marine insurance business. Sunderland Marine was acquired by the firm in 2014 and provides a range of insurance products covering fishing and marine craft, protection and indemnity cover, and insurance for the Aquaculture and fisheries markets. \nDue to heavy regulations in the market, P&I Clubs are set up as non-profit organisations but are still required to offer the same level of cover to shipping firms at competitive prices. But Sunderland Marine has become an important part of North P&I’s strategy, because it is not governed by these rules and can therefore turn a profit. Read More Carillion's North East subcontractors and suppliers urged to seek help to minimise insolvency risk \nThis diversification is all part of the plan to help North P&I stay competitive. \n“Sunderland Marine insure, in the main, fishing vessels in the UK,” said Mr Jennings. “They cover some damage to fishing boats which is a slight diversification for us, but that is part of our diversification strategy. \n“We have need to grow that part of the business. We have gone through a process with Sunderland Marine over the last few years and we are coming to the end of the refining process. It operates as the only profit driven side of our business, which we then use to benefit the mutual, non-profit making side of the business. We are now looking to grow that. \n“At any one time we have a target that the fixed profit side of our business will be between 30% and 40% of our total income. So there is scope to grow that. Our income at the moment is around $440m.” \nMr Wilson added: “If we make a profit it means we can subsidise the premiums on the mutual members.” \nThe acquisition of Sunderland Marine was always intended to ensure that North P&I can remain competitive, but its importance has increased following the UK’s decision to leave the EU. \nWith the real possibility that many financial services firms will lose their passporting rights - the ability to offer their products and services in the EU - North P&I is being forced to open its doors in the Republic of Ireland. \n“The other thing looming on the horizon is of course Brexit and the anticipation that we will lose financial passporting rights,” said Mr Jennings. \n“40% of our business is considered to be domiciled in Europe and we need a financial passport to write that, which we have at the moment through being a member of the EU. If that goes in 2019 or at the end of the transition period then we need a European base to write that business. We are preparing on the basis that there will be a hard Brexit and there is no transition agreement reached by next March. \n“We plan to open our first subsidiary in Dublin which will give us access to the EU. We would need to start that with six or seven people.” \nThe new office is expected to add an additional £2m to the company’s costs, but the company is wasting no time, and the process of opening the new base is already well underway. \n“We are in the process where we are starting to apply for licences with the CBI (Central Bank of Ireland),” Mr Wilson said. “They are like the PRA and regulate insurance companies. We have already engaged with them over the last three or four months and we have been to see them a couple of times. \n“We have to apply for a licence which we hope to get by the middle of this year. By that time we will have identified individuals who will run the company and insure the ships. \n“By the end of this year it will be a fully operating office, where 40% of our business will go through. \n“There are something like 6,000 insurance companies in Britain that provide insurance to Europe and who are going to have to do something similar. It will be a huge cost for the country.” \nWhile North P&I says that the new branch should not lead to jobs being lost in Newcastle, it will make the firm “less competitive by definition”. \nEuropean firms that will not have to fork out additional cash to run new offices, will automatically be able to offer cheaper premiums compared to their UK-based rivals. \nBut North P&I’s contingency plans are well underway and the company is positive it can continue to stay competitive through its diversification efforts. The Newcastle firm has survived major changes to the shipping industry in the past and believes it can navigate the choppy waters ahead. Like us on Facebook", "external_links": [], "published": "2018-01-21T10:00:00.000+02:00", "crawled": "2018-01-21T10:42:39.004+02:00", "highlightTitle": ""}