{"organizations": [], "uuid": "a5787ef921721947b1f52956f80d87977dde8ee3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14105407.ece/ALTERNATES/s1200/lineup.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/tv/new-celebrity-big-brother-lineup-14095556", "country": "GB", "domain_rank": 21960, "title": "What is the lineup for the new series of Celebrity Big Brother on Channel 5?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T20:00:00.000+02:00", "replies_count": 0, "uuid": "a5787ef921721947b1f52956f80d87977dde8ee3"}, "author": "Simon Duke", "url": "http://www.chroniclelive.co.uk/news/tv/new-celebrity-big-brother-lineup-14095556", "ord_in_thread": 0, "title": "What is the lineup for the new series of Celebrity Big Brother on Channel 5?", "locations": [], "entities": {"persons": [{"name": "kim woodburn", "sentiment": "none"}], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "News What is the lineup for the new series of Celebrity Big Brother on Channel 5? These are stars set to appear in the latest series of Celebrity Big Brother - including a name familiar to North East viewers Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe new series of Celebrity Big Brother starts on Tuesday night and it looks like the lineup for the new series has been confirmed. \nA year after Kim Woodburn had everyone talking, the theme for the new run of the hit Channel show is The Year of the Woman, meaning that only female stars will go into the famous TV mad house on launch night. \nHowever, in true Big Brother style fans can expect plenty of twists and turns along the way. \nMale contestants will be introduced to the house later on in the series, with rumours flying that the first ones will be going in on Friday. When does it start? \nCelebrity Big Brother will start on Tuesday, January 2 at 9pm on Channel 5. \nThere are two series of the celeb version each year, with former Girls Aloud singer Sarah Harding winning the most recent one this summer. There is also a spin-off show which airs directly after, called Celebrity Big Brother’s Bit On The Side, it is hosted by Rylan Clark-Neal who is a former CBB winner. Read More \nEmma Willis will return to reprise her hosting duties. Rachel Johnson Rachel Johnson (Image: PA) \nBoris Johnson’s sister, Rachel has confirmed she will be appearing in this year’s series, the news was announced on the official Big Brother UK Twitter page. \nThe post read: “We can confirm that journalist @RachelSJohnson will be one of the female Celebrity Big Brother housemates entering the House live at 9pm, Tuesday 2nd January on @channel5_tv #CBB.” \nThe 52-year-old journalist also confirmed the news in her column for the Mail on Sunday, writing: “I’m going into the actual Big Brother House. For real. I know. Believe me, I know. \n“I am a firm believer that you only regret the things in life you don’t do, not the things you do do.” \nRachel will be following in her father Stanley’s footsteps, who recently appeared in I’m A Celebrity Get Me Out of Here on ITV. Malika Haqq \nKhloe Kardashian's best pal Malika Haqq, 34, was spotted at Heathrow Airport ahead of the show's launch. \nMalika, who has been close friends with Khloe Kardashian since they were 15, is believed to have been paid a \"huge amount\" to appear on the show. \nThis comes after Kim's close pal, Jonathan Cheban , entered CBB in 2016 while her ex Ray-J appeared on the show last year. India Willoughby India Willoughby (Image: Loose Women/ITV) \nIndia, 51, is the first transgender newscaster in Britain and has appeared on Loose Women to talk about her experience of transitioning. \nShe was born as Jonathan Willoughby and has worked as a TV reporter at ITV Border, as well as being a news presenter in the North East and Cumbria. Anne Widdicombe \nThe 70-year-old former Tory politician is pro Brexit and has in the past made it clear she isn't a fan of reality stars. Ann Widdecombe \nMore recently, Anne became the unlikely star of the Strictly ballroom after teaming up with Anton du Beke for the hit BBC show. Amanda Barrie Amanda Barrie as Alma Baldwin and Johnny Briggs as Mike Baldwin in Coronation Street (Image: Granada Television) \nNow 82, Amanda is most famous for playing Alma, the long suffering wife of Mike Baldwin in Coronation Street. \nHer death on the ITV soap was a real tearjerker and she then went on to play a very different role as one of the Costa Cons in Bad Girls. Ashley James Ashley James (Image: Photo by Jeff Spicer/Getty Images)) \nAshley appeared in two series of Made in Chelsea. Jess Impiazzi Jess Impiazzi arriving at the Magic Mike XXL European premiere in London \nJess is famous for appearing on MTV's Ex on the Beach. Last year she played Calum Best's leading lady on the big screen and could well be looking for love in the CBB house after her recent split from her rugby star fiancé Denny Solomona. Maggie Oliver \nHer battle to secure justice for the victims of a horrific grooming gang in Rochdale was turned into a hard-hitting BBC drama Three Girls last year. Maggie Oliver \nA central character in the programme and its real life proceedings, Maggie played a key role in bringing the abusers in the disturbing and harrowing Rochdale child sex grooming scandal to justice. The men . . . \n. These are the men rumoured to be going in . . . Pete Wicks Pete Wicks (Image: Ian West/PA Wire) \nThe Only Way Is Essex (TOWIE) regular, 29, could be swapping his glamorous lifestyle for a stint on the show. \nPete split with his girlfriend Megan McKenna this year and their messy break-up was heavily documented on TOWIE. \nMegan, 25, was a contestant on CBB in 2016 and was briefly removed from the house after a foul-mouthed rant directed at fellow housemates Tiffany Pollard and John Partridge. Jonny Mitchell \nAnother Essex native, Jonny rose to fame as a contestant on ITV’s Love Island this summer. Camilla and Jonny \nThe 26-year-old didn’t go down well with fans when he dumped fellow Islander Camilla Thurlow. \nJonny recently split up with Made In Chelsea star Stephanie Pratt. It’s believed that Channel 5 show bosses want him to spice things up in the house. Read More Ronan Keating, B*Witched, East 17 and more confirmed for two day music festival Andrew Brady \nThe 26-year-old appeared on The Apprentice this year, and was fired in week eight of the series. He currently works in the in the aerospace industry. Like us on Facebook", "external_links": [], "published": "2018-01-02T20:00:00.000+02:00", "crawled": "2018-01-02T20:59:18.008+02:00", "highlightTitle": ""}