{"organizations": [], "uuid": "b5c2417d7884b1aa08fa70133a987ed3a03d9f70", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14201172.ece/ALTERNATES/s1200/Tim-Cantle-Jones.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/newcastle-energy-supplier-future-energy-14201162", "country": "GB", "domain_rank": 21960, "title": "Newcastle energy supplier Future Energy ceases trading, leaving 12,000 customers in the dark", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T13:47:00.000+02:00", "replies_count": 0, "uuid": "b5c2417d7884b1aa08fa70133a987ed3a03d9f70"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/newcastle-energy-supplier-future-energy-14201162", "ord_in_thread": 0, "title": "Newcastle energy supplier Future Energy ceases trading, leaving 12,000 customers in the dark", "locations": [], "entities": {"persons": [{"name": "ofgem", "sentiment": "none"}, {"name": "tim cantle-jones", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}], "organizations": [{"name": "future energy", "sentiment": "negative"}, {"name": "newcastle", "sentiment": "negative"}, {"name": "yorkshire", "sentiment": "none"}, {"name": "newcastle journal", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Newcastle energy supplier Future Energy ceases trading, leaving 12,000 customers in the dark The small energy firm was founded by serial entrepreneur Tim Cantle-Jones to take on the Big Six suppliers Share David Stroud, chief executive of Future Energy (Image: Future Energy) Share Get business   Thank you for subscribing!   \nThe chief executive of Newcastle’s Future Energy has said the company was forced to close because it couldn’t muster the buying power to compete against the bigger, national energy suppliers. \nThe challenger supplier, which got its licence in 2015, ceased trading with immediate effect yesterday with the loss of 19 jobs, while its 12,000 customers are also in limbo. \nThe firm, launched by serial entrepreneur Tim Cantle-Jones to take on the Big Six suppliers and get the people of the North East and Yorkshire better value deals for their energy, had its headquarters and contact centre in Newcastle , where the closure was announced this morning. A gas and electric cooker ring on full power (Image: iStockphoto) \nDavid Stroud, chief executive officer, said: “The Board of Directors has reached the difficult decision to close the company. We have been unable to convert sufficient customers to enable us to forward purchase energy at the most competitive rates. \n“The marketplace is difficult for challenger energy suppliers, which lack the financial advantages of larger, national energy firms. We have tried but not succeeded and we regret the resulting loss of 19 jobs. \n“Our customers won’t be affected and will be protected by Ofgem, which will oversee the transfer to a new energy supplier, and we thank them for their loyal support.” \nRegulator Ofgem has moved to assure the company’s domestic customers that their energy supply will continue as normal and outstanding credit balances will be protected. Read More Department for International Trade falling behind on Brexit, alarming new report says \nOfgem said it would choose a new supplier to take on Future Energy’s customers, who will be contacted individually when the process is complete. \nIt advised Future Energy customers against switching supplier, but to take a meter reading and wait until the new supplier makes contact. \nRob Salter-Church, Ofgem’s interim senior partner for consumers and competition, said: “If you are a customer of Future Energy there is no need to worry as we will make sure your energy supplies are secure and your credit balance is protected. \n“Ofgem is working to choose a new supplier as quickly as possible for you. Whilst we’re doing this, our advice is to sit tight and don’t switch. \n“You can continue to rely on your energy supply as normal - in fact the only thing that will change is that you’ll get a new supplier.” Tim Cantle-Jones (Image: Newcastle Journal) \nTim Cantle-Jones, who founded the company but has not been a board member for some time, said: “As founder of the business I am devastated to see what has happened and I’m as shocked as anyone at the outcome. I’m no longer on the board so found out at the same time as everyone else. \n“Just to reassure customers, the process is seamless. While it’s devastating, particularly for myself, it won’t affect customers.” \nThis is not the first time a small energy business has collapsed, coming two years after GB Energy failed, leaving some 160,000 customers in limbo. Co-operative Energy was picked to take on its customers. Like us on Facebook", "external_links": [], "published": "2018-01-25T13:47:00.000+02:00", "crawled": "2018-01-25T14:16:21.085+02:00", "highlightTitle": ""}