{"organizations": [], "uuid": "33342da14aaf177e0b36e58ff87e2a1b297759fe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article1025508.ece/ALTERNATES/s1200/Ireland.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/news/business/brexit-shuffle-loughborough-based-cresco-1025483", "country": "US", "domain_rank": 48128, "title": "Brexit shuffle for Loughborough-based Cresco with new Galway office - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.019, "site_type": "news", "published": "2018-01-08T12:43:00.000+02:00", "replies_count": 0, "uuid": "33342da14aaf177e0b36e58ff87e2a1b297759fe"}, "author": "Tom Pegden", "url": "http://www.leicestermercury.co.uk/news/business/brexit-shuffle-loughborough-based-cresco-1025483", "ord_in_thread": 0, "title": "Brexit shuffle for Loughborough-based Cresco with new Galway office - Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "jo derbyshire", "sentiment": "none"}], "locations": [{"name": "cresco", "sentiment": "none"}, {"name": "leicester mercury new cresco", "sentiment": "none"}, {"name": "galway", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "republic of ireland", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "invalid email  a leicestershire", "sentiment": "none"}, {"name": "loughborough university science park", "sentiment": "none"}, {"name": "loughborough", "sentiment": "none"}, {"name": "advanced technology innovation centre", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "New Cresco office is in Galway Share Get Business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nA Leicestershire business hopes to prepare for the changes of Brexit by opening an office in the EU. \nLoughborough -based Cresco is opening the new office in Galway, in the Republic of Ireland. \nManagement hope it will support its growing Ireland operations in the run-up to and post-Brexit. \nThe company already has a team of eight and a bank of professional associates working from its head office at the Advanced Technology Innovation Centre at Loughborough University Science Park. \nThey specialise in securing grant funding for technology-based clients, raising around £30 million over the last few years. \nThey also help client companies identify opportunities to develop new products and services, and create support packages to take them to market. The Cresco team with chief executive Jo Derbyshire \nAs well as helping secure grants, they also help with business planning, intellectual property advice, access to finance and project management. \nClients work in various technology sectors, including healthcare and medical, manufacturing and materials. \nThe firm already has a history of collaboration with Irish companies, and the new office will see them establish roots at the Business Innovation Centre at the National University of Ireland in Galway (NUIG). \nCresco chief executive Jo Derbyshire said a growing number of UK companies had already moved some of their business operations to Ireland in preparation for Brexit, and Cresco see their partnership with the Irish university as a chance to create new opportunities between the UK and Ireland. \nOver the last 12 months, for instance, the team has won more than £4.5 million of finding for Irish clients from the EU’s H2020 programme. Cresco is based at Loughborough University's Advanced Technology Innovation Centre \nMs Derbyshire said: “We are very excited to formally establish our Irish operations. \n“We have been working with Irish clients for some time, and the opportunity of an office at the NUIG Business Innovation Centre is the ideal opportunity for us to build on the success we have enjoyed so far. \n“Cresco Ireland is a key pillar of our Brexit strategy.” \nShe said NUI Galway was a hotbed of innovation, particularly in the medical technology area, and the Business Innovation Centre had supported hundreds of companies, spin-ins and spin-outs. \nThe partnership with Cresco will lead to further grant potential and discussions are already underway with potential NUI Galway spin-outs and early-stage start-ups. Read More \nFiona Neary, manager of the Business Innovation Centre, said: “This is an exciting partnership with Cresco as NUI Galway continues to transform healthcare and the Medtech ecosystem. Read More How Mo Bro's prepared Dragon's Den pitch that got them £150k investment \n“Our vision is to create innovative medical technologies which are affordable and transformative for patients with both acute and chronic conditions. \n“This will bring us closer to the patient need, while also stimulating innovation and job creation though high-potential start-ups.” Like us on Facebook ", "external_links": [], "published": "2018-01-08T12:43:00.000+02:00", "crawled": "2018-01-08T13:57:30.000+02:00", "highlightTitle": ""}