{"organizations": [], "uuid": "f9a6e9bc98889b96e348ef45d4105f0e12a97f71", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article1099930.ece/ALTERNATES/s1200/30907872JPG.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/news/business/after-carillions-collapse-pick-everard-1099770", "country": "US", "domain_rank": 48128, "title": "After Carillion's collapse, Pick Everard boss Duncan Green asks what's next for property and construction - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.438, "site_type": "news", "published": "2018-01-22T14:12:00.000+02:00", "replies_count": 0, "uuid": "f9a6e9bc98889b96e348ef45d4105f0e12a97f71"}, "author": "Tom Pegden", "url": "http://www.leicestermercury.co.uk/news/business/after-carillions-collapse-pick-everard-1099770", "ord_in_thread": 0, "title": "After Carillion's collapse, Pick Everard boss Duncan Green asks what's next for property and construction - Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "carillion", "sentiment": "negative"}, {"name": "pick everard", "sentiment": "negative"}, {"name": "duncan green", "sentiment": "negative"}, {"name": "brexit", "sentiment": "none"}, {"name": "beth walsh", "sentiment": "none"}], "locations": [{"name": "carillion", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "After Carillion's collapse, Pick Everard boss Duncan Green asks what's next for property and construction \"Brexit was a big concern for construction industry – and is a worry that hasn’t completely disappeared\" Share Duncan Green, managing partner of national architecture and building consultancy Pick Everard (Image: Beth Walsh) Share Get Business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nFollowing the collapse of Carillion, Duncan Green - boss of property and construction consultancy Pick Everard - on the obstacles, successes and political changes in construction... Brexit – is it all doom and gloom? \nBrexit was a big concern for the construction industry at the start of the year – and this is a worry that hasn’t completely disappeared. \nConfidence in the market has slowly started to return but as negotiations continue we are certainly not out of difficult waters just yet and confidence in markets is the most important factor. Political instability \nA number of political changes have obviously also had their effect – from a snap election to a new US President - and there have been national and international programmes of work which have had to adapt to changes in the political landscape. \nAs always, we’ve remained resilient and flexible and have managed, as an industry, to handle anything that’s thrown at us. \nI hope for a calmer political landscape in 2018, giving us some much-needed stability and ensuring that national schemes are able to get underway. Mainline services from Leicester could join HS2 at a big new station in Toton, Notts National projects \nA number of high profile projects made the headlines in 2017 – HS2 , Heathrow ’s third runway and London’s Crossrail. \nThe UK’s infrastructure has been a high priority for the government for some time – and rightly so. \nWith ambitious new housing targets and a bid to get more start-ups off the ground, the UK is going to have to respond with improved connections but there is still some way to go. \nThese national infrastructure projects are a step in the right direction but I hope that 2018 sees more in terms of Northern/Southern connections as well as improved global connectivity. \nThe Cabinet Office is predicting major increases in investment in energy and flood defence and we are already targeting these markets. Pick Everard’s 2017 \nWithin Pick Everard itself, we’ve completed some fantastic projects of which I’m very proud. \nWe have worked across the UK on some really transformative schemes including: The Discovery Building at BioCity in Nottingham, a multi-million pound bioscience centre which boasts the most incredible LED cladding which has lights mirroring solar flares in the Earth’s atmosphere The Oculus at Warwick University, which is an architecturally stunning, flagship multi-use teaching facility The architecturally significant Riverside Ice and Leisure facility in Chelmsford A scheme of 250 residential units in Hillingdon with St Modwen as well as a new school for 800 pupils in Jersey - Les Quennevais Pick Everard worked on The Oculus at University of Warwick \nEncouraging increased gender diversity in the construction industry has continued to be a ‘hot topic’. \nThis year, we held our own ‘women in the construction’ campaign, showcasing what incredible talent we have in industry. \nWomen hold some of the top positions at Pick Everard but we appreciate that there’s still a long way to go before we see real gender equality in the industry. \nGirls need to be inspired and encouraged to take up STEM subjects earlier to promote the construction industry as a viable and exciting career choice. \nIt’s fantastic that there are more and more women realising the opportunities available to them within the industry and that it’s certainly no longer a ‘boys’ club’. \nWith a skills gap that needs addressing, now is the ideal time to be promoting jobs to talented young professionals and I’m looking forward to see what the future will bring for women in the industry. 2018 – what’s next? \nLooking to the future, we ended the year with the first Autumn Budget announced by Philip Hammond, detailing further investment into T levels, a new system to encourage more students to take maths for A Level by rewarding schools and a new Transforming Cities fund which aims to improve transport connections as well as fibre optic broadband. \nThese are all positive moves in terms of bringing us up to speed and generally stimulate productivity. \nI expect to see housebuilding continuing to increase, with new government interventions due to stimulate this area of the market, along with the surrounding infrastructure projects. Read More \nThe UK’s slowing economic growth is due to impact the construction industry in 2018 but, with general confidence in the market continuing to improve, I am optimistic for the future of our industry. Read More Best business people in Leicester revealed at Mercury awards ceremony \nIf the terms of the Brexit divorce bill can be agreed upon quickly then we can really start to look to the future with a better understanding of where the UK is moving in terms of construction and output. \nI’m confident that, with a properly skilled workforce, 2018 will be a good year for the construction industry – I look forward to seeing more being done in terms of encouraging industry apprenticeships and training to secure our future. Like us on Facebook", "external_links": [], "published": "2018-01-22T14:12:00.000+02:00", "crawled": "2018-01-22T16:11:59.049+02:00", "highlightTitle": ""}