{"organizations": [], "uuid": "fadf2da0087b984810e18e2f49911d33f85b62d9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14159900.ece/ALTERNATES/s1200/US-Ambassador.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/american-ambassador-uk-spoke-boss-14159783", "country": "GB", "domain_rank": 21960, "title": "The American Ambassador to the UK spoke about his boss after a low profile visit to Newcastle", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T22:30:00.000+02:00", "replies_count": 0, "uuid": "fadf2da0087b984810e18e2f49911d33f85b62d9"}, "author": "David Whetstone", "url": "http://www.chroniclelive.co.uk/news/american-ambassador-uk-spoke-boss-14159783", "ord_in_thread": 0, "title": "The American Ambassador to the UK spoke about his boss after a low profile visit to Newcastle", "locations": [], "entities": {"persons": [{"name": "robert wood johnson", "sentiment": "none"}, {"name": "curt taylor", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "newcastle news", "sentiment": "negative"}, {"name": "pearson engineering", "sentiment": "none"}, {"name": "new york jets", "sentiment": "none"}, {"name": "johnson & johnson", "sentiment": "none"}, {"name": "newcastle university", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "armstrong works", "sentiment": "none"}, {"name": "new york jets american", "sentiment": "none"}, {"name": "reece group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News The American Ambassador to the UK spoke about his boss after a low profile visit to Newcastle Ambassador Robert Wood Johnson, billionaire businessman and New York Jets owner, said he liked what he'd seen in the city Share American Ambassador to the UK, Robert Wood Johnson, at Newcastle University (Image: Curt Taylor) Share Get   \nStrong feelings whipped up by President Trump were given no vent in the North East yesterday as his representative in the UK, Ambassador Robert Wood Johnson, paid a quiet visit to Newcastle on Martin Luther King Day. \nThe billionaire businessman, a member of the Johnson & Johnson pharmaceuticals giant and owner of the New York Jets American football team, met academics, scientific researchers and business leaders. \nInvited to the city by NE1, the business improvement district, he visited The Reece Group, based at the Armstrong Works, whose interests lie in defence, oil and gas, power generation, construction and the subsea sector. \nPearson Engineering, one of the group’s companies, develops and supplies defence equipment to the US armed forces. \nThe Ambassador also visited Newcastle University ’s Institute of Genetic Medicine based at the Life Science Centre where he met researchers who work alongside NHS staff. The American Ambassador to the UK, Robert Wood Johnson, left, admires the Martin Luther King statue at Newcastle University with Sean Bullick, chief executive of NE1 (Image: Curt Taylor) \nBut his day, after arriving by train, began at Newcastle University where he was shown the new statue of Martin Luther King and the film of the speech Dr King delivered when receiving his honorary degree in 1967. \nAfterwards he said: “It’s my first trip to Newcastle and I was just saying how impressed by what’s here, at the university and now at the Institute of Genetic Medicine and at The Reece Group and what they do, saving a lot of American... a lot of international lives with their minesweeping and that kind of thing. \n“And particularly, on this day, with Martin Luther King. I saw the statue and the room where he spoke and also the movie – and it was poignant. \n“He was talking about poverty and war and racism and progress has been made but more progress is needed.” \nAccusations of racism have been thrown at President Trump, particularly in relation to alleged recent remarks about people from African countries and others. \nThat’s not all. He also made headlines at the weekend for his apparent refusal to visit London to open the new American Embassy. \nThe hectic, headline-making life of President Trump has also been described in Michael Wolff’s controversial new book, Fire and Fury: Inside the Trump White House. \nBut the Ambassador, who said he hadn’t read the book, spoke about getting on with business. \nHe said President Trump had said of Dr King “how important it was that we focus on war, poverty and racism, so our job is just to bring it forward”. Read More 'Donald Trump and his allies aren't welcome': Fury at American ambassador's Tyneside visit \nThat said, the President’s agenda was “security and prosperity”. \n“You can’t really have prosperity without security and my job is to get to know the players in the UK at all levels, GCHQ, MI5, MI6 – all the agencies working on our collective security. \n“It seems the trust level is high between our two countries. It’s the highest of probably any ally we have in the world.” \nAmbassador Johnson said he didn’t think Britain needed reassurance about the supposed special relationship between the countries. \n“I think you’re pretty confident people. The President wants America first because he thinks previous administrations didn’t treat America fairly. \n“But he doesn’t think of it exclusively for Americans because he knows we need a strong and prosperous world to sell our products.” \nThe Ambassador said he had known President Trump for a long time and hadn’t been too surprised when he ran for President, recalling Oprah Winfrey asking him that question about 30 years ago. \n“I’ve seen the way he manages his business and I know the people who work for him. I know the loyalty they have for him, particularly the women in management. The American Ambassador to the UK, Robert Wood Johnson, left, with Sean Bullick, chief executive of NE1 (Image: Curt Taylor) \n“He’s got so many women running his real estate business and they wouldn’t work for somebody they didn’t respect.” \nThe Ambassador and 15 North East business leaders, many with trade links to the United States, had lunch at city centre restaurant Blackfriars, also hosted by the North East Chamber of Commerce. \nTo those who might protest about a visit to the UK by President Trump, the Ambassador said: “The great thing about this country is you do have freedom of expression and that’s a major plus. \n“A lot of people in the world don’t have that right. \n“We have every right to share our feelings but also to respect them. US/UK is a strong partnership and I think we have to respect each other before we bang on the table.” \nAsked if President Trump wanted to come to the UK, the Ambassador said: “I think he does want to come but he’s got a busy schedule. I’m hoping when he comes here he’ll get a good reception – and I think he will.” \nThe Ambassador didn’t rule out another visit to Newcastle. \n“This is a happening place,” he said. “You’ve got a port, you’ve got industry, you’ve got science and academics and apparently a great workforce... and you’ve got Sting. \n“You’ve got a lot of good stuff. This is an impressive place.” Read More MPs   \nMusic to the ears of Sean Bullick, chief executive of NE1, who said: “In this post-Brexit world, a time when the UK is looking to build relationships with countries outside the EU, we are trying to get ahead of the curve by further developing trade and investment links with countries including the United States.” \nProf Chris Day, vice-chancellor of Newcastle University, said it had been fitting that the Ambassador had chosen to visit Newcastle on Martin Luther King Day. \nHe added: “One of our key priorities is to deliver teaching and research projects that address the needs and challenges of a global society, and our collaborations with partners in the US and elsewhere around the world are a huge part of that.” Like us on Facebook", "external_links": [], "published": "2018-01-15T22:30:00.000+02:00", "crawled": "2018-01-15T22:48:50.000+02:00", "highlightTitle": ""}