{"organizations": [], "uuid": "85b3cbce55ff9d3ca83af1f5c8645d8884e660e9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13176862.ece/ALTERNATES/s1200/JS76550720.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14225209", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Outsourcing firm Capita to overhaul business as it warns over profits", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T10:00:00.000+02:00", "replies_count": 0, "uuid": "85b3cbce55ff9d3ca83af1f5c8645d8884e660e9"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14225209", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Outsourcing firm Capita to overhaul business as it warns over profits", "locations": [], "entities": {"persons": [{"name": "jonathon manning", "sentiment": "negative"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "capita", "sentiment": "negative"}, {"name": "smmt", "sentiment": "none"}, {"name": "society of motor manufacturers", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning Car production falls for first time in eight years \nCar production fell last year for the first time in eight years after a near 10% drop in domestic demand, new figures revealDespite the decline, the 1.67 million cars built in this country was still the second highest figure since the turn of the century, said the Society of Motor Manufacturers and Traders (SMMT).Domestic demand for new cars was down by almost 10% last year amid falling economic confidence and “confusion” over the Government’s policy on diesel cars, the trade body reported.Exports fell by 1.1%, but overseas demand continued to dominate production, accounting for four out of five of all UK car output.The EU remained the UK’s biggest trading partner, with over half of exports, while there were big increases in countries including Japan (25%), China (19%), Canada (19%) and the United States (7%).The production figure is around 130,000 below the forecast last year from the SMMT, which urged the Government to give some “clarity” on the transitional arrangements for Brexit.Investment by the car industry fell by a third last year to £1.1bn, down from £1.66bn in 2016 and well down on the average for the past few years.SMMT chief executive Mike Hawes said the investment fall was “significant”, adding: \nA drop of that magnitude is a concern. \nPeople are waiting as long as they can for increased certainty. The UK automotive industry continues to produce cars that are in strong demand across the world and it’s encouraging to see growth in many markets. \nHowever, we urgently need clarity on the transitional arrangements for Brexit, arrangements which must retain all the current benefits else around 10% of our exports could be threatened overnight. \nWe compete in a global race to produce the best cars and must continue to attract investment to remain competitive. \nWhilst such investment is often cyclical, the evidence is that it is now stalling so we need rapid progress on trade discussions to safeguard jobs and stimulate future growth. The Nissan factory in Sunderland has manufactured the first of its new Leaf model electric cars (Image: Unknown) 9:16 Jonathon Manning Noel Edmonds set for court battle with Lloyds after securing funds \nTelevision star Noel Edmonds has secured litigation funding to pursue Lloyds through the courts as he seeks up to £60m in compensation from the banking giant.The former Deal Or No Deal presenter is seeking financial redress from the lender after falling victim to fraud by former staff at HBOS Reading, which Lloyds rescued at the height of the financial crisis.On Wednesday Mr Edmonds confirmed he had secured a “seven-figure” sum from specialist litigation funder Therium to bankroll his case. \nHe said: \nThis is massively significant for me and for the victims of Lloyds’ criminality. \nIt is a firm endorsement of my case, Therium do not take on a case where they think there’s a chance of losing. \nTherium, which helps fund lawsuits and then takes a portion of the damages if successful, is also behind a class action lawsuit against car giant Volkswagen over the emissions scandal.The deal the TV star struck with the group also means he is insured against any costs orders that might be made against him.He is pursing Lloyds for damages for losses allegedly suffered when his former business Unique Group was destroyed because of the fraud.Mr Edmonds added that after receiving a “derisory” compensation offer, he was left “with no alternative but to start legal proceedings”.Timothy Mayer, from Therium, said: \nWe fund legal actions on behalf of individuals, groups and companies which are meritorious and where the funding provides access to justice. \nThis includes cases that would otherwise struggle to make it to court, given the costs of taking legal action, especially when going against one of the country’s largest retail banks. \nMr Edmonds’ solicitor Jonathan Coad, of Keystone Law, is preparing for the next steps in what he described as a “David vs Goliath” battle.He added: \nWe can now start to prepare the proceedings in earnest. \nThis will begin by an application to set aside the settlement agreement which concluded the bank’s 2008 claim against Noel on his personal guarantee, which we say was obtained by fraud on the part of the bank. \nAs well as the bank’s fraud, we will also be relying on the overwhelming evidence of the deliberate concealment by Lloyds of its wrongdoing to defeat any limitation defence. Noel Edmonds Jonathon Manning Nissan to create 1,000 electric car chargers in 'world first' project \nSunderland’s Nissan factory has won a leading role in developing the world’s first vehicle-to-grid (V2G) project that will see 1,000 charging stations installed across the UK. \nThe e4Futures project has been designed to help alleviate pressure on the National Grid, by using electric vehicles to pump energy back into the network while they are parked. \nYesterday the Department for Business, Energy and Industrial Strategy (BEIS) minister Richard Harrington awarded £9.8m to get the demonstrator project up and running. \nThe V2G network will be the first of its kind in the world, and is being led by a consortium of experts in the electric vehicle field. \nNissan is heading up the consortium, which also includes infrastructure specialist Nuvve, National Grid, UK Power Networks, and Northern Powergrid. Newcastle University and Imperial College London will also be carrying out research and analysis work on the project. \nMyriam Neaimeh, Newcastle University’s project lead on V2G, said: \nThe Government’s announcement will be a real game changer as we move towards decarbonising the grid. \nThis will be the first, large scale demonstration of vehicle-to-grid technology anywhere in the world and crucially, this project brings together all the key players for the first time – a giant of the automotive industry with energy providers, infrastructure experts and academics - so we can work together to really make this happen. \nIt’s a really exciting time and fantastic that Newcastle University has been involved right from the beginning. Myriam Neaimeh (Image: Newcastle Chronicle) 9:00 KEY EVENT Jobs go as Dewhirst Mill closes in Ashington \nA dozen jobs have been lost in Ashington after a retail and concession store Dewhirst Mill has closed its doors. \nThe large factory outlet store specialised in selling reduced price clothing and boasted around 70 concession partners. It sold products from a range of major companies such as Marks and Spencer. \nBut Dewhirst Mill was forced to shut its doors for good after its owner, Anderson Dewhirst Limited, entered liquidation. \nThe company’s liquidator Greg Whitehead, from Newcastle’s Northpoint Associates, said: \nDewhirst Mill, in its latest guise, was opened as a family run business in 2015. It managed to recover an element of the Dewhirst Factory’s history by securing Marks and Spencer clothing for which the previous Dewhirst Factory was well known. \nSignificant unforeseen property costs meant that business has been tough from the start. In recent times the company has diversified with the opening of a café and a hand car wash. Unfortunately, these additional offerings were not sufficient to cover the losses being made by the backbone of the business, being the concession business. \nThe 2017 Christmas period did not achieve the results that had been hoped for forecast and were required to justify continued trade. As a result, Dewhirst Mill ceased to trade on 9 January 2018 and all staff were made redundant. \nThe closure of the business has led to the loss of 12 jobs. \nDewhirst Factory was historically used as an established manufacturing clothing base when a principal customer was Marks and Spencer. Money (Image: PA) Jonathon Manning City watchdog 'content' to publish full report into RBS' restructuring unit \nThe City watchdog has confirmed plans to publish the full report detailing failings at Royal Bank of Scotland’s controversial restructuring unit after the bank’s bosses said they would not object to its release.Financial Conduct Authority (FCA) said it was “content” to do so on the basis that RBS would not block the move, and would start approaching individuals identified in the report to grant their permission.It marks a U-turn for the Financial Conduct Authority (FCA) which had previously refused on grounds that the skilled persons or Section 166 review - which collects insight about a firm’s activities from third parties - would mean revealing confidential information about the individuals who contributed to it.But the FCA changed its mind just hours after Treasury Select Committee chair Nicky Morgan pushed RBS bosses on whether they would give permission for the report’s release.Mr McEwan told MPs on Tuesday: \nShould the FCA want to report it, we will not object. \nI will let Andrew Bailey know that as well. \nUp to this point, only a summary had been provided by the FCA, despite its leak to the likes of the BBC.In its own statement the FCA said: \nThe FCA welcomes the statement by Royal Bank of Scotland, given at today’s Treasury Committee hearing, that they will not object to the FCA publishing the s166 report into the treatment of small and medium-sized enterprise customers transferred to its Global Restructuring Group. \nOn this basis, we are content to publish the s166 report. \nTo do so will also require the consent of those who provided the information in the report and any individuals who are identified. \nWe will approach these individuals, once the work on the focused investigation is completed, to ask for their consent to publish. A Royal Bank of Scotland sign (Image: Philip Toscano/PA Wire) 8:40 KEY EVENT North East manufacturing bosses received highest pay \nThe highest paid region for the pay of directors in manufacturing firms is the North East, with a median basic of over £86,100, according to a new study.The second highest paying area is the West Midlands at £83,600, closely followed by the South West and North West, said the EEF.The manufacturers’ organisation said the biggest increase last year was 8% for directors in rubber, plastics and chemical firms.Two out of three directors received a bonus last year, averaging almost £22,000, the research among almost 200 firms found.Amanda Norris of the EEF said: \nThe rise in pay revealed in our latest update on directors’ reward reinforces the importance of manufacturers having up-to-date market information on remuneration, to help them recruit and retain those employees essential to the running of their business. \nThe increases are also another positive sign to add to the strong performance we reported in our last survey on business conditions in the sector. Workers in a factory (Image: PA) 8:35 Jonathon Manning Revenues rise at Newcastle architecture firm Ryder with work around the world \nOne of the region’s premier architectural practices has seen revenues increase though profits fell slightly as the firm’s cost of sales increased. \nRyder Architecture recorded a 3% increase in turnover to £11.5m in the year ending April 30, 2017. For the same period, operating profit fell from £1.5m to £990,000, while net assets increased 36% to £2,185,862 \nThe practice, which is based in Newcastle but has offices in London, Liverpool, Glasgow, Hong Kong and Vancouver, has been involved in a number of high-profile schemes in the region, including the refurbishment of Newcastle’s Central Station, the new Sunderland HQ of online gambling firm tombola and New College Durham. \nIn newly published accounts, managing partner Mark Thompson said that Ryder was working across a number of sectors in the UK and was also seeing overseas growth thanks to its Hong Kong office and work with partners in Australia, Hungary and Spain. \nFollowing the year end, Ryder bought Devereux Architecture in London to expand its presence in the capital and add to its expertise in the healthcare market. \nMr Thompson said: \nWe continue to grow in Hong Kong with projects across our established sectors and have won some significant commissions in the UK offering an integrated and comprehensive service to our clients. \nThe office, manufacturing and residential sectors involve us working with a broad range of developers, contractors and end users. The success of these factors requires us to continue to be responsive to our clients and also demands a strong economy, climate for investment and a positive planning environment or location. Mark Thompson, Ryder Architecture KEY EVENT Your move owner snaps up mortgage business \nNewcastle’s LSL Property Services Plc has boosted its strategy of becoming a “leading mortgage distributor” after acquiring a financial services firm in Solihull. \nLSL, which owns a number of property brands such as Your Move, has acquired Personal Touch Financial Services Limited (PTFS) along with its subsidiary firm Personal Touch Administration Services Limited. \nThe finance company specialises in the provision of mortgage and other financial services products via a network of intermediaries. \nThe deal was valued at £4.8m, which was made up of a £2.8m payment on completion and a £2m deferred payment for 12 months. \nIan Crabb, Group Chief Executive of LSL, said: \nThis acquisition supports LSL’s stated strategy of enhancing its position as a leading mortgage distributor and growing long-term profitability in the provision of residential property services in the UK by identifying value enhancing opportunities. \nLSL has deep sector expertise in the provision of financial services and PTFS is an excellent fit with our existing financial services businesses. Your Move lettings board (Image: Pic from Your Move media centre) 8:25 Jonathon Manning Bank of England governor calls into question purpose of retail prices index \nThe governor of the Bank of England has questioned the purpose of the Retail Prices Index (RPI), saying the much-criticised rate had “known errors” and it would be better to focus on one measure of inflation.In a House of Lords committee hearing, Mark Carney urged the Government to scrap the use of RPI on future contracts.He said it was sensible to pick a date to begin transitioning off the measure, which is still used to determine rail fare costs, interest rates on student loans and to calculate returns on index-linked gilts.RPI, which is prone to volatility and is no longer classed as a national statistic, tends to track higher than the Consumer Prices Index (CPI), sitting at 4.1% in December, compared with CPI’s 3%.Mr Carney’s call came during a wide-ranging hearing where he defended the Bank’s economic forecasts surrounding Brexit and backed business investment to pick up next year.Speaking to the Lords Economic Affairs Committee, Mr Carney said: \nThere are some known errors (in RPI) acknowledged by the Office for National Statistics (ONS) and recognised by a number of external commentators, and we would share some of those views. \nGiven the acknowledged challenges with RPI, the first thing would be not to further embed RPI in contracts, particularly public-service contracts. \nHe said “a carefully-timed transition” would be needed to push through change because of the values at stake, but said it would be better to begin indexing contracts around a single measure of inflation.He added: \nIt would be helpful to just have one public-facing measure of the cost of living for consumers and at the moment we have RPI, which most would acknowledge has no merit, we have CPI, which virtually everyone recognises and is in our remit, and we have the ONS favourite CPIH, which includes housing costs. Mark Carney, Governor of the Bank of England (Image: PA) 8:20 Jonathon Manning Newcastle lawyers on UK list of 'hottest' people working in the law \nThe heads of two of Newcastle’s top legal firms have been named as some of the “hottest” lawyers in the country . \nWomble Bond Dickinson managing partner Jonathan Blair and Sintons Law managing partner Mark Quigley have both been included in The Lawyer magazine’s Hot 100 list, which celebrates the achievements of the country’s top lawyers. \nBoth men won spots in the leaders category of the list for their work running their respective firms. \nMr Blair was praised for his work pulling off a transatlantic merger between legacy North East firm Bond Dickinson and Womble Carlyle Sandridge & Rice in the US. The deal went live in November, creating a £340m firm with more than 1,000 lawyers. \nThe business then went on to carry out another merger, when it acquired Blakeley Sokoloff Taylor Zafman on the US West Coast. \nBond Dickinson’s transformation into a transatlantic firm is even more impressive considering it was shaken by the financial crisis, when Northern Rock - a major client - collapsed. \nMr Blair said: \nIt’s very flattering to have been named in the UK Leader category of the Lawyer Hot 100. 2017 was certainly a year of transformational change for our firm. This culminated in the launch of Womble Bond Dickinson in November which fulfilled our vision to be a Top 20 UK law firm by 2020. \nIn the months and years ahead, I look forward to working with our people to build on our successes, strengthening our domestic opportunities and delivering on the transatlantic platform we built with the US. \nMark Quigley made the Hot 100 list for his work as Sintons’ first managing partner. \nSince taking up the reins, Mr Quigley has led a major investment in Sintons’ technology and data centres, while simultaneously implementing a firmwide salary review. Jonathan Blair UK managing partner of Womble Bond Dickinson (Image: Mark Savage Photography) 8:15 ", "external_links": [], "published": "2018-01-31T10:00:00.000+02:00", "crawled": "2018-01-31T11:40:27.008+02:00", "highlightTitle": ""}