{"organizations": [], "uuid": "186c65940146455f572efd4d0c335d513603f052", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14106342.ece/ALTERNATES/s1200/Brexit.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/leaked-document-suggests-north-east-14222865", "country": "GB", "domain_rank": 21960, "title": "Leaked document suggests the North East will be badly hit by Brexit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T19:47:00.000+02:00", "replies_count": 0, "uuid": "186c65940146455f572efd4d0c335d513603f052"}, "author": "Sean Seddon", "url": "https://www.chroniclelive.co.uk/news/north-east-news/leaked-document-suggests-north-east-14222865", "ord_in_thread": 0, "title": "Leaked document suggests the North East will be badly hit by Brexit", "locations": [], "entities": {"persons": [{"name": "david davis", "sentiment": "none"}, {"name": "steve baker", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "brexit news leaked", "sentiment": "negative"}, {"name": "buzzfeed news", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "buzzfeed news share eu", "sentiment": "none"}, {"name": "whitehall", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Leaked document suggests the North East will be badly hit by Brexit The Government is under pressure to release impact analysis of UK's departure from the EU after a report by Buzzfeed News Share EU and Union flags (Image: PA) Share   \nThe Government is under renewed pressure to release confidential analysis of how the UK’s departure from the EU will affect the economy after a damaging leak \nWhitehall research seen by Buzzfeed News, which reportedly found the North East is forecast to suffer post-Brexit , sparked an emergency debate in the House of Commons. \nChronicleLive has not seen the leaked document but government minister Steve Baker confirmed its authenticity, although he said it was flawed and incomplete. \nMinisters have been under pressure to disclose internal studies on the impact of Brexit after David Davis first alluded to their existence last year. \nThe latest leaked document, which is titled “EU Exit Analysis - Cross Whitehall Briefing”, has led to further accusations that the Government is burying bad news. Brexit secretary David Davis (Image: PA) \nDated January 2018, the new document models various post-Brexit scenarios and finds that all will lead to lower growth nationally. \nAccording to Buzzfeed, the report finds the North East will be disproportionately disadvantaged, along with Northern Ireland and the West Midlands. \nIt comes as mixed news surfaces about international investment in the region in a report to the North East Combined Authority. \nBetween April and November last year, 49 foreign businesses put money into the North East, creating 1,208 jobs. Read More Nissan to create 1,000 electric car chargers in 'world first' project \nAlthough the number of businesses investing rose from 38 compared with the same period in the previous year, the number of jobs created plummeted from 3,993. \nLabour MEP Jude Kirton-Darling said: “My Labour colleagues and I have been calling for Brexit impact assessments for 18 months. North-east MEP Jude Kirton-Darling \n“To hear they won’t be released because they are “embarrassing” is shameful on the part of the UK Government. \n“It’s great that businesses are still putting money into the North East but many investment decisions being announced now may have been made before the referendum. \n“Of course trade, investment and business will continue after we leave the EU but if the evidence shows that this will be smaller then the knock on effect on our regional economy could be devastating.” \nLabour Paul Brannen MEP said: “The continuing saga of the Brexit impact assessments is already embarrassing for this incompetent government. \n“The people of the North East deserve to know the true picture of how they will be affected by Brexit and I would again call for the documents to be made fully public.” Paul Brannen \nStephen Baker, a minister for the Department for Exiting the European Union and pivotal figure in the Vote Leave movement, responded to an urgent question in the Commons on January 30. \nHe said the department’s position was not to release impact analysis documents until MPs come to vote on the final deal with the EU. \nMr Baker added the government “could not be expected to put information in the public domain” while negotiations are ongoing. Read More What is the EU withdrawal bill and why is it so important for Brexit? \nQuestioning the quality and relevance of the leaked report, he said that it only considers “off the shelf” trade options and not “what the government is seeking”, adding he believed the calculations were flawed and that it was “government’s job to improve on the analysis”. \nIndependent MEP Jonathan Arnott said he still believed Brexit would boost the North East but said he feared the government’s approach would deprive the region of short term gains. \nMr Arnott, who recently walked away from UKIP, said: “Every time one of these forecasts come out, just like during the Euro debate or the referendum campaign, they turn out to be disconnected from the reality of what happens. Jonathan Arnott (Image: Getty Images Europe) \n“My worry is that the language coming from government about what they want to achieve is incredibly unimaginative. \n“The North East is a trading region and we should be talking about developing that rather than just trying to copy what already exists and ignoring ambitious, global opportunities. \n“I’m still convinced Brexit will be a good thing for the region in the long-run but, if the government’s mishandling of it continues, we may not get those advantages of leaving in the short term.” \nNewcastle Central MP Chi Onwurah accused the government of “dishonesty” and “hiding the facts”, while Newcastle North MP Catherine McKinnell said the leak suggests the “government shares her view the North East’s economy is most exposed to the risks of leaving the EU”. \nA Government spokesperson said: “We have already set out that the Government is undertaking a wide range of ongoing analysis in support of our EU exit negotiations and preparations. \n“We have been clear that we are not prepared to provide a running commentary on any aspect of this ongoing internal work.” Like us on Facebook", "external_links": [], "published": "2018-01-30T19:47:00.000+02:00", "crawled": "2018-01-30T20:04:13.023+02:00", "highlightTitle": ""}