{"organizations": [], "uuid": "b8fe597aba1fd16b1620495ac5c7f8ec35a2f2e9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14102951.ece/ALTERNATES/s1200/Untitled-designa.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/mps-urge-government-allow-local-14189487", "country": "GB", "domain_rank": 21960, "title": "MPs urge Government to allow local councils to apply for cash for new homes", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T20:37:00.000+02:00", "replies_count": 0, "uuid": "b8fe597aba1fd16b1620495ac5c7f8ec35a2f2e9"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/mps-urge-government-allow-local-14189487", "ord_in_thread": 0, "title": "MPs urge Government to allow local councils to apply for cash for new homes", "locations": [], "entities": {"persons": [{"name": "catherine m", "sentiment": "negative"}, {"name": "hammond", "sentiment": "none"}, {"name": "maria miller", "sentiment": "none"}, {"name": "catherine mckinnell", "sentiment": "none"}, {"name": "philip hammond", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "commons treasury committee", "sentiment": "none"}, {"name": "newcastle north", "sentiment": "none"}, {"name": "conservative", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MPs urge Government to allow local councils to apply for cash for new homes Newcastle MP Catherine McKinnell says cutting stamp duty for first time buyers won't help the North East Share 10 new housing sites in North Tyneside Share Get daily   \nChancellor Philip Hammond’s attempts to end the housing crisis are doomed to fail, a cross-party group of MPs has warned. \nThey said Mr Hammond was wrong to rely on private developers for a dramatic increase in the number of new homes provided. \nInstead, he should let local councils borrow billions of pounds to build new homes. \nThe warning came from the Commons Treasury Committee, chaired by Conservative MP Nicky Morgan. Other members include Newcastle North MP Catherine McKinnell. \nThe Government says it wants to increase the number of new homes provided in the UK to 300,000 a year, up from 217,000 at the moment. Labour candidate for Newcastle North, Catherine McKinnell wins (Image: Newcastle Chronicle) \nIt expects most of these homes to be built by private developers. \nBut MPs highlighted calls from Nick Forbes, the leader of Newcastle City Council, for local councils to be given a major role. \nMr Forbes, who is also a senior vice chairman of the Local Government Association, spoke to the inquiry last year and told them: “The 300,000 target will only be achieved if councils are allowed to get on and deliver the homes that we want to deliver but cannot because of the constraints upon the way that the system works at the moment.” \nThere are currently strict limits on how much councils can borrow, although the Government has invited councils in areas with a shortage of affordable homes to apply for the borrowing cap to be increased, up to a total of £1bn across the country. \nMs Morgan MP said: “The borrowing cap restricts the number of homes that local authorities could deliver. To achieve the Government target of 300,000 new homes per year, the cap should be abolished. The potential of local authorities to build should be unleashed.” \nThe MPs also criticised Mr Hammond’s plan to cut stamp duty for first time buyers, highlighting predictions that this will only make it possible for an extra 3,500 households to purchase a home - and that it would result in property prices increasing. \nThe Chancellor announced in last year’s Autumn Budget that he was abolishing stamp duty for first-time buyers on the first £300,000 of any property costing up to £500,000. Read More North East MEP Jonathan Arnott quits UKIP and says party leader Henry Bolton isn't up to the job \nBut the Committee said in a report that experts predicted “a permanent reduction in stamp duty land tax in isolation will increase the affected first-time buyer house prices by double the reduction.” \nMs McKinnell said: “Everyone knows that our country has a housing crisis, but the Committee’s clear view is that the measures announced by the Chancellor in his Autumn Budget are simply not enough to tackle it with anything like the ambition or speed required. \n“Indeed, the headline announcement – of a cut in Stamp Duty for first time buyers on the first £300,000 of properties worth up to half a million pounds – is going to cost the taxpayer significant sums of money, and likely push house prices up – all with relatively little impact on the numbers of people being able to get on the housing ladder. \n“This is particularly the case in areas like the North East, where very few buyers will be looking to spend anywhere near that amount on their first home. \n“Our wide-ranging report also touches on some of the other critical issues facing our country: from the potential impact of Brexit on the economy and the costs of our departure from the EU, to how we fund social care more fairly, as well as how the Government needs to be more transparent about the economic impact its decision-making has on different groups in society, including women, disabled people and those from BME backgrounds.” \nA Treasury spokesman said: “We are determined to restore the dream of home ownership for a new generation and the housing package announced at the Budget means we are on track to raise housing supply to 300,000 per year on average by the mid-2020s. Read More MP Laura Pidcock: How Labour WILL protect workers' rights so they are treated fairly \n“This means that housing supply over the 2020s is on track to be higher than in any previous decade. \n“We are making available £15bn of new financial support over the next five years, including lifting borrowing caps for councils in areas of high affordability pressure, so they can build more council homes.” Like us on Facebook", "external_links": [], "published": "2018-01-22T20:37:00.000+02:00", "crawled": "2018-01-22T21:18:17.000+02:00", "highlightTitle": ""}