{"organizations": [], "uuid": "fc029e356c54207076183d43a2b95b052c44fd0a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13666688.ece/ALTERNATES/s1200/Sedgefield-MP-Phil-Wilson-is-one-of-the-keynote-speakers-at-the-Aycliffe-Business-Park-Community-rel.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/labour-mp-launches-scathing-attack-14132914", "country": "GB", "domain_rank": 21960, "title": "Labour MP launches scathing attack on Jeremy Corbyn's single market policy", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T20:00:00.000+02:00", "replies_count": 0, "uuid": "fc029e356c54207076183d43a2b95b052c44fd0a"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/labour-mp-launches-scathing-attack-14132914", "ord_in_thread": 0, "title": "Labour MP launches scathing attack on Jeremy Corbyn's single market policy", "locations": [], "entities": {"persons": [{"name": "jeremy corbyn", "sentiment": "negative"}, {"name": "corbyn", "sentiment": "none"}, {"name": "phil wilson", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "sedgefield", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}], "organizations": [{"name": "news labour", "sentiment": "negative"}, {"name": "house of commons", "sentiment": "none"}, {"name": "sedgefield", "sentiment": "none"}, {"name": "invalid email  a north east labour", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Labour MP launches scathing attack on Jeremy Corbyn's single market policy You can't be anti-austerity if you want the UK to leave the single market, says Sedgefield MP Phil Wilson Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nA North East Labour MP has described Jeremy Corbyn’s policy of taking the United Kingdom out of the single market as “dishonest and fantasy economics”. \nSedgefield MP Phil Wilson said the UK must stay in both the single market and the customs union after Brexit if it wants to invest in public services and protect jobs. \nHe told the House of Commons: “If we want to end austerity, invest in our public services and protect and create jobs, we need to be in the customs union and the single market. For me, not to be in both and to have an anti-austerity strategy is dishonest and fantasy economics.” \nBut Labour leader Mr Corbyn has repeatedly said the UK must leave the single market. \nHe insisted once again the UK cannot be a member of the single market after Brexit as he set out his policy to the Labour Parliamentary Party on Monday night. \nLabour says its policy is to “retain the benefits of the single market” as it pursues a “jobs-first Brexit”. \nThe Conservative Government, led by Theresa May, has also said the UK will leave the single market following an “implementation period” - likely to last two years after Brexit takes place in March 2019. Jeremy Corbyn (Image: DAILY RECORD) \nMr Wilson said Brexit could be particularly difficult for smaller firms and for manufacturers if the UK left the single market and the customs union. This would hit the North East harder than other parts of the country, he said. \nThe MP said: “Nationally, 8% of all jobs are in manufacturing. In Sedgefield, it is almost 26% - one in four. \n“Durham and the Tees Valley is a major location for business and science research and development. I want that to continue.” \nHe warned: “The customs union and access to the single market are important to the economy, especially in the North East. Latest figures show that 61.6% of the region’s exports are to the EU. \n“Some 75% of businesses in the North East either sold or sourced goods from the European single market. This is obviously not an insignificant number.” Read More", "external_links": [], "published": "2018-01-09T20:00:00.000+02:00", "crawled": "2018-01-09T20:16:00.005+02:00", "highlightTitle": ""}