{"organizations": [], "uuid": "bf4be860e9322f6964dc0356400c2bb177c9217f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article10460999.ece/ALTERNATES/s1200/JS65895006.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/how-newcastle-overcame-race-hate-14141995", "country": "GB", "domain_rank": 21960, "title": "How Newcastle overcame race hate and inspired other cities - a new book tells the story", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-14T10:00:00.000+02:00", "replies_count": 0, "uuid": "bf4be860e9322f6964dc0356400c2bb177c9217f"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/how-newcastle-overcame-race-hate-14141995", "ord_in_thread": 0, "title": "How Newcastle overcame race hate and inspired other cities - a new book tells the story", "locations": [], "entities": {"persons": [{"name": "shukla", "sentiment": "none"}, {"name": "hari shukla", "sentiment": "none"}, {"name": "ranju", "sentiment": "none"}], "locations": [{"name": "bombay", "sentiment": "none"}, {"name": "scunthorpe", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "kenya", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "exeter university", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily   Thank you for subscribing!   \nA book detailing how Newcastle overcame race hate to become a city offering inspiration to others has been released. \nIt has been written by Dr Hari Shukla and also documents his personal journey after arriving in the city in 1974. \nHe said the inspiration for his book, The Art Of Giving, was how often visitors would remark to him how well the different ethnic communities seemed to live together in Newcastle . \n“Nobody asks how this happened,” he said. “I thought it would be nice if I write about race relations since 1974 when I came and when the situation was totally different. \n“People had the feeling then it would be impossible to create a multicultural society which was regarded as a liability rather than as an asset.” L-R: Ranju and Hari Shukla (Image: Free editorial use) \nDr Shukla is from Kenya where his father, originally from Bombay, had moved to work on the railways. \nHe studied at Exeter University, returned to Kenya to teach then was offered his first job in race relations in Scunthorpe before moving to Newcastle over 40 years ago. It was a city mired in tension between the ethnic communities and the police and the council. \nDr Shukla arrived in Newcastle when he got the job of Director of the Tyne and Wear Racial Equality Council. \nHe said: “The situation was terrible when I got here. Step by step we brought about change.” \nAt the root of this change was a three-point plan - to eliminate racial discrimination; promote equality of opportunity and develop good relations between the different groups. Read More How post Brexit racial tensions are being dealt with in Newcastle \nFirst he met separately with the different ethnic groups then bought them together. Then he arranged a series of meeting with Northumbria Police , whose Chief Constable was Sir Stanley Bailey, and the city council. \nAt these meetings problems were outlined and addressed then resolved. It led in 1976 to the Northumbria Police and Communities Relations Group being set up. \nHowever relations in the city for many years continued to be strained, revealed first in an arson attack on a Newcastle Mosque and then in 1992 with the racially motivated killing of Khoaz Miah, 66, originally from Bangladesh, as he made his way to evening prayers at a mosque in Elswick. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nIt sparked great racial unrest in the city. However the slow process of building bridges continued. \nDr Shukla is now 84 and awarded an MBE, OBE and CBE for his work on race relations. \nThe book took him four months to write and required little research. “It was all in my head,” he said. \n“It could be a teaching aid. In our area there is not written document on race relations.” Read More Newcastle equality campaigner Hari Shukla collects his CBE from Princess Anne \nHowever, while officials from other parts of the country have come to Newcastle to learn how it deals with race relations, there are still many issues to be dealt with, both nationally and in the region, not least growing tensions between far right supporters and the Muslim community. \nDr Shukla said: “We can’t be complacent and there are always new challenges.” \n* The Art Of Giving by Dr Hari Shukla has been published by Tyne Bridge Publishing and costs £8.99. The book is currently available at Newcastle City Library and via our Amazon site – www.tiny.cc/tynebooks Like us on Facebook", "external_links": [], "published": "2018-01-14T10:00:00.000+02:00", "crawled": "2018-01-14T10:16:42.025+02:00", "highlightTitle": ""}