{"organizations": [], "uuid": "1b6645e514c576aaed89cebf62ed438784164be9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article12415850.ece/ALTERNATES/s1200/Gatesheads-Advantex-has-won-a-contract-to-supply-a-new-internet-based-telephone-system-to-Henry-Col.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/gateshead-fishnchip-shop-supplier-warns-14136033", "country": "GB", "domain_rank": 21960, "title": "Gateshead fish'n'chip shop supplier warns Brexit will batter market conditions", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T15:22:00.000+02:00", "replies_count": 0, "uuid": "1b6645e514c576aaed89cebf62ed438784164be9"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/gateshead-fishnchip-shop-supplier-warns-14136033", "ord_in_thread": 0, "title": "Gateshead fish'n'chip shop supplier warns Brexit will batter market conditions", "locations": [], "entities": {"persons": [{"name": "henry colbeck", "sentiment": "negative"}, {"name": "brexit", "sentiment": "negative"}, {"name": "douglas colbeck", "sentiment": "none"}], "locations": [{"name": "gateshead", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Gateshead fish'n'chip shop supplier warns Brexit will batter market conditions Henry Colbeck has been forced to increase its prices after inflation pushed up its costs Share The Henry Colbeck headquarters in Gateshead (Image: Publicity Pic) Share Get business updates   Thank you for subscribing!   \nFish’n’chip shop supplier Henry Colbeck has added£2.7m to its turnover but warned that Brexit will create “difficult trading conditions” in the year a head. \nThe Gateshead business, which sells a range of products such as frozen food, batter, and equipment, saw its turnover grow from £45m to £47.7m for the year ending March 2017. \nBut the strong sales figures were delivered along with a warning that the company had already been forced to increase its prices, and was expecting Brexit to create tougher market conditions over the next few years. \nIn the company accounts, director Douglas Colbeck said: “Due to the weakness in sterling, price inflation was evident in the second half of the year and increases in buying prices were fed through to sales prices. \n“The balance sheet shows further strengthening in the financial position of the company. The company continues to maintain a strong cash position, albeit a slight reduction from last year, following continued investment in fixed assets and a planned build-up of stocks of frozen-at-sea fish. Read More Meat:Stack, makers of 'Newcastle's best burger', opens first permanent city centre base \n“The directors are pleased with the result for the year and view the future with confidence. Price inflation continues and the Brexit process i s likely to reduce consumer spending so we anticipate difficult trading conditions. \n“However, with a high level of customer service and experienced staff throughout the company the directors believe that the company is in a position to thrive despite any headwinds.” \nOperating profit at the Team Valley-headquartered firm dropped from £1.3m to £1.1m, while profit after tax tumbled from £1m to £773,000. The drop was largely due to increased administration expenses, which grew by £376,000. Read More Byron Burger to close up to 20 restaurants but Newcastle site is safe \nDuring the year, the company also added 10 additional members of staff to its workforce, taking its total headcount to 138. The company now employs 122 people in its sales and distribution teams and 16 in administrative staff. \nHenry Colbeck is also working on improving its back office systems after noting that a system failure could have major repercussions for its business. The firm is now in the midst of a 12 to 18-month project to replace its ageing software with a more “flexible and resilient” platform. Like us on Facebook", "external_links": [], "published": "2018-01-10T15:22:00.000+02:00", "crawled": "2018-01-10T16:19:17.007+02:00", "highlightTitle": ""}