{"organizations": [], "uuid": "9a30a9f6ac0d8839209442fc3534a81e21cff8ed", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article9823083.ece/ALTERNATES/s1200/PM376819.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14139227", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Ministers hold Carillion crisis talks amid fears of collapse", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T10:05:00.000+02:00", "replies_count": 0, "uuid": "9a30a9f6ac0d8839209442fc3534a81e21cff8ed"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14139227", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Ministers hold Carillion crisis talks amid fears of collapse", "locations": [], "entities": {"persons": [{"name": "alex hayman", "sentiment": "none"}, {"name": "chris grayling", "sentiment": "none"}, {"name": "south wes", "sentiment": "none"}], "locations": [], "organizations": [{"name": "rmt", "sentiment": "none"}, {"name": "maritime and transport", "sentiment": "none"}, {"name": "transport", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KEY EVENT Third rail strike takes place today- but can you get compensation if affected? \nPassengers hit by a third day of rail strikes today have been told their rights to compensation because of delays are “surprisingly complicated”. \nMembers of the Rail, Maritime and Transport (RMT) union were said to be “solidly supporting” walkouts at four train operators in the long-running dispute over the role of guards. \nThe union criticised Transport Secretary Chris Grayling for not responding to its call for a summit to try to break the deadlock. \nAlex Hayman, of consumer group Which?, said: \nFrustrated passengers who face yet more disruption to their rail services will be disappointed to find out that their rights to compensation when delayed as a result of a strike are surprisingly complicated. \nYou can only claim compensation during a strike if a train was delayed for long enough to qualify or if it didn’t turn up at all, based on the revised timetable. If operators aren’t planning to run any services whatsoever, then unfortunately you can’t claim compensation. \nRMT members on South Western Railway (SWR), Arriva Rail North (Northern), Merseyrail and Greater Anglia walked out for 24 hours following action on Monday and Wednesday. Northern staff are on strike for a second day today (Image: PA) 9.00 Coreena Ford Sunderland snake lover turns hobby into business \nA scientist has launched her own animal-minding service - named after her pet chameleon - after deciding to turn her hobby into a business. \nHelen Glenwright has created Cosy Chameleon, a pet-sitting and boarding service in Sunderland which not only cares for common household pets like cats, but also reptiles including tortoises and snakes. \nThe new business – which had its name inspired by Helen’s pet chameleon, Neil – allows for pets to be looked after in the comfort of their own home or at Helen’s house. \nThe 42-year-old, who currently works part-time as a laboratory technician at Newcastle University and at a veterinary surgery on weekends, has spent most of her life looking animals and has an unusual collection of her own pets. \nShe said: “I’ve owned pets my whole life so their well-being is very important to me. I currently own a variety of pets including seven snakes and I also care for stray animals which are brought into the vet’s. \n“It was five years ago, though, when owning reptiles became a hobby; I was offered the chance to rehome a bearded dragon and I couldn’t say no! \n“And due to the interesting nature of reptiles, I went on to own more and as my experience grew, I thought I could turn a hobby into a business and tap into a niche market. \n“So I completed a course in animal care and created the business to make sure pet owners – no matter what type of pet they own – can have someone to turn to when they’re stuck at work or going on holiday.” Helen Glenwright (of Cosy Chameleon) and Neil the chameleon (Image: WWW.IANMACPHOTOS.CO.UK) 8.51 Coreena Ford Pub and restaurant operator toasts record Christmas Day \nPub and restaurant operator Mitchells & Butlers, the owners of Newcastle’s Browns, The Badger, The Falcons Nest and several Nicholsons and Toby Carveries in the area, has reported strong Christmas trading. \nHowever, the firm has pointed to a wider slowdown linked to bad weather. \nThe pub group, which also owns Harvester, said like-for-like sales grew 3.9% in the core three-week festive trading period to January 6. \nChristmas Day saw record takings, with like-for-like sales growth of 5.4% and 225,000 meals sold. \nBut the firm said that in the seven weeks leading up to December, comparable sales came in at 1.6% as Mitchells was impacted by adverse weather. \nBoss Phil Urban said: “We are pleased to have delivered continued strong trading results over the important festive period in the face of difficult weather for many of our guests, indicating the attractiveness of our offers in a competitive market.” \nIn November, Mitchells saw its shares plunge after warning it could scrap its next shareholder dividend payout on the back of lower profits and said it faced further risks amid Brexit uncertainty. The Badger in Ponteland, which is owned by Mitchells&Butler (Image: Publicity Picture) 8.40 Coreena Ford Newcastle-founded Barratt Developments cheers strong half year performance \nNorth East-founded housebuilding giant Barratt Developments is cheering another strong half-year , having launched 93 new developments. \nThe firm, which was launched by the late Lawrie Barratt in Newcastle, has issued a trading update to shareholders for the six months ended December 31, 2017. \nAnd the company said it is well positioned for the second half of the financial year with total plots forward sold up 3.8% at 10,921, bringing in a value of £2.38bn. \nIt said the land market remains attractive and that it has almost doubled the amount spent and approved for purchase, from £328.2m to £641.2m, equating to 51 sites and 13,263 plots, a big lift on the 5,262 plots from the comparable period last year. \nSir Lawrie Barratt launched the firm in 1958 when he built his first four-bedroom home at Darras Hall. Since then the company has built 450,000 houses in total, helping some 2.8m families make their home. \nScott Martin, managing director at Barratt Developments North East said: “2018 is a really special year for us. We’re looking forward to celebrating the anniversary with a range of local and national activities. It’s incredible to think that we have helped so many families across Newcastle and throughout the country. We’re looking forward to continuing to build many more five-star homes over the next 60 years.” Barratt Homes (Image: Barratt Homes) 8.35 Coreena Ford More than 100 agency staff to go at Siemens Hebburn on top of direct employees \nMore than 100 agency workers at North East engineering giant Siemens will not have their contracts renewed when work on rail contracts comes to an end, the company has confirmed. \nThe move comes after multinational Siemens announced that jobs are to be lost at two of its sites – in Hebburn and Newcastle. \nUp to 73 people employed directly by Siemens will lose their jobs at the firm’s Hebburn site, following the end of rail projects that had supported work there for several years. \nVoluntary redundancies are also being called for at its Newcastle site, which specialises in the power generation sector, and the firm is also to cut some jobs at its site in Garforth, Leeds. \nNow Siemens has confirmed that temporary staff brought in through Team Valley’s Kinetic Recruitment Services for ‘time-lined’ contracts will also leave. \nThe numbers of staff that are drafted in from Kinetic fluctuates, but Siemens said 113 temporary staff will go. Siemens on Shields Road, Heaton (Image: Newcastle Journal) 8.25 Coreena Ford Brexit immigration rules could cost Newcastle's economy over £300m \nInternational students contribute nearly £700m to the North East economy each year, supporting hundreds of jobs and b", "external_links": [], "published": "2018-01-12T10:05:00.000+02:00", "crawled": "2018-01-12T11:19:29.013+02:00", "highlightTitle": ""}