{"organizations": [], "uuid": "2e760e30d01671034c09666569d177679500e3e0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14207853.ece/ALTERNATES/s1200/IBP_NEC_250118singer_02JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/durham-singer-songwriter-sweeps-social-14207547", "country": "GB", "domain_rank": 21960, "title": "Durham singer-songwriter sweeps social media with song inspired after Brexit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T20:00:00.000+02:00", "replies_count": 0, "uuid": "2e760e30d01671034c09666569d177679500e3e0"}, "author": "Kali Lindsay", "url": "https://www.chroniclelive.co.uk/news/north-east-news/durham-singer-songwriter-sweeps-social-14207547", "ord_in_thread": 0, "title": "Durham singer-songwriter sweeps social media with song inspired after Brexit", "locations": [], "entities": {"persons": [{"name": "sam slatcher", "sentiment": "none"}, {"name": "sam", "sentiment": "none"}], "locations": [{"name": "durham", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}, {"name": "new zealand", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "white wolf", "sentiment": "none"}], "organizations": [{"name": "st cuthbert", "sentiment": "none"}, {"name": "durham cathedral", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nA Durham singer-songwriter has swept across social media with more than 54,000 views. \nSam Slatcher’s song, City of Sanctuary, captures the history of Durham, from the exile of St Cuthbert in 875, through to the miners’ strike of 1984, to refugees who fled civil war in the Middle East to find home. \nThe unsigned singer posted the video online and it has reached more than 100,000 people and had more than 900 shares. \nThe 27-year-old said: “I’m completely overwhelmed that the video for City of Sanctuary has been viewed so many times, provoking memories, nostalgia and love for the city. Singer songwriter Sam Slatcher at Durham Cathedral (Image: Newcastle Chronicle) \n“It is heartwarming when people are engaging with the song. \n“There has been a mixed response from people who have left Durham and moved to Canada and New Zealand who have seen the video and it brings back memories of the city, and some people remember the city they grew up in.” Read More Five miles of written and photographic records of Durham could be on the move \nSam recorded the song at White Wolf recording studio in Wheatley Hill and filmed the video using iMovie software on an iPhone . \nThe title of the track comes from a national based refugee support organisation - City of Sanctuary - and grew out of Sam’s involvement in the Durham City of Sanctuary group. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nThe group aims to create a culture of welcome and inclusion in society. \nSam, who moved to Durham in 2008 to study geography, was inspired to write the song after Brexit . \nHe said: “The song was originally written as a response to feelings of unease at the back end of Brexit and negative feeling around immigration. \n“By showing that Durham has always had arrivals and refugees - from St Cuthbert to recent refugees - I hope it can inspire that all can find a home in these ancient streets.” Read More Man with American football-sized kidneys feared he would 'disrespect' donor when he piled weight on \nNow, the part time support worker hopes to become a full time singer. \n“I don’t ever see myself as an X Factor contender ,” he said. “My aim is to be able to use songs to be able to talk about social issues.” Like us on Facebook ", "external_links": [], "published": "2018-01-26T20:00:00.000+02:00", "crawled": "2018-01-26T20:21:58.049+02:00", "highlightTitle": ""}