{"organizations": [], "uuid": "17accddb23646f7c6b37dfbe91243dd35bd344a8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article12225548.ece/ALTERNATES/s1200/Brexit.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/nigel-farage-second-eu-referendum-14142352", "country": "GB", "domain_rank": 21960, "title": "Why Nigel Farage is right about a second referendum - and for the right reasons", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T18:43:00.000+02:00", "replies_count": 0, "uuid": "17accddb23646f7c6b37dfbe91243dd35bd344a8"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/nigel-farage-second-eu-referendum-14142352", "ord_in_thread": 0, "title": "Why Nigel Farage is right about a second referendum - and for the right reasons", "locations": [], "entities": {"persons": [{"name": "nigel farage", "sentiment": "negative"}, {"name": "tony", "sentiment": "none"}, {"name": "farage", "sentiment": "none"}, {"name": "nick) cleggs", "sentiment": "none"}, {"name": "yui mok/pa wire", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}, {"name": "blairs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nNigel Farage has managed to do the impossible and have comments he made enthusiastically backed by ‘Remain’ supporters. \nThe former UKIP leader said on Thursday he was minded to back a second EU referendum. \nFarage told Channel 5’s The Wright Stuff a fresh vote could “kill off” the Remain campaign for a generation and confidently predicted Leave would win again. \nDuring a debate about Brexit on the programme, Mr Farage said: “What is for certain is that the (Nick) Cleggs, the (Tony) Blairs, the (Lord) Adonises will never ever, ever give up. Nigel Farage (Image: Yui Mok/PA Wire) \n“They will go on whingeing and whining and moaning all the way through this process. \n“So maybe, just maybe, I’m reaching the point of thinking that we should have a second referendum on EU membership ... and we may just finish the whole thing off.” \nSince the vote, the economic repercussions of Brexit have become much more clearer than on June 23 2016, when the referendum took place. \nIt was like a blind vote then - blind faith in the EU as opposed to blind faith in the UK’s ability to go it alone. poll loading Which way would you vote if there was a second referendum? 0+ VOTES SO FAR Leave Remain \nWe are now 19 months older and wiser so, if there was a second referendum, people will at least be able to vote from a place of understanding not ignorance - that is ignorance on both sides, I hasten to add. \nI voted Remain and think the wrong decision was made. My concern was that people didn’t know what they were voting for and how it would effect them. \nBut I have been left uncomfortable, and at times embarrassed, to read about fellow ‘Remainers’ like Blair and Adonis talking about overturning what was, not matter what they say and how disappointed I was, a democratic vote. Nigel Farage (Image: Dan Kitwood/Getty Images) \nThere is something patronising about their arguments which really grated on not just me but large sections of the country. \nThe country needs the vote, not as some hardline Remainers think to put right a perceived wrong perpetrated by some shadowy right wing cabal, but to make a considered choice on a decision which has life-changing effects for generations to come. \nAnd it won’t be a shoo-in as polls have revealed it would be difficult to predict the result of second referendum. (If Adonis and Blair lead the Remain campaign, I might have to revise that thought). \nIt’s interesting that while hardline Remainers have been arguing for a second referendum since the vote, it is only the intervention of Farage which has given such a notion some currency. Read More Nigel Farage says he is close to calling for a second EU referendum - to end to Brexit opposition \nNo doubt the Government will dismiss his suggestion out of hand and try and reboot its ‘Brexit is Brexit’ soundbite. \nBut it’s something it should seriously consider, a winner-takes-all vote which would stop all the whingeing and whining and once decided there should never be another one for generations to come. Like us on Facebook", "external_links": [], "published": "2018-01-11T18:43:00.000+02:00", "crawled": "2018-01-11T23:33:56.000+02:00", "highlightTitle": ""}