{"organizations": [], "uuid": "1056d89bc041435082515a23892cde1a0b09b28e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article11875670.ece/ALTERNATES/s1200/JS60287380.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14195092", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Software giant Sage's revenues rise amid exchange rate headwinds", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T10:10:00.000+02:00", "replies_count": 0, "uuid": "1056d89bc041435082515a23892cde1a0b09b28e"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14195092", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Software giant Sage's revenues rise amid exchange rate headwinds", "locations": [], "entities": {"persons": [{"name": "steve hare", "sentiment": "none"}], "locations": [{"name": "canada", "sentiment": "none"}, {"name": "great park", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford Durham nursery entrepreneur builds up Child's Play business two new centres \nThe woman behind a successful County Durham nursery has snapped up two other nurseries to grow her business. \nLaura Leigh Davies, 28, set up Child’s Play Private Nursery in Ferryhill five years ago with just one other member of staff and four children. \nToday, the firm has grown to employ 21 staff and cater for children from more than 100 families – and has twice been named in the Top 10 most recommended nurseries in the North East. \nMrs Davies has also won accolades for her work, scooping the Young Female Entrepreneur of the Year in the 2016 Win Awards, which recognise women in business in the North East. \nNow the entrepreneur has taken over the reins of Buttercup nurseries in Seaham and Chester-le-Street . As part of an expansion, Buttercup has rebranded under the Child’s Play name and 35 staff have transferred over, while 135 children currently at Buttercups will continue to attend. Laura Leigh Davies, the director of Child's Play Private Nursery (Image: Sean Malyon) 9.03 Coreena Ford Scalini's in Jesmond to close to make way for new restaurant \nPopular Jesmond restaurant Scalini’s is set to be replaced by a Spanish and Mexican eatery as part of a £5m development plan. \nLeisure and hospitality operator Malhotra Group plc, base in Newcastle, has unveiled plans to refurbish its New Northumbria Hotel site on Osborne Road, Jesmond, creating a new restaurant as well as new apartment suites. \nThe multimillion-pound changes will be brought in from the end of March, when the new El Paso restaurant opens. \nThe 100-cover restaurant, specialising in dishes with a Spanish and Mexican influence, will result in the creation of 10 jobs and will also feature a private dining area. \nEl Paso will replace the existing Scalini’s restaurant, which will close on Sunday, February 4. Scalini's restaurant in Jesmond Coreena Ford Jamie Oliver Restaurant Group to close 12 UK restaurants - but Newcastle venue is safe \nA raft of Jamie’s Italian restaurants are set to shut – but the Newcastle eatery is safe . \nThe Jamie Oliver Restaurant Group has announced plans to close 12 of its 37 Jamie’s Italian restaurants, having already closed six restaurants at the start of last year. \nThe sites which it plans to close are in Bath, Bristol, Bluewater, Chelmsford, Greenwich, Harrogate, Kingston, Milton Keynes, Piccadilly Diner, Reading, St Albans and Threadneedle Street, London. \nAll remaining restaurants, including the venue in Newcastle’s Monument Mall which opened in 2014, will trade as normal. Jamie's Italian in Newcastle. Coreena Ford Labour in commons bid to force release of Carillion documents \nLabour is planning a vote in the House of Commons to force ministers to reveal what risk assessments they made of contracting giant Carillion before its collapse earlier this month. \nA motion tabled by Jeremy Corbyn’s party for debate today calls on the Government to release the assessments, along with any plans it had made to reduce risk, to an influential cross-party committee of MPs. \nThe debate comes as uncertainty continues over the future of thousands of workers employed by Carillion and its many sub-contractors on jobs ranging from hospital construction to school meals and cleaning. \nMPs will be asked to vote on a “humble address” to the Queen, asking her to direct ministers to release the documents. \nUnlike most opposition motions, a “humble address” has previously been ruled by Speaker John Bercow to be binding on the Government, and was used by Labour to extract Brexit impact assessments from David Davis. (Image: PA) Coreena Ford Co-op cuts prices in response to competition \nThe Co-op is investing £50m in cutting the price of grocery staples in response to “tight” competition on the high street. \nThe retail giant said it was lowering the price of some products by more than 40%, with more than 600 products now costing an average of 14% less. \nCo-op retail chief executive Jo Whitfield said: We are the most visited food retailer on the high street but competition is tight and we want to keep attracting shoppers through the door.” \nShe said the ongoing price cuts were part of a strategy to “make Co-op the UK’s number one convenience retailer”. \nAnalysts have noted that tough competition in the supermarket sector has shielded consumers from the brunt of food price rises. \nThe retailer claimed the cuts to the price of fruit, vegetables, bread, fresh meat and ready meals as well as household brand names could help shoppers save almost £120 a year. The Co-op is investing £50m to cut prices. (Image: PA) 8.40 Coreena Ford Sales fall at retailer WH Smith \nRetailer WH Smith has said like-for-like sales fell 1% in the 20 weeks to January 20. Its travel arm saw a 3% rise in comparable sales, but sales dropped 4% across high street stores. \nStephen Clarke, group chief executive, said: “Our travel business now accounts for almost two thirds of the group’s annual profit and we continue to deliver strong sales growth across all our key channels. \n“This was driven by ongoing investment in the business and continued growth in passenger numbers in our airport stores over the Christmas period.” He added: \n“High street sales were in line with expectations. Our stationery and seasonal ranges, including cards and wrap, performed well with good sales growth versus last year. Book sales were more challenging due to the decline in spoof humour titles and no new, big publishing trends.” WH Smith's travel business accounts for almost two thirds of the group’s profit. 8.35 Coreena Ford £83m programme to upgrade North East's electricity supply is announced \nAn £83m programme to upgrade the North East’s electricity supply has been announced as the region positions itself as a major player in the world of renewable energy. \nNorthern Powergrid’s Smart Grid Enablers programme aims to create a power system in the region that can cope with greater usage of electric vehicles, as well as green initiatives such as renewable energy and domestic heat pumps. \nThe programme aims to help the region be at the forefront of big changes in the energy system linked to the rise of electric vehicles and renewable energy. \nThose changes will see more demands on the electricity grid, but also more power being generated by solar panels and wind farms that produce energy intermittently. Taken together, those factors mean the power grid will have to be more flexible, able to store power at the time of generation and then supply greater amounts at times of peak demand. \nNorthern Powergrid’s programme comes after the Northern Energy Taskforce said that making the region a leader in the UK’s push to a low-carbon economy could be worth £15bn a year to the region and support 100,000 jobs by 2050. \nThe programme, which will run until 2023, will see Northern Powergrid upgrade more than 8,000 substations and create new data warehouses to process data from substations and from domestic smart meters. Monitoring equipment used by Northern Powergrid (Image: Northern Powergrid) 8.30 KEY EVENT Huge companies should be 'stripped of public contracts' for paying late \nBusiness leaders are calling for a “three strikes” rule to be introduced for firms that do not pay their contractors on time, following the collapse of construction giant Carillion. \nThe Federation of Small Businesses is calling for the Government to introduce a strengthened Prompt Payment Code (PPC), which would see FTSE 350 companies banned from applying for public sector contracts if they fail to pay contractors within agreed periods. \nThe new measures are being called for after it was revealed that before its demise Carillion was forcing small businesses to wait 120 days before they were paid. \nMike Cherry, national chairman at the FSB, said: “Sadly this sorry saga has laid bare the frailties of the Prompt Payment Code. While it is fundamentally a good idea, it does not work when it is most needed – as shown with Carillion’s behaviour since July 2017. Defaced branding is seen outside Carillion's Royal Liverpool Hospital site (Image: Getty Images Europe) 8.26 Coreena Ford All change on Crest Nicholson board. . . \nHousebuilder Crest Nicholson has announced changes to its board that will include promoting its chief operating officer Patrick Bergin to chief executive officer. \nHe will take over the role this spring from Stephen Stone, who will step in as an executive chairman from March 22 this year until April 2019 when he will become the company’s non-executive chairman. \nCurrent chairman William Rucker - who has served in the role since September 2011 - will not seek re-election at the upcoming annual general meeting this March. \nThe company has also appointed former United Biscuits and Rexam chief executive Leslie Van de Walle as deputy chairman and senior independent director, while Louise Hardy will join the board as a non-executive director. 8.25 Coreena Ford Countrywide CEO steps down, days after profit alert \nCountrywide chief executive Alison Platt has quit days after the estate agency’s shock profit warning sent shares plummeting to a record low. \nChairman Peter Long has stepped in to replace Ms Platt as executive chairman until a successor is appointed, while commercial development boss Paul Creffield has been named group operations director and will take charge of the embattled sales and lettings arm. \nMs Platt said the “time is now right” to stand aside after more than three years at the helm. \nThe move comes after it was reported earlier this week that the group’s board was discussing Ms Platt’s future at the group in the wake of the dire profit alert. \nThe firm, which owns brands including Hamptons and Bridgfords said a “disappointing” end to 2017 would leave annual earnings slumping to £65m against £83.5m the previous year. Countrywide chief executive Alison Platt has quit. (Image: PA) 8.20 Coreena Ford Wetherspoons warns business rates and sugar tax will bite int \nJD Wetherspoon said profits were ahead of expectations after better-than-expected sales, but warned that “significant costs” would weigh on its performance over the remainder of the year. \nThe pub chain said like-for-like sales rose 6% in the 25 weeks to January 21, with total sales climbing by 4.3%. \nThose figures were mirrored in its second-quarter results on both a like-for-like and total sales basis, helping boost profits for the period. The company said \nsimilar outperformance in the second half will be more difficult to achieve. \nChairman Tim Martin said: \nWe face significant costs in the second half in areas which include labour, business rates and the sugar tax. \nThere will also be some uncertainty as to the effects on our business of the Fifa World Cup. \nNevertheless, given better-than-expected year-to-date sales, we currently anticipate a slightly improved trading outcome for this financial year. \nThe pub group said it “remains in a sound financial position”, though year-end net debt is expected to be around £30m higher than it was at the end of the last financial year. \nIt shelled out around £15 million on buying the freeholds of pubs where it was previously a tenant and bought £51m worth of shares from shareholders. \nAs part of its update, JD Wetherspoon said it had opened three new pubs but sold off 10, with plans under way to open approximately 10 pubs by the end of the financial year. \nMr Martin also used the latest trading update to launch fresh criticism against two trade bodies - the Confederation of British Industry (CBI) and the British Retail Consortium (BRC) - over their assertion that food prices are likely to rise in the wake of Brexit. \nThe Wetherspoon boss has been an outspoken proponent of Britain’s divorce from the European Union, issuing countless stock exchange announcements extolling the virtues of Brexit. \nHe said: \nBy refusing to acknowledge the fact that food prices will be reduced post- Brexit, if the UK leaves the EU without a deal and Parliament votes to eliminate taxes which are currently imposed on non-EU food imports, the CBI and the BRC are trying to fool the public and MPs and bringing business into disrepute. \nThese factually incorrect scare stories seem to be designed to convince the public that a deal is necessary to avoid a ‘cliff edge’. \nIn fact, the cliff edge is a myth. There is almost no action needed, for most companies, if the UK leaves the EU without a deal. JD Wetherspoon chairman Tim Martin (Image: JD Wetherspoon/PA Wire) 8.10 KEY EVENT Revenues rise at Newcastle's Sage despite exchange rate headwinds \nSoftware giant Sage has issued a trading update for the first three months of the financial year, which show group organic revenue rose 6.3%. \nThe Great Park headquartered firm said organic recurring revenue grew by 7%, underpinned by software subscription growth of 26%. \nNorth America has performed strongly, reflecting continuing progress made by management across the US and Canada. \nDirectors also said Sage Business Cloud revenues are starting to contribute significantly in “this highly cloud-adoptive region”. \nFrance,however, continues to significantly underperform compared to the rest of the Group, weighing on both organic revenue and recurring revenue growth with recovery expected in the second half of the year. \nMeanwhile, sterling has strengthened against all major currencies except the Euro in its operating territories, leading to exchange rate headwinds, particularly in the translation of the US dollar. \nSteve Hare, chief financial officer, said : \nQ1 results are in line with our expectations. \nAs we outlined at the time of the full year results, we have invested heavily in sales training in Q1 to set up the business for success, particularly in Sage Business Cloud, resulting in the delay of some revenue into Q2. \n“We expect acceleration throughout the year including a stronger Q2 and we reiterate our full year guidance of around 8% organic revenue growth and around 27.5% organic operating margin for FY18. \nThe directors are set to share their plans to drive further acceleration in revenue growth at its Capital Markets Day tomorrow, January 25. \nThey said the group’s financial position remains strong and net debt as at 31 December 2017 was £794m, down from £813m as of 30 September 2017. \nThe update comes after CEO Stephen Kelly said small business owners could gain almost a day a week to grow their companies and billions could be added to the UK economy if technology was harnessed to get rid of unnecessary admin. \nHis comments came after his company launched a productivity tracker to help businesses see ways of enhancing their performance. Stephen Kelly ", "external_links": [], "published": "2018-01-24T10:10:00.000+02:00", "crawled": "2018-01-24T10:22:52.000+02:00", "highlightTitle": ""}