{"organizations": [], "uuid": "0fad68fc746ce9d63b37ce6181539ffd29e5d2aa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14138331.ece/ALTERNATES/s1200/Trade-gap.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/customs-bill-create-endless-red-14138144", "country": "GB", "domain_rank": 21960, "title": "Customs Bill will create 'endless red tape' for North East firms, MPs warn", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T20:47:00.000+02:00", "replies_count": 0, "uuid": "0fad68fc746ce9d63b37ce6181539ffd29e5d2aa"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/customs-bill-create-endless-red-14138144", "ord_in_thread": 0, "title": "Customs Bill will create 'endless red tape' for North East firms, MPs warn", "locations": [], "entities": {"persons": [{"name": "catherine m", "sentiment": "negative"}, {"name": "bill", "sentiment": "negative"}, {"name": "catherine mckinnell", "sentiment": "none"}, {"name": "phil wilson", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "sedgefield", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "customs", "sentiment": "negative"}, {"name": "newcastle north", "sentiment": "none"}, {"name": "british labour party", "sentiment": "none"}, {"name": "north east england chamber of commerce share", "sentiment": "none"}, {"name": "parliament mrs mckinnell", "sentiment": "none"}, {"name": "custom bill", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Customs Bill will create 'endless red tape' for North East firms, MPs warn Warnings from Catherine McKinnell and Phil Wilson are backed by the North East England Chamber of Commerce Share MPs warn that the new Custom Bill will create “endless red tape” for North East importers and exporters (Image: PA) Share Get business   \nNorth East MPs have warned that the Government’s new Custom Bill will create “endless red tape” for North East importers and exporters. \nNewcastle North MP Catherine McKinnell and Sedgefield’s Phil Wilson have heavily criticised the Bill, which proposes how businesses will pay VAT and excise duties after Brexit. \nIn a speech in Parliament Mrs McKinnell said that it was crucial that North East exporters be given “frictionless” access to European markets, but said she failed to see how the Bill would deliver this to the region. British Labour Party politician Catherine McKinnell (Image: Newcastle Chronicle) \nShe said: “How will it help to deliver the frictionless and unbureaucratic two-way access to European markets and the minimum disruption which are needed by the North East’s firms and the hundreds of thousands of jobs that they support, with many of the region’s exporters having EU-based firms as part of their supply chain? \n“I do not know the answer to that, but what it does provide is a very real prospect of endless red tape and customs duties on goods traded with the EU , which may or may not be levied after Brexit , and for which those firms may or may not need to prepare and budget. \n“That depends entirely on the Prime Minister’s ability to deliver a Brexit deal to British businesses and consumers.” Read More Byron Burger to close up to 20 restaurants but Newcastle site is safe \nCriticism also came from prominent Remain supporter Phil Wilson, who said that the new customs formalities being proposed would “come as a shock to the system” to many firms. He called on the Government to keep the UK in the customs union and the single market permanently. Sedgefield MP Phil Wilson (Image: Unknown) \n“If we want to end austerity, invest in our public services and protect and create jobs, we need to be in the customs union and the single market,” he said. “For me, not to be in both and to have an anti-austerity strategy is dishonest and fantasy economics.” \nCritics of the Bill, which is currently going through Parliament, say that the new rules would create cash-flow problems for up to 130,000 companies which could be forced to pay VAT upfront for the first time. \nJonathan Walker, head of policy and campaigns at the North East of England Chamber of Commerce, said: “We have been clear about the need for Government to put the needs of business at the heart of its negotiating strategy. A poorly managed exit from the EU must be avoided. \n“Firms want a new trading relationship with the EU that provides frictionless and un-bureaucratic access to European markets. This is the yardstick by which we will judge the Government’s actions over the coming months.” Read More 6,000-jobs to be created with plan for Aykley Heads site in Durham \nHowever, supporters of the Bill said the North East could benefit from a number of its procedures through the introduction of free ports. \nConservative MP for Middlesbrough South and East Cleveland Simon Clarke said: “The special customs procedures outlined in the Bill will be central to allowing Teesport to fulfil its ambition of being the first major free port in the UK.” \nHe added: “Teesport handles more than 5,000 vessels each year and about 40m tonnes of cargo on an estate covering almost 800 acres... A free port at Teesport would aid the Government’s wider objectives of rebalancing the economy from south to north and from the service sector to manufacturing.” Like us on Facebook", "external_links": [], "published": "2018-01-10T20:47:00.000+02:00", "crawled": "2018-01-10T21:00:30.040+02:00", "highlightTitle": ""}