{"organizations": [], "uuid": "6574cc456d1b838d87db98de93daff2bdccde565", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article10108111.ece/ALTERNATES/s1200/JS41483360.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/sheet-metal-firm-doubles-turnover-14141021", "country": "GB", "domain_rank": 21960, "title": "Sheet metal firm doubles turnover after making major machinery investment", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T15:49:00.000+02:00", "replies_count": 0, "uuid": "6574cc456d1b838d87db98de93daff2bdccde565"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/sheet-metal-firm-doubles-turnover-14141021", "ord_in_thread": 0, "title": "Sheet metal firm doubles turnover after making major machinery investment", "locations": [], "entities": {"persons": [{"name": "hydram engineerin", "sentiment": "negative"}, {"name": "david greatorex", "sentiment": "none"}], "locations": [], "organizations": [{"name": "business sheet", "sentiment": "negative"}, {"name": "hydram engineering limited", "sentiment": "none"}, {"name": "chilton industrial estate", "sentiment": "none"}, {"name": "hydram engineering    a county durham", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Sheet metal firm doubles turnover after making major machinery investment Hydram Engineering added £2m to its turnover and said long term deals would protect it from possible issues created by Brexit Share David Greatorex, managing director of Hydram Engineering   \nA County Durham sheet metal manufacturer has doubled its profits after investing in new machinery during the year. \nHydram Engineering Limited, which specialises in sheet metal fabrications, saw its operating profit soar from £797,000 to £1.6m during the year ending March 2017. \nThe firm, which is based at Chilton Industrial Estate , said the main cause of the profit boost was due to its investment in new machinery. \nIn the company accounts, managing director David Greatorex said: “This increase in profit can mainly be attributed to the significant investments in new automated equipment during the year. This has been supported by a well-trained and motivated workforce. \n“The increase in sales was supported by growth from the existing portfolio of customers and new customers coming on stream. \n“We continue to monitor and control costs tightly, but are presently facing price pressures on steel due to the volatility and uncertainty in this industry.” \nDespite these cost pressures, Hydram managed to grow its turnover by 16.5% during the year, from £12.8m to £14.9m. \nThe company said the increase was due to its “sales strategy and improving market conditions”. Read More \nIt also grew its headcount by nine members of staff, taking its total workforce to 226 people. The firm now employs 180 people in its production division and 46 administration staff. Its total staffing costs increased by £550,000 to £6.8m. \nDirectors at the company also received a total remuneration of £212,203, up from £175,273. \nUnlike many manufacturers Hydram said it had so far been unaffected by Brexit, but added that it was monitoring the impact the UK’s decision to leave the EU was having on the market. Read More Jobs to be lost after Siemens announces redundancies at Hebburn and Newcastle \nMr Greatorex said: “To date, the business has not been affected by the UK’s decision to leave the EU. However, there remains uncertainty in the market over the impact on business of the UK’s departure from the EU. This uncertainty is exacerbated by the recent UK election and general political uncertainty globally. \n“Despite these uncertainties, Hydram’s multinational customers have made long commitments to the UK and are confident about their short-medium term future in the UK.” Like us on Facebook", "external_links": [], "published": "2018-01-11T15:49:00.000+02:00", "crawled": "2018-01-11T16:10:03.010+02:00", "highlightTitle": ""}