{"organizations": [], "uuid": "dde933a15be11aaf1896816b6c74c0ac57ec5853", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14159821.ece/ALTERNATES/s1200/JMP_LEC_150118CARILLION_13JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14214844", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: KMPG to be investigated over Carillion audit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T10:00:00.000+02:00", "replies_count": 0, "uuid": "dde933a15be11aaf1896816b6c74c0ac57ec5853"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14214844", "ord_in_thread": 0, "title": "Business Breakfast LIVE: KMPG to be investigated over Carillion audit", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "kmpg", "sentiment": "negative"}, {"name": "kpmg", "sentiment": "negative"}, {"name": "carillion.the financial reporting council", "sentiment": "none"}, {"name": "enforcement division", "sentiment": "none"}, {"name": "frc", "sentiment": "none"}, {"name": "carilion", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning Warning that business will assume 'disorderly Brexit' \nBusiness will assume there will be a “disorderly Brexit” unless there is clarity on transitional arrangements between Britain and the EU early this year, a leading lobby group has said.TheCityUK spoke out ahead of what it dubbed a “critical” meeting of the EU’s General Affairs Council in Brussels.EU ministers will adopt a new set of negotiating directives for Brexit talks, in particular the details on the members states’ position regarding a transition period.At Monday’s meeting Michel Barnier, the EU’s chief Brexit negotiator, will be given a mandate to start discussions with the UK on the transitional arrangements to be included in the withdrawal agreement.Miles Celic, chief executive officer of TheCityUK, said: \nThe outcome of today’s meeting is critical. \nIt will ultimately give Michel Barnier his marching orders to negotiate the all-important transitional deal businesses have all been waiting for. \nThere is little time left. If we can’t get clarity on transition early this year, business will have to assume a disorderly Brexit and accelerate contingency plans to protect their customers and clients. \nTheCityUK, which promotes the financial and related professional services industry, has previously said clarity must be provided no later than quarter one in 2018.Analysis by the group suggests that moving onto World Trade Organisation rules with no transitional arrangements in place after Brexit would put up to 75,000 jobs in the sector at risk. \nMr Celtic said: \nOur industry has been very clear on what it wants and how the best outcome could be achieved. \nWe are yet to hear from the EU on what its objectives are and how they will ultimately benefit the European economy, European business and the financial costs facing ordinary consumers across the continent. \nA Government spokesman said: \nWe are engaging extensively with businesses and organisations across the country as we seek to secure a good deal with the EU that works for the whole of the UK. \nWe recognise the importance of providing certainty for businesses, which is why we want to reach agreement with the EU on an implementation period as soon as possible. \nWe have already made good progress, agreeing in December to move talks onto our future relationship. The EU has said they will offer their most ambitious free trade approach and we are confident of negotiating a deep and special economic partnership. EU and Union flags (Image: PA) 9:15 Jonathon Manning Newcastle to spearhead smart cities revolution with £40m construction technology centre \nPlans for a £40m centre that will see the North East lead the world in the development of smart cities will be announced tonight. \nNorthumbria University and North East IT network Dynamo will outline plans for the IC3 project with a special event at the House of Lords set to be attended by Ministers and leaders in the construction industry. \nThe centre aims to build on the North East’s reputation as a world leader in construction technologies such as BIM (building information modelling), virtual reality, smart cities and cloud computing. \nIt is hoped that the IC3 centre will be a hub for the global construction sector that brings together academics and leading companies to develop technology that will produce better ways of developing new buildings and cities. \nNorthumbria University vice chancellor Prof Andrew Wathey said: \nBuilding information modelling, smart cities, sustainability and the digital industry will have the ability to come together to play a significant role in the economic future of the North East. \nThis centre, building on core research strengths at Northumbria University, in association with other partners, will make a key contribution to this process. The new centre will establish the North East’s role in the global leadership and application of this work. \nThe construction industry is being revolutionised by new technology such as BIM, which allows architects and construction firms to use digital modelling in planning the construction of new buildings. From left, Anne McDonald, Engagement Manager at Dynamo; Charlie Hoult, Chair of Dynamo; Prof David Greenwood, Northumbria University, and Peter Barker, BIM Academy (Image: Picture courtesy of North East Times Magazine) 9:02 Jonathon Manning High streets continue to struggle as new shop applications fall \nPlanning applications for new shops have fallen for the ninth year in a row, showing how high streets continue to struggle, new research shows.A study by lending firm Lendy found there were just over 6,000 applications in England last year, compared with 13,500 in 2008.The figures highlight the shift from high streets to the internet, although Brexit uncertainties could be forcing retailers to put store openings on hold, said the report.More than 100 retail businesses went insolvent in 2017 in another sign of the challenges facing the retail sector, said Lendy.Liam Brooke, co-founder of Lendy, said: \nInvestors in shops and shopping centres had been used to rents only ever going up, safe in the knowledge that any vacancies could be filled by one of a number of expansion-minded retailers. \nThe recession and the boost to e-commerce from smartphones ended all that. \nFalling planning applications for new shops is a direct result of the pressures the retail industry is dealing with at the moment. \nConsumers can now get all the products they need on the internet, and as a result, retailers are seeing less need to invest in their high-street presence. Shops closed in North Tyneside (Image: Newcastle Chronicle) 8:57 KEY EVENT Is this the best staff bonus ever? Newcastle firm sends 35 staff to South Africa \nStaff at Newcastle holiday company Parkdean Resorts have been treated to one of the best job perks in the country, after being sent to South Africa for a once-in-a-lifetime trip. \nThe Gosforth-headquartered company sent 35 of its highest performing staff on an all-expense paid trip to Cape Town, which included adventurous activities such as paragliding and abseiling. \nParkdean’s “Elite Trip” scheme is designed to reward staff who have gone above and beyond their work at the company or achieved an outstanding achievement throughout the year. The firm regularly sends its staff on holiday, with previous destinations including Rome, Las Vegas, and Sun City. \nMaggie Pavlou, director of HR at Parkdean Resorts said: \nOur Elite Trip is one of the highlights of our annual calendar of proactive engagement activities and something which we’re committed to investing in as a business. \nAs well as recognising and rewarding hard work, the trip is a real morale booster for our people, and helps to strengthen professional relationships whilst having fun in a new country. We’re already making arrangements for our next trip. \nThe week long South Africa trip started with the team abseiling down Table Mountain, which overlooks Cape Town, before the dare devils were invited to enjoy tandem paragliding off Lion’s Head. \nOnce back on the ground, the group explored Robben Island, where former President of South Africa Nelson Mandela was imprisoned, took a tour of the city, and went on a wine tasting trip to Boschendal Wine Farm. Staff at Parkdean Resorts were treated to an action-packed holiday in South Africa (Image: Parkdean Resorts) 8:52 Jonathon Manning Byron faces crunch vote on restructuring plans \nThe fate of stricken burger chain Byron will be decided next week when creditors vote on a proposed restructuring package which could spark hundreds of job losses.Byron has tabled a company voluntary arrangement (CVA) in an attempt to shore up its financial position by allowing it to close loss-making restaurants and secure deep discounts on rental costs.Around 20 restaurants could be closed as part of the process, as Byron’s owners attempt to stave off its decline in the casual dining sector.If the CVA is to succeed, the burger chain’s plans would need 75% backing from creditors, which include landlords, during a vote on Wednesday.Mark Edwards, BDO partner and head of restaurants and bars, said Byron has been forced to re-trench because its expansion was too hasty.He said: \nWhen restaurant groups (such as Byron) go and expand very quickly, there is always a risk some of those sites will be marginal sites. \nHowever, the sector as a whole is struggling. There are some operators that are more successful than others such as Honest Burger, which has a different take and is London-centric. \nMy personal view is that when you look at the UK’s eating habits, there are fewer visits to eat out over the last few months, but not cooking at home is embedded in British culture and I don’t see that changing. \nPeople are maybe not eating out as often, but when they do, they tend to spend a bit more. Byron Burger (Image: Newcastle Chronicle) 8:47 Superdry founder banks nearly £18m in share sale Superdry has stores at intu Eldon Square and intu Metrocentre (Image: Hasselblad H5D) 8:42 Jonathon Manning Record year for Whitehouse Farm sparks investment in facilities \nWhitehouse Farm Centre near Morpeth is celebrating a record-breaking year after generating a turnover in excess of £1m in 2017. \nThe family business, which celebrated its 20th anniversary last year, has reported a 5% increase in turnover and a 4.5% increase in visitor numbers compared to its performance in 2016. \nThe boost in visitors and turnover will enable the family owners and directors to invest a further £100k in new attractions, activities, facilities and recruitment this year. \nOperations director Karen Lovatt said: \nWe are absolutely thrilled with our performance in 2017. During the last two years, we’ve made several investments totalling £80,000, which have had a significant impact on the business. \nWhen we launched 20 years ago the farm welcomed around 20,000 visitors and now we’re seeing in the region of 100,000 visitors a year. \nThis valuable growth and the income it generates will help us to continue developing our visitor offering and events programme with many more exciting activities and attractions to encourage people to return time and again. \nRecent development work carried out at Whitehouse Farm includes new enclosures in the animal barn and reptile house, several new animal species, a refurbishment of the café, the creation of a dedicated ice cream parlour and new equipment in the outdoor play area. Whitehouse Farm Centre near Morpeth is celebrating a record-breaking year (Image: Newcastle Journal) 8:37 KEY EVENT Utilitywise suspends share trading after accounts are delayed for second time \nInvestors will have been told they will not be able to buy or sell shares in North Tyneside energy consultancy business Utilitywise, after the company suspended share trading due to another delay in the publication of its financial accounts. \nUtilitywise said it was unable to publish its accounts for the year ending July 2017, because its auditors were still involved in work looking at its “revenue recognition policy”. \nThe work involves reviewing many of the firm’s existing contracts to more accurately forecast turnover under its new accounting methods. \nShare trading was temporarily suspended from 7.30am this morning and will reopen when the company’s accounts are published. The firm gave no indication of when its accounts would be published. \nIn a statement to shareholders Utilitywise said: \nThis delay is due to the volume of work still required to be completed by the Company and its auditor to cater for the proposed change in the Company’s revenue recognition policy, as announced on 17 January 2018. \nThis work includes amendments to the Company’s financial reporting systems in order to analyse energy contract data in accordance with that new policy, alongside associated work by the Company’s auditor, for the audit of its results for FY17 to be completed. \nThe delay is not related to the Company’s banking arrangements, nor the trading, cash flows or other underlying economic position of Utilitywise in either FY17 or the current financial year. \nThis is the second time that Utilitywise has delayed the publication of its 2016/17 accounts. In November the company revealed that it was pushing back publication until 31 January after its accountants requested an independent review of its methodology to be carry out be another firm. Brendan Flattery, CEO of Utilitywise 8:30 Jonathon Manning 3,200 jobs could be created as plans to grow North East business park move closer \nAround 3,200 jobs could be created in County Durham after plans to expand Aycliffe Business Park onto the nearby Forrest Park site moved forward. \nA planning application to develop Forrest Park is close to being submitted, and if approved, the scheme could see 3,200 jobs created and provide a £495m gross value added (GVA) boost to area over the next 10 to 15 years. \nPlanning consultants have now been brought in to work on the development, and a proposal is expected to be submitted in the first half of 2018. \nLocal businesses were given an update about the project at a meeting of the Aycliffe Business Park Community, which was held at Hitachi Rail Europe’s rail assembly facility. \nAt the meeting Andy Palmer, Durham County Council’s head of transformation and chair of the joint venture company behind the Forrest Park development, said: \nA lot of the groundwork has already been undertaken and we’re close to submitting a planning application for the development. \nWe already have a lot of interest in the site, because it is very visual, people can see the preparatory works that have already been undertaken, and we’ve already held discussions with development partners and we expect things to happen fairly quickly. \nAycliffe Business Park’s reputation is getting stronger all the time as an area for advanced engineering and manufacturing. \nWhen completed it will mean Aycliffe Business Park will be the largest business park in the North East, which will be a major feather in the cap for County Durham. A graphic shows the proposed Forrest Park development which could create 3,200 new jobs (Image: Unknown) 8:20", "external_links": [], "published": "2018-01-29T10:00:00.000+02:00", "crawled": "2018-01-29T10:16:24.060+02:00", "highlightTitle": ""}