{"organizations": [], "uuid": "69eef77b732a852d54e60c7457899acec59e12ed", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article361724.ece/ALTERNATES/s1200/Anne-Marie-Morris.jpg", "site_section": "http://www.westernmorningnews.co.uk/politics.rss", "section_title": "devonlive - News", "url": "http://www.devonlive.com/news/devon-news/anne-marie-morris-mp-apologises-1099325", "country": "GB", "title": "Anne Marie Morris MP apologises again for n r in the woodpile' comment - but says there is an issue with racism in rural areas", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T13:02:00.000+02:00", "replies_count": 0, "uuid": "69eef77b732a852d54e60c7457899acec59e12ed"}, "author": "Daniel Clark", "url": "http://www.devonlive.com/news/devon-news/anne-marie-morris-mp-apologises-1099325", "ord_in_thread": 0, "title": "Anne Marie Morris MP apologises again for n r in the woodpile' comment - but says there is an issue with racism in rural areas", "locations": [], "entities": {"persons": [{"name": "anne marie morris", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "morris", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "invalid email  newton abbot", "sentiment": "none"}, {"name": "newton abbot", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nNewton Abbot MP Anne Marie Morris has said that she will apologise as many times as it takes for her comments when she described a potential deal is a “real n r in the woodpile”, but that there is an issue with racism in rural areas. \nMs Morris, who has been the MP for Newton Abbot since 2010, has suspended by the Conservative Party in the wake of her remarks when she described the UK leaving the EU without a deal as a “real n r in the woodpile” at the launch of a report into the future for the UK’s financial sector after Brexit. Read More \nShe apologised for the remarks, saying: “The comment was unintentional and I apologise unreservedly for any offence caused.” \nIn December, she had the whip restored and she returned to the Conservative Party. \nSpeaking on Sunday Politics, she said: “I got it wrong and I will apologise as many times as it takes.” Read More Rail line 'could reopen by 2020' \nBut she added that since the furore around her comments erupted, she has started looking at whether there remains a racism issue in rural area, and has said that there is. \nShe said: “Clearly the more interesting thing is when something like that happens, you start thinking, why did it happen and I say something like that, and also makes you think about if there a real racism issue that I am unaware of? \n“The comments I made were not intended to be racist, but is there a problem that I am not aware of? I started looking at whether there remains a problem, particularly in rural areas where I didn’t really think there was an issue, but there is one. Read More \n“It has been a very interesting journey and I will carry on exploring just to understand it better to see what we can do about it.” Anne Marie Morris MP Beer through to the final of Channel Four’s Village of the Year \nWhen she had the whip restored, she said: “I would like to take this opportunity to apologise again for using such inappropriate and offensive language. The whip has been returned to me today. I feel proud and privileged to be a Conservative Member of Parliament and I will continue to serve my community and my country to the best of my ability.” Like us on Facebook ", "external_links": [], "published": "2018-01-22T13:02:00.000+02:00", "crawled": "2018-01-22T13:10:38.020+02:00", "highlightTitle": ""}