{"organizations": [], "uuid": "3b2476ae59e3810ae35fbd8a23f58015387e6571", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13429725.ece/ALTERNATES/s1200/Brexit.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/farming/farm-subsidies-replaced-public-good-14112424", "country": "GB", "domain_rank": 21960, "title": "Farm subsidies will be replaced by 'public good' payments after Brexit, Government says", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T14:52:00.000+02:00", "replies_count": 0, "uuid": "3b2476ae59e3810ae35fbd8a23f58015387e6571"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/farming/farm-subsidies-replaced-public-good-14112424", "ord_in_thread": 0, "title": "Farm subsidies will be replaced by 'public good' payments after Brexit, Government says", "locations": [], "entities": {"persons": [{"name": "gove", "sentiment": "none"}, {"name": "michael gove", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}], "organizations": [{"name": "european union", "sentiment": "none"}, {"name": "oxford farming conference", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Farm subsidies will be replaced by 'public good' payments after Brexit, Government says Environment Secretary Michael Gove has been outlining how he wants to use subsidies to boost the environment Share Environment Secretary Michael Gove (Image: PA) Share Get business   Thank you for subscribing!   \nFarming subsidies will be replaced by payments for “public goods”, from boosting access to the countryside to recreating wildflower meadows, Michael Gove has said. \nIn a speech to the Oxford Farming Conference, the Environment Secretary set out plans for food and farming after Brexit , including a switch away from what he called the “unjust and inefficient” subsidies paid through the European Union. \nMr Gove outlined how he wants to see taxpayers’ money going in future years to environmental protection, increasing public access to the countryside, and on technology, skills, infrastructure, and supporting rural communities. \nThe Government has agreed to maintain current farming subsidies, which are worth about £3bn to UK landowners each year and most of which are linked to the amount of land that is farmed, until 2022. \nSpeaking ahead of the Government’s agriculture plans being published in the spring, which will be put out for consultation, the Environment Secretary said he envisaged farm payments continuing for five years from 2019. \nBut during that time, he aims to curb the largest subsidies, with a maximum cap or a sliding scale of reductions. \nAnd in the future, taxpayers’ money would only go on paying for public goods that the market does not provide. \nThe move towards spending money on delivering public goods is part of a four-point plan, which also includes developing a coherent policy on food and giving farmers time and tools to adapt to the future to avoid a “precipitate cliff edge”. \nThe plans also include building “natural capital” - the value nature provides to society - into the approach to land management to establish a sustainable future for the countryside. \nMr Gove told the conference: “Building on previous countryside stewardship and agri-environment schemes, we will design a scheme accessible to almost any land owner or manager who wishes to enhance the natural environment by planting woodland, providing new habitats for wildlife, increasing biodiversity, contributing to improved water quality and returning cultivated land to wildflower meadows or other more natural states. \n“We will also make additional money available for those who wish to collaborate to secure environmental improvements collectively at landscape scale.” \nHe also said that ensuring public access to the countryside was a public good, though he acknowledged it was a “contentious issue”. \nBut he added: “The more the public, and especially schoolchildren, get to visit, understand and appreciate our countryside, the more I believe they will appreciate, support and champion our farmers.” \nMr Gove said the way that financial support had been provided to farmers had been far too bureaucratic, with “near-pointless” box-ticking exercises and multiple inspections, and promised simplified systems in the future. \nHe also said that, with food exports from the UK guaranteed to be high-quality and more sustainable, it would be “foolish” to lower environmental or animal welfare standards in future trade deals. \nAnd he insisted that European producers had as much interest in securing continued tariff-free access between the UK and the EU as British farmers. \nNFU President Meurig Raymond has welcomed the speech as a positive signal for the farming industry. \nHe said: “A transition period that allows time to prepare properly for the introduction of a new agricultural policy is also welcome, during which an assessment can be made of the impact of Brexit on UK farming – on trade in the raw ingredients farmers produce, on farm businesses’ access to a competent and reliable workforce, and on the regulatory environment in which they operate. \n“The NFU is up for the challenge of working in partnership with government in reframing agricultural policy for the post-Brexit world. \n“With adequate time to prepare, we can ensure that the introduction of an ambitious new policy framework, one that is suited to the needs of the farming industry and the expectations of the UK public, is managed properly and delivered successfully.” \nCLA director of policy Christopher Price added: “Exiting the European Union gives us a once in a generation opportunity to build a new food and land use policy that is significantly better than the CAP. This speech is the latest evidence that Government is embracing our vision for a new policy based on rewarding farmers for the range of public benefits they deliver. \n“We have been clear that significant change is necessary but it is right to take the necessary time to design and implement a policy without causing immediate and dramatic disruption to thousands of farming businesses across the countryside. \nWe are pleased the Secretary of State has listened to our concerns on this issue and extended the period of operation of the existing basic payment scheme to ensure a full and smooth transition.” Like us on Facebook", "external_links": [], "published": "2018-01-04T14:52:00.000+02:00", "crawled": "2018-01-04T15:17:24.014+02:00", "highlightTitle": ""}