{"organizations": [], "uuid": "d594e7b5ef8af5c6e3e2e283f66091e28cc4cf56", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article12784005.ece/ALTERNATES/s1200/JS115107864.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14103365", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Next bounces back after Christmas provides profit boost", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T10:30:00.000+02:00", "replies_count": 0, "uuid": "d594e7b5ef8af5c6e3e2e283f66091e28cc4cf56"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14103365", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Next bounces back after Christmas provides profit boost", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "christmas  fashion chain next", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HS2 contractor carillion probed by watchdog Keith Cochrane, interim chief executive at Carillion 9:19 Jonathon Manning Manufacturing industry delivers 'solid' growth in December \nActivity in Britain’s manufacturing sector has eased from a near four-and-a-half-year high, but still stumped up “solid” output and order growth in December.The closely watched Markit/CIPS UK Manufacturing purchasing managers’ index (PMI) showed a reading of 56.3 last month, down from 58.2 in November, with economists expecting a figure of 57.9.A reading above 50 indicates growth.While output levels from consumer goods producers rolled back, intermediate and investment goods motored ahead thanks to rising demand from overseas.UK producers enjoyed a healthy appetite from Europe, China, the Middle East and America, helping to drive a further rise in employment.It means the manufacturing industry churned out an average reading of 57 for final three months of the year - its best performance since the second quarter of 2014.Rob Dobson, director at IHS Markit, said UK manufacturing ended the year on a positive footing.He said: \nAlthough growth of output and new orders moderated during December, rates of expansion remained comfortably above long-term trend rates. \nThe sector has therefore broadly maintained its solid boost to broader economic expansion in the fourth quarter. \nThe outlook is also reasonably bright, with over 50% of companies expecting production to be higher one year from now. \nThe main growth engines were the intermediate and investment goods sectors during December, suggesting resilient business-to-business demand and capital spending trends, albeit in part due to rising exports. Workers in a factory (Image: PA) 9:15 Jonathon Manning Newcastle law firm Muckle blames Brexit vote for 54% drop in profit \nNewcastle law firm Muckle LLP predicts a brighter 2018 despite blaming Brexit for halving its profits and wiping over £1.5m from its top line revenue last year. \nTurnover at the Gallowgate based firm slumped 12.7% to £10.6m for the year ending March 2017, with managing partner Jason Wainwright saying the dip was caused by uncertainties in the North East business market and economic climate around the Brexit vote. \nMuckle’s net profit - the final amount paid out to partners at the firm - was also affected, falling by 54% from £2.6m to £1.187m. \nMr Wainwright said: \nThe first five months of the financial year 2016/7 were challenging, largely due to uncertainties arising from the Brexit vote. \nWe are primarily a law firm for North East business, so much of our work revolves around business economic activity in the region. \nWhilst we are pleased to have remained the top dealmaker in the North East throughout the 2016/7 financial year, the drop in economic activity in the region at the beginning of that financial year had a considerable impact on our overall financial performance. \nMost encouragingly, work levels improved from September 2016 onwards and we hit our targets for the second half of the financial year. Jason Wainwright, managing partner at Muckle LLP (Image: Muckle LLP) 9:13 KEY EVENT Rumours of Newcastle United sale gather steam after Staveley sets up new company \nRumours that Mike Ashley could be close to selling Newcastle United have gathered steam after it was revealed that Amanda Staveley has set up a new company. \nMs Staveley has been circling the club for months, but it looks as though a deal could soon be on the cards after the investor set up a company called Cantervale Limited. \nAccording to details on Companies House, Cantervale Limited is set up as a business specialising in “financial intermediation”, meaning it could be used as a holding account for Newcastle United. \nNo official details about the use of the company or the sale of Newcastle United have been issued. Mike Ashley and Amanda Staveley are reportedly close to agreeing a deal for the takeover of Newcastle United 9:02 Jonathon Manning Durham Distillery on the move to city centre amid plans to start whisky production \nDurham Distillery has announced it is expanding into a new home as it gears up to start production of the first whisky to be distilled in the North East. \nThe firm behind the popular Durham Gin and Durham Vodka brands is moving into Durham city centre where it plans to make batches of Durham Whisky, as well as increase production of its other drinks. \nThere are also plans to make its new base a visitor destination. \nThose keen to be part of the firm’s latest plans can now sign up to reserve a Founder’s Cask from the first whisky run, as well as cases or bottles, which will be ready to drink in 2021. \nurham Distillery is already widely known for its gin and vodka products, which were launched in 2014 by owner Jon Chadwick and head distiller Jessica Tomlinson. The drinks are now stocked in the likes of Fenwick Food Hall and Majestic Wines stores across the UK. \nMr Chadwick said: \nWe are gearing up for what will be a huge year for the business, moving from the outskirts of Durham to a larger city centre premises to begin producing the first whisky to be made in this region, alongside increased production of our gin and vodka. \nOur new home will not only give us additional operations and storage capacity, but will enable us to become a visitor destination. \nThe aim is to host guided tours daily, as well as private functions and corporate events, in addition to being a welcome space for local people to enjoy as a meeting place. \nI realised my dream when Durham Distillery was founded in 2014, and to see it go from strength to strength with significant growth plans on the horizon is fantastic. Jessica Tomlinson, head distiller at Durham Distillery (Image: Durham Distillery) 8:57 Jonathon Manning Last-ditch talks due in bid to avert rail strikes as fare rise fallout continues \nLast-ditch talks aimed at averting some of the strikes planned on the railways next week will be held on today, as the fallout from the train tickets price increase continues.The Rail, Maritime and Transport (RMT) union said it will be meeting senior managers from South Western Railway and Arriva Rail North to try to find a solution to the long-running dispute over the role of guards.A series of strikes is due to be held next week at both companies as well as on Southern, Merseyrail and Greater Anglia.The union said that proposed talks with Southern, where the dispute has been on-going for 20 months, “collapsed”.RMT general secretary Mick Cash said: \nRMT will enter the talks with South Western Railway and Arriva Rail in good faith and seeking an agreement which guarantees a guard on their trains and protects the safety, security and access of the travelling public. \nIf we can secure that kind of agreement in Scotland and Wales, there is no reason at all why we can’t do the same in England. \nThe union is angry and frustrated that our efforts to get talks back under way with Southern over 20 months into our dispute with the company have been kicked back in our faces when it looked like we were making some progress. \nRMT will continue to press all of the rail companies for genuine and meaningful talks in each of the se", "external_links": [], "published": "2018-01-03T10:30:00.000+02:00", "crawled": "2018-01-03T10:49:40.046+02:00", "highlightTitle": ""}