{"organizations": [], "uuid": "2611ed8cdf37365736431f0c962aeb9d1bac6e2f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1026017.ece/ALTERNATES/s1200/HighStreet.jpg", "site_section": "", "section_title": "", "url": "http://www.devonlive.com/news/devon-news/high-street-giants-face-store-1025260", "country": "US", "title": "High street giants face store closures following poor Christmas sales - Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "", "spam_score": 0.191, "site_type": "news", "published": "2018-01-08T13:37:00.000+02:00", "replies_count": 0, "uuid": "2611ed8cdf37365736431f0c962aeb9d1bac6e2f"}, "author": "Rom Preston-Ellis", "url": "http://www.devonlive.com/news/devon-news/high-street-giants-face-store-1025260", "ord_in_thread": 0, "title": "High street giants face store closures following poor Christmas sales - Devon Live", "locations": [], "entities": {"persons": [{"name": "house of fraser", "sentiment": "none"}], "locations": [{"name": "torquay", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "debenhams", "sentiment": "none"}, {"name": "mothercare", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "ikea", "sentiment": "none"}, {"name": "house of fraser", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "High street giants face store closures following poor Christmas sales House of Fraser, Debenhams, New Look and Mothercare are all struggling Share Poor Christmas sales has left the high street struggling Share   Thank you for subscribing!   \nSome of Britain best known retailers could be forced to close their stores across Devon after the high street was hit by poor Christmas sales. \nMothercare has warned over profits after UK sales plunged over the festive season while Debenhams' shares sunk 15 per cent as it warned that annual profits would be lower than expected. \nRival department store House of Fraser is seeking to cut the size of stores in an effort to slash its rent bill after a tough Christmas and clothes retailer New Look is struggling after suppliers had vital insurance cover blocked. Read More This is why IKEA took over Exeter city centre today \nDebenhams, which has stores in Exeter, Plymouth and Torquay, saw like-for-like sales in the UK fall 2.6 per cent in the 17 weeks to December 30 \nBaby retailer Mothercare said UK like-for-like sales plummeted 7.2 per cent in the 12 weeks to December 30, while online sales tumbled 6.9 per cent. Exeter Debenhams is a flagship store in Princesshay \nAs a result, Mothercare now expects adjusted group profit for the year is likely to be in the range of £1m to £5m. \nThe retailer currently has stores in Exeter, Plymouth and Torquay. \nMothercare's current Plymouth store, on the bottom floor of Drake Circus mall, is set to relocate to a new retail park outside of the city centre. \nChief executive Mark Newton-Jones said: “As we signalled in November, there has been a softening in the UK market with lower footfall and website traffic resulting in lower spend in both stores and online. This trend has continued. Read More Exeter's Matalan store announce shock closure - and this is when it'll close \n“Going forward, we are not anticipating any improvement in the short-term market conditions for the UK.” \nRetailers have been hammered by weak consumer confidence off the back of soaring inflation, which has hit 3.1 per cent following the collapse in the pound after the Brexit vote. \nTotal UK sales also fell 11 per cent over the period, reflecting a store closure programme linked to a turnaround plan. In the year to date, sales are down 4.5 per cent in the UK. Mothercare in Drakes Circus, Plymouth \nThere have been widespread rumours that House of Fraser, which has department stores in Exeter and Plymouth, will seek to close stores and cut its rent bill via a company voluntary arrangement, a form of insolvency. \nThe store group, which was bought by Chinese conglomerate Sanpower in 2014, wants to cut its high street footprint by 30 per cent over 10 years. Read More \nWhile New Look is battling to revive its fortunes after booking a £10.4m loss in the six months to September 2016 – compared to a £60 million profit the year before. The fashion chain has 11 stores across Devon. Like us on Facebook", "external_links": [], "published": "2018-01-08T13:37:00.000+02:00", "crawled": "2018-01-08T14:00:12.004+02:00", "highlightTitle": ""}