{"organizations": [], "uuid": "fe91a7d9ca2ed5437d89cfab79bf70b601c32908", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13967333.ece/ALTERNATES/s1200/CFR_NJL_281117atom_01.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14195873", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Atom Bank founder Anthony Thomson resigns as chairman", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T10:00:00.000+02:00", "replies_count": 0, "uuid": "fe91a7d9ca2ed5437d89cfab79bf70b601c32908"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14195873", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Atom Bank founder Anthony Thomson resigns as chairman", "locations": [], "entities": {"persons": [{"name": "anthony thomson", "sentiment": "negative"}, {"name": "anthony", "sentiment": "negative"}, {"name": "bridget", "sentiment": "none"}, {"name": "rosewell", "sentiment": "none"}], "locations": [], "organizations": [{"name": "atom bank", "sentiment": "negative"}, {"name": "britannia building society", "sentiment": "none"}, {"name": "driver vehicle standards agency", "sentiment": "none"}, {"name": "national infrastructure commission", "sentiment": "none"}, {"name": "board", "sentiment": "none"}, {"name": "ulster bank", "sentiment": "none"}, {"name": "network rail", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The FTSE-100 index at 8.15am was up 4.54 at 7647.97. Screen displaying the FTSE 100 at the London Stock Exchange (Image: Yui Mok/PA Wire) 8.38 Coreena Ford Vertu Motors announces full year results to be 'moderately below' expectations \nMotor retailer Vertu Motors says its full year results have been impacted by declines in the new car market, which will place its performance “moderately below” expectations. \nThe Gateshead based firm, which has a network of 121 sales and aftersales outlets across the UK, made the announcement in a trading update, the ahead of its preliminary results for the year ended February 28 2018. \nThe board said it expects trading performance to be moderately below current market expectations, following further declines in the new car market resulting from the depreciation of sterling and a softer general consumer environment. \nDuring the four months to December 31 2017, group revenues were down 2.4%, while service revenues were up 1.9%. \nElsewhere, used retail vehicle volumes fell 5% with new retail vehicles dropping by 15.7%. \nRobert Forrester, chief executive of Vertu Motors said: \nThe group has experienced tougher trading conditions compared to recent years as Sterling’s devaluation places pressure on new car pricing and supply. This has coincided with a slightly softer general consumer environment in the run up to Christmas which has been well-reported. \nThe group continues to be very well positioned to take full advantage of weaker markets which, in previous sector downturns, have proven to provide opportunities. \nAt the year-end we expect to have a strong balance sheet underpinned by a property-rich asset base with low levels of debt. We fully intend to continue our share buy-back programme as we believe this creates value and does not impact our ability to undertake value-enhancing investments in the business or undertake suitable acquisitions. Robert Forrester, CEO of Vertu Motors (Image: vertu motors) 8.32 Coreena Ford Up to 150 jobs could be created with company's move to North Shields \nUp to 150 jobs could be created after a Scottish manufacturing firm opened a new site in the North East. \nPryme Group, which provides integrated manufacturing solutions to the oil and gas, defence and aerospace industries, has invested £9.5m to open a site at the Tyne Tunnel Estate in North Tyneside. \nThe Dundee-based group has brought together three separate group companies – MKW Total Engineering, Stargate Precision Engineering and TME Hydraulics – that had previously been based at Ryton, Gateshead. \nThe new 58,000 sq ft facility will initially employ 75 people with the company adding another 20 by the end of next year. Pryme hopes to double its current headcount and be employing 150 people over the next five years. \nThe company’s move has been supported by a grant of £1.35m from the North East LEP which allowed UK Land Estates to build the new facility. Angus Gray, CEO of Pryme Group (Image: Copyright unknown) 8.25 Coreena Ford Online retailer ASOS reports soaring sales \nOnline fashion retailer ASOS saw a jump in revenues in the final months of 2017, boosted by international sales and the draw of same-day deliveries at its UK business. \nIn its latest trading update, the company reported a 28% rise in total group revenue to £808.4 million for the four months to December 31, helped by “exceptional performance” in the UK where retail sales climbed 23% to £300.9 million, both at constant currencies. \nThe division benefited from speedier deliveries and the retailer’s “try before you buy” offer, which lets customers order products to try at home and only pay for what they decide to keep, rather than having to seek a refund. \nASOS said its UK performance was “exceptional” despite a “challenging market”. International sales, meanwhile, rose 32% over the period, with EU sales surging 34% and its US operations booking a 28% increase. \nSales across the remainder of its international business - including Australia and Russia - were up 32%. Want these today? ASOS says same-day delivered have helped to drive up revenues. (Image: ASOS) 8.20 Coreena Ford Department   report says \nLiam Fox’s Department for International Trade (DIT) has been criticised for falling behind schedule on its Brexit responsibilities and risking the future of British business as a result. \nThe work of the DIT - which is in charge of developing post-Brexit free trade agreements - has been put under the microscope as part of a National Audit Office (NAO) report, which found the department was struggling to develop specialist trade skills among staff and has had to “adjust” its timeline. \n“Delivery of the work streams will be challenging and DIT has put back some of its delivery milestones as the timetable for legislation and the overall negotiation process has moved on,” the NAO report said. \nIt also said the civil service model, which sees staff move every few years, is “not best suited” to developing specific trade and negotiation skills, adding there will be a “premium” on retraining and recruiting outside staff. \n“Considerable work will need to be done to build skills that have not existed in government for a generation,” the NAO said. Liam Fox at the Tory Conference, Manchester (Image: Daily Mirror) 8.15 Coreena Ford Sky delivers hike in earnings amid Fox takeover saga \nSky has posted a leap in half-year earnings as it added new customers and benefited from a hike in demand for pay-as-you-go products. \nThe group reported a 10% rise in underlying earnings to £1.1bn for the six months to the end of December as it added 365,000 new customers and sold 20 million pay-as-you-go products, such as one-off films and sporting events. \nThe figures come days after Britain’s competition watchdog provisionally blocked 21st Century Fox’s £11.7bn bid to take full control of Sky. \nThe Competition and Markets Authority (CMA) said the deal would hand Fox owner Rupert Murdoch and his family too much control over UK news media and is looking at remedies before making its final decision by May 1. \nSky’s interim results showed the group’s customer base stands at 22.9 million after the half-year performance. \nChief executive Jeremy Darroch cheered an “excellent” set of results against a difficult consumer market, with household finances under pressure. \nOn a reported basis, operating profits rose 24% to £573m, while revenues lifted 5% to £6.7bn. \nMr Darroch said Sky had continued to keep a lid on costs through efficiency savings, but would remain focused on investing in original content “each and every year”. A Sky HD TV remote control (Image: Chris Radburn/PA Wire) 8.07 KEY EVENT \"Anthony is the consumer's champion', says incoming Atom Bank chair \nIncoming chair Bridget Rosewell has been the chair of Atom Bank’s audit committee since 2014. \nShe has an economics background and is also chairman of the Driver Vehicle Standards Agency and on the board of Network Rail as well as a commissioner with the National Infrastructure Commission. Bridget has sat on the board of Ulster Bank and the Britannia Building Society. \nShe said: \nIt is thanks to Anthony’s vigour and dedication that Atom bank is what it is today. Anthony is the consumer’s champion, leading from the front to bring true competition to the industry and to change banking for good. \nIt is with regret but also great admiration that the Board have accepted his resignation, and I and my colleagues fully understand his reasons for leaving having brought the business to maturity and achieved so much so quickly. \nToday there are 300 people working for Atom bank who will miss Anthony’s unique wit and wisdom, but customers and stakeholders should know that he leaves the bank in great heart and with an exciting future in prospect. \nCarlos Torres Vila, Chief Executive Officer at BBVA added: \nAbove all, businesses invest in people. Anthony’s vision and his ability to build great teams was fundamental in our decision to invest in and continue to support Atom bank. We thank him for his exceptional leadership and contribution, and we wish him well into the future. \nI am very happy to join in welcoming Bridget’s appointment to chair the business, and we look forward to working closely with her, Mark and rest of the Atom bank team. Atom Bank headquarters in Durham 8.00 Anthony Thomson resigns as chairman of Atom Bank \nAnthony Thomson has announced his resignation as chairman of Atom bank. \nMr Thomson - founder and chairman since Atom bank was established in 2014, has guided the business through the process of gaining a banking licence, raising over £250m of capital and becoming one of the fastest growing start-up businesses in the UK. \nSince launching, Atom bank has taken over £1bn of deposits and has now lent over £1bn to small businesses and homeowners. \nMr Thomson was instrumental in bringing in global superstar Will.i.am as a strategic advisor to the board last year, also bringing him to the North East at the end of last year to unveil a four-year partnership with the Prince’s Trust. \nUnder his chairmanship the bank has also held a top 10 position in KPMG’s global fintech rankings for the last three years. \nBridget Rosewell has been appointed as the next chair of Atom bank subject to regulatory approval. \nMr Thomson revealed he has co-authored a book, and that he intends to spend much of the next year travelling to discuss the book. \nSince having the idea for Atom bank in early 2012 it has gone from being a big idea disguised as a small bank to a big idea and a big bank. \nI am immensely proud that Atom bank has now completed over £1bn of lending to households and small businesses. \nThis is a testament to the efforts of every person at Atom bank, and to the support of all of our shareholders. \nI am an entrepreneur and champion of the customer first and foremost. I specialize in disrupting, creating and building and I hope this will be my contribution to the Atom bank story. \nI have loved doing this with Atom but, as the bank moves into a new phase of development, I feel the time is right for me to step down from the role of chairman. \nAs Founder I remain fully committed to Atom bank’s success and will remain a shareholder. Looking ahead, I have recently co-authored a book on the marketing of money that comes out in March. \nAs I discuss the messages and learning in the book I am going to spend much of the next twelve months travelling extensively. However the people who work at and support Atom bank will never be far from my thoughts. Atom Bank founder Anthony Thomson with strategic advisor Will.i.am, during the superstar's visit last November. More On", "external_links": [], "published": "2018-01-25T10:00:00.000+02:00", "crawled": "2018-01-25T10:20:36.009+02:00", "highlightTitle": ""}