{"organizations": [], "uuid": "ef42da413fc500ddf3b1cf42d455cc10c7f53528", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article12457040.ece/ALTERNATES/s1200/2016-Labour-Party-Conference-in-Liverpool.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/no-referendum-over-600m-north-14175667", "country": "GB", "domain_rank": 21960, "title": "Why there will be NO referendum over the £600m North of the Tyne devolution deal", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T15:00:00.000+02:00", "replies_count": 0, "uuid": "ef42da413fc500ddf3b1cf42d455cc10c7f53528"}, "author": "Sean Seddon", "url": "https://www.chroniclelive.co.uk/news/north-east-news/no-referendum-over-600m-north-14175667", "ord_in_thread": 0, "title": "Why there will be NO referendum over the £600m North of the Tyne devolution deal", "locations": [], "entities": {"persons": [{"name": "coun forbes", "sentiment": "none"}, {"name": "sajid javid", "sentiment": "none"}, {"name": "nick forbes", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "north tyneside", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}], "organizations": [{"name": "ntca", "sentiment": "none"}, {"name": "newcastle city council", "sentiment": "none"}, {"name": "north of tyne combined authority", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Why there will be NO referendum over the £600m North of the Tyne devolution deal The leader of Newcastle City Council, Nick Forbes, has revealed Sajid Javid wants more powers to come to North East as soon as this summer Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe leader of Newcastle City Council has revealed he is hopeful the region will have a further TWO devolution deals by the time of the first mayoral election. \nBut he has ruled out a referendum over the current £600m deal because it will be too costly and time consuming. \nCouncillor Nick Forbes said he had discussed the prospect of further devolution with Communities and Local Government Secretary Sajid Javid at a meeting in London. \nIf everything goes to plan and the North of Tyne Combined Authority (NTCA) is established by this summer, Coun Forbes said new powers could be transferred from Government before the first set have even been fully implemented. \nAlong with his counterparts in North Tyneside and Northumberland, the city leader is in the process of selling the landmark devolution deal to the public before Parliament moves to ratify it in March. \nThe agreement signed with the Government in November 2016 is worth an initial £600m over 30 years and comes with new powers around housing, employment and education. Newcastle City Council leader Nick Forbes \nFacing questions alongside Newcastle City Council chief executive Pat Ritchie at a public consultation event at Northumbria University, Coun Forbes also explained why a local referendum on the deal was ruled out. \nOn further devolution, he said: “The last meeting we had with Sajid Javid in London was about the Parliamentary timetable for formally establishing the NTCA. \n“He said he hoped by the time we had an interim mayor in place that we would have another deal well under way. \n“We still need to have negotiations with the Government on the specifics of things like the new housing powers but I would hope that, by the time of the first election in May 2019, we could have at least one or even two more deals by then.” Read More Transport for the North unveil 30-year, £69bn road and rail plan - plus a 'Northern Oyster card' \nPressed by Hilton Dawson, a former Labour MP who set up the North East Party, on why there wasn’t a local referendum held on the deal, Coun Forbes said it would have been too costly and delayed the process. \nHe said: “The Government has given us a strong steer that the consultation needs to be done by March because the Parliamentary timetable will be completely tied up with Brexit legislation beyond then. \n“It also said we would have to pay for it ourselves and it would cost us more than £1m. \n“Holding up the deal with a referendum puts it in serious risk, so not holding a referendum is the judgement we have come to.” Read More", "external_links": [], "published": "2018-01-19T15:00:00.000+02:00", "crawled": "2018-01-19T16:10:11.004+02:00", "highlightTitle": ""}