{"organizations": [], "uuid": "8228480298112d3669fece72834f5cda8c911aa1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.plymouthherald.co.uk/incoming/article1033280.ece/ALTERNATES/s1200/Red-Ruby-Devon-cows.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "devonlive - frontpage", "url": "http://www.devonlive.com/news/devon-news/farmers-hit-out-tesco-over-1033144", "country": "GB", "title": "Farmers hit out at Tesco over 'unacceptable' lack of British beef available in South West stores", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T16:25:00.000+02:00", "replies_count": 0, "uuid": "8228480298112d3669fece72834f5cda8c911aa1"}, "author": "Athwenna Irons", "url": "http://www.devonlive.com/news/devon-news/farmers-hit-out-tesco-over-1033144", "ord_in_thread": 0, "title": "Farmers hit out at Tesco over 'unacceptable' lack of British beef available in South West stores", "locations": [], "entities": {"persons": [{"name": "chris mallon", "sentiment": "none"}, {"name": "richard austin", "sentiment": "none"}], "locations": [{"name": "south west", "sentiment": "none"}], "organizations": [{"name": "tesco", "sentiment": "none"}, {"name": "nba", "sentiment": "none"}, {"name": "national beef association", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Farmers hit out at Tesco over 'unacceptable' lack of British beef available in South West stores Disappointed shoppers contacted the National Beef Association to ask why local beef wasn't available Share Red Ruby Devon cattle on Exmoor. The National Beef Association (NBA), which represents British beef farmers, says shoppers were left disappointed over the festive period by not being able to buy British beef in Tesco stores (Image: Richard Austin) Share Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nLeaders in the beef sector are calling on supermarket giant Tesco to review their sourcing strategy for British beef, after claims of “bare” aisles in South West stores. \nThe National Beef Association (NBA), which promotes and supports the beef industry at all levels, says Tesco “failed to meet” demands of consumers for British beef over the Christmas and New Year - a peak time for the sale of quality cuts. \nChris Mallon, chief executive of the NBA, said disappointed consumers have been contacting the group to ask why local beef is not available. Chris Mallon, chief executive of the National Beef Association (NBA) \nHe explained: “With ample supply from processors and cattle available, the only justification for Tesco for failing to support British farmers is to increase their margin. The NBA feels this is unacceptable, with now more than ever the need to support home-grown produce. \n“Tesco’s marketing campaigns show large images of British farmers and place a strong emphasis on ‘working together’ with local suppliers, yet recently in reality, in the South West, their shelves tell a different tale.” Read More Devon farmer and Greener For Life founder filled River Exe stream with serious pollutant \nWhile imports are vital to balance shortages in supply, Mr Mallon added that the NBA has had no reports of shortages from processors - leading to questions over the lack of British produce available in store. \nHe continued: “The South West is renowned for being one of the largest cattle producing areas in the country, with a strong Westcountry PGI (Protected Geographical Indication) brand. Selling imported beef in the South West is similar to the old adage of sending coals to Newcastle.” West Country beef was granted Protected Geographical Indication (PGI) status in January 2014 (Image: Anthony Mosley) \nWest Country beef and lamb was granted with PGI status in January 2014 by the European Commission, meaning that beef and lamb from the region that meets specific criteria is eligible to carry the PGI logo. \nIn order to qualify for PGI status, criteria fulfilled will include beef and lamb coming from stock born, raised and finished in Cornwall, Devon, Somerset, Gloucestershire, Dorset or Wiltshire and fed at least a 70% forage-based diet. Read More Devon farm raiders ordered to pay back almost £150,000 \nMr Mallon concluded: “The NBA believes that it is paramount that supermarkets show their support for British produce, particularly around the peak festive season and uncertain political times. \n“British farmers produce beef to some of the highest global health and welfare standards and should not be forced to compete with inferior products.” British farmers - particularly those in the South West - are renowned for top quality beef production \nIt comes as sector analysts predict that the British beef market could become “less inviting” after Brexit. Writing in the Andersons Outlook 2018 report, Ben Burton and Jack Frater said: “At present the UK is a significant net importer, but should the value of the Pound remain low, the UK market could become less inviting. \n“This is good news for domestic producers, but could well be overshadowed by the threat of reducing subsidies, on which the beef sector is still so heavily reliant.” Like us on Facebook ", "external_links": [], "published": "2018-01-09T16:25:00.000+02:00", "crawled": "2018-01-09T16:39:56.007+02:00", "highlightTitle": ""}