{"organizations": [], "uuid": "e38e79d6031d5c4fa6f9ba9dbcadf020852309a0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article459274.ece/ALTERNATES/s1200/Ben-Bradshaw-2PNG.png", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "devonlive - frontpage", "url": "http://www.devonlive.com/news/news-opinion/unless-brexit-talks-go-well-1005857", "country": "GB", "title": "Unless Brexit talks go well, there could be ANOTHER General Election", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T16:16:00.000+02:00", "replies_count": 0, "uuid": "e38e79d6031d5c4fa6f9ba9dbcadf020852309a0"}, "author": "Ben Bradshaw", "url": "http://www.devonlive.com/news/news-opinion/unless-brexit-talks-go-well-1005857", "ord_in_thread": 0, "title": "Unless Brexit talks go well, there could be ANOTHER General Election", "locations": [], "entities": {"persons": [{"name": "ben bradshaw", "sentiment": "none"}, {"name": "ben bradhsaw", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "ben bradshaw", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}], "organizations": [{"name": "general election news", "sentiment": "none"}, {"name": "cabinet", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News opinion Unless Brexit talks go well, there could be ANOTHER General Election Ben Bradshaw says that very little has changed since the start of 2017 - and that Brexit continues to suck the life blood out of Government and the economy Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nBEN BRADSHAW IS THE LABOUR MP FOR EXETER AND HAS BEEN SINCE 1997 \nLooking back on my Express and Echo column from last New Year, it’s striking how little has changed. \nThen I wrote: “2017 will be dominated by Brexit” and : “Mrs May’s problem is her own Cabinet is divided between soft and hard Brexiteers”. A year ago I wrote that as soon as the Prime Minister “reveals her bottom lines or priorities, these divisions will be laid bare”. \nA year on, we still don’t know what sort of relationship the Government wants us to have with the rest of Europe in future. This will continue to stoke Cabinet divisions and frustration among our EU negotiating partners. Ben Bradhsaw after increasing his majority in May \nI asked last January, given the enormity of the challenge, what chance there would be that: “our pressing domestic problems like the crisis in Health and Social Care or housing will get the attention they deserve. Given all this and her (Mrs May’s) small majority, you could still see how she might be tempted to call an election.” Read More Exeter needs to tackle the avoidable killer that is air pollution \nThat, of course, was the one big thing that did change last year. Mrs May called that election and, instead of the landslide and mandate for a hard Brexit she expected, she lost her majority and with it her authority. \nThe PM could have responded with humility and grace, accepted the new reality and reached out to other parties to work together to get the country out of our mess. But no, more concerned about the hard Brexiteers in her own Party than the national interest, she made a shabby deal with the DUP and ploughed ahead towards a hard Brexit, outside the Single Market and the Customs Union. She tried to avoid a Parliamentary vote on Article 50, until she was defeated in the courts and she tried to prevent Parliament getting a proper vote on any deal, until Parliament asserted itself and defeated the Government last month. Ben Bradshaw, former Culture Secretary \nGiven the extraordinary General Election result last year, it’s a brave man to make any predictions about 2018. Read More Three Torbay Tory 'rebels' sent packing \nBut here goes: Unless the Article 50 process is halted or extended, we will know or have a good idea this year if Mrs May can get a deal that her Cabinet and Parliament can support, in time for the March 2019 deadline. \nIf she can’t, she’ll either have to resign and let another Tory try to do better (doubtful), or there will have to be another General Election. Yes, another one! Theresa May (Image: PA Wire/PA Images) \nWhile Brexit continues to suck the life blood out of Government and the economy in 2018, our pressing domestic problems and many more besides will remain unaddressed. Read More The eight craziest political stories of 2017 \nIn 2018 the investigation into alleged collusion between the Kremlin and the Trump campaign either will or will not find a smoking gun. \nA year ago there were still hopes the presidency might moderate Trump. But he’s exceeded my worst fears. If he comes here in 2018, expect huge protests. Read More \nOn a brighter note, the European and world economies are recovering strongly, just not ours, thanks to Brexit. Happy New Year! Like us on Facebook ", "external_links": [], "published": "2018-01-03T16:16:00.000+02:00", "crawled": "2018-01-03T16:26:08.000+02:00", "highlightTitle": ""}