{"organizations": [], "uuid": "6f65a2de5d79594fbf60e6a683c22828e5c75ce2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14129215.ece/ALTERNATES/s1200/Untitled-design.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/theresa-cabinet-reshuffle-jeremy-hunt-14129183", "country": "GB", "domain_rank": 21960, "title": "Theresa May cabinet reshuffle: Jeremy Hunt keeps job as Health Secretary in chaotic shake-up", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T23:20:00.000+02:00", "replies_count": 0, "uuid": "6f65a2de5d79594fbf60e6a683c22828e5c75ce2"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/theresa-cabinet-reshuffle-jeremy-hunt-14129183", "ord_in_thread": 0, "title": "Theresa May cabinet reshuffle: Jeremy Hunt keeps job as Health Secretary in chaotic shake-up", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nHealth Secretary Jeremy Hunt kept his job after convincing Prime Minister Theresa May that he could sort out the chaos in the health service and social care, as the Prime Minister reshuffled her Cabinet. \nMr Hunt will now be known as Secretary of State for Health and Social Care, after apparently persuading Mrs May he had a plan to bring the two services closer together. \nLocal councils are currently responsible for care while health services are provided by the NHS, but politicians from all parties as well as health managers have been calling for a “joined up” service in which they work closely together. \nHospitals have found themselves unable to discharge patients because of a lack of care in the community, which councils blame on funding cuts. Prime Minister Theresa May and Jeremy Hunt (Image: PA) \nMr Hunt’s new role was welcomed by Northumberland MP Anne-Marie Trevelyan, MP for Berwick, who said on Twitter: “Excellent that Theresa May has pulled together health and social care into one department under Jeremy Hunt’s leadership.” \nBut the reshuffle was described as a shambles by some Westminster insiders after former Transport Secretary Chris Grayling was announced as the new Conservative Party chair - only for the decision to be reversed, with immigration minister Brandon Lewis getting the job instead. \nThe Grayling announcement was made on Twitter by the official account of the Conservative Party , with the Tweet swiftly deleted. \nMr Lewis replaces Sir Patrick McLoughlin, who is understood to have stood down as party chair voluntarily. \nMr Hunt was previously expected to move to the Department for Business, Energy and Industrial Strategy, replacing Business Secretary Greg Clark. But both Mr Hunt and Mr Clark reportedly refused to move, forcing the Prime Minister to revise her plans. Read More Metro cash, Article 50 and a memorable election: The key moments in British politics in 2017 \nDavid Gauke moved from the Department for Work and Pensions, where he was responsible for the roll-out of Universal Credit, to become Secretary of State for Justice. \nBut former Education Secretary Justine Greening reportedly refused Mrs May’s request that she should take on the Work and Pensions role. She spent more than two hours locked in talks in Downing Street, before eventually resigning from the Government. \nMs Greening will be replaced as Education Secretary by Damian Hinds. \nSajid Javid stayed put as Local Government Secretary, but instead of leading the Department for Communities and Local Government he is now in charge of the Ministry for Housing, Communities and Local Government. \nWhile housing had always been one of the department’s responsibilities, making the name change merely cosmetic, Mr Javid said it “reflects this Government’s renewed focus to deliver more homes”. Read More The year ahead in politics: Here's what we can expect in 2018 \nHowever, there was mystery over why the word “department” had been changed to “ministry”. \nDavid Lidington was named Minister for the Cabinet Office, replacing Damian Green who resigned last year. However, he did not inherit Mr Green’s title of First Secretary of State. \nAnd Karen Bradley was moved from the role of Culture Secretary to become Secretary of State for Northern Ireland. She had been fighting to force Channel 4 to relocate out of London, something bosses at the broadcaster were loathe to do. \nThe Secretary of State for Digital, Culture, Media and Sport is Matt Hancock MP, while there was no change for Home Secretary Amber Rudd, Foreign Secretary Boris Johnson, Chancellor Philip Hammond or Brexit Secretary David Davis, who stayed where they were. \nLiam Fox continued as Secretary of State for International Trade and Chris Grayling stayed in the role of Transport Secretary. Like us on Facebook", "external_links": [], "published": "2018-01-08T23:20:00.000+02:00", "crawled": "2018-01-09T09:40:34.300+02:00", "highlightTitle": ""}