{"organizations": [], "uuid": "12beaccffaa5824992197ce615583e67a591012a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14143099.ece/ALTERNATES/s1200/Graduations.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/brexit-immigration-rules-could-cost-14142898", "country": "GB", "domain_rank": 21960, "title": "Brexit immigration rules could cost Newcastle's economy over £300m", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T19:49:00.000+02:00", "replies_count": 0, "uuid": "12beaccffaa5824992197ce615583e67a591012a"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/brexit-immigration-rules-could-cost-14142898", "ord_in_thread": 0, "title": "Brexit immigration rules could cost Newcastle's economy over £300m", "locations": [], "entities": {"persons": [], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "higher education policy institute", "sentiment": "none"}, {"name": "ugc tne", "sentiment": "none"}, {"name": "hepi", "sentiment": "none"}, {"name": "newcastle university", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Brexit immigration rules could cost Newcastle's economy over £300m Newcastle's economy could suffer if immigration rules make it harder for international students to study and stay in the UK Share Newcastle University students celebrate their achievements at the summer graduation ceremonies (Image: UGC TNE) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nInternational students contribute nearly £700m to the North East economy each year, supporting hundreds of jobs and businesses, a new report says. \nThe report by the the Higher Education Policy Institute (HEPI) says that, as well as contribution in terms of tuition fees, international students help to create jobs, and boost local economies and a fall in numbers would mean job losses plus an impact on businesses such as taxi firms, sandwich shops, bars and nightclubs. \nWith numbers of foreign students potentially under threat both from Brexit and the Government’s drive to reduce immigration numbers, the report points out that “almost every part” of the British economy benefits from overseas students. \nNewcastle’s economy could be particularly damaged by tougher immigration regulations, with the city getting £300m from international students and the Newcastle East parliamentary constituency ranked as the second highest area in the UK for economic benefit at £191.9m. Flag-raising ceremony to welcome international students to Newcastle at the Civic Centre (Image: newcastle chronicle) \nHEPI director Nick Hillman said: “Fewer international students would mean a lot fewer jobs in all areas of the UK, because international students spend money in their universities, in their local economies, and on products that are manufactured across the UK. \n“It is literally the sandwich shops, the bike shops, the taxi firms, it is the nightclubs, it’s the bookshops. Almost every part of the British economy benefits from having international students.” \nHe added: “Very often the university is the single biggest employer in an area. The university probably wouldn’t go bust without international students, but some of the local companies might go bust. Some of the local resident population would lose their jobs and there would be less work to do in that town or city.” \nThe report has been backed by the North East England Chamber of Commerce , which also highlighted longer-term benefits from bringing overseas students to the region. Paul Carbert, policy advisor, North East England Chamber of Commerce (Image: handout) \nPaul Carbert, policy adviser at the Chamber, said: “We have been clear that when the Government is looking at immigration laws - and we are expecting a white paper on immigration and Brexit later in the year - they must make it easy for international students to come to this country. \n“We would like the process for students being able to stay after their studies made easier both for the students themselves and for companies sponsoring them. \n“That is a real benefit, not just for the region but for the wider country, as young people want to come and study here from all over the world. They are gaining valuable experience and if we are closing the door on them, and making it difficult for them to stay, it is a wasted opportunity.” Read More Revealed: The multimillion pound deals which see overseas firms buy North East property \nThe HEPI report examined the economic costs and benefits international students had on each parliamentary constituency in the UK. Costs taken into account included teaching grants to support universities’ teaching activities, costs associated with tuition fee grants and loans provided to EU students. \nBut on average a typical EU student generated a net gain of £87,000 for the UK economy over the course of their studies, while a non-EU international student generated £102,000. \nAway from Newcastle, the City of Durham constituency was said to benefit £112.6m from overseas students while the three Sunderland constituencies received almost £100m. \nMr Carbert said the true value international students bring to the North East may be even higher than the study suggests, due to benefits that cannot be given an immediate monetary value. Read More Take first look inside luxury Newcastle student accommodation on former ITV Tyne Tees site \nHe said: “One of the things they haven’t included in the report is the soft diplomatic power it brings to the region. \n“Having students come here from other parts of the world, that then return to their own country with the knowledge that the UK has been welcoming to them and they have had a good experience here, it is difficult to put a monetary value on that. \n“But if we are trying to build trade links with other countries that we perhaps don’t have trade links with at the moment, that is invaluable.” \nAlistair Jarvis, chief executive of Universities UK, said: “This report confirms the vital net contribution international students make to the UK. This is both in terms of their contribution to the economy, and their positive cultural and academic impact on campuses. \n“It is clear that this positive impact extends to university towns and cities in all corners of the UK.” Like us on Facebook", "external_links": [], "published": "2018-01-11T19:49:00.000+02:00", "crawled": "2018-01-11T20:33:31.000+02:00", "highlightTitle": ""}