{"organizations": [], "uuid": "8257e4fda24f23242853a978aa3cccf4c45a07a7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14206091.ece/ALTERNATES/s1200/JS140574211.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/whats-on/arts-culture-news/tears-laughter-stories-galore-not-14205687", "country": "GB", "domain_rank": 21960, "title": "For tears, laughter and stories galore, why not spend an evening with Benjamin Zephaniah?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T20:00:00.000+02:00", "replies_count": 0, "uuid": "8257e4fda24f23242853a978aa3cccf4c45a07a7"}, "author": "David Whetstone", "url": "https://www.chroniclelive.co.uk/whats-on/arts-culture-news/tears-laughter-stories-galore-not-14205687", "ord_in_thread": 0, "title": "For tears, laughter and stories galore, why not spend an evening with Benjamin Zephaniah?", "locations": [], "entities": {"persons": [{"name": "benjamin zephaniah", "sentiment": "positive"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}, {"name": "handsworth", "sentiment": "none"}], "organizations": [{"name": "newcastle journal", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "What's On For tears, laughter and stories galore, why not spend an evening with Benjamin Zephaniah? Jailed as a youngster, the Rastafarian, football-supporting poet turned his life around and is preparing for a national tour Share Writer Benjamin Zephaniah (Image: Newcastle Journal) Share Get   \n“I’m awake. Everything’s OK,” says Benjamin Zephaniah, who describes himself on his website as “poet, writer, lyricist, musician and naughty boy”. \nThe list of descriptions could be even longer but ‘phenomenon’ might sum it all up. \nHe grew up in Handsworth, the Birmingham suburb he has called “the Jamaican capital of Europe”, is dyslexic and as a youngster got into trouble with the police. \nIt was a life that could have gone so very wrong but poetry – allied to politics – saved him. \nThere’s a moving piece on his website about the time he spent in prison for burglary as a youngster. \nA warder who shared his passion for kung fu urged him one night to perform some of his poetry. \nImpressed, the warder admitted he had got him thinking and said: “You’ve got to go out and do that. You’ve got to go out and let other people hear this.” \nAnd he added: “Half the screws in this prison should sit down and listen to that.” Benjamin Zephaniah's autobiography (Image: Newcastle Journal) \nThat was a significant boost to the young man’s confidence although now he says: “There was a part of me that always knew I was going to be a poet one day.” \nAlways a keen performer, he moved to London at the age of 22 with the idea of extending his audience beyond the streets of Handsworth. \nAfter several rejections, Zephaniah had his first collection of poems, Pen Rhythm, published by a small press. \nBut he really made his name as a performance or dub poet, bringing the cadences of reggae to the spoken word. \nInstantly recognisable with his dreadlocks and gift of the gab, he would perform in the turbulent early 1980s at rallies about unemployment, homelessness, racism and police ‘stop and search’. \nNow, three months short of his 60th birthday, naughty boy Benjamain Zephaniah is something of a national treasure. \nProfessor Zephaniah, no less, has toured on every continent, has at least 18 honorary degrees and featured on The Times’ list of Britain’s top 50 post-war writers. Benjamin Zephaniah with his autobiography (Image: Newcastle Journal) \nNelson Mandela became a friend after hearing Free South Africa, the tribute to the great man which Zephaniah made with the Wailers, thereby becoming the first person to record with the band after the death of frontman Bob Marley. \nHe turned down an OBE, though, the son of a Barbadian father and Jamaican mother recoiling from the dark side of the British Empire. Read More When is World Book Day 2018 and what free books are on offer to our young readers? \nNow, with all that life lived in such colourful fashion, it seems only right that there’s an autobiography. \nIn support of The Life And Rhymes of Benjamin Zephaniah, he is embarking in May on his first solo tour in eight years. \nIt will bring him to Sage Gateshead and he might even have picked up some new young fans by then. \nOnly recently his novel for young adults, Gangsta Rap, was named as one of those to be promoted as part of World Book Day on March 1. \nAwake at home, he says: “I have just finished doing a tour with my band (The Benjamin Zephaniah Band) but that was completely different – going round the festivals with young kids screaming at me and me screaming at them. Nelson Mandela \n“But it’s true I haven’t done a speaking tour for a while and obviously this is in conjunction with the book. \n“I really didn’t like the idea of doing an autobiography but my agent kept suggesting I do one. \n“I was always telling stories about growing up in Birmingham and being told: ‘You’ve got to write this down.’ But it struck me as something people do just before they die. \n“I was very reluctant but in the end I said OK. But I didn’t want a contract or an advance of money because I didn’t want a publisher setting me a deadline.” \nAnd that, laughs Prof Zephaniah, is why this autobiography has taken him six years to write. \n“I went at my own pace. I took my time.” \nIt was a new challenge, he explains, for someone who had always expressed himself chiefly through poetry but had access to other outlets. \n“If I wanted to use my imagination, that was for my novels. If I wanted to put rhythm into something, that would be my music. \n“But people say, ‘We want to know about the person behind all this. What brought you to this point?’ \n“A lot of people grew up with their parents reading to them and sharing a love of books and my background wasn’t like that. \n“I was dyslexic and was in trouble with the police. I didn’t know any writers and there was no-one encouraging me.” \nYoung Benjamin Zephaniah didn’t keep diaries but that wasn’t his only problem once he sat down to write his life story. \nThere was the pressure he now felt under to analyse everything. \n“That was probably the most difficult thing. I know what happened and I know what I did. \n“My mother had a lot of domestic violence. My father started to beat my mother. I could write that but I thought I ought to put how I felt at the time. \n“But there were times when my mother would move to a different place to get away from my father and she’d say, ‘Right, your name is Tony now. If you see your dad, just run away’. \n“And I’d say, ‘Oh, can I go and play football now?’ I’m trying to analyse all this and sometimes there’s nothing there. \n“Sometimes I’d think, actually, that was quite a brave thing for a kid to do. But at the time I wasn’t doing what was brave.” \nHe decided he really wanted to write not only about himself but about what was going on around him. \n“When I went to London the big political thing was the National Front. They were everywhere. They’d come to our clubs and fight us. \n“They still exist but I suppose a lot of people who would have gravitated towards them or the BNP (British National Party) have gone to Ukip or the EDL (English Defence League). \n“I even had a teacher who was a member of the National Front – in multi-cultural Birmingham!” \nThe violence of the 1970s and 1980s – the skinheads and the football hooligans and the National Front – is recalled with much disbelieving laughter. \nAs an Aston Villa fan, Benjamin Zephaniah got caught up in the aggro which came with the territory before football was flush with money. \nHe remembers the racist songs sung even by fellow supporters and the moment of epiphany when he found himself in a group setting off to do battle with some Manchester United fans. \nIt suddenly dawned on him that they were only doing what he was doing, supporting their team. \n“I never went to football for years after that although I’ve started going again in the last 10 years and I really enjoy it now.” \nZephaniah remembers someone telling him: “There’s white people don’t like racism, bro.” And he roars with laughter when he remembers his flabbergasted reply: “Are there?” \nNow, although he travels widely and spends a lot of time in China, Benjamin Zephaniah lives in a village near Spalding in Lincolnshire. \nIt’s not a place you’d imagine that a Rastafarian vegan poet (in Talking Turkeys he urged: “Be nice to yu turkeys dis christmas/ Cos’ turkeys just wanna hav fun...”) would blend in and he doesn’t deny it. \n“I was in London and I just wanted some fresh air,” he explains. \n“I didn’t know this area. I didn’t know anybody. People said, ‘How can you go there? There are no black people. They’ll kill you.’ \n“They do call it Brexit Central although there are lots of East Europeans working in the fields. \n“Farms couldn’t survive without them but people still want them to go.” \nHe recalls a chilling conversation outside his house when he first moved in. At first he thought the talk of people “taking our jobs” was the worst kind of racism but it dawned on him they were muttering about incomers from Norfolk. \n“I have to say, I really like it here,” he says. \nThere’s sympathy in his voice when he tells of a neighbour in his late 50s who pulled out of a planned first trip to London. \n“He burst into tears and said, ‘I can’t do it, Benjamin’. \n“If you were in a fight you’d want this guy on your side but he literally broke down. \n“One of the things I’ve always struggled with is just being around artists and this is an interesting place. \n“I like to understand what people think. I don’t want to preach to the converted.” \nConverts and otherwise seem set for a good time in Benjamin Zephaniah’s company at the Sage on June 9. Tickets for The Life And Rhymes Of Benjamin Zephaniah: http://www.sagegateshead.com/event/benjamin-zephaniah/ or tel. 0191 4434661. Like us on Facebook", "external_links": [], "published": "2018-01-26T20:00:00.000+02:00", "crawled": "2018-01-26T20:21:58.017+02:00", "highlightTitle": ""}