{"organizations": [], "uuid": "95c18a36fc2b98ccd0128d5a7200e2c06109785c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article11113402.ece/ALTERNATES/s1200/JS84735793.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/north-east-mep-jonathan-arnott-14178944", "country": "GB", "domain_rank": 21960, "title": "North East MEP Jonathan Arnott quits UKIP and says party leader Henry Bolton isn't up to the job", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T18:52:00.000+02:00", "replies_count": 0, "uuid": "95c18a36fc2b98ccd0128d5a7200e2c06109785c"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/north-east-mep-jonathan-arnott-14178944", "ord_in_thread": 0, "title": "North East MEP Jonathan Arnott quits UKIP and says party leader Henry Bolton isn't up to the job", "locations": [], "entities": {"persons": [{"name": "henry bolton", "sentiment": "negative"}, {"name": "jonathan arnott", "sentiment": "negative"}, {"name": "jon", "sentiment": "negative"}, {"name": "athan arnott", "sentiment": "none"}, {"name": "paul nuttall", "sentiment": "none"}, {"name": "arnott", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}], "organizations": [{"name": "ukip", "sentiment": "negative"}, {"name": "european parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "North East MEP Jonathan Arnott quits UKIP and says party leader Henry Bolton isn't up to the job Jonathan Arnott complains of 'leaks, briefings and character assassinations' in UKIP as he leaves the party Share Get daily   \nUKIP has been dealt another blow after North East MEP Jonathan Arnott announced he was quitting the party. \nMr Arnott issued a statement saying it had become “abundantly clear” that party leader Henry Bolton “is not the right person for the job”. \nAnd he suggested the party had developed an “unpleasant nature”, saying: “The countless leaks, briefings and character assassinations – became almost as bad as the political establishment I had hoped to counter.” \nMr Arnott, an MEP since 2014 and the party’s former General Secretary, also said UKIP had “significantly shifted its position on cultural and religious issues” in a way he could not support. \nThis appeared to be a reference to policies such as banning the burka, introduced under previous party leader Paul Nuttall. \nHe will continue to sit in the European Parliament representing North East constituents as an independent, he said. \nIt came as Mr Bolton continued his battle to remain party leader. Mr Bolton was forced to end his relationship with 25-year-old model Jo Marney following reports Ms Marney sent racist text messages attacking Prince Harry’s fiancee Meghan Markle. Jonathan Arnott UKIP North East MEP at the conference held at Borough Hall in Hartlepool \nMr Bolton has rejected calls to resign, and is expected to face a vote of no confidence at an emergency meeting of UKIP’s National Executive Committee in London on Sunday. \nBut Mr Arnott also highlighted a series of other controversies that have hit the party, including a 2016 incident between UKIP MEP Mike Hookem and former UKIP MEP Steven Woolfe, which left Mr Woolfe in hospital; a campaign by anti-Muslim campaigner Anne-Marie Waters to become UKIP leader, and claims by former UKIP activist John Rees-Evans that a “homosexual donkey” had tried to rape his horse. \nIn a statement published on his website, Mr Arnott said: “I tried my best to avoid the nastiness that pervades modern politics. I believed my party to be different, or at least to be capable of becoming something different. \n“I, like so many others, believed it to have potential and I continued to believe in that potential long after the evidence no longer supported it – out of loyalty to the many honest, hard-working members who still believed in it. \n“Yet the unpleasant nature – the Steven Woolfe fracas, the Diane James fiasco, the Anne-Marie Waters debacle, the John-Rees Evans bizarreness, the countless leaks, briefings and character assassinations – became almost as bad as the political establishment I had hoped to counter.” \nAnd in comments aimed at Mr Bolton, he said: “With yet another new Leader came new forlorn hope. Over the last week it has become abundantly clear that the current leader is not the right person for the job, but likewise that those jockeying for position and hoping to take his job would be no better. \n“Politics has always been like that, but as true believers in a cause, we always thought ourselves to be different. Once, maybe, but no longer.” Read More Childcare vouchers are being replaced - here's what it means for you \nMr Arnott vowed to continue representing his constituents while he continues as an MEP. The next elections to the European Parliament are due in June 2019, and if Brexit goes ahead as expected then the UK will not be taking part. \nHe said: “As an independent, I’ll continue to represent my constituents to the very best of my ability. \n“Hopefully, unencumbered by the sewer of party politics, I’ll have more time to devote to what should always be the most important part of anyone’s job in politics: representing and serving people.” Like us on Facebook", "external_links": [], "published": "2018-01-19T18:52:00.000+02:00", "crawled": "2018-01-19T19:05:47.032+02:00", "highlightTitle": ""}