{"organizations": [], "uuid": "a89fb0c465053bcd5019330b554a5f141b2a461d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14121417.ece/ALTERNATES/s1200/parties.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/you-natural-tory-labour-liberal-14121771", "country": "GB", "domain_rank": 21960, "title": "Are you a natural Tory, Labour or Liberal Democrat supporter? Find out here", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-07T10:00:00.000+02:00", "replies_count": 0, "uuid": "a89fb0c465053bcd5019330b554a5f141b2a461d"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/you-natural-tory-labour-liberal-14121771", "ord_in_thread": 0, "title": "Are you a natural Tory, Labour or Liberal Democrat supporter? Find out here", "locations": [], "entities": {"persons": [{"name": "jeremy corbyn", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "national party", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Are you a natural Tory, Labour or Liberal Democrat supporter? Find out here Research carried out on grassroots members of political parties reveals what is most important to them Share Theresa May, Jeremy Corbyn and Vince Cable Share Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nAre you a natural Labour, Conservative or Liberal Democrat supporter? \nA survey of grassroots members of the largest political parties in the UK, including the Scottish National Party, gives an insight into the issues which matter most to them and their attitude to the political questions of the day. \nIt reveals a huge disparity in the views of Tory members to those of all their political rivals. \nTheir responses to questions on Brexit, austerity, the death penalty, ‘gay marriage’, censorship and even the redistribution of wealth revealed them to be socially illiberal, authoritarian and displaying a preference for business above ‘ordinary people’. \nYet in response to the same series of economic, social and moral questions, Labour, Liberal Democrat and SNP supporters were broadly in agreement. Prime Minister Theresa May (Image: PA) \nThe research was carried out by academics at Queen Mary University of London. \nAmong a number of eye catching findings was that there was more backing for the death penalty among Tory members with 54% in agreement than gay marriage at 41%, this five years after David Cameron pushed through the gay marriage law. \nMeanwhile, Labour (85%), Lib Dem (84%) and SNP (81%) supported or strongly supported gay marriage. \nFor the death penalty, 9% of Labour members and 8% of Lib Dem members support or strongly support it. The SNP figure is 23%. \nProfessor Tim Bale, who was part of the research team, said: “Britain’s party members are the lifeblood and the footsoldiers of our democracy. But that doesn’t necessarily mean they look like or think like their parties’ voters – or, indeed, look or think like each other. \n“The Tory grassroots in particular are something of a breed apart from their Labour, Lib Dem and SNP counterparts.” \nAre you a ‘breed apart’ Tory or think you have more in common with the other parties? Here’s where you find out. \nWe publish the questions asked and the percentage represents the number of members who agreed or strongly agreed. EU and Union flags (Image: PA) BREXIT \nThere should be a second referendum on the Brexit deal \nConservative: 14%", "external_links": [], "published": "2018-01-07T10:00:00.000+02:00", "crawled": "2018-01-07T13:10:06.051+02:00", "highlightTitle": ""}