{"organizations": [], "uuid": "ba201279ed201e7daeec17136ce18f2e6cb5107d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14188898.ece/ALTERNATES/s1200/Low-Fare-Airlines-Offer-Flights-For-Less-Than-A-Dollar.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/passport-warning-holidaymakers-need-know-14188716", "country": "GB", "domain_rank": 21960, "title": "The passport warning all holidaymakers need to know about if they are preparing to travel", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T07:00:00.000+02:00", "replies_count": 0, "uuid": "ba201279ed201e7daeec17136ce18f2e6cb5107d"}, "author": "Simon Meechan", "url": "https://www.chroniclelive.co.uk/news/north-east-news/passport-warning-holidaymakers-need-know-14188716", "ord_in_thread": 0, "title": "The passport warning all holidaymakers need to know about if they are preparing to travel", "locations": [], "entities": {"persons": [{"name": "martin", "sentiment": "none"}, {"name": "martin lewis", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}], "organizations": [{"name": "itv", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News The passport warning all holidaymakers need to know about if they are preparing to travel Moneysavingexpert.com's Martin Lewis told This Morning about families who have had to cancel holidays as they forgot to check Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nDo you make sure there are at least six months left until your passport expires before you travel abroad? \nYou should do, according to Moneysavingexpert.com’s Martin Lewis. The thrifty advisor told ITV’s This Morning that not checking their passport’s expiration date is a pitfall some travellers make. \nHe mentioned one case of a family who had to ditch their holiday as they discovered their child’s passport only had two months remaining on it. \nMartin told ITV: “Check the expiry date and if it’s less than six months you need to go about renewing it.” \nHowever, there are many countries you can travel to if yours is expiring in under half a year. Martin Lewis the founder of Money Saving Expert.com website (Image: Sunday Mirror) Do I always need six months on my passport if I want to go abroad? \nNo, British passport holders don’t always need more than six months left on their valid date. There are different rules for various countries and you should be fine to travel within the European Union on a British passport which is set to expire in under six months. \nBUT if you are heading away from Europe, you should definitely consider renewing your passport if it is set to expire soon. Read More From the Passport Scam to the Rubber Ducky Scam: The frauds of 2018 you need to know about Travelling outside the EU \nMany countries demand tourists to have at least six months remaining on their passport - even if their holiday ends before their passport becomes invalid. If you attempt to travel outside the EU on a British passport which expires in less than half a year, you run the risk of being turned away at the immigration desk and sent home. \nIf you are unsure, you can check the entry requirements for your destination on the Foreign and Commonwealth Office’s website. \nHead here https://www.gov.uk/foreign-travel-advice and click on your destination. The Entry Requirements section will tell you how long a British passport should be valid for before you travel. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now Holidays in the EU \nBut if your holiday is within the European Union, you should be fine, as long as your passport is valid for the length of your trip (so you can get home). Britons still have freedom of movement and a right to live in other EU countries , and will do so until Britain leaves the EU. \nIf you are travelling in Europe, make sure your European Health Insurance Card is up to date. Read More Blue passports set to return for UK travellers after Brexit as burgundy bites the dust \nEuropean Health Insurance Cards give Brits the right to some state-provided health care when on holiday in the European Economic Area - which includes all EU countries, Norway, Liechtenstein and Iceland - as well as Switzerland. It covers essential medical care, treatment of pre-existing conditions and routine maternity care. \nApply or renew here www.ehic.org.uk Like us on Facebook", "external_links": [], "published": "2018-01-23T07:00:00.000+02:00", "crawled": "2018-01-23T07:57:56.010+02:00", "highlightTitle": ""}