{"organizations": [], "uuid": "0ca9129db13703515e8401509ce3d71af5d90126", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14145384.ece/ALTERNATES/s1200/Untitled-design-1.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/passport-scam-rubber-ducky-scam-14144990", "country": "GB", "domain_rank": 21960, "title": "From the Passport Scam to the Rubber Ducky Scam: The frauds of 2018 you need to know about", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-13T10:00:00.000+02:00", "replies_count": 0, "uuid": "0ca9129db13703515e8401509ce3d71af5d90126"}, "author": "Ian Robson", "url": "http://www.chroniclelive.co.uk/news/north-east-news/passport-scam-rubber-ducky-scam-14144990", "ord_in_thread": 0, "title": "From the Passport Scam to the Rubber Ducky Scam: The frauds of 2018 you need to know about", "locations": [], "entities": {"persons": [{"name": "kis", "sentiment": "none"}, {"name": "kis finance", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "getty images", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nFraudsters are always looking for new ways to scam the public. \nAnd experts are predicting they will find more sneaky methods to take money from unsuspecting victims in 2018. \nKis Finance says the key scams of the year will feed on insecurities surrounding Brexit or the chance of making a profit on cryto-currency deals. \nAnd they say the Rubber Ducky Scam will also be one to be aware of. \nHere are what they believe will be the most risky frauds of the year. Rubber Ducky Scam USB memory stick (Image: Getty Images) \n“If you haven’t heard of rubber ducky scams, now might be a good time to learn about them,” says Kis. \n“This type of scam is when a fraudster loads up a USB stick with malicious malware to infect the device it is plugged in to. \n“This malware is designed to embed itself into the device, unknowingly to the user, and it tracks their movements on the device. \n“This is then able to capture sensitive information, such as online banking log-in details and passwords for other online accounts. \n“We believe that next year we may see an increase of rubber ducky scams using crypto-currencies as leverage.” \nThey say fraudsters could leave a sabotaged stick in a public in the hope a finder will plug it into their computer. Read More The Passport Scam \nBrexit can be confusing - and fraudsters are ready to exploit our uncertainty. \nFor one example, fraudsters may claim that people need to update/renew their passport ready for when we leave the EU. \nThey would normally do this in a phishing email and make it appear like it has come from a legitimate source, such as Gov.uk, by using this as the sender’s display name. \nIt is likely that the email will lead the reader to a link to a fake Government website which has been created by the fraudster and designed to capture the details that are entered. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now Boiler Room Scam \nInvestment scams, also known as boiler room scams, are already very common, but Kis predict that we may see a surge of new scams as we move further into the Brexit process. An investment scam occurs when the fraudster gets into contact with their victim, usually by cold calling, to tell them of new investments opportunities available to them. \nBut they are completely worthless or don’t exist at all. \nThey gradually turn the heat up like in a boiler room. \nKis say: “Once the fraudster has encouraged you to invest as much money as they can, they disappear with their money and become completely untraceable, just when the victim is expecting their money to be returned. \n“We are predicting that fraudsters will begin to use Brexit as leverage over the victim, explaining that they have information on what will happen to prices of particular products in the UK once we leave the EU.” Cryto-Currency Scam A visual representation of the digital Cryptocurrency, Bitcoin (Image: Getty Images Europe) \nA huge topic over the past year has been crypto-currencies, such as Bitcoin, Ethereum and Ripple. \nBeing online based currencies, it is likely that fraudsters will see this as a huge opportunity to use it as the topic for their online scams using random phising emails \n“Phishing emails are designed by fraudsters to look like they have come from a legitimate company, but actually contain links which are designed to either infect your device with malicious malware or steal your personal and/or banking information,” says Kis. \n“It is likely that next year we will see an increasing number of phishing emails with crypto-currencies as the topic. \n“These will either be designed to steal their victims’ real crypto-currencies, or to make their victim invest in fake ones.” Read More The Ransomware Scam \nLast year saw two nationwide ransomware attacks. \n‘WannaCry’ was the one to target computers running the Microsoft Windows operating system, including those used in the NHS. \nAnd ‘Bad Rabbit’ put random computer systems under ransom, demanding Bitcoin as payment for their system to be released. \nKis say: “With two nationwide attacks successfully claiming thousands of victims last year, not to mention the thousands of other attacks that probably weren’t reported, it is likely that we will see another surge of ransomware over the course of 2018. \n“Cyber-criminals are continuously developing new ways and new systems to pull off these attacks, which are almost impossible to get ahead of.” \n• For more information about fraud prevention, visit www.kisbridgingloans.co.uk/guide-to-fraud-prevention/ Like us on Facebook", "external_links": [], "published": "2018-01-13T10:00:00.000+02:00", "crawled": "2018-01-13T12:04:46.012+02:00", "highlightTitle": ""}