{"organizations": [], "uuid": "d6e6abe7322b0e1044408f6c9c1dde300730a293", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article1099474.ece/ALTERNATES/s1200/489207.jpg", "site_section": "http://www.leicestermercury.co.uk/rss.xml", "section_title": "leicestermercury - frontpage", "url": "http://www.leicestermercury.co.uk/news/business/big-interview-meet-man-who-1099437", "country": "GB", "domain_rank": 48128, "title": "Big Interview: Meet the man who helped turn Wilko stores into the success story it is today", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T07:00:00.000+02:00", "replies_count": 0, "uuid": "d6e6abe7322b0e1044408f6c9c1dde300730a293"}, "author": "leicestermercury", "url": "http://www.leicestermercury.co.uk/news/business/big-interview-meet-man-who-1099437", "ord_in_thread": 0, "title": "Big Interview: Meet the man who helped turn Wilko stores into the success story it is today", "locations": [], "entities": {"persons": [{"name": "wilkinson", "sentiment": "neutral"}, {"name": "justine halifax", "sentiment": "neutral"}, {"name": "gordon", "sentiment": "none"}, {"name": "tony", "sentiment": "none"}, {"name": "wilko", "sentiment": "none"}, {"name": "james kemsey) wilkinson", "sentiment": "none"}, {"name": "gordon brown", "sentiment": "none"}], "locations": [{"name": "syston", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "oakham", "sentiment": "none"}, {"name": "charnwood street", "sentiment": "none"}], "organizations": [{"name": "wilko", "sentiment": "neutral"}, {"name": "multiyork furniture", "sentiment": "none"}, {"name": "jk", "sentiment": "none"}, {"name": "wilkinson cash store", "sentiment": "none"}, {"name": "rutland co", "sentiment": "none"}, {"name": "99p stores", "sentiment": "none"}, {"name": "retail industry leaders’ association", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Wilkinson's shop in Syston in the 1950s Share Get Business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email Justine Halifax meets the man who helped improve the fortunes of Wilko (which, incidentally, began life in Leicester)... \nGordon Brown has been hailed as helping to develop the fortunes of family business Wilko, by working with those at the top of the company to implement an inspired formula back in the early 1990s. \nThe father-of-one, who lives near Oakham , then remained at Wilko's helm for 16 years as managing director and even worked alongside its founder JK (James Kemsey) Wilkinson, who opened his first Wilkinson Cash Store in 1930 at 151 Charnwood Street, Leicester. \nOther business and industry accolades included roles as chairman of 99p Stores, Multiyork Furniture and BRC Trading, and as a former board member of the Retail Industry Leaders’ Association. Gordon Brown But how did a man with a 20-year background in engineering become the MD of Wilko back in 1991? \nIt came in the form of a direct invite from JK’s son Tony, but Gordon, who is portfolio holder for sport and recreation, culture and environment at Rutland County Council, admits he initially laughed off the suggestion. \nHe said: “Tony and I had worked together previously and when his MD was retiring he asked me if I’d be interested in going on the shortlist. \n“Well, I laughed! I thought the leap from an engineer to retailer was a questionable one.” \nBut after talking it over with his wife Irene, he did join the firm, only retiring in 2007, in his late 50s, to hand over the helm to a younger replacement for a role he described as a “24 hour a day job”. \nRegaling the inside story of how he helped to develop Wilko , he revealed that after spending nine months looking closely at the firm he identified “a really good company” that just wasn’t making money. \n“That wasn’t because it didn’t have the right focus on customers though, rather that its logistics, IT system and costings weren’t great,” said Gordon, who has been a director of a strategic business consultancy GRSB, which specialises in helping family businesses, since 2007. The Wilkinson store, in Charles Street, Leicester \n“In a business based on selling value items, finance and controlling costs was absolutely paramount. \n“Coming from engineering in the 70s/80s and having gone through some very difficult times, I knew how to spend money effectively and just how important it was to get the logistics right.” So how did he rebuild Wilko? \nAfter spending three years looking at best practice across European and UK firms, the light bulb moment came that would mark the launch of the firm’s impressive development. \nAnd that was to create a distribution centre at Worksop, Nottinghamshire. \nGrandfather-of-two Gordon said: “The distribution centre represented a huge risk for the family at the time. \n“The 650,000 sq ft premises cost £35 million, but at the time the business was only worth £20 million. \n“It was a big gamble, but it paid off when it opened in December 1994. It was definitely the turning point. \n“It gave us the opportunity to deliver where we couldn’t have before and in 1999 we built a second distribution centre in South Wales at over one million sq ft. \n“I’m very proud of Wilko’s success, particularly the growth we were able to achieve. \n“The Worksop distribution centre is my legacy to the business, and it’s a great business.” Yet it could all so easily have been a success story for Leicester. \n“In the early 70s, JK wanted to build a new warehouse to expand, but Leicestershire County Council didn’t grant planning permission,” revealed Gordon, 67. \n“That’s why the family upped sticks and moved north and also based its headquarters at Worksop.” The Beaumont Leys store \nHowever, it wasn’t just the distribution centres that helped improve the company’s fortunes. \nMr Brown also helped pioneer a much needed IT system upgrade, which included creating a stock prediction programme for 52 weeks of the year that saw it significantly outstrip competitors on weekly sales. \nAnd it cashed in on the trend of supermarkets moving from prime centre sites to out-of-town retail parks by snapping up the empty units – further boosting its profile in the 90s and 2000s. \nBut it would be the deployment of a rather clever sales tactic that built up the customer philosophy that has led to its continuing success. \nAt the crux was the motto: “To be the first stop destination for customers on the high street.” \nGordon explained: “We had a wide range of hand tools in stock, for example, and despite the fact some didn’t sell well, we kept them on our shelves so customers would be confident to come to Wilko first to see if we had what they were looking for before going elsewhere. \n“At the same time we watched Woolworths [which collapsed in 2008] do the exact opposite, reducing their range until in the end there were just hammers and screwdrivers left.” JK Wilkinson's first store, in Charnwood Street, Leicester, seen here in 1958 \nIt was in the early days as Wilko’s MD that Gordon spent time with its founder, JK Wilkinson, who died aged 91 in 1997. \nHe recalled: “JK was in his 80s when I joined but was a lovely gentleman. He had an incredible eye for detail and exceptional product knowledge. \n“During one store visit with him, I remember he spotted a tiny flaw in the design of a teapot – something very small, but nonetheless important to how the product worked. \n“That was the extent to which he understood the product range. \n“It was in those very early days he asked me to make sure that when the time came for his staff to leave to look after them, saying they had made great sacrifices to help build up the business. And we did.” With Brexit on the horizon, areclaimed firms like Wilko feeling the heat? \nLast July, it was reported that Wilko’s profits had plummeted – after a drop in the value of sterling in the wake of the EU referendum result led to an increase in the cost of goods. \nFor the year up to January 28, 2017, its pre-tax profits were £5.1 million, down from £25.9 million the previous year, while turnover rose from £1.4 billion to £1.5 billon. And in October, the firm made over 1,000 employees redundant. \nGordon was also the chairman from 2007 to 2010 of Multiyork Furniture, which went into administration in November after failing to meet financial liabilities on the back of trading losses. \nUnderstandably saddened by its failing, he gave an interesting insight into where he thought it might have gone wrong – a lack of enticing products and an outdated brand. \nGordon said: “I was extremely disappointed by this because in 2007 we had the financial crash and what people wanted then was very different. \n“But despite pressure from banks at the time and the six-to-eight week delay in receiving money for items put on credit cards, we kept Multiyork solvent. Read More Sytner doubles size of its used car supermarket division with acquisition of The Car People \n“We worked very hard and within two years came out of it. It was a great business that was growing again. \n“I had a good feeling about its future when I left but, unfortunately, that hasn’t been borne out.” Read More \nGordon added: “When I was there we used the best fabrics from some great designers and displayed them in store to attract customers’ attention. \n“Even though these fabrics wouldn’t necessarily be bought by the customer, they would entice them in. \n“But they went back to displaying those products that people eventually ended up buying, like the beige sofas, that weren’t eye-catching. I also think the brand looked outdated. \n“We talked about updating it so it was more online orientated, and calling it mysofa – the ‘my’ representing multiyork – so it would retain its identity but be more searchable. \n“However, it wasn’t an idea that was moved forward by my successor.” \nAs the debate over what impact Brexit will have on business still rages, and with such a wealth of experience in the industry, what’s Gordon’s take on it? \n“Brexit is an interesting challenge for many businesses,” he said. \n“But, if you go back to the 70s we had some horrendous times – rises in inflation and interest rates, exchange rate movement and the oil crisis. \n“Some companies struggled and some were successful. Brexit can’t be any worse than that. I think businesses are resilient and they’ll deal with it. My advice would be have a clear focus of what you want to achieve and don’t get diverted, control costs and finances, look after your people and you will have a great business.” Oakham town centre (Image: Lionel Heap) As a Rutland councillor, Gordon is now using his business knowledge to make a difference \nIt was last summer that he won his Ketton seat by a huge margin after moving from Nottinghamshire to Barrowden, with wife of 44 years Irene, to be near son James and their two grandchildren. \nDeveloping the 300-hectare St George’s Barracks’ site, which the MoD will vacate in 2020/21, is just one upcoming project he’s passionate about. \nAs he also shares the same name as the former Labour Prime Minister, it will come as no surprise to hear that he’s often faced with the odd quip on introducing himself – although it’s one that he usually pre-empts. \nBut it did once lead him to come face to face with the man himself when he was still the Chancellor of the Exchequer – and at 11 Downing Street no less! \nIt was while attending a reception that one of the Chancellor’s team heard they shared the same name and ushered the two together. \nThe Tory councillor recalls having an awkward conversation about other namesakes, but otherwise that was the end of that encounter! \nAs well as citing a supportive wife as a key factor in his successful career, the Presbyterian Scot said: “Honesty and openness are very important to me. \n“People can negotiate of course, but when they downright lie I get very upset by that. They might not always like it but I tell the truth.” Like us on Facebook ", "external_links": [], "published": "2018-01-23T07:00:00.000+02:00", "crawled": "2018-01-23T08:53:23.000+02:00", "highlightTitle": ""}