{"organizations": [], "uuid": "61067319e37f2e364eb03bc16b7250839d320896", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14145558.ece/ALTERNATES/s1200/Matthew-Lumsden-CEO-of-Connected-Energy.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/newcastle-renewable-energy-company-secures-14145271", "country": "GB", "domain_rank": 21960, "title": "Newcastle renewable energy company secures £3m investment to grow across Europe", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T14:59:00.000+02:00", "replies_count": 0, "uuid": "61067319e37f2e364eb03bc16b7250839d320896"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/newcastle-renewable-energy-company-secures-14145271", "ord_in_thread": 0, "title": "Newcastle renewable energy company secures £3m investment to grow across Europe", "locations": [], "entities": {"persons": [{"name": "matthew lumsden", "sentiment": "none"}, {"name": "engie", "sentiment": "none"}], "locations": [{"name": "europe newcastle", "sentiment": "none"}, {"name": "europe connected energy con", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "macquarie", "sentiment": "none"}, {"name": "renault", "sentiment": "none"}, {"name": "macquarie group", "sentiment": "none"}, {"name": "engie", "sentiment": "none"}, {"name": "connected energy", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Newcastle renewable energy company secures £3m investment to grow across Europe Connected Energy converts battery packs from Renault electric vehicles into clean energy storage systems Share Matthew Lumsden, CEO of Connected Energy (Image: Unknown) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nA Newcastle renewable energy company has secured £3m of investment to finance its growth plans across the UK and Europe. \nConnected Energy specialises in converting car batteries into energy storage systems. The company is the only one in the world that recycles used car battery packs in this way. \nThe £3m backing was received from financial services firm Macquarie Group and energy company Engie, and will be used by Connected Energy expand its business across the UK and Europe. \nMatthew Lumsden, CEO of Connected Energy said: “We are delighted that Macquarie and Engie have provided this significant financial and management value for our phase of aggressive market growth. \n“We have a tremendous pipeline of demand for battery-based storage systems. Our E-STOR system is proven, with very positive feedback from customers appreciating its full service offering as well as our low costs and exceptional sustainability credentials. \n“In this uncertain energy landscape we look forward to capitalising on the burgeoning need for grid balancing schemes through energy storage, as well as adding to the sustainability of electric vehicles.” Read More More than 100 agency staff to go at Siemens Hebburn on top of direct employees \nThe E-Stor system uses recycled Renault electric vehicle batteries to allow businesses to store excess energy, which can then be used at a later time. This energy can then be used at times of peak electricity demand or when tariffs are high, saving businesses money. \nThe use of battery storage companies are becoming increasingly popular as the UK seeks to lower the pressure on the National Gid during peak times. \nConnected Energy is based at Science Central in Newcastle, but also operates a technical centre near Norwich. The company has said it intends to expand by providing its services to a number of blue-chip clients. Read More Brexit immigration rules could cost Newcastle's economy over £300m \nMatthew Booth, senior managing director at Macquarie’s commodities and global markets group, said: “The provision of energy storage to support grid stability and create a charging network for electric vehicles will be a major theme in power infrastructure over the coming years. \n“We are pleased to have invested in this innovative company which has developed an environmentally friendly and low cost solution to help meet this need.” \nHendrick Van Asbroeck, managing director of Engie New Ventures, added: “Engie is developing innovative and effective energy solutions to overcome the challenges of the transition to clean energy. This investment is an exciting opportunity to develop together with Connected Energy leading and environmentally friendly energy storage solutions for our customers.” Like us on Facebook", "external_links": [], "published": "2018-01-12T14:59:00.000+02:00", "crawled": "2018-01-12T15:08:12.012+02:00", "highlightTitle": ""}