{"organizations": [], "uuid": "f7b239fcc3089a77deda3813e118fdb4788f220c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13387885.ece/ALTERNATES/s1200/CFR_NJL_260717forrester_01.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/gateshead-retail-giant-vertu-motors-14201667", "country": "GB", "domain_rank": 21960, "title": "Gateshead retail giant Vertu Motors warns of hit to profits as sales of new cars drop", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T15:05:00.000+02:00", "replies_count": 0, "uuid": "f7b239fcc3089a77deda3813e118fdb4788f220c"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/gateshead-retail-giant-vertu-motors-14201667", "ord_in_thread": 0, "title": "Gateshead retail giant Vertu Motors warns of hit to profits as sales of new cars drop", "locations": [], "entities": {"persons": [{"name": "robert forrester", "sentiment": "none"}, {"name": "vertu", "sentiment": "none"}], "locations": [{"name": "gateshead", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "vertu motors", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Gateshead retail giant Vertu Motors warns of hit to profits as sales of new cars drop The firm's share price fell 7% in early trading after saying its earnings would be 'moderately below' market expectations Share Robert Forrester, CEO of Vertu Motors (Image: vertu motors) Share Get business   Thank you for subscribing!   \nNorth East retailer Vertu Motors has warned of a hit to full-year profits after further steep falls in new car sales amid consumer belt-tightening and price hikes from the weak pound. \nThe Gateshead based group, which has 121 outlets across the UK, issued a trading update in which it said like-for-like sales of new cars tumbled by 13.2% in the final four months of 2017, with a 3.2% drop for used cars. \nVertu revealed that profits for the year to February 28 will be “moderately lower” than expected after the ongoing sales pressure and said it was also “cautious” on the outlook for the next financial year. \nShares in the group have fallen 7.3% following the announcment. \nRobert Forrester, chief executive of Vertu Motors, said: “The group has experienced tougher trading conditions compared to recent years as sterling’s devaluation places pressure on new car pricing and supply. \n“This has coincided with a slightly softer general consumer environment in the run-up to Christmas which has been well-reported.” \nVertu, which has brands including Bristol Street Motors, Vertu, Farnell and Macklin Motors, said demand for new cars had been knocked amid the squeeze on consumer incomes, with higher prices from the Brexit-hit pound adding to the woes. \nA government clampdown on diesel had also impacted consumer confidence in the used car market, the firm said. \nWhile the used car market will remain more buoyant in the months ahead, there is set to be further pressure on new car sales and sales of new cars are set to be “significantly” lower in the first quarter of 2018. Read More Department for International Trade falling behind on Brexit, alarming new report says \nTrading woes will be compounded by a particularly impressive performance from a year earlier ahead of changes to car tax rates last April, it said. \n“The board is cautious on the outlook for the next financial year as new car profitability remains under pressure and cost increases continue,” Vertu said. \nBut its after-sales division remains the bright spot, with like-for-like gross profits up 2.2% in the four months to December 31. \nIt said 38.1% of group-wide gross profit was earned from after-sales in the period. Like us on Facebook", "external_links": [], "published": "2018-01-25T15:05:00.000+02:00", "crawled": "2018-01-25T16:38:52.006+02:00", "highlightTitle": ""}