{"organizations": [], "uuid": "3717e8ed201c40a388a06d31b00f324b7d83e8fc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/business/article1121883.ece/ALTERNATES/s1200/Torquaygatewaydigger.jpg", "site_section": "http://www.middevongazette.co.uk/localeducation.rss", "section_title": "devonlive - News", "url": "https://www.devonlive.com/news/business/how-750m-being-invested-more-1121770", "country": "GB", "title": "This is how £750m is being invested in more than 60 projects in Devon, Plymouth, Torbay and Somerset", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T12:21:00.000+02:00", "replies_count": 0, "uuid": "3717e8ed201c40a388a06d31b00f324b7d83e8fc"}, "author": "Hannah Finch", "url": "https://www.devonlive.com/news/business/how-750m-being-invested-more-1121770", "ord_in_thread": 0, "title": "This is how £750m is being invested in more than 60 projects in Devon, Plymouth, Torbay and Somerset", "locations": [], "entities": {"persons": [{"name": "somerset steve hindley", "sentiment": "none"}], "locations": [{"name": "plymouth", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "south devon link road", "sentiment": "none"}], "organizations": [{"name": "plymouth", "sentiment": "none"}, {"name": "somerset business sponsored this", "sentiment": "none"}, {"name": "lep", "sentiment": "none"}, {"name": "south west local enterprise partnership", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Sponsored This is how £750m is being invested in more than 60 projects in Devon, Plymouth, Torbay and Somerset Steve Hindley, CBE DL, Chairman of the Heart of the South West Local Enterprise Partnership delivers the final monthly snapshot of what the LEP has been doing to boost the local economy Share Work on the South Devon Link Road, the project has boosted the economy for Torbay Share Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nAs we look forward to gathering momentum in 2018, here’s a round-up of what we’ve achieved and what lies ahead for the LEP this year. \nWith an investment programme of circa £750 million, we’ve got over 60 projects in our portfolio, that have been selected by a careful process involving our local authority and business partners, and agreed by central government. \nWe’re using this investment to roll out a diverse range of infrastructure, skills and business support projects that will leverage growth across the whole of the HotSW area; which covers the local authority areas of Devon, Plymouth, Somerset and Torbay. Steve Hindley explains the progress so far this year \nThe returns on this investment is just beginning to emerge as more projects get completed and start to generate economic benefits. The whole programme is set to generate 27,000 jobs, 18,000 homes and 60,000 learning places and more projects come on stream this year. Of the 60+ projects; 16 are already complete, 16 are underway and the rest are in the pipeline; with many of them starting on site in the coming weeks. \nSee a full list of all of our projects on our website Major expansion is planned at Exeter Science Park \nSome of those already finished are the Science Parks at Exeter and Plymouth; numerous strategic road schemes which are opening up development land for business and housing; skills projects in partnership with colleges that are helping the local workforce take up higher value careers; and successful business support schemes available through the Growth Hub - which has already exceeded its targets to help local businesses - and the Hinkley Supply Chain, which assists local companies to take up commercial opportunities from Europe’s largest construction project. How the inside of the Oceansgate industrial units will look \nNext month will see the opening of one of the Hinkley Point Training projects at Yeovil College and Exeter College, which have had investment from the LEP along with Petroc, South Devon College, Bicton and the National College for Nuclear at Bridgwater. \nOur Marine Enterprise Zone at Plymouth, Oceansgate, will officially open in March and has already attracted a good deal of commercial interest, offering deep water access at one of the largest dockyards in Europe. The Enterprise Zones at Huntspill and east of Exeter are also proving popular destinations for business investing in the area and all offer reduced business rates and simplified planning regimes. \nTransport and the wider connectivity issue is never far from the top of our agenda though. It remains the biggest barrier that business tell us about, that affects their productivity and growth potential. Storms ravaged the Dawlish rail line in 2014 \nRoad, Rail and Broadband \nThe LEP is doing all we can to reverse the decades of under-investment in the south west’s road, rail and broadband infrastructure, but continued efforts are needed by all businesses and public sector leaders to ensure the message gets through and is acted on. \nFor this we need to be seen as a major competitor to the UK’s city regions and be taken seriously as a national and international contender for business. \nThe Heart of the South West economy alone is the size of Birmingham’s and acting together, we can begin to compete with partnerships such as the Northern Powerhouse and the Midlands Engine which have attracted billions of pounds of investment from Government and other investors. \nSo far, we’ve secured some successes in to lay down the foundations of a productive business location. \nAlong with our partners in the Peninsula Rail Task Force we’ve got commitment from the government for a feasibility study into improving the resilience of the main line at Dawlish. \nPartial dualling of the North Devon Link Road has been promised, along with sections of the A30/303/358 gateway to the south west from London and the south coast. \nThe Connecting Devon & Somerset broadband project is the largest of its kind in England. It’s on track for its target to provide at least 380,000 homes and businesses with access to better broadband by the end of 2019, in areas where the commercial sector will not deliver on its own. \nBut the world and the needs of businesses in our area do not stand still. We’ve many more ventures on the horizon as well as the physical infrastructure schemes. We’re looking forward to establishing a partnership with Innovate UK which will help businesses realise the potential of new technologies, develop ideas and make them a commercial success. The Hinkley Point training agency is designed to develop skills to work on the build project \nEnergy, Skills, Rural Productivity & Business Support \nWe’ve been selected by the Department for Education as a Career Learning Pilot area, with a share of a £10m fund to provide enhanced careers advice, guidance and training to under-employed adults. \nWe’re working with the LEPs in Cornwall and the Isles of Scilly and Dorset to develop the South West Energy Strategy, to enable clean growth and deliver affordable energy for residents as well as commercial premises. \nAnd we’ll be rolling out a delivery plan to boost the rural economy based on the findings of the nationally acclaimed Rural Productivity Commission Report. \nIt was highlighted in the Government’s Industrial Strategy, along with another exemplar of regional collaboration – the Nuclear South West partnership which aims to harness the £50bn worth of business opportunities in this sector. \nLooking to the future beyond 2018, we’ll build on the evolving role of LEPs at the helm of regional economic development, which will be enhanced this year following the announcement that the Prime Minister will hold twice-yearly meetings with LEP Chairs. \nOur Chief Executive Chris Garcia has announced his retirement this summer, so I take this opportunity to thank Chris for his immense contribution to the success of the LEP over the last five years. We look forward to attracting the highest calibre of candidates in the recruitment process which will start next week for a new chief executive, to bring their own creativity and leadership to the role. \nAs Brexit draws nearer, we see one of our most important tasks is to help businesses steer the unchartered territory in an uncertain economic environment. \nLeaving the EU will undoubtedly affect business, both in adverse and positive ways, so, along with our Local Authority partners, we’ve established a Brexit Resilience and Opportunities Group to gather intelligence on the risks and opportunities for local businesses. \nAnd our Growth Hub is there to help businesses face new challenges, offering a single point of contact for business support for any business in the area. \nHeart of the South West Productivity Strategy \nFinally, a big priority for the LEP this year is to help the local authority leaders in the area produce and deliver a Productivity Strategy for the Heart of the South West. It’s been out for consultation with businesses and other stakeholders and is now on track for launching in the Spring. The Productivity Strategy aims to double the economy to £70 billion by 2036 by developing the management capabilities in small and medium sized enterprises; as well as improving connectivity, infrastructure and skills. It will aim to connect places to opportunities whilst making places successful. \nLook out for the launch of this new strategy with stories about how it’s taking shape in the real world and making a difference to the economy. The growth hub is a major initiative to support businesses in Devon, Plymouth, Torbay and Somerset Heart of the South West Growth Hub \nThe Heart of the South West Growth Hub has been offering a free point of call for business support for all businesses in Devon, Plymouth, Somerset and Torbay for nearly two years, and has already exceeded its targets – having helped over 3,200 businesses - but wants more businesses to get in touch. \nWorking closely with a broad partnership of delivery organisations, the Growth Hub has introduced over 700 businesses to funded schemes that meet their needs and achieve their growth goals. \nThe Growth Hub also provides an intensive Growth Support Service, providing intensive support to established businesses committed to growth. Eligible businesses include those operating in the agricultural, agri-food, tourism, education and care sectors, among others. \nTo find out more you can contact the Growth Hub on, 03456 047 047 or search “Growth Support Service” on the website . It has recently been refreshed to provide users with an engaging knowledge hub and self-help tool for business support. \nHotSW LEP is a strong and dynamic partnership between the private sector, local authorities, universities and further education across the local authority areas of Devon, Plymouth, Somerset and Torbay. \nThe HotSW area has a population and economy the size of a major UK city: 1.7m people and an annual economy of £35 billion - larger than Birmingham - and 83,000 businesses. HotSW has 17 local authorities, 2 National Parks, 4 Universities and 9 FE colleges. \nOur aim is to support the generation of better growth, employment and prosperity by securing investment and influencing government policy. Like us on Facebook", "external_links": [], "published": "2018-01-26T12:21:00.000+02:00", "crawled": "2018-01-29T14:42:54.012+02:00", "highlightTitle": ""}