{"organizations": [], "uuid": "124307929c84c214b112fa31ba7ff5f996bb9625", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article336381.ece/ALTERNATES/s1200/FAb-project.jpg", "site_section": "http://www.devonlive.com/rss.xml", "section_title": "devonlive - frontpage", "url": "http://www.devonlive.com/news/devon-news/project-link-budleigh-salterton-france-1035657", "country": "US", "title": "Brexit will have no impact on project to link Budleigh Salterton to France", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T21:47:00.000+02:00", "replies_count": 0, "uuid": "124307929c84c214b112fa31ba7ff5f996bb9625"}, "author": "Daniel Clark", "url": "http://www.devonlive.com/news/devon-news/project-link-budleigh-salterton-france-1035657", "ord_in_thread": 0, "title": "Brexit will have no impact on project to link Budleigh Salterton to France", "locations": [], "entities": {"persons": [{"name": "budleigh salterton", "sentiment": "none"}, {"name": "chris jenner", "sentiment": "none"}], "locations": [{"name": "france", "sentiment": "none"}, {"name": "budleigh salterton", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "east devon", "sentiment": "none"}], "organizations": [{"name": "france news brexit", "sentiment": "none"}, {"name": "gw", "sentiment": "none"}, {"name": "organisation", "sentiment": "none"}, {"name": "marine management organisation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Brexit will have no impact on project to link Budleigh Salterton to France The Marine Management Organisation (MMO) has just approved a licence allowing the project to build and maintain the proposed subsea interconnector within UK waters Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe team behind a project to link the British and French electricity grids is pushing ahead in spite of Brexit. \nThe 170-mile subsea and underground 1.4GW interconnector is due to make landfall in the UK at Budleigh Salterton in East Devon. \nThe Marine Management Organisation (MMO) has just approved a licence allowing the project to build and maintain the proposed subsea interconnector within UK waters. Read More \nThe FAB Project interconnector aims to increase energy security, cut consumers’ bills, and enable greater use of greener, low-carbon electricity. A tidal turbine \nChris Jenner, the FAB Project development manager, said: “The FAB project team has worked closely with the MMO and their statutory advisors to ensure that the Marine Licence provides permission for the necessary construction and maintenance activities, together with appropriate safeguards to ensure that the FAB Project can proceed without any significant impacts on the marine environment. Read More National Lottery grant of £520,000 for completion of Axminster Heritage Centre \n“This decision is a reflection of the positive dialogue between the FAB Project and the various stakeholders who have an interest in the UK waters, particularly Lyme Bay and the Jurassic Coast World Heritage Site in East Devon.\" \nThe decision comes a few weeks after East Devon District Council gave planning permission for a section of the onshore cable route along the Otter Valley. An undersea cable will be laid between the French and English coasts Read More Disabled girl can't speak to her family after thieves steal communication device \nWhat is the Fab project and why is it so important? The Fab Project will link the national electricity grids of Britain and France with the aim of increasing energy security, cutting consumers' bills, and enabling greater use of greener, low-carbon electricity. The subsea interconnector cables will be laid between the Cotentin peninsula in Normandy and Budleigh Salterton in Devon, via Alderney in the Channel Islands to provide a route to market for low-carbon electricity from proposed tidal generators. From Budleigh Salterton, the 1,400 megawatt cables will be laid underground to the Long Lane converter station, where the High Voltage Direct Current which will be transmitted through the cables will be converted to High Voltage Alternating Current. Further underground cables will then link the converter station to an existing National Grid substation near Broadclyst. Like us on Facebook", "external_links": [], "published": "2018-01-09T21:47:00.000+02:00", "crawled": "2018-01-09T22:10:46.023+02:00", "highlightTitle": ""}