{"organizations": [], "uuid": "07f9a172c9415b2da7a10f326e5465eadeca49df", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article12437742.ece/ALTERNATES/s1200/Paul-Wilson-CEO-at-Nigel-Wright-Group.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/newcastle-recruitment-firm-nigel-wright-14118887", "country": "GB", "domain_rank": 21960, "title": "Newcastle recruitment firm Nigel Wright falls into the red after \"soft\" summer", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-07T10:00:00.000+02:00", "replies_count": 0, "uuid": "07f9a172c9415b2da7a10f326e5465eadeca49df"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/newcastle-recruitment-firm-nigel-wright-14118887", "ord_in_thread": 0, "title": "Newcastle recruitment firm Nigel Wright falls into the red after \"soft\" summer", "locations": [], "entities": {"persons": [{"name": "nigel wright", "sentiment": "negative"}, {"name": "paul wilson", "sentiment": "none"}], "locations": [], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "invalid email  recruitment", "sentiment": "none"}, {"name": "nigel wright group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Newcastle recruitment firm Nigel Wright falls into the red after \"soft\" summer Grey Street firm said it saw record results in the last four months of the year and has continued success since then Share Paul Wilson, CEO at Nigel Wright Group (Image: Nigel Wright Group) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nRecruitment group Nigel Wright fell into an operating loss after what it described as “very soft results” in a summer period. \nAccounts for the Newcastle recruitment consultancy for the year ending April 30, 2017, highlighted slow trading in the summer of 2016 and also said that adverse exchange rates after the Brexit referendum for its international operations contributed to an operating loss of £554,000 following a £216,000 profit a year earlier. \nThe firm also reported £425,000 of exceptional costs as turnover came in broadly flat at £16.4m, down from £16.6m 12 months earlier. Losses before taxation broadened to £2.4m. \nCEO Paul Wilson said the results were “somewhat of a bitter-sweet experience” and said performance in the last quarter of the accounting period and afterwards had seen the firm recover. \nHe said: “Although it was 18 months ago now, the summer period of 2016 really impacted the 12-month figures to April 2017 which, as a result, were below our expectations. \n“Despite that slow period, we knew it was just a blip and continued to invest in all our markets. Our strong performance and results throughout 2017 are a clear testament to this.” \nNigel Wright is based on Newcastle’s Grey Street with UK offices in London and Teesside. \nIt also has a network of 13 offices throughout Europe, with openings in Sweden and the Netherlands in the past 12 months. Sales grew in both Europe and the rest of the world, but fell by almost £1m in the UK. \nIn accounts for Nigel Wright Group Holdings, finance director Mark Ingleson said the last four months of the accounting period had produced record gross profit, with trading continuing in that vein in the next financial year. Read More New jobs on the way at 0800 Repair amid ambitious expansion plans for year ahead \nMr Wilson said: “I firmly believe that our unique approach, where we pride ourselves on being truly global and operating as one business without internal barriers, assists these results and reflects the skills, knowledge and expertise we have in our teams across all territories and disciplines. \n“We are well positioned for the future, our brand has an excellent, worldwide reputation and we are determined to build and develop our company and employees for the longer term.” \nHeadcount at the firm grew slightly to 128 during the accounting period. Like us on Facebook ", "external_links": [], "published": "2018-01-07T10:00:00.000+02:00", "crawled": "2018-01-07T13:10:00.024+02:00", "highlightTitle": ""}