{"organizations": [], "uuid": "cb5064f4bd51cc0f660ab24b008d392fff881a30", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article968292.ece/ALTERNATES/s1200/33999692.jpg", "site_section": "http://www.leicestermercury.co.uk/rss.xml", "section_title": "leicestermercury - frontpage", "url": "http://www.leicestermercury.co.uk/news/business/employers-want-greater-certainty-government-998432", "country": "GB", "domain_rank": 48128, "title": "Employers want greater certainty from Government in 2018 claims Chamber of Commerce", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T12:09:00.000+02:00", "replies_count": 0, "uuid": "cb5064f4bd51cc0f660ab24b008d392fff881a30"}, "author": "Tom Pegden", "url": "http://www.leicestermercury.co.uk/news/business/employers-want-greater-certainty-government-998432", "ord_in_thread": 0, "title": "Employers want greater certainty from Government in 2018 claims Chamber of Commerce", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "chamber of commerce employers", "sentiment": "negative"}, {"name": "chamber of commerce confidence", "sentiment": "negative"}, {"name": "east midlands chamber quarterly economic survey", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Employers want greater certainty from Government in 2018 claims Chamber of Commerce Confidence could be better, while 58 per cent of businesses still struggle to find the right candidates Share Get Business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nEmployers will be hoping for greater certainty and support from the Government in 2018 - despite strong performances by exporters cashing in on the pound’s lower value in early 2017. \nThey were some of the messages highlighted in the East Midlands Chamber Quarterly Economic Survey for the final three months of last year. \nThe survey suggested 60 per cent of bosses were still taking on staff, though 58 per cent had struggled to find the right candidates. \nBusiness confidence in turnover had dipped marginally last year, though confidence in profitability had remained about the same. \nRising interest rates were one area of concern, along with competition and access to skills. \nInflationary pressures, particularly arising from the cost of importing raw materials, resulted in a cooling of business confidence in the final quarter, but overall, the regional chamber said, it remained strong. Businesspeople on the up include Savan, Junal and Keval Dattani at beard products supplier Mo Bro's (Image: Peter Fothergill) \nThe percentage of companies that reported confidence in turnover in the last quarter of 2017 was slightly down on the previous three months, but finished the year about 10 percentage points higher than the same period in 2016. \nConfidence in profitability showed an even stronger finish to the year, up almost 20 percentage points over 12 months earlier. \nUncertainty about the future meant business people expressing increased investment intentions throughout 2017 were fewer than in 2016 but, overall, ended the year about two percentage points higher than it started. \nThe Mercury recently reported how the boss of East Midlands Airport, for instance, remained confident of expansion over the coming years, despite the uncertainties of Brexit. \nThe Castle Donington airport still wants to double passenger numbers by 10 million a year within 20 years or less. \nIt also hopes to triple freight shipments to one million tonnes a year within 10-20 years. Read More \"Brexit won’t stop East Midlands Airport expansion\" \nIn the survey, over a third (36%) of respondents said they had recruited staff during the previous three months compared with just 10 per cent that said they’d reduced their workforce. \nIntentions to invest in equipment and training remained relatively weak in the fourth quarter compared with historic levels and the concerns about future price increases, which have been a feature of the past 12 months, remained. Read More Rise in Leicestershire exports to EU - despite Brexit \nChris Hobson, the chamber's director of policy, said: \"As we move into 2018, businesses will be looking for greater certainty and support to give them the confidence to invest and help grow productivity. \n\"The skills gap remains a key strategic issue for UK growth and one that Government policy needs to respond to in a meaningful way. \n\"Despite the uncertainty, however, the state of the economy index - compiled from the net results of the quarterly economic survey - ended the year at 360, the second highest it’s been since the second quarter of 2015. \n\"With Brexit talks now beginning to look at more positive things such as trading arrangements and the customs union, we hope that our negotiators will keep the needs of business to the fore so that we don’t lose momentum when it comes to confidence and investment plans.\" Like us on Facebook ", "external_links": [], "published": "2018-01-02T12:09:00.000+02:00", "crawled": "2018-01-02T13:14:04.065+02:00", "highlightTitle": ""}