{"organizations": [], "uuid": "490806fd62871fd3274fdda4eec86ce2a62e738c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article9407081.ece/ALTERNATES/s1200/JS61481418.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/former-newcastle-council-leader-john-14218138", "country": "GB", "domain_rank": 21960, "title": "Former Newcastle Council leader John Shipley explains why he wants another Brexit referendum", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T18:52:00.000+02:00", "replies_count": 0, "uuid": "490806fd62871fd3274fdda4eec86ce2a62e738c"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/former-newcastle-council-leader-john-14218138", "ord_in_thread": 0, "title": "Former Newcastle Council leader John Shipley explains why he wants another Brexit referendum", "locations": [], "entities": {"persons": [{"name": "john shipley", "sentiment": "negative"}, {"name": "john shipley  he", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "shipley", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "newcastle council", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "eu withdrawal bill   daily    former newcastle council", "sentiment": "none"}, {"name": "house of lords", "sentiment": "none"}, {"name": "customs union", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "eu withdrawal bill", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Former Newcastle Council leader John Shipley explains why he wants another Brexit referendum Lord Shipley spoke as the House of Lords prepared to debate the Government's EU Withdrawal Bill Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nFormer Newcastle Council leader Lord Shipley has called for a referendum on the planned Brexit deal, as the House of Lords prepared to debate Theresa May’s flagship Brexit legislation. \nPeers are to begin at least 20 days of debate about the Government’s EU Withdrawal Bill on Tuesday January 30, and Mrs May could suffer a series of defeats as there is no government majority in the House of Lords. \nThe legislation, also known as the Great Repeal Bill, brings EU regulations into UK law. \nJohn Shipley, a Liberal Democrat peer, said exporters would face huge obstacles if the UK crashed out of the EU without a trade deal which kept us in the EU and the Customs Union. Lord John Shipley \nHe said: “There should be a referendum on the terms of Brexit. \n“The people took the original decision to leave the European Union. \n“The people should have the power to make the final decision.” \nLord Shipley also said he was concerned about the chances of the Government agreeing a deal with the EU in time for Brexit to take place in March 2019. \nAs the deal needs to be approved by Parliament, this is likely to mean a vote is held at Westminster in October. \n“It is very clear to me that the Government cannot make the timetable it has set. \n“And therefore trouble is brewing, unless the Government manages to get a transition period which frankly has to be longer than two years.” \nThe EU Withdrawal Bill faces a rough ride in the House of Lords after senior peers warned it was “fundamentally flawed”. Chairman of the Justice Select Committee Sir Alan Beith (Image: Fiona Hanson/PA Wire) \nAlan Beith, the former MP for Berwick-upon-Tweed , was among those saying it was “constitutionally unacceptable” and should be reworked. \nHe’s a member if the Lords Constitutional Committee, which said the Bill gives government ministers too much power to change the regulations without full parliamentary scrutiny. \nAnd it warned there would be “significant constitutional repercussions” if the Scottish and Welsh administrations were not consulted on devolution issues. \nThe legislation has received its Third Reading in the Commons, meaning it has been approved by MPs, and is set to receive its Second Reading in the Lords, followed by the Committee and Report stages which provide opportunities for Peers to amend it. \nLabour says it will not block the legislation but will attempt to make changes. Planned amendments include one to stop the Government planning for a “no deal” Brexit without the approval of Parliament. \nAnother would remove a reference to the UK exiting the EU at 11pm on 29 March 2019. Labour says the UK should have the flexibility to continue negotiations with the EU beyond this time, if needed. \nHowever, some Labour peers such as Lord Adonis, the former Labour Transport Secretary, along with Liberal Democrats, may go further than the official party position and attempt to block the legislation or insert calls for a second referendum. Lord Adonis (Image: Jonathan Brady/PA Wire) \nIt comes as Mrs May faces an uphill battle to unite the Conservative Party, with divisions over Brexit playing out in public. \nSupporters of a “hard Brexit” founded on Philip Hammond, the Chancellor, who is seen as pushing for a softer version of Brexit. \nFormer Conservative leader suggested over the weekend that Chancellor Philip Hammond should be fired, saying that Mrs May “cannot govern with Philip Hammond sniping from the sidelines”. Read More What is the EU withdrawal bill and why is it so important for Brexit? \nAnd backbench MP Jacob Rees-Mogg refused to say that the chancellor should keep his job. The Times reports he said: “Of course I’ve got a view, yes, but I think that it’s not for me to give that view publicly. I think this really is a matter for the prime minister.” \nFormer Cabinet Minister Justine Greening called on the party to get behind Theresa May as she battles the “almost impossible” task of negotiating Brexit. \nShe told BBC Radio 4’s Today programme: “I remain a strong backer of the Prime Minister. I’ve been very disappointed to see the soundings off. \n“I think they need to stop and I think people need to get behind her. \n“I think she is doing an important job for our country. We need to support her in that impossible, almost, task that she has negotiating Brexit.” Like us on Facebook ", "external_links": [], "published": "2018-01-29T18:52:00.000+02:00", "crawled": "2018-01-29T19:19:58.032+02:00", "highlightTitle": ""}