{"organizations": [], "uuid": "30073293e190bf20e38de821b7dfc5a2c9443c6a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14168081.ece/ALTERNATES/s1200/CFR_NJL_170118gateshead_01JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/6m-business-park-under-construction-14168049", "country": "GB", "domain_rank": 21960, "title": "£6m business park under construction in shadows of Gateshead International Stadium", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T16:58:00.000+02:00", "replies_count": 0, "uuid": "30073293e190bf20e38de821b7dfc5a2c9443c6a"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/6m-business-park-under-construction-14168049", "ord_in_thread": 0, "title": "£6m business park under construction in shadows of Gateshead International Stadium", "locations": [], "entities": {"persons": [], "locations": [{"name": "gateshead international stadium business", "sentiment": "none"}, {"name": "gateshead international stadium langley", "sentiment": "none"}, {"name": "gateshead international stadium", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "saltmeadows road", "sentiment": "none"}, {"name": "baltic park", "sentiment": "none"}], "organizations": [{"name": "langley holdings", "sentiment": "none"}, {"name": "gva", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business £6m business park under construction in shadows of Gateshead International Stadium Langley Holdings is leading the development, which is the biggest of its kind in the area for 11 years Share The site plan in Gateshead for the speculative industrial park (Image: GVA) Share Get business   Thank you for subscribing!   \nA £6m business park is under construction in the shadows of Gateshead International Stadium , in one of the largest speculative industrial developments to be built in the area in a decade. \nPotential tenants are being sought for Baltic Park, on Saltmeadows Road in Gateshead, where property company GVA is bringing 100,000 sq ft of industrial space to the market. \nThe six-acre site is being developed by global group Langley Holdings and follows on from a previous phase involving the demolition of two redundant properties that had been vacant for a number of years. \nLangley Holdings is investing more than £6m on the scheme, which includes the construction of 11 new industrial units together with associated car parking and service yards. \nOnce finished, the units will range in size from 2,375sq ft to 48,500sq ft and will be available to rent from September. \nBernard Watson, group commercial director at Langley Holdings plc, said: “We are delighted to finally start work on our business park scheme and we very much look forward to its opening later this year. \n“We have taken great care over the design layout and landscaping within the scheme and we are pleased to be able to bring these much-needed business facilities to the area.” \nDanny Cramman, a director at GVA, the sold letting agents for the scheme, expects to see a lot of interest for Baltic Park. \nHe said: “Baltic Park lies within the East Gateshead Industrial Estate, adjacent to the Gateshead International Stadium and the A184 Felling by Pass offering easy access to the A19 and A1M as well as Gateshead town centre and Newcastle city centre. \n“We anticipate strong market interest in the extensive range of high specification units at this location.” Read More Gateshead fish'n'chip shop supplier warns Brexit will batter market conditions \nGVA is providing project management and planning consultancy services on the new build construction scheme, and is also the retained property manager for the adjoining Saltmeadows Road Trade Park and Industrial Estate. \nBaltic Park sits close to the Gateshead Quays development scheme, which aims to bring 300,000 visitors to Tyneside each year and add £29.5m to the regional economy. As well as the conference and events centre, the scheme will include hotel, bars and restaurants. \nGateshead Council has formed a partnership with property developers Ask Real Estate and investment group Patrizia UK to finally make the plans a reality, with a masterplan being drawn up in advance of a formal planning application. Like us on Facebook", "external_links": [], "published": "2018-01-17T16:58:00.000+02:00", "crawled": "2018-01-17T17:33:49.016+02:00", "highlightTitle": ""}