{"organizations": [], "uuid": "3ba142ae1c27102b8881165c9fa3b15c87737959", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bostonstandard.co.uk", "main_image": "https://res.cloudinary.com/jpress/image/fetch/w_300,f_auto,ar_3:2,c_fill/https://www.bostonstandard.co.uk/webimage/1.8309313.1514552152!/image/image.jpg", "site_section": "http://www.bostonstandard.co.uk/rss/cmlink/1.335257", "section_title": "Boston Standard MBSP.news.feed", "url": "https://www.bostonstandard.co.uk/news/opinion/new-yea-message-2018-could-be-lincolnshire-s-year-of-pride-1-8309314", "country": "GB", "title": "NEW YEA MESSAGE: 2018 could be Lincolnshire’s year of pride", "performance_score": 0, "site": "bostonstandard.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-01T19:00:00.000+02:00", "replies_count": 0, "uuid": "3ba142ae1c27102b8881165c9fa3b15c87737959"}, "author": "", "url": "https://www.bostonstandard.co.uk/news/opinion/new-yea-message-2018-could-be-lincolnshire-s-year-of-pride-1-8309314", "ord_in_thread": 0, "title": "NEW YEA MESSAGE: 2018 could be Lincolnshire’s year of pride", "locations": [], "entities": {"persons": [{"name": "colin davie", "sentiment": "none"}], "locations": [{"name": "usa", "sentiment": "none"}, {"name": "hunan", "sentiment": "none"}, {"name": "lincolnshire", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "lincolnshire", "sentiment": "none"}, {"name": "digital skills", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YEA MESSAGE: 2018 could be Lincolnshire’s year of pride Colin Davie Published: 17:00   \n2017 has been for me a year of contrasts, with the media narrative that we are all doomed because of Brexit, making me reach for the off button compared to the hugely impressive scale of development that was on show when I led a trade mission to Hunan in October. \nI have long believed that our long-term economic future will be shaped by the powerhouse markets of the future, namely China, India and the USA and whilst it’s important to have good trading relationships with our neighbours it is more vital we secure the relationships that will shape our nation economically. \nI believe we in Lincolnshire are best when we lead, when we seize the opportunity and when we “make our own economic weather”. If we rise up to the challenges ahead, Lincolnshire and our country can truly lead the next Industrial Revolution which will be based around Digital Skills and technology. \nThe current global economic situation - with low exchange rates, a rebalancing of global economic power between China and the USA, and of course Brexit- could lead to unpredictable times for Lincolnshire businesses. Our job at LCC in the team I lead is to try and help to provide the certainty that businesses require in order to invest in the economy, and to insure stability exists across our key sectors. \nAt the county council we have established a Brexit working group. Senior councillors are exploring the issues that will affect the county council and the local economy more widely. \nI firmly believe that there are substantial opportunities for businesses to grow, and individuals to enrich their careers, during and following Brexit. Automation can help businesses be more productive, and it can give people the opportunity to gain good jobs operating and maintaining robots. That is why Greater Lincolnshire LEP had such a focus on robotics at its Business Live event in October; they are the future. \nBrexit will inevitably change our trading patterns. There are major opportunities for businesses to trade with China, for institutions to generate investment from China, and for students to learn in China. Our small trade visit to Changsha in Hunan province, China, took place in order to promote these opportunities. Educational, manufacturing, and agricultural opportunities are now being directly pursued following our visit. \nWe hope to have taken substantial steps forward on these opportunities by the time that our Chinese partners visit Lincolnshire in April 2018. \nDuring 2017 we conducted a major study into the utility constraints in Lincolnshire. We now have a very clear picture of the utility challenges that businesses face in implementing their growth plans, and we will use that valuable information to make a strong case for investment. Our MPs have done their bit too in raising this issue within Westminster, and I was particularly grateful to Dr Caroline Johnson MP for specifically raising the utility problems that Lincolnshire businesses face during ministerial questions in the House of Commons. \nThe other big issue that businesses raise with us is skills. We have some very talented school leavers, and we have some excellent jobs available within our economy. Our challenge –which we have embraced by attracting £13m of grants for training programmes- is to help people with that academic knowledge to develop the skills that our employers need. And in turn that will then help our young people to stay and build their careers and lives here in the county…a benefit to all of us. \nIt is good to remind ourselves that we live in such an attractive place with a vibrant visitor economy. Earlier in the year I was delighted to open Sutton Bridge Marina. It is helping us to attract a broader range of tourists to the county, as indeed did the displaying of Domesday Book at Lincoln Castle during the summer. I look forward to the events surrounding the 100th anniversary of the Royal Air Force doing the same next year. I am particularly looking forward to the formal opening of the first purpose built marine observatory in the Uk,at Chapel Point next Spring. \n2018 can be Lincolnshire’s year - all of us need to shout even more loudly from the rooftops about how fabulous our County is and what a great place it is to work in, to live in and to invest in. \nLet us all embrace the future world rather than looking backwards and if we do that we can all celebrate the role we have played in creating one voice and one Team Lincolnshire. What we hand on to the next generation must always be better than what we inherited and I am determined to play my full part in delivering on that. \nA very happy, peaceful and prosperous 2018 to you all. Follow Us On", "external_links": [], "published": "2018-01-01T19:00:00.000+02:00", "crawled": "2018-01-01T19:51:33.013+02:00", "highlightTitle": ""}