{"organizations": [], "uuid": "b8dc2cece47f843d85681d36f54b9a4959a6f992", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article12404732.ece/ALTERNATES/s1200/Jason-Wainwright-managing-partner-at-Muckle.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/newcastle-law-firm-muckle-blames-14103255", "country": "GB", "domain_rank": 21960, "title": "Newcastle law firm Muckle blames Brexit vote for 54% drop in profit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T14:48:00.000+02:00", "replies_count": 0, "uuid": "b8dc2cece47f843d85681d36f54b9a4959a6f992"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/newcastle-law-firm-muckle-blames-14103255", "ord_in_thread": 0, "title": "Newcastle law firm Muckle blames Brexit vote for 54% drop in profit", "locations": [], "entities": {"persons": [{"name": "wainwright", "sentiment": "none"}, {"name": "jason wainwright", "sentiment": "none"}, {"name": "muckle", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}], "organizations": [{"name": "muckle", "sentiment": "negative"}, {"name": "newcastle", "sentiment": "negative"}, {"name": "brexit", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "muckle llp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Newcastle law firm Muckle blames Brexit vote for 54% drop in profit The firm said the North East suffered as a result of a drop in North East economic activity following the vote to leave the EU Share Jason Wainwright, managing partner at Muckle LLP (Image: Muckle LLP) Share Get business   Thank you for subscribing!   \nNewcastle law firm Muckle LLP predicts a brighter 2018 despite blaming Brexit for halving its profits and wiping over £1.5m from its top line revenue last year. \nTurnover at the Gallowgate based firm slumped 12.7% to £10.6m for the year ending March 2017, with managing partner Jason Wainwright saying the dip was caused by uncertainties in the North East business market and economic climate around the Brexit vote. \nMuckle’s net profit - the final amount paid out to partners at the firm - was also affected, falling by 54% from £2.6m to £1.187m. \nMr Wainwright said: “The first five months of the financial year 2016/7 were challenging, largely due to uncertainties arising from the Brexit vote. \n“We are primarily a law firm for North East business, so much of our work revolves around business economic activity in the region. \n“Whilst we are pleased to have remained the top dealmaker in the North East throughout the 2016/7 financial year, the drop in economic activity in the region at the beginning of that financial year had a considerable impact on our overall financial performance. \n“Most encouragingly, work levels improved from September 2016 onwards and we hit our targets for the second half of the financial year.” Read More Mission to create Stronger North East in 2018 is set out by Chamber members \nMuckle also increased its headcount from 128 to 146 people, which includes 28 partners, during the year. \nMr Wainwright added that the firm was now looking to grow its turnover, improve profitability and manage its costs during 2018. \nThe firm said it was also looking to hire more staff during 2018 and invest in new IT systems. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nMr Wainwright added: “The weaker financial performance in 2016/7, whilst disappointing, was not unexpected and was as we predicted at the end of last year. Despite this, we continued to invest in our people and infrastructure, confident that the work levels would come back. \n“We have started the current financial year (2017/8) very well, with revenues and profit up and maintaining our position as the top North East deal maker. We are currently handling a large number of deals and pleased to report we hit our financial targets at the half year stage. \n“We are excited about the future. We have six new equity partners bringing additional energy and ideas to our business. We are developing new business areas such as housing and real estate litigation and sport and are investing in some exciting new sectors and investing in innovation to make legal services more accessible to new/early-stage business. \n“We remain mindful and acutely aware of the economic uncertainties arising from Brexit and other more recent world events, but we believe that we are well-placed, in the North East business market in particular, as larger competitors look outside our region for growth.” Like us on Facebook", "external_links": [], "published": "2018-01-02T14:48:00.000+02:00", "crawled": "2018-01-02T15:19:28.038+02:00", "highlightTitle": ""}