{"organizations": [], "uuid": "4ded15a007c47f603a1a347cccf2c6844c6309d1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article1001036.ece/ALTERNATES/s1200/anne-widdecombe-main.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "devonlive - frontpage", "url": "http://www.devonlive.com/news/devon-news/celebrity-big-brother-welcomes-devons-1001068", "country": "GB", "title": "Celebrity Big Brother welcomes Devon's own Ann Widdecombe among its class of 2018", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T17:27:00.000+02:00", "replies_count": 0, "uuid": "4ded15a007c47f603a1a347cccf2c6844c6309d1"}, "author": "Guy Henderson", "url": "http://www.devonlive.com/news/devon-news/celebrity-big-brother-welcomes-devons-1001068", "ord_in_thread": 0, "title": "Celebrity Big Brother welcomes Devon's own Ann Widdecombe among its class of 2018", "locations": [], "entities": {"persons": [{"name": "ann widdecombe", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "ann", "sentiment": "none"}, {"name": "anton", "sentiment": "none"}, {"name": "bruce forsyth", "sentiment": "none"}, {"name": "mogg", "sentiment": "none"}, {"name": "boris", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "haytor", "sentiment": "none"}, {"name": "elstree", "sentiment": "none"}], "organizations": [{"name": "nhs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Celebrity Big Brother welcomes Devon's own Ann Widdecombe among its class of 2018 Fans got the first clue that she was gearing up for the house after she was apparently spotted at a hotel near the Elstree studio Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nControversial former Tory MP Ann Widdecombe is to swap her home on Dartmoor for the confines of the Celebrity Big Brother house as the new series begins. She is the second housemate confirmed for the new series, according to the Mirror Online . \nAnn, who is 70 and lives near Haytor, will step into the house on Tuesday night as the 2018 series begins. Read More Ann Widdecombe on Brexit, Boris, Mogg, Trump, the NHS and why Anton should have replaced Bruce Forsyth on Strictly Come Dancing \nKnown for her controversial and divisive opinions, the former Tory politician is pro-Brexit and has made it clear she isn't a fan of reality stars. During her time in parliament she opposed the legality of abortion, inflamed the LGBT community after voting against lowering the age of consent and gave her support for the re-introduction of the death penalty. \nFans got the first clue that she was gearing up for the house after she was apparently spotted at a hotel near the Elstree studio. Read More Politician, Strictly Come Dancing star and top author Ann Widdecombe urges book lovers to use their libraries \nTorquay's own celebrity TV favourite Georgia Toffolo, winner of the recent series of I'm a Celebrity Get Me out Of Here!, Tweeted her own reaction. \nAnd it's not Ann's first bash at reality TV. She entertained viewers of Strictly Come Dancing in series 8 of the dancing show in 2010. She is well prepared for the publicity which will inevitably come with the CBB appearance. She said: \"I’ve developed a thick skin over the years. You do something controversial in politics, you get all the criticism, then you become a minister and you get a lot more, and so it goes on, until eventually it’s water off a duck’s back.\" \nThe 2018 Celebrity Big Brother will boast an all-woman line-up. Journalist Rachel Johnson has already been confirmed, and other names mentioned include transgender broadcaster India Willoughby, Tattoo Fixers' Paisley Billings, party girl Laura Simpson and Made in Chelsea star Louise Thompson. Like us on Facebook ", "external_links": [], "published": "2018-01-02T17:27:00.000+02:00", "crawled": "2018-01-02T17:45:47.010+02:00", "highlightTitle": ""}