{"organizations": [], "uuid": "804d959935d480ec81cf60d9535fd659d74f7c18", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article574349.ece/ALTERNATES/s1200/New-Topps-Tiles-ranges.jpg", "site_section": "http://www.leicestermercury.co.uk/rss.xml", "section_title": "leicestermercury - frontpage", "url": "http://www.leicestermercury.co.uk/news/business/shares-topps-tiles-jump-news-1032364", "country": "GB", "domain_rank": 48128, "title": "Shares in Topps Tiles jump on news of good growth", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T14:46:00.000+02:00", "replies_count": 0, "uuid": "804d959935d480ec81cf60d9535fd659d74f7c18"}, "author": "Tom Pegden", "url": "http://www.leicestermercury.co.uk/news/business/shares-topps-tiles-jump-news-1032364", "ord_in_thread": 0, "title": "Shares in Topps Tiles jump on news of good growth", "locations": [], "entities": {"persons": [{"name": "matthew williams", "sentiment": "none"}, {"name": "williams", "sentiment": "none"}, {"name": "hinckley", "sentiment": "none"}], "locations": [{"name": "hinckley share get business", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "grove park", "sentiment": "none"}], "organizations": [{"name": "topps tiles", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Shares in Topps Tiles jump on news of good growth Tile chain looking for new sites - including possible new branch in Hinckley Share Get Business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nShares in Topps Tiles jumped this morning on news of decent growth in the last three months of 2017. \nLike-for-like sales at the Enderby tile specialist rose 3.4 per cent in the 13 weeks to December 30, compared to just 0.3 per cent at the same time in 2016. \nChief executive Matthew Williams said it was down to factors including investment, marketing campaigns and a better offering for trade customers. \nHe said the business was also achieving record customer service scores. \nBy noon today shares were up 7.5 per cent at 86p. \nThe business, which has its UK head office in Grove Park, ended the year with 371 stores, one more than it had in the previous three months. \nMr Williams said they were looking for new sites, and considering opening a branch in Hinckley. \nThe business is also currently in the middle of a big head office refurbishment, which has seen it revamp the exterior, with plans to do up the ground floor offices and add a showroom for its newly acquired Parkside business this year. \nThe first and second floors of the headquarters will be upgraded in 2019/20. Matthew Williams, chief executive of Topps Tiles (Image: Mike Sewell) \nThe recent acquisition of Parkside Tiles, of Thurmaston, for £1.1 million, saw Topps move into commercial - rather than the established retail and trade - sales for the first time. \nTopps plans to invest a further £1 million in that business in the coming months to build up a route to bigger commercial clients. \nThe Parkside commercial offer was launched at the 100% Design trade show in October and the first commercial showroom opened in Chelsea in December. \nParkside already works with big names such as Nando's. Read More \nThe latest trade figures follow on from a 1.5 per cent drop in total sales for the year to last September, when turnover was about £212 million, compared with £215 million a year earlier. \nPre-tax profits were down 15 per cent at £17 million. Read More HUGE jump in sales at Harborough-based Joules \nMr Williams told the Mercury it was encouraging start to the new financial year, suggesting they were outperforming the overall tile market. \nHe said: \"I think that decent performance is largely to do with the way we are executing our strategy, and key investments in retail and trade over the last year. \n\"We have had quite a strong promotional period, with advertising on TV, and we now have Sarah Beeny as a brand ambassador. We are also continuing to invest in our trade customers and trade loyalty scheme. Bruges, dark grey stone effect tiles for indoors and out, from the Spaces tiles collection (Image: PA Photo Credit) \n\"There has been some good progress with the Parkside Tiles acquisition, but it's still early days for that business. We've made some good moves forward in terms of recruitment of sales people. \n\"For 2018 we are taking quite a conservative view of the overall market, but are happy with how it has started for us, even though we are in a situation where the Government is still negotiating Brexit, with consumer confidence at relatively low levels. \n\"So any increase in consumer confidence and building on stability would be a good thing. \n\"And an increase in housing transactions would be the icing on the cake.\" Like us on Facebook", "external_links": [], "published": "2018-01-09T14:46:00.000+02:00", "crawled": "2018-01-09T15:15:08.014+02:00", "highlightTitle": ""}