{"organizations": [], "uuid": "aaca5eeec10f01c23215197b4326846bfee0157e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article1122234.ece/ALTERNATES/s1200/28360172JPG.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/news/business/brexit-comment-many-accused-eu-1122197", "country": "US", "domain_rank": 48128, "title": "Brexit Comment: ‘Many have accused the EU of being on life support – but NAFTA is also in intensive care’ - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.158, "site_type": "news", "published": "2018-01-26T12:55:00.000+02:00", "replies_count": 0, "uuid": "aaca5eeec10f01c23215197b4326846bfee0157e"}, "author": "Tom Pegden", "url": "http://www.leicestermercury.co.uk/news/business/brexit-comment-many-accused-eu-1122197", "ord_in_thread": 0, "title": "Brexit Comment: ‘Many have accused the EU of being on life support – but NAFTA is also in intensive care’ - Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "beth walsh", "sentiment": "negative"}, {"name": "roy botterill", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "shakespeare martineau", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "leicester colton square", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "nafta", "sentiment": "negative"}, {"name": "north american free trade association", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Roy Botterill: 'NAFTA may not even survive long enough for the UK to join it' (Image: Beth Walsh) Share Get Business updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email Roy Botterill is head of the Leicester Colton Square office of law firm Shakespeare Martineau. \nBrexit might be becoming boring – but it is economically the most important factor for most UK businesses for the foreseeable future. Amongst much cheering, the British Government appears to be riding a wave of optimism that we are reaching agreement with the EU. \nHowever, this overlooks the fact that trade negotiations will be very long and difficult – with no certainty of agreeing a satisfactory deal with the EU. \nRecently, attention has turned to the idea of the UK joining the North American Free Trade Association (NAFTA) in the event that a trade deal with the EU cannot be secured before March 2019. \nBoth Australian and Canadian trade officials have also recently called for the UK to join existing trading blocks such as NAFTA, with Donald Trump even saying that he expects a “very big, very powerful” trade deal with the UK. \nAt first sight, joining NAFTA appears to be an attractive idea. Be careful what you wish for (Image: Getty Images) \nThe Anglo-Saxon relationship of the US, Canada and the UK, with their common heritage and approaches to trade, combined with the growing economy of Mexico, could form the basis of a strong trade relationship. \nHowever, those who believe the USA to be the ultimate free trade country may be surprised about the extent of the regulation with which the UK would have to comply under NAFTA. \nMuch of this new regulation is unchartered territory and businesses wanting to continue exporting to EU countries will still have to comply with EU regulations, something many people are keen to be free from. \nFor UK manufacturers, this may mean producing two different versions of the same product if they want to export both to the EU and NAFTA markets. \nDespite current disparity between EU/UK and NAFTA law, as an existing trading block, the UK would need to align itself with NAFTA’s regulatory and policy frameworks for services and goods, including agriculture product standards, competition policy and intellectual property protection. Not everyone is united over NAFTA \nNAFTA membership is unlikely to create substantial market openings in areas where the UK is strongest – such as professional and financial services. \nHowever, joining NAFTA would expose a range of UK manufacturing and agriculture sectors to highly competitive US and Mexican exports. \nNAFTA has come under heavy fire from many critics and may not even survive long enough for the UK to join it. \nRecently, the fourth round of renegotiation talks has been under way between the USA, Canada and Mexico in a desperate attempt to save what they can of the deal, and all signs point to an increasing distance between their positions. \nDonald Trump has threatened to tear up NAFTA if Canada and Mexico do not grant him greater concessions, and the US Government is now proposing a “sunset clause” to terminate the agreement automatically in five years unless it is specifically extended. Read More \nMany in the UK have accused the EU of being on life support and riddled with debt. \nNAFTA is similarly in intensive care. Read More \nSo should the UK therefore drop the certainty of the single market and relationships with our most important trading partners, the 27 remaining EU member states, for a new relationship in NAFTA? \nIt would be a brave person to recommend that! Like us on Facebook ", "external_links": [], "published": "2018-01-26T12:55:00.000+02:00", "crawled": "2018-01-26T14:57:13.006+02:00", "highlightTitle": ""}