{"organizations": [], "uuid": "56ae74905ba99e409badc6772f3023c6c8393e96", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article10706158.ece/ALTERNATES/s1200/JS32121731.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/firm-tsg-back-black-launches-14113124", "country": "GB", "domain_rank": 21960, "title": "IT firm TSG back in the black as it launches Delay Repay software for rail operators", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T16:42:00.000+02:00", "replies_count": 0, "uuid": "56ae74905ba99e409badc6772f3023c6c8393e96"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/firm-tsg-back-black-launches-14113124", "ord_in_thread": 0, "title": "IT firm TSG back in the black as it launches Delay Repay software for rail operators", "locations": [], "entities": {"persons": [{"name": "graham wylie", "sentiment": "none"}, {"name": "david stonehouse", "sentiment": "none"}], "locations": [], "organizations": [{"name": "tsg", "sentiment": "negative"}, {"name": "newcastle", "sentiment": "none"}, {"name": "sage", "sentiment": "none"}, {"name": "technology services group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business IT firm TSG back in the black as it launches Delay Repay software for rail operators The firm launched by Sage founder Graham Wylie is already working with five train operators, and expects more to be signed up this year Share David Stonehouse, chief executive of TSG Share Get business   Thank you for subscribing!   \nThe Newcastle software firm launched by Sage founder Graham Wylie is back in the black after continuing to build up its recurring revenues. \nLatest accounts for Technology Services Group (TSG) show the IT company boosted operating profit from a loss of £628,000 to £32,000 following a solid year of trading in the 12 months to March 31 2017. \nAdjusted operating profit – not including goodwill amortisation and exceptional costs – also rose from £387,000 to £902,000. \nTurnover dipped by 5% in the year to £32.8m, which the company said was expected, as customers switch their IT services to subscriptions rather than traditional project based service delivery. \nAs TSG continues to win new subscription, support and cloud based services, the firm said it expects this trend of falling turnover to plateau, meaning it can then rely on a consistent and reliable income stream based on those contracts. \nThe Great Park-headquartered firm embarked on a cost-cutting exercise in 2015, streamlining the business and launching a London office to seize opportunities in the south, while also focusing on rebuilding recurring revenue. \nThat strategy is continuing to bear fruit, with monthly recurring revenue now accounting for 66.3% of total turnover compared to last year’s 60.6%. \nEarly this year the firm will launch its Traveller software product, which sees the firm work with rail operators on their Delay Repay compensation schemes for travellers affected by disrupted train services. \nLast year saw the firm plough an extra £672,000 into the development of Traveller, and its membership software package Tribe. \nSince the end of the financial year the firm has agreed new group funding facilities in a bank funding package of £4m, to replace the existing bank overdraft and shareholder loans from Mr Wylie. \nChief executive David Stonehouse: “It is pleasing to see the company make significant progress in delivering its strategy of building our monthly recurring revenue, focusing on those customers where we feel we can offer a differentiated service and delivering to their expectations whilst continuing to invest in our own branded product portfolio. \n“We couldn’t achieve that without great, committed and well-trained staff. Read More North Shields software firm Kykloud is bought by United States giant Accruent \n“These efforts have enabled us to post very positive improvements over prior years in terms of improved gross profit percentage, profitability and cashflow which is particularly pleasing given the economic uncertainty affecting all UK business since the Brexit vote in June 2016.” \nHe added: “Most of the development work on Traveller is complete and we expect our first customer to ‘go live’ with the product within the next quarter. \n“We’ve signed up five of the train operating companies and expect to sign up at least ten more in the next year or two, thus delivering to a significant majority of the larger operators. \n“Each customer signs on a monthly subscription basis for a minimum three-year term and we expect an average annual revenue of £200,000 per customer.” \nLooking ahead, Mr Stonehouse said next year’s results to show further improvement. \nHe added: “Trading is continuing to show improvements despite the continued economic uncertainty around Brexit. \n“We have some excellent new business gains, particularly in and around London and delivered significant improvements in our project management capability thus improving customer satisfaction. We expect to show further improvements in profitability and cashflow whilst improving overall customer satisfaction.” Like us on Facebook", "external_links": [], "published": "2018-01-04T16:42:00.000+02:00", "crawled": "2018-01-04T17:11:38.007+02:00", "highlightTitle": ""}