{"organizations": [], "uuid": "2ed79b95a8b41aedc0fbe78238d1a1ebd09c450a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/business/article1085344.ece/ALTERNATES/s1200/BJDaniella-Glynn-1-USE.jpg", "site_section": "http://www.westernmorningnews.co.uk/business.rss", "section_title": "devonlive - Business", "url": "http://www.devonlive.com/news/business/you-need-know-calculating-holiday-1085276", "country": "GB", "title": "All you need to know about calculating holiday pay", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T18:04:00.000+02:00", "replies_count": 0, "uuid": "2ed79b95a8b41aedc0fbe78238d1a1ebd09c450a"}, "author": "Hannah Finch", "url": "http://www.devonlive.com/news/business/you-need-know-calculating-holiday-1085276", "ord_in_thread": 0, "title": "All you need to know about calculating holiday pay", "locations": [], "entities": {"persons": [{"name": "daniella glynn", "sentiment": "none"}, {"name": "browne jacobson", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "european court of justice", "sentiment": "none"}, {"name": "browne jacobson llp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "All you need to know about calculating holiday pay Daniella Glynn, HR consultant at Browne Jacobson LLP, explains holiday entitlements Share Daniella Glynn, HR consultant at Browne Jacobson LLP Share Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email There have been a considerable number of cases looking at how an employee’s holiday pay should be calculated, leading to much confusion. Full time employees are entitled to 5.6 weeks’ paid annual leave. Of this, four weeks derives from Europe (‘Working Time Directive’ or ‘WTD leave’). A further 1.6 weeks is granted by the UK government (‘additional leave’). \n‘Normal remuneration’ and ‘a week’s pay’ \nHistorically, holiday pay was calculated on the basis of ‘a week’s pay’. For workers with normal working hours, this only included basic salary and guaranteed compulsory overtime. For workers with no normal working hours, this was calculated by taking an average of all remuneration earned in the previous twelve working weeks. \nThe European Court of Justice has held that WTD leave holiday pay must be calculated by reference to an employee’s ‘normal remuneration’, rather than ‘a week’s pay’. ‘Normal remuneration’ is wider in scope, including commission and overtime, which ‘a week’s pay’ does not. For additional leave, this can still be calculated by reference to ‘a week’s pay’. What sort of overtime is included in ‘normal remuneration’? In July, the Employment Appeal Tribunal (EAT) confirmed that pay for voluntary overtime, out-of-hours standby payments and call-out payments should be included in holiday pay if they are part of an employee’s ‘normal remuneration’. The case further defined ‘normal remuneration’ as being payments made over a sufficient period of time on a regular or recurring basis, which based on the facts in this case, included pay for voluntary overtime. In a previous case, it was found that voluntary overtime worked one week in every four or five was sufficiently regular to be included as normal remuneration. What employers need to do… If you have employees who undertake voluntary overtime or work on results based commission, you should review how your organisation calculates holiday pay. Some employers have started to calculate holiday pay taking account of overtime and commission as a protective measure, effectively drawing a line in the sand for any future claims, as employees only have three months to bring a claim for underpayment of holiday pay. It remains to be seen what impact Brexit will have on the above. To find out more, please come along to our free employment law update session in Exeter on Thursday 25 January 2018. Register your interest at Like us on Facebook", "external_links": [], "published": "2018-01-18T18:04:00.000+02:00", "crawled": "2018-01-18T18:34:22.005+02:00", "highlightTitle": ""}