{"organizations": [], "uuid": "b1c0c966cfc190e0d2d95c8dc6247feee32d8ac3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1089087.ece/ALTERNATES/s1200/dustin4JPG.jpg", "site_section": "http://www.westernmorningnews.co.uk/education-news.rss", "section_title": "devonlive - News", "url": "http://www.devonlive.com/news/devon-news/tom-daley-kids-husband-dustin-1089024", "country": "GB", "title": "Is Tom Daley about to have kids? His husband Dustin Lance Black just suggested children are on the way", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T14:32:00.000+02:00", "replies_count": 0, "uuid": "b1c0c966cfc190e0d2d95c8dc6247feee32d8ac3"}, "author": "Patrick Phelvin", "url": "http://www.devonlive.com/news/devon-news/tom-daley-kids-husband-dustin-1089024", "ord_in_thread": 0, "title": "Is Tom Daley about to have kids? His husband Dustin Lance Black just suggested children are on the way", "locations": [], "entities": {"persons": [{"name": "tom daley", "sentiment": "none"}, {"name": "dustin lance black", "sentiment": "none"}, {"name": "tom", "sentiment": "none"}, {"name": "dustin", "sentiment": "none"}], "locations": [{"name": "calais", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "united states of america", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "hereford", "sentiment": "none"}, {"name": "bovey castle", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "bbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Is Tom Daley about to have kids? His husband Dustin Lance Black just suggested children are on the way US screenwriter tells Question Time he cares passionately about the future of the UK because he and Tom want to start a family here Share   Thank you for subscribing!   \nDevon diving ace Tom Daley’s plans to “settle down and raise a family”, his American husband, Dustin Lance Black has suggested. The American screenwriter, director, film and television producer and LGBT rights activist appeared on the BBC’s flagship political discussion programme Question Time last night. \nDustin who married Tom at Bovey Castle in Devon last May, proved a hit with the Hereford audience, winning applause for his stance on immigration, when he criticised plans to beef up security at Calais. \nHe was also critical of the Government’s handling of the Carillion collapse. And it was in an answer to a question about this that he hinted at hopes he and Tom would settle down with kids. Dustin Lance Black (front) on the Question Time panel last night (Image: BBC) \n“I’m here from the United States of America, I didn’t get to vote on Brexit, because in this country because I fell in love, because I call it home and because I hope to raise a family here, so I really do give a damn about how this country does and it seems like no one’s got their eye on the ball, who’s at the wheel of the ship,” he said. (Image: BBC) \n“I love the audience member who used the word accountability, I think, at the point of which the government says ‘we’re going to take these programmes private’, you can’t keep blaming the private company. Private companies are built on profit, that’s what they are supposed to do, they are supposed to make a profit. But that’s not what the state is supposed to do, that’s not what the Government is supposed to do, they are supposed to be looking out for the people, for you. \n“And so when I hear accountability I say go to the government who gave the companies these jobs, make sure they knew how many jobs they were giving this company, how many eggs did they put in that basket? And were they keeping a close enough eye, with so much going on, to make sure they didn’t do something that was going to help the fortunes of a few and hurt your families? The Government is accountable.” The Question Time audience show their appreciation for Dustin (Image: BBC) \nAlso on the panel, chaired by David Dimbleby, were Margot James, Andy Burnham, Howard Davies and Munira Mirza. \nDustin is an American screenwriter and director who has won multiple awards for his work. \nThe 43-year-old was born in Sacramento, California, and grew up in a Mormon household. Dustin Lance Black on Question Time (Image: BBC) Who is Dustin Lance Black? \nDustin was brought up in a strictly Mormon family who moved to Texas before returning to California when his mother remarried. \nHe has said that growing up in a religious household meant he worried about his sexuality and when he found himself attracted to a boy at age seven, he said to himself: \"I'm going to hell. And if I ever admit it, I'll be hurt, and I'll be brought down.\" \nDustin, who student Film and Theatre Television at UCLA School of Theatre, came out as gay in his senior year of college. \nHe is now a member of the American Foundation for Equal Rights. A screenwriter and director he has written work that gained him prestigious Hollywood awards, including an Oscar. Tom Daley and Dustin Lance Black at the Vodafone Passes Launch held at The Bankside Vaults on November 1, 2017 in London \nDustin's first effort was a gay romance film called The Journey of Jared Price, that he wrote and directed. \nIn 2001, Dustin was hired to write on the HBO series Big Love, before he began work on a feature film about the life and work of the first openly gay American politician Harvey Milk. Read More \nThe film, titled Milk, was eventually released in 2008 and was met with critical acclaim, earning Dustin a Writers Guild of America Award, as well as an Academy Award. \nDustin has since worked on more projects profiling influential figures, including AIDS activist Pedro Zamora in 2009. \nHe also wrote the screenplay for J.Edgar, a film that starred Leonardo Dicaprio and was directed by Clint Eastwood. \nTom, 23, and Dustin Lance Black met in 2013 and Tom later came out as gay that December, admitting to fans in a Youtube video that he had been dating a man since the summer. Fans of the couple are frequently treated to Twitter updates about their relationship. \nLater it was revealed that Olympic diver Tom Daley's boyfriend was Dustin Lance Black, and the pair made their first public appearance at an event at Battersea Power Station in May 2014. Diving prodigy Tom Daley pictured in 2007 \nTom said of meeting Dustin: \"I'd never felt the feeling of love, it happened so quickly, I was completely overwhelmed by it to the point I can't get him out of my head all the time.\" \nThe couple married at Bovey Castle on Dartmoor, just days after Tom came out of hospital following a minor hip operation. Read More Cuban weather system will see temperatures in Devon soar to double figures \nThe Olympian tweeted alongside a picture of the ceremony, which took place in Bovey Castle’s Summerhouse: “The day I married the love of my life shared with 120 of our closest family and friends from Texarkana to Plymouth!” \nLance published a picture of the newlyweds on the stone bridge at Bovey with the message: “So... what did you do this weekend?” \nA source said: “It was a beautiful ceremony, their vows were so brilliant and heartfelt. Tom and Lance organised the wedding themselves and it had their personalities stamped on every detail.” Tom Daley posing with his Olympic bronze medal in 2012 \nTom even rolled up his sleeves to make the wedding cake, a multi-tiered psychedelic creation. He also gave special credits to fashion brand Burberry, the London Gay Men’s Chorus, and photographer Andy Mac. \nNow it seems the couple are about to embark on their next big adventure. Like us on Facebook", "external_links": [], "published": "2018-01-19T14:32:00.000+02:00", "crawled": "2018-01-19T15:06:17.131+02:00", "highlightTitle": ""}