{"organizations": [], "uuid": "69cc9c23aa9082dc2c3602a631df1c43a9300234", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article361724.ece/ALTERNATES/s1200/Anne-Marie-Morris.jpg", "site_section": "http://www.westernmorningnews.co.uk/politics.rss", "section_title": "devonlive - News", "url": "http://www.devonlive.com/news/news-opinion/how-manage-uk-border-change-1034300", "country": "GB", "title": "How we manage the UK border is about to change quite radically", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T18:13:00.000+02:00", "replies_count": 0, "uuid": "69cc9c23aa9082dc2c3602a631df1c43a9300234"}, "author": "Anne Marie Morris", "url": "http://www.devonlive.com/news/news-opinion/how-manage-uk-border-change-1034300", "ord_in_thread": 0, "title": "How we manage the UK border is about to change quite radically", "locations": [], "entities": {"persons": [{"name": "anne marie morris", "sentiment": "none"}, {"name": "anne marie morris", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}], "organizations": [{"name": "newton", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News opinion How we manage the UK border is about to change quite radically Anne Marie Morris MP says there is an urgent need to invest, modernise, and streamline facilities at the border Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nANNE MARIE MORRIS IS THE CONSERVATIVE MP FOR NEWTON ABBOT AND HAS BEEN SINCE 2010 \nHow we manage the UK border is about to change quite radically and it is an opportunity to update and upgrade our systems to the benefit of the economy. The UK is ranked 5 worldwide in terms of efficiency of customs and borders clearance but more can be done to help encourage and facilitate imports and exports. \nA more efficient border making use of technology would lead to an increase in economic growth and reduce costs to British business. The UK border can become a great asset to businesses and travellers, rather than the burden it is frequently seen to be. \nThere is an urgent need to invest, modernise, and streamline facilities at the border to facilitate the increasing numbers of goods and travellers coming in and out of the UK. The number of people travelling to the UK each year is currently over 123 million, and this is set to double by 2050. Customs declarations are currently made by 141,000 traders. This is expected to rise by 180,000 to a total of 320,000 traders. Read More Devon Conservative MP Anne Marie Morris has whip restored after 'n r in the woodpile' comment \nOf particular importance is supporting these 180,000 traders who will need to make customs declarations for the first time after exit; many of whom will be small and medium-sized enterprises. For border and customs agencies to manage this growing demand, and minimise delays for legitimate travellers and traders, increased collaboration and cross-agency information-sharing is vital as well as utilising modern technology. Anne Marie Morris MP \nSensors, scanners and using data to target interventions and manage risk are all used in some customs systems around the world and are increasingly important to managing modern borders. Emerging technologies must play a part as we enhance our border management as they have the potential to deliver better outcomes for all users of our border. Read More High street giants face store closures following poor Christmas sales \nSingapore is the current world leader in border management and technology, and effectively polices one of the busiest land borders in the world between themselves and Malaysia. They do so safely by making use of facial recognition software and a walk-through system for travellers that detects trace amounts of explosives and narcotics. \nSimilarly, the efficiency of the border between Norway and Sweden relies on shared information databases, online declarations by importers and exporters, and investment in number plate recognition cameras. We should be similarly ambitious and seek to build a modern technologically-advanced border system ready to boost British trade. Read More Inherent unfairness of schools funding formula has not been addressed \nChecks don’t necessarily have to take place at the border. There is a global movement towards the online pre-screening of travellers and goods. For the movement of people, the UK could follow the US’ ESTA system. Introducing this system would have the double benefit of gathering intelligence to help security forces and earning money that can be reinvested back into improving services at the border. Anne Marie Morris MP \nThe USA's ESTA system charges a fee of $14 – equivalent to around £10 – for a \"visa waiver\". The EU is also investigating implementing its own version of charges on travellers. Charging visitors to the UK would raise hundreds of millions a year, which can be reinvested in new technology. \nThe safety and quality standards of goods do not have to be checked at ports or borders either. Checks can be conducted at factories before the goods depart, and much of the paperwork can be digital and carried out online in advance. Exporters can also make better use of the existing Authorised Economic Operators system to become trusted exporters and speed up customs processes. Artificial intelligence could also be used to decide where random inspections should take place on shipments. Read More Unless Brexit talks go well, there could be ANOTHER General Election \nLeaping out at us is an opportunity to use technology to simplify requirements when goods and travellers move across borders; reducing time and costs related to customs administration for imports and exports, as well as reducing the pressure and risk of delays at ports and airports. Crucially, by making use of the best modern technology, we do not need to trade-off security and efficiency. Like us on Facebook ", "external_links": [], "published": "2018-01-09T18:13:00.000+02:00", "crawled": "2018-01-09T18:24:34.035+02:00", "highlightTitle": ""}