{"organizations": [], "uuid": "e15e3257dc1d8573770d105e83575f15ba8a4245", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article1042623.ece/ALTERNATES/s1200/a.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "devonlive - frontpage", "url": "http://www.devonlive.com/news/devon-news/working-better-together-key-theme-1042618", "country": "GB", "title": "Working better together the key theme of 2018 for Tiverton, Mid Devon and the Government", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T15:27:00.000+02:00", "replies_count": 0, "uuid": "e15e3257dc1d8573770d105e83575f15ba8a4245"}, "author": "Lewis Clarke", "url": "http://www.devonlive.com/news/devon-news/working-better-together-key-theme-1042618", "ord_in_thread": 0, "title": "Working better together the key theme of 2018 for Tiverton, Mid Devon and the Government", "locations": [], "entities": {"persons": [{"name": "neil p", "sentiment": "none"}, {"name": "mid devon", "sentiment": "none"}, {"name": "wally burke", "sentiment": "none"}, {"name": "neil parish", "sentiment": "none"}, {"name": "kevin finan", "sentiment": "none"}, {"name": "clive eginton", "sentiment": "none"}], "locations": [{"name": "tiverton", "sentiment": "none"}, {"name": "mid devon", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "government news working", "sentiment": "none"}, {"name": "tiverton & honiton", "sentiment": "none"}, {"name": "rotary club", "sentiment": "none"}, {"name": "tiverton high school", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Working better together the key theme of 2018 for Tiverton, Mid Devon and the Government Neil Parish MP, Clive Eginton, and Wally Burke aim to come together for the benefit of local communities Share Neil Parish speaks with President Kevin Finan Share Get Daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nCouncils in Mid Devon have said they hope to work better together in 2018. \nLooking at the year ahead and how to work better together was the theme of a recent Rotary meeting with government, district and town council leaders present. \nTiverton & Honiton MP Neil Parish expressed his optimism about a Brexit deal and for the prosperity of our local area when he spoke at the Civic Event organised by the Rotary Club of Tiverton. Read More Advanced design skills given boost at Tiverton High School with investment in laser cutting machine \n“I am confident that we will get a deal over Brexit” he said, “and we should bear in mind that negotiations should be in private and not in the public domain”. He considered that Germany, for instance, with a share of 40 per cent of cars sold in Britain, would not wish to relinquish any part of that trade on leaving the European Union. \n“As Chair of the Environment, Food and Rural Affairs Select Committee he had the opportunity to hold the Government and Ministers to account over such areas as the Common Agricultural Policy. With his aim to protect the position of farmers in strong rural areas such as his constituency, he felt, on balance Mid Devon would prosper after Brexit.” Clive Eginton speaks at the meeting \nMr Parish recognised the problems of the NHS and the need for more resources after a 16 per cent patient increase, year on year. On the local front, with, for example the proposed garden village by Junction 28, development at Junction 27 and the plans for Tiverton High School, he was again optimistic for an exciting future. \nHe commended the Rotary Club on its “Ready, Steady, Read with Rotary” project in a number of local primary schools which is making a significant impact on the reading abilities of many local children. He believed the initiative was so important it should be rolled out nationwide. Read More Praise for leisure centre and hospital staff from stroke victim after fall \nClive Eginton, leader of Mid-Devon District Council, present on his 50 birthday, spoke of Tiverton as a pleasant place to live and agreed with Neil Parish that co-ordinating national, district and local authorities – ‘joined up government’ – is the ideal way to proceed. He talked of the council’s policy of building their own council houses, of the improving waste and recycling services, extracting energy from waste products and the success of the Exe Valley Leisure Centre, amongst other successes. \nThe Mayor of Tiverton, Councillor Wally Burke, looked for a future with more employment opportunities in and around Tiverton and spoke of the increased duties of the town council. Looking after areas such as town enhancements, public toilets and CCTV. He stressed that while the town and district councils did not always agree working together was the way to get more done. \n“I like the community spirit which exists here,” he said, “and the Tiverton Rotary Club is an example of that with its involvement in Tiverton High School (the Interact Club) and in helping provide marshals for the Perambulation of the Leat and other occasions.” Wally Burke spoke as the mayor of Tiverton \nThe three civic leaders were thanked by Club President, Kevin Finan, himself a former CEO of the Mid-Devon Council. He listed the many charities and projects, locally, nationally and internationally with which his Club is involved. “These examples of Rotarians serving their community showed how we are helping to fill the gaps left by governments at all levels. No government can do all that is needed today which is why Rotary with it’s ‘Service above Self’ approach plays such a vital role in our community”. \nFor further information about the work of both Interact and Rotary International contact Tiverton Rotary Club Secretary, Andrea Rowe, on roweandrea@me.com or on 01884 258820. The Club’s website is on tinyurl.com/tivertonrotary Like us on Facebook ", "external_links": [], "published": "2018-01-11T15:27:00.000+02:00", "crawled": "2018-01-11T15:45:04.002+02:00", "highlightTitle": ""}