{"organizations": [], "uuid": "f32786444279adf109bcdda171c816d897bd5f99", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14097967.ece/ALTERNATES/s1200/Untitled-design.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/newcastle-united-takeover-friendly-brexit-14097924", "country": "GB", "domain_rank": 21960, "title": "A Newcastle United takeover and a friendly Brexit deal: Six things we need to happen in 2018", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-01T20:00:00.000+02:00", "replies_count": 0, "uuid": "f32786444279adf109bcdda171c816d897bd5f99"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/newcastle-united-takeover-friendly-brexit-14097924", "ord_in_thread": 0, "title": "A Newcastle United takeover and a friendly Brexit deal: Six things we need to happen in 2018", "locations": [], "entities": {"persons": [{"name": "mike ashley", "sentiment": "negative"}, {"name": "amanda staveley", "sentiment": "none"}, {"name": "ashley", "sentiment": "none"}, {"name": "toon", "sentiment": "none"}], "locations": [], "organizations": [{"name": "newcastle united", "sentiment": "negative"}, {"name": "pcp partners capital", "sentiment": "none"}, {"name": "citizens advice", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now \nA takeover between Mike Ashley and Amanda Staveley , who fronts PCP Partners Capital group, is the number one priority on our list. \nWhoever makes up the takeover group (it’s still not clear) let’s hope they have good intentions, and a deep wallet of course. \nWhile it would cause a surge in optimism of Toon fans who feel that Ashley’s 10-year tenure has held the club back, it might also be a relief to non-Toon fans sick to death of reading about it. Read More What stage are Newcastle United's takeover talks at as we go into 2018? 2. Sort out Universal Credit \nIt’s not working in its current form. Ask the people at the sharp end dealing with the fall out from it - at Citizens Advice or at food banks. \nThe reform sees six working-aged benefits rolled into one. A fundamental problem is the six-week delay between the ending of the previous benefit and the receipt of the first UC payment. Pause it. Reduce that six week gap not to the Government’s target of five weeks but to zero. 3. Make a Brexit deal work for the North East Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nIt should involve as much tariff- and barrier-free access to the single market as possible and a guarantee that businesses and workers will continue to be covered by the same regulatory framework for technical, social, environmental and other standards as in other EU countries. \nOf all the regions in England, the North East is the only one to export more goods and services than it imports, with a global trade surplus of over £3.4bn. Trade with the EU has delivered at least 100,000 jobs in the region, equivalent to 8.5% of the total workforce. Let’s not throw it away. 4. Darlington railway station upgrade \nIn September 1825 the world’s first public railway to use steam locomotives opened between Stockton and Darlington. With the 200th anniversary of that event fast approaching, plans were unveiled earlier this year for a £130m revamp of Darlington station. \nIf this is green lit it will enhance rail connections across the North - on the East Coast Main Line, as an integral part of the HS2 network, and across the Teesside. \nIt would provide a massive boost for the economy and provide much-needed jobs. 5. Transport of delight for the North Part of the proposed route for the HS2 high speed rail scheme \nAt the end of the year of some confusion as to what, exactly, the Government’s transport plan for the North was, came a big ray of light at the end of the tunnel. \nA £60bn transport plan including a road tunnel beneath the Pennines and a new rail line from Manchester to the North East was agreed by politicians and business leaders across the North of England. \nIt will be published early in 2018, leading to a 13-week consultation before it is presented to the Government. \nMinisters have already indicated they are keen to press ahead with one of the key proposals, a new ‘Northern Powerhouse’ rail network connected to the HS2 high speed rail line already planned. \nThe plans have been drawn up Transport for the North, the transport body led councils and Local Enterprise Partnerships, which support businesses. It is chaired by John Cridland, a former director general of the Confederation of British Industry, and has an official role advising the Transport Secretary. \nIt says the 30-year plan will cost between £2bn to 2.3bn per year, less that £150 per year for each person in the North. \nLet’s just get it started. Read More 6. A1 upgrade - let’s set a date \nThe preferred options for a £290m scheme to dual the A1 north of Newcastle have unveiled. \nHighways England wants to dual a 13-mile stretch of the road from Morpeth to Ellingham in Northumberland after decades of campaigning by the public which will create a continuous stretch of road between Newcastle and Northumberland. \nIn 2018 can we please have a specific date set when the work will start. Like us on Facebook", "external_links": [], "published": "2018-01-01T20:00:00.000+02:00", "crawled": "2018-01-01T20:35:27.005+02:00", "highlightTitle": ""}