{"organizations": [], "uuid": "549f6db8169ac98ce9e35f8899472586b6f4eaba", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14150335.ece/ALTERNATES/s1200/Jeremy-Corbyn-visit-to-County-Durham.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/labour-leader-jeremy-corbyn-reshuffles-14150254", "country": "GB", "domain_rank": 21960, "title": "Labour Leader Jeremy Corbyn reshuffles his front bench and promotes two North East MPs", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T23:27:00.000+02:00", "replies_count": 0, "uuid": "549f6db8169ac98ce9e35f8899472586b6f4eaba"}, "author": "Tom Eden", "url": "http://www.chroniclelive.co.uk/news/north-east-news/labour-leader-jeremy-corbyn-reshuffles-14150254", "ord_in_thread": 0, "title": "Labour Leader Jeremy Corbyn reshuffles his front bench and promotes two North East MPs", "locations": [], "entities": {"persons": [{"name": "jeremy corbyn", "sentiment": "negative"}, {"name": "pidcock", "sentiment": "none"}, {"name": "adrian don", "sentiment": "none"}, {"name": "blackman-woods", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "laura pidcock", "sentiment": "none"}, {"name": "roberta blackman-woods", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}], "organizations": [{"name": "share labour", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "north west durham", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Labour Leader Jeremy Corbyn reshuffles his front bench and promotes two North East MPs Newcomer Laura Pidcock has been appointed Shadow Minister for Labour while fellow Durham MP Roberta Blackman-Woods also has new role Share Labour leader Jeremy Corbyn and MP Laura Pidcock (Image: PA) Share   Thank you for subscribing!   \nJeremy Corbyn has promoted two North East MPs as part of a reshuffle, appointing a raft of new junior ministers. \nDurham MPs Roberta Blackman-Woods and Laura Pidcock have been given new roles as the Labour leader looks to shake up his front bench. \nParliamentary newcomer Pidcock, who has been a vocal critic of the government’s welfare reform policies, including universal credit, will be the new Shadow Minister for Labour. \nThe MP for North West Durham is one of six new-intake MPs handed junior frontbench roles, with Mr Corbyn making 13 new appointments on Friday night. Roberta Blackman-Woods (Image: Adrian Don) \nRoberta Blackman-Woods, the MP for the City of Durham, will now take up a role as Shadow Minister for Planning. \nMs Blackman-Woods previously resigned as Shadow Housing Minister in May 2016, saying she no longer had confidence in Mr Corbyn’s ability to “inspire vision” or “connect with the public”. \nHowever, in July she rejoined the front bench as Shadow International Development Minister. Read More \nWelcoming her to the now role, her successor as Shadow Housing Minister Andrew Gwynne MP tweeted: “Congratulations to all those new Shadow Ministers appointed by @jeremycorbyn today, including my good mates @lynbrownmp and @robertabwMP. \n“I’m particularly pleased Roberta is joining my @LabourCLG team as Shadow Planning Minister” \nCommenting on the reshuffle, Mr Corbyn said: “I am pleased to make these appointments to strengthen Labour’s frontbench team, which is now a government-in-waiting. \n“I look forward to working with them in their new roles holding the government to account, developing policy to transform our country and, with their shadow secretary of states, preparing to form a government that will deliver for the many not the few.” Laura Pidcock (Image: Newcastle Chronicle) \nThe shake-up of middle-level ranks saw Lyn Brown also made a shadow Treasury minister, Jack Dromey made shadow pensions minister, Paula Sherriff become the shadow minister for social care and mental health, Matt Rodda has responsibility for buses, Judith Cummins, international trade, and Chris Matheson and Laura Smith shadow Cabinet Office. \nDan Carden and Preet Gill are shadow ministers for international development, and Karen Lee becomes shadow fire minister. \nMs Lee replaces Chris Williamson who quit this week after making controversial remarks calling for a doubling of council tax rates for better-off households. \nLabour MP Clive Lewis has also returned to the party’s shadow ministerial team weeks after being cleared of groping allegations. \nThe Norwich South MP, who quit the shadow cabinet last year after opposing Labour’s Brexit stance, has been appointed shadow minister for the Treasury. Like us on Facebook", "external_links": [], "published": "2018-01-12T23:27:00.000+02:00", "crawled": "2018-01-13T00:27:28.007+02:00", "highlightTitle": ""}