{"organizations": [], "uuid": "ebb281de550b410c7ad5890e84725f19e5e500be", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14212747.ece/ALTERNATES/s1200/MAIN-THP_CHP_260118SITV_2053JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "https://www.chroniclelive.co.uk/news/uk-news/piers-morgan-donald-trump-interview-14212724", "country": "GB", "domain_rank": 21960, "title": "Piers Morgan Donald Trump interview: What to expect from the US President in ITV sit-down", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-28T13:32:00.000+02:00", "replies_count": 0, "uuid": "ebb281de550b410c7ad5890e84725f19e5e500be"}, "author": "Agency Staff", "url": "https://www.chroniclelive.co.uk/news/uk-news/piers-morgan-donald-trump-interview-14212724", "ord_in_thread": 0, "title": "Piers Morgan Donald Trump interview: What to expect from the US President in ITV sit-down", "locations": [], "entities": {"persons": [{"name": "piers morgan donald trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "brexit  donald trump", "sentiment": "none"}, {"name": "piers morgan", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "world economic forum", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now Get daily   Thank you for subscribing!   \nDonald Trump has given his first international TV interview since becoming President of the United States. \nThe 71-year-old sat down with Good Morning Britain presenter Piers Morgan at the World Economic Forum in Davos, Switzerland, on Thursday. \nMr Trump knows Piers from their time together on the US version of The Celebrity Apprentice in 2008. \nPiers made it to the final, and eventually won, with Trump telling him: “Piers, you were tactless, ruthless, aggressive, hard, possibly brilliant, you knocked them all out one by one - you win.” \nSo perhaps it isn’t surprising that Piers is the man to secure the President’s first big overseas interview. \nThe interview will be broadcast on Sunday, January 28 on ITV at 10pm. \nHere, we take a look at what you can expect from Mr Trump. On how he would handle Brexit \nDonald Trump says he would have negotiated Brexit with a “different” and “tougher” attitude to Theresa May. \nThe US president said the European Union was “not cracked up to what it’s supposed to be” and claimed he was unsurprised by the result of the Brexit referendum because Britons “don’t want people coming from all over the world into Britain”. \nThe comments could be seized on by Brexiteers to urge the Prime Minister to be harder in Brexit talks, but Remainers could attack Leavers for sharing views with the controversial and divisive president. \nThey could also be seen as a blow for Mrs May following her largely successful meeting with Mr Trump in Davos, Switzerland, on Thursday. Donald Trump on Good Morning Britain with Piers Morgan (Image: ITV) \nPiers Morgan asked Mr Trump if Mrs May was in a “good position” in Brexit talks. \nThe President replied: “Would it be the way I negotiate? No, I wouldn’t negotiate it the way it’s (being) negotiated ... I would have had a different attitude.” \nIn extracts released to the Mail on Sunday, he went on: “I would have said that the European Union is not cracked up to what it’s supposed to be. \n“I would have taken a tougher stand in getting out.” On Prince Harry and Meghan Markle’s wedding \nUS president Donald Trump said he is not aware of any invitation for him to attend Prince Harry’s wedding to Meghan Markle. \nMr Trump replied “not that I know of” when asked by Piers Morgan if he was given an invite. \nHarry’s nuptials with the American actress have captured the imagination of her compatriots and will be seen to strengthen the bond between the UK and the US. \nBut Markle has been a vocal critic of former reality star Mr Trump, backing his rival Hillary Clinton and suggesting before the 2016 election she would leave the US if he won. \nAsked if he would like to go to the royal wedding in May at Windsor Castle’s St George’s Chapel, Mr Trump simply said: “I want them to be happy. I really want them to be happy. \n“They look like a lovely couple.” \nWhen Morgan pointed out she had labelled the billionaire “divisive” and a “misogynist”, he said: “Well, I still hope they’re happy.” Read More Watch Piers Morgan lose it against US gun laws again on Good Morning Britain On his social media activity \nPier Morgan also pressed the president on his social media habit, confirming he often tweets himself but will delegate if he is busy. \nHe said: “Well, perhaps sometimes in bed, and perhaps sometimes at breakfast, or lunch, or whatever. \n“But generally speaking, during the early morning or during the evening, I can do that. \n“But if I’m very busy during the day ... and I’ll sometimes just dictate out something really quickly, and I’ll give it to one of my people to put it on.” On Britain First retweets", "external_links": [], "published": "2018-01-28T13:32:00.000+02:00", "crawled": "2018-01-28T14:19:14.023+02:00", "highlightTitle": ""}