{"organizations": [], "uuid": "f7e15de2bffa38f7702458db752204288e2d0cdf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13137750.ece/ALTERNATES/s1200/JS95166546.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14202943", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast RECAP: North East universities get £2m in Institute of Coding digital skills drive", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T10:05:00.000+02:00", "replies_count": 0, "uuid": "f7e15de2bffa38f7702458db752204288e2d0cdf"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14202943", "ord_in_thread": 0, "title": "Business Breakfast RECAP: North East universities get £2m in Institute of Coding digital skills drive", "locations": [], "entities": {"persons": [], "locations": [{"name": "north east", "sentiment": "none"}], "organizations": [{"name": "m&s bank", "sentiment": "negative"}, {"name": "coreena ford m&s bank", "sentiment": "negative"}, {"name": "institute of coding", "sentiment": "negative"}, {"name": "m&s", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford M&S Bank launches its first mortgage range \nM&S Bank has launched its first mortgage range - with deals aimed at helping people onto the property ladder as well as money being donated to housing charity Shelter for home loans purchased. \nThe deals include a first-time buyer range, as well as mortgages for home movers and home owners looking to re-mortgage. \nFixed and tracker options will be available. \nThe bank said it will bring the “M&S-standard service” to its mortgages. \nTo support people buying their first home, up to four borrowers planning to live in a property will be able to take out a mortgage together. \nFirst-time buyers are also being offered £1,000 cashback as well as a free valuation. \nExamples include a two-year fixed rate at 2.09% including the £1,000 cashback and free valuation, for someone with a 10% deposit to put down. Borrowers will need to stump up a £995 fee for this deal, although a “fee saver” option with a higher mortgage rate is also available. \nM&S Bank has also said it will donate £25 to Shelter for every mortgage purchased. \nThe bank said that, with families often looking to support loved ones financially, it is also offering customers re-mortgaging with M&S Bank the option to consider additional borrowing, at the same rate and term as their M&S Bank mortgage. This would give them a lump sum which could be “gifted” to someone else to use towards a house deposit. (Image: Tim McGuinness) KEY EVENT 'UK economy could start to pick up' - Mark Carney, Bank of England governor \nBritain’s economy has the potential to start catching up with the rest of the world as the outcome of the Brexit negotiations becomes clearer, the governor of the Bank of England has said. \nMark Carney said there was the prospect of a “conscious recoupling” after seeing the international economy pull strongly ahead. \nThe UK, he said, was suffering from a short-term “Brexit effect” - with the economy expected to be down 2% at the end of 2018 compared with what had been expected before the time of the EU referendum in 2016. \nHowever, he said firms which had been putting off investment decisions could start investing again as greater clarity emerges over the likely Brexit settlement. \n“What is happening in the UK is effectively the Brexit effect in the short term. And I would underscore ‘in the short term’,” he told BBC Radio 4’s Today programme. \n“The world economy is accelerating and we haven’t seen that yet. But there is the prospect this year, as there is greater clarity with the relationship with Europe and subsequently with the rest of the world, for a conscious recoupling of the UK economy with the global economy.” \nMr Carney said the deeper the relationship with the EU after Brexit, the better it would be for the British economy. \n“The deeper the relationship with Europe, the deeper the relationship with the rest of the world - and the two are obviously connected, it is a complicated set of negotiations - the better it is going to be over time for the UK economy,” he said. \nHowever, whatever the eventual outcome of the negotiations, he said the Bank had taken steps to ensure that the UK’s financial sector was well-placed to cope. \n“What we have been doing is to make sure that we are in a position as the UK, with this huge financial sector, that we can withstand any outcome and we can take advantage of any outcome,” he said. \n“The Government doesn’t have to worry about the impact on the financial sector because it will be able to withstand and support the economy.” Governor of the Bank of England, Mark Carney 9.20 Coreena Ford Wetherspoon chair Tim Martin apologises following steak recall. . .and steak night is back next week \nThe chairman of Wetherspoon has apologised to customers over a steak recall and said it has dropped its meat supplier, Russell Hume. \nSirloin, rump and gammon steak were pulled from the menu of the chain’s 900 UK and Irish pubs on Tuesday after the supplier said there was a “mislabelling” issue. \nWetherspoon said it has cancelled its contract with Russell Hume and is now sourcing its steaks from new suppliers. \nChairman Tim Martin said: \nFirstly we wish to apologise to our customers for the inconvenience caused to them. However, our decision to stop serving steak from Tuesday January 23, despite limited information from the supplier, was the correct one. \nSteak is one of the most popular dishes on our menu, and we serve around 200,000 per week on average, about half of these on our extremely popular Tuesday Night Steak Club. \nWe have now sourced alternative suppliers and our pub staff are once again looking forward to serving the steak dishes from Tuesday January 30 onwards. \nIn a statement after the steak recall, Russell Hume, which was also supplying Jamie Oliver and Greene King, said: “The product recall was a precautionary measure because of mislabelling.” But the Food Standards Agency (FSA) said it was investigating the supplier over “serious non-compliance with food hygiene regulations”. \nThe FSA said in a statement that, following an unannounced inspection of Russell Hume’s Birmingham site earlier in January, it became aware of the hygiene issues. The FSA said there was no indication that anyone had become ill from eating Russell Hume meat. Wetherspoons' steak Coreena Ford Experts cautious over GDP growth \nBritain’s economy is forecast to have held up in the fourth quarter - but some experts predict the unexpected shutdown of a major North Sea pipeline will drag on growth. \nConsensus figures show economists are widely expecting gross domestic product (GDP) to have expanded by 0.4% between October and December - in line with the third quarter - when official figures are released later today. \nBut some experts are warning that the figure could be lower due to a drop in industrial production after the North Sea Forties pipeline was temporarily shuttered for the bulk of December. \nIt came after a routine inspection found a hairline crack in the pipe just south of Aberdeen last month, prompting emergency repairs that stopped the flow of oil and gas from platforms feeding into the system. \nSamuel Tombs, chief UK economist at Pantheon Macroeconomics, said it was one of the factors likely to have knocked down GDP growth to 0.3%. “Data up to November suggest that construction output plunged, subtracting about 0.1% from GDP growth. \nThe strong recovery in industrial production, meanwhile, likely was brought to a halt in December by the closure of the Forties oil pipeline in the North Sea. (Image: Getty Images Europe) Coreena Ford US trade body to make ruling in Bombardier imports row \nA US trade body is due to make its final ruling on the Bombardier aircraft imports dispute. \nThe Trump administration has threatened to impose duties of 292%. \nUnions have called on the US International Trade Commission (ITC) to set aside that decision when it meets on Friday to discuss whether rival manufacturer Boeing has suffered injury or loss from Atlanta-based Delta Airlines’ order of Bombardier’s C Series passenger jets. \nIf the ITC finds in Boeing’s favour, the tariffs will be applied, undermining thousands of jobs in Belfast where the C Series wings are produced. \nThe ITC’s role is to determine whether the aircraft manufacture industry in the US is damaged by imports that the administration believes are being sold too cheaply. \nIf it concurs, the Secretary of Commerce will order tariffs, which will be enforced by the US Customs Service. Bombardier has received large sums from government administrations in the UK and Canada as part of the development of the C Series. \nIt has argued the Commerce Department’s tariff threat ignores long-standing business practices in the aerospace industry, including launch pricing and the financing of multi-billion dollar aircraft programmes. \nBoeing has said its business was damaged because Bombardier received illegal government subsidies, dumping the C Series in the US through the cut-price 2016 Delta sale of 75 jets. A US trade body is due to make its final ruling on the Bombardier aircraft imports dispute 8.55 Coreena Ford Bank o England IT glitch fixed \nA tech failure at the Bank of England that hit wholesale transactions has been fixed, although Threadneedle Street warned that the glitch will result in delays. \nThe Bank admitted last night that its IT system was suffering “intermittent technology communication problems” following a “regular internal update”. The problem impaired the central bank’s ability to process a limited number of transactions for wholesale counterparties, leading it to implement “workarounds” to enable the Bank to operate as normal. \nHowever, the Bank has just announced that the issue has been fixed overnight, but said that wholesale counterparty transactions may be delayed as it plays catch up. \nA statement read: \nTechnology communications problems reported by the Bank yesterday have been fixed overnight. Systems are now working normally, although there is some catch-up work to complete. \nWe expect to be able to process business as normal today, but in order to catch up from yesterday, wholesale counterparty transactions may be dealt with somewhat later in the day than usual. Bank of England in London (Image: PA) 8.48 Coreena Ford tombola's £7m headquarters nears completion \nOnline gaming giant tombola is making a dramatic change to the Sunderland skyline as construction of its new headquarters nears completion. \nThe major employer is building a new £7m head office at Wylam Wharf next to the company’s current headquarters, which is a former bonded warehouse dating from the late 1700s. \nBuilding work has entered its final 20 weeks, having started in the spring of 2017. \nThe structural steelwork and placement of the giant concrete floor slabs is complete, and work on the wall and roof cladding, brickwork and windows is well under way. \nPhil Cronin, tombola chief executive officer, said: “We’re delighted with the progress on site and excited to see our new head office really taking shape now. \n“The construction is proving to be a real motivator for our employees who can’t wait to move in later this year in time for the arrival of the Tall Ships. 8.37 Coreena Ford Businesses asked to support 'hidden entrepreneurs' in developing countries \nNorth East businesses are being called on to support “hidden entrepreneurs ” in developing countries, by donating to an international development charity. \nGateshead-based Traidcraft Ex­­change works to support entrepreneurs in developing countries such as Bangladesh, Kenya and Senegal by funding training programmes for those wanting to start their own businesses. \nCompanies across the North East are being asked to donate to the Traidcraft Hidden Entrepreneur appeal, with all donations being matched by a contribution from the Department for International Development. \nRobin Roth, Traidcraft Exchange’s chief executive, said: “In a developing country, a funded business training session could ignite someone’s potential and change their quality of life. A small donation could pay for basic tools for their business or help them to branch out into new markets. \n“By donating to the appeal, people can help entrepreneurs learn the skills they need to turn their potential into profit and use that profit to feed their families and educate their children. \n“There’s the added advantage that every pound donated by the public before April 11 will be matched by the UK government, enabling us to help double the number of budding entrepreneurs in Kenya, Bangladesh and Senegal.” (L - R) Kate Dixon and Robin Roth, from Traidcraft Exchange, with Eleanor O’Neill and Andy Stephenson (Image: (C)The Bigger Picture Agency Ltd) 8.30 KEY EVENT 'No Deal' Brexit will leave question mark over millions of jobs, study shows \nA ‘no deal’ Brexit could leave more than 2.5 million jobs vulnerable or at risk, a new study has said. \nSectors such as professional, scientific, administrative and technical services are likely to be the hardest hit in such a scenario which could cost the economy as much as £140 billion annually, according to The UK In A Changing Europe think tank. \nThe research found that financial services is one of the least vulnerable sectors to Brexit because much of it is already highly globalised. \n“Even when weighting the low Brexit exposure levels of the financial services, with their overall contribution to the UK economy, the effect on the UK’s loss of EU market access appears to be almost entirely negligible,” the organisation stated. \nProfessor Raquel Ortega-Argiles, who led the research, said: \nThe results suggest that while financial and manufacturing services are very important, the UK Government’s emphasis on securing special UK-EU agreements for City-based financial markets may be misplaced, and that emphasis should be placed on helping the other much more exposed sectors which do not have strong lobbying power. \nThe sectors that are going to be hardest hit by a ‘no deal’ Brexit are a range of services industries. They are parts of the economy who don’t lobby Westminster and rarely get the attention they need. \nThe report said a ‘no deal’ situation would make the UK’s productivity problems worse. \nIt stated: “Workers in the jobs at risk are on average slightly more productive than the average British worker - so Brexit is likely to exacerbate the UK’s productivity problems.” EU and Union flags (Image: PA) 8.22", "external_links": [], "published": "2018-01-26T10:05:00.000+02:00", "crawled": "2018-01-26T14:32:54.034+02:00", "highlightTitle": ""}