{"organizations": [], "uuid": "7df27466babb65e29782853290459680891ebe1c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14137148.ece/ALTERNATES/s1200/HCR_NEC_040118events_03.jpg", "site_section": "http://www.thejournal.co.uk/culture/?service=rss", "section_title": "nechronicle - What's On", "url": "http://www.chroniclelive.co.uk/whats-on/whats-on-news/newcastle-video-game-convention-rugby-14137102", "country": "GB", "domain_rank": 21960, "title": "Newcastle video game convention, a rugby club for women, money managing course and more!", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T18:21:00.000+02:00", "replies_count": 0, "uuid": "7df27466babb65e29782853290459680891ebe1c"}, "author": "Heather Koernich", "url": "http://www.chroniclelive.co.uk/whats-on/whats-on-news/newcastle-video-game-convention-rugby-14137102", "ord_in_thread": 0, "title": "Newcastle video game convention, a rugby club for women, money managing course and more!", "locations": [], "entities": {"persons": [{"name": "helen watson", "sentiment": "none"}], "locations": [{"name": "samso", "sentiment": "none"}, {"name": "gateshead clubhouse", "sentiment": "none"}, {"name": "worcester green", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "central bar", "sentiment": "none"}, {"name": "gateshead housing company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Newcastle video game convention, a rugby club for women, money managing course and more! Your community events including events in Gateshead, Newcastle and Durham Share Getting ready to quiz at Samso's Football Quiz, Central Bar. (Image: UGC TNE) Share Get what's on   Thank you for subscribing!   \nBelow is a list of this week's Tyne & Wear community events written by you. To get your event included, simply fill out the form at www.chroniclelive.co.uk/yourevents How to manage your money course in Gateshead \nThe Gateshead Housing Company is helping residents to manage the financial pressure of Christmas, with a free ‘How to manage your money’ course at Gateshead Clubhouse, Worcester Green, NE8 1NH on Thursday 25 January, from 10am to 1pm. \nInvolvement and diversity lead Helen Watson said: “This is a great way for people to find out more about how to budget, especially after the Christmas period. \n“We know how the current economic climate has put a strain on residents’ finances so this course will advise on prioritising bills, and what to do if you are in rent arrears. \n“Attendees can also find out about credit and borrowing, saving on energy bills, and the help available from the housing company. \n“Our priority as a landlord is to help our tenants to sustain their tenancy and this course will help address some of the other pressures that tenants can face.” \nThe course is part of the company’s Moving Forward training programme, and is open to anyone who lives in Gateshead. Support to attend is available, including transport and interpreters.Residents can find out more about the Moving Forward training programme and other ways to get involved by emailing involve@gatesheadhousing.co.uk or by calling 0191 433 5357. Rugby club for women across the North East \nWhat: Inner Warrior Camp \nWhen: Thursday 25th January 2018 at 6-7pm girls (11-17 years) and 7-8pm social ladies. \nWhere: Darlington Mowden Park Rugby Club \nMore information: “As women’s rugby is become increasingly popular, assisted by the success of the England team, we’d love to attract as many people as possible to this event. Our team members are not only Darlington-based as some travel in the North East for training! \n“We play both touch & contact rugby, so come down & give it a try! We’re a friendly & sociable group, & we’d love as many people to come down as possible. No experience required and those wishing to return back to rugby area also welcome! Get fit & make new friends.” \n- Girls U13, U15 and U18: Thursdays \nat 6-7.30pm; and Sunday’s 1.30 -3pm. \n- Family Touch Monday 6-7pm. \n- Women Social Touch Team Monday 7-8pm. \n- Women Social Contact Team Thursday 7.30-8.30pm Read More Video game convention in Newcastle \nWhat: Video gaming convention run by a Northumbria University student union society. \nWhen: 20/1/2018 - 10am to 5pm. \nWhere: Northumbria University Students’ Union, 2 Sandyford Road, NE1 8SB, Newcastle upon Tyne . \nOrganised by: NSU CVGS. \nWhat: Digital photography classes \nWhen: starting on Tuesday 16th January 2018 and Thursday 18th January 2018 \nWhere: Meeting Room of Carrville Methodist Church, High Street, Carrville, Durham , DH1 1BQ from 7pm until 9pm \nMore information: The classes will cost £60 for 10 classes. Football quiz in Gateshead Getting ready to quiz at Samso's Football Quiz, Central Bar. (Image: UGC TNE) \nWhat: Samso’s Football Quiz #20 at Central Bar \nWhen: Saturday 3rd February 2018 at 8pm \nWhere: The Central Half Moon Lane, Gateshead , NE8 2AN \nMore information: Reckon you know your Alex Iwobi from your Tomi Ameobi? Come and prove it at the longest-running football quiz in the region which puts even the biggest football anorak through their paces. Teams are 1-6 players and costs £2 per player. Read More Service of remembrance in West Rainton \nWhat: Service of remembrance \nWhen: Sunday, January 21 at 2pm \nWhere: St Mary’s Church West Rainton \nMore information: It will be a short service (approx 45 minutes) of readings, reflections, prayers, hymns and poems. There will be some quiet time, and the opportunity to light a candle in memory of a loved one. Everyone is welcome to join us, and refreshments will be served after the service. Worldwide collaborative textile arts venture in Durham \nCommunity groups, individuals, schools and artists have been working together for more than a year in a worldwide collaborative textile arts venture which will be displayed for the first time at Durham Cathedral in 2018 from January 25-29 to coincide with World Holocaust Day. \nCoxhoe Quilt Group is among those who have taken part. \nThe 70273 project, which commemorates the people with disabilities killed during “Aktion T4” by the Nazi regime in Germany during 1940-1941, was begun by Jeanne Hewell-Chambers from America, and Jeanne and her husband will come to Britain prior to the exhibition to meet some of the people who have played a major part in bringing the project to the North-East. \nThe project gets its name from the 70,273 disabled men, women and children recorded as being killed under the Nazi regime. Three doctors inspected the medical records of each person and if two doctors marked a cross on the records, the person was deemed to be “unworthy of life” and an “economic burden”. People were then killed in a variety of ways and were often murdered within hours. \nTo commemorate each individual killed in this brutal manner, Jeanne has invited people worldwide to create a single white textile square with two red crosses, to reflect the doctors’ crosses on the medical records. These are being joined together to make quilts which will then tour worldwide to raise awareness and as a learning tool. To date, almost one-third of the total has been achieved. Concert at Durham Miners’ Hall \nWhat: Richard Dawson and Onsind. With a clutch of critically acclaimed albums under his belt, the performance by Richard in the magnificent Council Chamber, known as ‘The Pitman’s Parliament’, marks a new chapter in terms of cultural activity in this magnificent Grade-II listed building. Support comes from Durham band Onsind. Tickets are £10. \nWhen: Friday February 2 at 7.30pm. \nWhere: Durham Miners Hall, Redhills, Durham City, DH1 4BE. Community event success in Kenton Staff and committee of Kenton Park Community Association plus local volunteers dressed as elves ready for Santa's arrival (Image: UGC TNE) \nKenton Park Sports Centre duty manager Fran Richardson said: “Our fantastic community Christmas event was held on Thursday, December 14, called Kenton’s Christmas Cracker. \n“The event took place at Kenton Park Sports Centre where over 80 local families enjoyed various activities including personalised Santa’s Grotto visits, live reindeer, funfair rides, inflatables and festive arts & crafts. \n“This event was kindly supported by local businessman Rob Armstrong.” Public lecture at Newcastle University \nWhat: Public lecture with Danny Dorling called The Global Race. \nDanny will discuss Brexit, racism, equality, immigration, Europe, equality, trust and understanding. The event aims to celebrate the 50th anniversary of Martin Luther King Jr’s visit to Newcastle University. \nWhen: 6.30pm, January 29. \nWhere: Herschel Building, Newcastle University , NE1 7RU. \nOrganised by: Newcastle Geography Society.", "external_links": [], "published": "2018-01-10T18:21:00.000+02:00", "crawled": "2018-01-10T19:14:28.021+02:00", "highlightTitle": ""}