{"organizations": [], "uuid": "43456c9eddab064cc99273d35dfd01a6519ecf58", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article1124254.ece/ALTERNATES/s1200/20180126_113404.jpg", "site_section": "http://www.westernmorningnews.co.uk/editorschoices.rss", "section_title": "devonlive - frontpage", "url": "http://www.devonlive.com/news/devon-news/anti-plastic-protesters-unwrap-plastic-1124093", "country": "GB", "title": "Anti-plastic protesters unwrap plastic packaging at the checkout", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T16:55:00.000+02:00", "replies_count": 0, "uuid": "43456c9eddab064cc99273d35dfd01a6519ecf58"}, "author": "Joe Bulmer", "url": "http://www.devonlive.com/news/devon-news/anti-plastic-protesters-unwrap-plastic-1124093", "ord_in_thread": 0, "title": "Anti-plastic protesters unwrap plastic packaging at the checkout", "locations": [], "entities": {"persons": [{"name": "jeremy bell", "sentiment": "none"}, {"name": "simon", "sentiment": "none"}, {"name": "morrisons", "sentiment": "none"}], "locations": [{"name": "north devon", "sentiment": "none"}, {"name": "newton", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "bideford", "sentiment": "none"}], "organizations": [{"name": "morrisons", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nAnti-plastic protesters gathered outside a North Devon supermarket this morning to encourage people to leave unnecessary plastic packaging at the checkout. \nThe idea is to leave the plastic packaging at the till to force supermarkets to deal with it, in an effort to highlight the sheer amount of unnecessary plastic on supermarket shelves. \nProtesters gathered outside Morrisons supermarket in Bideford at 10.30am today holding signs and handing out information to shoppers. Protesters outside Morrisons in Bideford. Read More Stolen caravan found undamaged in Newton Abbot \nThe supermarket’s general manager, Simon, gave protesters outside his store a warm welcome, handing out tea, coffee and biscuits. \nProtest organiser Jeremy Bell said: “Millions of birds and fish are dying because of our corporate government’s attitude to plastic. \n“If government is neglecting its duty the people will not neglect theirs. Demonstration organiser Jeremy Bell. Read More Flu deaths in the UK three times higher than last year and children are more affected than adults \n“Today we’re here outside Morrisons in Bideford to ask customers to rip off all the unnecessary plastic from their shop and leave it behind at the checkout. \n“Birds and fish are eating plastic which kills so rip it off and leave it at supermarket tills. \n“Everybody can do something to change attitudes, leaving your plastic packaging for the supermarkets to deal with is just one thing everybody can do.” \nAccording to information handed out by protesters 100,000 marine animals and one million sea birds die every year, killed by plastic pollution. Protesters would like to see milk sold in glass bottles. Read More Prisoner gets stuck in razor wire for three hours after trying to escape Exeter Prison \nProtesters were also keen to point out the many alternatives to using plastic, storing milk in glass bottles for example or using plastic free versions of coffee cups, takeaway boxes and plates. \nA spokesperson for Morrisons said: “We have already introduced a number measures to reduce plastic usage and we’re looking at others and we are completely open-minded about the government’s proposals.” \nThe supermarket is phasing out plastic drinking straws which are sold separately to drinks and intends to replace them with papers straws. \nMorrisons is also phasing out plastic stem cotton buds and replacing them with paper stem cotton buds. Read More \nEarlier this month the government unveiled a 25 year Environment Plan, setting out how it will improve the environment over the next three decades. \nThe government plan includes commitments to: \n- A crackdown on plastics by eliminating all avoidable plastic waste. \n-Help wildlife thrive by creating 500,000 hectares of new habitat for endangered species, supporting farmers to turn fields into meadows and other habitats, replenishing depleted soil and providing £5.7 million to kick start a new Northern Forest. A protester holding just some of the \"unnecessary plastic\" removed during the demonstration. Read More Pictures show horse being hoisted from boggy field after getting stuck \n-Be a world leader in environmental protection by investigating the feasibility of an anti-poaching taskforce to tackle the illegal wildlife trade, help developing nations combat plastic waste and extend the UK’s network of marine protected areas. \n-Deliver a “green brexit” by consulting on a new environmental watchdog to hold government to account on green issues. \nEnvironment Secretary Michael Gove said: “Respecting nature’s intrinsic value and making sure we are wise stewards of our natural world is critical if we are to leave the environment in a better state than we inherited it. Protesters were given tea, coffee and biscuits by members of staff. Read More Tiny dog with massive ears is on the hunt for a new home \n“Our Environment Plan sets out how over the next 25 years we will radically reduce the waste that is choking oceans and rivers, cleanse our air of toxic pollutants and create new habitats for our most precious wildlife to thrive. \n“Through this plan we will build on our reputation as a global leader in environmental protection, creating an environment everyone can enjoy and helping the next generation flourish.” Like us on Facebook ", "external_links": [], "published": "2018-01-26T16:55:00.000+02:00", "crawled": "2018-01-26T17:14:25.042+02:00", "highlightTitle": ""}