{"organizations": [], "uuid": "72f0d4bb328c7fb2e9ce4f3c867049373d5018c4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14159566.ece/ALTERNATES/s1200/Dipu-Ahad-on-terror.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/donald-trump-allies-arent-welcome-14159272", "country": "GB", "domain_rank": 21960, "title": "'Donald Trump and his allies aren't welcome': Fury at American ambassador's Tyneside visit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T20:28:00.000+02:00", "replies_count": 0, "uuid": "72f0d4bb328c7fb2e9ce4f3c867049373d5018c4"}, "author": "Hannah Graham", "url": "http://www.chroniclelive.co.uk/news/north-east-news/donald-trump-allies-arent-welcome-14159272", "ord_in_thread": 0, "title": "'Donald Trump and his allies aren't welcome': Fury at American ambassador's Tyneside visit", "locations": [], "entities": {"persons": [{"name": "dipu ahad", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "robert wood johnson", "sentiment": "none"}, {"name": "elswick", "sentiment": "none"}, {"name": "curt taylor", "sentiment": "none"}, {"name": "ahad", "sentiment": "none"}, {"name": "sean bullick", "sentiment": "none"}, {"name": "woody johnson", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "africa", "sentiment": "none"}, {"name": "tyneside", "sentiment": "none"}], "organizations": [{"name": "newcastle chronicle", "sentiment": "negative"}, {"name": "martin luther king", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "newcastle university", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Councillor Dipu Ahad (Image: Newcastle Chronicle) Share Get daily   \nThe American ambassador touched down on Tyneside on Monday - but his visit provoked fury from one Newcastle councillor. \nAmbassador Woody Johnson visited Newcastle to cement links with business improvement firm NE1, and marked Martin Luther King day at Newcastle University. \nElswick councillor and campaigner Dipu Ahad, said the city should have refused to welcome the ambassador in protest at his boss’s controversial views and statements. The American Ambassador to the UK, Robert Wood Johnson, right, at the Martin Luther King statue at Newcastle University with Sean Bullick, chief executive of NE1 (Image: Curt Taylor) \nHe said: “We need to make it clear that Donald Trump ’s views, his views on women, on the Muslim community, the way he has recently described Africa, are bang out of order, and not acceptable for the leader of the free world. \n“Woody Johnson is an ally of Donald Trump’s and if he is not condemning those views, he is complicit in them.” \nCoun Ahad said he believes that speaking out against such visits could have a genuine impact on US representatives’ plans. \nHe said: “There will be many people in the city who will agree with me. We saw last week the cancellation of Donald Trump’s visit to the UK, and I believe that was because of the fear he had of mass protests across the UK. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \n“We need to continue to make it clear that he and his allies, anyone with his views, is not welcome. \n“Of course, we can’t ban anyone, but the strong message that he and his allies are not welcome here might have an impact on future visits.” Read More Cyst in Tyneside dog's ear looks like US president Donald Trump \nDonald Trump claimed on Twitter last week that his UK visit had been cancelled because he didn’t like the new embassy building in London. \nCoun Ahad added that he was “frustrated” that the ambassador’s controversial trip had been organised through NE1, as opposed to through civic leaders at the city council. Read More MPs from all parties accuse Donald Trump of spreading hatred \nBut organisers insisted the visit was solely focused on business opportunities, and had nothing to do with the president. \nNewcastle NE1 Chief Executive, Sean Bullick, said: “This visit, rather than being a commentary on the presidency, is a chance to strengthen our links with the United States, a country that provides 40% of the region’s direct foreign investment, so that our businesses can make the most of trade opportunities post-Brexit.” Like us on Facebook", "external_links": [], "published": "2018-01-15T20:28:00.000+02:00", "crawled": "2018-01-15T21:14:43.013+02:00", "highlightTitle": ""}