{"organizations": [], "uuid": "65a79c0446c169d4f6877eadda5c3778548f6119", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14178067.ece/ALTERNATES/s1200/CFR_NJL_190118bike_01JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/meet-gateshead-father-son-road-14177721", "country": "GB", "domain_rank": 21960, "title": "Meet the Gateshead father and son on the road to success with their 'boutique' bikes'", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T16:33:00.000+02:00", "replies_count": 0, "uuid": "65a79c0446c169d4f6877eadda5c3778548f6119"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/meet-gateshead-father-son-road-14177721", "ord_in_thread": 0, "title": "Meet the Gateshead father and son on the road to success with their 'boutique' bikes'", "locations": [], "entities": {"persons": [{"name": "ian", "sentiment": "positive"}, {"name": "trevor", "sentiment": "positive"}, {"name": "ian hughes", "sentiment": "none"}, {"name": "share mark wharton", "sentiment": "none"}, {"name": "trevor hughes", "sentiment": "none"}], "locations": [{"name": "gateshead", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "hughes", "sentiment": "none"}, {"name": "vielo sports ltd", "sentiment": "none"}, {"name": "crest photography", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Meet the Gateshead father and son on the road to success with their 'boutique' bikes' Ian and Trevor Hughes run Vielo Sports, which specialises in high-end cycles for the serious leisure rider Share Mark Wharton, left, of NEL with Trevor and Ian Hughes at Gateshead-based Vielo Sports (Image: Crest Photography) Share Get business   Thank you for subscribing!   \nA father and son are setting out on the road to commercial cycling success after launching a range of high end bikes. \nIan and Trevor Hughes are the management team behind Gateshead-based Vielo Sports Ltd, bringing with them 20 years experience of working with leading British and European cycling brands. \nThe pair has been approached by a number of bike manufacturers about acting as their UK distributor. \nHowever, after examining the market for ‘Indy boutique’ cycles, Ian and Trevor decided the time was right to launch their own range of technology-led bikes, which are aimed at the serious leisure rider. \nWhile the focus in its first year will primarily be on the domestic market, enquiries for the new range have already been received from as far afield as New Zealand and Asia, as well as from mainland Europe. \nThe first Vielo model, the V+1, is a carbon-framed off-road gravel bike that is also suitable for on-road use, and it will be followed later in the year by a new range of three specialist road bikes. \nThe complete range will be sold through a network of independent specialist bike retailers across the UK, as well as through their website. Read More Gateshead fish'n'chip shop supplier warns Brexit will batter market conditions \nVielo Sports, named as Specialist Distributor Of The Year at the BikeBiz Awards 2015, worked with NEL Fund Managers in 2016 to secure a £250,000 Finance For Business North East Growth Fund investment to support the business’s continuing development. \nThe North East fund management firm has now provided further advice around the financial planning and preparations for the launch of the new bike range. \nTrevor Hughes said: “We looked at a range of options for the next stage of the company’s development, and felt that using our industry and design experience to launch our own bike range was the natural thing to do. \n“Vielos are aimed at third or fourth time buyers who know what they want out of a bike, and who value the type of high end design, materials and detailing that goes into the products we’ve developed. \n“We’ve had fantastic feedback from the independent retailers that we’ve shown the new range to so far, as well as more than 2,000 unique visitors to our website in the first 24 hours after we first put it on view, and the potential for putting a new high quality North East name on the cycling map is there for all to see. \n“We’ve had a positive relationship with the NEL team over the last couple of years, and their guidance has been invaluable in helping us put all the structures we need in place to get Vielo bikes out into the marketplace.” \nMark Wharton, portfolio executive at NEL Fund Managers, added: “Ian and Trevor have the market insight, technical knowledge and industry relationships to make Vielo Sports bikes a huge success, and we’re excited about seeing what they can achieve.” Like us on Facebook", "external_links": [], "published": "2018-01-19T16:33:00.000+02:00", "crawled": "2018-01-19T16:47:07.012+02:00", "highlightTitle": ""}