{"organizations": [], "uuid": "30c2567e9aa43483a2ac3fbe0127dc9ad9d73918", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14124995.ece/ALTERNATES/s1200/JS124631005.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14124997", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Mothercare issues profit warning after sales plunge during critical Christmas", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T10:05:00.000+02:00", "replies_count": 0, "uuid": "30c2567e9aa43483a2ac3fbe0127dc9ad9d73918"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14124997", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Mothercare issues profit warning after sales plunge during critical Christmas", "locations": [], "entities": {"persons": [{"name": "baldev ladhar", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "north shields", "sentiment": "none"}, {"name": "northallerton", "sentiment": "none"}, {"name": "norhamptonshire", "sentiment": "none"}], "organizations": [{"name": "mothercare", "sentiment": "negative"}, {"name": "ladhar leisure", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford Gateshead security firm The Protector Group creates 70 jobs after winning HS2 work \nA Gateshead security firm created 70 new jobs last year after winning a major contract to work on the HS2 rail project. \nFollowing the contract win, the Team Valley-headquartered The Protector Group opened an office in Hull and a branch near Watford to allow it to carry out the additional work. \nThe expansion led to the Team Valley-headquartered firm creating 50 new jobs. \nDuring the year Protector also moved its Hartlepool operation to Billingham, allowing it to take on an additional 20 new members of staff. The move was made after Protector won a £4m contract with a multinational petrochemical company to provide 800 hours a week of manned guarding cover for its Teesside operation. \nOverall the firm now more than 130 people in Teesside. Ken Slater, CEO of The Protector Group (Image: Unknown) 9.00 Coreena Ford North Shields funeral directors gets first female MD in more than 200 years \nA North Shields funeral directors has appointed its first female managing director in more than 200 years. \nE Turnbull & Son, based on Albion Road, is now being led by Jane Broadhead, the first woman to head up the sixth-generation family business, after the semi-retirement of her father, 83-year-old Jim Turnbull. \nAlong with Ms Broadhead’s appointment the firm has also promoted Sharon McRoberts to the position of manager. Ms McRoberts is the first woman to hold a manager position at the company, having previously worked as a funeral director. \nCommenting on the change in leadership, Ms Broadhead said: “We have appointed a new female manager and we felt it was appropriate to make me managing director.” \nShe added: “Having women in the business brings a new dimension to it. It is nice to have men and women working side by side in this day and age. At one time it would have been all men.” E Turnbull & Son funeral directors (Image: Unknown) 8.50 Coreena Ford Newcastle recruitment firm Nigel Wright falls into the red after \"soft\" summer \nRecruitment group Nigel Wright fell into an operating loss after what it described as “very soft results” in a summer period. \nAccounts for the Newcastle recruitment consultancy for the year ending April 30, 2017, highlighted slow trading in the summer of 2016 and also said that adverse exchange rates after the Brexit referendum for its international operations contributed to an operating loss of £554,000 following a £216,000 profit a year earlier. \nThe firm also reported £425,000 of exceptional costs as turnover came in broadly flat at £16.4m, down from £16.6m 12 months earlier. Losses before taxation broadened to £2.4m. \nCEO Paul Wilson said the results were “somewhat of a bitter-sweet experience” and said performance in the last quarter of the accounting period and afterwards had seen the firm recover. \nHe said: “Although it was 18 months ago now, the summer period of 2016 really impacted the 12-month figures to April 2017 which, as a result, were below our expectations. \n“Despite that slow period, we knew it was just a blip and continued to invest in all our markets. Our strong performance and results throughout 2017 are a clear testament to this.” Paul Wilson, CEO at Nigel Wright Group (Image: Nigel Wright Group) 8.42 Coreena Ford Richard Branson comes out fighting over East Coast rail deal \nVirgin boss Sir Richard Branson has come out fighting over the deal with the Government to terminate his firm’s franchise of the East Coast rail line. \nSir Richard said Virgin Trains East Coast - which runs the service linking Newcastle other North East towns with London and Edinburgh - had lost £100m and blamed delays to line upgrades that had been promised by Network Rail, as well as a worsening of the UK economy. \nTransport Secretary Chris Grayling has come under fire after announcing in November that a new East Coast Partnership will take on responsibility for both intercity trains and track operations on the route in 2020. \nVirgin Trains East Coast, a partnership between Stagecoach and Sir Richard’s Virgin, had agreed to pay the Government £3.3bn to run the service over eight years until 2023 and the early termination of the contract is estimated to have saved the firms around £2bn. \nAfter resigning as chairman of the National Infrastructure Commission last week, former Transport Minister Lord Adonis lashed out at what he said was a taxpayer-funded bailout for Virgin and Stagecoach that would cost hundreds of millions of pounds. Sir Richard Branson unveils the Virgin Azuma – the first of Virgin Trains' new fleet of trains which is set to revolutionise travel on the East Coast from 2018 (Image: © Mikael Buck / Virgin Trains) 8.38 Coreena Ford Rail workers supporting strikes in driver-only trains row \nRail workers at five train companies are said to be “solidly supporting” strikes which start today. \nThree days of strikes which could affect North East commuters are set to cause disruption amid this long-running dispute over the role of guards. \nCancellations and replacement buses are expected in some parts of the country because of the latest walkout. \nPicket lines were mounted outside stations across the country, while Transport Secretary Chris Grayling was urged to convene a special summit to try to break the deadlock. \nMembers of the Rail, Maritime and Transport union (RMT) are walking out today, Wednesday and Friday on South Western Railway (SWR), Arriva Rail North (Northern), Merseyrail and Greater Anglia, and today on Southern. \nArriva runs Northern which operates services between Newcastle, the Gateshead Metrocentre and Northumberland. \nIt said it would run around 1,350 services on strike days, more than half its normal timetable, with most running between 7am and 7pm. \nSWR plans to run more than 70% of its normal weekday service of 1,700 trains, although there will be rail replacement buses and arrangements to have tickets accepted on other train companies. \nGreater Anglia said it planned to run a normal service, with no alterations. \nMerseyrail will run a reduced service, mostly between 7am and 7pm, with a break during the middle of the day and no trains on the Kirby, Ellesmere Port or Hunts Cross lines. \nSouthern, which was facing its 39th RMT strike, said it planned to run a normal service on most routes, but advised passengers to check for any last-minute changes before they travel. \nRMT members on Northern, Merseyrail, Greater Anglia, South Western Railways and Island Line have been instructed to walkout between 00.01 hours and 23.59 hours on January 8, 10 and 12. \nMembers on Southern have been instructed to strike between 00.01 hours and 23.59 hours on January 8. Commuters waiting on a platform (Image: PA) 8.26 KEY EVENT North East care firm to invest £115m and create hundreds of jobs in new homes and hotel plan \nNorth East operator Crown Care is poised to invest £115m into the creation of care villages and residential homes across the UK, in plans which will create more than 700 jobs. \nCrown Care, based in North Shields, has planning permission in place for three new developments, with others in the pipeline as the company embarks on major growth plans. \nThe firm has worked with Newcastle-based architects ID Partnership to secure permission for schemes in Daventry,", "external_links": [], "published": "2018-01-08T10:05:00.000+02:00", "crawled": "2018-01-08T10:38:35.002+02:00", "highlightTitle": ""}