{"organizations": [], "uuid": "c64e58514d9ea591e690ebd477a0135264c8b836", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14212631.ece/ALTERNATES/s1200/Westworld.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/rise-robots-more-100000-north-14212586", "country": "GB", "domain_rank": 21960, "title": "Rise of the robots: More than 100,000 North East jobs 'to be taken by machines'", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T07:00:00.000+02:00", "replies_count": 0, "uuid": "c64e58514d9ea591e690ebd477a0135264c8b836"}, "author": "Mike Kelly", "url": "https://www.chroniclelive.co.uk/news/north-east-news/rise-robots-more-100000-north-14212586", "ord_in_thread": 0, "title": "Rise of the robots: More than 100,000 North East jobs 'to be taken by machines'", "locations": [], "entities": {"persons": [{"name": "andrew carter", "sentiment": "none"}], "locations": [{"name": "gateshead", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "south tyneside", "sentiment": "none"}], "organizations": [{"name": "newcastle city council", "sentiment": "none"}, {"name": "centre for cities", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe rise of the robots could put around a quarter of North East jobs at risk by 2030, a new report warns. \nIt highlights Sunderland as particularly vulnerable, putting it second in the whole country, with 37,700 jobs, or 29% of the entire workforce, in jeopardy. \nMeanwhile Newcastle, Gateshead, North and South Tyneside which are treated as one area, come further down the list at 23rd with 23% of jobs - or 97,800 in total - at risk, just above the 21% UK average. \nThe report by the Centre for Cities think tank says while automation and globalisation will boost jobs in British cities over the coming decades, it could further deepen the North/South divide. \nAndrew Carter, Centre for Cities chief executive, said the UK needed to reform the education system and provide greater investment in lifelong learning and technical education for adults. Read More A robotic revolution? Newcastle City Council frees up staff days by swapping humans for machines \nHe added the report makes clear a “one-size-fits-all” approach from central Government was inadequate. \nMr Carter said: “The Government needs to give city leaders in the North East more powers and resources to tackle the issues that automation and globalisation will present, and to make the most of the benefits they will bring.” \nNewcastle Central MP Chi Onwurah said robots and automation could have a positive impact on the local economy. \nHowever she added: “But we need a Government who understand technology, the opportunities and the challenges, and is willing to build skills, take on the tech giants and set out the right regulatory framework. \n“Labour’s Industrial Strategy takes as its mission to build an innovation nation so everyone can benefit from technology and no-one needs to be afraid of automation.” A robot typing on a keyboard (Image: PA) \nThe report reveals one in five, or 3.6 million, existing jobs in British cities are likely to be displaced by 2030 as a result of automation and globalisation with retail occupations, customer service roles and warehouse jobs among those most at threat. \nIt said it could magnify the political divisions highlighted by the 2016 EU referendum, with many cities most at risk of losing jobs among those which voted most strongly for Brexit. \nMansfield, which came out top of the jobs at risk table, had the largest proportion of people who voted in favour of leaving the EU. Sunderland was also famously the first to vote for Leave. \nThe emergence of new industries will bring new jobs. However, successful cities in the South are better placed to secure more high skilled, high paying jobs in future, the report says. \nIn contrast, struggling cities in the North and Midlands are more likely to see growth in low skilled private sector jobs. Read More More jobs could be wiped out by automation in the North East than anywhere in England \nA Newcastle City Council spokesman said it was confident the city could meet the challenges ahead. \nHe said: “Newcastle is putting itself in the best possible place by diversifying its economy and investing in jobs of the future. Newcastle Science Central is creating new economic opportunities for existing and new businesses. \n“As the report points out, devolution is essential for cities. With Northumberland and North Tyneside, our proposed devolution deal with Government will give the city the power to make its own decisions along with £23m per year for adult education. \n“However, we are not complacent and working hard to ensure our workforce is trained in the skills that meet the needs of a modern thriving economy.” \nLast November it emerged robotic software has saved Newcastle City Council more than £1m and freed up hundreds of staff days. \nThe software, called SX, has been used by the authority’s social care and information technology departments for seven years. Like us on Facebook", "external_links": [], "published": "2018-01-29T07:00:00.000+02:00", "crawled": "2018-01-29T09:06:44.013+02:00", "highlightTitle": ""}