{"organizations": [], "uuid": "c5fb15104ac61f694199348f8a2104fa8c88ca08", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14198760.ece/ALTERNATES/s1200/Daily-Mirror.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/department-international-trade-falling-behind-14198341", "country": "GB", "domain_rank": 21960, "title": "Department for International Trade falling behind on Brexit, alarming new report says", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T02:01:00.000+02:00", "replies_count": 0, "uuid": "c5fb15104ac61f694199348f8a2104fa8c88ca08"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-news/department-international-trade-falling-behind-14198341", "ord_in_thread": 0, "title": "Department for International Trade falling behind on Brexit, alarming new report says", "locations": [], "entities": {"persons": [{"name": "liam fox", "sentiment": "negative"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}], "organizations": [{"name": "department for international trade", "sentiment": "negative"}, {"name": "national audit office", "sentiment": "none"}, {"name": "daily mirror", "sentiment": "none"}, {"name": "nao", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Department   alarming new report says Liam Fox's department risks putting companies out of business, influential MP warns Share Liam Fox at the Tory Conference, Manchester (Image: Daily Mirror) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nLiam Fox’s Department for International Trade (DIT) has been criticised for falling behind schedule on its Brexit responsibilities and risking the future of British business as a result. \nThe work of the DIT - which is in charge of developing post-Brexit free trade agreements - has been put under the microscope as part of a National Audit Office (NAO) report, which found the department was struggling to develop specialist trade skills among staff and has had to “adjust” its timeline. \n“Delivery of the work streams will be challenging and DIT has put back some of its delivery milestones as the timetable for legislation and the overall negotiation process has moved on,” the NAO report said. \nIt also said the civil service model, which sees staff move every few years, is “not best suited” to developing specific trade and negotiation skills, adding there will be a “premium” on retraining and recruiting outside staff. \n“Considerable work will need to be done to build skills that have not existed in government for a generation,” the NAO said. \nReacting to the findings, chair of the committee of public accounts Meg Hillier said the department was risking the future of UK business. \n“Failure to get the right trade deals in place from day one of Brexit could mean higher prices, lost jobs and companies going out of business. Read More Sheet metal firm doubles turnover after making major machinery investment \n“It is deeply worrying that the NAO’s report says DIT is already behind schedule and it is not clear how it will be able to get the negotiators it needs. \n“The department urgently needs to talk to British businesses and work out how to help them secure their future after we leave the EU .” \nIt raises concerns over the work being done under the leadership of International Trade Secretary Liam Fox, who just months after the Brexit vote reportedly accused British business of failing to prepare for new trade deals he was set to negotiate, and for becoming “too lazy and too fat” on previous successes. \nThe NAO report went on to detail the £25m in additional funding granted to the DIT for EU exit work by the Treasury over the 2017-2018 financial year, covering administration costs, capital and programme funds. \nIt also applied for a new tranche of supplementary funding in September to be doled out in 2018-2019, though it is not yet clear how much DIT will need to fulfil its obligations. \nThe report said: “While DIT continues to plan for successful delivery on the key scenarios, uncertainty around the nature of the UK’s future relationship with the EU and any implementation period mean that it needs to be flexible and keep its plans under review. \n“As yet there is no final cost associated with DIT’s role in EU exit.” \nHowever, the review said the DIT did recognise the “critical importance of engaging with stakeholders” in order to deliver a smooth and orderly Brexit and “avoid damage to its own reputation”. Read More Brexit immigration rules could cost Newcastle's economy over £300m \nThe DIT defended its progress, saying: “Overall, our plans are on track and we have met every EU exit delivery milestone to date. \n“This is not slippage, we have deliberately adjusted some downstream work strands as a result of the changes to the EU exit negotiation timetable.” Like us on Facebook", "external_links": [], "published": "2018-01-25T02:01:00.000+02:00", "crawled": "2018-01-25T02:36:58.000+02:00", "highlightTitle": ""}