{"organizations": [], "uuid": "9afcba6889fd88663151f50c1c56ca420495616c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/news/business/leicester-business-survey-2018-royal-1101368", "country": "US", "domain_rank": 48128, "title": "Leicester Business Survey 2018: ‘Royal wedding to provide feel good factor while EU divorce grinds on...’ - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.192, "site_type": "news", "published": "2018-01-22T18:51:00.000+02:00", "replies_count": 0, "uuid": "9afcba6889fd88663151f50c1c56ca420495616c"}, "author": "Tom Pegden", "url": "http://www.leicestermercury.co.uk/news/business/leicester-business-survey-2018-royal-1101368", "ord_in_thread": 0, "title": "Leicester Business Survey 2018: ‘Royal wedding to provide feel good factor while EU divorce grinds on...’ - Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "ravi karia", "sentiment": "none"}, {"name": "andrea hodgson", "sentiment": "none"}, {"name": "doug crawford", "sentiment": "none"}], "locations": [{"name": "leicestershire", "sentiment": "none"}], "organizations": [{"name": "cambridge & counties", "sentiment": "none"}, {"name": "my home move doug crawford", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get Business updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email Leicestershire business leaders on how they coped in 2017 and what they expect in 2018.... Doug Crawford, CEO, conveyancing firm My Home Move Doug Crawford \nIn 2017, the dominant issue was the continuing lack of housing supply. \nWith the political uncertainty surrounding the Brexit negotiations and the snap General Election, as well as rising house prices, an air of caution still settles over the market. \nI believe that the industry will continue to find innovative solutions – such as modular construction – to speed up this process and produce the homes of the future. Andrea Hodgson, chief financial officer, Cambridge & Counties Andrea Hodgson presents a Mercury business award to Ravi Karia of Universal Textiles \nThis will be a good year for women in business. \nThere is genuine momentum in encouraging diversity in the workplace, in senior teams and in board rooms. \nAnd there are increasing means available to support women’s career progression in many sectors, such as mentoring. \nElsewhere, the Bank of England will be in no hurry to raise base rate early in the New Year after November’s quarter point rise. \nBut the assumptions the Monetary Policy Committee made will be tested during a year in which the macro-economic environment will be exposed to forces such as the progress of the Brexit trade negotiations. \nAnother base rate rise could come during the second quarter. \nMay’s royal wedding will provide a much-needed feel good factor whilst the divorce from the EU grinds on – at least until the honeymoon of summer fades into an early exit from Russia for England’s World Cup dreams. Matt Vice, partner, Mark J Rees accountants Matt Vice (Image: Will Johnston) \nThe political and economic position has been dominated by the stuttering Brexit negotiations and 2018 is likely to be more of the same. \nI expect that we will come to a satisfactory conclusion to negotiations because it is in the EU’s interest to do so. \nWe will lose some key city jobs but in the long-term the UK’s financial and investment community, with its free trade outlook, has the opportunity to develop a more global business. \nTheresa May was complacent in the 2017 election but she has shown that she has the determination and staying power to finalise these talks in a way where we can continue to do business with the EU countries. \nAt the end of the year, I believe we will realise that the UK occupies a new and special niche within the world. Chris White, CEO, Hinckley & Rugby Building Society Chris White (Image: Jason Senior) \nWe had a really good 2017, attracting significant numbers of new savers and mortgage borrowers, with high retention rates, and we have high hopes for 2018. \nAs we begin the next 12 months it’s tempting to say there may be more severe forces buffeting the economy and affecting the big influencers for our market such as the Bank of England base rate, house prices and inflation. \nBut casting minds back a year, there was yet to be faced the trigger of Article 50, a surprise General Election, falling house prices in some areas of London and the first base rate rise in a decade. \nSo, perhaps, 2018 will not be more challenging than 2017. Tom Bower, senior partner, Spearing Waite law firm Tom Bower \nThe economic climate has been favourable for Spearing Waite in the last 12 months and we have increased turnover and recruited 16 personnel. \nWhile we will continue to target growth I think the economic conditions in the next six months may not be quite so favourable. \nThere is a chance that some businesses will await the outcome of the Brexit negotiations before making investment decisions and things may slow. \nHowever, I think we will agree a deal and by the autumn things should accelerate again. \nHaving said that, the coming 12 months will continue to be challenging in retail. Pete Miller, Partner, The Miller Partnership Pete Miller \nLike many people, the biggest aspect overshadowing the economy is Brexit. \nHowever, as a corporate and business tax adviser I think it is unlikely that Brexit will have any major impact on the tax code over the next few years. \nI certainly do not believe that there will be any sweeping repeal of all tax legislation that was enacted to comply with European law. \nMore important in my business is the impact of the government's constant tweaking of the tax code, usually under the guise of “preventing tax avoidance\" even when the change does nothing of the sort. \nFor example, recent changes to the rules on stamp duty mean that many innocent commercial transactions will end up carrying a double stamp duty burden for no sensible policy reason. \nOverall, therefore, my hope for 2018 is that the government leaves well alone in the tax code for a while and let things settle down. \nThere are some good signs in that the proposed Finance Act legislation for 2018 is relatively short compared to recent Finance Acts. Chris Darlington, office managing partner, Mazars accountants Chris Darlington \nThe last 12 months have been interesting to say the least – not for a long time has there been so much worldwide political and economic uncertainty and change, yet business and the economy generally has performed pretty well. \nI firmly believe that business owners – in particular the non-plc element – have got on and continued to make investment decisions while all the change, including Brexit, happens around them. \nI believe that this will continue into 2018 as there is still a lot of confidence out there – and confidence builds confidence. \nMy concerns? If we lose confidence, talk things down (and the media have a big part to play in this) then business will rein in key decisions and committing to investment and growth and activity will slow. Jane Cowley, Gateley Plc & chair, Leicestershire Business Voice Jane Cowley \nThe East Midlands is one of the fastest-growing economies outside London, producing 21 per cent of UK manufacturing output, has the second largest airport dealing with freight, and is at the heart of the transport network. \nDespite this, a 2017 Treasury report confirmed how much our region has been losing out in terms of public investment, with our region falling within the third lowest in terms of expenditure on infrastructure. \nI hope 2018 will see Leicestershire unlock economic growth and prosperity and speak with one voice to clearly articulate the reason why investment in our region will produce return. \nInvestment to date – including motorway upgrades and smart motorways – has largely been in the West Midlands. \nInvestment in infrastructure is desperately needed if the East Midlands is to unlock its competitive advantage. Keith Cooper, photographer, Northlight Images Keith Cooper \nWe’re seeing confident businesses and that mostly puts a smile on my face. \nCreating photos for businesses relies on client confidence – when they want to reach out and tell their story, they turn to us for help. \nLeicester’s business environment is healthy, but we still need things like better broadband in the city centre. \nAt a regional level, the Government’s disdain for the area – eg rail non-electrification – doesn’t help inward investment. \nAnd the Brexit-related drag on the Government’s attention and resources will hinder the economy for many years to come. \nWe’ve already seen it influencing big projects that we¹d have hoped to photograph. Andrew Wilson, co-founder, Wilson Vale catering Wilson Vale with partner Carolyn Vale \n2017 was a good year for Wilson Vale. \nWe were quietly surprised that turnover and profitability were significantly higher than the previous year. \nGenerally, there is an air of confidence in the business community, particularly in the Midlands and South, contrary to what we read about in the media. \nYou only have to look at the traffic on the roads, the level of building work that’s going on and the amount of people eating out to see that confidence is high. \nLooking ahead, we expect double digit growth again in 2018, and are confident enough to invest significantly this year in a new HQ In Leicestershire. \nOne of our on-going challenges is the recruitment of motivated and skilled people so we will continue to develop talent from within. Paul Baker, owner, Bakers Waste Paul Baker (Image: Beth Walsh) \nDuring the course of 2017, we have seen the construction sector grow which looks to continue throughout 2018. \nFor Bakers Waste and the industry in general this has led to record levels of skip movements and an increase in volumes of building waste and operations. \nWe now all face the well-publicised challenge of the plastic ban by China who have traditionally imported more than 50 per cent of the world’s used plastic. \nAlthough new markets are emerging there is an urgent need to find new homes for the vast amounts of plastic processed each year. Eileen Richards, Eileen Richards Recruitment Eileen Richards \nBusinesses will be looking for greater certainty and support to give them the confidence to invest and help grow productivity. \nThe skills gap remains a key strategic issue for UK growth. \nLeicestershire is home to some of the most entrepreneurial and innovative business minds in the country. \nWe are an ideas powerhouse and, in my opinion, are well placed to flourish in any new business environment. \nWhile Brexit is grabbing the headlines, it isn’t the only big change that will impact business in the first half of 2018. \nAt the end of May, Britain’s outdated data protections regulations are going to be replaced by EU General Data Protection Regulations (GDPR), which are far more prescriptive and considerably more punitive if you get them wrong. \nI will continue to recruit for my own business. David Heys, managing director, Lawson-West Solicitors David Heys \nNotwithstanding the uncertainty around Brexit negotiations, we feel that 2017 was a fairly decent year for the economy generally and exporters in particular. \nThe breakthrough in reaching agreement on the first phase of Brexit was cause for optimism. \nWe remain positive about the future. \nWe have a strong economy and there is business out there for those prepared to go and find it. \nBusinesses are rising to the challenges of difficult times and will continue to do so. \nWe need people and businesses to “just get on with it” otherwise worrying that Brexit could be a major disaster could be a self-fulfilling prophecy. Chris Frostwick, partner Grant Thornton accountants Chris Frostwick \nDespite a number of clear challenges looming on the horizon, the main message we are hearing from local businesses is one of positivity. \nThere is a feeling that although there is much which is outside their immediate control, the majority are looking at what they can do to place themselves in the best position going forward. \nThis resilience and willingness to adapt will be key to achieving future success. Ashwin Mistry OBE, chairman and CEO, BHIB insurance Ashwin Mistry OBE \nThey say that “change has never been as fast as it is now and will never be as slow again”. \nOur business has had to transform in the face of ever changing client needs and demands. \nA significant number of our peer competitors have sold their businesses to larger, faceless consolidators and have vacated a value chain which we are very happy to fill. \nOur true independence is now a distinct advantage, which we are capitalising on. \nOur continued investment in people, especially apprentices, gives us great optimism for 2018. \nThe perceived issues of Brexit, political uncertainty and globalisation are real and will impact on client behaviour and decisions. \nIt will affect all businesses and those who are equipped will thrive. John Griffin, partner, Newby Castleman accountants John Griffin \nLast year went against perceived expectations and was relatively buoyant, with the markets shrugging off any negativity and continuing to see strong investment in the UK. \nThe banking sector, however, pulled in its horns somewhat, and wasn’t as keen to invest in businesses, although many smaller businesses have displayed a reluctance to get indebted, which is encouraging, and perhaps a residual hangover from the 2008 crash. \nThe Government’s budgetary response has been lacklustre unfortunately. \nLooking ahead, I’m more of a glass-half-full person. Gary Kirk, associate director, Mather Jamie property consultants Gary Kirk (Image: Andy Baker) \nLast year was extremely busy in the world of property and we expect much the same for 2018. \nDemand was high for development land sales and the housing market will stay robust as long as mortgage rates continue to be affordable and schemes such as Help to Buy remain accessible. \nThe agricultural land market is expected to remain firm as demand continues to outstrip supply and DEFRA’s recent announcement that farming subsidies will be guaranteed, post-Brexit, until 2024 will provide the industry with a lift. Gareth John, senior partner, Gateley law firm Gareth John \n2017 has reflected the resilience of the UK economy, demonstrating that it’s stronger than many thought, particularly in relation to manufacturing and exports. \nBusinesses have also had the ability to manage debt levels due to continuing low interest rates and it has been a great 12 months in terms of job creation. \nBut there is room for improvement. \nI hope that in 2018 the economy will become more balanced, moving away from just London dominated financial services to stronger regions with technology driven manufacturing and engineering. \nFurthermore, a greater investment in the region would be welcomed, including bringing infrastructure and inwards investment initiatives into the area. \nRetailers who rely on traditional brands will struggle and challenger brands associated with innovation and who are in tune with current trends are more likely to dominate and survive in tighter market conditions. \nInflation will be a concern, particularly if Brexit talks stall and the pound weakens further. Alison Neate, partner, Smith Partnership law firm Alison Neate \nWe Brits show tremendous resilience and that’s what is keeping businesses and the economy going. \nWe didn’t see the post- referendum recession which business owners feared. It seems that as a nation we kept calm and carried on spending – helped by the continuance of cheap credit. \nWe saw a very busy year last year, on both the residential and commercial property side. \nIt looks like this will continue into 2018 but there is the worry of wages being static for so long and the rising price of food etc. \nA squeeze on spending could finally be on its way. On the up side, it’s a positive to be doing business in Leicester. \nThe city centre is looking in good shape after recent makeovers such as Jubilee Square, the demolition of the council building and, of course, the Richard III Visitor Centre. Shahid Sheikh OBE, MD, Clifton Packaging Shahid Sheikh OBE \n2017 represented another extraordinary year for the Clifton Group with turnover hitting the £21 million mark. \nOur export business increased too as did our reputation for innovation and entrepreneurship across our industry helped by winning numerous high profile awards. \nWe continued with our investment programme. spending more than £3 million on new machinery to further increase our capacity in line with our growth plans. \nIn terms of our plans for 2018 it’s more of the same and we are on track to deliver our ambition to turnover £30 million by end of 2020. Finding the right talent continues to be problematic, but we will persist. Mike Pole, MD, Pole Arnold financial management Mike Pole \n2017 has been a surprisingly positive year for business in spite of Brexit fears. \nMany of our clients’ businesses have achieved better results than they anticipated, and our clients’ investment portfolios have produced excellent returns over the last couple of years. \nKey world economies appear to all be achieving good and apparently sustainable levels of GDP growth at the same time in an eerily continued low inflation environment. \nHistory shows us that the future economy and investment markets rarely perform as expected, so I would anticipate a few surprises in 2018, quite probably linked to our Brexit journey. \nMy two biggest fears for the UK economy in 2018 are possible Brexit wobbles and the concern of political change in a year when we really do need stability. \nMy personal biggest concern for our business is the ever increasing burden of over regulation. Mukesh Patel, Leicester office managing partner, Freeths Mukesh Patel (Image: Chris Gordon) \nWe have seen a strong performance across all our departments, but we are not being complacent – “cautiously optimistic” best sums up our thoughts. \nThe ‘B’ word is a constant presence and will I think become increasingly so throughout the year. \nCertainly, some of the sectors we are involved with – for example, food – are very heavily impacted by uncertainty and exchange rate changes, not least in terms of immigration issues and we have a growing corporate immigration practice nationally. \nFor us, the key for continued success is investment in people and technology. Nigel Toplis, MD, franchising specialist The Bardon Group Nigel Toplis \nI am a bit sick and tired of people moaning on about Brexit and about how ALL the people who voted to leave are either old (so will die soon), racist or simply stupid. \nFor some reason, we love the idea of living in a democracy (though for 18 years I lived in a totalitarian state and that worked just fine thank you!). \nWell, if you want to live in a democracy then you have to accept that sometimes you don’t get what you want and funnily enough the majority rule! \nSo rather than moan on about Brexit, let’s look at ways to strengthen and build businesses regardless of what may or may not happen regarding Europe. Duncan Green, managing partner Pick Everard Duncan Green (Image: Beth Walsh) \nIf the terms of the Brexit divorce bill can be agreed upon quickly then we can really start to look to the future with a better understanding of where the UK is moving in terms of construction and output. \nI’m confident that, with a properly skilled workforce, 2018 will be a good year for the construction industry – I look forward to seeing more being done in terms of encouraging industry apprenticeships and training to secure our future. Michael Mathias, director CSL Business Machines CSL Group Directors Andy Perkins and Michael Mathias (Image: Alex Hannam) \nAgainst a backdrop of a global political change, it was really difficult to make any medium or long-term predictions, so at CSL we decided not to be afraid of taking risk, to back our own judgement and more importantly avoid doing nothing. \nWe decided to invest heavily in new technologies, to improve our customer offering and increase our productivity. \nThis strategy was a success. \nSo, 2018 seems to us to be much the same as last year so we will continue to make further investment in high skill individuals to complement our existing highly skilled colleagues. Like us on Facebook ", "external_links": [], "published": "2018-01-22T18:51:00.000+02:00", "crawled": "2018-01-23T07:24:14.000+02:00", "highlightTitle": ""}