{"organizations": [], "uuid": "a04e655275726fa9b3de667f05d8c804bfe0cce2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article999281.ece/ALTERNATES/s1200/Chris-Frostwick-GT-EM.jpg", "site_section": "http://www.leicestermercury.co.uk/rss.xml", "section_title": "leicestermercury - frontpage", "url": "http://www.leicestermercury.co.uk/news/business/eight-10-leicester-firms-not-999292", "country": "GB", "domain_rank": 48128, "title": "\"Eight in 10\" Leicester firms not ready for new GDPR data protection rules - here's what you should know", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T13:53:00.000+02:00", "replies_count": 0, "uuid": "a04e655275726fa9b3de667f05d8c804bfe0cce2"}, "author": "Tom Pegden", "url": "http://www.leicestermercury.co.uk/news/business/eight-10-leicester-firms-not-999292", "ord_in_thread": 0, "title": "\"Eight in 10\" Leicester firms not ready for new GDPR data protection rules - here's what you should know", "locations": [], "entities": {"persons": [{"name": "grant thornton", "sentiment": "negative"}, {"name": "chris frostwick", "sentiment": "negative"}, {"name": "thornton", "sentiment": "none"}], "locations": [{"name": "leicester", "sentiment": "none"}, {"name": "east midlands", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "east mid", "sentiment": "none"}, {"name": "regdent road", "sentiment": "none"}], "organizations": [{"name": "general data protection regulation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Be prepared: Chris Frostwick, practice leader of Grant Thornton’s East Midlands office in Leicester Share Get Business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nFive months before new data protection laws come in, eight out of 10 East Midlands firms have yet to protect themselves from breaches, according to a Grant Thornton poll. \nFrom May 25, all organisations processing personal data in the UK or EU will need to meet the new General Data Protection Regulation (GDPR) - introduced to give people greater control over how personal data is used. \nAccording to the financial and business advisers, which has its Leicester office in Regdent Road, even though senior managers said they were familiar with GDPR, 80 per cent of them have no contingency plans in place should a data breach happen - potentially opening themselves up to heavy fines. \nThe level of fine will depend on the nature of the infringement but for big businesses could be as much as four percent of global turnover or 20 million euro – whichever is higher. For jobs in Leicester, there are loads over here \nChris Frostwick, practice leader of Grant Thornton’s East Midlands office in Leicester, said: \"The new GDPR regulations have far reaching implications for all organisations who hold personal data of EU citizens and with the introduction date fast approaching, it is concerning that around a fifth of businesses have taken no steps to prepare, and four fifths have no plans in place to deal with data breaches. \n\"Over the last 20 years, the Data Protection Act (DPA) has been the foundation for protecting privacy in the UK. \n\"However, this pre-dated social media, cloud computing and geolocation services and the laws needed updating to address modern privacy concerns. \n\"The new GDPR aims to do just that by increasing organisations’ accountability for all aspects of data protection from the collation of personal data to its disposal. \n\"It is vital for businesses to ensure they are up to speed with the new legislation requirements and ready to comply by May 2018 or they could face a hefty fine – and damage to their reputation.” \nHe said that among the legal requirements outlined by the GDPR, organisations should: Show clear, freely given consent from every individual to process their data - silence or inactivity no longer constitutes consent Appoint an appropriately experienced, independent data protection officer if the organisation monitors individuals on a widescale - someone who does not hold a conflicting role such as CEO, CFO or head of IT Conduct Privacy Impact Assessments to identify where privacy breach risks are high, particularly with new projects Report significant data breaches to regulators within 72 hours Observe ‘the right to be forgotten’, in all procedures. Organisations should not hold data longer than absolutely necessary or use data for a different purpose other than it was originally collected for Design data protection into all new business processes and systems \nFollowing Brexit, organisations in the UK who process data of individuals in the EU will still need to be compliant with the GDPR. \nIt is also anticipated that UK data protection laws will remain broadly in line with the GDPR. \nMr Frostwick said: \"All organisations need to fully understand how the GDPR affects them. \n\"This includes assessing current processes and establishing which business areas will be impacted and how. \n\"By May 2018 every business should be able to evidence they are GDPR ready for both internal audit and regulators; show that risks to personal data have been understood and embedded in the organisation; have new or updated, fully operational data protection policies, procedures and controls in place; and be able to produce governance documentation for inspection. \n\"All this requires business-wide awareness and what may be a steep learning curve for many management teams so professional advice can be prove invaluable. \n\"With personal privacy high on the public agenda, and rightly so, it’s just not worth the financial or reputational risk of leaving anything to chance.\" Read More ", "external_links": [], "published": "2018-01-02T13:53:00.000+02:00", "crawled": "2018-01-02T14:03:34.003+02:00", "highlightTitle": ""}