{"organizations": [], "uuid": "b8e572489de16dff04f189200326b9f79668cae6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article785380.ece/ALTERNATES/s1200/Neil-Parish.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "devonlive - frontpage", "url": "http://www.devonlive.com/news/news-opinion/comes-precious-natural-environment-actions-1071540", "country": "GB", "title": "When it comes to our precious natural environment, actions speak louder than words", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T13:57:00.000+02:00", "replies_count": 0, "uuid": "b8e572489de16dff04f189200326b9f79668cae6"}, "author": "Neil Parish", "url": "http://www.devonlive.com/news/news-opinion/comes-precious-natural-environment-actions-1071540", "ord_in_thread": 0, "title": "When it comes to our precious natural environment, actions speak louder than words", "locations": [], "entities": {"persons": [{"name": "michael gove", "sentiment": "none"}, {"name": "neil parish", "sentiment": "none"}], "locations": [{"name": "london wetland centre", "sentiment": "none"}, {"name": "tiverton", "sentiment": "none"}, {"name": "defra", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "News opinion When it comes to our precious natural environment, actions speak louder than words The Government’s 25 Year Plan for the Environment shows they are committed to a cleaner, greener and safer natural environment. Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nNEIL PARISH IS THE CONSERVATIVE MP FOR TIVERTON AND HONITON AND HAS BEEN SINCE 2010 \nLast week, I travelled to the London Wetland Centre to see the Prime Minister unveil the Government’s 25 Year Plan for the Environment. \nIt was great to see the Prime Minister so closely involved in the work of DEFRA, committing to a cleaner, greener and safer natural environment. For 18-28 year olds, climate change is the most important issue on the agenda. Read More North Devon MP wades into \"environmental crisis\" inviting Michael Gove to see marsh flooding \nConservation should be second-nature to all conservatives. It’s about passing on a country which is a better place to live and work for your children and generations to come. I’m glad this Conservative government is committed to that aim - and the new 25 Year Plan for the Environment sets about achieving it. Neil Parish MP \nI was pleased to see plans for a new statutory body; an environmental watchdog to hold ministers’ feet to the fire. This will be crucial, particularly in maintaining standards on matters like air quality, especially when we leave the EU. However, the Environment Secretary must ensure the watchdog is sufficiently independent from Government - and well-resourced to provide effective scrutiny to Government. As Chair of the Environment Food and Rural Affairs Select Committee - I look forward to examining the details further. Read More I will not allow Brexit to side-line food and farming in this country \nAnother area which has deservedly got the attention of the nation, is the state of our seas. Never, it seems, has a documentary series had such an impact on government policy. Britain is responsible for 2.6 million square miles of ocean, an area more than twice the size of India, and 30 times bigger than the UK itself. A ‘Green Brexit’ and a ‘Global Britain’ post-Brexit can - and should - go hand in hand. Neil Parish elected in 2010 \nExtending the plastic bag charge to smaller businesses will help reduce plastic waste further. Plastic bag use has already reduced 86% since the charge was introduced, with 9 billion fewer carrier bags distributed since the charge was introduced. It shows positive government action can have a real effect. Read More The two major schemes planned to stop flooding Devon towns and villages \nBut there is more to do - and I will be pushing the Environment Secretary to go further on things like a bottle-deposit return scheme. Shamefully, only 57% of plastic bottles are recycled in the UK, compared to 90% in countries like Denmark where such schemes exist. The Government is currently consulting on the introduction of a reward and return scheme and I look forward to seeing the results, particularly along the Jurassic Coast. Neil Parish \nLast week, I also had the pleasure of holding a debate in Westminster on what the Government is doing for forestry and trees. The announcement in the 25 Year Plan that there will be a new ‘northern forest’ is welcome, but the practicalities of it are much more complex. Some trees take around 40 years to grow, so providing real incentives for farmers and landowners to increase tree-planting is vital. Read More It’s vital we get design and quality of new homes right - because we won’t get a second chance \nTrees are a carbon sink, a way to manage flood risk and a habitat for precious species. I hope that when we come to reform our agri-environmental schemes, the Government can construct a system which is much more user friendly - otherwise we simply will not reach the laudable target of 11 million trees planted by 2022. \nAlthough we should be proud of our record so far – now is the time to redouble our efforts and press the Government to continue its good environmental work. The Government must underline its ambitions with sufficient resources and by making them enforceable. When it comes to our precious natural environment, actions speak louder than words. Like us on Facebook ", "external_links": [], "published": "2018-01-16T13:57:00.000+02:00", "crawled": "2018-01-16T14:04:56.000+02:00", "highlightTitle": ""}