{"organizations": [], "uuid": "5390e94da2a0d79222053ca7f3294fe785368797", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/29643392/15292115.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/reaction-to-the-brexit-vote-has-led-to-huge-opportunities-for-retailers/story-29643392-detail/story.html", "country": "US", "domain_rank": 48128, "title": "Lumbers boss says reaction to Brexit vote has led to huge opportunities for retailers | Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "Lumbers boss says reaction to Brexit vote has led to huge opportunities for retailers | Leicester Mercury", "spam_score": 0.316, "site_type": "news", "published": "2016-08-23T14:21:00.000+03:00", "replies_count": 0, "uuid": "5390e94da2a0d79222053ca7f3294fe785368797"}, "author": "Leicester Mercury", "url": "http://www.leicestermercury.co.uk/reaction-to-the-brexit-vote-has-led-to-huge-opportunities-for-retailers/story-29643392-detail/story.html", "ord_in_thread": 0, "title": "Lumbers boss says reaction to Brexit vote has led to huge opportunities for retailers | Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "richard iii", "sentiment": "none"}, {"name": "hublot", "sentiment": "none"}, {"name": "freddie lumbers", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "breguet", "sentiment": "none"}, {"name": "dominic gomersall", "sentiment": "none"}, {"name": "chopard", "sentiment": "none"}], "locations": [{"name": "leicester", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "leicester mercury lumbers", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "bank of england", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Lumbers boss says reaction to Brexit vote has led to huge opportunities for retailers By Leicester Mercury | Posted: August 23, 2016 0 COMMENTS SHARES Dominic Gomersall, MD of Lumbers, with his son Freddie Lumbers boss says reaction to Brexit vote has led to huge opportunities for... X \nCopy link to paste in your message / Comments (0) \nDominic Gomersall, the managing director of Lumbers jewellers in Leicester, on why Britain's decision to leave the EU could be good for business \nBrexit continues to divide discussions and bring many differing opinions to the fore. The media and public hysteria has been unabated although many of the principles of the pre-vote campaigning have already, seemingly, proved impotent. \nThe Bank of England's complete change of tact from forecasting an interest rate increase prior to the vote and actually implementing a decrease shouldn't come as a shock to many who watched both campaigns sway from policy to policy. \nOf course, the initial exchange rate fluctuations have provided a challenge to many and are probably the highest profile consequence of the uncertainty created. \nBut this has led to huge opportunities for many retailers. \nFortunately for Lumbers, the drop in the value of the pound against the US dollar on the exchange rate has increased the opportunities to export. \nRead more: Inside the new Lumbers store on the High Street - in pictures \nOver the generations of the business, we have cultivated some extremely wealthy international clients. \nWe have seen these clients take advantage of the situation by realising that the UK is currently the least expensive market for quality Swiss brands in the world. \nWe have been lucky enough to have exported sales of Breguet, Chopard and Hublot watches and have actually had a record July on this basis, seeing a 40 per cent increase on last year. \nThis is also fueled by the emergence of Leicester as an international city. \nThe universities bring an abundance of foreign students to the area who frequent the High Street regularly. \nOur new location takes advantage of the King Richard III exhibition and Highcross shopping centre where the majority of visitors go. \nLumbers has been fortunate as we are shielded from the exchange rate issues on importing. \nSwiss watch brands sell to us in pounds sterling and therefore we haven't been exposed to the rise of the euro's value against the pound. \nThe Bank of England's recent drop in interest rates, blamed on Brexit, again is extremely helpful to Lumbers. \nWith our large capital expenditure last year moving to our wonderful new home, any interest rate drop is assistive. \nRead more: REACTION: Interest rates cut to record low of 0.25 per cent \nI think it was a huge relief to many retailers with the refreshing honesty of Next blaming the unseasonal weather on their latest sales figures rather than Brexit which the media seemed to prefer. \nI have also witnessed a number of important clients that have discreetly used Brexit as an excuse for any redundancies or bad news known of long before the final result. \nI am sure the reaction to Brexit to date has helped a number of businesses, although I am aware how difficult it must be for many importers. ", "external_links": [], "published": "2016-08-23T14:21:00.000+03:00", "crawled": "2016-08-23T09:07:02.687+03:00", "highlightTitle": ""}