{"organizations": [], "uuid": "dc97b86ab7c2e5462ae41c77e3e7b364b419a197", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article6559111.ece/ALTERNATES/s1200/JS29615502.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/no-referendum-north-east-devolution-11802138", "country": "GB", "domain_rank": 21960, "title": "No referendum on North East devolution - but public will have their say, councillor claims", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "No referendum on North East devolution - but public will have their say, councillor claims", "spam_score": 0.0, "site_type": "news", "published": "2016-08-26T12:30:00.000+03:00", "replies_count": 0, "uuid": "dc97b86ab7c2e5462ae41c77e3e7b364b419a197"}, "author": "Laura Hill", "url": "http://www.chroniclelive.co.uk/news/north-east-news/no-referendum-north-east-devolution-11802138", "ord_in_thread": 0, "title": "No referendum on North East devolution - but public will have their say, councillor claims", "locations": [], "entities": {"persons": [{"name": "coun simon henig", "sentiment": "none"}, {"name": "paul watson", "sentiment": "none"}, {"name": "sajid javid", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "javid", "sentiment": "none"}, {"name": "george osborne", "sentiment": "none"}, {"name": "coun watson", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "neca", "sentiment": "none"}], "organizations": [{"name": "pcc", "sentiment": "none"}, {"name": "durham county council", "sentiment": "none"}, {"name": "sunderland city council", "sentiment": "none"}, {"name": "state", "sentiment": "none"}, {"name": "houses of parliament", "sentiment": "none"}, {"name": "neca", "sentiment": "none"}, {"name": "whitehall", "sentiment": "none"}, {"name": "north east combined authority", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "No referendum on North East devolution - but public will have their say, councillor claims 05:30, 26 Aug 2016 The North East Combined Authority is moving closer to an agreement with public consultations plans to be discussed next month Shares Get daily news by email Councillor Paul Watson, leader of Sunderland City Council \nThere should be no referendum on devolution , according to the chair of the North East Combined Authority. \nBuoyed by Secretary of State Sajid Javid’s apparent dedication to the North East’s devolution deal, the region’s seven council leaders discussed their next move on Thursday. \nNECA chairman Councillor Paul Watson has said the body could move to start a public consultation on the offered £3.4bn deal as early as September 6. \nHe said: “The talks were positive and the next step will be to go back to our respective cabinets and decide if we should move to public consultation or not. \n“This won’t be a referendum, but it will be a wide spread public consultation.” \nHe added: “People don’t want more votes, more politics another trip to the ballot box. There is apathy growing against that, look at the turn out figures for local election or for the PCC elections.” \nIn 2004, voters in the North East rejected a devolution proposal in a referendum vote by 77.9% on a turnout of 49%, prompting the Government to halt plans for similar votes in other regions. \nCouncil bosses travelled to Whitehall earlier this week to seek assurances from Mr Javid over the promised North East devolution deal which was signed last October. \nThe £3.4bn deal had been on hold since Britain voted to leave the EU in June, as the leaders were unsure where Brexit and the subsequent changes to Government left the offer. \nFollowing the crunch talks, council leaders say they have felt positive about moving forwards with devolution, to varying degrees. \nHowever Coun Watson also said the deal, which was signed by Durham County Council leader and former NECA chair Coun Simon Henig with former Chancellor George Osborne, does not go far enough. \nHe said: “Working together is clearly the right thing to do, it give us one big voice. \n“Devolution of powers to the region is obviously what we should be doing and asking for. “This isn’t devolution, there’s no tax raising powers, there’s no complete control of our finances. \n“It isn’t devolution in itself. It’s the first step towards devolution,” he said. “And it is an important step to take.” \nThe NECA leaders are expected to meet again on September 6 and will discuss public consultation plans. \nAn order creating a Mayoral Combined Authority, which specified that the first election is to take place on May 4 2017, will be discussed in the Houses of Parliament in the week beginning September 5 when it is expected to become law.", "external_links": [], "published": "2016-08-26T12:30:00.000+03:00", "crawled": "2016-08-26T07:59:40.131+03:00", "highlightTitle": ""}