{"organizations": [], "uuid": "37fc26f6b0d40ab6efd126d77d075efa265996c0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article11819158.ece/ALTERNATES/s1200/JS98274756.jpg", "site_section": "", "section_title": "", "url": "http://www.chroniclelive.co.uk/business/business-news/search-find-fastest-growing-companies-11819079", "country": "IE", "domain_rank": 21960, "title": "Search is on to find the fastest growing companies in the North East - Chronicle Live", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 0, "title_full": "Search is on to find the fastest growing companies in the North East - Chronicle Live", "spam_score": 0.513, "site_type": "news", "published": "2016-08-31T08:01:00.000+03:00", "replies_count": 0, "uuid": "37fc26f6b0d40ab6efd126d77d075efa265996c0"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/search-find-fastest-growing-companies-11819079", "ord_in_thread": 0, "title": "Search is on to find the fastest growing companies in the North East - Chronicle Live", "locations": [], "entities": {"persons": [{"name": "graeme wh", "sentiment": "negative"}, {"name": "graeme whitfield", "sentiment": "none"}, {"name": "jamie martin", "sentiment": "none"}, {"name": "colin hewitt", "sentiment": "none"}, {"name": "ward hadaway", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "north east 00:01", "sentiment": "none"}, {"name": "st chad", "sentiment": "none"}, {"name": "baltic", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}], "organizations": [{"name": "journal", "sentiment": "none"}, {"name": "ward hadaway fastest", "sentiment": "none"}, {"name": "college/durham business school", "sentiment": "none"}, {"name": "ward hadaway", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Search is on to find the fastest growing companies in the North East 00:01, 31 Aug 2016 By Graeme Whitfield The Fastest 50, run by law firm Ward Hadaway and The Journal, is an annual event to find the region's growing firms Shares Get business news by email Fastest 50 \nThe search to find the North East’s fastest growing companies starts today with the launch of the Ward Hadaway Fastest 50 for 2016. \nThe Ward Hadaway Fastest 50, devised by leading North law firm Ward Hadaway and backed by The Journal, is the definitive guide to the pace-setting companies across the region who have achieved the most impressive performances in growing their businesses. \nThe Fastest 50 was started by Ward Hadaway in 1998 to recognise and celebrate privately-owned profit-making companies in the North East showing the strongest annualised growth in turnover, with the aim of acknowledging the success of our high achieving companies and providing inspiration for others to follow. \nAs in previous years, the top fastest 50 growing companies for 2016 will be listed in The Journal next month in A to Z format with profiles of their work. \nThese 50 companies will then go forward to the Ward Hadaway Fastest 50 Awards in October where awards will be presented to the fastest growing small, medium-sized and large privately-owned businesses in the North East. \nOne of these three winners will go on to be named the overall fastest growing company in the region. Fastest 50 \nJamie Martin, managing partner at Ward Hadaway, said: “The Ward Hadaway Fastest 50 is a great way to celebrate all that is best about business in the North East. \n“Over the years in which it has been held, it has become a real institution in the region and a key event in the North East business calendar and 2016 promises to be no different. \n“The Ward Hadaway Fastest 50 champions enterprise and business achievement in the North East and helps to demonstrate what a great place the region is in which to live, work and do business. \n“Those companies who make the list are the real drivers of the region’s economy and our eventual winners will be in many ways the gold medalists of business achievement in the North East. \n“Just as we all celebrated the success of Team GB in the Rio Olympics, we are now looking forward to crowning our own North East business champions and to seeing their hard work, dedication and achievements acknowledged.” \nThe Ward Hadaway Fastest 50 is compiled by independent economic researchers from St Chad’s College/Durham Business School using publicly available data from Companies House. \nColin Hewitt, partner and head of commercial law at Ward Hadaway, said: “As well as highlighting individual business achievement, the Ward Hadaway Fastest 50 also helps to map out which areas of the North East economy are enjoying the strongest growth and which sectors are prospering. \n“Because entry into the 50 depends on a company’s financial figures, it means that every business which makes it into the list has got there purely on merit and performance. \n“In this respect, it acts as a valuable barometer for the overall health of the region’s economy and contains some important pointers for all of us on how to achieve success and how to continue growing profitably. \n“It also underlines the great strength in depth which the North East economy has and the diverse range of businesses across the region making a success. \n“The qualities of determination, expertise and teamwork exemplified by the Fastest 50 companies will stand us in good stead as we address the challenges to come in a post-Brexit world .” \nThe Ward Hadaway Fastest 50 awards ceremony will take place in October at Baltic, the Centre for Contemporary Art in Gateshead. \nJournal Business Editor Graeme Whitfield said: “The Ward Hadaway Fastest 50 has always been a source of positive news and really shows the region’s business community in its best light. \n“It also helps to uncover some real ‘hidden gems’ amongst the region’s businesses and put their achievements in the spotlight. \n“Ward Hadaway’s support and enthusiasm in devising and organising the event has been a key factor in its continuing success and we look forward to another exciting year’s awards.” ", "external_links": [], "published": "2016-08-31T08:01:00.000+03:00", "crawled": "2016-08-31T03:05:14.013+03:00", "highlightTitle": ""}