{"organizations": [], "uuid": "1f5038a63d8565045f2d924444b4236a155ca3a3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/29625709/15246231.jpg", "site_section": "http://www.thisisleicestershire.co.uk/generalelection2010/rss.html?chid=182803", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/confidence-drops-among-firms-after-vote-to-leave-eu/story-29625709-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "Leicester Mercury published Brexit vote hits business confidence", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "Leicester Mercury published Brexit vote hits business confidence", "spam_score": 0.0, "site_type": "news", "published": "2016-08-17T16:14:00.000+03:00", "replies_count": 0, "uuid": "1f5038a63d8565045f2d924444b4236a155ca3a3"}, "author": "Leicester Mercury", "url": "http://www.leicestermercury.co.uk/confidence-drops-among-firms-after-vote-to-leave-eu/story-29625709-detail/story.html", "ord_in_thread": 0, "title": "Leicester Mercury published Brexit vote hits business confidence", "locations": [], "entities": {"persons": [{"name": "chris frostwick", "sentiment": "none"}, {"name": "alberto costa  mr frostwick", "sentiment": "none"}, {"name": "grant thornton", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "east midlands", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "leicester mercury", "sentiment": "negative"}, {"name": "brexit", "sentiment": "negative"}, {"name": "european union", "sentiment": "none"}, {"name": "ons", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Brexit vote hits business confidence   \nBritish businesses are less confident about their prospects for the coming year than they were ahead of Brexit , according to research from Grant Thornton. \nThe top 10 accountancy firm, which has its East Midlands regional office in Leicester, said businesses were concerned about the post-EU referendum economy, with access to the single market remaining their top priority for growth. \nGrant Thornton asked 170 companies how the UK's decision to leave the European Union affected their business outlook. \nAlmost half said they were less confident about the year ahead, with just eight per cent saying they were more confident. \nJust over a fifth are \"actively planning\" to decrease investment over the coming year, although 56 per cent remain unchanged in their investment decisions. \nRespondents largely pointed to the impact of a general decline in the UK economy as a concern, along with the impact of exchange rate movements and declining consumer confidence as areas which may affect their business. \nChris Frostwick, below, partner and practice leader of Grant Thornton in Leicester, said: \"While much of the immediate political and economic turbulence following the outcome of the vote has settled over the past few weeks, the general outlook for the UK economy remains a top concern for most businesses. \n\"Many of the businesses we speak with are taking a business-as-usual approach to their day-to-day operations, but looking further into the horizon, some are reconsidering their investment intentions based on the post-vote indicators and general mood music in the markets. \n\"There have been immediate winners and losers as a result of changes in foreign exchange rates, and businesses and our clients in and around Leicester are adjusting to that. \n\"What is equally clear is that businesses are uncertain about how the economy will perform over the next 12 to 24 months – part of that is Brexit and part of it is global economic performance, and it is difficult to distinguish between the two.\" \nRead more: PM Theresa May only leader capable of uniting the country, says Alberto Costa \nMr Frostwick said: \"Despite the lack of consensus on the timing for Article 50 to be triggered, the general sentiment we're getting from clients and the market is that they want the Government to have a clear vision before beginning the negotiations. \n\"Businesses are encouraging the Government not to rush the process, but acknowledge that delaying it increases uncertainty, which is equally bad for business.\" \nMeanwhile, Government figures released yesterday showed inflation rose to a higher-than-expected 0.6 per cent last month as the increasing cost of motor fuels and second-hand cars drove up transport prices. \nSeparate figures from the ONS suggested the fall in the value of the pound since Brexit had increased the cost of imports for manufacturers. \nInput prices faced by manufacturers rose 4.3 per cent in the year to July, compared with a fall of 0.5 per cent in the year to June. \nThe most dramatic rises was in the cost of imported food materials, which rose 10.2 per cent, and the price of imported metals, up 12.4 per cent.", "external_links": [], "published": "2016-08-17T16:14:00.000+03:00", "crawled": "2016-08-17T12:31:41.774+03:00", "highlightTitle": ""}