{"organizations": [], "uuid": "45c43817d375d3ea7cffb941fe119187af9ce7d1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article10969625.ece/ALTERNATES/s1200/JS76349790.jpg", "site_section": "", "section_title": "", "url": "http://www.chroniclelive.co.uk/business/business-news/business-breakfast-live-greggs-boosted-11690940", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Greggs boosted by healthy food sales - Chronicle Live", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 0, "title_full": "Business Breakfast LIVE: Greggs boosted by healthy food sales - Chronicle Live", "spam_score": 0.199, "site_type": "news", "published": "2016-08-02T12:13:00.000+03:00", "replies_count": 0, "uuid": "45c43817d375d3ea7cffb941fe119187af9ce7d1"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/business-breakfast-live-greggs-boosted-11690940", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Greggs boosted by healthy food sales - Chronicle Live", "locations": [], "entities": {"persons": [{"name": "greggs", "sentiment": "none"}, {"name": "john carter", "sentiment": "none"}, {"name": "roger whiteside", "sentiment": "none"}, {"name": "reg gott", "sentiment": "none"}, {"name": "simon embley", "sentiment": "none"}, {"name": "james maloney", "sentiment": "none"}, {"name": "coreena ford greggs", "sentiment": "none"}, {"name": "coreena ford top", "sentiment": "none"}, {"name": "whiteside", "sentiment": "none"}, {"name": "paul geddes", "sentiment": "none"}, {"name": "travis perkins", "sentiment": "none"}, {"name": "roger whiteside  roger whiteside", "sentiment": "none"}, {"name": "chris", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "enfield", "sentiment": "none"}, {"name": "sleaford", "sentiment": "none"}, {"name": "newton aycliffe", "sentiment": "none"}, {"name": "twickenham", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "glasgow", "sentiment": "none"}, {"name": "edinburgh", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}], "organizations": [{"name": "coreena ford builders", "sentiment": "none"}, {"name": "coreena ford lettings", "sentiment": "none"}, {"name": "integrated antenna", "sentiment": "none"}, {"name": "churchill", "sentiment": "none"}, {"name": "lsl", "sentiment": "none"}, {"name": "filtronic", "sentiment": "none"}, {"name": "lsl property services", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "group", "sentiment": "none"}, {"name": "estate agency", "sentiment": "none"}, {"name": "the group", "sentiment": "none"}, {"name": "coreena ford filtronic", "sentiment": "none"}, {"name": "green flag", "sentiment": "none"}, {"name": "financial services", "sentiment": "none"}, {"name": "greggs", "sentiment": "none"}, {"name": "coreena ford", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "9.11 Coreena Ford Pound at 9am and FTSE latest \nThe pound at 9am was 1.3200 dollars compared to 1.3207 dollars at the previous close. The euro at 9am was 0.8481 pounds compared to 0.8460 pounds at the previous close. \nThe FTSE-100 index at 8:45am was down 29.81 at 6664.14. 9.06 Coreena Ford Profits fall at Direct Line's owners . . .despite making hefty hikes in car cover costs \nThe owner of Direct Line and Churchill insurance has posted a fall in half-year earnings despite further hefty hikes in the cost of car cover. \nBritain’s biggest motor insurer - whose brands also include Green Flag and Privilege - posted a 5.2% drop in pre-tax profits to £298.5 million for the six months to the end of June. \nIt said motor insurance prices surged by 9.5% year on year in its second quarter as it looked to offset the higher cost of claims, with more expensive repairs and guaranteed car hire pushing up prices. \nBut the group said deflation was easing off in home insurance, with prices broadly stable, down 0.3% in the second quarter, against falls of 2.3% in the previous three months and 3% at the end of 2015. \nDirect Line said total insurance policies fell 2.7% over the half-year, although it saw a rise of 3% across home and motor. \nThe group said it had been “well prepared” for the EU referendum and had seen “no operational impact”. \nDespite its fall in half-year profits, it offered cheer to investors with a special dividend payout of 10p a share, on top of an interim dividend of 4.9p a share. Direct Line chief executive Paul Geddes said he was “pleased” with the results, which came up against tough comparatives from a year earlier. \nHe added: “Although there remains a range of uncertainties in the macro-economic environment, we gain confidence from the strength of this performance.” 9.04 Coreena Ford Builders merchant Travis Perkins hit by Brexit uncertainty \nTravis Perkins has said it suffered from weaker demand as a result of the EU referendum, but cautioned that it is too early to say what the full impact will be. \nChief executive John Carter said the vote to quit to the EU has created “significant uncertainty”, with the builders’ merchant seeing like-for-like sales slow in the second quarter “owing to a number of factors, including the deferral of projects ahead of the EU referendum”. \nHe added: \nIt is clear that the result of the EU referendum has created significant uncertainty in the outlook for our end markets and we did experience weaker demand in the run-up to and immediately following the referendum. \nIn our view it is too early to precisely predict end-market demand and we will continue to monitor the lead indicators we track and will react accordingly. \nThe builders’ merchant also reported results for the first half of the year, which saw sales rise 5.8% to £3.1 billion and pre-tax profits rise 10.7% to £176 million. 8.59 Coreena Ford Lettings firm LSL Property Services posts strong half-year results \nLettings firm LSL Property Services said it has delivered a strong performance across its group in results for the six months ended 30 June 2016.. \nThe Newcastle-headquartered business, which operates as an estate agency and surveying businesses, saw revenues rise 8% to £151.4m, while group operating profit rose 10%. Pre-tax profits are also up 35% to £8.4m. \nSimon Embley, chairman, said: \n“The Group has delivered a strong first half performance in a changing market. I am particularly pleased with the profit growth in both Estate Agency and Surveying. \nWhilst we expect Residential Sales volumes to remain suppressed in the second half, trends in other parts of our business are expected to be more resilient. Our Lettings business continues to perform well, now representing 29% of total Estate Agency income. Mortgage cost and availability remain positive for the UK housing market with increasing distribution of products through intermediary channels which will support our growing Financial Services business. \nWhilst these are uncertain times in the residential housing market, the Group has strong fundamentals with a robust balance sheet and relatively low levels of gearing. \nThe business will adapt quickly as it has in the past and is well positioned to navigate the current market conditions. I remain confident that LSL will continue to deliver long term value to our shareholders. Chris Ison/PA Wire LSL runs businesses such as Your Move and Reeds Rains 8.52 Coreena Ford Filtronic looking to get back in the black \nCounty Durham components manufacturer Filtronic said it has has shortened its annual pre-tax losses in an upbeat full year statement, which \nThe company, which designs and manufactures microwave electronics products for the wireless telecoms infrastructure market, has posted an operating loss before tax of £7m for the year to May 31, down from £11m in 2015. Sales dropped form £17.5m to £13.6m. \nThe firm, which has moved from the main list to the AIM list, has carried out significant restructuring and refinancing and has also launched new products, all of which are now bearing fruit. \nThe firm has received several materially significant orders from a world leading Wireless Infrastructure OEM for its new Integrated Antenna product line. \nOrpheus, its new E-band transceiver, has also seen demand ramping progressively. \nIt also has strong sales order book and growing customer opportunity pipeline, which it said results from improved sales and marketing activity. \nA £4.5m share placing and a restructuring of its wireless division during the year have also provided a more secure financial platform. \nReg Gott, chairman, said: \nThe market outlook for mobile telecommunications infrastructure remains positive with the demand for mobile data continuing to grow. We were delighted with the recently announced contract wins in both of our businesses, which along with a growing opportunity pipeline, validates our strategy to return the business to profitability. We will continue our focus on addressing demand volatility by broadening both our customer base and our product portfolio in order to increase our options for growth and reduce our dependency on a narrow customer base. Filtronic in Newton Aycliffe 8.40 Coreena Ford Gluten free options coming soon at Greggs, says CEO Roger Whiteside \nRoger Whiteside says Greggs intends ramp up its healthy eating options, with new soups and packets of nuts and fruit to be introduced in the autumn. \nHe said: \nThere will be new soups and we’re going to revamp our snack range, going own-label on crisps and introducing nuts and fruits packets. We’ll also see the first gluten-free products launch in the second half of the year. \nEarlier this year, Mr Whiteside revealed that he is considering branching out even further from traditional Greggs staples of sausage rolls and doughnuts into Mexican food, and one day potentially even sushi. \nHe added that the firm is “alert” to any Brexit-induced change in consumer sentiment over the coming months. \nThere’s no sign of any impact yet, but if demand is affected we are alert and ready to react. \nIn a downturn, customers will be looking for more value, meal deals and that sort of thing, so we will make sure we tailor the offer to meet conditions. We’ll have to control costs too, but it won’t affect our investment programme. 8.35 Coreena Ford Greggs to expand Glasgow bakery \nBack in March the firm announced a programme to restructure the firm’s 12 bakeries, not all of which were said to be suitable for long-term investment. \nThree bakeries were earmarked for closure - in Twickenham, Edinburgh and Sleaford – with the disposal proceeds to contribute to the investment in the remaining nine bakeries. \nNow, CEO Roger Whiteside says progress has been made in the firm’s plans to invest substantially in its manufacturing and distribution operations, to reshape them for future growth. \nHe said: \nThe initial phase of this plan involves the closure of three bakery manufacturing sites with associated one-off costs expected to be £7.6 million. \n£4.8 million of this cost has been recognised in the first half of the year and this, combined with a £0.8 million exceptional credit related to the release of historical shop closure provisions, resulted in a net exceptional charge of £4.0 million in the period. \nThe overall cost and exceptional charges expected to arise from the plan remain in line with previous guidance. \nOur plans to invest in the transformation and development of our supply chain are progressing well. \nWe expect that our new distribution facility in Enfield will be operational in October allowing us to complete the closure of our existing Twickenham bakery in the fourth quarter as planned. \nIn addition, planning permission has been secured for the extension of our Clydesmill bakery in Glasgow which will enable us to close our Edinburgh bakery during the second quarter of 2017, as previously announced. \nWe are now planning the next phase of investment in our remaining sites, which will increase logistics capacity and consolidate manufacturing, with benefits in product quality, consistency and efficiency. 8.30 Coreena Ford Top story - Greggs growing healthier food sales \nFalafel and hummus have helped power sales at Newcastle headquartered Greggs in the first half of the year, with the sausage roll-maker reaping the rewards of a wider range of healthy eating options. \nRevenues were up 6% to £422m while like-for-like sales in the period rose 3.8%, driven by the baker’s Balanced Choice menu, which includes the likes of teriyaki chicken noodle salad and falafel salad. \nPre-tax profits for the first six months of the year were broadly flat, coming in at £25.3 million, held down by exceptional charges linked to the closure of three bakery sites. \nOther operational highlights in the 26 weeks ended July 2 included the further development of its breakfast and hot drinks offer as well as the successful launch of its improved Greggs Rewards app. \nThe shop refurbishment programme is also progressing well, with 86 shop refurbishments completed year-to-date out of a planned 200 for the year. \nAs of the end of the period Greggs now has 1,730 shops trading. \nChief executive Roger Whiteside said Greggs is “alert” to any potential change in consumer sentiment over the coming months. \nHe said: \nWe have made an encouraging start to the second half of the year and are alert to any change in consumer demand that may result from the current economic uncertainty. \nOverall, we expect to deliver full-year growth in line with our previous expectations as well as further progress against our strategic plan. James Maloney ", "external_links": [], "published": "2016-08-02T12:13:00.000+03:00", "crawled": "2016-08-02T11:15:46.574+03:00", "highlightTitle": ""}