{"organizations": [], "uuid": "a4bae480172549a47b876d5f6cad99cf961441f6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article11741003.ece/ALTERNATES/s1200/JS86742854.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/brexit-vote-impacting-north-east-11741189", "country": "GB", "domain_rank": 21960, "title": "Brexit vote is impacting North East architects' work in London", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Brexit vote is impacting North East architects' work in London", "spam_score": 0.0, "site_type": "news", "published": "2016-08-15T01:30:00.000+03:00", "replies_count": 0, "uuid": "a4bae480172549a47b876d5f6cad99cf961441f6"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/brexit-vote-impacting-north-east-11741189", "ord_in_thread": 0, "title": "Brexit vote is impacting North East architects' work in London", "locations": [], "entities": {"persons": [{"name": "rob charlton", "sentiment": "none"}, {"name": "charlton", "sentiment": "none"}, {"name": "hull", "sentiment": "none"}, {"name": "sally ann norman the rocket", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "wight", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}, {"name": "leeds", "sentiment": "none"}, {"name": "west london", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "portland", "sentiment": "none"}, {"name": "stephenson quarter", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "fitzrovia", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}], "organizations": [{"name": "northumberland council", "sentiment": "none"}, {"name": "london school of economics", "sentiment": "none"}, {"name": "brent cross station", "sentiment": "none"}, {"name": "kings cross", "sentiment": "none"}, {"name": "middlesbrough", "sentiment": "none"}, {"name": "newcastle hq", "sentiment": "none"}, {"name": "newcastle university", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "stephenson quarter development", "sentiment": "none"}, {"name": "space group", "sentiment": "none"}, {"name": "imperial war museum", "sentiment": "none"}, {"name": "clouston group", "sentiment": "none"}, {"name": "chelsea barracks", "sentiment": "none"}, {"name": "google", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Brexit vote is impacting North East architects' work in London 18:30, 14 Aug 2016 Work within the regions remains buoyant for Space Group which has recorded its best year to date despite the Brexit vote Shares   Rob Charlton, chief executive officer of Space Group \nThe director of an expanding North East architecture business has told how the Brexit vote is impacting the industry, just after the firm has recorded its most successful year to date. \nSpace Group was established in 1957 as a straight forward architecture business, but has since evolved into a group embracing new technologies, with offices around the UK and a BIM Technologies division involved in some of Europe’s biggest projects. \nThe Newcastle-headquartered business , which has bases in London, Leeds, Manchester, Hull and Middlesbrough, has recently chalked up record sales and profits – but director Rob Charlton says the vote to leave the EU has spooked investors planning London developments, prompting them to hit the pause button on two projects the firm was involved in. \nWork within the regions, however, remains robust and will see that the firm is not impacted greatly. \n“We’ve just had our best year ever in business last year - profits were up, turnover was up and the cash position is significantly up, said Mr Charlton. \n“Typically, we now move into Brexit and it’s definitely affected the market, without a doubt. Sally Ann Norman The Rocket at the Stephenson Quarter Development in Newcastle \n“We are working on a few projects in central London and they have now been paused. \n“They are multi-phase projects but the third phases have been paused which suggests a little bit of caution. \n“We don’t know what that means - if the projects will start up again or if they have just been paused for now - but London has definitely been affected and the market was red hot there. \n“CEOs with the trusts we are working with are saying the market in London is a bit uncertain. \n“But there’s no impact in regional work because there is much more public sector work.” \nSpace Group currently employs 100 people around the UK, out of its Newcastle HQ, and is increasingly developing technology to support the digitisation of the construction industry. \nThe firm, which recently completed the Crowne Plaza and the Rocket office and are working on future phases of the Stephenson Quarter development, is currently \nworking on Portland park for Northumberland Council, Park View student accommodation for Newcastle University and schools on the Isle of Wight. \nMeanwhile, the BIM Technologies arm of the group is working on Wimbledon court No 1, the Imperial War Museum, The London School of Economics, Brent Cross Station, Chelsea Barracks, Kings Cross station, as well as projects at the Google HQ and Facebook’s HQ in Fitzrovia, West London. \nThe firm’s BIM store is expanding into North America , Australia and mainland Europe and next year Mr Charlton will be bringing BIM Show Live to Newcastle in February 2017, a celebrated calendar event which has previously exhibited in London and Manchester. \nWhile the firm is going from strength-to-strength, Mr Charlton admits recruitment remains an issue. \nHe said: “The real problem is recruitment - our North East growth is restricted by the amount of people with the right skills we can get into the company. \n“Recruitment is tough, getting the right people. \n“So in the short to medium term there’s little impact..it will flatten out, the London market was overheating and as we were struggling to recruit it was putting pressure on our existing team.” \nThe firm is working closely with developers Clouston Group on the Stephenson Quarter project and is a firm believer that the region must look forwar post-Brexit vote. \nMr Charlton added: “My big thing from a business point of view is the fact that Brexit has happened and there’s no going back so we’ve got to get on with it. \n“We’ve got to keep investing and be positive about it. Times are changing, it’s over now. \n“I was very much a remain person but what’s done is done - let’s not talk ourselves into a recession.”", "external_links": [], "published": "2016-08-15T01:30:00.000+03:00", "crawled": "2016-08-14T20:44:05.977+03:00", "highlightTitle": ""}