{"organizations": [], "uuid": "4a6685a7be7cdc9c7f025463b688ac5720aea494", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article11796369.ece/ALTERNATES/s1200/SMMT-International-Automotive-Summit.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/council-chiefs-hold-devolution-talks-11796273", "country": "GB", "domain_rank": 21960, "title": "Council chiefs hold devolution talks with Whitehall - but what's the latest for the North East deal?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Council chiefs hold devolution talks with Whitehall - but what's the latest for the North East deal?", "spam_score": 0.0, "site_type": "news", "published": "2016-08-25T18:30:00.000+03:00", "replies_count": 0, "uuid": "4a6685a7be7cdc9c7f025463b688ac5720aea494"}, "author": "Laura Hill", "url": "http://www.chroniclelive.co.uk/news/north-east-news/council-chiefs-hold-devolution-talks-11796273", "ord_in_thread": 0, "title": "Council chiefs hold devolution talks with Whitehall - but what's the latest for the North East deal?", "locations": [], "entities": {"persons": [{"name": "coun davey", "sentiment": "none"}, {"name": "nick forbes", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "paul watson", "sentiment": "none"}, {"name": "sajid javid", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "grant davey", "sentiment": "none"}, {"name": "javid", "sentiment": "none"}, {"name": "john", "sentiment": "none"}, {"name": "grant davey  reports", "sentiment": "none"}, {"name": "coun watson", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "neca", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "whitehall", "sentiment": "neutral"}, {"name": "sunderland council", "sentiment": "none"}, {"name": "gateshead council", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "north east combined authority", "sentiment": "none"}, {"name": "local government", "sentiment": "none"}, {"name": "sunderland city council", "sentiment": "none"}, {"name": "state", "sentiment": "none"}, {"name": "houses of parliament", "sentiment": "none"}, {"name": "mayoral combined authority", "sentiment": "none"}, {"name": "phillips/pa wire business", "sentiment": "none"}, {"name": "northumberland county council", "sentiment": "none"}, {"name": "newcastle city council", "sentiment": "none"}, {"name": "neca", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Council chiefs hold devolution talks with Whitehall - but what's the latest for the North East deal? 11:30, 25 Aug 2016 The spirit of the devolution deal will remain, Secretary of State for Communities and Local Government Sajid Javid promised leaders Shares Get daily news by email John Phillips/PA Wire Business secretary Sajid Javid \nDevolution for the North East is back on track - but not quite full steam ahead - after crunch talks with Whitehall were held. \nThe £3.4bn deal has been on hold since Britain voted to leave the EU in June, with council leaders who sit on the North East Combined Authority (NECA) unsure where Brexit and the subsequent changes to Government left them. \nBut local authority chiefs including Paul Watson, Sunderland City Council leader and NECA chair, travelled to London this week to seek assurances from new Secretary of State for Communities and Local Government, Sajid Javid. \nThe talks led to Northumberland County Council leader Grant Davey - who was unable to attend the meeting as he was unwell - announcing that the region’s devolution plans are full steam ahead as far as Northumberland was concerned. \nHe said: “This official backing could allow the North East to build on its own success and it’s welcome news that the Government will abide by the deal originally signed.” \nHowever Coun Watson, who made the trip to the capital, was far more cautious. \nHe said: “I wouldn’t say it was full steam ahead. We went to the meeting with lots to discuss. It went all right I would say. \n“He [Mr Javid] confirmed that the Government is to keep the insistence on an elected mayor for the region as part of any deal. We need to discuss our position on that amongst ourselves. \n“The minister was very, very positive and promised to keep the spirit of the agreement, however we need to come back together and work on it. \n“Clearly the threat of Brexit and it’s impact on the economy is still an issue.” Sunderland Council leader Paul Watson \nDivides between the seven council leaders on how to proceed with devolution started to show last month after Newcastle City Council leader, Nick Forbes, saw his amendment to move almost immediately to the next stage of the deal voted out by all other leaders, except Coun Davey. \nIn May, Gateshead Council decided not to carry on with the agreement which will see billions of pounds and powers over transport, housing and planning transferred from Whitehall to the North East. \nWhile Coun Davey has said “the time for talking about devolution is over” and “it is time for us all to roll up our sleeves”, Coun Watson insists the deal is still well away from completion. Read More Where the North East devolution deal stands after reports mayoral plan may be axed \nHe said that the Government would only guarantee promises and pledges made to the region up until this year’s Autumn statement, but that date was far too close for the authorities to push ahead with a devolution deal by. \n“We can’t get it all sorted by them, it is too big. We need to have many more discussions with the Government,” Coun Watson said. \nThe NECA leader stood by the decision to pause plans until the fallout from Brexit had settled, and added: “Even though there has been no election, there has been so many changes, a new Prime Minister, a new Chancellor, a new Secretary of State. \n“We needed to wait. Devolution was the idea of the old Chancellor, a Chancellor who had been fired by the Prime Minister. We didn’t know if she would keep his ideas.” Grant Davey \nReports surfaced earlier this week that Prime Minister Theresa May plans to kill off the policy of regional mayors because she feared the Labour Party could use them to launch a comeback. \nBut the Government poured cold water on the claims, with a Department for Communities and Local Government spokesperson saying: “Devolution deals will continue in the usual way. Elected mayors remain the best way to make them work.” \nAn order creating a Mayoral Combined Authority, which specified that the first election is to take place on May 4 2017, will be discussed in the Houses of Parliament in the week beginning September 5 when it is expected to become law.", "external_links": [], "published": "2016-08-25T18:30:00.000+03:00", "crawled": "2016-08-25T17:25:59.032+03:00", "highlightTitle": ""}