{"organizations": [], "uuid": "af110e64adf67982ed5226726fbe3542c63bf3b4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article11651746.ece/ALTERNATES/s1200/JS33985627.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/lsl-property-services-expects-impacted-11693835", "country": "GB", "domain_rank": 21960, "title": "LSL Property Services expects to be impacted by Brexit, despite 35% lift in profits", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "LSL Property Services expects to be impacted by Brexit, despite 35% lift in profits", "spam_score": 0.0, "site_type": "news", "published": "2016-08-02T14:15:00.000+03:00", "replies_count": 0, "uuid": "af110e64adf67982ed5226726fbe3542c63bf3b4"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/lsl-property-services-expects-impacted-11693835", "ord_in_thread": 0, "title": "LSL Property Services expects to be impacted by Brexit, despite 35% lift in profits", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "none"}, {"name": "simon embley", "sentiment": "none"}, {"name": "embley", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "greater manchester", "sentiment": "none"}, {"name": "tyneside", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "midlands", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "lsl property services", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "lsl", "sentiment": "none"}, {"name": "the group", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "financial services", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "group", "sentiment": "none"}, {"name": "estate agency", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LSL Property Services expects to be impacted by Brexit, despite 35% lift in profits 12:15, 2 Aug 2016 The Newcastle firm's comments come as home ownership in England falls to its lowest level in 30 years Shares Get business news by email A to let sign \nTyneside lettings firm LSL Property Services expects its full-year figures to be impacted by the Brexit vote , despite posting a pre-tax profit lift of 35% in its half-year results. \nThe Newcastle-headquartered business , which runs firms such as Your Move and Reeds Rains, saw revenues rise 8% to £151.4m, while group operating profit rose 10%. and pre-tax profits soared by 35% to £8.4m. \nHowever, despite being pleased with the strong performance for the six months ended 30 June 2016, chairman Simon Embley warns that he expects the residential sales market to “remain suppressed”, prompting a prediction that the firm won’t meet previous expectations for the full year. \nMr Embley said: “The Group has delivered a strong first half performance in a changing market. I am particularly pleased with the profit growth in both Estate Agency and Surveying. \n“Whilst we expect Residential Sales volumes to remain suppressed in the second half, trends in other parts of our business are expected to be more resilient. \n“Our Lettings business continues to perform well, now representing 29% of total Estate Agency income. \n“Mortgage cost and availability remain positive for the UK housing market with increasing distribution of products through intermediary channels which will support our growing Financial Services business. \n“Whilst these are uncertain times in the residential housing market, the Group has strong fundamentals with a robust balance sheet and relatively low levels of gearing. \n“The business will adapt quickly as it has in the past and is well positioned to navigate the current market conditions. I remain confident that LSL will continue to deliver long term value to our shareholders.” \nMr Embley said the EU referendum has impacted UK consumer confidence, making it difficult to forecast market transactions. \nHe added: “Whilst it is difficult to accurately predict market transactions and consumer confidence for the remainder of calendar year 2016, as reported in the Group’s recent pre-interim results trading update, LSL does not expect market conditions to improve sufficiently to meet previous financial expectations for the full year.” Read More Housing crisis sees North East home ownership figures plunge - but why are people turning to rent? \nLSL’s results come on the day it emerged home ownership in England has fallen to its lowest level since 1986, as soaring prices force millions to abandon their dreams of buying their own place. \nThe Resolution Foundation found the proportion of people owning their own home has plummeted across every part of the UK since their peak in the early 2000s, with Greater Manchester seeing the biggest fall. \nThe think-tank said the figures show the longed talked-about London housing crisis has spread, with regions in the north and the Midlands becoming increasingly unaffordable. \nMeanwhile, the UK’s construction industry also recorded it fastest fall since June 2009 as the sector came under pressure from economic uncertainty sparked by Britain’s vote to leave the European Union. \nThe closely-watched Markit/CIPS construction purchasing managers’ index (PMI) was 45.9 in July, down slightly from 46 in June but above economists’ expectations of 44. \nA reading above 50 indicates growth. \nThe report said the drop was driven by the steepest fall in the commercial building sector for more than six-and-a-half years, while civil engineering activity also tumbled for the first time in 2016. \nBut it added that new orders had fallen at a slower pace in July than the month before, indicating some resilience from the sector despite concerns over the Brexit vote.", "external_links": [], "published": "2016-08-02T14:15:00.000+03:00", "crawled": "2016-08-02T14:44:16.084+03:00", "highlightTitle": ""}