{"organizations": [], "uuid": "fc72267f7594444b5ff5bb2468e10be5590fd927", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/29643314/15292036.jpg", "site_section": "http://www.thisisleicestershire.co.uk/generalelection2010/rss.html?chid=182803", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/pwc/story-29643314-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "TomPegden published PwC clients range from big names to start-ups with hopes and...", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "TomPegden published PwC clients range from big names to start-ups with hopes and...", "spam_score": 0.0, "site_type": "news", "published": "2016-08-23T13:23:00.000+03:00", "replies_count": 0, "uuid": "fc72267f7594444b5ff5bb2468e10be5590fd927"}, "author": "TomPegden", "url": "http://www.leicestermercury.co.uk/pwc/story-29643314-detail/story.html", "ord_in_thread": 0, "title": "TomPegden published PwC clients range from big names to start-ups with hopes and...", "locations": [], "entities": {"persons": [{"name": "tompegden", "sentiment": "negative"}, {"name": "paul", "sentiment": "none"}, {"name": "richard iii", "sentiment": "none"}, {"name": "tom pegden", "sentiment": "none"}, {"name": "neighbours", "sentiment": "none"}, {"name": "milton keynes", "sentiment": "none"}, {"name": "paul norbury", "sentiment": "none"}, {"name": "david martin", "sentiment": "none"}], "locations": [{"name": "castle donington", "sentiment": "none"}, {"name": "pegasus park", "sentiment": "none"}, {"name": "east midlands airport", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}, {"name": "leicester city", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "zagreb", "sentiment": "none"}, {"name": "nottingham", "sentiment": "none"}, {"name": "donington", "sentiment": "none"}, {"name": "east midlands", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "croatia", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "balkans", "sentiment": "none"}, {"name": "cambridge", "sentiment": "none"}], "organizations": [{"name": "pwc", "sentiment": "none"}, {"name": "leicester tigers", "sentiment": "none"}, {"name": "pkf cooper parry", "sentiment": "none"}, {"name": "nikon metrology", "sentiment": "none"}, {"name": "dhl", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PwC clients range from big names to start-ups with hopes and dreams By TomPegden | Posted: August 23, 2016 0 COMMENTS SHARES Paul Norbury, senior partner at accounting and business specialists PwC PwC clients range from big names to start-ups with hopes and dreams X \nCopy link to paste in your message / Comments (0) \nBusiness Editor Tom Pegden talks to Paul Norbury, senior partner at accounting and business specialists PwC, about the logistics of covering the whole of the East Midlands from one office \nPaul Norbury oversees one of the biggest accountancy firms in the region. Since taking over at the helm of PwC in Castle Donington three years ago, he said the amount of business coming through the office had grown substantially. \nA friendly, confident and clearly intelligent business leader, he is passionate about supporting the owner-managed businesses that pump so much into the local economy. \nThe 43-year-old physics graduate joined PwC in 1994 and has worked in the Milton Keynes office, as well as London, Birmingham and Cambridge. \nHe also helped establish an office in Zagreb, Croatia, in the late 1990s – following the war in the Balkans. \nPegasus Park, where the Donington office is based, sits in the shadow of East Midlands Airport and has become a successful base for businesses looking for out-of-town accommodation between Leicester, Nottingham and Derby. \nNeighbours include accountants PKF Cooper Parry, airline BMI regional, DHL, measuring machine company Nikon Metrology, a couple of hotels and more. \nIt also works with Leicester Tigers , Leicester City and Dunelm . \nPaul said: \"We have close to 350 people here and have been on this site for 13 years. \n\"Of those 350 we have almost a perfect balance between Leicester, Nottingham and Derby – around 100 from each. \n\"I took over as senior partner here three years ago and the first thing I did was realise how fascinating our geography was – we are like the Switzerland of the East Midlands, in a neutral position. \n\"I realised I had people waking up each morning in those cities and it was interesting to understand the pride and passion people have for where they live so I have three city teams – David Martin leads our Leicester team. \n\"We try to ensure the focus of people who live in Leicester is with clients based in Leicester. \n\"Over the last three years revenues have doubled in size as the East Midlands has become the fastest-growing office in the UK. \n\"Broadly speaking, we have a £200 million Midlands practice – including Birmingham and Milton Keynes – and we are about 40 per cent of that. \n\"There are around 30 UK offices and this is the fastest-growing one. \n\"Moving to Castle Donington was always a natural thing to do and given that our people go out into the region to sit with our clients, it doesn't really matter where we are. \n\"Our growth rate has been fantastic.\" \nAs well as being split around the three cities, he said the business was also split into four sectors – assurance (audit), tax, deals and business consulting. \nPaul said: \"When I arrived, we did not do much in the way of consulting and did a bit of deal work. \n\"We now have a very significant consulting and deals practice. \n\"Deal activity in the East Midlands has been very significant – and from that comes tax and consulting work. \n\"As the economy does well, all parts of our business rise. \n\"The thing about us is that we have depth of knowledge in all four parts of our service. If I invited anybody into the building with any business issue, I would be pretty confident that I would have someone here to deal with it. \n\"It is lovely to have that power here and not have to go somewhere else. I love the fact that there is someone here in the building to sort it out.\" \nPaul said people are often surprised at the calibre of clients using the regional office, but those big firms make up only around a third of the practice. \nHe said: \"The other two thirds of the practice – where I spend most of my time – is private business. \n\"I'm really passionate about entrepreneurs. \n\"There is something lovely about talking to someone who has an idea in the morning and by the afternoon is doing it. \n\"One of the big housebuilding entrepreneurs is a client and comes to us as a one-stop-shop. That's nice because we have a lot of fun working with people like that because of their pace. \nRead more : 2015 was best ever year for tourism in Leicestershire, thanks to Leicester City and Richard III \n\"That's a really important part of what we do. \n\"I went to see a £120 million business within 10 miles of here and they wrongly thought we were too big for them, and that we only worked with FTSE 100 companies, and wouldn't be interested in them. \n\"But if you take our private businesses and lined them up, the median turnover would be somewhere around £25 million. \n\"We have a real spread. There are start-ups with no revenue at all – we have no problem working with businesses that have hopes and dreams. My two real requirements for them are to have complexity and ambition. \n\"Our bread and butter is local, privately-owned businesses and I think the message is starting to get through.\" \nPaul said the firm was in a good position – recruiting staff from competitors rather than losing people – with the East Midlands the fastest-growing part of the UK business outside of London. \nEven through the recession the office continued to invest in graduates. \nHe also said no significant deals had been put off as a result of Brexit, although it was less clear how many deals had not come to market. But nobody was \"panicking\". \nPaul said: \"If September starts positively, that energy and momentum will carry us nicely through to Christmas. \n\"This is a vibrant place, not a backwater economy, and we have a nice mix of businesses here. \n\"We are a service-led economy and have higher value manufacturing, and punch above our weight as a region.\"", "external_links": [], "published": "2016-08-23T13:23:00.000+03:00", "crawled": "2016-08-23T10:33:33.468+03:00", "highlightTitle": ""}