{"organizations": [], "uuid": "4fe46ebcc48aa55aa78be5295741afee70a3c7ce", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article9316627.ece/ALTERNATES/s1200/JS64370164.jpg", "site_section": "", "section_title": "", "url": "http://www.chroniclelive.co.uk/news/north-east-news/direct-newcastle-new-york-flights-11730448", "country": "IE", "domain_rank": 21960, "title": "Direct Newcastle to New York flights to end - airport bosses reveal why - Chronicle Live", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 0, "title_full": "Direct Newcastle to New York flights to end - airport bosses reveal why - Chronicle Live", "spam_score": 0.001, "site_type": "news", "published": "2016-08-10T22:01:00.000+03:00", "replies_count": 0, "uuid": "4fe46ebcc48aa55aa78be5295741afee70a3c7ce"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/direct-newcastle-new-york-flights-11730448", "ord_in_thread": 0, "title": "Direct Newcastle to New York flights to end - airport bosses reveal why - Chronicle Live", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The US company says that, despite increasing passenger numbers, the TransAtlantic route wasn't profitable enough to return in 2017 Shares Get daily news by email Launch of non stop flights to New York from Newcastle with United Airlines \nThe North East suffered a bitter blow with the announcement that direct flights from Newcastle to New York are to end. \nDespite increasing passenger numbers over the two years it has been in operation, United Airlines pulled the plug because it wasn’t profitable. \nWhile Newcastle Airport chiefs are putting a brave face on the news, they are privately seething as one of the reasons for this was the level of Air Passenger Duty (APD). \nFor years they and the region’s business leaders have been trying to persuade the Treasury to abolish or at least slash the rate. Graeme Mason, Planning & Corporate Affairs Director at Newcastle International Airport \nAt present for journeys over 2,000 miles like to the US, it is £73 per passenger in the very cheapest seats, double that in the more expensive ones. \nPlanning and corporate affairs director at the airport, Graeme Mason, said: “There is no doubt that the high levels of APD make it more difficult for new routes to succeed. \n“We have said this for a number of years and lobbied the Government for APD reductions.” \nAnd he revealed another reason for the United decision had an indirect link to the UK leaving the EU after Brexit hit sterling. \nHe said: “The reasons given by United Airlines are i) this seasonal route has not proved to be profitable and ii) because of the anticipated impact of the weaker pound on UK outbound travel. James Ramsbotham, chief executive of the NEECC \n“We were disappointed but understood why the decision has been taken.” \nJames Ramsbotham, chief executive of the North East England Chamber of Commerce, said : “We continue to urge the Government to reform the Air Passenger Duty which effectively acts as a penalty for regional airports like Newcastle. \n“Our campaign will also press ahead to hasten a decision in favour of a third runway at Heathrow, which would be so beneficial for our regional businesses.” \nThe high profile route was opened to much fanfare in 2015 and was a matter of much regional pride. \nUnited Airlines ran a six days a week service to Newark Airport which saw passenger rates go up from 15,000 in 2015 to around 18,000 this season which has been running since May 26 and ends on September 6, now the date of the final flight. United Airlines will fly from Newcastle International Airport to New York \nJust a fortnight ago, Mr Mason had opened talks with United about coming back for a third year, only to be met by the US company’s bombshell decision. \nNick Jones, interim chief executive of Newcastle International, said: “We understand that this will be very disappointing news. \n“We, United Airlines and our regional partners really have given the New York route our best possible shot during its seasonal period of operation.” Read More Newcastle to New York flights to end as United Airlines pulls plug on route \nMr Jones said: “Newcastle International Airport remains very strong, with passenger numbers growing, and a number of new routes, including Berlin, Warsaw and Gdansk, recently announced. \n“This news regarding the New York service is certainly not reflective of the general trend at the Airport.” \nIain Malcolm, leader of South Tyneside Council and leader of the LA7 - the region’s seven local authorities which have a 51% stake in the airport - said: “This is disappointing news. The region pulled together magnificently to secure a New York service, and we have all worked extremely hard to make it work. Councillor Iain Malcolm \n“While it is a blow to lose the service, especially given that numbers were up, the reasons are understandable. \n“Newcastle International Airport, however, remains in good shape with strong growth in passenger numbers and a significant number of new services announced recently.” \nMeanwhile business leaders across the region voiced their disappointment at the news. \nMr Ramsbotham said: “It is disappointing that United Airlines have decided the New York route will not return in 2017 but we understand the airline’s decision. \n“North America remains a key market for the North East economy and we are very fortunate to have several other routes across the Atlantic via hubs such as Heathrow, Dublin, Amsterdam and Paris.” NGI chief executive Sarah Stewart \nMeanwhile Sarah Stewart, chief executive of NewcastleGateshead Initiative, said: “Whilst it’s disappointing news that United Airlines’ direct route to New York won’t return in 2017, Newcastle Airport continues to provide easy access to North America via hub airports. \n“We will continue to work with the Airport to secure opportunities to grow our visitor economy, this includes ongoing support for the new routes announced for 2016 and beyond. \n“Newcastle Airport was recently named the best in the country by Mirror Travel and cheapflights.co.uk so even though we’re sad to see the United Airlines flight go, there is lots of positive activity taking place to bring more visitors to NewcastleGateshead and the wider region.” \nA Treasury spokesperson said: “The Government is committed to making sure APD is a fair tax for airlines and passengers – that’s why we’ve made it cheaper to fly through freezing APD for most passengers since 2012, exempting children and reducing the number of bands, meaning it’s now lower for many more long-haul destinations. \n“Airlines already pay no tax on the fuel used in international flights, no VAT on international flights and unlike in many other countries, no VAT on domestic flights.” ", "external_links": [], "published": "2016-08-10T22:01:00.000+03:00", "crawled": "2016-08-10T16:29:40.909+03:00", "highlightTitle": ""}