{"organizations": [], "uuid": "75c724bd32f16cf5da3203640678d44f6dcd57ab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article11547904.ece/ALTERNATES/s1200/JS69568917.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/accountancy-group-deloitte-sees-fastest-11814068", "country": "GB", "domain_rank": 21960, "title": "Accountancy group Deloitte sees fastest growth in 10 years", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Accountancy group Deloitte sees fastest growth in 10 years", "spam_score": 0.0, "site_type": "news", "published": "2016-08-30T07:00:00.000+03:00", "replies_count": 0, "uuid": "75c724bd32f16cf5da3203640678d44f6dcd57ab"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/accountancy-group-deloitte-sees-fastest-11814068", "ord_in_thread": 0, "title": "Accountancy group Deloitte sees fastest growth in 10 years", "locations": [], "entities": {"persons": [{"name": "tmt", "sentiment": "none"}, {"name": "martin jenkins", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "deloitte", "sentiment": "none"}, {"name": "david sprould", "sentiment": "none"}, {"name": "stephen hall", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}], "organizations": [{"name": "deloitte", "sentiment": "negative"}, {"name": "yorkshire", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Accountancy group Deloitte sees fastest growth in 10 years 00:00, 30 Aug 2016 Revenues top £3bn at group, which has a major office in the North East Shares Get business news by email Stephen Hall, of Deloitte \nAn accountancy group with a major base in Newcastle has topped revenues of £3bn after seeing its fastest growth in 10 years. \nDeloitte increased group revenue by £313m to £3.04bn in the year ended 31 May, with double-digit growth in all five of its business areas: tax, consulting, financial advisory, audit and risk advisory. \nThe company said that success was reflected in the North East, where its Newcastle office now employs nearly 200 people. \nMartin Jenkins, senior partner for the North East and Yorkshire at Deloitte, said: “I’m pleased to report another year of strong growth for the firm and our clients in the North East and Yorkshire in line with the national picture. We have continued to invest across the practice to deepen and broaden our capabilities to serve our clients and make a positive impact on their businesses. \n“All areas of our business contributed positive growth with particularly strong double-digit growth in consulting, tax, risk advisory and in our M&A businesses. \n“From an industry perspective growth was strongest in consumer and industrial products, TMT and in healthcare and life sciences. Our consulting capabilities continue to be a differentiator in the market with drivers of growth being digital and business transformation projects.” Read More 20 questions for Stephen Hall, Newcastle head partner at accountancy firm Deloitte \nThe year saw Deloitte’s merger and acquisitions professionals in the region advise on transactions totalling more than £1bn in value, while its audit practice benefitted from a number of new clients in the current year, in particular in the listed market. \nThe risk advisory practice achieved revenue growth of 22% and while the Tax practice achieved 13% growth. \nThe year also saw Deloitte nationally invest in a number of disruptive start-up companies, most of which were developed by its own staff, while it took staps to broaden its talent pool by changing its recruitment programme to better spot potential, regardless of background. \nStephen Hall, office senior partner in the North East, said: “The success of Deloitte is not only measured in the positive impact we make for our clients, but in the difference we make to the wider community. \n“Our work with our charity partners and with social enterprises has demonstrated that by providing support that goes beyond just raising money, business can play a vital role in helping them grow their organisations in a robust and durable way. \n“In the North East our employees engage with a wide range local initiatives, not only raising funds, but making tangible differences to communities.” \nDeloitte’s chief executive David Sprould said Brexit was likely to lead to a slowdown in the UK economy in the second half of the year and called on the Government to give businesses clarity on how it will negotiate with the EU.", "external_links": [], "published": "2016-08-30T07:00:00.000+03:00", "crawled": "2016-08-30T02:43:28.754+03:00", "highlightTitle": ""}