{"organizations": [], "uuid": "75a1ff87cb43742ac4430f04cc7e30978ed52bc8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article11816587.ece/ALTERNATES/s1200/JS69403219.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/business-breakfast-live-north-east-11816589", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: North East is \"least prosperous\" region in Barclays' wealth and wages report", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast LIVE: North East is \"least prosperous\" region in Barclays' wealth and wages report", "spam_score": 0.0, "site_type": "news", "published": "2016-08-30T15:05:00.000+03:00", "replies_count": 0, "uuid": "75a1ff87cb43742ac4430f04cc7e30978ed52bc8"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/business-breakfast-live-north-east-11816589", "ord_in_thread": 0, "title": "Business Breakfast LIVE: North East is \"least prosperous\" region in Barclays' wealth and wages report", "locations": [], "entities": {"persons": [{"name": "sheffield", "sentiment": "none"}, {"name": "anna leach", "sentiment": "none"}, {"name": "sigmar gabriel", "sentiment": "none"}, {"name": "deloitte", "sentiment": "none"}, {"name": "akshaya bhargava", "sentiment": "none"}, {"name": "frank van zanten", "sentiment": "none"}, {"name": "angela merkel", "sentiment": "none"}, {"name": "iver heath", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "leon bressler", "sentiment": "none"}, {"name": "james bond", "sentiment": "none"}, {"name": "ivan dunleavy", "sentiment": "none"}, {"name": "daniel craig", "sentiment": "none"}, {"name": "gabriel", "sentiment": "none"}, {"name": "merkel", "sentiment": "none"}, {"name": "matthias fekl", "sentiment": "none"}, {"name": "coreena ford", "sentiment": "none"}, {"name": "stephen hall", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "bristol", "sentiment": "none"}, {"name": "barclays prosperity map  every", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "pinewood", "sentiment": "none"}, {"name": "buckinghamshire", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "deloitte", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "wales", "sentiment": "none"}, {"name": "cardiff", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "hungary", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "east midlands", "sentiment": "none"}, {"name": "south east", "sentiment": "none"}, {"name": "eastern england", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "cambridge", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}], "organizations": [{"name": "coreena ford optimism", "sentiment": "negative"}, {"name": "barclays", "sentiment": "negative"}, {"name": "cbi", "sentiment": "negative"}, {"name": "silwell kft", "sentiment": "none"}, {"name": "pinewood studios", "sentiment": "none"}, {"name": "barclays prosperity map", "sentiment": "none"}, {"name": "aermont capital", "sentiment": "none"}, {"name": "social democratic party", "sentiment": "none"}, {"name": "bunzl", "sentiment": "none"}, {"name": "financial conduct authority", "sentiment": "none"}, {"name": "deloitte", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "coreena ford deloitte", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "bidco", "sentiment": "none"}, {"name": "christian democratic union", "sentiment": "none"}, {"name": "fca", "sentiment": "none"}, {"name": "coreena ford pinewood studios", "sentiment": "none"}, {"name": "coreena ford", "sentiment": "none"}, {"name": "coreena ford bunzl", "sentiment": "none"}, {"name": "apex sanitation products", "sentiment": "none"}, {"name": "cbi head of economic analysis", "sentiment": "none"}, {"name": "transatlantic trade and investment partnership", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "8.44 Coreena Ford Optimism falls in service sector - CBI report \nThe pace of business volumes growth in the business and professional service sector slowed, and remained stable in consumer services, in the three months to August. \nHowever, optimism fell sharply, according to the CBI’s latest quarterly Service Sector Survey. \nBusiness and professional services firms – which include accountancy, legal and marketing firms – reported that business volumes were unchanged on the quarter, after rising in May. \nMeanwhile, consumer services companies – which include hotels, bars, restaurants, travel, leisure – saw further moderate growth in business volumes. \nIn the first quarterly Service Sector Survey since the UK’s decision to leave the European Union, optimism in both sub-sectors fell sharply. In business and professional services, it fell at the fastest pace in nearly five years, while in consumer services, it dropped at its fastest since the financial crisis, in February 2009. \nBusiness expansion plans in business and professional services were the weakest since May 2012. \nEmployment growth in both sub-sectors remained above average, and was at the strongest level this year in consumer services, but is expected to slow over the next quarter. Growth in spending on training and retraining also remained resilient. \nAcross the sector as a whole, investment plans for the year ahead were brought back into line with long-run averages, having seen a stronger start to 2016. Business and professional services firms expect to maintain investment spending on land and buildings, while spending on vehicles, plant & machinery will be pruned back over the next year. In consumer services, investment in land and buildings will continue to grow, but at a slower pace, whilst expenditure in vehicles, plant & machinery will be flat on the year. IT expenditure will continue to see robust growth in the sub-sectors. \nAnna Leach, CBI Head of Economic Analysis and Surveys, said: \nWhilst the service sector has been rocked by the stormy waters of Brexit, especially when it comes to firms’ sense of optimism, the actual slowdown in growth on the office and shop floor has been relatively modest. \nIt’s encouraging that employment numbers have remained robust, especially in the consumer services sector. But looking ahead, the service sector faces a challenging environment in which to grow and invest, with uncertainty about demand weighing on firms’ minds. \nTo shore up confidence across the economy, the Government must clearly communicate plans for negotiations to leave the EU, and demonstrate its commitment to stimulating growth and driving investment with an ambitious Autumn Statement. 8.40 Coreena Ford French trade minister calls for end of talks on EU-US trade deal \nProspects for the proposed EU-US trade deal have been cast into further doubt after the French trade minister called for an end to talks. \nMatthias Fekl, the French minister for foreign trade, has tweeted this morning that the country is calling for negotiations on the Transatlantic Trade and Investment Partnership (TTIP) to cease. \nHis comments came after German economy minister Sigmar Gabriel said at the weekend that the current round of talks with the US have “de facto failed, even though nobody is really admitting it”. \nHis views were in marked contrast to public comments by German Chancellor Angela Merkel, who said last month the proposed US-EU deal was “absolutely in Europe’s interest”. \nBut Mr Gabriel, who is the head of Germany’s centre-left Social Democratic Party which is in coalition with Ms Merkel’s centre-right Christian Democratic Union, said: “We mustn’t submit to the American proposals.” \nThe prospect of TTIP failing could also be welcomed on the left of British politics, as Labour leader Jeremy Corbyn has been a prominent critic of the proposed deal. 8.36 Coreena Ford Pinewood Studios takeover is rubber-stamped \nThe proposed takeover of Pinewood Studios by an international property fund for £323 million has been given the green light by Britain’s financial regulator. The Financial Conduct Authority (FCA) has rubber-stamped the deal by Aermont Capital, headed up by French property tycoon Leon Bressler, to acquire the famous home of the James Bond and Star Wars films. “The boards of directors of Bidco and Pinewood are pleased to announce that they have received approval from the FCA,” the firms said in a statement. Shareholders will now vote on the deal on September 19. In July, Pinewood said the plunge in sterling following Britain’s decision to quit the European Union would give it a boost, adding that the impact of Brexit would be “largely mitigated” as its most significant customers are based in the US. Chief executive Ivan Dunleavy said at the time: \nThe result of the UK’s referendum on membership of the EU is now known. \nIn the context of our business, the decline in the sterling exchange rate is undoubtedly positive for our international customers. \nRevenues at Pinewood, which is based in Iver Heath, Buckinghamshire, grew 10.9% to £83.2 million last year while operating profit soared 136.3% to £13.6 million. Daniel Craig in James Bond mode - one of the series filmed at Pinewood 8.21 Coreena Ford Deloitte sees fastest growth in 10 years \nOur top regional story of the day is on accountancy group Deloitte, which has seen revenues top £3bn . \nThe company said that success was reflected in the North East, where its Newcastle office now employs nearly 200 people. \nStephen Hall, office senior partner in the North East, said: \nThe success of Deloitte is not only measured in the positive impact we make for our clients, but in the difference we make to the wider community. \nOur work with our charity partners and with social enterprises has demonstrated that by providing support that goes beyond just raising money, business can play a vital role in helping them grow their organisations in a robust and durable way. Stephen Hall, of Deloitte 8.15 Coreena Ford Bunzl profits rise to £155m as group expands \nBusiness supplies firm and outsourcer Bunzl has notched up a rise in profits for the first half of the year and announced a trio of acquisitions. \nPre-tax profits rose 6% to £155.6 million in the period, driven by a strong performance in continental Europe. Revenues were up 10% to £3.4 billion. \nThe group added that it has bagged two businesses in Canada - cleaning products firms Plus II Sanitation Supplies and Apex Sanitation Products, and Silwell Kft, a disposable food service company in Hungary. \nBunzl chief executive Frank van Zanten, who took up the role in April, said: \nGoing forward, we will focus on further expansion of the group, continuing our investments in IT and digital projects and intensifying the sharing of best practice across our businesses globally. \nHowever, revenue and profits dipped in the UK and Ireland, with the firm flagging a “weaker performance”. \nOn Brexit, Bunzl said that while it is “difficult to give a firm view as to the probable impact of the recent referendum result in the UK”, it does not expect the impact on its business to be significant. More than 85% of its business is based outside the UK. \nBunzl hiked its interim dividend by 11% to 13p per share. 8.08 Coreena Ford FTSE and Pound latest \nThe FTSE-100 index opened at 6838.05. \nThe pound at 8am was 1.3070 dollars compared to 1.3088 dollars at the previous close. The euro at 8am was 0.8549 pounds compared to 0.8541 pounds at the previous close. 8.00 Coreena Ford Top Story - North East is \"least prosperous\" region in Barclays Prosperity Map \nEvery region in Britain is more prosperous than last year with wealth, spending or earnings on the rise - but the North East comes bottom of the list as the least prosperous area. \nThat’s the findings of the Barclays Prosperity Map, a report which studied the 12 months to April 2016. \nThe lender’s report calculates regional scores based on an array of factors such as gross domestic product (GDP), house prices, charitable giving, working hours and average house prices. \nWhile London still ranks as the UK’s most prosperous city, others are “emerging as prosperity hotspots,” the report added. \nScotland saw the biggest increase to household wealth, which rose by 13% versus London’s 12% rise. \nThe North East emerged as the least prosperous region in the UK, although Barclays noted an “impressive” 6% increase in average annual earnings, reaching £24,748. \nThe news comes despite economic uncertainty sparked by China’s economic slowdown, stock market turmoil and the Brexit vote. \nAkshaya Bhargava, chief executive of wealth, entrepreneurs and business banking at Barclays said: \nIt is very encouraging to see the upward trajectory for prosperity in the UK continuing despite recent global volatility. \nBarclays said the rise in Scotland was likely linked to its median private pensions wealth, which jumped 60% compared to 19% in England and 24% in Wales. Scotland advanced in the rankings to become the seventh most prosperous region on the index, behind the East Midlands, Northern Ireland, South West and Eastern England, South East and London. \n“This is in stark comparison to London, where average earnings dropped by 1% in the same time period,” the report explained. \nMeanwhile, Bristol and Cambridge have become “increasingly attractive areas to live and work,” with house prices rising 13% and 14% respectively in the 12 months to April. That is compared to the capital’s housing market, which saw price growth of 11% during the same period. \nManchester, Cardiff and Sheffield saw some of the strongest turnover amongst small and medium sized businesses, up 15%, 12% and 11%, respectively.", "external_links": [], "published": "2016-08-30T15:05:00.000+03:00", "crawled": "2016-08-30T10:53:28.682+03:00", "highlightTitle": ""}