{"organizations": [], "uuid": "5dd5048a1fbd138d9599fc2b3a80b2bdc42f9ec5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article11113402.ece/ALTERNATES/s1200/JS84735793.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/ukip-must-reform-die-warns-11731387", "country": "GB", "domain_rank": 21960, "title": "UKIP must reform or die, warns North East leadership candidate Jonathan Arnott", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "UKIP must reform or die, warns North East leadership candidate Jonathan Arnott", "spam_score": 0.0, "site_type": "news", "published": "2016-08-10T22:36:00.000+03:00", "replies_count": 0, "uuid": "5dd5048a1fbd138d9599fc2b3a80b2bdc42f9ec5"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/ukip-must-reform-die-warns-11731387", "ord_in_thread": 0, "title": "UKIP must reform or die, warns North East leadership candidate Jonathan Arnott", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "UKIP must reform or die, warns North East leadership candidate Jonathan Arnott 15:36, 10 Aug 2016 15:37, 10 Aug 2016 By Jonathan Walker MEP Jonathan Arnott says he'll deal with splits in the party as he vows to replace the controversial Nigel Farage as leader Shares Get daily news by email Jonathan Arnott MEP \nUKIP must “reform or die”, the North East MP hoping to become the party’s new leader has warned. \nJonathan Arnott said UKIP is in danger because of the divisions within the party. \nAnd he said he had a vision to unite it, and bring democracy to its internal structures. \nHe is one of six candidates hoping to replace Nigel Farage as party leader, after Mr Farage announced plans to quit following the EU referendum vote. \nThe Brexit vote could be seen as a major triumph for UKIP, which has always opposed EU membership, but contest has highlighted deep divisions within the party. \nEarly favourites Suzanne Evans and Steven Woolfe were controversially excluded from the race. \nAnd three members of the party’s ruling board quit in protest at the decision that Mr Woolfe would not be allowed to stand. Read More Who is Jonathan Arnott and how does the North East fit within his vision of Ukip? \nMr Arnott said that his experience serving as UKIP’s General Secretary from 2008 to 2014 made him uniquely placed to understand the inner workings of the party. \nAnd he suggested changing the way the party is run to ensure members in every region has some influence. \nHe said: “Under my leadership we’ll have an internal referendum about switching to regional representation on our National Executive Committee, to make sure that everyone can know their NEC representative.” \nHe added: “I’ll propose modernising our Party Constitution so that our structures are more robust. UKIP must reform its internal structures or die. But we can’t achieve reform by leading the Party up a blind alley, which some have called to do. \nMeanwhile, rival candidate Bill Etheridge, an MEP in the West Midlands, was forced to defend posing with a golliwog doll 2011 and previous comments suggesting that young party supporters should study the speaking style of Adolf Hitler. Read More UKIP leadership hopeful Lisa Duffy defends her call for ban on Muslim veils in public places \nAsked if he was “too eccentric” to lead the party, the MEP told BBC Radio 4’s Today programme: “The comments from the past are perfectly reasonable things about political correctness in the one instance and in the other thing I was simply saying you have got to look at how people deliver their speeches, just like I said about Tony Blair and all sorts of other people.” \nAnd candidate Lisa Duffy called the Muslim veil to be banned in public buildings, shopping centre and on buses and trains. \nShe also demanded the closure of Islamic faith schools until the problem of Islamist terrorism is dealt with, as well as a “complete and comprehensive ban” on sharia courts in the UK. \nUKIP’s leader in Scotland warned this week that Berwick-upon-Tweed would become “the new Calais” if Scotland becomes independent. \nDavid Coburn said England would need to erect “a barbed-wire frontier at Berwick-upon-Tweed” to stem the flow of immigrants trying to cross the border. \nHe claimed Syrian refugees settled on the Isle of Bute are “keen to leave” for jobs in England.", "external_links": [], "published": "2016-08-10T22:36:00.000+03:00", "crawled": "2016-08-10T17:56:51.655+03:00", "highlightTitle": ""}