{"organizations": [], "uuid": "0b011aca2af8af030eaf87e92644a6105dc3fe69", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article11819907.ece/ALTERNATES/s1200/JS94020315.jpg", "site_section": "", "section_title": "", "url": "http://www.chroniclelive.co.uk/news/north-east-news/warm-geordie-welcome-europe-newcastle-11819639", "country": "IE", "domain_rank": 21960, "title": "A warm Geordie welcome for Europe: Newcastle rally aims to spread message loud and clear - Chronicle Live", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 0, "title_full": "A warm Geordie welcome for Europe: Newcastle rally aims to spread message loud and clear - Chronicle Live", "spam_score": 0.001, "site_type": "news", "published": "2016-08-31T16:30:00.000+03:00", "replies_count": 0, "uuid": "0b011aca2af8af030eaf87e92644a6105dc3fe69"}, "author": "Barbara Hodgson", "url": "http://www.chroniclelive.co.uk/news/north-east-news/warm-geordie-welcome-europe-newcastle-11819639", "ord_in_thread": 0, "title": "A warm Geordie welcome for Europe: Newcastle rally aims to spread message loud and clear - Chronicle Live", "locations": [], "entities": {"persons": [{"name": "geordie", "sentiment": "negative"}, {"name": "jonathan", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "anna donne", "sentiment": "none"}, {"name": "christopher", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "parliament square", "sentiment": "none"}, {"name": "grey", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "european union", "sentiment": "none"}, {"name": "houses of parliament", "sentiment": "none"}, {"name": "newcastle rally for europe", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "A warm Geordie welcome for Europe: Newcastle rally aims to spread message loud and clear 08:30, 31 Aug 2016 Following fall-out over Brexit, pro-Europeans are invited to join a Newcastle Rally for Europe at Grey's Monument in the city Shares Get daily news by email Jonathan Brady/PA Wire Remain supporters gather in Parliament Square, London, to take part in the March for Europe rally to to show their support for the European Union in the wake of Brexit \nA rally is being organised in Newcastle aimed at fostering warm Geordie relations with the rest of Europe. \nIn the fall-out from the Brexit vote, a Facebook page has been set up in protest at the EU Referendum result and in the hope of scuppering Article 50. \nNewcastle Rally for Europe is urging supporters to attend a three-hour rally at Grey’s Monument on October 15, saying: “We are asking you to come together, in a city that voted to remain in the EU, to celebrate our close links and our partnerships with Europe. \n“Help us build a powerful and impactful rally by creating your best banners yet!” \nA online fundraiser has been set up with a target of £300 to help make sure the rally is as high-profile as it can be. \nOrganisers claim a rise in racist incidents is giving out the wrong image of the North East, and the post adds: “Here in the North East we have a well-established reputation for being an open and friendly lot. \n“In these post-Referendum times let’s not allow the growing voices of hatred, bigotry and prejudice to change the warm welcome for all that has always been at the heart of Newcastle’s collective spirit.” \nHosted by Anna Donne, from Newcastle, the page claims the North East could lose up to £430m in EU funding after Brexit and that 160,000 local jobs are closely linked to EU membership and rely on its trade, which is also bolstered worldwide. \nIt adds: “As we stand on the verge of another recession, we witness with worry how local employers halt investment and freeze recruitment. Christopher Furlong/Getty Images Protesters gather in front of the Houses of Parliament as they demonstrate against the EU referendum result \n“We are left to contemplate powerful symbols of EU investment like The Angel of the North, the Theatre Royal or the impressive regeneration of the Quayside and the Ouseburn as things of the past as we move into an uncertain future.” \nThe aim is to showcase the region as “international, positive, forward looking and optimistic” while making a stand against xenophobia and recent racism, it said. \nAnd its firm message is: “We don’t want to lose our European citizenship”. \nThe post adds: “Our aim is to keep Britain working in partnership with Europe and with the European Union, economically, politically and culturally. \n“We are resolute in our aim of preventing the triggering of Article 50 without prior consultation with the public and with Parliament.” \nCrowdfunding is under way and a March for Europe video has been posted offering followers a guide on how to make a placade. \nTo date, 55 people have said they are going to the rally, which will start at 1pm on the day, and a further 174 are interested in joining them. More on the EU Referendum ", "external_links": [], "published": "2016-08-31T16:30:00.000+03:00", "crawled": "2016-08-31T11:00:47.271+03:00", "highlightTitle": ""}