{"organizations": [], "uuid": "ea068639e7c12608f6f78f4c9de01836be91cb7f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/29598121/15120430.jpg", "site_section": "http://www.thisisleicestershire.co.uk/weathernews/rss.html?chid=182806", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/brexit-fears-yet-to-be-realised/story-29598121-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "Leicester Mercury published Brexit? What Brexit?", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "Leicester Mercury published Brexit? What Brexit?", "spam_score": 0.0, "site_type": "news", "published": "2016-08-09T11:07:00.000+03:00", "replies_count": 0, "uuid": "ea068639e7c12608f6f78f4c9de01836be91cb7f"}, "author": "Leicester Mercury", "url": "http://www.leicestermercury.co.uk/brexit-fears-yet-to-be-realised/story-29598121-detail/story.html", "ord_in_thread": 0, "title": "Leicester Mercury published Brexit? What Brexit?", "locations": [], "entities": {"persons": [{"name": "wayne shepp", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "tom pegden", "sentiment": "none"}, {"name": "devol", "sentiment": "none"}, {"name": "paul o'leary", "sentiment": "none"}, {"name": "westleigh", "sentiment": "none"}], "locations": [{"name": "leicester", "sentiment": "none"}, {"name": "whetstone", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "ibstock", "sentiment": "none"}, {"name": "leicester mercury", "sentiment": "none"}, {"name": "east midlands chamber of commerce", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "bank of england", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Leicester Mercury | Posted: August 09, 2016 0 COMMENTS SHARES Ibstock chief executive Wayne Sheppard Brexit? What Brexit? \nCopy link to paste in your message / Comments (0) \nBlimey, there's been a lot of doom and gloom lately, writes Business Editor Tom Pegden. \nLast week the Bank of England cut interest rates to a record low of 0.25 per cent, and said the outlook for growth in the short to medium term had \"weakened markedly\" with the likelihood that unemployment would go up. \nIt warned there was likely to be little economic growth in the second half of this year. \nThe negativity was echoed by Enderby-based fashion retailer Next. \nIt said that, despite no evidence yet of any post-Brexit effect on consumer behaviour, the devaluation of the pound would likely send the cost of its overseas supplies up at some point. \nThen there was the East Midlands Chamber of Commerce, reporting that if we're not careful we could talk ourselves into recession. \nNice kitchens are still selling despite concerns over the economy \nWell, with that in mind, I'm going to put a brave face on it. \nFirstly, it looks like the timing of the EU vote seemed to fall quite nicely. \nIt meant despite the initial fears and tribulations that struck the markets and scared the analysts, everything soon settled as the summer holidays approached. \nFor the past few weeks, many movers and shakers have been away enjoying a well-earned break, while those stuck in the office have been able to bury their heads in the sand – if they have any sense at least – safe in the knowledge that we'll only get to know the real impact on consumer spending and business confidence come the autumn. \nSecondly, a lot of business going on this summer doesn't seem to have been doing too badly. \nBoth Next and county brick maker Ibstock reported last week they were swimming along quite nicely after the vote. \nAnd, as reported on page one of today's supplement, Paul O'Leary, of Leicestershire-based deVOL Kitchens, said he had no qualms about spending £2.1 million on a four-storey showroom and flat in London the day after the vote. \nRead more: Trendy deVOL kitchens buy four-storey shop in London \nHis business is doing just fine, selling kitchens to the rich and famous, and did its busiest month ever in the weeks leading up to the vote. \nWhile Westleigh homes, of Whetstone, was happy to sign off a deal to buy a vacant 6.7-acre site in Leicester just days after the vote. \nWestleigh, deVOL and a whole host of other businesses out there are doing the complete opposite of talking us into a recession. \nAnd maybe, just maybe, that will continue when the summer silly season comes to an end.", "external_links": [], "published": "2016-08-09T11:07:00.000+03:00", "crawled": "2016-08-09T13:00:39.255+03:00", "highlightTitle": ""}