{"organizations": [], "uuid": "b8d50bdbbdd6562d234a237e602050de414ee195", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article11733123.ece/ALTERNATES/s1200/JS96774665.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/labour-leadership-hustings-gateshead-live-11737860", "country": "GB", "domain_rank": 21960, "title": "Labour leadership hustings in Gateshead: LIVE updates as Jeremy Corbyn and Owen Smith go head-to-head", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Labour leadership hustings in Gateshead: LIVE updates as Jeremy Corbyn and Owen Smith go head-to-head", "spam_score": 0.0, "site_type": "news", "published": "2016-08-12T01:25:00.000+03:00", "replies_count": 0, "uuid": "b8d50bdbbdd6562d234a237e602050de414ee195"}, "author": "Daniel Milligan", "url": "http://www.chroniclelive.co.uk/news/north-east-news/labour-leadership-hustings-gateshead-live-11737860", "ord_in_thread": 0, "title": "Labour leadership hustings in Gateshead: LIVE updates as Jeremy Corbyn and Owen Smith go head-to-head", "locations": [], "entities": {"persons": [{"name": "jeremy corbyn", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "owen smith", "sentiment": "none"}, {"name": "iain buist", "sentiment": "none"}, {"name": "michael muncaster smith", "sentiment": "none"}, {"name": "michael muncaster  jeremy corbyn", "sentiment": "none"}, {"name": "smith", "sentiment": "none"}, {"name": "andy burnham", "sentiment": "none"}, {"name": "brexit  corbyn", "sentiment": "none"}, {"name": "ed miliband", "sentiment": "none"}, {"name": "michael muncaster blackout", "sentiment": "none"}, {"name": "rick", "sentiment": "none"}, {"name": "jeremy", "sentiment": "none"}, {"name": "iain buist jeremy corbyn", "sentiment": "none"}, {"name": "michael muncaster corbyn", "sentiment": "none"}, {"name": "daniel milligan", "sentiment": "none"}, {"name": "daniel milligan full", "sentiment": "none"}, {"name": "liz kendall", "sentiment": "none"}, {"name": "yvette cooper", "sentiment": "none"}, {"name": "sophy ridge", "sentiment": "none"}, {"name": "sophie ridge", "sentiment": "none"}, {"name": "michael muncaster", "sentiment": "none"}, {"name": "sophy", "sentiment": "none"}], "locations": [{"name": "gateshead", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "cardiff", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "iraq", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "liverpool", "sentiment": "none"}, {"name": "gateshead hilton", "sentiment": "none"}, {"name": "hilton", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "london underground", "sentiment": "none"}, {"name": "tyne bridge", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "none"}, {"name": "hilton newcastlegateshead for labour", "sentiment": "none"}, {"name": "gmb", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "national executive committee", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "royal courts of justice", "sentiment": "none"}, {"name": "tories", "sentiment": "none"}, {"name": "nec", "sentiment": "none"}, {"name": "hilton", "sentiment": "none"}, {"name": "sky news", "sentiment": "none"}, {"name": "national investment bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Who was ahead in the polls? \nCorbyn claims Labour were ahead in the polls before the challenge to his leadership. \nOwen Smith points out that this is not true. \nHe says: “You said this last time, and I know we live in a post-truth era, but it’s not true. We’ve been behind in the polls consistently. Ed Miliband at this point in the cycle was 9 points ahead in the polls.” \nSophy Ridge had to intervene as people in the audience began to shout. \n“We’ve just got to be honest with ourselves, comrades. Our popularity ratings are desperate. It isn’t enough for us to say we’ve won a parish council election in Thanet.” \nHe says it’s not a case of trading principles for power - but he’s not prepared to stand by and engage in debate without the prospect of power. 19:55 Michael Muncaster \nJeremy Corbyn and Owen Smith calling for better gender equality in the party. \n“We have to encourage real equality in our society” says Corbyn. \nOwen Smith says “Labour Party has not been good enough” but they need to make sure there are more top jobs for women in shadow cabinet 19:50 Michael Muncaster \nTo laughter from the audience, Sophy asks about energy supply. \n“Who said irony was dead”, Owen Smith joked. \nHe says we need to invest more in renewables, restore the department of Climate Change (closure of which was, he said “an act of economic vandalism”) and encourage more investment in wind and wave power. \nJeremy Corbyn says there are lots of ways you can innovate in energy supply - citing the example of homes being heated by the warmth from the London Underground. \nBut for these innovations to develop, he says, Government needs to invest in it. 19:47 Michael Muncaster Blackout on stage \nRight in the middle of Corbyn and Smith’s argument on Trident....the lights have gone out. \nGloom gripped the room at the Gateshead Hilton as Mr Smith joked: “I blame the Tories.” \nBut Mr Corbyn said: “It’s obviously a fuse.” \nTheir hustings clash descended into farce when tiny star-like bulbs glittered from above as emergency lighting took hold. \nThe blackout happened as moderator Sophy Ridge prepared to quiz the pair on energy supply. 19:44 Michael Muncaster Talks on Trident \nJeremy Corbyn says he opposes Trident, and would carry out Britain’s obligations under the non-proliferation treaty and work towards disarming. \nHe says nuclear weapons are weapons of mass destruction, that indiscriminately kill millions of people and cause environmental disasters. \nOwen Smith says he wants to see a nuclear free world - they are appalling and their use is unimaginable. \nBut he says Jeremy’s plan is to get rid of ours first and hope everyone else does too. \nIf we’re going to keep them while working towards disarmament, he says, then we have to renew them. Iain Buist Jeremy Corbyn and Owen Smith on stage 19:39 Michael Muncaster How to keep Britain safe \nCorbyn now being asked about keeping Britain safe. \nHe says we need to recognise the failure of Iraq war - which he voted against. \nFirst duty of any government is to keep the people safe and Tories haven’t done that cutting police services, claims Smith. 19:36 Michael Muncaster Smith's plan for growth and jobs \nOwen Smith says his plan for jobs and growth would come down to “partnership”. \nHe says Britain doesn’t need a Tory government that “gets out of the way” - but an active, interventionist government which gets involved in partnerships with British businesses. \nCorbyn agrees that there should be intervention and protection of high tech jobs, as well as offering more and better apprenticeships. \nHe says there needs to be more focus on manufacturing - citing Germany as an example of where this has worked. This has been ignored, he says, and we have become overreliant on service industries. 19:32 Michael Muncaster Big crowd in \nThere is a 400-strong crowd packed into the Hilton hotel, based on the Gateshead side of the Tyne Bridge. Crowd at the Hilton NewcastleGateshead for Labour leadership hustings 19:30 Michael Muncaster Economy talk \nRight we’re moving on to the economy. \nSmith says we need more jobs in the North East and we need a government which has an industrial strategy. \nCorbyn calls for investment in technology and people. He says apprenticeships are key and a National Investment Bank would support this. 19:25 Michael Muncaster Corbyn responds to claims \nJeremy Corbyn says he has “a couple of things to clean up there”. \nHe says he did work hard on the campaign trail - and his local constituency voted to remain. \nHe goes on to say he raised concerns about some things about the EU, but that he was positive in his campaigning. \nCorbyn thinks there’s no point denying the result - “When I said invoke article 50 - article 50 is going to be invoked.” \nHe says his team have a strategy about the changing nature of the UK’s relationship with Europe. 19:23 Michael Muncaster Smith says Corbyn didn't do enough \nBig applause, and some boos, for Owen Smith as he says Jeremy Corbyn didn’t work hard enough to keep us in the EU. \nHe says Corbyn said he was 7/10 on the EU before the referendum, but he’s now 10/10 for coming out. \nAnd he noted that Jeremy said last week that he’d never said we should invoke article 50 now - but he did, “and we have it on video.” \nHe says “If it turns out we’ve been lied to on the NHS and on other things we should vote again to stay in.” 19:20 Michael Muncaster \"Crisis for our country” \nLeaving the EU is “a crisis for our country”, according to Smith. He says he doesn’t want Britain to leave Europe and demand a seat at the table. 19:18 Michael Muncaster Corbyn's thoughts on Brexit \nCorbyn says he was “shocked” and “disappointed at the result” of the EU referendum. \nBut he says we now have to recognise the result. He says we now need to ensure we have a good relationship with the EU, and don’t end up a “bargain basement” island off the coast of Europe. 19:15 Michael Muncaster EU Referendum reaction \nSophie Ridge from Sky News is asking the audience to remain respectful to both candidates. They are being asked to not shout out. \nBoth candidates say they are gutted Britain has voted to leave the EU. Smith is disappointed with how hard Labour Party fought to stay. \nSmith: “Leadership Jeremy showed wasn’t sufficient” on EU. Draws huge boos from the crowd. \nSmith says if he was the leader he would argue for a better Brexit deal - cue cheers from audience. Iain Buist Jeremy Corbyn and Owen Smith on stage 19:09 Michael Muncaster \nI’ve had a quick chat with two couples who are both supporting Corbyn. \nThey think he is the right man to lead the party forward Rick Findler/PA Wire 19:07 Michael Muncaster “Choose Labour’s next prime minister” \nThe words “choose Labour’s next prime minister” are projected on the wall behind the stage. \nBe interesting to see which way the crowd sways 19:05 Daniel Milligan And we're off! \nHere we go - a little late, but here nontheless. \nJeremy Corbyn and Owen Smith have taken the stage to a warm standing ovation from the audience. \nAnd before Sophy Ridge even got the chance to start....we had our first couple of heckles (sadly indecipherable.) 19:00 Daniel Milligan Full to capacity \nIf youw ere hoping for a seat at tonight’s event, you’ll be lucky. It’s pretty full to capacity. 18:54 Daniel Milligan Who picks the questions? \nAll the questions have been posed by audience members at the event, who wrote them when applying. \nThey have all been selected in advance. \nThere will be no opening statements. \nEach question will allow a 40-second answer from each candidate before opening up to a general debate. \nEach candidate will then get two minutes at the end to sum up their argument. 18:52 Daniel Milligan Who is in the audience? \nThere will be a studio audience of 400 Labour members and supporters, who have been invited by the regional Labour party . \nEach side have been allowed to bring a small number of their own supporters - around 15 each - to be in the audience. 18:50 Daniel Milligan Video: Corbyn mobbed on arrival \nJeremy Corbyn arrived at the Hilton hotel a few moments ago - here is a video of that. Video loading Click to play Tap to play The Live Event you are trying to watch is either unavailable or has not started Please refresh this page in your browser to reload this live event video 18:45 Daniel Milligan \nThere has been a good turnout from the Jeremy Corbyn supporters. Iain Buist 18:40 Daniel Milligan Live from the venue \nA reminder that the meeting starts at around 7pm at the Hilton hotel - reporter Michael Muncaster is at the venue for us this evening so we’ll have some updates from him very soon. 18:35 Daniel Milligan Are there any more events? \nThe Gateshead event is one of nine hustings planned by the Labour party, with six venues confirmed so far. The first was in Cardiff last week. \nIt seems Corbyn’s political life has turned full circle in just 12 months with Gateshead its axis. \nThis time last year he was also taking part in a Labour leadership debate in Gateshead, this time the Sage, against Yvette Cooper, Andy Burnham and Liz Kendall. \nFor this year’s contest, ballot papers will be sent out by post or email to eligible voters from August 22 to be returned by September 21. \nThe result is expected to be announced at a special conference on September 24 in Liverpool. 18:33 Daniel Milligan Why is tonight's meeting crucial? \nThe clash comes at a crucial time in the contest. Firstly, it has just been revealed the UK’s third largest union, the GMB, has backed Smith. \nAnd a Court of Appeal hearing in London is to be held to finally decide whether 130,000 people who joined Labour after January 12 can vote in the leadership contest. \nIt is widely believed if they can, the vast majority will back Corbyn and virtually rubber stamp his victory. \nIt was Labour’s ruling National Executive Committee (NEC) which denied them the vote. \nHowever, five of those barred from voting took the matter to the High Court where a judge agreed them with and said: “In my firm judgement, the rule book gives the NEC no such power.” Video loading Click to play Tap to play The Live Event you are trying to watch is either unavailable or has not started Please refresh this page in your browser to reload this live event video \nThe NEC - against the wishes of Jeremy Corbyn and other members - voted to mount an urgent appeal. \nBecause the leadership election is already happening it’s being pushed through at lightning speed by the standard of UK courts. \nBoth parties had to submit their arguments to the court by 4pm on Wednesday. \nThree of the most senior judges in England will oversee the case at the Royal Courts of Justice in London. \nBarristers for the NEC will appear on one side and barristers for the five members who brought the case will appear on the other. \nA result is not expected on Thursday. The judges are quite likely to reserve judgment until Friday or next week. 18:30 Daniel Milligan Good evening \nJeremy Corbyn and Owen Smith will go head-to-head in Gateshead in the second hustings of the Labour leadership campaign. \nThe pair will clash at the Hilton NewcastleGateshead starting at 7pm, and the event is expected to last until around 9.30pm. \nSparks are expected to fly between the two former shadow cabinet colleagues as they debate policy. \nCorbyn insists he can lead Labour to victory at the next general election and rejects claims of a party split if he remained the leader. \nHowever Smith, who resigned from Corbyn’s shadow cabinet before challenging for the leadership, says the party as “fractured” and “splintered”. \nThe pair are expected to debate a number of key issues including employment, housing and the NHS.Questions have been submitted by Labour party members who will also be attending. \nSophy Ridge from Sky News will moderate the event.", "external_links": [], "published": "2016-08-12T01:25:00.000+03:00", "crawled": "2016-08-11T22:07:16.440+03:00", "highlightTitle": ""}