{"organizations": [], "uuid": "92a32ccd9cd05fd5d3cbedfd99a43bb413d86875", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article9395138.ece/ALTERNATES/s1200/JS64007812.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/record-year-housebuilder-bellway-sales-11708554", "country": "GB", "domain_rank": 21960, "title": "Record year for housebuilder Bellway as sales expected to top £2.2bn", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Record year for housebuilder Bellway as sales expected to top £2.2bn", "spam_score": 0.0, "site_type": "news", "published": "2016-08-05T12:46:00.000+03:00", "replies_count": 0, "uuid": "92a32ccd9cd05fd5d3cbedfd99a43bb413d86875"}, "author": "Robert Gibson", "url": "http://www.chroniclelive.co.uk/business/business-news/record-year-housebuilder-bellway-sales-11708554", "ord_in_thread": 0, "title": "Record year for housebuilder Bellway as sales expected to top £2.2bn", "locations": [], "entities": {"persons": [{"name": "ted ayres", "sentiment": "none"}, {"name": "robert gibson", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "bellway", "sentiment": "none"}, {"name": "the group", "sentiment": "none"}, {"name": "bellway  newcastle", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Record year for housebuilder Bellway as sales expected to top £2.2bn 10:46, 5 Aug 2016 10:46, 5 Aug 2016 By Robert Gibson The Newcastle firm also opened a new division in Durham, and says business is strong despite the Brexit vote Shares Get business news by email Bellway \nNewcastle headquartered national housebuilder Bellway plc is set to report on a record year, with business remaining “encouraging” despite the prospect of Brexit. \nIn a trading update for the year ended July 31, 2016, the company said housing revenue was expected to increase by around 27% compared to 2015, reaching £2.2bn. \nThe result has been achieved through housing sale completions rising 12.5% to 8,721, combined with a 13% increase in the average selling price to £252,700. \nBellway is also set to report a record pre-exceptional operating margin, rising by around 150 basis points to approach 22%. \nThe company said that, during the period, customer confidence and trading conditions had remained strong, supported by an environment of low interest rates and the continued presence of Help to Buy, contributing to the available of affordable mortgages. \n“The group has taken an average of 169 reservations per week, an increase of over 10% compared to last year,” the update said. \n“Since the result of the EU referendum, the has been some modest caution from a small number of visitors to our developments at the higher value end of the London, where Bellway has only limited exposure. Ted Ayres, chief executive of Bellway \n“Overall, visitors number are still strong and the cancellation rate remains at a historic low.” \nThe EU referendum vote had also led the company to proceed “cautiously” with some site acquisitions pending the outcome of the autumn selling season. \nHowever, the land market overall remained “attractive”, with Bellway contracting to acquire 9,555 plots, up from 9,128 the previous year, across 88 sites. \nRegarding its North East operations, it said: “Bellway has continued with its plans to open a nineteenth trading division in Durham, utilising land and reallocating internal resources, primarily from our very successful neighbouring North East division, which was previously operating at full capacity. \n“The new division opened on August 1 and will provide the group with an ability to deliver additional output at minimal extra overhead, thereby ensuring Bellway is well-placed to cost-effectively deliver its long-term growth strategy.” \nAt the period end, the company had a substantial forward order book comprising 4,644 homes, up from 4,568 the previous year, with a value of £1.1bn. \nBellway also has a strong balance sheet with net cash of £26m, compared to net bank debt of £38.5m in 2015. \nChief executive Ted Ayres said: “The Group has delivered an outstanding trading performance, achieving new records for Bellway in respect of both volume and operating margin. \n“We have invested in high quality land and have maintained a significant forward order book, thereby ensuring that the Group is well placed to continue its sizeable contribution to meeting the UK’s requirement for new homes in the year ahead. \n“It is still too early to assess the effect of the EU referendum result, however trading in recent weeks has been encouraging and Bellway, with its strong balance sheet and robust land bank, can be flexible and respond opportunistically to any changes in market conditions.” \nBellway will release its full preliminary results on October 18.", "external_links": [], "published": "2016-08-05T12:46:00.000+03:00", "crawled": "2016-08-05T13:43:01.629+03:00", "highlightTitle": ""}