{"organizations": [], "uuid": "036c09cbf0a9f3f3ee1a7d0d14de8664b030c9ff", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article10954403.ece/ALTERNATES/s1200/JS22275470.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/brexit-end-newcastle-new-york-11730517", "country": "GB", "domain_rank": 21960, "title": "Did Brexit end Newcastle to New York flights? 11 burning questions answered", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Did Brexit end Newcastle to New York flights? 11 burning questions answered", "spam_score": 0.0, "site_type": "news", "published": "2016-08-10T22:30:00.000+03:00", "replies_count": 0, "uuid": "036c09cbf0a9f3f3ee1a7d0d14de8664b030c9ff"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/brexit-end-newcastle-new-york-11730517", "ord_in_thread": 0, "title": "Did Brexit end Newcastle to New York flights? 11 burning questions answered", "locations": [], "entities": {"persons": [{"name": "newca", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "thomas cook", "sentiment": "none"}, {"name": "graeme mason", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "warsaw", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "las palmas", "sentiment": "none"}, {"name": "palma", "sentiment": "none"}, {"name": "berlin", "sentiment": "none"}, {"name": "barcelona", "sentiment": "none"}, {"name": "newcastle airport", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "cancun", "sentiment": "none"}, {"name": "amsterdam", "sentiment": "none"}, {"name": "orlando", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "heathrow", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "lanzarote", "sentiment": "none"}, {"name": "gdansk", "sentiment": "none"}, {"name": "newcastle international airport", "sentiment": "none"}, {"name": "faro", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}, {"name": "almeria", "sentiment": "none"}, {"name": "girona", "sentiment": "none"}, {"name": "dublin", "sentiment": "none"}, {"name": "tenerife", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "none"}, {"name": "ua", "sentiment": "none"}, {"name": "united airlines", "sentiment": "none"}, {"name": "thomson", "sentiment": "none"}, {"name": "wroclaw", "sentiment": "none"}, {"name": "newcastle international airport", "sentiment": "none"}, {"name": "ryanair", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "newcastle airport", "sentiment": "none"}, {"name": "apd", "sentiment": "none"}, {"name": "newcastle international airport  direct", "sentiment": "none"}, {"name": "united", "sentiment": "none"}, {"name": "united airline", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Did Brexit end Newcastle to New York flights? 11 burning questions answered 15:30, 10 Aug 2016 Newcastle Airport's planning and corporate affairs director Graeme Mason answers our questions on United's decision to pull the plug Shares Get daily news by email Graeme Mason, Planning & Corporate Affairs Director at Newcastle International Airport \nDirect flights from Newcastle to New York will not return for a third season next year. \nThe decision, which is a bitter blow to the region’s economy, was announced on Wednesday. \nThe current season of flights is due to end on September 6 and, while talks were taking place to get United to commit to the route from Newcastle Airport for a third year, the airline will not return in 2017. \nAirport chiefs said that, although a disappointment, the airport still has numerous connections for business travellers to the US via Heathrow, Amsterdam, Paris, Dublin. \nIn the wake of the decision, we asked Newcastle Airport’s planning and corporate affairs director Graeme Mason to explain United’s decision. 1. When did Newcastle International Airport find out about United Airline’s decision? \nRepresentatives of the airport met with United Airlines in the last few days. 2. How big a shock was it and did you try and persuade them to change their mind? \nWe were disappointed but understood why the decision has been taken. Read More Newcastle to New York flights to end as United Airlines pulls plug on route 3. Why was the decision taken \nThe reasons given by United Airlines are i) this seasonal route has not proved to be profitable and ii) because of the anticipated impact of the weaker pound on UK outbound travel. 4. What affect did the rate of Air Passenger Duty have on the decision by United Airlines to pull out? \nThere is no doubt that the high levels of Air Passenger Duty make it more difficult for new routes to succeed. We have said this for a number of years and lobbied the Government for APD reductions. Launch of non stop flights to New York from Newcastle with United Airlines 5. Did it have anything to do with the UK leaving the EU? \nOnly in respect of its impact on sterling weakness compared to the dollar. 6. How big a blow is it to the airport? \nThe impact on passenger numbers will not be great, with the route expected to carry around 18,000 passengers in 2016, and some customers will use alternative routings. Overall, airport passenger numbers are growing, and this growth is expected to accelerate into 2017. \nIn 2016/2017 a number of routes have been announced or have commenced, including: easyJet to Berlin and Las Palmas; Jet2holidays to Almeria and Girona; Ryanair to Faro, Girona, Palma, Lanzarote, Tenerife, Gdansk, Warsaw and Wroclaw; Thomson additional fortnightly flight to Florida; Thomas Cook to Almeria; Vueling to Barcelona. Video available Newcastle International Airport's summer getaway. More than 55,000 passengers are expected to pass through the terminal this weekend as the school holidays prepared to get underway, with people from across the North East heading for sunnier climates. 7. How popular had it been with customers? What was the occupancy rate of the flights and how many passengers flew with UA to New York in 2015 and then in 2016? \nThe number of passengers in 2016 (c18,000) is expected to be higher than in 2015 (c15,000). There is no doubt that the route was growing in popularity. We are very grateful to the North East passengers and businesses that used the service. It did make it much easier for US businesses to fly into the region and the feedback received from them has been very positive. Video loading Click to play Tap to play The Live Event you are trying to watch is either unavailable or has not started Please refresh this page in your browser to reload this live event video 8. Some have said UA set the ticket prices a bit too high - is that fair? \nNot in our view. The average United fare this summer has been competitive, and this is one of the reasons why booking have been up. 9. Has any other airline expressed an interest in flying direct to New York from Newcastle? \nWe are in ongoing discussions with airlines about a range of possible routes, but sadly we do not foresee the return of a regular New York service in the immediate future. 10. Will you be actively looking for another airline to take over the route? \nSee above. We continue to have regular Thomson flights to Orlando and Cancun, seasonal leisure flights to New York with Jet2.com, as well as numerous business and leisure connections to the US via our other hub services, including Heathrow, Amsterdam, Paris and Dublin. United Airlines will fly from Newcastle International Airport to New York from May 23 to September 7 2015. Pictured is New York 11. Is there a chance United might return in the future? \nWe are very grateful to United Airlines for operating this route. They have been good to work with and we would welcome them back in the future if the opportunity arose.", "external_links": [], "published": "2016-08-10T22:30:00.000+03:00", "crawled": "2016-08-10T17:56:52.878+03:00", "highlightTitle": ""}