{"organizations": [], "uuid": "e084bd191e6c50dbf4812f0e363c72ed8810c0be", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article11707829.ece/ALTERNATES/s1200/JS96343437.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/business-breakfast-live-mtrec-acquired-11702856", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast RECAP: Nissan \"not ready\" to make decisions on Wearside plant", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast RECAP: Nissan \"not ready\" to make decisions on Wearside plant", "spam_score": 0.0, "site_type": "news", "published": "2016-08-05T10:20:00.000+03:00", "replies_count": 0, "uuid": "e084bd191e6c50dbf4812f0e363c72ed8810c0be"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/business-breakfast-live-mtrec-acquired-11702856", "ord_in_thread": 0, "title": "Business Breakfast RECAP: Nissan \"not ready\" to make decisions on Wearside plant", "locations": [], "entities": {"persons": [{"name": "alice", "sentiment": "none"}, {"name": "kirsty adamson", "sentiment": "none"}, {"name": "duncan reid", "sentiment": "none"}, {"name": "james doyle", "sentiment": "none"}, {"name": "simon hopwood", "sentiment": "none"}, {"name": "mark carney", "sentiment": "none"}, {"name": "charlie burton", "sentiment": "none"}, {"name": "william hill", "sentiment": "none"}, {"name": "ross mcewan", "sentiment": "none"}, {"name": "chris salkeld", "sentiment": "none"}, {"name": "sharpley golf", "sentiment": "none"}, {"name": "carole", "sentiment": "none"}, {"name": "philip bowcock", "sentiment": "none"}, {"name": "david musgrave", "sentiment": "none"}, {"name": "yutaka nishida", "sentiment": "none"}, {"name": "alex simpson", "sentiment": "none"}, {"name": "alice weightman", "sentiment": "none"}, {"name": "simon weightman", "sentiment": "none"}, {"name": "bdo", "sentiment": "none"}, {"name": "watson burton", "sentiment": "none"}, {"name": "carl swansbury", "sentiment": "none"}, {"name": "santander", "sentiment": "none"}, {"name": "rob armstrong", "sentiment": "none"}, {"name": "sophie michael", "sentiment": "none"}, {"name": "coreena ford william hill", "sentiment": "none"}, {"name": "carlos ghosn", "sentiment": "none"}], "locations": [{"name": "portugal", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "cheltenham festival", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "william hill", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "seaham", "sentiment": "none"}], "organizations": [{"name": "nissan", "sentiment": "none"}, {"name": "becoming trust tech inc.", "sentiment": "none"}, {"name": "coreena ford royal bank of scotland", "sentiment": "none"}, {"name": "trust tech inc", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}, {"name": "bank of england", "sentiment": "none"}, {"name": "rbs", "sentiment": "none"}, {"name": "williams & glyn", "sentiment": "none"}, {"name": "trust tech inc.", "sentiment": "none"}, {"name": "coreena ford newcastle", "sentiment": "none"}, {"name": "hanson search", "sentiment": "none"}, {"name": "mtrec ltd", "sentiment": "none"}, {"name": "wearside  renault-nissan", "sentiment": "none"}, {"name": "fsb london business awards", "sentiment": "none"}, {"name": "uefa european championship", "sentiment": "none"}, {"name": "ryecroft glenton corporate finance", "sentiment": "none"}, {"name": "danny lawson/pa wire royal bank", "sentiment": "none"}, {"name": "bank", "sentiment": "none"}, {"name": "financial conduct authority", "sentiment": "none"}, {"name": "mtrec limited", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "sharpley fly fishery", "sentiment": "none"}, {"name": "coreena ford double", "sentiment": "none"}, {"name": "royal bank of scotland", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "fsb", "sentiment": "none"}, {"name": "mtrec care limited", "sentiment": "none"}, {"name": "coreena ford nissan", "sentiment": "none"}, {"name": "uefa", "sentiment": "none"}, {"name": "watson burton", "sentiment": "none"}, {"name": "bdo llp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "FTSE and pound latest \nThe FTSE-100 index at 8:15am was up 39.53 at 6779.69. \nThe pound at 8am was 1.3127 dollars compared to 1.3140 dollars at the previous close. The euro at 8am was 0.8484 pounds compared to 0.8474 pounds at the previous close. 9.05 Coreena Ford Double award-win for County Durham entrepreneur \nBig congrats this morning to online talent marketplace The Work Crowd and its founder Alice Weightman, from Seaham, for triumphing at the FSB London Business Awards 2016, which recognise enterprise and innovation in the Capital. \nThe Work Crowd was named the Overall Winner and described as “a standout application” by judges, who said: “we can see this business going on to do great things in the coming years.” Alice was described as “Revolutionary - has shown entrepreneurial spirt since the age of 23. Saw a gap in the market and grasped the opportunity.” \nLaunched in September 2015, The Work Crowd is an online platform that connects small businesses with expert freelancers to provide cost-effective marketing, communications and PR support. \nThe Work Crowd founder and CEO, Alice Weightman, grew up just outside Seaham in Sunderland and her parents, Carole and Simon Weightman, are also successful business owners locally, as operators of Sharpley Fly Fishery and Sharpley Golf. \nAlice is something of a serial entrepreneur, having founded Hanson Search – now an award-winning executive search and headhunting firm - in 2002, when she was just 27. \nShe said: \nWe are delighted to have won both of these FSB London Business Awards, including the Overall Winner award. \nIt’s always hard to get a business off the ground, never mind whilst running another. I owe it to our incredible team and loyal community of freelancers and clients, who believed in our vision before we had any projects on the platform – so a big thank you to them. Alice Weightman, founder of The Work Crowd 8.58 Coreena Ford Embattled high street endures sixth month of 0% growth \nHigh street sales fell flat in July despite widespread and heavy discounting by embattled retailers, latest figures have shown. \nSales narrowly missed falling into negative territory as the BDO monthly High Street Sales Tracker recorded 0% growth in overall year-on-year sales. \nThe dismal figures confirm a sixth successive month without growth for Britain’s retailers, who have attempted to lure in shoppers with extended sales offering discounts of up to 70% in a move that will flow through to margins and profits. \nFashion sales were down 1% compared with July last year following June’s poor weather, and stores were forced to sacrifice margins in a bid to shift stock and clear warehouses piled high with summer clothing, BDO said. \nHomeware sales grew by 4.7% and sales of lifestyle goods rose by 1%, the sector’s strongest performance in four months Non-store sales rose by 21.7%, the strongest performance in 2016 so far, and the sector’s best performance since September 2015. In contrast to bricks and mortar sales, some fashion retailers reported double or even triple online growth in July, and a high proportion of homewares and lifestyle retailers also saw strong online sales growth. \nSophie Michael, head of retail and wholesale at BDO LLP, said \nInflation is low, as is unemployment, but so is consumer confidence. \nStores are finding it really difficult to get people to spend unless they feel they’re getting a bargain, which is why we’re even seeing discounts on new lines. The challenge for stores over the next couple of months will be to keep new stock on sale at full price for as long as possible. Some shoppers yesterday 8.48 Coreena Ford William Hill scores 28% profits rise - thanks to Euro 2016 \nProfits at William Hill were boosted by a strong Euro 2016 in the first half of the year, helping offset a dire Cheltenham Festival. \nThe bookmaker, which is the subject of a three-way merger attempt by its rivals, said pre-tax profits for the period rose 28% to £100.7 million on revenues of £814.4 million. \nWilliam Hill raked in £36 million from the Uefa European Championship, which it said “mitigates (the) impact of losses at Cheltenham Festival”, where a string of favourites romped home. \nLast month, online operator 888 and casino giant Rank came clean over their interest in a £3 billion three-way merger with William Hill. \nAt the time, William Hill said it is “not clear” that a combination would “enhance William Hill’s strategic positioning”. \nInterim chief executive Philip Bowcock said: \nWe remain committed to our strategy of diversifying by expanding digitally and internationally. While the first half of 2016 has been challenging, William Hill is a strong business with three of our four core divisions performing well. \nLooking ahead, our immediate priorities are to continue the recovery in online, to leverage our technology improvements across the business and to advance a focused approach to international growth. Mike Hewitt/Getty Images Portugal players celebrate winning UEFA EURO 2016 Final 8.43 Coreena Ford Nissan \"not ready\" to make decisions on Wearside \nRenault-Nissan’s director has said the Japanese motor giant is “not ready” to make decisions on plans for the Wearside plant and that he is “reasonably optimistic” that the UK will be an important partner with the EU, despite the Brexit vote. \nCarlos Ghosn said investment at the Sunderland manufacturing plant, which employs more than 6,700, hinges on the outcome of UK-EU talks. \nHis comments come nine months after warning Nissan would reconsider investment in the UK if Britain voted to leave the EU. \nHe said: \nWe are reasonably optimistic at the end of the day common sense will prevail from both sides. \nThe Nissan boss thinks that the UK will continue to be a “big partner” for the European Union, but he said: \nThe question is what will happen to customs, trade and circulation of products. \nThat will determine how, and how much we will invest in the UK. Workers at Nissan's plant in Sunderland 8.37 Coreena Ford RBS boss addresses Bank of England governor over lending \nMore on RBS...and the bank’s core business reported a £1 billion adjusted operating profit in the second quarter, rising to £2 billion in the half-year. \n“This progress is important because it means we are well positioned to support our customers through the challenges that an economic slowdown poses for the country,” Ross McEwan said. \nThe chief executive also appeared to address Bank of England governor Mark Carney’s warning that banks have “no excuse” to stop lending following the Bank’s decision to cut interest rates and launch a package of measures to support bank lending. \nWe have been the fastest-growing large UK bank - with net lending into the UK economy higher than any other bank in the first half of the year. We are open for business, ready to lend, and ready to play our part in this new chapter for the country. \nThe half-year loss also reflects the impact of its £1.2 billion payment to the Treasury to buy out a crucial part of its £45 billion bailout. For the second quarter, RBS’s loss was £1 billion, with the firm booking a 118 million euro (£99.3 million) provision linked to Irish tracker mortgages in the period. Ross McEwan Chief Executive Of RBS 8.35 Coreena Ford Royal Bank of Scotland posts £2.04bn first-half loss \nRoyal Bank of Scotland has reported a £2.04 billion loss for the first half of the year after taking into account £1.3 billion worth of PPI and other legal costs. The state-backed lender has put aside £450 million to cover payment protection insurance (PPI) claims after the Financial Conduct Authority extended the deadline to 2019 earlier this week. \nRBS was also stung by £630 million in restructuring costs and a similar figure for litigation brought by shareholders linked to its bailout. The bank has also abandoned plans to separate the Williams & Glyn branch network because of the complexities and costs associated with creating a new banking platform. However, RBS remains committed to selling Williams & Glyn, with Santander understood to be interested in picking it up. \nChief executive Ross McEwan said RBS is “well positioned” for a potential economic slowdown. He said: \nWe are clearly in phase two of our strategy, where our focus is on drawing a line under many of the legacy issues that have plagued this bank, and transforming the core business so we can deliver consistent, sustainable profits and results for our shareholders and do great things for our customers. Danny Lawson/PA Wire Royal Bank of Scotland branch 8.25 Coreena Ford Newcastle recruiters MTrec snapped up by Japanese firm \nThe top North East story today is Trust Tech Inc’s acquisition of MTrec Limited, which is one of the North East’s largest providers of staffing and training solutions. \nThe deal - understood to be worth £17m - marks Trust Tech Inc.’s first significant acquisition outside of Japan, following a recent acquisition in Hong Kong, and will help the company establish a presence in the UK and European markets. \nThe acquisition is expected to complete on August 30. \nMTrec Ltd, headquartered in Newcastle, was established 10 years ago and has grown to become one of the region’s leading staffing and training providers, serving the manufacturing, engineering and industrial sectors. \nIts wholly owned subsidiary, MTrec Care Limited, provides nurses, carers and support workers to the North East’s care sector. \nEmploying 56 staff and with a cohort of 2,500 temporary workers placed into clients’ businesses across the region, MTrec Ltd has seen exceptional growth since inception with an average year-on-year turnover growth of around 23%, with last accounts, for the financial year ended March 31 2016, turning over £46m. \nMTrec has offices throughout the North East and works with blue chip clients across sectors including aerospace, automotive and Fast Moving Consumer Goods (FMCG). \nThe business was ounded by directors David Musgrave and Rob Armstrong. \nDavid Musgrave will remain as managing director and, alongside the existing management team, including James Doyle and Chris Salkeld, will work with Trust Tech Inc. to develop the business over the coming years to become a leading national and European staffing and training provider. \nTrust Tech Inc. is a leading Japan-based staffing business specialising in the provision of dispatching, outsourcing and sub-contracting staffing solutions and the company is currently executing a growth strategy, emphasising both organic growth and aggressive acquisition. \nCarl Swansbury, partner at Ryecroft Glenton Corporate Finance, advised on the sale for MTrec, supported by Alex Simpson, Simon Hopwood and Charlie Burton. \nLegal advice is being provided by Duncan Reid and Kirsty Adamson of national law firm, Watson Burton. \nYutaka Nishida, president and representative director of Trust Tech Inc., said: \nIt is our highest delight to welcome MTrec to our group. \nFocusing on manufacturing and engineering sectors, both Trust Tech and MTrec are fast-growing and enthusiastic companies. We are covering different geographic areas of the world, and can jointly grow faster. \nDavid Musgrave, Managing Director of MTrec Ltd, said: \nBecoming Trust Tech Inc.’s first European strategic partner is testament to the quality of the business and the strong growth we have achieved. \nIt is a fantastic opportunity for MTrec and its current management team to take the business into new markets and to enable the business to deliver global staffing and training solutions to our existing and prospective clients. \nCarl Swansbury, partner at Ryecroft Glenton Corporate Finance, said: \nThis is a very positive transaction for the North East, and demonstrates the high levels of interest overseas companies have in acquiring fast-growth, profitable, well-run UK based businesses. \nDuncan Reid, partner and national head of corporate at Watson Burton, added: \nMTrec Ltd is a true North East success story, with a customer base that already features many global operators – it’s therefore no surprise that Trust Tech Inc. chose the firm as its first European strategic partner. NewcastleChronicle Previous Articles", "external_links": [], "published": "2016-08-05T10:20:00.000+03:00", "crawled": "2016-08-05T12:53:22.229+03:00", "highlightTitle": ""}