{"organizations": [], "uuid": "3c8cda62733faee20bebe40a689dac7c41af0082", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article11786981.ece/ALTERNATES/s1200/CS49163874.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/what-rules-emigrating-new-zealand-11786977", "country": "GB", "domain_rank": 21960, "title": "What are the rules of emigrating to New Zealand? Brits' interest in moving to NZ soars after Brexit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "What are the rules of emigrating to New Zealand? Brits' interest in moving to NZ soars after Brexit", "spam_score": 0.0, "site_type": "news", "published": "2016-08-23T18:45:00.000+03:00", "replies_count": 0, "uuid": "3c8cda62733faee20bebe40a689dac7c41af0082"}, "author": "Hannah Graham", "url": "http://www.chroniclelive.co.uk/news/north-east-news/what-rules-emigrating-new-zealand-11786977", "ord_in_thread": 0, "title": "What are the rules of emigrating to New Zealand? Brits' interest in moving to NZ soars after Brexit", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "positive"}], "locations": [{"name": "nz", "sentiment": "none"}, {"name": "new zealand", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "south island", "sentiment": "none"}, {"name": "taranaki", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "egmont national park", "sentiment": "none"}, {"name": "picton harbour", "sentiment": "none"}], "organizations": [{"name": "btec higher national diploma", "sentiment": "none"}, {"name": "herald", "sentiment": "none"}, {"name": "aukland", "sentiment": "none"}, {"name": "new zealand herald", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "What are the rules of emigrating to New Zealand? Brits' interest in moving to NZ soars after Brexit 11:45, 23 Aug 2016 More than 10,500 Britons have looked into moving to New Zealand after the leave vote Shares Get daily news by email New Zealand, Taranaki, Egmont National Park, Mount Egmont \nAccording to one of the country’s leading newspapers, New Zealand is facing an influx of Brits lured by stunning scenery, temperate climate and tolerant social attitudes. \nThe New Zealand Herald reports that more than 10,500 Britons have inquired about emigrating to the country since the Brexit vote , which experts speaking to the paper say has driven some Brits to consider leaving “narrow-minded Britain” behind to make a new life with the “multicultural, tolerant” Kiwis. \nWith almost the same land size as the UK, the Herald notes that New Zealand has a population of just 4.7 million, as opposed to 64 million here, and skills shortages in some key areas. \nSo, if New Zealand seems like the place for you, what are the rules for making the move to the other side of the world? What visas can I get? \nIf you want to move to the country permanently to work, the best option is probably a skilled migrant visa. \nFor this, New Zealand operates a points system, based on things like age and skills. If you’re worth enough points, you can send in an expression of your interest in moving to the country. \nThis will be considered, and, if you’re a sufficiently appealing candidate, you’ll be asked to apply for a visa. A British passport rests on some euros What are the criteria for a skilled migrant? \nThose applying to move to the country to work must be 55 or younger, with more points given to younger applicants (30 points for those aged 20-29, dropping to five for applicants between 50 and 55). Does having a job make a difference? \nAlready having a job offer will give your application a big boost, with extra points if your future job is in an area where there is a skills shortage, or is based outside of Aukland, the county’s biggest population centre. \nIf you haven’t got a job offer, you’ve still got a good chance of being accepted, if you hold a recognised qualification. \nThis can be an academic or technical qualification — you’d get 50 points for an undergraduate degree, or 40 for a BTEC Higher National Diploma in certain subjects. \nYou’ll get extra points if your qualification is in an area of skills shortage. Picton Harbour on New Zealand's South Island What type of skills are they looking for? \nThis varied list includes trades you might expect, such as skilled construction workers, engineers and farmers, the country is also lacking horse trainers, sky diving instructors and winemakers. \nCheck the full list here, to see if your particular skills are ones the Kiwis are lacking http://skillshortages.immigration.govt.nz/immediate-skill-shortage-list.pdf \nVisit www.immigration.govt.nz/new-zealand-visas where you can find a guide to how many points you might be worth. \nAccording to the calculator, if, just for example, you’re a 22-year-old journalist with work experience and an undergraduate degree, it turns out you’ve not got quite valuable enough to make the move, earning just 80 points instead of the required 100. Ah well. What are the options if you don’t qualify as a skilled migrant? \nYou can also move to the country as part of a family. \nIf you’re in a “genuine, stable relationship” with a partner who can support your application, you could move to New Zealand if your partner is a New Zealand citizen or resident and you want to come to the country to work. \nIf you’ve been living with your partner for a year or more, you can stay on such a visa for up to two years, otherwise up to a year. You could also be granted a partnership residence visa, which would enable you to live, work or study in the country indefinitely, if you’ve been with your partner for a year or more. \nThis visa could also cover dependent children aged 24 or under. \nThere are also visas available for people who want to study in the country, though these only last for the time you’re studying. However, those who’ve gained a qualification in New Zealand and wish to stay can then apply for permanent residence.", "external_links": [], "published": "2016-08-23T18:45:00.000+03:00", "crawled": "2016-08-23T14:16:45.331+03:00", "highlightTitle": ""}