{"organizations": [], "uuid": "f442d658cadf484a6b70844ca0a349b320f31341", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article8671637.ece/ALTERNATES/s1200/JS56068065.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/youth-unemployment-could-exacerbated-wake-11816160", "country": "GB", "domain_rank": 21960, "title": "Youth unemployment could be exacerbated in wake of Brexit vote, report says", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Youth unemployment could be exacerbated in wake of Brexit vote, report says", "spam_score": 0.0, "site_type": "news", "published": "2016-08-30T12:30:00.000+03:00", "replies_count": 0, "uuid": "f442d658cadf484a6b70844ca0a349b320f31341"}, "author": "Katie Dickinson", "url": "http://www.chroniclelive.co.uk/news/north-east-news/youth-unemployment-could-exacerbated-wake-11816160", "ord_in_thread": 0, "title": "Youth unemployment could be exacerbated in wake of Brexit vote, report says", "locations": [], "entities": {"persons": [{"name": "mark hatton", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "midlands", "sentiment": "none"}, {"name": "north", "sentiment": "none"}], "organizations": [{"name": "middlesbrough", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "ey foundation", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Youth unemployment could be exacerbated in wake of Brexit vote, report says 05:30, 30 Aug 2016 Research by the EY Foundation has highlighted the 'stark regional variations' in the number of people locked out of unemployment Shares Get daily news by email Philip Toscano/PA Wire Jobcentre Plus \nThe “stubbornly high” number of unemployed young people in the North East could be exacerbated in the wake of Brexit, a new report has said. \nResearch by UK charity the EY Foundation has highlighted the “stark regional variations” in the number of people locked out of unemployment, and said it could be worsened “by a period of weaker economic growth in a Brexit environment”. \nThe report said the North East has the highest youth unemployment rate in the country at 18.3%. \nWhile the variations in youth unemployment between regions are significant, they’re far exceeded by those between the UK’s cities. \nIn every region, the majority of cities for which data is available had youth unemployment rates higher than their regional average. \nIn the North East three of the four cities analysed had rates above the region’s average of 18.3% - Middlesbrough (27.3%), Stockton-on-Tees (24.9%) and Sunderland (19.5%). \nNewcastle came in below the regional average at 15.6%, but the figure is still higher than the UK average of 14.4%. \nIn 2015 the North East also had a relatively low proportion of population aged 18-24 in full-time education, 30.7%, compared to 32.4% for the UK. \nThe charity says the huge disparity in the numbers of young people being employed across the UK’s cities and regions could impact local economic growth, particularly at a time when the UK’s future supply of labour and skills is at the forefront of many employers’ minds after the Brexit vote in June . \nMark Hatton, Senior Partner at EY in the North East says: “Youth unemployment rates have fallen from the peaks we saw during the recession, when 40% of the UK’s 16-17 year olds were facing unemployment. \n“However, a stubbornly high number of young people remain excluded from the labour market, which could be further exacerbated by a period of weaker economic growth in a Brexit environment. \n“Looking at this region as a whole, what stands out is that overall levels of youth unemployment are improving but pockets are still reporting much higher youth unemployment rates than the average with some cities affected more than others. \n“These regional differences underline the importance of a coordinated response from Government and business to tackle the issues locally. This could potentially be accompanied by more devolution of skills and education to the Northern Powerhouse.” \nThe report found that in the past decade, three sectors have seen particularly large falls in employment of young people - manufacturing, construction, and financial and business services. \nIt added: “Manufacturing is particularly important as it was historically a large employer of young people in the North and Midlands, regions which seemed to be amongst the most disaffected in our analysis of the EU referendum vote. \n“Moreover, this work was typically relatively well paid and offered the chance to young people to develop their skills over their careers.” \nIn contrast, the distribution, hotels and restaurants sectors currently offer most employment opportunities and are forecast to be the biggest employers of young people by 2030.", "external_links": [], "published": "2016-08-30T12:30:00.000+03:00", "crawled": "2016-08-30T07:59:39.503+03:00", "highlightTitle": ""}