{"organizations": [], "uuid": "18b63a17ab9a5256993e90f2633a402626de596c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article11744976.ece/ALTERNATES/s1200/JS96691208.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/changing-face-wallsend-how-area-11744934", "country": "GB", "domain_rank": 21960, "title": "The changing face of Wallsend: How the area is being transformed from ghost town to bustling hub", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "The changing face of Wallsend: How the area is being transformed from ghost town to bustling hub", "spam_score": 0.0, "site_type": "news", "published": "2016-08-14T01:30:00.000+03:00", "replies_count": 0, "uuid": "18b63a17ab9a5256993e90f2633a402626de596c"}, "author": "Sonia Sharma", "url": "http://www.chroniclelive.co.uk/news/north-east-news/changing-face-wallsend-how-area-11744934", "ord_in_thread": 0, "title": "The changing face of Wallsend: How the area is being transformed from ghost town to bustling hub", "locations": [], "entities": {"persons": [{"name": "thomas leydon", "sentiment": "none"}, {"name": "zaza boga", "sentiment": "none"}, {"name": "swan hunter", "sentiment": "none"}, {"name": "steven ratcliff", "sentiment": "none"}, {"name": "richardson dees", "sentiment": "none"}, {"name": "norma redfearn", "sentiment": "none"}, {"name": "new wetherspoon", "sentiment": "none"}, {"name": "mark kumar", "sentiment": "none"}, {"name": "whitley bay", "sentiment": "none"}], "locations": [{"name": "wallsend", "sentiment": "none"}, {"name": "ritz cinema", "sentiment": "none"}, {"name": "vaporizer uk", "sentiment": "none"}, {"name": "wallsend hall", "sentiment": "none"}, {"name": "ferndale avenue", "sentiment": "none"}, {"name": "forum shopping centre", "sentiment": "none"}, {"name": "mauretania", "sentiment": "none"}, {"name": "walkergate", "sentiment": "none"}, {"name": "high street east", "sentiment": "none"}, {"name": "prince road arboretum", "sentiment": "none"}, {"name": "wallsend parks", "sentiment": "none"}], "organizations": [{"name": "north tyneside council", "sentiment": "none"}, {"name": "aldi", "sentiment": "none"}, {"name": "customer first centre", "sentiment": "none"}, {"name": "heritage lottery fund", "sentiment": "none"}, {"name": "burger king  work", "sentiment": "none"}, {"name": "swan hunter shipyard", "sentiment": "none"}, {"name": "bodrum turkish barbers", "sentiment": "none"}, {"name": "newriver retail", "sentiment": "none"}, {"name": "new customer first centre  north tyneside council", "sentiment": "none"}, {"name": "burger king", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The changing face of Wallsend: How the area is being transformed from ghost town to bustling hub 18:30, 13 Aug 2016 A number of projects are under way to reinvigorate the town that was once world-renowned for its shipbuilding work Shares Get daily news by email Wallsend regeneration story, new town centre \nIt was once a thriving town that echoed to the sounds of heavy industry. \nSome of the world’s finest ships were forged along the riverside in Wallsend , including RMS Mauretania, RMS Carpathia and HMS Ark Royal, providing employment to thousands of people for decades. \nFor years, one of the most memorable sights was of hordes of workers streaming out of the Swan Hunter yard after the end of their shift. \nBut those scenes gradually came to an end as the shipbuilding industry went into decline, bringing with it a marked change in Wallsend. The last ship was towed out of the Swan Hunter yard in 2006. \nThe economic downturn and recession in 2008 led to further deterioration, with a string of ‘for sale’ signs popping up along the High Street. \nThe Co-op supermarket, which occupied one of the biggest retail spaces at the Forum Shopping Centre, closed in 2009 and several other businesses moved out. Traders in the area reported a severe drop in footfall, with many calling Wallsend a ghost town. \nSince then, millions of pounds have been poured in to help breathe new life back into Wallsend and a number of initiatives have already taken shape. Lib - The rush home as workers finish their shift at Swan Hunter Shipyard in Wallsend 29 November 1977 \nThe Wallsend Parks have had a £7m makeover and extensive refurbishment has also taken place at the Forum, owned by NewRiver Retail. \nNow, construction is well under way on an Aldi supermarket and drive-thru Burger King at the centre. \nMeanwhile, North Tyneside Council moved its library and incorporated it into a new Customer First Centre at the former Co-op unit at the Forum. \nSince the opening of the centre in 2014, the mall has seen a 25% increase in footfall, with around 3.1 million visitors each year. \nElsewhere, new houses have been built in the town and a business centre has opened at the former Swan Hunter yard. \nBut are people in tune with the transformation? \nThe majority of traders say they feel optimistic and can see the town improving further. Wallsend regeneration story, Steven Ratcliff of Dirty Classis \nSteven Ratcliff, who runs Dirty Classic Hair and Beauty on High Street East, says people are now investing more money into their businesses. \nThe 27-year-old, of Walkergate , added: “I have been here for nearly two years and all I have noticed is that things are going from strength to strength. I’ve noticed the town centre is getting busier and busier. \n“I would not have come here six years ago. There have clearly been great improvements in Wallsend.” \nMark Kumar, 48, manager of Vaporizer UK on the High Street, added: “We came here six months ago. We already had a shop in the Forum selling handbags and this opportunity came up. \n“I would say we sometimes have good days and there are sometimes bad days - it’s hit and miss. \n“But I think there will be a lot more people coming into the town when the Burger King and Aldi open up. And that will in turn help to bring more bigger businesses here.” \nAnd Zaza Boga, who runs Bodrum Turkish Barbers, on Station Road, says he likes Wallsend. \nThe 36-year-old, of Whitley Bay , said: “We came here more than a year ago and we have found this area is really busy. I think Wallsend is a really nice place and the people are really generous here. Customers give us very generous tips. \n“I don’t know what it was like years ago, but I don’t think this is a ghost town at all.” Wallsend regeneration story, development behind the High Street \nThomas Leydon, who has just opened the Little Paws Dog Salon on High Street East, says he feels positive about the town. \nHe added: “I was looking to run a dog grooming business and I thought this was an excellent opportunity. I’m optimistic about the future. There has been a lot of investment in the area and the improvements are showing.” \nSeveral traders said things were far from perfect and felt more investment was needed towards the eastern part of the High Street. \nOne furniture shop owner also said his business had been hit by the Brexit vote . Since the referendum and the subsequent drop in the value of the pound, his overseas suppliers had put their prices up between 5% and 10%. \nHowever North Tyneside Mayor Norma Redfearn is confident all the improvements will result in long-term benefits. \nShe added: “The progress being made in Wallsend is absolutely fantastic and the work so far has shown that the town can be a great place to live, work and visit, as well as an appealing location for businesses looking to relocate. \n“The new drive-through and supermarket will complement the rest of our increasingly attractive town centre and we will continue to work together with our partners to create a vibrant shopping centre that residents can be proud of. \n“And just recently the much-awaited Centre for Innovation at Swans has been officially opened. This is an integral part of our plans to really bring the former Swan Hunter’s site back to life and make it a place where businesses can grow and thrive. \n“There’s plenty more still to come in the town to be excited about and I am really looking forward to seeing the remaining developments take shape.” Projects helping to transform Wallsend: HMS Ark Royal under construction at Swan Hunter shipyard, Wallsend, May 18, 1981 1. Swans site restoration \nA £100m scheme is under way to redevelop the old shipyard stretch. The plans, some of which are already complete, include infrastructure improvements, dredging the river at the quay edge, quay repairs and new business accommodation. \nOnce the project is complete, it will include bespoke industrial units and office space from 5,000sq ft to 500,000 sq ft. There are already a number of businesses operating at Swans, and once the site is finished and occupied to capacity, it is expected to bring around 1,000 new jobs to the region. The new Swans Centre for Innovation in Wallsend 2. Swans Centre for Innovation \nThis £1.9m was officially opened at the end of July and is being promoted as an ideal base for small and medium-sized businesses specialising in the engineering, sub-sea, marine, oil, gas or offshore renewable energy sectors. The building, already home to a range of firms, includes 10 offices units, meeting rooms, a conference suite, a smart reception area, kitchen facilities, toilets and showers. 3. Forum Shopping Centre \nThe mall has been given a revamp with improvements to the roof, flooring, lighting and signage, replacement of damaged glazing, a full re-decoration of the centre itself and new seating. There have also been refurbishments to the indoor market, which is now being fitted out for 52 market traders. 4. New Aldi and drive-thru Burger King \nWork is well under way on these buildings. Both sites, including a 214-space car park, are due to open in the town centre before the end of this year, creating more than 100 jobs. Read More Wallsend regeneration: Work starts on new Aldi store and Burger King drive-through 5. New Wetherspoon pub at former Ritz Cinema \nThe building on the High Street was a haunt for film lovers until its closure in 1962. It later became a bingo hall but closed in 2011, and it had been empty for four years before the pub giant brought it back to life. 6. New Customer First Centre \nNorth Tyneside Council moved its library from Ferndale Avenue to its new Customer First Centre at the Forum in 2014. It also includes a number of customer services facilities and has helped to boost footfall in the shopping hub. Meanwhile, the old library site on Ferndale Avenue has been turned into a children’s nursery. 7. Wallsend Parks restoration \nThe parks, including Richardson Dees, Prince Road Arboretum and Wallsend Hall grounds, were in need of a revamp and their transformation took almost four years. The work was made possible with £7m of funding, including £2.6m from the Heritage Lottery Fund and Big Lottery Fund ‘Parks for People’ programme as well as cash from the council. \nThe area has 40 acres of woodland walks and gardens, a new café, new play facilities, tennis courts, skate park, bowling greens, sculpture trail and a restored bandstand. Latest figures show that nearly 1.2m people visited the parks last year - a rise from 984,000 in 2011 before the restoration began. 8. Former police station turned into homes \nWallsend’s old police station and temporary housing centre in High Street East were demolished to make way for 41 new affordable homes. The site includes a mix of 12 two-bedroom houses, 13 three-bedroom homes, 12 two-bedroom apartments and four one-bedroom apartments, complete with landscaping and parking.", "external_links": [], "published": "2016-08-14T01:30:00.000+03:00", "crawled": "2016-08-13T20:46:24.416+03:00", "highlightTitle": ""}