{"organizations": [], "uuid": "1a9492be75bca6cf4e7d014f1a8428c3500f1b75", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article11723144.ece/ALTERNATES/s1200/JS73346854.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/furniture-firm-scs-reports-strong-11725226", "country": "GB", "domain_rank": 21960, "title": "Furniture firm ScS reports strong trading and no impact from Brexit vote", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Furniture firm ScS reports strong trading and no impact from Brexit vote", "spam_score": 0.0, "site_type": "news", "published": "2016-08-09T16:05:00.000+03:00", "replies_count": 0, "uuid": "1a9492be75bca6cf4e7d014f1a8428c3500f1b75"}, "author": "Robert Gibson", "url": "http://www.chroniclelive.co.uk/business/business-news/furniture-firm-scs-reports-strong-11725226", "ord_in_thread": 0, "title": "Furniture firm ScS reports strong trading and no impact from Brexit vote", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Furniture firm ScS reports strong trading and no impact from Brexit vote 14:05, 9 Aug 2016 14:05, 9 Aug 2016 By Robert Gibson The Sunderland retailer, which plans to open 30 new stores, said ithas seen orders rise by 14.8% Shares Get business news by email David Knight, chief executive of ScS \nSunderland-based ScS, one of the UK’s largest retailers of upholstered furniture and floorings, is set to report on a strong year’s trading, with momentum being unaffected by the Brexit vote. \nIn a trading update issued ahead of preliminary results for the 53 weeks ended July 30, 2016, the company said its total like-for-like sales order intake had increased year-on-year by 14.8%. \nAs a result it expects to report profits in line with current market expectations. \nScS, which floated on the London Stock Exchange in January 2015, has also extended the maturity of its committed £12m bank facility to October 2018, while renegotiating it at a lower margin. \nThe news comes after a number of positive announcements from the company earlier this year. \nIn April, ScS reported that it was making good progress in developing the business into a strong national brand after posting record half-year results; the 26 weeks to January 23, 2016, saw gross sales rise by 10.2% to £145.4m, with EBITDA improving by £2m. \nAt the same time, the company reported that it planned to open up to 30 new stores across the UK over the next few years, while growing its workforce from around 1,750 to more than 2,050 people, with a number of head office jobs adding to those being created in the new stores. \nScS has also concentrated on strengthening its board, putting a new structure in place to drive forward its development plans. \nWithin this, Kevin Royal, formerly the group’s sales director, was appointed managing director. \nHR director Marie Liston, meanwhile, moved into a corporate services director role, and Chris Muir, formerly of Northgate plc, was brought on board as the company’s new chief financial officer. \nHis appointment followed the decision by Ron Turnbull to step down from the board after more than 10 years with the group. \nScS chief executive officer David Knight said of the latest financial year: “We are delighted that trading was strong throughout the EU referendum campaign and has continued since the vote with progress on a like for like basis in all retail categories. \n“We are also pleased to have completed the refinancing of our bank facility.” \nScS will release its full preliminary results for the period on October 4.", "external_links": [], "published": "2016-08-09T16:05:00.000+03:00", "crawled": "2016-08-09T16:17:40.511+03:00", "highlightTitle": ""}