{"organizations": [], "uuid": "bb7d920f57d4baba7094d20f1be558b1ae13f3d5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/29643060/15291754.jpg", "site_section": "http://www.thisisleicestershire.co.uk/generalelection2010/rss.html?chid=182803", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/matt-williams-of-topps-tiles-feeling-calm-post-brexit/story-29643060-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "Lauren_Mills published Topps Tiles chief executive feeling calm post Brexit", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "Lauren_Mills published Topps Tiles chief executive feeling calm post Brexit", "spam_score": 0.0, "site_type": "news", "published": "2016-08-23T13:30:00.000+03:00", "replies_count": 0, "uuid": "bb7d920f57d4baba7094d20f1be558b1ae13f3d5"}, "author": "Lauren_Mills", "url": "http://www.leicestermercury.co.uk/matt-williams-of-topps-tiles-feeling-calm-post-brexit/story-29643060-detail/story.html", "ord_in_thread": 0, "title": "Lauren_Mills published Topps Tiles chief executive feeling calm post Brexit", "locations": [], "entities": {"persons": [{"name": "matt williams", "sentiment": "none"}, {"name": "williams", "sentiment": "none"}, {"name": "stuart", "sentiment": "none"}, {"name": "lauren mills", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}], "organizations": [{"name": "topps tiles", "sentiment": "negative"}, {"name": "brexit topps tiles", "sentiment": "negative"}, {"name": "topps", "sentiment": "none"}, {"name": "dulwich college", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "bank of england", "sentiment": "none"}, {"name": "kingston university", "sentiment": "none"}, {"name": "topps tiles topps tiles", "sentiment": "none"}, {"name": "edinburgh university", "sentiment": "none"}, {"name": "salomon brothers", "sentiment": "none"}, {"name": "london stock exchange", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Topps Tiles chief executive feeling calm post Brexit By Lauren_Mills | Posted: August 23, 2016 0 COMMENTS SHARES Matt Williams, chief executive of Topps Tiles Topps Tiles chief executive feeling calm post Brexit X \nCopy link to paste in your message / Comments (0) \nMatt Williams is one of the most relaxed chief executives you could meet. But the boss of Topps Tiles is also relentlessly ambitious. Deputy Business Editor Lauren Mills met him \nFor someone who runs a company whose share price plummeted after the Brexit vote , Matt Williams is remarkably laid-back. You would think the chief executive of Topps Tiles doesn't have a care in the world. \nHe appears unflappable, focused and forthright when asked about the challenges facing the Enderby-based tile retailer. \nOn the question of how the UK's decision to leave the EU and the ensuing market uncertainty will affect the business, he says it's too early to tell. \n\"Nothing has changed from one day to the next,\" said Mr Williams. \n\"The point around uncertainty is an important one, but it affects corporate spending decisions more than customer decisions. \n\"I think there are some long-term benefits from leaving the EU as well. \n\"We buy products from China and there are anti-dumping tariffs as high as 30 per cent, so the Chinese were on the phone the Friday after the referendum about the art of the possible in the post-Brexit world. \n\"I think it is important that this is not all one-way traffic. \n\"There are some opportunities in the longer term and benefits in terms of trading with other nations.\" \nWhat about the share price though? On the day of the referendum, shares in Topps Tiles were changing hands for 149p. \nOn July 6, the price had fallen to 96.25p, although it has since recovered to around 120p a share. \nBut this is still way off the 164p high achieved in August 2015. \nIndustry analysts reckon market fundamentals following Brexit may have a prolonged downward impact on housebuilders and the DIY market. \nMr Williams said: \"It is affecting the share price, but that is about people's anticipation about what is coming rather than what is actually happening. \n\"What I am seeing right now is that it hasn't had an impact on our business or customer spending.\" \nTopps is the UK's biggest tile retailer and takes £1 in every £3 spent on tiles in the country. \nTopps' resilience is due in part to its ability to keep abreast of emerging interior design trends. A range of extra-large tiles and a new online design service boosted sales in the first half of the retailer's financial year. \nThe company's performance was also helped by new and better stores and new ranges. \nIn the 26 weeks to April 2, same-store sales rose 4.7 per cent. \nWhile this marked a slower growth rate than a year ago, Topps said sales for the seven weeks to May 21 were up 8.4 per cent, compared to a 6.3 per cent rise a year ago, marking a \"strong\" start to the second half of its financial year. \nThis is early evidence that Mr Williams' predictions about Topps' ability to weather the Brexit storm are based on solid foundations. \nMr Williams highlighted the popularity of a new tile range called Spaces, which features the latest Serafoam technology. \nThis means the same tiles fom the range can flow seamlessly from indoors to outdoors. \nHe said: \"This is a great example of what we are doing to lead the market. \n\"The Spaces range taps into the trend for blurring the line between the indoors and the outdoors. \n\"Spaces is trade-marked to Topps and we are the only people selling it in the UK.\" \nTopps has also developed \"natural look\" tiles that mimic stone or wood, as well as a range of vintage designs and patterned tiles. \nMr Williams said: \"Since around 2008 we saw people were becoming more adventurous and more ambitious with their projects so we started to collaborate with suppliers. \n\"Instead of accepting what they were making and reselling it, we saw an opportunity to collaborate with them to create great new products.\" \nTopps Tiles has come a long way since it opened its doors in Manchester in 1963. \nIts transformation into Britain's biggest tile retailer came after London-based Tile Kingdom – run by Mr Williams' father Stuart – spotted an opportunity to expand by snapping up its northern rival in 1990. \nStuart kept the Topps name for the enlarged business, relocated the group's headquarters to Leicestershire and set about building the business. \nHe floated Topps on the London Stock Exchange in 1997 with 54 stores and by 2006 the company had 250 stores. \nStuart persuaded his son to join the business a year or so later. \nMr Williams said it was never his intention to join the family firm. \nEducated at Dulwich College in south London, with a degree in psychology from Edinburgh University and a masters in real estate from Kingston University, he said his original ambition was to become an architect. \nBut he drifted into banking instead, taking up a position with Salomon Brothers. \nMr Williams said: \"Dad said I could come and work for Topps at any time so I did stints in the holidays as a delivery driver, fitting out stores, buying – but I never thought I would join the business.\" \nHis father finally persuaded him to join as property director in 1998. \n\"When he called me and said the guy who was meant to be heading up store acquisitions had left and he didn't have anyone to move the business on, I said I would help out for three years,\" Mr Williams said. \nThree years turned into six as property director during which time he acquired more than 200 stores. \nHe was promoted to chief operating officer in 2004 and became chief executive in 2007. \n\"What's kept me at Topps is we've always been very ambitious. That ambitious streak of the business reflects where I am at and that's the key thing that has kept me here,\" he said. \nMr Williams has spent the last nine years moving Topps Tiles away from outdated associations with pile-it-high, sell-it-cheap merchandise more likely to appeal to dusty tradesmen, into a chain of smart looking stores boasting the latest trends in tile design. But the journey has not been plain sailing. \nMr Williams steered Topps through a string of profit warnings in the wake of the credit crunch. \nThis experience means he is well positioned to guide the company through choppy waters as the UK negotiates a new trading relationship with Europe. He said: \"The comparison is potentially overdone. \n\"In 2008/9 there was a very different set of circumstances. This doesn't feel anything similar to Lehmans going bust where we could see the impact on consumer confidence almost immediately. \n\"It was a tough learning experience, a baptism of fire becoming CEO in 2007. \n\"We had just taken on a large amount of debt to pay special dividends to shareholders and we were hit by a 35 per cent reduction in our market. \n\"Digging your way out of that and dealing with banks is a tough thing to go through. \n\"But it sorts the men from the boys and we came through it. \n\"We showed real ambition and steel and the business proved to be incredibly resilient.\" \nHis father still holds a 10 per cent stake in the business and remains the largest shareholder. \nMr Williams said: \"He is very supportive. He's very understanding of the fact that the business needs to change and evolve and keep moving on and he is very positive about the changes he can see coming through. We have investor meetings with my mother and father, with the chief financial officer and myself on the other side of table to my parents. \n\"It's different but it's good and they are very supportive shareholders.\" \nMr Williams said he has no plans to leave Topps any time soon, given the scale of what he hopes to achieve. \nHe plans to grow from 348 to 450 stores in the UK and to continue the company's focus on the domestic DIY market. \nRead more: Top 200 Companies 2016: The List \nBut he also has his eye on the potentially lucrative commercial market. \nMr Williams said: \"The commercial side of the market is almost double the size of the domestic market. \n\"We're starting small selling tiles to pub owners, hairdressing salons, car showrooms and restaurants. \n\"We are focusing on how we can grow that element of that business.\" \nMr Williams is optimistic that the Bank of England's recent decision to cut interest rates to 0.25 per cent may help him fulfil his ambitions. \nHe said: \"The three big drivers for our market are consumer confidence, housing transactions and house prices, so any positive impact the interest rate cut has on any of those would be a boost for our business.\"", "external_links": [], "published": "2016-08-23T13:30:00.000+03:00", "crawled": "2016-08-23T10:32:46.793+03:00", "highlightTitle": ""}