{"organizations": [], "uuid": "5efa42394bcb0da59197c2d8944f54001fe961c7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/29609583/15155069.jpg", "site_section": "http://www.thisisleicestershire.co.uk/weathernews/rss.html?chid=182806", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/pm-theresa-may-is-the-only-party-leader-capable-of-uniting-the-country/story-29609583-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "Leicester Mercury published PM Theresa May is the only party leader capable of uniting the...", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "Leicester Mercury published PM Theresa May is the only party leader capable of uniting the...", "spam_score": 0.0, "site_type": "news", "published": "2016-08-12T17:30:00.000+03:00", "replies_count": 0, "uuid": "5efa42394bcb0da59197c2d8944f54001fe961c7"}, "author": "Leicester Mercury", "url": "http://www.leicestermercury.co.uk/pm-theresa-may-is-the-only-party-leader-capable-of-uniting-the-country/story-29609583-detail/story.html", "ord_in_thread": 0, "title": "Leicester Mercury published PM Theresa May is the only party leader capable of uniting the...", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "PM Theresa May is the only party leader capable of uniting the country, says Alberto Costa By Leicester Mercury | Posted: August 12, 2016 0 COMMENTS SHARES PM Theresa May is the only party leader capable of uniting the country, says... X \nCopy link to paste in your message / Comments (0) \nThe latest In the House column from South Leicestershire Conservative MP Alberto Costa \nTomorrow marks a month since Theresa May became our Prime Minister and it has become increasingly clear, that she is the only Party Leader capable of uniting the country and taking us forward. Whilst other parties continue their in-fighting and fractious leadership contests, Theresa May is getting on with the business of leading the country on a path to shared prosperity. \nDuring her time at the Home Office, she consistently demonstrated the ability to not only effectively lead a department of national strategic importance, but to also drive major reforms that were desperately needed, but overlooked by the previous Government. \nRead more: Prime Minister Theresa May is 'taking UK on a terrifying twist to the right' \nThese attributes will serve her well as Prime Minister, as she leads us during what will undoubtedly be a very important and challenging time. Encouragingly, she has made an excellent start to this huge task, which I very much welcome. \nAs Prime Minster, her first visit was to Scotland to show her commitment to maintaining the Union and keeping us united as a country. Theresa May has been clear from day one, that the democratic vote of the EU referendum must be respected; Brexit means Brexit and we will make a success of this as a united country. \nAlberto Costa \nTo ensure we are best placed to achieve an exit from the EU with the best possible terms, the Prime Minister has already met with various foreign leaders to ensure informal discussions begin positively. Alongside this, a meeting has also been held with small and medium sized enterprise leaders, to ensure we continue to provide an environment which is both conducive to trade and attractive to investors. \nWhilst we are currently enjoying record levels of employment, the new Prime Minister was right to say we must continue to reform our economy to ensure it operates in the interests of everyone. Theresa May is leading a one-nation government which will continue to deliver opportunities for hard working people and continue to support and care for the vulnerable in society. \nWe require strong leadership to ensure we not only have a smooth exit from the EU, but that we also create the right environment and conditions to enable us to take advantage of the opportunities this presents. It is clear that other parties besieged by in-fighting are unable to offer the leadership needed during this important time, to ensure our country remains united and moving in the right direction together.", "external_links": [], "published": "2016-08-12T17:30:00.000+03:00", "crawled": "2016-08-12T14:02:37.354+03:00", "highlightTitle": ""}