{"organizations": [], "uuid": "8342f419ac02cd574fbce154b8e9a64ea9fb7ea9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article11807375.ece/ALTERNATES/s1200/JS97886429.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/take-unique-look-behind-scenes-11807197", "country": "GB", "domain_rank": 21960, "title": "Take a unique look behind the scenes of Newcastle International Airport", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Take a unique look behind the scenes of Newcastle International Airport", "spam_score": 0.0, "site_type": "news", "published": "2016-08-27T18:30:00.000+03:00", "replies_count": 0, "uuid": "8342f419ac02cd574fbce154b8e9a64ea9fb7ea9"}, "author": "Barbara Hodgson", "url": "http://www.chroniclelive.co.uk/news/north-east-news/take-unique-look-behind-scenes-11807197", "ord_in_thread": 0, "title": "Take a unique look behind the scenes of Newcastle International Airport", "locations": [], "entities": {"persons": [{"name": "leon", "sentiment": "none"}, {"name": "andy alexander", "sentiment": "none"}, {"name": "paula", "sentiment": "none"}, {"name": "leon mcquaid", "sentiment": "none"}, {"name": "andy wallace  andy wallace", "sentiment": "none"}, {"name": "paula ives", "sentiment": "none"}, {"name": "alan parkin", "sentiment": "none"}, {"name": "barbara hodgson", "sentiment": "none"}, {"name": "eric", "sentiment": "none"}, {"name": "dean ward", "sentiment": "none"}, {"name": "alan", "sentiment": "none"}, {"name": "eric wrightson", "sentiment": "none"}, {"name": "andy", "sentiment": "none"}], "locations": [{"name": "cabin bar", "sentiment": "none"}, {"name": "peterlee", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "bangkok", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "berlin", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}, {"name": "newcastle international airport", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "newcastle airport", "sentiment": "none"}], "organizations": [{"name": "newcastle international airport", "sentiment": "negative"}, {"name": "cctv", "sentiment": "none"}, {"name": "geordies", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "apd", "sentiment": "none"}, {"name": "consett", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Take a unique look behind the scenes of Newcastle International Airport 11:30, 27 Aug 2016 We follow staff during their working day, from the heights of the control tower to an underground power room at Newcastle International Airport Shares The video will start in 8 s Cancel Click to play Tap to play The Live Event you are trying to watch is either unavailable or has not started Please refresh this page in your browser to reload this live event video \nBarbara Hodgson takes a look behind the scenes at Newcastle Airport and finds that for staff, whether working in the below-ground energy store or high up in the control tower, there’s no such thing as a typical day. \nCheck-in: \nPaula Ives is the one in charge of the sinister-sounding “terminal operations” which are in action from the moment passengers arrive to get rid of their bags so they can enjoy a pre-holiday drink in the bar (or cafe). \nShe’s full of smiles when she says her job is all about “making sure people get the best possible overall experience”. \nAnd that covers everything from avoiding long queues at check-in and security to working closely with the other businesses in the airport. \n“Every part has its own importance but getting away on time is key,” she says. \nShifts change mean staff need to be flexible and Paula’s day can see her anywhere in the airport: “I’m very hands-on!” \nThe two peak periods are called the first and second wave. “These are between 4am and 7am; and between 11am and 2pm; they’re the busiest times for us and we can see perhaps 3,500 passengers through security.” \nBut they have this down to a fine art with 97% of passengers shepherded through within six minutes or less. \nBag handling: A day in the life of Newcastle Airport, Handling & PRM, Andy Alexander \nIt doesn’t happen very often but a delay on the luggage carousel can ruin Andy Alexander’s day. \nIt’s backpacker-type bags, not suitcases, that can result in a strap or zip getting caught in the baggage belt system - which is getting an upgrade - and sensors and CCTV will alert them to a problem. \nAirport guidelines are strict. “The bags have got to be on the belt within 12 minutes of arrival,” says Andy; and some of their service providers promise even quicker. \nAn electrical engineer, Andy joined the airport 13 years ago: “I started pushing wheelchairs and worked my way up.” \nHe’s responsible for bussing passengers to and from planes and looking after those who need extra help. \n“They can range from somebody with autism to someone who can’t walk or is blind.” \nNewcastle currently caters for around 46,000 disabled passengers and sees “a year-on-year increase of 5-6%”. \nAndy also heads up relatively new paid-for services of baggage-wrapping (protecting cases in cellophane is popular for long-haul flights); ‘shop-and-collect’ which allows those who get carried away in duty-free before they board to leave their purchases for pick-up on their return; and a meet-and-assist for those wanting help through the whole airport process from the moment of arrival. “Our biggest customers are single parents,” says Andy. \nCar Parking A day in the life of Newcastle Airport, Car Parks, Eric Wrightson \nDriving in from his home in Consett each day, Eric Wrightson then spends his day surrounded by vehicles as the man responsible for the eight on-site car parks with around 11,00 spaces. \nHolidaymakers going away for a fortnight often choose to use the short-stay one (where pick-up and drop-off drivers pay £1 on leaving), preferring to be right on the airport’s doorstep rather than use the free link-up from the cheaper longer-stay car parks. \n“Our express car park can see around 11,000 vehicles in a 24-hour period,” he says. \nIn June a further 1,500 spaces were added during a £3m investment and it’s all about projecting at least five years ahead to keep on top of growing need. \nIn the 20 years he’s worked there, Eric has seen huge expansion, as well as building of the terminal. \n“I didn’t know anything about aviation when I first came but you turn into an ‘airport person’ and you become infatuated with the place! \n“And you learn something every day.” \nHe takes pride in his work, saying: “Car parking is the first and last impression a customer gets”. \nAs for the kind of problem he might see, he says: “Maybe if someone has pre-booked and ends up in the wrong car park wondering why the automatic numberplate recognition system doesn’t work.” \nLighting: A day in the life of Newcastle Airport, Engineering, Alan Parkin \nWith eight sub-stations on the go, energy boss Alan Parkin is in charge of keeping the electrical supply running throughout the building “from the roundabout at the entrance to the last light on the runway”. \nThe aim is to ensure passengers never get to see a bulb out. \nAnd if you thought your electricity bill was high, spare a thought for the airport’s average spend of £1.2m a year on electricity and £800,000 on gas. It is currently in the process of swapping to LED light fittings. \nAlan, who is to retire in two year’s time, has never had a typical working day in his 40-plus year career. \n“When I come in the morning I have lists of things to do and never get them done. \n“There are always things going wrong but we don’t have a lot of failures as it’s well maintained.” \nThe worst is a baggage system defect as the knock-on effect of even a few minutes’ delay is “catastrophic”. \n“We’re renewing the whole baggage departure side of the system next year at huge cost,” he says, adding: “For example just one new X-ray machine costs £1m and we have three of those.” \nDestinations A day in the life of Newcastle Airport, Aviation Development, Leon McQuaid \nWith a peak summer period that now extends from Easter to October, Leon McQuaid barely gets to pause for breath until November. \n“And then we start talking about next year.” \nAgain, the job of destinations boss is about forecasting passenger demand as well as keeping abreast of potential game-changers such as whether the Brexit fall-out may discourage people from, for instance, booking a second annual holiday. \nHe has a wish-list of destinations to add to Newcastle’s portfolio and it’s not just about winning over new airline companies’ confidence. \nIt’s a matter of promoting the North East’s charms to a foreign market too. \nLeon enjoys the challenges of growing new markets and while Spain is always the winner for Geordies, far-flung “aspirational” choices are growing too, such as America and Bangkok. \nHe admits the loss of the New York flights was a blow. \n“It was a popular service and great to have and it’s a shame to not see it come back,” he says, citing market pressure and the APD tax as key cost factors. \n“But we’re growing as an airport and have always had that strong foundation.” \nEmirates is a flagship airline investing in the region and “doing phenomenally well”. \n“We’re one of only six airports in the UK to have a daily service, that’s 428 seats a day which are 80-85% full.” \nHe adds: “We have to keep pushing and growing destinations.” \nAnd top of his wish-list it seems was Berlin where easyJet will be launching flights to from November 1. \n“I was very pleased with that one and there are a few more in the pipeline which we hope to see for next summer.” \nChill-out time A day in the life of Newcastle Airport, Commercial, Dean Ward \nFlexibility is key to keeping ahead of our constantly-changing tastes, says Dean Ward who manages the corporate side of business: those running the shops and hugely-improved range of bars and restaurants brought about by the £14m investment of 2014-15. \nShop-wise, passengers expect to see the usual multi-nationals and high street likes of Boots, while a local jewellery shop is helping to add an individual touch. \n“Dwell time has increased across the airport since stricter security checks and liquid restrictions as people get to the airport early,” he points out and he wants prominent reminders of our proud region. \nPictures of local landmarks adorn the walls of Bar 11 and he says: “We try to create a sense of place so Bar 11 is out to promote 11 great things about the North East.” \nThe Beer House pub is the one young drinkers tend to gravitate towards while Cabin Bar draws a different clientele, with a menu featuring the likes of game and ingredients sourced from a farm in Peterlee. \nThe “buy, eat and drink what you want” ethos extends to grab-and-go options for families while the investment in the departure lounge added extra seating for those “who just want to come to the airport and get on the plane”. \nThe old days of the viewing gallery may be missed by those who remember them but the new eating and drinking areas make the most of airfield views. \nThe control tower A day in the life of Newcastle Airport, Airside Ops, Andy Wallace \nAndy Wallace is in charge of the airfield tower which we reached with the help of one of the “rangers” whose hourly patrols ensure roads and runways are kept clear. And en route our eagle-eyed driver, who keeps a shotgun behind the seat to scare off birds, stops twice to pick up minute “FOD”: foreign object debris. \nInside the tower an atmosphere of quiet reigns as staff in the downstairs radar room and on the upper level focus attention on their screens. \nThere’s a 360-degree view outdoors from the top and Andy, who met his wife at the airport, is in the rare position of being able to see their home in Northumberland from it and vice versa. \nHe explains that investment in equipment five years ago ensures the airport is never in the position as some other regionals in having to divert flights due to fog. \nAn invisible landing system makes Newcastle a popular choice with airlines because planes “can land in very low visibility”. \n“We aren’t restricted and airlines love that,” he says. “They can fly all day and they land literally all night: between midnight and 5am, six to eight holiday flights can come in.” \nIt’s his responsibility to ensure passengers get safely between the terminal and on and off the plane, and with “55,000 movements a year on the runway and nearly five million passengers” its crucial to ensure drivers of the vehicles taking them and their luggage up to the plane have the best possible training. A day in the life of Newcastle Airport, flight control \n“It’s a bad day if somebody has a bump!” he says. \nA more routine problem are the birds which need to be scared off. \n“We spend a large amount of time managing birds. We’ve 200 acres which we try to make as unattractive as possible to them. We cut the grass to a certain height and try to keep weeds to a minimum. The more birds, the greater the risk. \n“When the wind is from a certain direction we get more gulls so put more manpower on the job and go out early morning. If you move them first thing, they tend not to come back.” \nThe area is constantly scanned and a member of staff spotted a hedgehog one day on the edge of a runway and took it to a rescue centre. \n“We also have a number of lagoons and streams and I’ve been stuck up to my knees myself trying to rescue chicks,” says Andy. \n“Every day here is different.” Newcastle International Airport", "external_links": [], "published": "2016-08-27T18:30:00.000+03:00", "crawled": "2016-08-27T15:27:39.572+03:00", "highlightTitle": ""}