{"organizations": [], "uuid": "5960182edb2a99864d7109136e294dc5a5635f56", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article11725775.ece/ALTERNATES/s1200/JS96301575.jpg", "site_section": "", "section_title": "", "url": "http://www.chroniclelive.co.uk/business/business-news/protecting-those-innovative-business-ideas-11725595", "country": "IE", "domain_rank": 21960, "title": "Protecting those innovative business ideas and trademarks before it's too late - Chronicle Live", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 0, "title_full": "Protecting those innovative business ideas and trademarks before it's too late - Chronicle Live", "spam_score": 0.123, "site_type": "news", "published": "2016-08-10T10:00:00.000+03:00", "replies_count": 0, "uuid": "5960182edb2a99864d7109136e294dc5a5635f56"}, "author": "Vicky Robson", "url": "http://www.chroniclelive.co.uk/business/business-news/protecting-those-innovative-business-ideas-11725595", "ord_in_thread": 0, "title": "Protecting those innovative business ideas and trademarks before it's too late - Chronicle Live", "locations": [], "entities": {"persons": [{"name": "sarah wright  research", "sentiment": "none"}, {"name": "ryan maughan", "sentiment": "none"}, {"name": "penrillian", "sentiment": "none"}, {"name": "roland wilkinson", "sentiment": "none"}, {"name": "mike foreman  by mike foreman", "sentiment": "none"}, {"name": "vicky robson mark lane", "sentiment": "none"}, {"name": "wilkinson", "sentiment": "none"}, {"name": "sarah wright", "sentiment": "none"}, {"name": "mike foreman", "sentiment": "none"}, {"name": "thompson", "sentiment": "none"}, {"name": "joanne thompson  joanne thompson", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "hargreaves elsworth", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}], "organizations": [{"name": "olswang llp", "sentiment": "none"}, {"name": "wipo", "sentiment": "none"}, {"name": "ipr", "sentiment": "none"}, {"name": "oxford", "sentiment": "none"}, {"name": "openworks engineering", "sentiment": "none"}, {"name": "cranfield university", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "microsoft", "sentiment": "none"}, {"name": "world intellectual property organization", "sentiment": "none"}, {"name": "nuro secure messaging", "sentiment": "none"}, {"name": "openworks", "sentiment": "none"}, {"name": "huawei", "sentiment": "none"}, {"name": "ctm", "sentiment": "none"}, {"name": "european community trade mark", "sentiment": "none"}, {"name": "google", "sentiment": "none"}, {"name": "imperial college", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Protecting those innovative business ideas and trademarks before it's too late 07:00, 10 Aug 2016 By Vicky Robson Mark Lane talks to pioneering North East businesses which have successfully overcome complex intellectual property challenges Shares Get business news by email New drone capturing technology \nWhile having a great idea or developing some wonderful new technology is one thing, protecting that idea and ensuring it isn’t stolen is quite another. \nA robust intellectual strategy is essential for any business which is seeking to bring new products and services to market. One such business is OpenWorks Engineering, a Northumberland-based business which has developed new technology that allows drones to be physically captured in mid-flight. \nThe system allows the captured drone to be kept intact without the risk of damage to the drone or the surrounding area and was developed in response to the proliferation of low cost drones for hobbyists which has led to a number of well-publicised incidents. \nWe caught up with Roland Wilkinson, director, OpenWorks Engineering, and asked him first about the background to the development of the SkyWall100. He said: “As friends and colleagues we formed a team and came up with and evaluated a number of ideas for new products. Having realised the need for a civilian counter drone system it became clear that a SkyWall type system suited our skill sets and would provide a fantastic base from which to build a company. \n“Working through the same design methodology at our previous employments we started with making a basic prototype of the system in order to understand the general specifications of a SkyWall system such as the size, weight and range. From here the prototype is progressed iteratively, usually with two to three significant steps forward. We are now in the final stages: refining the product, focusing on reliability, ergonomics, packaging etc.” \nThe team at OpenWorks was always confident it had a strong idea. But how did it go about protecting it? Wilkinson explained: “OpenWorks has developed all of the technology within the SkyWall100 from scratch, from the software that targets, tracks and aims at the drone through to the unique mechanism that releases the projectile. Capturing a drone \n“Although our core team has patent experience from their many engineering innovations in the past, OpenWorks has brought in its own patent attorney who is responsible for the IPR of the company. This includes not just SkyWall100 and the core SkyWall technology but also other complimentary counter drone innovations the company is developing in parallel.” \nThis final point is an interesting one: the core drone protection idea of OpenWorks was the initial reason for requiring IP protection but spin-off technologies from its development offer an opportunity to add further protection which could be exploited at a later date for commercial gain. \nAnother business grappling – successfully – with the issue of intellectual property law is Penrillian, a developer of mobile technology software which is used, among other things, for contactless payment, mobile tracking, wireless dongles and smart ticket apps. Joanne Thompson \nJoanne Thompson, CEO of Penrillian was born and raised in Newcastle and was recently named as one of the 100 women to watch in 2016 by Cranfield University in its Female FTSE Board Report. \nAsked when IP first became an issue, Thompson told us: “As an organisation we came to it quite late and only really began to consider IP as a business issue last year. The driving force behind it reaching our board agenda was the desire to grow the company to the next level and recognising that we needed to own IP to get to that next level. \n“As an organisation we have spent the past year transitioning to a Software as a Service (SaaS) model, enabling us to license and derive annuity revenues from our own software and white-label products. As a result we can build transaction based revenues rather than operating exclusively on a project-by-project basis.” \nAsked how difficult it is to protect ideas in the UK, Thompson told us: “In the UK it is certainly harder to patent than in the US for example, and working within technology does pose a significant challenge. In the UK you can’t patent innovations in a technology process, you have to look at the outcome of a technology overall. \n“Technology moves so quickly, people can arrive at similar end results without the intentions of stealing existing ideas, or by following a truly innovative path of getting there. \n“I think most technology companies have ongoing concerns when pitching for work with a new client, you may need to give an insight into your IP in order to validate your proposition. It is sometimes difficult to strike the right balance, as giving away too much could see your ideas being appropriated and given to another developer.” \nThompson makes the key point that, “a patent is only a guarantee if you are willing to enforce it”. \nEnforcement costs money which, while not an issue for large corporates like Microsoft and Apple, can be challenging for SMEs with the legal costs and time involved, even where there is a cast iron case. \nShe also suggests that press reports of corporate espionage and hacking are misleading in many ways, suggesting that, “the main risk is certainly within your own organisation, particularly if your skilled employees are moving jobs and taking their knowledge to rival firms”. \nOne company we spoke to which has been on the wrong end of IP theft is Cramlington-based AVID Technology, an automotive cleantech business. The company operates at the cutting edge of electric and hybrid vehicle development and the development of thermal management systems to improve the efficiency and emissions from diesel engines. \nFor a time, the company had a lack of formalised IP which led to some of its innovations being copied by other companies. Indeed, AVID has had two particular instances where its technology has been copied and the lack of a patent has made it prohibitive which has forced it to improve its stance on IP registration. \nAs such, AVID is now working with intellectual property specialists at Hargreaves Elsworth to develop its intellectual property strategy. The company has a number of key patent applications underway relating to its developments in electric and hybrid vehicle powertrain components. Ryan Maughan, managing director of AVID \nManaging director Ryan Maughan said: “We have learnt there are a number of steps that you must take in order to protect your intellectual property. First of all ensure that you have a robust standard form confidentiality agreement, put this in place with suppliers and customers at an early stage in any commercial discussion. \n“Be careful what you disclose even under this agreement. Sensitive technical details that are going to be included in a patent application should not be discussed. \n“In the past we found the cost of applying for patents to be very high and this put us off, however working with a specialist who has a better understanding of our technology area and putting together a long term plan has allowed us to make this more affordable for the business. \n“Having patents in place helps us to defend the company’s value, ensures that we have freedom to operate and are not infringing any third party rights.” \nIs Britain innovative enough? Mike Foreman \nBy Mike Foreman \nAccording to the latest data from the World Intellectual Property Organization (WIPO), Britain ranked seventh in the 2015 league of countries that submitted applications under the Patent Co-operation Treaty, which is one of the two routes to secure international legal protection for a new idea. \nAhead of Britain came the United States, Japan, China, South Korea, Germany and France. Seventh may sound encouraging …until you compare Britain’s 5,313 applications last year to the 57,385 patents applied for in the US, Japan’s 44,235, or even South Korea’s 14,626. \nWIPO’s data shows the countries ahead of Britain have enjoyed a rising trend of patent applications through the past decade, while the number generated in the UK has plateaued since the year 2000. \nDig deeper and you won’t find any British companies in the top 50 private sector patent applicants last year. \nOne company, the Chinese telecoms giant Huawei, submitted almost 4,000 alone – four and a half times as many as Microsoft, five times more than Google. \nYou will find only two UK universities in the US-dominated higher education top 50: Oxford and Imperial College, London. Three of the top five governmental applicants came from French state-sponsored research institutes – again, there are no British representatives in the top 50. \nIn short, Britain needs to generate more ideas … and do a better job at turning them into products to compete with the world’s biggest economies. \nThat means a pre-Brexit policy rethink of the incentives and aid programmes to support research and development: tax system, grants and subsidies. \nLook to the most productive countries – and leading lights in innovation – and in tech terms, everything from email to antivirus is being rethought to find more effective and efficient solutions. \nThe question every British business should ask is not just “is this best tool for the job?” but “has the best tool been invented yet?” \nMike Foreman is a veteran of the cyber-security industry and European managing director of Nuro Secure Messaging, an enterprise messaging and collaboration platform with military grade security \n10 things you need to know about trademarks Sarah Wright \nBy Sarah Wright \nResearch is crucial in any business and choosing a trademark is important, but there are things firms need to know about them: \n1. A trade mark is a sign that distinguishes your goods or services from those of other traders. It should act as a badge of origin so that customers know that your goods or services originate from you. \n2. When choosing a new brand avoid descriptive names and ensure your mark is distinctive. The strongest types of trademarks are invented words or arbitrary marks – marks that use an existing word for an unrelated product or service. \n3. By registering a trade mark you will obtain the exclusive right to use it for the goods and services for which it is registered and be able to prevent others from using an identical/similar mark. \n4. Trade mark rights are territorial. This means they only give protection in the country where you filed for a trade mark – or in some cases, where you’ve used the mark. \n5. Before you start using a brand name, you must run clearance searches to check that a third party has not already registered your chosen name as a trade mark, as you risk infringing their trade mark and being liable for damages. \n6. In the UK, you can obtain registered trade mark protection via a UK registration or a European Community Trade Mark (CTM), which covers all 28 member states of the EU. \n7. It takes between three-six months to get a trade mark registered in the UK, or as a CTM if no one objects to your application. \n8. Until your mark is registered you should use the ™ symbol to notify others that you are seeking to protect your brand. You can’t use the ® symbol until your application has been registered. \n9. Use it or lose it: if you fail to use a registered mark within the first five years, this can result in the mark being cancelled. \n10. If you find someone using your trade mark without your permission, you should consider sending them a letter asking them to stop, sometimes called a “cease and desist” letter. \nSarah Wright is a partner and head of trademarks at Olswang LLP ", "external_links": [], "published": "2016-08-10T10:00:00.000+03:00", "crawled": "2016-08-10T09:16:22.969+03:00", "highlightTitle": ""}