{"organizations": [], "uuid": "6d5e00c54628c5929c9625b69e3ac767ec4f5567", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article10912443.ece/ALTERNATES/s1200/JS82948177.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/how-newcastle-new-york-dream-11731246", "country": "GB", "domain_rank": 21960, "title": "How the Newcastle to New York dream of direct flights all began", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "How the Newcastle to New York dream of direct flights all began", "spam_score": 0.0, "site_type": "news", "published": "2016-08-11T01:30:00.000+03:00", "replies_count": 0, "uuid": "6d5e00c54628c5929c9625b69e3ac767ec4f5567"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/how-newcastle-new-york-dream-11731246", "ord_in_thread": 0, "title": "How the Newcastle to New York dream of direct flights all began", "locations": [], "entities": {"persons": [{"name": "dave laws", "sentiment": "none"}, {"name": "david laws", "sentiment": "none"}, {"name": "mr laws", "sentiment": "none"}, {"name": "laws", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "newcastle international airport", "sentiment": "none"}, {"name": "dubai", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "none"}, {"name": "united airlines", "sentiment": "none"}, {"name": "newcastle international airport", "sentiment": "none"}, {"name": "apd", "sentiment": "none"}, {"name": "newcastle international", "sentiment": "none"}, {"name": "yankee doodle dandy", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "How the Newcastle to New York dream of direct flights all began 18:30, 10 Aug 2016 The TransAtlantic route opened new doors to North East passengers to take a bite out of the Big Apple Shares Get daily news by email American Beauties on Newcastle Quayside to celebrate Jet2CityBreaks flights to New York \nWhen the news came that from 2015 direct flights from Newcastle to New York were to start, it was the cause of much elation and not a few puns in our news coverage - some so good we used them twice. \nIn fact, we broke into song - ‘Start spreadin’ the news, it’s leaving in May, we want to be a part of it: New York, New York’, we wrote back then. \nAnd there was much talk of Big Apples and being offered to take the chance of taking a bite out of one. \nNew York and the thought of it does that to people. It’s on almost everybody’s bucket list when it comes to dream places to travel to. \nAnd now, at last, there was the prospect of getting there, not after some tortuous trip to some distant airport, but direct from Newcastle International. This would cut the total journey time - from front door to destination - by hours. David Laws, CEO of Newcastle International Airport \nThe mood was best summed up by the airport’s then chief executive, Dave Laws. \nHe said: “It’s been a dream for me to get this route for many years and, everywhere I go, people have been stopping me and asking, when is the North East going to get a New York service?” \n“Today, after years of hard work, it is here. \n“This is game changing for the North East, in the way that the Emirates service to Dubai was game changing – and what better way to celebrate the airport’s 80th birthday next year than with this?” Read More Did Brexit end Newcastle to New York flights? 11 burning questions answered \nThe local business community had pulled together as part of a charm offensive to successfully persuade the US company to come here. \nAs for the Government, well, prophetically, back in 2015, Mr Laws said: “We also thought we might get some help from the Government in terms of Air Passenger Duty or the new fund for regional air services, but that didn’t happen and we had to plough on as we couldn’t wait.” \nThis APD puts quite a dent in profits as it costs airlines flying routes over 2,000 miles between £73 and £146 per passenger. \nDespite this, everything seemed to go Yankee Doodle Dandy that first year in 2015 with around 15,000 passengers. United Airlines seemed happy and a second, May to September season, was agreed. United Airlines will fly from Newcastle International Airport to New York \nMr Laws said: “We have worked very hard, with our shareholders and other regional partners, to ensure the route has been a success and to secure this further operation.” \nThe rallying cry of Mr Laws followed. Read More Direct Newcastle to New York flights to end - airport bosses reveal why \n“I once again call upon everyone in the North East to support this route. With a higher frequency and more seats on sale, it will be more important than ever that using this direct service is the first choice for leisure passengers and businesses alike.” \nAnd while passenger use went up by around 20%, it wasn’t enough. Lobbying of the Government about the rate of APD had resulted in little change. \nThis, coupled with the weaker pound after the Brexit result in the EU referendum, would negatively impact on the cost of UK outbound travel and the plug was pulled. \nNewcastle has become a remoter place for some.", "external_links": [], "published": "2016-08-11T01:30:00.000+03:00", "crawled": "2016-08-10T20:53:41.203+03:00", "highlightTitle": ""}