{"organizations": [], "uuid": "28ce008f624c46686377f7b0fa23feb5f30443dc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article11722077.ece/ALTERNATES/s1200/JS96600136.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/labour-leadership-hopeful-owen-smith-11722332", "country": "GB", "domain_rank": 21960, "title": "Labour leadership hopeful Owen Smith defends his promise of a second EU referendum", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Labour leadership hopeful Owen Smith defends his promise of a second EU referendum", "spam_score": 0.0, "site_type": "news", "published": "2016-08-09T07:30:00.000+03:00", "replies_count": 0, "uuid": "28ce008f624c46686377f7b0fa23feb5f30443dc"}, "author": "Dan O'Donoghue", "url": "http://www.chroniclelive.co.uk/news/north-east-news/labour-leadership-hopeful-owen-smith-11722332", "ord_in_thread": 0, "title": "Labour leadership hopeful Owen Smith defends his promise of a second EU referendum", "locations": [], "entities": {"persons": [{"name": "owen smith", "sentiment": "none"}, {"name": "smith", "sentiment": "none"}, {"name": "brexiteers", "sentiment": "none"}, {"name": "owen", "sentiment": "none"}, {"name": "mr smith", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "tory", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "owen smith's labour party leadership", "sentiment": "none"}, {"name": "bank of england", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "newcastle  owen smith", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Labour leadership hopeful Owen Smith defends his promise of a second EU referendum 05:30, 9 Aug 2016 Labour leadership hopeful said it was only right for a second vote once all the fine details of Brexit had been ironed out Shares Get daily news by email Launch of Owen Smith's Labour Party Leadership challenge at the Bunker in Newcastle \nOwen Smith has defended his promise of a second referendum on Britain’s membership of the European Union. \nThe Labour leadership hopeful reaffirmed his commitment to a second referendum after a key note speech in Newcastle on Monday. \nLittle over a month ago Brexiteers danced and cheered in Sunderland as the city became the first in Britain to vote ‘leave’. \nIn all, 778,103 across the North East sided with leave and 562,595 with remain, meaning a resounding 58% voted for Brexit. \nMr Smith said that the vote was a “cry for help” from communities savaged by Tory austerity and neglected by successive Governments. \nHe said that once a deal had been negotiated it would only be right to go back to the British people and ask if it was what they truly wanted. \nMr Smith said: “I understand why people voted the way they did, but let’s have a look at what is happening right now. Owen Humphreys/PA Wire Workers at Nissan's plant in Sunderland on the production line \n“The Nissan plant in Sunderland is making worrying noises about further investment in production, the Bank of England last week said it was going to reduce interest rates to the lowest level for 300 years and said a quarter of a million jobs could be lost. \n“All of the things which were warned about look like they are coming to pass. I think the Labour party needs to continue to stand up for what we believe in, that people will be better off in Britain if we are inside the EU. \nHe added: “Seventy percent of Labour voters voted to stay in, so those people need Labour to be standing up for them negotiating hard. \n“The Tories are in danger of getting rid of workers rights, environmental protections, social protections that we rely upon. I do not want to see those things scrapped. I want us to have a seat at the negotiation table, I want us to be able to say at the end of this here is what is actually on the table not the pie in the sky stuff that was promised.” \nMr Smith rejected the notion that offering a second referendum would go back on the result of the first. \nHe said: “I don’t think that is taking people for granted or asking to second guess the last result. At the end of the process let’s see where we are. Take the car example, I would not buy a car without looking under the bonnet and seeing if it has a proper engine in it.” More on the EU Referendum", "external_links": [], "published": "2016-08-09T07:30:00.000+03:00", "crawled": "2016-08-09T09:10:35.656+03:00", "highlightTitle": ""}