{"organizations": [], "uuid": "480df4b2dc958987a30d94536dd26d629b5ff7ce", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article11545687.ece/ALTERNATES/s1200/JS92737774.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/north-east-devolution-deal-stands-11785668", "country": "GB", "domain_rank": 21960, "title": "Where the North East devolution deal stands after reports mayoral plan may be axed", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Where the North East devolution deal stands after reports mayoral plan may be axed", "spam_score": 0.0, "site_type": "news", "published": "2016-08-23T15:30:00.000+03:00", "replies_count": 0, "uuid": "480df4b2dc958987a30d94536dd26d629b5ff7ce"}, "author": "Hannah Graham", "url": "http://www.chroniclelive.co.uk/news/north-east-news/north-east-devolution-deal-stands-11785668", "ord_in_thread": 0, "title": "Where the North East devolution deal stands after reports mayoral plan may be axed", "locations": [], "entities": {"persons": [{"name": "nick forbes", "sentiment": "none"}, {"name": "george osborne  devolution", "sentiment": "none"}, {"name": "andy burnham", "sentiment": "none"}, {"name": "philip hammond", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "hannah mckay/pa", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "heseltine", "sentiment": "none"}, {"name": "george osborne", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "greater manchester", "sentiment": "none"}, {"name": "downing street", "sentiment": "none"}, {"name": "west midlands", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "eu commission", "sentiment": "none"}, {"name": "newcastle city council", "sentiment": "none"}, {"name": "liverpool", "sentiment": "none"}, {"name": "times", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "local government", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Where the North East devolution deal stands after reports mayoral plan may be axed 08:30, 23 Aug 2016 According to reports, Prime Minister Theresa May is ready to ditch plans for directly elected mayors - but what does it mean for the deal? Shares Get daily news by email Newcastle City Council leader Nick Forbes \nThere are fears the North East could be left behind after reports claimed Prime Minister Theresa May was ready to ditch plans for directly elected mayors. \nBut where exactly does the region’s much-discussed devolution deal stand as these rumours come to light, and does the whole deal hinge on having a regional mayor? \nWe take a look at what we know so far. What exactly would a devolution deal mean? Former chancellor George Osborne \nDevolution of powers and funds was a key policy for former chancellor George Osborne as part of his aim to create a ‘Northern Powerhouse’. \nThe plans involved handing over £30m a year to the North East, as well as control over a £3.4bn pot of cash. \nCouncil bosses would also get new powers covering employment and skills, transport and planning and business activity – all intended to drive economic growth. \nAny deal was dependent on the region adopting a directly elected mayor. Is it still going to happen? Stefan Rousseau/PA Wire EU and UK flags fly above the EU Commission offices in Westminster \nThe devolution deal has been on hold since after Britain voted to leave the EU. \nLeaders of the region’s seven councils chose to freeze discussions over devolution for the North East pending further assurances over funding and plans from the new Government. \nAs things stand, the deal is still on ice and is set to be discussed again at a meeting at the end of September. Read More Fears North East will be left behind after reports regional mayors plan to be abandoned \nReports of Theresa May’s possible ambivalence about the idea of directly elected mayors led Newcastle City Council leader Nick Forbes to demand to know whether the Government is still committed to the North East devolution deal as it stands and if not what funds and powers they are now prepared to put on the table. \nEarlier in the month, Chancellor Philip Hammond promised to replace EU funds lost to the region through Brexit, prompting think-tank Policy North to suggest that the deal might be back on track. \nIt’s not yet completely clear how this new development will affect things. Could devolution go ahead without elected mayors? Newcastle Civic Centre \nThe devolution initiative was always conditional on an elected mayor being in place, so without such a figure, some are concerned that the region could lose out on devolved cash and powers. \nAnd Newcastle’s Liberal Democrats said an elected mayor was essential to provide accountability within a more devolved regional Government. \nA spokesperson for the Department for Communities and Local Government said: “Devolution deals will continue in the usual way. Elected mayors remain the best way to make them work.” Where exactly does the new Prime Minister stand on the idea of elected mayors? Hannah McKay/PA Wire New Prime Minister Theresa May makes a speech outside 10 Downing Street, London \nIt still isn’t completely clear where Mrs May, who is currently on holiday, actually stands on the issue. \nOn Monday, the Times reported that the PM was considering scrapping George Osborne’s elected mayor project, because she thought it offered the chance for moderate Labour party figures like former minister Andy Burnham, who is the party’s candidate to be mayor of Greater Manchester, to gain a public platform. \nShe was also said to be concerned the policy was causing “huge angst” in areas where there was local hostility to mayors being imposed. \nBut the claims were dismissed by Former Deputy Prime Minister Lord Heseltine, who said he didn’t think the reports were true. \nDowning Street said areas that did not want an elected mayor would not have one forced on them, saying this did not represent a change in Government policy. \nVoters are set to decide on the mayors for Greater Manchester, Liverpool and the West Midlands when they go to the polls next May. \nIt is understood these will go ahead but there are doubts whether Newcastle will be required to sign up to the system.", "external_links": [], "published": "2016-08-23T15:30:00.000+03:00", "crawled": "2016-08-23T11:37:57.172+03:00", "highlightTitle": ""}