{"organizations": [], "uuid": "569b40935c73a23d6a91f924d1a27eafbc6881fe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article11705358.ece/ALTERNATES/s1200/JS96296673.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/you-your-cash-what-bank-11705244", "country": "GB", "domain_rank": 21960, "title": "You and your cash - what Bank of England interest rate cut will mean", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "You and your cash - what Bank of England interest rate cut will mean", "spam_score": 0.0, "site_type": "news", "published": "2016-08-04T17:30:00.000+03:00", "replies_count": 0, "uuid": "569b40935c73a23d6a91f924d1a27eafbc6881fe"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/you-your-cash-what-bank-11705244", "ord_in_thread": 0, "title": "You and your cash - what Bank of England interest rate cut will mean", "locations": [], "entities": {"persons": [{"name": "william", "sentiment": "none"}, {"name": "margaret thatcher", "sentiment": "none"}, {"name": "anthony", "sentiment": "none"}, {"name": "mark carney", "sentiment": "none"}, {"name": "justin", "sentiment": "none"}, {"name": "jenny scott", "sentiment": "none"}, {"name": "ben bradbent", "sentiment": "none"}], "locations": [{"name": "england", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}], "organizations": [{"name": "bank of england", "sentiment": "none"}, {"name": "london  bank of england", "sentiment": "none"}, {"name": "bank of england", "sentiment": "none"}, {"name": "bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "You and your cash - what Bank of England interest rate cut will mean 15:30, 4 Aug 2016 We reveal the winners and losers as Bank of England governor announces historic 0.25% rate Shares Get daily news by email Justin Tallis/PA Wire Governor of the Bank of England Mark Carney, with Ben Bradbent Deputy Governor for Monetary Policy at the Bank of England and Jenny Scott advisor to the Governor of the Bank of England, during his quarterly Inflation Report press conference at the Bank of England in central London \nBank of England interest rates have been cut from 0.5% to an historic low of 0.25%. Who are the winners and losers and can the rate fall any further? \nSo, what’s happened today - without the financial jargon. \nI’ll try. In short, UK interest rates have been cut for the first time in seven years to an historic low of 0.25% as part of a wide package of Bank of England measures to shore up the economy in the wake of the Brexit vote. Should I be celebrating? \nMaybe. If, for example, you’re a home owner and have a mortgage there’s a chance you could be a few bob better off. Even for people like me with a fixed rate mortgage? \n...unless you’ve got a fixed rate mortgage. For those borrowing on a variable rate then it’s likely to be good news. Apparently there are 1.5m borrowers with mortgages that track the base rate who will see their monthly repayments fall, probably from the start of September. In pounds, shillings and pence, what will it mean? \nFor a homeowner on the average variable mortgage rate of 2.86% and a mortgage of £150,000, a reduction in line with the base rate will mean monthly repayments falling by £19.68 to £687. What about savers? Anthony Devlin/PA Wire The Bank of England \nBad news, unfortunately. Ever since rates were slashed to 0.5% in 2009 in the wake of the banking crisis, there have been slim pickings and savers are likely to see returns fall further as a result of the Bank’s decision. According to financial information firm Moneyfacts, there are 385 savings accounts that could end up offering no interest at all if banks and building societies pass on the whole reduction. What about my pension? \nBad news again as pension funds will be hit because of the impact lower long-term interest rates have on annuity rates - how much your pension pays out when you retire. Well, at least it will be good news when it comes to my overdraft rate while my credit card repayments will presumably drop too and not cost as much wonga each month. Right? \nWrong. The interest rates on these types of borrowing are detached from the Bank base rate and have been rising in recent months. The average interest rate on a UK credit card is now 17.94%, compared with 15.73% in March 2009, while overdraft rates have gone up from 18.62% to 19.6%. \nGreat. At this rate I’ll need to take out a loan to pay off my debts. \nIt might not be such a bad idea. Personal loan rates have tumbled over the same period. The average cost of borrowing £10,000 was 9.66% when the base rate was last cut seven years ago and is now 4.3%. Any other good news? Chris Ison/PA Wire Sold sign outside a house \nWell if you’re looking to sell your house, it could mean more people able to buy it due to the low cost of lending - and it could possibly drive up the price. What is the lowest Bank Of England interest rates have fallen to? \nSince they were first established in 1694 by William of Orange - predating the establishment of the UK would you believe? - they have been as high as 17% in November 1979 under Margaret Thatcher’s government put up to control rampant inflation, to today’s 0.25% \nHow low can they go? \nWell Bank Of England governor Mark Carney hasn’t ruled out a further drop to 0%. The equivalent rate in Japan has been lower than that, at -0.1%, since January. Food for thought - or should that be sushi?", "external_links": [], "published": "2016-08-04T17:30:00.000+03:00", "crawled": "2016-08-04T18:33:32.296+03:00", "highlightTitle": ""}