{"organizations": [], "uuid": "7522eff3480c2cdcc11df0687048f0f2a9831981", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/29585261/15031746.jpg", "site_section": "http://www.thisisleicestershire.co.uk/weathernews/rss.html?chid=182806", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/reaction-interest-rates-cut-to-record-low-of-0-25-per-cent/story-29585261-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "TomPegden published REACTION: Interest rates cut to record low of 0.25 per cent", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "TomPegden published REACTION: Interest rates cut to record low of 0.25 per cent", "spam_score": 0.0, "site_type": "news", "published": "2016-08-04T15:11:00.000+03:00", "replies_count": 0, "uuid": "7522eff3480c2cdcc11df0687048f0f2a9831981"}, "author": "TomPegden", "url": "http://www.leicestermercury.co.uk/reaction-interest-rates-cut-to-record-low-of-0-25-per-cent/story-29585261-detail/story.html", "ord_in_thread": 0, "title": "TomPegden published REACTION: Interest rates cut to record low of 0.25 per cent", "locations": [], "entities": {"persons": [{"name": "tompegden", "sentiment": "none"}, {"name": "adrian macdiarmid", "sentiment": "none"}, {"name": "mark carney", "sentiment": "none"}, {"name": "scott knowles", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "paul norbury", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "castle donington", "sentiment": "none"}, {"name": "leicester city", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}], "organizations": [{"name": "pwc", "sentiment": "none"}, {"name": "east midlands chamber of commerce", "sentiment": "none"}, {"name": "barratt developments", "sentiment": "none"}, {"name": "bank", "sentiment": "none"}, {"name": "leicester tigers", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "next plc", "sentiment": "none"}, {"name": "bank of england", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Comments (0) \nBusiness leaders have reacted cautiously to today's cut in interest rates to a record low of 0.25 per cent. \nThe Bank of England cut the rate from the 0.5 per cent it has been at since 2009 in a bid to stimulate the economy following the jitters caused by the Brexit vote. \nGovernor Mark Carney said there was scope to cut the interest rate further as the Bank also announced a £100 billion scheme to force lenders to pass on the low interest rate to households and businesses. \nThe Bank is also going to buy £60 billion of UK government bonds and £10 billion of corporate bonds to circulate more cash. \nThe share price of Coalville-based housebuilder Barratt Developments was particularly badly hit following the Brexit vote amid fears people might hold back on buying new homes. \nAdrian MacDiarmid, head of mortgage lending at Barratt Developments, said cheap mortgages were one way of encouraging activity in the market when buyers might be worrying about their future bank balances. \nHe said: \"This is a positive move from the Bank of England and means more good news for homeowners, particularly those on tracker mortgages. \n\"The mortgage market is currently very competitive and we expect to see lenders launching even more exciting new products soon. \n\"With interest rates at a record low now is a particularly good time to speak to a mortgage adviser to see what deals you can get.\" \nNext Plc warns overseas supplies could cost more due to drop in value of sterling \nScott Knowles, chief executive of East Midlands Chamber of Commerce felt cutting the interest rate sent a mixed message to the world. \nHe said: \"On the one hand it says the Bank of England still has confidence that the markets will settle following the turbulence of the six weeks since the EU Referendum and that UK plc is very much still open for business. \n\"But on the other it says that the Bank does not have enough confidence to hold the rate at 0.5 per cent. This interest rate cut will do very little to restore the confidence of world markets. \n\"UK plc has been in grave danger of talking itself into recession with monthly report after monthly report showing decline and nearly all citing Brexit as the main cause, not always justifiably. \n\"We remain confident that the markets will stabilise over coming months. \n\"Immediately after the Brexit vote, Britain lost governance and was seen as rudderless, leading to negative, knee-jerk reactions from world markets. \n\"But until Article 50 is triggered Britain is still very much part of the EU and will be for many years yet.\" \nPaul Norbury, senior partner at accountancy giant PWC's Castle Donington office, where 350 people are based, said it was still too soon to speculate about the impact of Brexit on UK business and consumer confidence. \nClients range from big outfits such as Leicester City, Leicester Tigers and Boots, to regional family-owned businesses. \nHe also said there were fears the UK could be talking itself into a recession despite the fact that nothing concrete has changed and trade negotiations on leaving the EU have yet to get into full stride. \nHe said: \"Broadly what we have been seeing is people saying \"let's go on holiday and see what's happening when we come back\". \n\"Nobody is panicking. Nobody really knows what's happening yet. \n\"The biggest worry I have at the moment is everyone throwing their arms into the air and talking themselves into recession. \n\"Our economic outlook suggests the economy will slow, but won't dip into recessions.\" \nBHS in Leicester to shut by August 20 \nA 0.25 per cent rate means the 1.5 million UK mortgages that track the Bank of England rate will typically be £264 a year better off. \nAnnouncing the cut, the Bank of England said the outlook for growth in the short to medium term had \"weakened markedly\" and the recent fall in sterling was likely to push inflation up in the near term. \nIt warned the weaker medium-term outlook could lead to an eventual rise in unemployment. \nIt said: \"Consistent with this, recent surveys of business activity, confidence and optimism suggest that the United Kingdom is likely to see little growth in GDP in the second half of this year.\"", "external_links": [], "published": "2016-08-04T15:11:00.000+03:00", "crawled": "2016-08-04T17:58:43.840+03:00", "highlightTitle": ""}