{"organizations": [], "uuid": "037ab1d1c9fbd79a3485303ef59716a7cf7594b5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article11697268.ece/ALTERNATES/s1200/JS95365930.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/business-breakfast-live-hsbc-post-11697277", "country": "GB", "domain_rank": 21960, "title": "Business breakfast LIVE: HSBC post 29% profits slump", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business breakfast LIVE: HSBC post 29% profits slump", "spam_score": 0.0, "site_type": "news", "published": "2016-08-03T10:22:00.000+03:00", "replies_count": 0, "uuid": "037ab1d1c9fbd79a3485303ef59716a7cf7594b5"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/business-breakfast-live-hsbc-post-11697277", "ord_in_thread": 0, "title": "Business breakfast LIVE: HSBC post 29% profits slump", "locations": [], "entities": {"persons": [{"name": "coreena ford", "sentiment": "none"}, {"name": "douglas flint", "sentiment": "none"}, {"name": "sard verbinnen", "sentiment": "none"}, {"name": "nas khan", "sentiment": "none"}, {"name": "robey warshaw", "sentiment": "none"}, {"name": "conor pierce", "sentiment": "none"}, {"name": "mr flint", "sentiment": "none"}, {"name": "nielsen", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "helen dickinson", "sentiment": "none"}, {"name": "mike watkins", "sentiment": "none"}, {"name": "flint", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "burma", "sentiment": "none"}, {"name": "cambodia", "sentiment": "none"}, {"name": "finsbury", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "brazil", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "bangladesh", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "teesside", "sentiment": "none"}], "organizations": [{"name": "hsbc", "sentiment": "none"}, {"name": "lazard", "sentiment": "none"}, {"name": "goldman sachs", "sentiment": "none"}, {"name": "arm holdings", "sentiment": "none"}, {"name": "hsbc holdings", "sentiment": "none"}, {"name": "the group", "sentiment": "none"}, {"name": "brunswick", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "softbank", "sentiment": "none"}, {"name": "softbank", "sentiment": "none"}, {"name": "ubs", "sentiment": "none"}, {"name": "coreena ford banks", "sentiment": "none"}, {"name": "samsung galaxy note", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "british retail consortium", "sentiment": "none"}, {"name": "coreena ford samsung", "sentiment": "none"}, {"name": "barclays", "sentiment": "none"}, {"name": "jennings motor group", "sentiment": "none"}, {"name": "coreena ford hsbc", "sentiment": "none"}, {"name": "coreena ford", "sentiment": "none"}, {"name": "samsung", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Thanks for reading - back again tomorrow! 9.20 Coreena Ford Could you be the Teesside Business Executive of the Year 2016..? \nA quick reminder of our North East Business Executive of the Year Awards 2016 now.. \nThis week we’re throwing the spotlight on the Teesside round, which was last year won by Nas Khan of Jennings Motor Group. \nCould you be our winner this year? \nRead about the awards here . Last year's winner of the Teesside award was Nas Khan of Jennings Motor Group 9.13 Coreena Ford The Samsung Galaxy Note 7 is unveiled \nAnd here’s a picture of the Samsung ‘phablet’ . . there’s one in the middle of all those people at the New York launch event too. 2016 Getty Images Attendees gather around display tables to view the new Samsung Galaxy Note 7 smartphone 9.10 Coreena Ford Competition for retailers as shop prices tumble \nFierce competition between retailers has seen shop prices fall once again, although deflation has decelerated on last month, figures show. \nOverall shop deflation slowed to 1.6% in July from 2% in June, above the 12-month average of 1.8%, according to the BRC-Nielsen Shop Price Index. \nThe battle for grocery shoppers saw food deflation remain at 0.8% for the second consecutive month. \nShoppers will have found fresh food prices 1.2% down on the same time last year, while ambient food was cheaper for the first time since April 2015. Non-food deflation decelerated to 2.2% in July from 2.8% in June. \nShoppers have now been able to fill their baskets and pay less for their goods than the year before for 39 months in an “extraordinary” run of overall shop price deflation. \nBritish Retail Consortium chief executive Helen Dickinson said: \nThe long stretch of deflation continued in July with shop prices falling once again. \nThis is testament to the strength of competition between retailers, which is as fierce as it has ever been. \nWhile we may have become accustomed to prices falling, it’s worth noting that this month’s figures have seen the rate of deflation decelerate. It’s too early to say if this is the beginning of the end of sustained price deflation or whether pressures in the wider economy could merely mark the end of the beginning. \nNielsen head of retailer and business insight, Mike Watkins, said: \nWith unpredictable weather and a change to consumer sentiment under way, we have seen retailers cut prices or increase promotional activity in the last few weeks to help top line sales growth, so it is of no surprise that shop price deflation is lower in July than in any other month this year. \nOnce again it is clear there is currently no inflationary pressure coming from retail and discounting looks set to be a catalyst to stimulate demand in the coming months. 9.01 Coreena Ford Samsung creates company's \"most intelligent smartphone\" \nI’m staying on tech for a minute, following Samsung’s unveiling of its new Galazy “phablet”, which comes complete with iris scanner security. \nSamsung says it is the most intelligent phone it has created, the company has said. \nThe Galaxy Note 7 is Samsung’s so-called “phablet” smartphone and also comes with a stylus - called the S Pen - to use on the phone’s 5.7-inch screen. \nThe S Pen has also been given a range of new features compared to previous generations of the Note, including the ability to translate words on-screen from and into a series of languages when hovered over text. \nIt has also been made fully waterproof for the first time, as is the Note 7 itself. \nThe new iris scanner can be programmed to unlock the device using just the owner’s eyes thanks to a small infra-red sensor that sits next to the front-facing camera. \nConor Pierce, Samsung’s vice president of IT and mobile in the UK, said: \nThe Galaxy Note 7 combines productivity and entertainment in one single device. \nWith strong security features and an enhanced service ecosystem, the Galaxy Note 7 is the ideal smartphone for those looking for a device for work and play. \nWe created the Galaxy Note 7 to reflect the way people live their lives helping everyone get things done wherever, whenever. \nSamsung confirmed pre-orders for the new Note will begin on August 16, with the phone going on sale on September 2. Samsung’s previous generation Note 5 was not released in the UK, but the South Korean technology giant will bring its newest phablet to Britain due to customer demand - naming it the 7 to bring it in line with their flagship smartphones, the Galaxy S7 and S7 edge that were released earlier this year. The new device is also set to be the first major smartphone to support High Dynamic Range (HDR) video streaming - a higher quality image that increases the contrast between light and dark to offer more detailed images on-screen. The device will also come with a dual edge display and be available in three colours - black, blue and later silver - when it goes on-sale in September. Samsung also revealed a new version of its Gear VR virtual reality headset to go with the Note 7, which has been given a streamlined design as well as an increased viewing range. The technology giant said there were now one million virtual reality users globally, with 500,000 using its Gear VR headset. 8.51 Coreena Ford FTSE and pound latest \nThe pound at 8am was 1.3302 dollars compared to 1.3325 dollars at the previous close. The euro at 8am was 0.8421 pounds compared to 0.8426 pounds at the previous close. \nThe FTSE-100 index at 8:15am was up 22.40 at 6667.80. 8.49 Coreena Ford Banks and PRs pocket £206m from ARM tech deal \nRemember the ARM Holdings deal from a couple of weeks ago? \nJapan’s Softbank snapped up the UK tech form for a tidy £24bn. . .and now it’s emerged bankers are to celebrate a bumper £206.7m payday as a result of the takeover. \nDocuments just released reveal that the likes of Goldman Sachs, UBS and Barclays, along with other financial advisers, will share the multimillion pound fees as part of the £24bn deal. \nThe fees cover advice relating to the structure of the deal. \nThe documents also show that public relations advisers Brunswick, Finsbury and Sard Verbinnen will walk away with up to £6m. \nTotal fees and costs associated with the deal, including legal and accounting expenses, stand at £350m. \nOther firms set to share millions from the deal include Softbank advisers Robey Warshaw and French bank Lazard, which is working with ARM. \nAs part of the deal, SoftBank has pledged to double Cambridge-based ARM’s 3,000-strong workforce and to hold on to its existing management team following its swoop. ARM Holdings could double its workforce after being snapped up in a £24 billion deal by Japan's SoftBank. 8.43 Coreena Ford Cost prices are poised to rise at Next . . .and they're hoping for a cold winter. \nNext said it had been able to protect itself against falls in the value of the pound for the current year to January 2017, but that its input costs could rise by around 9% for the next financial year. \nIt is hoping to offset much of this, partly by switching some of its product buying to new areas such as Bangladesh, Cambodia and Burma. But the group warned that cost prices will nevertheless rise by up to 5% for 2017/18 even after taking action to limit the impact. \nThe chain’s second-quarter sales fall was better than feared and marks an improvement on the 4.7% plunge it saw in its high street stores in the previous three months. \nIt said the worst-case scenario for annual profits was now not as bad as expected, pencilling in a range of £775 million to £845 million. \nThis would mean profits could fall by up to 5.6% or rise by as much as 2.9%. It had previously warned that profits could tumble by up to 8.9%. But it added that trading remained under pressure. \nThe group said: \nTrading remains extremely volatile and on a week-by-week basis is highly dependent on the weather. \nThis volatility is indicative of the underlying weakness of consumer demand for clothing, which we believe we began to experience in October 2015. \nWe expect the consumer environment to remain tough for the rest of the year. Quarter three will be particularly challenging as it was our best quarter last year (up +6%), so we are budgeting for full price sales growth in the third quarter to be worse than in the second quarter. \nThe fourth quarter presents much softer comparable numbers when the problems of an exceptionally warm 2015 winter were compounded by stock availability problems in Directory last year. \nSo there is potentially some upside in the last quarter, particularly if we have a colder winter. 8.38 Coreena Ford Next warn of Brexit cost impact as sales fall \nHigh street giant Next warned over soaring costs from the Brexit-hit pound as it posted another fall in sales. \nThe group said its buying costs could rise by up to 5% in the year to the end of January 2018 after the value of the pound has been sent plunging since the EU referendum. \nNext posted another steep fall in sales - down 3.3% for its retail shops in the second quarter to the end of July - while its Next Directory arm recorded a 5.7% rise. \nBut a better-than-expected end-of-season sale performance helped limit the fall in total store sales, including markdowns, to 0.7%. \nThe group said there was “no clear evidence” of a hit to consumer confidence since the Brexit vote, although it warned that trading conditions will remain tough for the rest of the year. Hundreds of keen shoppers queue outside Next in Newcastle for one of the store's famous sales 8.33 Coreena Ford HSBC current share price. . .and it's up \nIt’s been one of the steadiest bank share prices this year, and since this morning statement it’s up. \nCurrently sitting at 500.90 - up 3.75% 8.30 Coreena Ford Top story - profits dive 29% at HSBC amid Brexit fears and China concern \nHSBC has reported a 29% slump in pre-tax profits for the first half of 2016 amid concerns over the EU referendum and the economic outlook in China. Britain’s biggest bank saw annual pre-tax profits tumble to 9.7 billion dollars (£7.2 billion), compared with 13.6 billion dollars (£10.2 billion) in the same period in 2015. \nPre-tax profit in the second quarter plummeted 45% to 3.61 billion US dollars. \nGroup chairman Douglas Flint said the results come amid a “turbulent period” for the bank. \nHe said: \nConcern over the sustainable level of economic growth in China was the most significant feature of the first quarter and, as this moderated, uncertainty over the upcoming UK referendum on membership of the European Union intensified. \nHSBC said revenue fell from 32.9 billion dollars (£24.7 billion) in the first half of 2015 to 29.5 billion dollars (£22.1 billion) in the first six months of this year. \nThe results cover from the start of 2016 up to one week after the June 23 referendum. \n“The period ended with exceptional volatility as financial markets reacted to the UK referendum decision to leave the EU, a result that had not been anticipated,” Mr Flint said. \nThe bank saw demand for credit investment fall as a consequence of uncertainty during the first half of the year, and a chill in equity market activity was exacerbated by factors including a crash in the price of oil, he added. \nThe vote to leave the EU means the UK and UK business are entering a “new era”, Mr Flint said as he warned that negotiating Brexit and new global trade deals will be complex and time-consuming. \nHe called for calm and careful consideration as to how prosperity, growth and a “dynamic economy” for the EU and UK can be ensured after an “orderly transition period”. \nHSBC relies on open trading relationships, from individuals to nations, he explained. \nHe continued: \nCritical elements include securing the best possible outcome on continuing terms of trade and market access, and ensuring the UK remains attractive for inward investment and has access to all the skills necessary to be fully competitive. \nWe believe that such an open trading relationship must be at the centre of the new relationship between the UK and the EU, and indeed the rest of the world. \nWe aim to do our part in making the transition for our customers to the new arrangements as smooth as possible. \nDepending on the outcome of the Brexit negotiations, particularly the UK’s “passporting” arrangements - authorisation to trade with the EU - the bank will have to reposition its European business, Mr Flint said. \nFurthermore he said that, despite those efforts, there were other threats from “political and geopolitical events”. \nHSBC also announced a 2.5 billion US dollars (£1.9 billion) shares buyback and said shareholders would receive half of the proceeds of the sale of its Brazil unit. Douglas Flint the Group Chairman of HSBC Holdings NewcastleChronicle Previous Articles", "external_links": [], "published": "2016-08-03T10:22:00.000+03:00", "crawled": "2016-08-03T11:31:54.348+03:00", "highlightTitle": ""}