{"organizations": [], "uuid": "0a13aa5b56ed94f5d2d8d7a5c3a428a34a90499a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/29666820/15329568.jpg", "site_section": "http://www.thisisleicestershire.co.uk/weathernews/rss.html?chid=182806", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/opinion-brexit-what-does-it-mean-for-the-leicestershire-property-market/story-29666820-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "Leicester Mercury published OPINION: Brexit, what does it mean for the Leicestershire...", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "Leicester Mercury published OPINION: Brexit, what does it mean for the Leicestershire...", "spam_score": 0.0, "site_type": "news", "published": "2016-08-30T16:33:00.000+03:00", "replies_count": 0, "uuid": "0a13aa5b56ed94f5d2d8d7a5c3a428a34a90499a"}, "author": "Leicester Mercury", "url": "http://www.leicestermercury.co.uk/opinion-brexit-what-does-it-mean-for-the-leicestershire-property-market/story-29666820-detail/story.html", "ord_in_thread": 0, "title": "Leicester Mercury published OPINION: Brexit, what does it mean for the Leicestershire...", "locations": [], "entities": {"persons": [{"name": "richard harrison", "sentiment": "none"}, {"name": "james court", "sentiment": "none"}, {"name": "mr court", "sentiment": "none"}], "locations": [{"name": "leicestershire", "sentiment": "none"}, {"name": "east midlands", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "greater london", "sentiment": "none"}], "organizations": [{"name": "readings property group", "sentiment": "none"}, {"name": "naea", "sentiment": "none"}, {"name": "national association of estate agents", "sentiment": "none"}, {"name": "bentons", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Comments (0) \nTwo months after the Brexit vote, the full implications of this fateful decision and the timescales by which the UK will navigate an ultimate exit from the EU remain unknown.The period of uncertainty looks set to continue as Government redefines our relationship with other European countries.The impact of the referendum has taken the property market into uncharted waters, with prospective vendors still jittery about putting their home up for sale until the picture is clearer. \nThe time it will take for the Government to negotiate a new deal has put the brakes on housing activity since the start of the year. Brexit fears have compounded a downward spiral in the Greater London property market as vendors seek to cash in on years of house price inflation in the capital.Latest figures from Home.co.uk reveal that between July and August asking prices in London slumped by 1.2%, the third monthly fall in a row, perpetuating fears of a 'ripple' effect throughout the country. \nHowever, so far, so good for Leicestershire, as local property experts report buoyant sales, with better to come.Many estate agents expected to see uncertainty in the immediate period following Brexit. During the summer months the market is generally quiet. But now demand is rising and most agents are expecting the housing market to get back into full swing in the coming months.Half-year results published this week by house builder Persimmon Homes underline the feeling of optimism, revealing a robust trading performance, with good autumn sales anticipated. Visitor numbers to sites since Brexit are 20% up on the previous year and private sale reservations 17% up on last year.In its July review The National Association of Estate Agents (NAEA) said nearly a third, 31%, of estate agents reported no changes in the housing market since Brexit, with business as usual. A further 31% of agents said interest from foreign investors has remained the same. \nJames Court, Director at Leicester-based The Readings Property Group, is pleasantly surprised by the current buoyant state of the property market.\"We were certainly expecting a rapid downturn in activity levels post Brexit, but it simply hasn't materialised. We have sold the same number of houses in June, July and August, all being up on this time last year by some 10%.\"The Readings group has agreed sales over this period right across the board, from £41,000 to over £600,000, indicating on-going activity in all sectors. \"With the drop in interest rates those with capital on deposit are looking at alternative solutions and property seems to be favourite,\" said Mr Court. \"There are record low mortgage deals out there and there continues to be a lack of supply for good quality rental properties, but it is not only landlords buying, as we have an increase in first time purchasers and first time movers.\"One hopes that the property market in the East Midlands will, as before, not see the extremes witnessed in the London-based property market. The Bank of England's swift move to quantitative easing and the interest rate cut seem have softened any immediate economic slowdown.\"Richard Harrison, Senior Residential Valuer at Bentons feels the market is as strong as ever: \"Since the announcement of Brexit, we have experienced no immediate change in the housing market with activity as strong as ever. As one of the areas longest established estate agents, we have experienced many elections, interest rate changes and fluctuating market conditions.\"There are two things that affect the property market, confidence and interest rates. Rates are at an all-time low with great mortgage deals, there is a robust demand for houses and a lack of supply of second hand homes to the market. In any case, we advise potential home sellers to obtain expert advice from an experienced valuer if considering selling this year.\" Property Search", "external_links": [], "published": "2016-08-30T16:33:00.000+03:00", "crawled": "2016-08-30T13:39:33.901+03:00", "highlightTitle": ""}