{"organizations": [], "uuid": "a57b43e4a588d9221978cdc0b7cc8b3561cabd18", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article11780804.ece/ALTERNATES/s1200/JS32300308.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-breakfast-live-turnover-drops-11780810", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Turnover drops at electronic components manufacturer", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast LIVE: Turnover drops at electronic components manufacturer", "spam_score": 0.0, "site_type": "news", "published": "2016-08-22T15:31:00.000+03:00", "replies_count": 0, "uuid": "a57b43e4a588d9221978cdc0b7cc8b3561cabd18"}, "author": "Robert Gibson-NEC", "url": "http://www.chroniclelive.co.uk/business/business-breakfast-live-turnover-drops-11780810", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Turnover drops at electronic components manufacturer", "locations": [], "entities": {"persons": [{"name": "robert gibson-nec talksport", "sentiment": "negative"}, {"name": "robert gibson-nec brexit", "sentiment": "none"}, {"name": "robert", "sentiment": "none"}, {"name": "july.gordon clark", "sentiment": "none"}, {"name": "fionnuala", "sentiment": "none"}, {"name": "richard huntingford", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "qatar", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "welwyn", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "middle eastern", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "wireless group", "sentiment": "negative"}, {"name": "news corp", "sentiment": "none"}, {"name": "countrywide", "sentiment": "none"}, {"name": "global blue", "sentiment": "none"}, {"name": "virgin radio uk", "sentiment": "none"}, {"name": "the times", "sentiment": "none"}, {"name": "welwyn components", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "welwyn components limited", "sentiment": "none"}, {"name": "wireless.news corp", "sentiment": "none"}, {"name": "premier league", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "08:45 Robert Gibson-NEC Talksport breaks listener records as owner Wireless Group report £4.5m profits \nTalkSport owner the Wireless Group, which is in the process of being taken over by News Corp, has reported a solid set of results for the first half of the year.Boosted by the Euro 2016 championships, TalkSport saw its weekly audience increase to 3.3 million, the station’s second highest, with four of its key weekday shows breaking listener records.The firm said pre-tax profits for the six months to June 30 came in at £4.5 million, down slightly from £5 million in the same period last year. Sales rose from £37 million to £38.2 million. However, chairman Richard Huntingford flagged that uncertainty linked to the EU referendum was dragging on the advertising market in Ireland.He said: “In our local stations and in Ireland, advertising trends were softer as we moved towards the referendum in Q2.“Whilst it is still unclear what impact the uncertainty created by Brexit might have on advertising revenues in the all-important Q4, including in Ireland, the group currently anticipates a full-year outturn broadly in line with expectations.”He added that “good progress” is being made in securing regulatory clearances in connection with the News Corp offer.The media giant behind The Sun and The Times newspapers announced in June that it was diving into the digital radio market by making a £220 million swoop for Wireless.News Corp said it had moved to snap up Wireless Group because it made an “excellent strategic fit” and would strengthen its digital business. TalkSport has the radio and digital broadcasting rights to the Premier League and the FA Cup.The cash offer will see Wireless shareholders receive 315p per share, while named shareholders from May 20 this year will pocket a special dividend of 6.15p and a final dividend of 7.6p.Wireless also owns Virgin Radio UK and TalkRadio. The company sold off its TV assets to ITV for £100 million in February. TalkSport owner the Wireless Group has reported half-year pre-tax profits of £4.5m 08:56 Robert Gibson-NEC Brexit boost for tourist visiting UK as tax-free spending rises \nA weaker pound in the wake of the Brexit vote has led to a 7% increase in tax free shopping by tourists, according to new figures.That was the international tax free spend in stores across the UK for July compared to the same time in the previous year, according to Global Blue tax free shopping network.Spending from Chinese tourists accounted for 32% of the total, the largest from any nationality. Their average spend was about £840 per transaction.Travellers from the US made the most of the exchange rate and were the second largest spenders. They accounted for a 7% share of the total spend and an average payout of £734.Hong Kong travellers followed closely in third position with a 6% share of total spend in the UK.Global Blue believe that the start of Ramadan may have softened the growth in spending from Middle Eastern visitors but it still did not put them off from ringing up large amounts at the tills.Travellers from Qatar had the highest average spend per transaction at £1,642 in July.Gordon Clark, Global Blue’s managing director for UK and Ireland, said: “Though the weaker pound following the referendum was initially unwelcome news, it has proved perfect timing for tourists visiting the UK, enjoying the British leisure, luxury and cultural offering during the summer season.“The cash injection we have seen off the back of this has been hugely beneficial for our tourism economy. As the pound still fluctuates, we hope the flurry of tourist activity to the UK has inspired others to follow suit and visit and shop in the UK, where they can see a large discount from exchange rate benefits, but also from tax free shopping.” A weaker pound in the wake of the Brexit vote has led to a 7% increase in tax free shopping by tourists, according to new figures. 08:37 Robert Gibson-NEC Turnover drops at Welwyn Components LImited \nThe Bedlington-based Welwyn Components Limited has seen revenues fall after experiencing lower demand for some of its products. \nDuring the year ended December 31, 2015, the company, which develops, makes and sells passive electronic components and hybrid micro-circuits, turned over £32.9m, down considerably from the £39.2m reported the previous year. \nProfits, however, remained consistent at £4.6m. \nIn a strategic report, Welwyn said: “During 2015, Welwyn Components experienced positive performance in the hybrid micro-circuits unit as a result of additional activity from some of its major customers. \n“The passive part of the business was impacted with lower demand as a result of global factors impacting the second half of the year in particular. \n“There were new product introductions on both sides of the business during the year. \n“As with the previous year, cost and variance control were a key focus of the team with frequent review to ensure controls are effective.” \nThe company added that teams are in place to improve operations against a range of key performance indicators. \nThe report said: “The expectation is that 2016 will be broadly in line with 2015 from a sales perspective. \n“New product introductions will support the business compensating for some programmes where reductions may be experienced. \n“The overall sales picture is one of consistency. \n“Investment in new equipment will continue as appropriate to ensure the business continues to offer diverse solutions for customers across all product ranges.” 09:01 Robert Gibson-NEC But Britain's decision to leave EU will hit housing, warns estate agent \nBrexit uncertainty will deal a blow to Britain’s housing market next year, with prices forecast to contract and not recover from the shock until 2018, according to a new report.Fresh forecasts from estate agency Countrywide estimate that home price growth across the country will slow to 2.5% this year, contract by 1% in 2017, before finally recovering to 2% in 2018. The EU referendum is being blamed for unsettling the housing market and is being eyed for its potential impact on economic fundamentals like trade and economic growth.“Our central view is that the economy will avoid a hard landing, which is good news for housing markets.“However, the weaker prospects for confidence, household incomes and the labour market mean that we do expect some modest falls in house prices before they return to positive growth towards the end of 2017 and into 2018,” said Countrywide’s chief economist Fionnuala Earley.Stamp duty, especially in London’s prime markets, will also play a role in driving down home prices, Countrywide explained.", "external_links": [], "published": "2016-08-22T15:31:00.000+03:00", "crawled": "2016-08-22T11:10:08.383+03:00", "highlightTitle": ""}