{"organizations": [], "uuid": "0d5dd3f9180cc540f9dba889a0d7b3c678de0c83", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article11826108.ece/ALTERNATES/s1200/JS74317974.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/eu-referendum-report-reveals-north-11825936", "country": "GB", "domain_rank": 21960, "title": "EU Referendum: Report reveals why the North East backed Brexit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "EU Referendum: Report reveals why the North East backed Brexit", "spam_score": 0.0, "site_type": "news", "published": "2016-09-01T01:30:00.000+03:00", "replies_count": 0, "uuid": "0d5dd3f9180cc540f9dba889a0d7b3c678de0c83"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/eu-referendum-report-reveals-north-11825936", "ord_in_thread": 0, "title": "EU Referendum: Report reveals why the North East backed Brexit", "locations": [], "entities": {"persons": [{"name": "jeremy corbyn", "sentiment": "none"}, {"name": "matthew goodwin", "sentiment": "none"}, {"name": "danny lawson/pa wire jenny watson", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "julia unwin", "sentiment": "none"}, {"name": "boris johnson", "sentiment": "none"}, {"name": "nigel farage", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "clerkenwell", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "manchester town hall  ms unwin", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "labour", "sentiment": "none"}, {"name": "university of kent", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "sage gateshead", "sentiment": "none"}, {"name": "bes", "sentiment": "none"}, {"name": "sunderland leave", "sentiment": "none"}, {"name": "foundation", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "joseph rowntree foundation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "EU Referendum: Report reveals why the North East backed Brexit 18:30, 31 Aug 2016 The report by the Joseph Rowntree Foundation reveals why the region voted Leave in the EU Referendum Shares Get daily news by email Former UKIP Leader Nigel Farage addresses supporters at Sage Gateshead \nA new report has revealed why the North East came down so heavily for Brexit at the European Union referendum . \nIt follows research carried out by the North-based Joseph Rowntree Foundation which showed how voting was divided across economic, educational and social lines. \nIt concludes that people who have been pushed to the margins of society, who live on low incomes, have few qualifications and lack the skills required to prosper in the modern economy, were more likely than others to vote for leaving the European Union . \nThe feeling of being left behind also stemmed from where people live. \nComparing people with the same income and education, they were much more likely to vote Leave if they live in a low-skilled area with few opportunities. Vote remain flags are displayed outside a pub in Clerkenwell on June 23, 2016 in London \nA ‘double whammy’ proved crucial, where people with low skills were ‘further cut adrift’ by a lack of opportunities within their local areas to get ahead. \nThe Foundation said the findings were a direct call for the government to make good on its promise of ‘making Britain work for all’, and ensure everyone has the opportunity to build a better life. \nChief Executive Julia Unwin said: “The research shows how Britain cannot afford to return to business as usual following the vote for Brexit. The result was a wake-up call: for too long, many communities have been struggling as the country’s prosperity passed them by and missed out on opportunities to build a better life.” \nThe first indication on June 23 that the UK was going to vote leave came in the North East. Leave campaigners celebrate as they win the vote in Sunderland during the North East region European Union referendum count on June 24, 2016 While the Remain campaign just scraped home in Newcastle where they had expected a resounding victory, in Sunderland Leave won by a landslide. \nAcross the North East, there was a 58% vote for Brexit, despite it being the heartland of the Labour party whose policy was to remain in the EU. \nWhile leader Jeremy Corbyn was criticised for conducting a lacklustre campaign, the vote also revealed fundamental issues like a feeling the region had been ignored by a pro-Europe Westminster elite which it rebelled against on the night of the vote. \nThe research analysed the role of the characteristics of people and places in the Leave vote. \nDrawing on data from the British Election Study (BES), the research drilled down into the backgrounds, attitudes and values of Leave voters, painting a detailed picture of what motivated their decision at the referendum. Boris Johnson visiting Newcastle during the Vote Leave campaign \nThe research found people living in the poorest households, which earn less than £20,000 per year, were much more likely to support leaving the EU than those in the wealthiest households, as were the unemployed, those looking for work, people in low-skilled and precarious manual occupations. \nSupport for Leave was 10 percentage points higher among those on less than £20,000 per year than it was among those who earn more than £60,000. \nUnemployed people and those looking for work were also far more likely to support Brexit (59%) than those in full employment (45%). \nEducational inequality was the standout trend behind the vote, showing that a lack of opportunity for low-skilled workers was a key driving force. Support for Leave was 30% higher among those with GCSE qualifications or below than it was for people with a degree. \nOver 70% of people with no qualification voted for Brexit, while over 70% of people with a postgraduate degree voted to remain. Danny Lawson/PA Wire Jenny Watson the Chief Counting Officer for The EU Referendum announces the result of polling at Manchester Town Hall \nMs Unwin added: “With energy focussed on the process of leaving the EU, there’s a danger the concerns of people at home are ignored. This analysis should act as beacon for politicians who often talk about representing the concerns of ordinary people. \n“The rapid pace of change in the economy has left too many people without the skills and opportunity to get on in life. We must act to ensure prosperity reaches all corners of the country, and provide everyone the chance to earn a good wage in a secure job. \n“Theresa May has made the right noises to overcome this and heal the divisions with a promise to make Britain work for all. The priority is making good on this promise.” \nProfessor Matthew Goodwin, author of the research at the University of Kent, said: “This research reveals how the referendum was not simply about our relationship with the European Union, but also shed light on the deep divides that exist in our society. \n“The findings of our research point to the importance of both people and place. It wasn’t only that people who are struggling tended to support Brexit but also in some cases more skilled people who reside in low skilled areas. \n“This is a crucial finding as it speaks as much to the debate about how to ensure that people have the same opportunities as it does to questions about poverty, educational inequality and disadvantage.” More on the EU Referendum", "external_links": [], "published": "2016-09-01T01:30:00.000+03:00", "crawled": "2016-08-31T21:10:33.677+03:00", "highlightTitle": ""}