{"organizations": [], "uuid": "6e726254d54bef394b90434c8fbff19b4b8c5e2b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article11734625.ece/ALTERNATES/s1200/JS96773226.jpg", "site_section": "http://www.thejournal.co.uk/business/?service=rss", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/keepmoat-gears-growth-new-markets-11734524", "country": "GB", "domain_rank": 21960, "title": "Keepmoat gears for growth in new markets amid Brexit uncertainty", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Keepmoat gears for growth in new markets amid Brexit uncertainty", "spam_score": 0.0, "site_type": "news", "published": "2016-08-12T01:30:00.000+03:00", "replies_count": 0, "uuid": "6e726254d54bef394b90434c8fbff19b4b8c5e2b"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/keepmoat-gears-growth-new-markets-11734524", "ord_in_thread": 0, "title": "Keepmoat gears for growth in new markets amid Brexit uncertainty", "locations": [], "entities": {"persons": [{"name": "lee francis of k", "sentiment": "none"}, {"name": "keepmoat", "sentiment": "none"}, {"name": "lee francis", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "keepmoat", "sentiment": "none"}], "organizations": [{"name": "sunderland city council", "sentiment": "none"}, {"name": "heritage lottery fund", "sentiment": "none"}, {"name": "mac) trust", "sentiment": "none"}, {"name": "sunderland music arts and culture", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Keepmoat gears for growth in new markets amid Brexit uncertainty 18:30, 11 Aug 2016 Lee Francis of Keepmoat, says developers have to think outside the box to support the region’s economy and prevent a skills crisis Shares Get business news by email Keepmoat are currently on site in Dunston \nCuts to Government spending coupled with the rising uncertainty of Brexit has led housing and regeneration specialist Keepmoat to look at new ways of investing in communities. \nLee Francis, area director of Keepmoat’s North East division, describes how the firm has now committed to an aggressive growth plan centred on new markets which will reinvest in the region. \nThe firm recently took on five new recruits with extensive backgrounds in varying aspects of construction to support the strategy, which the director describes as a key move. \nHe said: “Adaptability is fundamental. Yes, we have a worrying housing shortage and this correlates with the concerns surrounding a skills crisis in construction; but what about current homes and infrastructure? \n“There are existing substandard properties that desperately need renovations and upgrades to maintain a decent standard of living; and there are public buildings and local infrastructure that needs restoring. \n“It’s also not just about new homes for first time buyers – we need to consider student accommodation, right through to homes for older people; while investing in the wider area to ensure the North East is a desirable place to live and work. \n“In the last few months alone, Keepmoat has continued to expand into new markets including retail, student accommodation, public buildings and education. Lee Francis \n“As well as securing a place on the Lidl framework, we have recently been selected to deliver a project on behalf of Sunderland Music Arts and Culture (MAC) Trust, in partnership with Sunderland City Council and the Heritage Lottery Fund. \n“This will see us convert a former Fire Station into a music and arts hub, which will include a restaurant and dance studio. \n“We have continued to work in partnership with the local councils and local communities to look at the improvements that are needed across the board, and this fire station is a prime example. We will not only be restoring an iconic building, we’ll be providing opportunities for a number of generations to embrace art and culture. \n“By adopting a broader view on what the region requires to thrive, we will also, in turn, upskill a new generation across varying sectors.” \nHiring new recruits and training remains a vital part of the firm’s strategy. \nHe added: “Change can only happen when you invest in people. \n“We’ve seen a clear demand for more than just new homes and we have adapted the way we work accordingly. This will ensure we deliver the right products across the region, while continuing to support the next generation in construction.”", "external_links": [], "published": "2016-08-12T01:30:00.000+03:00", "crawled": "2016-08-11T20:43:32.369+03:00", "highlightTitle": ""}