{"organizations": [], "uuid": "a8b57ab5544c45102c4591b486b684d3b46cff70", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article11710961.ece/ALTERNATES/s1200/JS33630297.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/g4s-update-debt-reduction-progress-11710842", "country": "GB", "domain_rank": 21960, "title": "G4S to update on debt reduction progress when results are published this week", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "G4S to update on debt reduction progress when results are published this week", "spam_score": 0.0, "site_type": "news", "published": "2016-08-08T08:30:00.000+03:00", "replies_count": 0, "uuid": "a8b57ab5544c45102c4591b486b684d3b46cff70"}, "author": "Agency Staff", "url": "http://www.chroniclelive.co.uk/business/business-news/g4s-update-debt-reduction-progress-11710842", "ord_in_thread": 0, "title": "G4S to update on debt reduction progress when results are published this week", "locations": [], "entities": {"persons": [{"name": "almanza", "sentiment": "none"}, {"name": "omar mateen", "sentiment": "none"}, {"name": "ashley almanza", "sentiment": "none"}, {"name": "graham spooner", "sentiment": "none"}], "locations": [{"name": "south florida.the london-listed", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "crawley", "sentiment": "none"}, {"name": "west sussex", "sentiment": "none"}, {"name": "orlando", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "shares get   gareth fuller/pa wire g4s headquarters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "G4S to update on debt reduction progress when results are published this week 06:30, 8 Aug 2016 By Agency Staff The company may be in line for a setback if it takes a hit from the collapse in the pound following the Brexit vote Shares Get   Gareth Fuller/PA Wire G4S Headquarters in Crawley, West Sussex \nG4S is expected to update the City on the progress of its debt reduction plans on Wednesday when the outsourcing giant will post its half-year results.The world's biggest security company has been looking to shore up its balance sheet by winding down \"onerous contracts\", disposing of loss-making businesses and driving down its debts, which hit £1.782 billion at the end of December last year. However, the company may be in line for a setback if it takes a hit from the collapse in the pound following the Brexit vote .While just over half of G4S' debts are in sterling, the currency fall will make its debt in euros and dollars more expensive when converted back into pounds. The company is expected to deliver a profit before interest, tax and amortisation (PBITA) of between £185 million and £205 million for the first half of the year, benefiting from a growing demand for security work following a spate of overseas terrorist attacks. Ashley Almanza CEO of G4S \nIt comes after G4S said in May that it had recorded a positive start to the year after revenues rose 4.5% in the first quarter to £1.5 billion. Graham Spooner, investment research analyst at The Share Centre, said: \"The share price has remained under pressure over the last year, as concerns continue over the dividend, debt situation, exposure to Europe and movements in currency.\"He added: \"Investors will be hoping that in an unsettled world demand for security work is unlikely to fall significantly.\"G4S saw its share price suffer a blow in June following the revelation that Florida nightclub shooter, Omar Mateen, had worked for the security firm. The 29-year-old, who gunned down 50 people at the Pulse nightclub in Orlando, had been employed by the business since 2007.It said he worked as a staff member at a gated retirement community in South Florida.The London-listed firm's share price has now recovered, trading 2.4% ahead of three months ago, but is still 32% down on last year. G4S employs around 623,000 staff in over 110 countries, and is run by chief executive Ashley Almanza who joined the group three years ago.Mr Almanza is attempting to turn G4S around after a number of public scandals, including a prisoner-tagging contract in 2013 and its botched handling of security at the London Olympics in 2012.G4S reported a 40% decline in pre-tax profit in 2015, falling to £78 million from £128 million a year earlier.", "external_links": [], "published": "2016-08-08T08:30:00.000+03:00", "crawled": "2016-08-08T08:49:06.277+03:00", "highlightTitle": ""}