{"organizations": [], "uuid": "12aed0660db48f42ff49d5f6317be6fc13b041d4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article11600825.ece/ALTERNATES/s1200/JS63987151-1.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/business-breakfast-live-quantum-pharma-11816870", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Quantum Pharma declares good trading progress, plus Amazon and The Gym Group news", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast LIVE: Quantum Pharma declares good trading progress, plus Amazon and The Gym Group news", "spam_score": 0.0, "site_type": "news", "published": "2016-08-31T15:10:00.000+03:00", "replies_count": 0, "uuid": "12aed0660db48f42ff49d5f6317be6fc13b041d4"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/business-breakfast-live-quantum-pharma-11816870", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Quantum Pharma declares good trading progress, plus Amazon and The Gym Group news", "locations": [], "entities": {"persons": [{"name": "coreena ford newcastle", "sentiment": "negative"}, {"name": "itai frieberger", "sentiment": "none"}, {"name": "jorrit van der meulen", "sentiment": "none"}, {"name": "christo wiese", "sentiment": "none"}, {"name": "coreena ford steinhoff", "sentiment": "none"}, {"name": "james doyle", "sentiment": "none"}, {"name": "yuichi kamata", "sentiment": "none"}, {"name": "gareth bacon", "sentiment": "none"}, {"name": "william hill", "sentiment": "none"}, {"name": "chris salkeld", "sentiment": "none"}, {"name": "ward hadaway", "sentiment": "none"}, {"name": "john treharne", "sentiment": "none"}, {"name": "treharne", "sentiment": "none"}, {"name": "david musgrave", "sentiment": "none"}, {"name": "daniel rausch", "sentiment": "none"}, {"name": "hann-ju ho", "sentiment": "none"}, {"name": "sadiq khan", "sentiment": "none"}, {"name": "yutaka nishida", "sentiment": "none"}, {"name": "alex simpson", "sentiment": "none"}, {"name": "coreena ford top", "sentiment": "none"}, {"name": "steinhoff", "sentiment": "none"}, {"name": "ross holland", "sentiment": "none"}, {"name": "coreena ford", "sentiment": "none"}, {"name": "carl swansbury", "sentiment": "none"}, {"name": "rob armstrong", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "poundland", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "new look", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "olay", "sentiment": "none"}, {"name": "denmark", "sentiment": "none"}, {"name": "iceland", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}, {"name": "gibraltar", "sentiment": "none"}, {"name": "forth street", "sentiment": "none"}], "organizations": [{"name": "quantum pharma", "sentiment": "negative"}, {"name": "amazon", "sentiment": "negative"}, {"name": "gla conservative london assembly", "sentiment": "none"}, {"name": "harveys", "sentiment": "none"}, {"name": "sage", "sentiment": "none"}, {"name": "888 holdings", "sentiment": "none"}, {"name": "the gym group", "sentiment": "none"}, {"name": "whirlpool", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "lloyds bank commercial banking", "sentiment": "none"}, {"name": "trust tech inc.", "sentiment": "none"}, {"name": "group", "sentiment": "none"}, {"name": "home retail group", "sentiment": "none"}, {"name": "lloyds bank", "sentiment": "none"}, {"name": "mtrec ltd", "sentiment": "none"}, {"name": "amazon dash", "sentiment": "none"}, {"name": "sainsbury", "sentiment": "none"}, {"name": "board", "sentiment": "none"}, {"name": "andrex", "sentiment": "none"}, {"name": "box social brewing", "sentiment": "none"}, {"name": "argos", "sentiment": "none"}, {"name": "coreena ford", "sentiment": "none"}, {"name": "samsung", "sentiment": "none"}, {"name": "amazon eu", "sentiment": "none"}, {"name": "bensons", "sentiment": "none"}, {"name": "greater london authority", "sentiment": "none"}, {"name": "newcastle  ne1 ltd", "sentiment": "none"}, {"name": "grundig", "sentiment": "none"}, {"name": "coreena ford business", "sentiment": "none"}, {"name": "ward hadaway fastest", "sentiment": "none"}, {"name": "ergocalciferol", "sentiment": "none"}, {"name": "gym group", "sentiment": "none"}, {"name": "japanese-listed trust tech inc", "sentiment": "none"}, {"name": "hsbc", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "coreena ford amazon dash", "sentiment": "none"}, {"name": "rank group", "sentiment": "none"}, {"name": "vitamin d", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "gillette", "sentiment": "none"}, {"name": "right guard", "sentiment": "none"}, {"name": "amazon prime", "sentiment": "none"}, {"name": "niche pharmaceuticals", "sentiment": "none"}, {"name": "darty", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "That’s it for today . . .more to come tomorrow! 9.23 Coreena Ford Newcastle set for a second micropub \nThe Split Chimp is already doing a roaring trade...and now one of its suppliers, Box Social Brewing, is set to open up its own micro boozer. \nThe Box Social will hopefully open in Arch 11 on Forth Street, and a license application is now in. \nFingers and toes crossed for them. Full story on their plans here . Ross Holland from Box Social Brewing in Newcastle \nNE1 Ltd and the micropub community are right behind them too.. 9.18 Coreena Ford MTrec deal completes \nEarlier this month, we told how a multi-million pound deal to sell a North East training firm was in motion. \nThat deal has now completed. \nNewcastle’s MTrec Ltd, one of the North East’s leading providers of staffing and training solutions, has been acquired by Japanese-listed Trust Tech Inc in a £17.1m deal that could create hundreds of jobs in the North East. \nThe acquisition is Trust Tech Inc.’s first strategic acquisition in Europe, with the new owners saying they will work closely with MTrec’s existing management team to create a global staffing and training company. \nMore on that here . The deal is done. From left to right, Rob Armstrong, Co-founder and Director, MTrec, Carl Swansbury, Partner, RGCF, James Doyle, MTrec (front row), Yutaka Nishida, President and Representative Director, Trust Tech Inc. (back row), David Musgrave, Co-founder and Director, MTrec (back row), Chris Salkeld, MTrec (front row), Alex Simpson, Executive, RGCF (back row), Yuichi Kamata, Head of Corporate Planning, Trust Tech Inc. (front row) 9.08 Coreena Ford Business show flicker of confidence post-Brexit \nAnother day, another post-Brexit poll.. \nAnd this time business confidence has apparently shown signs of recovery from the slump seen in the immediate aftermath of the Brexit vote. \nThat’s according to the Lloyds Bank business barometer which found that UK business confidence dropped by 13 points to 16% in August, but remained higher than the reading taken in the days after Britain’s voted to leave the European Union. \nIt said the net balance for companies expecting trading to improve slipped to its lowest level since December 2011, falling 22 points to 19% in August. \nBut despite concerns over trading, businesses are still keen to take on staff, with the net balance of companies expecting to boost their workforce hitting a five-month high of 33%. \nHann-Ju Ho, senior economist for Lloyds Bank Commercial Banking, said: \nIt is consistent with a slowdown in UK growth prospects in the second half of the year and may reflect a growing expectation for some that a more challenging economic outlook will have a negative impact on their own company prospects. Despite this, hiring plans continue to indicate resilience. \nThe report comes as separate study published on Friday showed that consumer confidence had risen at its fastest monthly rate in three-and-a-half years. \nIn a dramatic turnaround from last month, the YouGov/Cebr Consumer Confidence Index has seen its highest monthly bounce since February 2013 of 3.2 points to 109.8. \nThe poll reveals significant increases in people’s expectations for their household financial situations and property values over the coming year. Another post-Brexit poll has been unveiled, this time revealing a flicker of confidence 8.57 Coreena Ford Cybercrime taking more than £147bn a year from Uk economy \nCybercrime stands to cost the UK economy more than £147 billion per year, a new report claims. Data compiled by the Greater London Authority (GLA) Conservatives says that as many as 1.8 million companies in the UK could have experienced a security breach in 2015, and the subsequent costs to business are rising. \nBetween 2014 and 2015, hacking increased 9% among large businesses, and 14% among small organisations, accounting for viruses, denial of service attacks or unauthorised infiltration by hackers. \nMeanwhile, the price tag associated with cybercrime has more than doubled for large organisations, costing each business as much as £3.14 million in 2015, up from £1.5 million a year earlier. \nFor small organisations, hacking cost individual businesses as much as £311,000 each last year, up from an upward estimate of £115,000 in 2014. \nGareth Bacon, a GLA Conservative London Assembly Member said: \nData is the true currency of modern society and hackers are making a mint because companies are leaving the metaphorical door unlocked. \nThis is theft on a massive scale with conservative estimates putting the potential cost of online data theft in the UK at £147 billion a year. \nThe concentration of businesses in London means the British capital alone is being deprived of about £36 billion per year, the report explains. \nGLA Conservatives are now calling on the Mayor of London, Sadiq Khan, to develop a new cybersecurity standard that would inform businesses of simple security measures that could help keep their operations safe. \nMeanwhile, demand for cybersecurity experts is already on the rise. PwC earlier this month unveiled plans to hire more than 1,000 new tech specialists by 2020 to address growing online security concerns among UK businesses. \nIt follows a number of high profile hackings at British companies in recent months, including TalkTalk, HSBC and Sage. \nThousands of customers’ bank account and contact details were accessed after a cyberattack at TalkTalk, the telecoms firm announced in October. Banking giant HSBC was later hit by a denial of service attack that temporarily shut down its online banking service in February. \nSoftware accounting firm Sage said earlier this month that the employee details for about 280 companies were accessed by an unauthorised user via an internal login. Dominic Lipinski/PA Wire Cybercrime is costing the Uk economy billions of pounds 8.48 Coreena Ford The Fastest 50 search gets underway today . . ! \nThe search to find the North East’s fastest growing companies starts today with the launch of the Ward Hadaway Fastest 50 for 2016. \nThe Ward Hadaway Fastest 50, devised by leading North law firm Ward Hadaway and backed by The Journal, is the definitive guide to the pace-setting companies across the region who have achieved the most impressive performances in growing their businesses. \nFind out more here . 8.43 Coreena Ford Steinhoff warns of post=Brexit impact on UK businesses \nHarveys and Bensons for Beds owner Steinhoff has warned the collapse in the value of sterling following the EU referendum could have an adverse impact on its British businesses. \nThe South African retailer, which is also in the midst of taking over Poundland, said the currency’s plunge may result in an “unfavourable effect when translating out businesses’ earnings reported into euro”, adding it could have “an adverse effect on future margin”. \nSterling has plummeted more than 10% against the dollar since June 23. \nAs well as the Poundland acquisition, Steinhoff has made a determined effort to expand further across Europe recently, having tried and failed to gatecrash two deals earlier this year. \nIt recently lost out in a battle with Sainsbury’s to buy Argos owner Home Retail Group in March, and was outbid for London-listed white goods retailer Darty. It is backed by South African retail billionaire Christo Wiese, whose Brait investment group also owns controlling stakes in Virgin Active, New Look and food chain Iceland. The firm added \nThe referendum on 23 June... has created uncertainty in the business community and financial markets. “While the effect of this decision on consumer demand across Europe remains uncertain, the devaluation of the pound sterling may also result in an unfavourable effect when translating our businesses’ earnings reported into euro. Bensons for Beds logo 8.38 Coreena Ford Amazon Dash launches one-touch ordering \nAmazon Dash, WiFi-connected buttons that reorder household products with a single press, have been launched in the UK. \nThe e-commerce giant has so far only made the technology available in the US, but now more than 40 brands in the UK will offer buttons to Amazon Prime customers that can quickly re-supply everyday products. \nThe small devices are designed to be placed close to where users keep the product in question, so that when supplies are low items can quickly be reordered. The buttons will cost £4.99 and are each only linked to a single product. \nHowever, Amazon says customers will receive a £4.99 discount on their first purchase using one of the buttons. \nAndrex, Gillette, Listerine, Olay and Right Guard are among the list of companies to offer buttons at launch. \nDaniel Rausch, director of Amazon Dash said: \nDash Buttons offer the convenience of 1-Click shopping from anywhere in the home - they can be placed near those frequently used items you don’t want to run out of, and when you see supplies running low, the Dash Button makes it easier than ever to order more. Just press the button and your item is on its way. \nThe technology firm also announced a new service called Dash Replenishment, which combines with sensors built into smart appliances including printers and washing machines that will automatically reorder ink or detergent when supplies run low. \nJorrit Van der Meulen, vice president at Amazon EU said: \nDash Button gives you the convenience of 1-Click ordering in your home, and with Dash Replenishment we’re taking it one-step further - enabling connected appliances to automatically reorder supplies on your behalf. \nAmazon has already begun working with Samsung printers and Grundig and Whirlpool washing machines to deploy the technology. An Amazon worker taping a parcel yesterday. . . 8.30 Coreena Ford Euro 206 drives up 888's revenues \nOnline gaming firm 888 Holdings has said Euro 2016 and further expansion into the continent helped it post record revenue for the first half of the year. \nThe company, which recently pulled out of a joint bid with Rank Group for rival William Hill, said revenue rose 19% to 262 million US dollars (£200 million) in the period, with pre-tax profits climbing 39% to 27.8 million US dollars (£21.2 million). \nIt said it would continue “appraising strategic M&A opportunities” as it looks for further opportunities to expand. The group hailed a successful Euro 2016, adding that it benefited from launches in Spain, Denmark and Italy. \nChief executive Itai Frieberger said: \nThis strong outcome was driven by outstanding momentum at 888Casino and 888Sport. Trading in the third quarter has started well. \nHowever, the Gibraltar-based firm added that it is “exposed to political and regulatory risk as regards Brexit”. \nDirectors said: \nAt this point the position of Gibraltar, driving the ability of the group to continue to rely on the EU principles that are a major part of the group’s regulatory strategy regarding substantial EU markets, remains unclear. \nThe group continues to monitor this political risk and is engaged with the government of Gibraltar and Gibraltar online gaming industry bodies in managing the group’s response to this process. 8.26 Coreena Ford The Gym Group muscles in on fitness sector \nThe Gym Group has continued to flex its muscles, notching up increases in profits and revenues as it cashes in on Britain’s fitness boom. \nTurnover rose 25.1% to £36.1 million in the first half of the year, with pre-tax profits coming in at £3.6 million. \nBoss John Treharne said: \nExcellent progress has been achieved so far in 2016 as demonstrated by the growth in membership. Our existing sites are performing well which has contributed to the group’s strong growth in profitability. \nMr Treharne added that should the economy take a turn for the worse, the Gym Group will become “even more attractive to consumers”. \nHe said: \nIf the external environment becomes more challenging our value proposition will become even more attractive to consumers - the Gym Group opened its first gym in the wake of the financial crisis in 2008 and its model is designed to perform well in all types of economic conditions. \nThe company reported a 19.4% surge in members over the first half and now has 424,000 people on its books. \nThe group, which listed on the stock market in November, opened six new gyms in the period, bringing the total estate to 80. \nMr Treharne said the Gym Group is on track to meet full-year expectations, with analysts pencilling in pre-tax profits of up to £9 million. 8.15 Coreena Ford FTSE and pound latest \nThe FTSE-100 index opened at 6820.79. \nThe pound at 8am was 1.3091 dollars compared to 1.3083 dollars at the previous close. The euro at 8am was 0.8508 pounds compared to 0.8522 pounds at the previous close. 8.10 Coreena Ford Top story - Quantum Pharma trading in line with expectations \nCounty Durham pharma firm Quantum Pharma has posted a trading update on the stock exchange, detailing good progress during the half year ended July 31 - trading that’s in line with management expectations. \nOver the six months the group has launched a number of products from its Niche Pharmaceuticals division, particularly in the second quarter, including a number to help minimise the side effects of cancer treatment. \nThe timing of the product launches has been largely in line with expectations and directors said the firm is now moving into the market access and sales delivery phase. \nThe firm has a Vitamin D product portfolio, which has been extended by launching two new capsules under the Aviticol brand, as well as Ergocalciferol 50 000 IU capsules. \nAnd in the past two months the Mucodis range of patented medical devices - to help treat the side-effects of cancer treaments - was completed by the launch of a further three Mucodis products. \nSince the period end an oral solution for the treatment of peptic ulcers has also been launched. \nThe directors reiterated how full-year results will depend on the more recent product launches. \nThey said: \nThe Board continues to expect the Group to meet market expectations for the full year to 31 January 2017. \nAs previously indicated, the Group’s performance for the year is second-half weighted and will be dependent on the level of sales achieved by recent product launches as well as the timing and sales of further product launches due to be delivered in the remainder of the year.", "external_links": [], "published": "2016-08-31T15:10:00.000+03:00", "crawled": "2016-08-31T12:05:06.498+03:00", "highlightTitle": ""}