{"organizations": [], "uuid": "ef4f2579623a081f7e01efdbe5252403ee85596c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article11674108.ece/ALTERNATES/s1200/JS87412305.jpg", "site_section": "", "section_title": "", "url": "http://www.chroniclelive.co.uk/business/business-breakfast-live-generator-announces-11733760", "country": "IE", "domain_rank": 21960, "title": "Business Breakfast LIVE: Generator announces £420,000 programme for young creatives - Chronicle Live", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 0, "title_full": "Business Breakfast LIVE: Generator announces £420,000 programme for young creatives - Chronicle Live", "spam_score": 0.282, "site_type": "news", "published": "2016-08-11T17:25:00.000+03:00", "replies_count": 0, "uuid": "ef4f2579623a081f7e01efdbe5252403ee85596c"}, "author": "Robert Gibson-Nec", "url": "http://www.chroniclelive.co.uk/business/business-breakfast-live-generator-announces-11733760", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Generator announces £420,000 programme for young creatives - Chronicle Live", "locations": [], "entities": {"persons": [{"name": "robert gibson-nec", "sentiment": "none"}, {"name": "ward hadaway", "sentiment": "none"}, {"name": "robert", "sentiment": "none"}, {"name": "louise henry", "sentiment": "none"}, {"name": "mike cherry", "sentiment": "none"}, {"name": "joanne murnane", "sentiment": "none"}, {"name": "grainger", "sentiment": "none"}, {"name": "generator", "sentiment": "none"}, {"name": "helen gordon", "sentiment": "none"}, {"name": "michael cantwell", "sentiment": "none"}, {"name": "lyndsey everett", "sentiment": "none"}, {"name": "jayne pickersgill", "sentiment": "none"}, {"name": "rob thompson", "sentiment": "none"}, {"name": "paul marshall", "sentiment": "none"}, {"name": "kieron goldsborough", "sentiment": "none"}, {"name": "tom pollard", "sentiment": "none"}, {"name": "angela mazingham", "sentiment": "none"}, {"name": "pell frischmann", "sentiment": "none"}], "locations": [{"name": "leeds", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "doxford park", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "tyneside", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}], "organizations": [{"name": "desco", "sentiment": "none"}, {"name": "robert gibson-nec communications", "sentiment": "none"}, {"name": "grainger plc  newcastle", "sentiment": "none"}, {"name": "robert gibson-nec newcastle", "sentiment": "none"}, {"name": "north east chamber of commerce", "sentiment": "none"}, {"name": "narrative integrated communications 09:11 robert gibson-nec holiday", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "rag-stiftung investment company", "sentiment": "none"}, {"name": "group", "sentiment": "none"}, {"name": "york college", "sentiment": "none"}, {"name": "mattel", "sentiment": "none"}, {"name": "fsb", "sentiment": "none"}, {"name": "narrative integrated communications", "sentiment": "none"}, {"name": "youth focus and foundation futures", "sentiment": "none"}, {"name": "narrative", "sentiment": "none"}, {"name": "pell frischmann", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "09:24 Robert Gibson-NEC RSM and Ward Hadaway advise on Desco’s next stage of growth \nRSM’s corporate finance team has advised on the disposal of MEP consulting engineering practice Desco, to civil engineering firm Pell Frischmann, owned by the RAG-Stiftung investment foundation. \nHeadquartered in Doxford Park in Sunderland, Desco is an engineering consultancy business that offers innovative mechanical and electrical design solutions for building services. The business will become a wholly-owned subsidiary of Pell Frischmann, keeping its existing management board and structures in place. \nThe RSM team in Newcastle, led by corporate finance director Michael Cantwell with support from Lyndsey Everett (corporate finance) and Joanne Murnane (tax), acted for the shareholders of Desco on the buyout. Rob Thompson and Tom Pollard at Ward Hadaway acted alongside RSM as Desco’s legal advisors on the transaction. The acquisition offers enhanced UK and global reach for Desco allowing the business to take advantage of larger UK and international projects, particularly in the Middle East. \nRAG-Stiftung Investment Company was set up to raise funds to finance the management of redundant coal mines in Germany and it continues to invest in market leading firms with international reach. The deal follows last year’s acquisition of Pell Frischmann, which saw the German investment company investing a majority stake in the engineering consultants. \nThe deal brings together two complementary businesses that will further enhance the offering of the Group through additional services and sector expertise, and increase market share across the UK and internationally – starting with expansion plans in Leeds and Manchester. \nPaul Marshall, managing director at Desco, said: ‘This marks a new and exciting phase for Desco as we accelerate our growth strategy with the backing of a major international investor and Pell Frischmann’s expertise in the rail, roads and water sectors. RSM and Ward Hadaway have provided us with excellent support and advice throughout the process.’ Managing director of Desco, Paul Marshall 09:19 Robert Gibson-NEC Communications company grows rapidly post-rebrand \nA North East marketing communications agency has enjoyed a year of rapid expansion following a major rebrand. \nA string of new contract wins has enabled Narrative Integrated Communications to ramp up turnover by 30% to £1.7m after it evolved from its former brand, Press Ahead, in 2015. \nIn the last twelve months the Sunderland-based company has won almost £400,000 of work across its core service areas, which include digital media, PR, creative, advertising and marketing strategy. Staff numbers have risen from 13 to 19 in line with the increase in workload. \nThe contract wins include a media buying deal with York College and the implementation of social media strategy for hospitality and events specialist Sodexo Prestige Venues. Narrative is also working with North East legal expert BHP Law and Mattel, a global toy and game retailer which employs around 31,000 people and sells its products in more than 150 countries around the globe. \nThe growth has been triggered by the introduction of several new digital services at Narrative, which has seen a steep rise in the number of companies seeking to devise and implement social media and online marketing strategies. \nKieron Goldsborough, who took over the ownership of the business in 2014, said: “We’ve had a strong year of expansion since rebranding to Narrative; the rebrand has been a huge success in explaining how we’ve evolved. Companies want to use a wider range of marketing communications tools to support their business goals and are looking for agencies that offer a full mix of services under one roof. \n“Our recent contract wins and growth are a reflection of this trend. In particular, companies are asking us to help them exploit the power of online channels to reach out to a wider audience and the digital revolution is making this an exciting journey for us all.” Kieron Goldsborough, managing director of Narrative Integrated Communications 09:11 Robert Gibson-NEC Holiday letting agency sees record growth \nA leading North East holiday letting agency has recorded record growth, expanding its portfolio of properties and extending its customer base. \nCottages in Northumberland - which lets out coastal, countryside and city properties in the county and across Tyneside – has seen a 13 per cent increase in business in the first six months of this year. \nThe Newcastle-based company now has 182 cottages, houses and apartments within its portfolio, which it rents out on behalf of owners keen to generate income from their assets. \n“We have had a very strong start to the year with us already seeing accommodation receipts 44% ahead of last year and bookings increased by 42%,” said Cottages in Northumberland’s director of operations, Angela Mazingham, \n“We have had a great June with bookings 9% ahead of target. All figures so far bode very well in terms of our overall figures for 2016.” \nCottages in Northumberland is now planning to embark on a recruitment programme to keep pace with demand. \nUKTI International Trade Advisor Jayne Pickersgill said, “This is a great achievement for all at Cottages in Northumberland, as evidenced by the financial returns and with the strategic changes you have made to be successful. I wish you a continued success as you expand the business internationally.” Angela Mazingham, director of operations at Cottages in Northumberland 09:01 Robert Gibson-NEC FSB says England's small businesses could double apprentice numbers \nA new report out today suggests the small business sector in England has the potential to double the number of apprentices it takes on to well over two million, if the Government can get the incentives and package of support right.The Federation of Small Businesses (FSB) report found apprenticeship reform at a make-or-break moment, with small firms critical to achieving the Government’s target of reaching three million new apprentices by 2020. \nThe report demonstrates the potential of small firms to help meet the target, but also presents some major challenges which need to be addressed to achieve it.The report, ‘Make or Break: Getting apprenticeship reform right for small businesses,’ found that one in four FSB members (24%) already employ an apprentice, but a further quarter (24%) would consider taking one on in the future. \nIf this reflects the situation of the rest of England’s 4.7 million small firms, there is potential to deliver well over a million new apprenticeships with smaller employers.Among the barriers to achieving this is a change which requires small businesses to contribute towards the cost of training their apprentices. \nThis is expected to result in a fall in the number of businesses offering apprenticeships. \nTo limit this, FSB is calling on the Government to provide a more generous small employer incentive than is currently proposed. Mike Cherry of the Federation of Small Businesses 08:52 Robert Gibson-NEC 'No material impact' from Brexit vote, says chief executive \nHelen Gordon, chief executive of Grainger, said of the 10 months to July 31, 2016: “Operational activity over the period has been in line with management expectations. \n“In our private rented sector (PRS) portfolio, we are seeing good rental growth and demand for our high quality, well managed rental homes. \n“We continue to see strong levels of trading from our regulated tenancy portfolio, with high interest among home buyers, steady transactional activity and robust pricing. \n“We have not seen any material impact on our business following the EU Referendum, although we are monitoring the situation closely. \n“ With a strong balance sheet and low financial gearing, we are well positioned to take advantage of new potential PRS investment opportunities following the EU Referendum. \n“We remain confident in and committed to delivering our strategy to grow net rental income while simplifying the business to improve returns.” www.simonway.co.uk Helen Gordon, CEO of Grainger plc 08:45 Robert Gibson-NEC Strong trading at Grainger plc \nNewcastle’s Grainger plc, the UK’s largest listed residential landlord has reported strong trading for the 10 months to July 31, 2016. \nDuring the period, the company saw continued high level of demand for its UK private rented sector homes, with year-to-date rental on new lets of 4.9% and 2.8% on renewals. \nGrainger also hit revenues of £91m from sales of vacant properties, compared to £81m in the comparable period in 2015. \nIt’s sales pipeline at the period end, meanwhile, was £188m, up from £172m the year before. \nIn a trading update, the company said: “On January 28, 2016, we set out our updated strategy to capitalise on the PRS market opportunity and be the UK’s leading private landlord, by building on our heritage and leveraging our regulated tenancy portfolio, simplifying and focusing the business on the PRS, and growing net rental income. \n“Our PRS investment is progressing well.” 08:40 Robert Gibson-NEC Newcastle's Generator launches six figure programme for young creatives \nThe UK’s leading music and creative development agency Generator has teamed up with three of the North East’s youth support and creative organisations to launch a six figure development programme for the region’s budding entrepreneurs. \nThe £420,000 Ladders initiative will support 18-24 year olds wishing to pursue a career in the creative and digital industries. \nA recent report by the North East Chamber of Commerce showed that 49% of young people were either not very informed or not informed at all about the opportunities open to them and Generator say it is increasingly difficult for young people in the region to break into the creative industries. \nThe Ladders programme is being run in conjunction with This is Creative Enterprise (TICE), Youth Focus and Foundation Futures. \nLouise Henry, Generator’s enterprise development coordinator, said: “The creative and digital industries typically recruit from a narrow section of society and Ladders will provide an opportunity to meet with industry professionals, learn practical and creative skills, visit potential workplaces, get interview experience and learn about enterprise. \n“The focus is very much on the practical.” ", "external_links": [], "published": "2016-08-11T17:25:00.000+03:00", "crawled": "2016-08-11T11:28:42.650+03:00", "highlightTitle": ""}