{"organizations": [], "uuid": "9acfbbb20870e0da1186f238bce94477b956f45b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article11668409.ece/ALTERNATES/s1200/JS95735611.jpg", "site_section": "", "section_title": "", "url": "http://www.chroniclelive.co.uk/business/business-news/hundreds-construction-jobs-set-created-11689351", "country": "IE", "domain_rank": 21960, "title": "Hundreds of construction jobs set to be created as part of £92m GSK investment - Chronicle Live", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 0, "title_full": "Hundreds of construction jobs set to be created as part of £92m GSK investment - Chronicle Live", "spam_score": 0.937, "site_type": "news", "published": "2016-08-01T15:28:00.000+03:00", "replies_count": 0, "uuid": "9acfbbb20870e0da1186f238bce94477b956f45b"}, "author": "Robert Gibson", "url": "http://www.chroniclelive.co.uk/business/business-news/hundreds-construction-jobs-set-created-11689351", "ord_in_thread": 0, "title": "Hundreds of construction jobs set to be created as part of £92m GSK investment - Chronicle Live", "locations": [], "entities": {"persons": [{"name": "andrew witty", "sentiment": "none"}, {"name": "alastair leighton", "sentiment": "none"}, {"name": "robert gibson", "sentiment": "none"}, {"name": "danny", "sentiment": "none"}], "locations": [{"name": "barnard castle", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "angus", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}, {"name": "montrose", "sentiment": "none"}], "organizations": [{"name": "gsk", "sentiment": "none"}, {"name": "glaxosmithkline", "sentiment": "none"}, {"name": "ware", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Hundreds of construction jobs set to be created as part of £92m GSK investment 12:28, 1 Aug 2016 By Robert Gibson The pharma firm has said several hundred construction and engineering jobs will be created to build a facility at Barnard Castle Shares Get business news by email Danny Lawson/PA Wire GSK \nHundreds of construction and engineering jobs are to be created in the North East as GlaxoSmithKline commits to a £92m investment at a major site in County Durham . \nLast week the pharmaceutical giant announced it would be building a new aseptic sterile facility to make liquid biopharmaceuticals at its manufacturing base at Barnard Castle. \nThe company has since confirmed that construction is expected to start in the middle of 2017 in a scheme which will create hundreds of jobs. \nA spokeswoman said: “A project of this size will create several hundred construction and engineering jobs over the next four years as we build and commission the facility. \n“It is too early to say how many jobs will be created once the building is fully operational as this varies with the number of new medicines that the facility will make. \n“However, it does mean that the skilled jobs that are created will remain at Barnard Castle in the long-term.” \nThe site currently employs more than 1,100 people and provides both new and established medicines to more than 140 markets, making it one of GSK’s largest global supply sites. \nThe base is also considered strategically important for the company in the development and launch of new and innovative medicines, the aseptic facility being set to focus on sterile liquids which are filled into syringes and vials. Read More GSK invests £92m in County Durham site as UK remains 'attractive' despite Brexit vote \nAlastair Leighton, site director at Barnard Castle, said: “The construction of a new, state-of-the-art aseptic facility at Barnard Castle is very important for the site as it gives us the ability to support the development and launch of a strong pipeline of innovative medicines for a wide range of therapeutic areas. \n“This investment secures a home here at Barnard Castle for advanced manufacture of aseptic liquid biopharmaceuticals for many years to come.” \nCurrently, GSK employs 16,000 people in the UK, 6,000 of whom work in manufacturing across a total of nine bases. \nThe £92m project in the North East forms part of a wider £275m investment in UK operations, the remainder of the money going towards sites at Montrose in Angus, where a facility will be built for making respiratory active ingredients, as well as that at Ware, where additional manufacturing capacity will be created. \nGSK said it still saw the UK as an “attractive location” in which to invest, despite the result of the EU referendum, particularly due to the country’s skilled workforce and competitive tax system. \nMost of the products made at the expanded facilities will be exported. Andrew Milligan/PA Wire GlaxoSmithKline CEO Sir Andrew Witty \nGSK CEO Sir Andrew Witty said: “It is testament to our skilled UK workforce and the country’s leading position in life sciences that we are making these investments in advanced manufacturing here. \n“From their manufacture in the UK, many of these medicines will be sent to patients around the world.” \nInterested in North East jobs? Find job vacancy listings across a range of sectors here . ", "external_links": [], "published": "2016-08-01T15:28:00.000+03:00", "crawled": "2016-08-01T15:16:36.911+03:00", "highlightTitle": ""}