{"organizations": [], "uuid": "b8656d249c0191aaf13fccf3b8088ff4e3cb0f18", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/29670891/15333215.jpg", "site_section": "http://www.thisisleicestershire.co.uk/weathernews/rss.html?chid=182806", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/new-research-declares-leicester-the-worst-place-in-england-to-raise-a-family/story-29670891-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "danjmartin commented New research declares Leicester the worst place in England to...", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "danjmartin commented New research declares Leicester the worst place in England to...", "spam_score": 0.0, "site_type": "news", "published": "2016-08-31T17:08:00.000+03:00", "replies_count": 0, "uuid": "b8656d249c0191aaf13fccf3b8088ff4e3cb0f18"}, "author": "danjmartin", "url": "http://www.leicestermercury.co.uk/new-research-declares-leicester-the-worst-place-in-england-to-raise-a-family/story-29670891-detail/story.html", "ord_in_thread": 0, "title": "danjmartin commented New research declares Leicester the worst place in England to...", "locations": [], "entities": {"persons": [{"name": "tashema jackson", "sentiment": "none"}], "locations": [{"name": "england", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "east ayrshire", "sentiment": "none"}, {"name": "cambridgeshire", "sentiment": "none"}, {"name": "shetland islands", "sentiment": "none"}, {"name": "hertfordshire", "sentiment": "none"}, {"name": "rutland", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north ayrshire", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "central bedfordshire", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}, {"name": "gcse", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "New research declares Leicester the worst place in England to raise a family By danjmartin | Posted: August 31, 2016 9 COMMENTS SHARES Leicester - apparently the worst place to raise a family in England New research declares Leicester the worst place in England to raise a family X \nCopy link to paste in your message / Comments (9) \nA new report has named Leicester the worst place in England to raise a family. \nResearchers from uSwitch Better Family Life Index looked at 33 elements of family life from GCSE grades, pay levels, weather, fast broadband and access to doctors before compiling a table of 138 council areas. \nLeicester props up the list at 137 ahead of just East Ayrshire and North Ayrshire in Scotland. \nuSwitch, an online and telephone comparison and switching service that helps people to compare prices of products and services, said Leicester had the fourth worst employment in UK, fewer primary schools, high council tax, higher crime levels and poor exam results. \nIt said almost half of parents in the city (49 per cent) said they would consider moving to improve their circumstances and 43 per cent said they worried they were not giving their family the best start in life. \nThe report says Leicester has the fourth worst employment rate in the UK and higher council tax at £1,599. \nRead more: Leicestershire village named one of best places to bring up a family in UK \nIt says residents in Leicester may also struggle to find childcare as the area has a low number of nurseries per 1,000 residents compared to other areas, and they also spend the least amount of time with their family and friends at just 4 hours 14 minutes each day. \nJust half of pupils achieve five or more A*-C grade GCSE-equivalents and there is one primary school per 4,178 people – compared to one primary school per 773 people in the Shetland Islands. However, the area does enjoy good average download speeds of 37Mbs and low CO2 levels. \nHertfordshire was declared the best place to raise a family with Cambridgeshire and Central Bedfordshire in second and third places respectively, \nLeicestershire and Rutland finished mid-table at 76. \nuSwitch.com money spokeswoman Tashema Jackson said: \"The Better Family Life Index shows that life is far from equal for families across the UK. \nAlthough there is much to celebrate in many areas, it's not surprising that so many families are thinking about moving to a new region to improve their circumstances. \n\"For many consumers, the prospect of increased uncertainty in the run-up to Brexit may be a turning point, leading us to re-evaluate both how we manage our household budgets and how we provide stability for our families in the future. Policymakers would do well to follow suit. \n\"With the new government yet to announce its budgetary priorities it is vital that positive changes are made to help give all families fair opportunities no matter where they live - whether it is access to a good education, childcare, housing, GPs or jobs. Quality of life should not be a postcode lottery.\" The top 10 areas", "external_links": [], "published": "2016-08-31T17:08:00.000+03:00", "crawled": "2016-08-31T17:29:40.756+03:00", "highlightTitle": ""}