{"organizations": [], "uuid": "504cd33af4446e981f8fa71767d7f8053851fef1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article11751308.ece/ALTERNATES/s1200/JS55675459.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/downturn-oil-gas-sector-hits-11751199", "country": "GB", "domain_rank": 21960, "title": "Downturn in oil and gas sector hits Sunderland's Haskel Europe Ltd", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Downturn in oil and gas sector hits Sunderland's Haskel Europe Ltd", "spam_score": 0.0, "site_type": "news", "published": "2016-08-15T21:09:00.000+03:00", "replies_count": 0, "uuid": "504cd33af4446e981f8fa71767d7f8053851fef1"}, "author": "Robert Gibson", "url": "http://www.chroniclelive.co.uk/business/business-news/downturn-oil-gas-sector-hits-11751199", "ord_in_thread": 0, "title": "Downturn in oil and gas sector hits Sunderland's Haskel Europe Ltd", "locations": [], "entities": {"persons": [{"name": "haskel", "sentiment": "none"}], "locations": [{"name": "european union", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "sunderland", "sentiment": "none"}, {"name": "haskel europe ltd", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Downturn in oil and gas sector hits Sunderland's Haskel Europe Ltd 14:09, 15 Aug 2016 Company says Brexit vote could also cause uncertainty in the economies in which it operates Shares Get business news by email Inside the Sunderland site of Haskel, which makes high pressure pumps and valves \nSunderland-based manufacturer Haskel Europe Ltd has increased its focus on a number of diverse markets to minimise risks posed by the downturn in the oil and gas sector. \nIn the year ended November 30, 2015, the company, which makes and distributes pneumatic, hydraulic and associated equipment, turned over £15.5m, down from £16.4m the year before. \nIt attributed the drop directly to ongoing troubles within the oil and gas market, which have had a knock-on effect on many supply chain companies in the region. \nOperating profit plunged from £3.1m to £636,768 - partly influenced by a one-off loss provision of £989,779 relating to a project expected to ship this year - while gross margin decreased from 30.6% to 20.3%. \nAlthough the figure would have been 26.6% if not for the loss provision, Haskel also highlighted the impact of product mix and increased pricing pressure. \nIn a strategic report for the year, the company said: “Haskel Europe Ltd continues to strengthen its market position and reorganised its sales structure during 2015 to support future growth by focusing on key growth areas. \n“New roles of global product line manager, aftermarket manager and distribution manager have been established. \n“The directors are confident that the company is structured and position in a manner that will enable it to meet the demands of its markets and business environment. \n“They recognise that the diverse nature of its customers’ markets help offset any risk to one specific sector, although they are aware that the share in the oil and gas market could create risk and have increased the focus on other markets to compensate this.” \nAt the year end, the company, which employs around 60 people in Sunderland, had net assets of £2.2m, up from £1.8m the year before. According to the most recent valuation, its land and buildings are also worth £600,000. \nAmong the key business risks identified by Haskel was competition from both national and independent manufacturers and suppliers. \nHowever, management has introduced a programme through which the company is actively pursuing new territories and markets. \nHaskel is also focusing on new product development and has reorganised its sales structure to support the initiative. \nIn order to boost employee retention, the business likewise operates a skills matrix programme, identifying the training and development needs for each employee. \nA careful approach to stocking policies, meanwhile, ensures customer demand can be satisfied immediately. \nOn Brexit , the company added: “The recent vote for the UK to leave the European Union potentially could cause uncertainty in the economies in which we operate. In the short-term, foreign exchange volatility and credit risk may be affected by the decision for the UK to leave the EU.” \nThe directors are not recommending the payment of a final dividend.", "external_links": [], "published": "2016-08-15T21:09:00.000+03:00", "crawled": "2016-08-15T16:32:04.584+03:00", "highlightTitle": ""}