{"organizations": [], "uuid": "0b79ab0c6761a37aa4adba20a435dda0ed6c8ce3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/29579618/15016471.jpg", "site_section": "http://www.thisisleicestershire.co.uk/elections2009/rss.html?chid=181299", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/next-plc-warns-overseas-supplies-could-cost-more-due-sterling/story-29579618-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "TomPegden published Next Plc warns overseas supplies could cost more due to sterling", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "TomPegden published Next Plc warns overseas supplies could cost more due to sterling", "spam_score": 0.0, "site_type": "news", "published": "2016-08-03T11:47:00.000+03:00", "replies_count": 0, "uuid": "0b79ab0c6761a37aa4adba20a435dda0ed6c8ce3"}, "author": "TomPegden", "url": "http://www.leicestermercury.co.uk/next-plc-warns-overseas-supplies-could-cost-more-due-sterling/story-29579618-detail/story.html", "ord_in_thread": 0, "title": "TomPegden published Next Plc warns overseas supplies could cost more due to sterling", "locations": [], "entities": {"persons": [{"name": "tompegden", "sentiment": "none"}, {"name": "russ mould", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "burma", "sentiment": "none"}, {"name": "cambodia", "sentiment": "none"}, {"name": "far east", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "bangladesh", "sentiment": "none"}], "organizations": [{"name": "next plc", "sentiment": "none"}, {"name": "aj bell", "sentiment": "none"}, {"name": "comments shares next plc", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Next Plc warns overseas supplies could cost more due to sterling By TomPegden | Posted: August 03, 2016 0 COMMENTS SHARES Next Plc warns overseas supplies could cost more due to sterling X \nCopy link to paste in your message / Comments (0) \nShares in high street clothing giant Next jumped 5 per cent this morning despite warnings that overseas supplies could end up costing more because of the drop in sterling. \nThe company expects its overseas costs next year and the year after to rise by up to 5 per cent after the post-Brexit fall in Britain's currency. \nIn a trading statement the business said it was too soon to determine how the EU referendum would affect consumer confidence, particularly as sales in the week after the June 23 vote were \"unusually strong\". \nBy 9.40am today the share price had eased off a bit, and was up 3.7 per cent at £53.20. \nThe share price has dropped substantially since reaching a high of £80 in late 2015 following fears of a slowdown in consumer spending. \nNext Plc sheds almost a tenth of share value \nThe business said: \"So far, we can see no clear evidence of any appreciable effect on consumer behaviour, apart from the first few days after the vote. \n\"In the medium term the devaluation of the pound is likely to affect the cost price of our goods. \n\"There will be no effect on the year to January 2017 as we have fully hedged all our currency exposure. \n\"The impact of devaluation for next year has been partially mitigated by pre-referendum hedging and currency offsets from our euro and dollar overseas revenues. \n\"Based on current exchange rates, we expect our costing rates – the average value of sterling in the overseas currencies that we buy – to be around 9 per cent worse than 2016/17.\" \nHowever it believed a number of factors could mitigate devaluation, including: \nThe weakening of some Far East currencies – including the Chinese Yuan – against the dollar \nIncreased efficiency among suppliers in places such as Bangladesh, Cambodia, and Burma \nMore competition between suppliers, particularly in China \nThe business said: \"Although it is very early in the buying cycle, we currently estimate that cost prices in 2017/18 will rise by less than 5 per cent on like-for-like products.\" \nIt also added: \"Tariffs and other barriers to trade in continental Europe are unlikely to be any different from today, as most of our stock is manufactured outside the EU and already subject to EU customs and tariffs.\" \nNext said it saw a slight improvement in trade in the last three months – excluding items that went into the summer sale – driven by the success of the online Directory. \nLike-for-like in-store sales were down 3.3. per cent. \nBut the Enderby-headquartered chain said the end of season sale went well, putting total sales for the first half of the year almost 2 per cent up on the same time last year. \nProfits for the year are forecast at between £775 million and £845 million – and the business plans to keep returning money to shareholders though a share buyback policy. \nRuss Mould, investment director at financial advisors AJ Bell said: \"Fashion group Next has warned that the cost of buying materials will increase due to the fall in sterling following the Brexit vote. \n\"The consumer environment is likely to remain tough for the rest of the year and the third quarter will be particularly challenging as it was Next's best quarter last year and the group is budgeting for full price sales growth to be worse than in the second quarter.\"", "external_links": [], "published": "2016-08-03T11:47:00.000+03:00", "crawled": "2016-08-03T13:24:57.328+03:00", "highlightTitle": ""}