{"organizations": [], "uuid": "19ab7793371baf15d14bcb788b9657bdb2174e23", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article11754352.ece/ALTERNATES/s1200/JS97242529.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/surprise-rise-inflation-following-post-11754304", "country": "GB", "domain_rank": 21960, "title": "Surprise rise in inflation following post-Brexit slump in sterling", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Surprise rise in inflation following post-Brexit slump in sterling", "spam_score": 0.0, "site_type": "news", "published": "2016-08-16T17:25:00.000+03:00", "replies_count": 0, "uuid": "19ab7793371baf15d14bcb788b9657bdb2174e23"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/surprise-rise-inflation-following-post-11754304", "ord_in_thread": 0, "title": "Surprise rise in inflation following post-Brexit slump in sterling", "locations": [], "entities": {"persons": [{"name": "graeme whitfield", "sentiment": "none"}, {"name": "chris radburn/pa wire fifty", "sentiment": "none"}, {"name": "mike prestwood", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}], "organizations": [{"name": "european union", "sentiment": "none"}, {"name": "office for national statistics", "sentiment": "none"}, {"name": "mpc", "sentiment": "none"}, {"name": "bank", "sentiment": "none"}, {"name": "ons", "sentiment": "none"}, {"name": "niesr", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "bank of england", "sentiment": "none"}, {"name": "national institute of economic and social research", "sentiment": "none"}, {"name": "monetary policy committee", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Surprise rise in inflation following post-Brexit slump in sterling 10:25, 16 Aug 2016 10:25, 16 Aug 2016 By Graeme Whitfield New figures show a surprise rise in inflation, driven partly by a fall in the pound after the EU referendum Shares Get business news by email Chris Radburn/PA Wire Fifty, twenty, ten, and five pound notes \nInflation rose to a higher-than-expected 0.6% last month as the increasing cost of motor fuels and second-hand cars drove up transport prices. \nConsumer Price Index (CPI) inflation in July was up from 0.5% in June, the Office for National Statistics (ONS) said. Economists were expecting the figure to be unchanged. \nBut while there was no sign of the plunge in the value of the pound having an impact on CPI, the ONS said the Producer Prices Index (PPI) showed the slump in sterling following the Brexit vote had pushed up the cost of imports for British manufacturers. \nInput prices rose 4.3% in the year to July, compared with a drop of 0.5% in the year to June, as it was partly impacted by the fall in the value of the pound, which drove up the cost of imported metals and chemicals. \nMike Prestwood, head of prices at ONS, said: “The Consumer Prices Index has continued in July its recent slow upward trend since late 2015, with transport costs the biggest single factor this month. \n“There is no obvious impact on today’s consumer prices figures following the EU referendum result, though the Producer Prices Index (PPI) suggests the fall in the exchange rate is beginning to push up import price faced by manufacturers. \n“These are the first sets of consumer and producer prices data collected since the referendum polling day.” \nThe ONS said CPI was impacted by transport costs rising by 1.6% between June and July this year, compared with a 1.2% increase over the same period a year ago, while the prices of second-hand cars fell less than they did a year ago. \nIt added that alcoholic drinks also stepped up 0.5% month on month in July, compared with a fall a year ago, as wine prices dropped by less than they did in 2015. \nMeanwhile, food and non-alcoholic drinks fell 0.2% between June and July, which is lower than a 0.7% drop over the period last year. \nHowever, downward pressure on CPI came from the price of housing, water, electricity, gas and other fuels, which was unchanged over the period after rising by 0.3% last year, while recreation and culture costs slipped 0.1% this year compared with a 0.2% increase a year ago. \nThe price of petrol rose from 111p in June to 111.8p a litre in July, while the cost of diesel, climbed from 112.1p to 113p a litre over the period. \nThe ONS said the Retail Prices Index (RPI) - a separate measure of inflation, which includes housing costs - rose to 1.9% in July, up from 1.6% in June. \nThe CPI update comes amid a bleak outlook for the UK economy, with many experts slashing their growth forecasts after a string of dire reports. \nThe Bank of England cut interest rates for the first time since 2009 at the beginning of the month and delivered an emergency package of measures worth up to £170 billion to ward off recession following the Brexit vote. \nPolicymakers on the Monetary Policy Committee (MPC) voted unanimously to cut rates to a historic low of 0.25% from 0.5% - the first cut since March 2009 when the Bank reduced rates at the height of the financial crisis. \nOfficial figures show the UK economy had picked up pace in the run-up to Britain’s vote to leave the European Union , with gross domestic product (GDP) growing 0.6% in the second quarter, up from 0.4% in the first quarter. \nHowever, influential think-tank the National Institute of Economic and Social Research (NIESR) estimates that gross domestic product (GDP) fell by 0.2% month on month in July. \nFor the three months to July, NIESR said the economy eked out growth of 0.3% in a “marked economic slowdown” on the second quarter, when GDP increased by 0.6%.", "external_links": [], "published": "2016-08-16T17:25:00.000+03:00", "crawled": "2016-08-16T12:59:13.231+03:00", "highlightTitle": ""}