{"organizations": [], "uuid": "dbe04ec367bfeb226bed063ece02f1c8866a3744", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article11595517.ece/ALTERNATES/s1200/JS94026548-1.jpg", "site_section": "", "section_title": "", "url": "http://www.chroniclelive.co.uk/business/business-news/business-breakfast-live-trinity-mirror-11687829", "country": "IE", "domain_rank": 21960, "title": "Business breakfast LIVE: Trinity Mirror profits soar 42% - Chronicle Live", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 0, "title_full": "Business breakfast LIVE: Trinity Mirror profits soar 42% - Chronicle Live", "spam_score": 0.043, "site_type": "news", "published": "2016-08-01T11:45:00.000+03:00", "replies_count": 0, "uuid": "dbe04ec367bfeb226bed063ece02f1c8866a3744"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/business-breakfast-live-trinity-mirror-11687829", "ord_in_thread": 0, "title": "Business breakfast LIVE: Trinity Mirror profits soar 42% - Chronicle Live", "locations": [], "entities": {"persons": [{"name": "john waterworth", "sentiment": "none"}, {"name": "biss", "sentiment": "none"}, {"name": "akbar al baker", "sentiment": "none"}, {"name": "simon fox  simon fox", "sentiment": "none"}, {"name": "simon fox", "sentiment": "none"}], "locations": [{"name": "great yarmouth", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "local world", "sentiment": "none"}, {"name": "east anglia", "sentiment": "none"}, {"name": "gosforth", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "norfolk", "sentiment": "none"}, {"name": "tropical water world", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "newcastle airport", "sentiment": "none"}, {"name": "parkdean resorts", "sentiment": "none"}, {"name": "vauxhall holiday park", "sentiment": "none"}], "organizations": [{"name": "coreena ford newcastle", "sentiment": "none"}, {"name": "trinity mirror", "sentiment": "none"}, {"name": "local world", "sentiment": "none"}, {"name": "trinity mirror plc", "sentiment": "none"}, {"name": "trinity", "sentiment": "none"}, {"name": "trinity mirror plc", "sentiment": "none"}, {"name": "holiday parks", "sentiment": "none"}, {"name": "vauxhall", "sentiment": "none"}, {"name": "iag", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "coreena ford qatar airways", "sentiment": "none"}, {"name": "qatar airways", "sentiment": "none"}, {"name": "british airways", "sentiment": "none"}, {"name": "vauxhall holiday park", "sentiment": "none"}, {"name": "parkdean resorts", "sentiment": "none"}, {"name": "coreena ford trinity mirror", "sentiment": "none"}, {"name": "coreena ford", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "8.43 Coreena Ford Newcastle's Parkdean Resorts acquires Great Yarmouth holiday park \nParkdean Resorts,the Newcastle-based owner of 72 Holiday Parks nationwide has acquired Vauxhall Holiday Park in Great Yarmouth for an undisclosed sum - its first acquisition since Parkdean and Park Resorts merged in November 2015. \nVauxhall Holiday Park is a single park operation, based within walking distance of Great Yarmouth and has been owned and developed by the Biss family since 1964, providing holidays and short breaks for in excess of 80,000 holidaymakers each year. \nThe park is a pure holiday hire business with no holiday home owners, with substantial associated on park retail and leisure facilities and is the only five star park in Great Yarmouth. \nTogether with providing great family holidays, it is uniquely renowned for its weekender music festivals and special events including the “Caister Soul Weekender” and “Skamouth” amongst others. \nThe freehold park comprises 390 caravans and lodges, 48 apartments and 180 touring and camping pitches across 41 acres. It is well invested, with a substantial range of high quality retail facilities including the 2,100 capacity V-Arena, 350 seat V-lounge, a carvery restaurant, a sports bar, coffee shop, five other separate food outlets and an amusement arcade. Leisure facilities include the Tropical Water World with indoor main pool, water slides and fun pool, splash zone and paddling pool, a fitness suite and multi-sport area. \nJohn Waterworth, chief executive of Parkdean Resorts, whose head office is in Gosforth, Newcastle said: \nThis continues our long term buy and build strategy which has been successful in developing Parkdean Resorts into the sector leading business it is today. Vauxhall is a thriving and well-managed park that will fit perfectly into the Parkdean Resorts portfolio offering customers even broader choice in Norfolk alongside our other parks East Anglia. We intend to build on the success of the special events and expand the business via capital investment in new accommodation and by extension of the holiday season. \nParkdean Resorts is confident of another successful year of growth, with holiday sales for the year 9% ahead of 2015. The group has been acquisitive since its formation and we see further opportunities in this highly fragmented sector via both single parks and multi-site portfolios. Splashzone at Vauxhall Holiday Park in Great Yarmouth 8.37 Coreena Ford Qatar Airways boost stake in British Airways owner \nQatar Airways has swooped to up its stake in British Airways owner IAG to 20% following a post-referendum fall in the company’s share price. \nThe Middle Eastern firm had previously held 15.7%, and chief executive Akbar Al Baker said that IAG’s shares, which have fallen 24% since June 23, were “an attractive opportunity”. \nHe said: \nThe recent market valuation of one of the world’s leading airline groups has provided what we believe is an attractive opportunity to increase our shareholding in IAG. \nWe continue to be highly supportive of IAG’s strategy and management team and we do not intend to increase our percentage shareholding further unless there are material changes to the current situation. \nLast week, IAG said that a weak pound triggered by the Brexit vote, terror attacks and air traffic control strikes took their toll on British Airways in the first six months of the year, with the group poised to cut capacity and review investments as a result. \nIn June, the airline was forced to issue a profit warning following the referendum result, and has since said it is experiencing lower demand for flights. IAG added that plans to increase capacity would be scaled back and its investment pipeline for next year is “under review”. A British Airways plane at Newcastle Airport 8.33 Coreena Ford Trinity Mirror results - chief executive Simon Fox \nSimon Fox, chief executive of Trinity Mirror plc, said: \nI am pleased we delivered another strong performance despite the challenging print environment. \nWe are already seeing the benefits from our acquisition of Local World last year and continue to tightly manage the cost base across the Group. Our strategic focus remains to grow digital audience and revenue whilst protecting print revenue and profit. \nWe are confident that our strategy and our strong balance sheet position will enable continued progress despite increased uncertainty around the economic environment. Simon Fox 8.30 Coreena Ford Top story - Trinity Mirror profits up 42% but warns of Brexit impact \nHello and welcome to another week of business breakfast blogs. It’s a mixed bag of stories this morning, topped out by half year results for the owners of The Journal, The Chronicle and The Sunday Sun. \nThe publisher has warned that revenues could be hit as a result of the fallout from Britain’s decision to leave the European Union. \nDirectors said the referendum outcome had created “increased macroeconomic uncertainty”, adding that while the impact is hard to assess, “based on current UK growth forecasts there is a risk that our revenues could be lower than expectations”. \n“In addition, there are other related factors which affect the group; for example, the impact of a tougher UK business environment on interest rates and therefore long-term bond yields and the deficit in the group’s defined benefit pension schemes,” the company said. \nThe firm warned last month that it will take “mitigating actions” to support profits in the wake of the Brexit vote. \nTrinity made the announcement alongside its first-half results, which saw adjusted pre-tax profit rise 42% to £66.9m on revenues of £374.7m. \nLike-for-like sales from the firm’s digital offering grew 14.4% to £39.7m, with average monthly page views rising 19% to 770 million. \nHowever, revenue from print fell 10.3%, with Trinity flagging “increased challenges” in the advertising market. \nTrinity’s pension deficit increased by £120.8m to £426m, driven by a fall in long- term interest rates. \nTrinity’s sales were boosted by the acquisition of rival Local World last year, which it snapped up for £187m and is proving a success for the group. \nThis is in contrast to Trinity’s doomed newspaper launch New Day, which folded after just two months. \nThe venture is thought to have cost the company up to £7m. Trinity Mirror Plc logo ", "external_links": [], "published": "2016-08-01T11:45:00.000+03:00", "crawled": "2016-08-01T10:51:58.607+03:00", "highlightTitle": ""}