{"organizations": [], "uuid": "4ec32c9ae756b4c3fd9deec7ce29d70d7d648ce9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article11826289.ece/ALTERNATES/s1200/JS91507950.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/devolution-ultimatum-issued-north-east-11826268", "country": "GB", "domain_rank": 21960, "title": "Devolution ultimatum issued to the North East by Whitehall - agree by Tuesday or the deal's off", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Devolution ultimatum issued to the North East by Whitehall - agree by Tuesday or the deal's off", "spam_score": 0.0, "site_type": "news", "published": "2016-09-01T01:49:00.000+03:00", "replies_count": 0, "uuid": "4ec32c9ae756b4c3fd9deec7ce29d70d7d648ce9"}, "author": "Dan O'Donoghue", "url": "http://www.chroniclelive.co.uk/news/north-east-news/devolution-ultimatum-issued-north-east-11826268", "ord_in_thread": 0, "title": "Devolution ultimatum issued to the North East by Whitehall - agree by Tuesday or the deal's off", "locations": [], "entities": {"persons": [{"name": "nick forbes", "sentiment": "none"}, {"name": "martin gannon", "sentiment": "none"}, {"name": "jeremy middleton", "sentiment": "none"}, {"name": "sajid javid  whitehall", "sentiment": "none"}, {"name": "george osborne", "sentiment": "none"}, {"name": "anna", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}], "organizations": [{"name": "gateshead council", "sentiment": "negative"}, {"name": "whitehall", "sentiment": "negative"}, {"name": "newcastle city council", "sentiment": "none"}, {"name": "north east  gateshead council", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The warning came as Gateshead Council gave the strongest hint yet they will return to the negotiation table Shares Get daily news by email Anna Gowthorpe/PA Wire Business Secretary Sajid Javid \nWhitehall has issued an ultimatum to the North East - agree devolution by Tuesday, or the deal’s off. \nLeaders of the seven regional authorities have consistently failed to come to an agreement over the multi-billion pound deal - with some accepting it in its current form and others wanting more assurances from the Government. \nNow the Department for Communities and Local Government has warned if agreement on the deal - which was signed with former Chancellor George Osborne last October - is not reached by Tuesday the process will be scrapped. \nThe warning comes as one of the most vocal opponents of devolution - Gateshead Council - gave the strongest hint yet that they would return to the negotiation table. \nThe authority dramatically walked away in May, saying the Government’s financial settlement for the region was “not good enough”. \nA report set to go before Gateshead’s cabinet on Tuesday - the same day as the Government’s deadline for a decision - recommends that the authority rejoins the process. \nThe report advises that the council remain involved to “ensure Gateshead plays a full and equal part in the decision making processes relating to devolution and the mayoral combined authority.” Chancellor George Osborne signs the Devolution agreement for the North East \nGateshead Council leader Martin Gannon accepted that time was running out for a deal. He added: “There will be a report before cabinet on Tuesday which will give us the option to remain part of the process. \n“We made the decision we did back in May as we wanted more assurances. \n“We don’t like the idea of the elected mayor without some kind of referendum and mandate from the people, it is a governance change for the whole region. \n“The financial position is worse if anything post Brexit, but there have been assurances given and we have been told that one fifth of the schemes funded by the EU will be met by the Government, beyond 2020 we don’t know what will happen.” \nNewcastle City Council leader Nick Forbes, who has been one of the biggest advocates for devolution, reiterated his authority’s support for a deal. \nHe said: “Newcastle’s position is clear; we need the Government to act on the promise of real and substantial devolution and give the North East control of its own destiny. \n“The government needs to match our job creation ambitions with real actions. \n“That means both reassuring the region that we will have the funds to do the job and working with us on the next round of devolution to ensure this current deal is just the start of what the North East can achieve.” \nThe agreement would guarantee £30m a year for the region to spend – in addition to being given control of a £3.4bn pool of investment cash. \nThe North East would also get new powers covering employment and skills, transport and planning and business activity – all intended to drive economic growth. \nIndependent North East Mayoral Candidate Jeremy Middleton said: “I’m glad sense has prevailed and devolution is back on the table in Gateshead but am disappointed by the behaviour of the regions leaders, they have had five years to do this deal but have left it to the last minute. \n“It is essential the deal is done by the new deadline. \n“Hopefully this progress brings us closer to getting the region back on its feet. \n“British politics is changing, at home and abroad, and the North East needs to be ready to make the most of this.”", "external_links": [], "published": "2016-09-01T01:49:00.000+03:00", "crawled": "2016-08-31T21:10:12.363+03:00", "highlightTitle": ""}