{"organizations": [], "uuid": "676ea7c45e10a764ca7a434d3b4957ecc783c805", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article10845839.ece/ALTERNATES/s1200/JS67196603-1.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/newcastles-listed-landlord-grainger-sees-11735394", "country": "GB", "domain_rank": 21960, "title": "Newcastle's listed landlord Grainger sees strong trading as EU vote has little impact", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Newcastle's listed landlord Grainger sees strong trading as EU vote has little impact", "spam_score": 0.0, "site_type": "news", "published": "2016-08-11T19:53:00.000+03:00", "replies_count": 0, "uuid": "676ea7c45e10a764ca7a434d3b4957ecc783c805"}, "author": "Robert Gibson", "url": "http://www.chroniclelive.co.uk/business/business-news/newcastles-listed-landlord-grainger-sees-11735394", "ord_in_thread": 0, "title": "Newcastle's listed landlord Grainger sees strong trading as EU vote has little impact", "locations": [], "entities": {"persons": [{"name": "grainger", "sentiment": "none"}, {"name": "designate of grainger", "sentiment": "none"}, {"name": "robert gibson", "sentiment": "none"}, {"name": "helen gordon", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "royal institution of chartered surveyors", "sentiment": "none"}, {"name": "rics", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Newcastle's listed landlord Grainger sees strong trading as EU vote has little impact 12:53, 11 Aug 2016 12:54, 11 Aug 2016 By Robert Gibson The trading update comes as RICS releases a report showing house price growth was at its weakest level in three years in July Shares Get business news by email Helen Gordon, CEO Designate of Grainger plc \nThe UK’s biggest listed residential landlord says it has seen little impact on trading as result of the EU referendum vote. \nIn a trading update for the 10 months to July 31, 2016, the Newcastle-headquartered company said it had seen continued high levels of demand for its UK private rented sector homes, with rental growth on new lets of 4.9% and 2.8% on renewals. \nSales of vacant properties, meanwhile, generated £91m of revenue, compared to £81m in the equivalent period last year and a sales pipeline of £188m was secured, up from £172m. \nGrainger said it was progressing well with its strategy of capitalising on the PRS (private rented sector) market opportunity. \nThe business has also been simplified and restructured to reflect its focus on improving total returns for shareholders; currently, it is on track to hit its target of 24% savings by the 2017 financial year. \nChief executive Helen Gordon said: “Operational activity over the period has been in line with management expectations. \n“In our private rented sector (PRS) portfolio, we are seeing good rental growth and demand for our high quality, well managed rental homes. \n“We continue to see strong levels of trading from our regulated tenancy portfolio, with high interest among home buyers, steady transactional activity and robust pricing. \n“We have not seen any material impact on our business following the EU Referendum, although we are monitoring the situation closely. \n“With a strong balance sheet and low financial gearing, we are well positioned to take advantage of new potential PRS investment opportunities following the EU Referendum. \n“We remain confident in and committed to delivering our strategy to grow net rental income while simplifying the business to improve returns.” \nThe comments come as the Royal Institution of Chartered Surveyors (RICS) releases a report showing house price growth was at its weakest levels in three years in July. \nAccording to the research, a net balance of just 5% of surveyors reported house prices rising rather than falling last month, with sales continuing to decline sharply. \nAround 35%, meanwhile, reported a fall rather than an increase - a figure that was broadly unchanged compared with June, when the decline in sales was the fastest seen since 2008. \nRICS, however, also said comments from some agents suggest activity has “picked up after an initial wobble, while other cite the Brexit vote as having only a modest or even negligible impact thus far”. \nExpectations for both house prices and sales in the year ahead rebounded in July as surveyors upgraded their estimates compared with June.", "external_links": [], "published": "2016-08-11T19:53:00.000+03:00", "crawled": "2016-08-11T15:49:26.621+03:00", "highlightTitle": ""}