{"organizations": [], "uuid": "f4e71dfa7feb5bc7b0b19f097632395b4cca8c7b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article10546031.ece/ALTERNATES/s1200/JS77967291.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/nissans-wearside-investments-depend-brexit-11708351", "country": "GB", "domain_rank": 21960, "title": "Nissan's Wearside investments depend on Brexit talks, director says", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Nissan's Wearside investments depend on Brexit talks, director says", "spam_score": 0.0, "site_type": "news", "published": "2016-08-05T12:22:00.000+03:00", "replies_count": 0, "uuid": "f4e71dfa7feb5bc7b0b19f097632395b4cca8c7b"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/nissans-wearside-investments-depend-brexit-11708351", "ord_in_thread": 0, "title": "Nissan's Wearside investments depend on Brexit talks, director says", "locations": [], "entities": {"persons": [{"name": "ghosn", "sentiment": "none"}, {"name": "carlos ghosn", "sentiment": "none"}], "locations": [{"name": "wearside", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "nissan", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "north east of england chamber of commerce", "sentiment": "none"}, {"name": "getty images nissan motor", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Nissan's Wearside investments depend on Brexit talks, director says 10:22, 5 Aug 2016 No future decisions will be made until EU-UK talks take place, but Carlos Ghosn is \"reasonably optimistic\" Shares Get business news by email Owen Humphreys/PA Wire Workers at Nissan's plant in Sunderland on the production line for the Infiniti Q30 \"active compact\" vehicle \nThe chairman of Nissan has said future decisions about the Japanese juggernaut’s Sunderland plant hinge on the outcome of Brexit negotiations. \nBut Carlos Ghosn, chief executive officer of Nissan , said he was “reasonably optimistic” that the UK will continue to be a key partner of the European Union. \nHe said “most companies” will be waiting to see what happens before making decisions about investments. \nMr Ghosn said: “Well I don’t think today you can talk about any impact before we see what is the new status of the UK. The question of Sunderland - Sunderland is a plant which is a European plant based in the UK. \n“Most of the production out of Sunderland is exported to Europe. So obviously for us the relationship which is going to prevail between the UK and Europe is very important. So the future investment decisions are going to depend a lot into... Okay, the UK is out of Europe. Fine. But what’s going to be the new status? \n“So you’re going to see a period where most companies are going to be waiting to see what’s going to be the new status.” \n“We’re reasonably optimistic that at the end of the day common sense is going to prevail from both sides, that as many people said, UK will still continue to be a big partner of the European community. \n“The question, what’s going to happen in terms of customs, what’s going to happen in terms of trade, what’s going to happen in terms of circulation of particularly of the products. \n“All of these are very sensitive elements that are going to determine how and how much we are going to invest in the UK particularly for the European market.” Getty Images Nissan Motor Chairman Carlos Ghosn \nA stunning win for Leave in Sunderland came despite warnings from Nissan about the consequences of Brexit. \nMore than six out of 10 people who voted in the North East’s largest city opted to turn their back on the EU. \nAt the time, Nissan declined to comment on the British people’s choice and the implications, but previously made it plain Remain was its preferred option for jobs and trade. \nThe Japanese manufacturer employs 6,700 people at its Wearside plant, the most productive in Europe, with another 30,000 in the supply chain employed elsewhere in the region. \nA spokesman for the North East of England Chamber of Commerce said: “It will be a decision for Nissan to take but what we want to see is action from government during the Brexit negotiations to ensure the North East does not lose out as a result of any new arrangements. \n“Nissan is a huge player in the region and makes up a huge part of our exports and we need to see long-term investor confidence in the North East and to be seen as a desirable location for exporters. \n“What government can do is help to support business confidence in the region to ensure we are able to invest in skills.”", "external_links": [], "published": "2016-08-05T12:22:00.000+03:00", "crawled": "2016-08-05T12:53:17.845+03:00", "highlightTitle": ""}