{"organizations": [], "uuid": "b3f1d9cb8225627ab0719bfa316e95329897b3bc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article11709601.ece/ALTERNATES/s1200/JS96343437.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/newcastle-recruiters-mtrec-snapped-up-11709402", "country": "GB", "domain_rank": 21960, "title": "Newcastle recruiters MTrec snapped up by Japanese firm in £17m deal", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Newcastle recruiters MTrec snapped up by Japanese firm in £17m deal", "spam_score": 0.0, "site_type": "news", "published": "2016-08-05T14:48:00.000+03:00", "replies_count": 0, "uuid": "b3f1d9cb8225627ab0719bfa316e95329897b3bc"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/newcastle-recruiters-mtrec-snapped-up-11709402", "ord_in_thread": 0, "title": "Newcastle recruiters MTrec snapped up by Japanese firm in £17m deal", "locations": [], "entities": {"persons": [{"name": "kirsty adamson", "sentiment": "none"}, {"name": "philip ellis", "sentiment": "none"}, {"name": "james doyle", "sentiment": "none"}, {"name": "duncan reid", "sentiment": "none"}, {"name": "simon hopwood", "sentiment": "none"}, {"name": "grant thornton", "sentiment": "none"}, {"name": "peter glenton", "sentiment": "none"}, {"name": "dan rosinke", "sentiment": "none"}, {"name": "charlie burton", "sentiment": "none"}, {"name": "matthew bodfield", "sentiment": "none"}, {"name": "charlotte burton", "sentiment": "none"}, {"name": "chris salkeld", "sentiment": "none"}, {"name": "david musgrave", "sentiment": "none"}, {"name": "yutaka nishida", "sentiment": "none"}, {"name": "alex simpson", "sentiment": "none"}, {"name": "watson burton", "sentiment": "none"}, {"name": "musgrave", "sentiment": "none"}, {"name": "kevin barrow", "sentiment": "none"}, {"name": "osborne clarke", "sentiment": "none"}, {"name": "carl swansbury", "sentiment": "none"}, {"name": "yoshiharu ohi", "sentiment": "none"}, {"name": "rob armstrong", "sentiment": "none"}], "locations": [{"name": "hong kong", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "none"}, {"name": "becoming trust tech inc.", "sentiment": "none"}, {"name": "trust tech", "sentiment": "none"}, {"name": "ryecroft glenton corporate finance", "sentiment": "none"}, {"name": "mtrec ltd", "sentiment": "none"}, {"name": "trust tech inc", "sentiment": "none"}, {"name": "mtrec care limited", "sentiment": "none"}, {"name": "mtrec limited", "sentiment": "none"}, {"name": "ryecroft glenton corporate finance team", "sentiment": "none"}, {"name": "global business consulting corporation", "sentiment": "none"}, {"name": "trust tech inc.", "sentiment": "none"}, {"name": "simon hopwood  newcastle", "sentiment": "none"}, {"name": "optima corporate finance", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Newcastle recruiters MTrec snapped up by Japanese firm in £17m deal 12:48, 5 Aug 2016 Lawyers acting for MTrec say the deal shows foreign firms are still keen to take up opportunities in the region after the Brexit vote Shares Get business news by email www.neildenham.co.uk The Ryecroft Glenton Corporate Finance Team, from left to right, Peter Glenton, Alex Simpson, Carl Swansbury, Charlotte Burton and Simon Hopwood \nNewcastle recruitment specialist MTrec has been snapped up a Japanese listed firm in a deal worth £17m. \nTrust Tech Inc has announced its plan to acquire Newcastle-headquartered MTrec Limited, which is one of the North East’s largest providers of staffing and training solutions. \nThe acquisition marks Trust Tech Inc’s first significant acquisition outside of Japan, following a recent acquisition in Hong Kong, in a move designed to help the company establish a presence in the UK and European markets. \nThe deal, expected to complete on August 30, is understood to be worth £17m – and lawyers acting for the training firm said it shows firms are still keen to take advantage of opportunities in the North East post-Brexit. \nMTrec Ltd, headquartered in Newcastle, was established 10 years ago and has grown to become one of the region’s leading staffing and training providers, serving the manufacturing, engineering and industrial sectors. \nIts wholly owned subsidiary, MTrec Care Limited, provides nurses, carers and support workers to the North East’s care sector. \nEmploying 56 staff and with a cohort of 2,500 temporary workers placed into clients’ businesses across the region, MTrec Ltd has seen strong growth since inception with an average year-on-year turnover increase of around 23%, with last accounts, for the financial year ended March 31 2016, showng turnover £46m. \nMTrec has offices throughout the North East and works with blue chip clients across sectors including aerospace, automotive and Fast Moving Consumer Goods (FMCG). \nThe business was founded by directors David Musgrave and Rob Armstrong. \nDavid Musgrave will remain as managing director and, alongside the existing management team, including James Doyle and Chris Salkeld, will work with Trust Tech Inc. to develop the business over the coming years to become a leading national and European staffing and training provider. \nMr Musgrave said: “Becoming Trust Tech Inc.’s first European strategic partner is testament to the quality of the business and the strong growth we have achieved. \n“It is a fantastic opportunity for MTrec and its current management team to take the business into new markets and to enable the business to deliver global staffing and training solutions to our existing and prospective clients.” \nTrust Tech Inc. is a leading Japan-based staffing business specialising in the provision of dispatching, outsourcing and sub-contracting staffing solutions and the company is currently executing a growth strategy, emphasising both organic growth and aggressive acquisition. \nCarl Swansbury, partner at Ryecroft Glenton Corporate Finance, advised on the sale for MTrec, supported by Alex Simpson, Simon Hopwood and Charlie Burton. \nLegal advice is being provided by Duncan Reid and Kirsty Adamson of national law firm, Watson Burton. \nAdvising on the sale, on behalf of the directors of MTrec Ltd, is Carl Swansbury, partner at Ryecroft Glenton Corporate Finance, supported by Alex Simpson, Simon Hopwood and Charlie Burton. Legal advice is being provided by Duncan Reid and Kirsty Adamson of national law firm, Watson Burton. \nTrust Tech Inc. is being advised by corporate finance advisors, Philip Ellis of Optima Corporate Finance working in partnership with Yoshiharu Ohi, CEO of Global Business Consulting Corporation in Japan. \nFinancial due diligence was carried out by Grant Thornton led by Dan Rosinke. \nLegal advice is being provided by Osborne Clarke’s Matthew Bodfield and Kevin Barrow. \nYutaka Nishida, president and representative director of Trust Tech Inc, said: “It is our highest delight to welcome MTrec to our group. Focusing on manufacturing and engineering sectors, both Trust Tech and MTrec are fast-growing and enthusiastic companies. We are covering different geographic areas of the world, and can jointly grow faster.” \nCarl Swansbury, partner at Ryecroft Glenton Corporate Finance, said: “This is a very positive transaction for the North East, and demonstrates the high levels of interest overseas companies have in acquiring fast-growth, profitable, well-run UK based businesses. \n“MTrec Ltd has established a very successful operation in the NE serving clients in a variety of industries with ever changing temporary and permanent workforce and training requirements. \n“The existing management team are very much looking forward to working alongside Trust Tech to grow the business over the coming years by moving into new adjacent sectors and geographical markets.” \nDuncan Reid, partner and national head of corporate at Watson Burton, said: “MTrec Ltd is a true North East success story, with a customer base that already features many global operators – it’s therefore no surprise that Trust Tech Inc. chose the firm as its first European strategic partner. \n“The deal also demonstrates that post-referendum result, overseas companies are still interested in exciting new opportunities in the UK market – and that they are prepared to back up that interest with acquisitions of a significant scale.”", "external_links": [], "published": "2016-08-05T14:48:00.000+03:00", "crawled": "2016-08-05T15:19:24.312+03:00", "highlightTitle": ""}