{"organizations": [], "uuid": "7f6555ab7dea4e3ab42c19eb6a0f3701076e1d9f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article11711345.ece/ALTERNATES/s1200/JS76831393.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-sees-sharpest-business-11711353", "country": "GB", "domain_rank": 21960, "title": "North East sees sharpest business activity drop for four years after Brexit vote", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "North East sees sharpest business activity drop for four years after Brexit vote", "spam_score": 0.0, "site_type": "news", "published": "2016-08-08T02:01:00.000+03:00", "replies_count": 0, "uuid": "7f6555ab7dea4e3ab42c19eb6a0f3701076e1d9f"}, "author": "Robert Gibson", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-sees-sharpest-business-11711353", "ord_in_thread": 0, "title": "North East sees sharpest business activity drop for four years after Brexit vote", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "none"}, {"name": "leigh taylor", "sentiment": "none"}, {"name": "robert gibson", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "sme banking", "sentiment": "none"}, {"name": "markit economics", "sentiment": "none"}, {"name": "bank of england monetary policy committee", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "lloyds bank commercial banking  the north east", "sentiment": "none"}, {"name": "north east pmi", "sentiment": "none"}, {"name": "lloyds bank commercial banking", "sentiment": "none"}, {"name": "lloyds bank regional pmi", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "North East sees sharpest business activity drop for four years after Brexit vote 00:01, 8 Aug 2016 By Robert Gibson The latest Lloyds Bank Regional PMI report says the region saw the fast decline in new incoming business in the UK during July Shares Get business news by email Leigh Taylor, area director, SME Banking in the North East, at Lloyds Bank Commercial Banking \nThe North East experienced the sharpest decline in business activity for four years in July, as the EU referendum result sparked uncertainty in the market, increased cost pressures and contributed to a slowdown in orders, according to a new report. \nAfter seeing some growth in June, the following month brought a significant downturn that was faster than the UK average, the Lloyds Bank Regional PMI report shows. \nThe PMI - or Purchasing Managers’ Index - is the leading economic health-check for the UK regions and is based on responses from manufacturers and services businesses about the value of goods and services produced each month, compared to the month prior. \nIn its first full reading of regional business activity since the EU Referendum vote, the North East PMI registered 46.0 in July, down from 52.5 in June; a reading of above 50 signifies growth, while one below 50 signifies contraction. \nOne major factor contributing to the slowing down of activity was that new incoming orders fell at the fastest pace in almost seven-and-a-half years, causing companies to scale back and shed jobs. \nEven price reductions failed to stimulate demand during the period, within the North East seeing the quickest decline in new incoming business of all UK regions. \nImpacts on the exchange rate post-EU Referendum, combined with higher average staff costs, have also led to stronger cost pressures, which climbed to a 58-month high. \nLeigh Taylor, regional director for the North East at Lloyds Bank Commercial Banking, said: “Regional business activity was dragged down by post-referendum vote market uncertainty, with performance taking a turn for the worse in July. \n“The region’s growth prospects for the coming months are hampered by the steepest drop in new business orders for almost seven-and-a-half years and another round of job shedding. \n“Significant policy easing by the Bank of England Monetary Policy Committee last week will hopefully help boost business activity and growth in the coming months. \n“We are committed to supporting North East businesses as they navigate the post-EU Referendum landscape.” \nThe North East PMI features original survey data collected in July from a representative panel of companies based in the region, operating in both manufacturing and service sectors. \nIt is part of a series of regional surveys published by Markit Economics, and aims to provide an advance indication of what is happening in the private sector economy by tracking variables such as output, new orders, employment and prices. \nThe PMI surveys are regarded as the first indicators of economic conditions each month.", "external_links": [], "published": "2016-08-08T02:01:00.000+03:00", "crawled": "2016-08-08T02:26:05.434+03:00", "highlightTitle": ""}