{"organizations": [], "uuid": "cfb70e5232324df3d9f39c17d9389d1db4bb8443", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article9846902.ece/ALTERNATES/s1200/JS47872446.jpg", "site_section": "http://www.thejournal.co.uk/business/?service=rss", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-opinion/growth-weaker-post-brexit-business-11735766", "country": "GB", "domain_rank": 21960, "title": "Growth to be weaker post-Brexit - but business resilience is strong", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Growth to be weaker post-Brexit - but business resilience is strong", "spam_score": 0.0, "site_type": "news", "published": "2016-08-11T20:26:00.000+03:00", "replies_count": 0, "uuid": "cfb70e5232324df3d9f39c17d9389d1db4bb8443"}, "author": "Andrew Hebden", "url": "http://www.chroniclelive.co.uk/business/business-opinion/growth-weaker-post-brexit-business-11735766", "ord_in_thread": 0, "title": "Growth to be weaker post-Brexit - but business resilience is strong", "locations": [], "entities": {"persons": [{"name": "andrew hebden shar", "sentiment": "none"}, {"name": "andrew hebden", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "bank of england", "sentiment": "none"}, {"name": "bank’s monetary policy committee", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "mpc", "sentiment": "none"}, {"name": "bank", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "North East firms will adapt to take on new challenges, says the Bank of England's Andrew Hebden Shares Get business news by email Andrew Hebden \nWe are entering what is likely to be a period of significant change for our economy, with the vote to leave the European Union ushering in a new era for the UK’s relationship with the rest of the world. \nSome of the adjustments to this new reality may prove difficult, and many will take time. \nAnd, while the Bank of England firmly believes that the UK – one of the most flexible economies in the world – can handle this change, there will inevitably be a period of heightened uncertainty as this process takes place. \nLast week, the Bank published its latest inflation report which explained how the vote to leave the EU has resulted in a material change in the economic outlook. For example, the big fall in the value of sterling since the referendum will push up import and consumer prices notably over the next three years. \nWe also now expect growth to be weaker and unemployment higher over the next couple of years than at the time of our last forecast in May. \nIn response, the Bank’s Monetary Policy Committee (MPC) has unveiled a comprehensive package of measures to support the economy. \nThis includes a reduction in bank rate from 0.5% to 0.25%, along with a new “Term Funding Scheme”, worth up to £100bn, to ensure the cut is passed on by lenders to households and businesses. \nThe Bank is also expanding its purchases of government bonds by £60bn and launching a new scheme to buy £10bn of UK corporate bonds. \nIn the absence of much “hard” data yet on the impact of the referendum, the evidence gathered by our regional agents was particularly important as the MPC tried to assess the state of the economy. \nAlthough some companies tell us they have not changed plans as a result of the vote, others are more cautious about decisions on investment and hiring. \nBut the clear result was that the outcome would have a negative effect, overall, on capital spending, hiring and turnover over the coming year. \nHowever, at times like this, what is always striking is the resilience and versatility of the region’s businesses. Companies will adapt to take on new challenges and embrace new opportunities – just as they have in the past. Andrew Hebden, Bank of England deputy agent for the North East", "external_links": [], "published": "2016-08-11T20:26:00.000+03:00", "crawled": "2016-08-11T20:43:37.354+03:00", "highlightTitle": ""}