{"organizations": [], "uuid": "45542a50db0c84d9a2642fb1d6a60ea80a29eec3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article11699005.ece/ALTERNATES/s1200/CFR_NJL_030816hewitt_01.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/uncertainty-force-energy-investors-away-11698913", "country": "GB", "domain_rank": 21960, "title": "Uncertainty may force energy investors away from UK, warns North East sector specialist", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Uncertainty may force energy investors away from UK, warns North East sector specialist", "spam_score": 0.0, "site_type": "news", "published": "2016-08-03T17:30:00.000+03:00", "replies_count": 0, "uuid": "45542a50db0c84d9a2642fb1d6a60ea80a29eec3"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/uncertainty-force-energy-investors-away-11698913", "ord_in_thread": 0, "title": "Uncertainty may force energy investors away from UK, warns North East sector specialist", "locations": [], "entities": {"persons": [{"name": "hinkley", "sentiment": "none"}, {"name": "phil hewitt", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "enappsys", "sentiment": "none"}, {"name": "hewitt", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "energy trilemma", "sentiment": "none"}, {"name": "hinkley point c", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Uncertainty may force energy investors away from UK, warns North East sector specialist 15:30, 3 Aug 2016 Phil Hewitt of EnAppSys says capital could look elsewhere than the UK electricity market, in the wake of the Hinkley C decision delay Shares Get business news by email Phil Hewitt, Enappsys director \nNorth East energy sector monitoring specialist EnAppSys says the delay in the Government’s decision on Hinkley Point C is the latest example of how changes and uncertainty in policy direction continue to have a serious impact on important energy sector investment decisions. \nIn the renewable sector, the past two years have seen levels of solar capacity growth explode due to accelerated deadlines for subsidies. \nThis has led to two decades of expected build-out coming over the space or approximately two years, while support for onshore wind farms have now been almost entirely cut, creating unstable booms and busts within the renewable industry. \nAway from renewables, a similar pattern has been emerging for small distributed generators - designed to keep the lights on during cold windless spells - with numerous projects unsure which otherwise expected and currently active income streams they will still be able to earn, and which will be removed from under their feet in the coming years, making it hard for investors to back these schemes. \nPhil Hewitt is director of Yarm-based EnAppSys, an independent energy specialist company that provides electricity and energy market data, systems and consultancy services to parties with an interest in the UK energy market. EDF Energy/PA Wire A CGI image of Hinkley Point C \nHe said: “As the UK energy market evolves, there is a need to progress the system towards a more flexible and efficient approach that can work around low cost renewables with smart power solutions such as energy storage and demand flexibility. \n“The combination of renewables and increases in storage capability, due to the development of heat networks and collapsing battery costs, could be the key to a flexible and efficient market. If complemented by nuclear plants this could provide a diversified fuel mix. \n“Right now the greatest issue in the market is managing the levels of uncertainty on-going within the power system. Whether nuclear should or shouldn’t be part of the fuel mix, the back and forth over whether projects will or won’t get agreements is affecting the wider industry. \n“Ahead of the 2016 Capacity Mechanism auction we already have projects bidding in that do not have 100% visibility or clarity over whether their revenue streams will persist into the future or not and this is creating unprecedented uncertainty. \n“Hopefully with a final decision on Hinkley Point C, the market can start to plan ahead for a more certain future and with the changed government we can only hope that levels of clarity within the industry can rise.” \nOn balance, EnAppSys believes that Hinkley C is likely to proceed, but that this might come despite no long-term framework for nuclear and no clear fuel mix or structural expectations for our power system whilst technology developments will drive the market in unexpected directions over the medium term. EDF Energy/PA Wire A CGI image of Hinkley Point C \nMr Hewitt said: “Hinkley Point C may yet go ahead and still be the last new nuclear built in GB as other projects look to avoid the difficulties it has encountered or if the subsidy regime changes once again, as has been the case for other technologies such as wind and solar. \n“For obvious reasons, there is a clear advantage to power sources that can be commanded to turn on and off in a reliable manner, but the erratic approach taken towards subsidies has not helped the industry as a whole. \n“It might have been, and still might be, more prudent to have run a competition that would achieve reliable clean power generation that can satisfy criteria such as coming on when required and delivering a required power shape, but in a low carbon manner. \n“This would have allowed nuclear to compete against CCS projects and renewable/storage/demand response combinations and could have demonstrated that nuclear was indeed the most optimal approach to delivering clean and reliable energy. \n“At the end of the day if Hinkley Point does not go ahead, then it will be these sorts of projects that will be required to ensure stable and clean generation into the future; ensuring security, sustainability and affordability as part of meeting the government’s Energy Trilemma. \n“The challenge for market participants and investors at the moment is that what is given out with one hand seems to be taken away with the other, with no clear idea of where the next cut or subsidy is likely to fall. Right now the industry is not able to point out the long-term technology that will win, instead it can only chase the next wave being created by government policy. \n“The government needs to decide whether it wants the market to decide or pick winners itself and then not change its mind. The current situation, compounded by Brexit, is that the only certainty is uncertainty and in that case there is a distinct possibility that capital will look elsewhere than the UK electricity market.”", "external_links": [], "published": "2016-08-03T17:30:00.000+03:00", "crawled": "2016-08-03T20:03:59.147+03:00", "highlightTitle": ""}