{"organizations": [], "uuid": "16f07ba692d7bea19c8fbd235e12be1d520b9b6b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article11776105.ece/ALTERNATES/s1200/From-left-Michael-Dunn-commercial-director-of-Gospelware-Ryan-Davies-Gospelware-managing-directo.jpg", "site_section": "", "section_title": "", "url": "http://www.chroniclelive.co.uk/business/business-news/hundreds-jobs-created-generator-launches-11774516", "country": "IE", "domain_rank": 21960, "title": "Hundreds of jobs to be created as Generator launches new growth programme - Chronicle Live", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 0, "title_full": "Hundreds of jobs to be created as Generator launches new growth programme - Chronicle Live", "spam_score": 0.994, "site_type": "news", "published": "2016-08-22T08:00:00.000+03:00", "replies_count": 0, "uuid": "16f07ba692d7bea19c8fbd235e12be1d520b9b6b"}, "author": "Robert Gibson", "url": "http://www.chroniclelive.co.uk/business/business-news/hundreds-jobs-created-generator-launches-11774516", "ord_in_thread": 0, "title": "Hundreds of jobs to be created as Generator launches new growth programme - Chronicle Live", "locations": [], "entities": {"persons": [{"name": "ryan davies", "sentiment": "none"}, {"name": "david wala from", "sentiment": "none"}, {"name": "gospelware", "sentiment": "none"}, {"name": "jonny gray", "sentiment": "none"}, {"name": "lizzie withington", "sentiment": "none"}, {"name": "michael dunn", "sentiment": "none"}, {"name": "gray", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "gospelware", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Hundreds of jobs to be created as Generator launches new growth programme 00:00, 22 Aug 2016 By Robert Gibson New initiative will see companies matched with industry-leading experts focused on specific areas in which guidance is needed Shares Get business news by email David Wala From left, Michael Dunn, commercial director of Gospelware; Ryan Davies, Gospelware managing director; Lizzie Withington, Gospelware COO; and Jonny Gray, Generator's business support programme manager \nHundreds of North East jobs are set to be created over the coming year through a new initiative being launched today by business development agency Generator. \nThe organisation has set up its new Business Growth Pipeline Programme as a means of providing intensive, bespoke support for established creative businesses with clear growth ambition. \nOver the next three months, it aims to create at least 75 high quality jobs in the region, with more to follow after that. \nGenerator’s business support programme manager, Jonny Gray, said: “By their very nature, creative and digital enterprises tend to be born out of creative brains who do not necessarily have a background in business and a fresh pair of experienced eyes can be the key to unlocking potential. \n“We see the Business Growth Pipeline as a vital support mechanism to assist North East-based creative and digital businesses scale-up their operations to achieve their full potential. \n“Many creative and digital businesses are led by an owner/founder where the move from ‘successful creative’ to ‘successful entrepreneur’ presents challenges, particularly around commercial growth. \n“Generator has a fantastic knowledge of the values and motives driving decision-making by these creative and digital firms, many of which are started by mavericks whose creativity, lifestyles and business ambitions are totally entwined.” \nThe programme is aimed at providing the right conditions for ambitious creative businesses looking to increase their turnover and headcount. \nOn entering the pipeline, companies are first provided with a ‘diagnostic’, after which they are matched with industry-leading experts who will take on an Interim Director role for 12 months, working on specific areas in which guidance is needed or where experience may be lacking. \nThe project has already been piloted successfully over six months with the Newcastle -based software company, Gospelware, which is on track for a record year of growth. \nManagement at the business say they have been delighted with the initiative, which has resulted in them being able to employ a full-time financial director. \nManaging director Ryan Davies said: “The support we received from Generator from our interim financial director was fantastic – it really helped us align our financial goals around monthly output and helped us with process for reviewing. \n“Our interim financial director was a great guy to work with, providing us with a wealth of knowledge and experience.” Read More Generator launches £420,000 development programme for creative young people \nMr Gray added that, regardless of the result of the EU referendum, the programme would have had a significant impact. \nFor those disappointed by the Brexit vote, however, it will now provide a particularly welcome shot in the arm, he said. \n“There’s a lot of good work going on in the North East’s digital sector and we aim to play a pivotal role in its further development through the Business Growth Pipeline and other business support initiatives we run,” he said. \n“The business growth pipeline will help drive productivity and spur growth, helping the North East to reach a ‘par’ position with the rest of the country and enhance the North East as a place to invest and start and grow a business.” \nBusinesses can apply online for the programme at via http://generator.org.uk/business-growth-pipeline/ \nInterested in North East jobs? Find job vacancy listings across a range of sectors here . ", "external_links": [], "published": "2016-08-22T08:00:00.000+03:00", "crawled": "2016-08-22T02:18:28.614+03:00", "highlightTitle": ""}