{"organizations": [], "uuid": "eda74a3c7f669f2465c5721ef4f852ff79ddcc26", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article11744380.ece/ALTERNATES/s1200/JS95446911.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/government-guarantee-post-eu-funds-11744355", "country": "GB", "domain_rank": 21960, "title": "Government guarantee for post-EU funds could put North East devolution deal back on track", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Government guarantee for post-EU funds could put North East devolution deal back on track", "spam_score": 0.0, "site_type": "news", "published": "2016-08-13T18:47:00.000+03:00", "replies_count": 0, "uuid": "eda74a3c7f669f2465c5721ef4f852ff79ddcc26"}, "author": "Michael Marsh", "url": "http://www.chroniclelive.co.uk/news/north-east-news/government-guarantee-post-eu-funds-11744355", "ord_in_thread": 0, "title": "Government guarantee for post-EU funds could put North East devolution deal back on track", "locations": [], "entities": {"persons": [{"name": "philip hammond", "sentiment": "none"}, {"name": "nick forbes", "sentiment": "none"}, {"name": "paul watson", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "stephen purvis", "sentiment": "none"}, {"name": "north", "sentiment": "none"}, {"name": "derek mackay", "sentiment": "none"}, {"name": "hammond", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "durham county hall", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "north tyneside", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "south tyneside", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "neca", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "national trust", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}, {"name": "newcastle city council", "sentiment": "none"}, {"name": "sunderland city counci", "sentiment": "none"}, {"name": "liverpool", "sentiment": "none"}, {"name": "neca", "sentiment": "none"}, {"name": "cllr nick forbes", "sentiment": "none"}, {"name": "north east combined authority", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "A think-tank has welcomed Chancellor Philip Hammond's pledge to replace EU funds lost in the wake of June 23's Brexit vote Shares Get daily news by email Britain's Chancellor of the Exchequer Philip Hammond \nThe multi-billion devolution deal for the North could be back on track after Chancellor Philip Hammond promised to replace EU funds lost through Brexit . \nThe region will continue to receive cash for EU-funded projects, Mr Hammond pledged on Saturday, opening the way to deliver on the North East’s £3.4bn devolution deal. \nThe deal will see the North handed powers over areas such as social care, regional development and transport. \nIt was shelved in July after leaders of the region’s seven councils chose to freeze discussions over devolution, pending further assurances over funding in the aftermath of the EU referendum result. \nBut think-tank Policy North has welcomed the Chancellor’s announcement that the Treasury will guarantee to back EU-funded projects signed before this year’s Autumn Statement. North East devolution deal back on track \nStephen Purvis, Policy North chair, said: “This is really welcome news for our region. The Government has now delivered on the reassurances that council leaders have been asking for. \n“We now need the region’s council leaders to deliver on their promise of devolution to bring more jobs and investment to our region. Manchester and Liverpool are already racing ahead and the North East really is being left behind. \n“With these assurances from the Chancellor now in place, we cannot afford to waste a minute in delivering on devolution. The longer things drag out, we risk losing not just the £3bn in new spending power that devolution brings, but missing out on new jobs and investment.” \nLeaders of the North East Combined Authority (NECA) - made up of Newcastle, Gateshead, Sunderland, Northumberland, Durham, North Tyneside and South Tyneside - met last month and expressed concerns in the wake of the Brexit vote. \nFears were raised that the region would miss out on a pool of European cash, potentially casting the devolution deal into doubt. \nPaul Watson, NECA chair and leader of Sunderland City Counci l, said: “It is important to make clear that we have not resigned one inch from the devolution agenda, but at this time given the Brexit vote and the uncertainty around who will be the new Prime Minister and Chancellor we need assurances before we commit.” \nWhile Newcastle City Council leader Nick Forbes said the decision to leave the EU “turned the world on its head”, adding: “The reason why EU funding is so significant for this region is that we have done far better out of the EU than we have out of central Government in terms of investment.” The NECA leadership board meeting on the devolution decision at Durham County Hall, Cllr Nick Forbes \nBut Mr Hammond moved to allay fears in an announcement on Saturday, saying EU funding for farmers, scientists and other projects will be replaced by the Treasury. \nThe Government pledged to fill the shortfall with public money until at least 2020, which based on the projections that Brexit will take two years, means the Government will make up a two-year shortfall in EU funding for the North East. \nThe money will come from Britain’s £8.5bn net contribution to the European Union, which it will cease to pay upon its exit from the EU. Read More Devolution deal shelved following Brexit uncertainty as North East leaders demand reassurances \nMr Hammond said: “The UK will continue to have the all of the rights, obligations and benefits that membership brings, including receiving European funding, up until the point we leave the EU. \n“We recognise that many organisations across the UK which are in receipt of EU funding, or expect to start receiving funding, want reassurance about the flow of funding they will receive. \n“That’s why I am confirming that structural and investment funds projects signed before the Autumn Statement and Horizon research funding granted before we leave the EU will be guaranteed by the Treasury after we leave.” \nDespite the Chancellor’s pledge, sceptics have said it will not end the post-Brexit uncertainty for some communities. \nScottish Finance Secretary Derek Mackay said the “limited” funding is hundreds of millions of pounds short of what Scotland would receive as a member of the EU. \nMeanwhile, the National Trust called for backing for farming and environment projects which get under way after the Autumn Statement. \nA spokesman said: “We welcome the Government’s decision to continue with funding for newly agreed and existing agri-environment schemes. \n“But set against this is the continued uncertainty should new applications be restricted beyond this autumn. This would put at serious risk decades of effort by farmers and organisations like ours to protect and enhance our countryside.”", "external_links": [], "published": "2016-08-13T18:47:00.000+03:00", "crawled": "2016-08-13T15:30:23.199+03:00", "highlightTitle": ""}