{"organizations": [], "uuid": "a0c8aaac715f8b25b14b59328f1c560af6d21403", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article11693222.ece/ALTERNATES/s1200/JS96123504.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/greggs-confirms-gluten-free-foods-11693160", "country": "GB", "domain_rank": 21960, "title": "Greggs confirms gluten-free foods on the way after sales boost from healthy options", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Greggs confirms gluten-free foods on the way after sales boost from healthy options", "spam_score": 0.0, "site_type": "news", "published": "2016-08-02T12:50:00.000+03:00", "replies_count": 0, "uuid": "a0c8aaac715f8b25b14b59328f1c560af6d21403"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/greggs-confirms-gluten-free-foods-11693160", "ord_in_thread": 0, "title": "Greggs confirms gluten-free foods on the way after sales boost from healthy options", "locations": [], "entities": {"persons": [{"name": "greggs", "sentiment": "none"}, {"name": "roger whiteside", "sentiment": "none"}, {"name": "simon williams/greggs/pa wire greggs", "sentiment": "none"}, {"name": "whiteside", "sentiment": "none"}], "locations": [{"name": "enfield", "sentiment": "none"}, {"name": "sleaford", "sentiment": "none"}, {"name": "twickenham", "sentiment": "none"}, {"name": "glasgow", "sentiment": "none"}, {"name": "edinburgh", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Falafel, hummus and other Balanced Choice salads have helped drive sales up by 6% at the Newcastle sausage-roll maker Shares Get business news by email Greggs/PA Wire Greggs balanced choice cajun chicken flatbreads, as falafel and hummus helped power sales at the bakery chain in the first half of the year \nHealthy options including falafel and hummus have seen sales at Greggs steam ahead in the first half of the year, with the Newcastle firm reaping the rewards of a wider range of options. \nAnd chief executive Roger Whiteside has said more is on the way, including the firm’s first gluten-free offerings. \nRevenues were up 6% to £422m at the firm, while like-for-like sales in the period rose 3.8%, driven by the food-on-the-go baher’s Balanced Choice menu, which also includes teriyaki chicken noodle salad. \nGreggs now intends to beef up its healthy eating options, with new soups and packets of nuts and fruit to be introduced in the autumn. \nHe said: “There will be new soups and we’re going to revamp our snack range, going own-label on crisps and introducing nuts and fruits packets. We’ll also see the first gluten-free products launch in the second half of the year.” \nEarlier this year, Mr Whiteside revealed that he is considering branching out even further from traditional Greggs staples of sausage rolls and doughnuts into Mexican food, and one day potentially even sushi. \nHe added that the firm is “alert” to any Brexit-induced change in consumer sentiment over the coming months. Simon Williams/Greggs/PA Wire Greggs chief executive Roger Whiteside \n“There’s no sign of any impact yet, but if demand is affected we are alert and ready to react. \n“In a downturn, customers will be looking for more value, meal deals and that sort of thing, so we will make sure we tailor the offer to meet conditions. We’ll have to control costs too, but it won’t affect our investment programme,” he said. \nPre-tax profits for the first six months of the year were broadly flat, coming in at £25.3m, held down by exceptional charges linked to the closure of three bakery sites. \nOther operational highlights in the 26 weeks ended July 2 included the further development of its breakfast and hot drinks offer as well as the successful launch of its improved Greggs Rewards app. \nThe shop refurbishment programme is also progressing well, with 86 shop refurbishments completed year-to-date out of a planned 200 for the year. Read More Greggs chief executive Roger Whiteside hails healthy start to the year \nBack in March the firm announced a programme to restructure the firm’s 12 bakeries, not all of which were said to be suitable for long-term investment. \nThree bakeries were earmarked for closure – in Twickenham, Edinburgh and Sleaford – with the disposal proceeds to contribute to the investment in the remaining nine bakeries. \nMr Whiteside says progress has been made in the firm’s plans to invest substantially in its manufacturing and distribution operations, to reshape them for future growth. \nThe initial phase of this plan involves the closure of the three bakery manufacturing sites, with associated one-off costs expected to be £7.6 million. \nPlans to invest in the transformation and development of the supply chain are progressing well too. \nThe new distribution facility in Enfield will be operational in October, allowing Greggs to complete the closure of the existing Twickenham bakery in the fourth quarter as planned. \nIn addition, planning permission has been secured for the extension of the Clydesmill bakery in Glasgow which will pave the way for closure of the Edinburgh bakery during the second quarter of 2017. \nMr Whiteside sadded: “We are now planning the next phase of investment in our remaining sites, which will increase logistics capacity and consolidate manufacturing, with benefits in product quality, consistency and efficiency.” \nAs of the end of the period Greggs now has 1,730 shops trading.", "external_links": [], "published": "2016-08-02T12:50:00.000+03:00", "crawled": "2016-08-02T13:54:25.996+03:00", "highlightTitle": ""}