{"organizations": [], "uuid": "b1dae8f93fd6d3a9bbbdc6e37d8e61cdb69cc789", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article11711426.ece/ALTERNATES/s1200/JS52094260.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/risk-growth-uk-manufacturers-remain-11711310", "country": "GB", "domain_rank": 21960, "title": "Risk to growth as UK manufacturers remain 'reluctant' to borrow from banks", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Risk to growth as UK manufacturers remain 'reluctant' to borrow from banks", "spam_score": 0.0, "site_type": "news", "published": "2016-08-08T02:02:00.000+03:00", "replies_count": 0, "uuid": "b1dae8f93fd6d3a9bbbdc6e37d8e61cdb69cc789"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/risk-growth-uk-manufacturers-remain-11711310", "ord_in_thread": 0, "title": "Risk to growth as UK manufacturers remain 'reluctant' to borrow from banks", "locations": [], "entities": {"persons": [{"name": "lee hopley", "sentiment": "none"}, {"name": "liz mayes", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "eef", "sentiment": "none"}, {"name": "cma", "sentiment": "none"}, {"name": "competition and markets authority", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Risk to growth as UK manufacturers remain 'reluctant' to borrow from banks 00:02, 8 Aug 2016 Growth and investment are at risk because manufacturers remain disengaged from the banking sector, the EEF report claims Shares Get business news by email Liz Mayes, new boss of the EEF \nGrowth and investment are at risk because UK manufacturers remain disengaged from the banking sector and are reluctant to borrow, a key EEF report claims. \nAlmost 10 years on from the start of the credit crunch, the relationship between manufacturers and banks is still yet to recover, with only 35% more likely to use finance than they were two years ago. \nThat’s one of the findings of the latest report from EEF, the manufacturers’ organisation, which explores manufacturers’ attitudes towards external finance. \nThe concern is that manufacturers are shunning the banks in favour of self-financing investment projects, potentially leading to lower levels of manufacturing investment overall. \nThe report warns that this presents a risk to growth that will likely be sharpened as the UK heads towards Brexit and says that the Competition and Markets Authority’s final recommendations on the competition failures affecting retail banking services for SMEs , due out tomorrow, must ‘pack enough punch to stop the rot’. \nAccording to the report, 85% of manufacturers are confident of securing finance for a new business opportunity. \nBut, while just over a third say they are more likely to use external finance than they were two years ago, 65% disagree. \nAt the same time, there has been a spike in cash holding, with 55% saying they are now holding more cash on their balance sheets compared to pre-recession levels. \nThe data shows that prior to the Brexit vote, manufacturers’ investment intentions were solid, but still over half of firms (53%) would postpone or cancel investment if they couldn’t fund it themselves. \nThis suggests that attitudes towards bank lending have remained largely unchanged even though economic conditions had improved considerably and interest rates have been stuck at historic lows. \nLiz Mayes, regional director for the North East, said: “These findings echo what we hear in the North East. \n“While on the whole, our members in this region do maintain strong relationships with their banks, we also know that access to long-term finance is key. \n“Many local manufacturers, particularly those that are internationally owned, will often seek this from their parent company rather than banks and this could mean that important investment plans are shelved if the internal funding is not available.” \nThe organisation said manufacturers’ unwillingness to leverage their business with bank debt or rely on products such as overdrafts for working capital is likely to deepen post-referendum and that uncertainty over economic conditions will only add to the caution. \nAt the same time, concerns about the banking sector’s liquidity and the decline in bank stock prices could bring competition shortfalls back to the fore. \nAnother major concern, however, is that manufacturers’ increased propensity to hold cash on their balance sheet leaves them particularly vulnerable in the event of negative interest rates, as some banks have already flagged the prospect of charging customers for having credit balances. \nAgainst this backdrop, the report says that the CMA’s final recommendations, due tomorrow, August 9, are critical. \nManufacturers are still more likely to use ‘traditional’ products with medium-term debt (64%), asset finance (56%) and overdrafts (50%) the most common types of finance they would consider. \nMs Lee Hopley, chief economist at EEF said: “Manufacturers’ reluctance to rely on external finance is a persistent hangover from the credit crunch, where trust and confidence in the banks stalled and never quite recovered. \n“But with the Brexit vote dampening investment intentions and adding to uncertainty, this pre-existing condition could now become further aggravated, posing a risk for growth. \n“This makes the CMA’s package of reforms even more important. \n“The CMA cannot prevent a fall in investment intentions, but it can help to strengthen supply dynamics in the market and resolve some of these long-term issues by providing swift and firm remedies that pack enough punch to stop the rot. Whether the next recession is in one year or 20 years’ time, the problems in this vital market must be fixed. Manufacturers must have access to finance - progress needs to be seen.”", "external_links": [], "published": "2016-08-08T02:02:00.000+03:00", "crawled": "2016-08-08T02:25:57.204+03:00", "highlightTitle": ""}