{"organizations": [], "uuid": "64133ec17ea84591604e8b8adc077effc232e1a1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13659372.ece/ALTERNATES/s1200/Uber-license.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13719367", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Uber drives profits up 65% but still faces uphill battle in London", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-06T10:00:00.000+03:00", "replies_count": 0, "uuid": "64133ec17ea84591604e8b8adc077effc232e1a1"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13719367", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Uber drives profits up 65% but still faces uphill battle in London", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning House prices per sq ft \nHere are the average house prices per square foot across Britain, according to Zoopla and Hometrack, with the increase over the past five years in cash and percentage terms: \n1. London, £496, £175, 54%2. East of England, £269, £74, 38%3. South East, £309, £82, 36%4. South West, £223, £41, 23%5. East Midlands, £164, £28, 20%6. West Midlands, £173, £26, 18%=7. Scotland, £137, £14, 11%=7. North West, £147, £15, 11%9. Yorkshire and the Humber, £146, £13, 10%10. Wales, £137, £12, 9%11. North East, £124, £4, 3% 9:26 KEY EVENT North East has lowest average house price per sq ft, study finds \nIt has become a running joke in the North that southern house prices are far to expensive, but new research has shown exactly how much cheaper living in the North can be. \nA new study by Zoopla has shown that the average house in the North East was £124 per sq ft, the lowest figure in the UK. \nUnsurprisingly, London was the most expensive region of the country with house prices valued at £496 per sq ft. The South East was ranked second at £309, while the East of England was ranked third at £269. \nLawrence Hall, a spokesman for Zoopla, said: \nAnalysing property prices per square foot is an effective way of seeing where you can achieve the most space for your money and can help steer you to areas you may want to focus your property search on, depending on your budget. \nThe Home Counties have performed very well since 2012 in addition to some London boroughs, such as Newham and Waltham Forest, which have seen increases of over 80% per square foot. \nThis is no doubt in part due to the significant investment regenerating the area for the London Olympics. \nThe average home in Britain now costs £211 per square foot - an increase of £44 or 26% over the past five years, according to analysis from a property website. \nMeanwhile, in Hartlepool in the North East of England, the average house price per square foot has decreased by £7 over the past five years to reach £102. \nThe average price for a home in County Durham was £101 per sq ft, which was the 10th cheapest local area. House prices KEY EVENT North East's money men scoop top awards at Northern Finance Director awards \nNorth East businesses scooped five awards last night at the inaugural Northern Finance Director awards, which were held at Manchester’s Radisson Blu Edwardian. \nNewcastle University’s Richard Dale scooped the top award after being named Northern Finance Director of the Year 2017 for Outstanding Achievement. \nParkdean Resorts’ Ian bull also won the Northern Finance Director of the Year 2017 – Leadership award, while Prima Cheese, Andy Davis was named the best FD at a limited company with revenues between £25m and £100m. \nChris Blaxall, from technology payments firm Performance Horizon, was the only winner to receive two awards last night. He was named best FD for a company with revenues below £25, but also walked away with the award for Northern Finance Director of the Year 2017 - Strategic Impact. \nThe awards were sponsored by Barclays, EY and Squire Patton Boggs. \nHilary Heap, Partner at EY, said: \nWe know that the North of England houses some very talented FDs who help steer companies through a multitude of challenges in their respective sectors, showing great leadership qualities for the benefit of their finance team and the wider business. \nIt has been fantastic to see the exceptionally high calibre of all of the finalists for this year’s award and to be able to showcase all that they, and the North, has to offer and celebrate their great achievements. L-R Alistair Wyse, Chris Blaxall and Paul Fellows of Performance Horizon in Newcastle Upon tyne, Journal Business 8:51 KEY EVENT North East business leader opens up about depression and urges firms to help staff \nBusiness leader John McCabe has opened up about his experience with mental health issues and urged businesses to support their employees in the workplace. \nMr McCabe, who was appointed as the North East England Chamber of Commerce president in June, revealed he was diagnosed with depression eight years ago and wanted to use his position to help others going through a similar situation. \nThe Chamber represents around 3,000 companies in the North East and has now teamed up with mental health charity Time To Change to raise awareness of workplace mental health issues. \nIn the run-up to World Mental Health Day next week, the Chamber is backing Time To Change’s In Your Corner initiative, which encourage friends, family and colleagues to support people struggling with mental health issues. \nMr McCabe runs his own PR firm, having previously worked in a senior position at the Rio Tinto plant at Lynemouth. He said: \nI had a diagnosis for depression in 2009. I had a fantastic family life and I had a very senior, well paying job at the time. So why on earth should I have depression? \nI didn’t understand mental illness at the time; its impact, its causes, or how it can impact one person but not another. I made sure I learnt a lot about it in the time after that. \nMr McCabe said that he was given a great deal of support by his family and friends but wanted to help others who might not have access to the same level of support. \nHe added: “I just felt that with the opportunity to be Chamber president. I wanted to do something about it, especially for people who are not as lucky as me to have that level of support. \nThe Chamber is now urging its members and other businesses in the region to take part in the In Your Corner initiative, as well as spreading the word about how to spot mental health problems and what to do to be supportive. North East England Chamber of Commerce president John McCabe 8:45 Jonathon Manning Pearson completes sale of 22% stake in Penguin Random House \nPearson has successfully unloaded a 22% stake in its publishing unit Penguin Random House to Germany’s Bertelsmann for around $1bn (£761m).The proceeds of the sale, which was originally announced in July, will help fund a £300m share buyback programme, and allow the company to strengthen its balance sheet and invest in its digital transformation.The education group still holds a 25% stake in Penguin Random House following the transaction.Pearson has been working to shore up its finances following a recent string of profit warnings.The company in February posted a dismal set of annual results, which included a £2.5bn impairment charge, pushing the former Financial Times owner to a record £2.6bn loss. The Penguin logo on the spines of books (Image: Tim Ireland/PA Wire) 8:40 Five new wind turbines off the coast of Blyth 8:36 Massive wind farm off the coast of Blyth set to power thousands of homes \nWork to install five massive wind turbines off the Northumberland coast has been completed. \nThe Blyth Offshore Demonstrator Wind farm four miles off the coast has used a number of world leading innovations to install the foundation, turbines and cables for a wind farm which is expected to power around 34,000 homes. \nLast month, five of the most powerful turbines were lifted and fitted onto the foundations using a specially designed vessel. The five foundations were installed at the site using a new “float and submerge” process – the first time this method has been used for offshore wind turbines. \nThe wind farm, which is owned by French firm EDF Energies Nouvelles, is expected to start generating power later this year. \nEDF Energy Renewables CEO Matthieu Hue said: \nThe completion of the wind farm is one step closer now that we have achieved this latest milestone. The turbines, the foundations, and the cable are innovative features of this project, which is playing a major role in testing and proving new and emerging offshore installation methods and technologies. A cable is laid at one of five new wind turbines at the Blyth offshore wind farm, built by EDF Energy (Image: PA) 8:31 KEY EVENT EasyJet profits boosted by record quarter \nEasyJet has said that full-year profits will come in at the top end of its forecasts after a record quarter, but warned that it will take a £100m hammering from the Brexit-induced collapse in the pound.The budget airline said it carried 24.1m passengers in the three months to September 30 as travellers lapped up low summer fares to beach destinations.As a result, easyJet said full-year pre-tax profits are expected to come in between £405m and £410m, the upper end of its previously guided range.However, the range is still well below last year’s £495m profit, with the firm booking a £100m hit from the plunging pound.Chief executive Carolyn McCall, who will leave the company to take the top job at ITV in January, said: \neasyJet has finished the year with continued positive momentum delivering both a strong final quarter and a strong second half. Passenger numbers and load factor in the final quarter set new records. \nThe market continues to be challenging and easyJet has had to absorb a significant currency impact of £100 million in the year. \nHowever, easyJet continues to operate Europe’s strongest network and the current turmoil in the sector provides easyJet with opportunities to capitalise on its strong customer proposition and grow and strengthen our positions in Europe’s leading airports still further. An Easyjet plane at Newcastle Airport 8:26 Jonathon Manning Financial markets no longer set for 'unpleasant surprise' on interest rates, says Bank official \nFinancial markets will no longer face an “unpleasant surprise” after the Bank of England primed investors for a potential interest rate hike later this year, according to a Bank official.Ian McCafferty, a member of the Bank’s Monetary Policy Committee (MPC), said efforts had been made to ready markets for a prospective rate rise because many investors felt no action would be taken until after Brexit.He said the MPC had become concerned that the markets were misreading the Bank’s ability to react, which may have triggered an “unwelcome snapback” in bond yields.Speaking at the Founders’ Company in London, he said: \nUntil recently, financial markets had appeared to believe that, almost regardless of how the economy behaved, Brexit-related uncertainties effectively tied our hands until after the United Kingdom had left the European Union. \nThis, we felt, was a misreading of our reaction function, risking unnecessary surprise and therefore an unwelcome snapback in bond yields were the policy stance to change. \nMr McCafferty and Michael Saunders are among the most hawkish members of the nine-strong committee and have already voted in favour of interest rates rising from historic lows of 0.25%.While the pair were outvoted 7-2 in September - resulting in rates being kept on hold - other committee members are now entertaining the idea of interest rates moving higher.Mr McCafferty added: \nMore explicit guidance was redeployed in the September minutes specifying that, for a majority of MPC members, ‘if the economy continued to follow a path consistent with the prospect of a continued erosion of slack and a gradual rise in underlying inflationary pressure, some withdrawal of policy stimulus was likely to be appropriate in the coming months’. \nThis has had the effect of bringing forward expectations of the first rise in Bank rate from mid-2019 to late 2017, reducing the risks of an unwelcome surprise. Bank of England (Image: PA) 8:21 Jonathon Manning Big job creation plans as Newcastle law firm Sintons targets £20m turnover \nNewcastle law firm Sintons is embarking on a major growth drive , which aims to increase the firm’s turnover to £20m over the next five years. \nThe firm said it hopes to hire an additional 50 lawyers to its office on Barrack Road, in the city centre. \nTo help oversee the expansion, Sintons has appointed personal injury specialist Mark Quigley as the business’ first managing partner. \nMr Quigley said: \nOver the next five years we would like to get £20m gross fee income. That is challenging. \nWe want that because we will have the best people working for us and working for the best clients. That is about us achieving excellence. \nWhat that means is we do a fantastic technical job and we do it in a way that our clients appreciate and value. \nThe role of managing partner was created to streamline Sintons’ strategic decision making process. \nIn the past major decisions were made by the firm’s 11 equity partners in collaboration with a senior management team. The lengthy process often caused delays to important decisions. \nAdded Mr Quigley: \nWe concluded that we had got to the size where that process was becoming a little bit of an impediment and it wasn’t assisting us in delivering some of the growth that we felt we needed in the business. \nFundamentally it meant that some decisions that required quite a lot of advanced preparations, a lot of scoping, and strategic thinking and planning, tended to go on the back burner. \nWith recruitment being at the heart of Sintons’ growth strategy Mr Quigley has already met with a number of the firm’s external recruiters to explain the business’ needs. Mark Quigley, managing partner at Sintons (Image: Northern Gas Networks) 8:16 ", "external_links": [], "published": "2017-10-06T10:00:00.000+03:00", "crawled": "2017-10-06T10:41:09.025+03:00", "highlightTitle": ""}