{"organizations": [], "uuid": "40782d8b409fd2a7e1f51f7bc94ab49de5c8ac27", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13818328.ece/ALTERNATES/s1200/JS134650589.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13815767", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Telefonica 'investing disproportionately' in O2 despite Brexit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-27T10:00:00.000+03:00", "replies_count": 0, "uuid": "40782d8b409fd2a7e1f51f7bc94ab49de5c8ac27"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13815767", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Telefonica 'investing disproportionately' in O2 despite Brexit", "locations": [], "entities": {"persons": [{"name": "mark evans", "sentiment": "none"}, {"name": "evans", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "telefonica", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "ck hutchison", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KEY EVENT Hundreds of investors buy Newcastle student flats in £3m crowdfunding first \nHundreds of small investors have taken a stake in Newcastle’s student accommodation boom after a crowdfunding project helped raise almost £3m . \nProperty Partner - which describes itself as “the world’s first property stock exchange” - allows people to invest in property deals with smaller sums than are normally required in what is a multimillion-pound investment. \nThe company attracted 1,346 to invest in a deal to buy a block of luxury student flats on Newcastle’s Pitt Street, with £2.99m being raised towards an overall purchase price of £5.36m. The rest of the money came through a mortgage. \nThe purchase - which gives each bed in the 65 unit building a value of nearly £82,500 - gained interest from investors because of the site’s location close to both Newcastle University and Northumbria University. The average investment was £2,223. \nDaniel Gandesha, CEO and founder of Property Partner said: \nTo have achieved the UK’s largest ever property crowdfund is a proud moment for us, and a pivotal moment in the property investment space. \nIt is no surprise that purpose-built student accommodation is what has driven this interest given its strong performance in recent years, and being an asset class that traditional landlords have long been locked out of. \nBut it’s not only great for investors. Students no longer view run down student digs as part and parcel of their university experience. Expectations are changing as more and more purpose-built blocks offer students modern and attractive accommodation at the heart of their university towns. Investors carried out the UK's largest property crowdfund to buy this block of student flats on Newcastle's Pitt Street (Image: Property Partners) 9:05 Jonathon Manning British Airways owner IAG books rising profit \nBritish Airways owner IAG has posted rising third quarter profits as the group overcame extreme weather and terrorism which has impacted the sector.International Airlines Group (IAG) said operating profit before exceptional items rose 20.7% to €1.45bn (£1.28bn) in the three months to September 30.Revenue rose 2% to €6.6bn as boss Willie Walsh hailed a “strong quarter”.He added: \nAll our companies performed well. \nPassenger unit revenue was up 2.2% at constant currency boosted by improvements in the Spanish and Latin American markets. \nOur commercial performance was good despite underlying disruption from severe weather and terrorism. A British Airways plane (Image: Newcastle Journal) 9:00 Jonathon Manning Newcastle law firm's charity foundation celebrates 20th anniversary \nThe Newcastle office of law firm Irwin Mitchell is celebrating the 20th anniversary of the launch of its charity foundation, with plans to raise more money for a local rape charity crisis. \nThe Irwin Mitchell Charities Foundation (IMCF) was founded in 1997 and has so far raised more than £1.5m for good causes. \nNow, the law firm’s North East office is joining forces with its counterparts across the country to raise as much money as it can throughout October. \nAll the funds raised will go to Rape Crisis (Northumberland and Tyneside) which is the firm’s charity of the year. \nPaula Myers, the regional managing partner of Irwin Mitchell’s Newcastle office, said: \nThe Irwin Mitchell Charities Foundation has been an incredible success since its launch and its 20th anniversary is undoubtedly something to celebrate. We are immensely proud to have been able to support a host of fantastic causes down the years and are committed to helping many more going forward. \nAs a firm we have always placed a great emphasis on being actively involved in the communities where we are based and the IMCF has provided us with a strong platform for doing just that. \nThere is no better way to mark this milestone than by doubling our efforts throughout October to raise vital funds which will help the fantastic charities that we currently support. \nIrwin Mitchell’s Newcastle office has already undertaken a range of events this year to support Rape Crisis, with members of staff tackling a fire walk, a charity clubbercise session and a host of other fun activities. 8:55 Jonathon Manning Boldon's Fairstone Group continues rapid growth with fourth acquisition of 2017 \nSouth Tyneside financial planning firm Fairstone Group has continued its rapid expansion after acquiring an asset management group in the Home Counties. \nHase Osborne Asset Management Limited, which is based in Wendover, Buckinghamshire, offers wealth management and financial planning solutions to high net worth individuals. \nThe acquisition has added £2.1m to Fairstone’s turnover and increases the group’s managed funds portfolio by £250m. \nIn total Hase Osborne has 14 members of staff, who provide pensions, investment and tax planning advice to 650 clients. \nJohn Osborne, firm principal at Hase Osborne, said: \nThe acquisition by Fairstone allows us to continue to provide our clients with high quality independent financial advice with the support of a strong infrastructure so that we can fully focus on our clients and ensure they get the best possible investment options. \nWe look forward to accessing Fairstone’s expertise to grow the business for the long-term benefit of clients and staff. \nFairstone is in the midst of a major expansion strategy, which has seen the firm acquire four firms in 2017 through its downstream buy out (BDO) programme. \nFairstone CEO Lee Hartley said: \nHaving worked with Hase Osborne through our proprietary DBO programme, we are very pleased to complete the final acquisition. \n“This marks another significant step in our growth strategy and highlights our commitment to those firms which join our flexible buy out scheme. A number of businesses have joined us this year and the common factor is that clients are never commoditised and their interests are protected. Chief executive of Fairstone Group Lee Hartley 8:50 Jonathon Manning EU to probe British tax scheme \nThe European Commission is to investigate a scheme introduced by the British Government that can help multinationals drive down their tax bill.Margrethe Vestager, the EU’s Competition Commissioner, said the probe will focus on whether the set-up allows multinationals to sidestep EU state aid rules.She said on Thursday: \nAll companies must pay their fair share of tax. Anti-tax avoidance rules play an important role to achieve this goal. But rules targeting tax avoidance cannot go against their purpose and treat some companies better than others. \nThis is why we will carefully look at an exemption to the UK’s anti-tax avoidance rules for certain transactions by multinationals, to make sure it does not breach EU state aid rules. \nThe rule, which was introduced by former chancellor George Osborne and came into force in 2013, exempts multinationals from anti-tax avoidance measures and allows them to shift a portion of their taxable income to an offshore corporation, or “controlled foreign company”.HMRC revealed on Wednesday that corporate heavyweights had avoided paying £5.8bn in UK tax last year by moving profits abroad.The Commission is concerned that the scheme may harm domestic firms by handing an advantage to global rivals based in the UK. \nIt said: \nThe Commission’s state aid investigation does not call into question the UK’s right to introduce controlled foreign company rules or to determine the appropriate level of taxation. The role of EU state aid control is to ensure member states do not give some companies a better tax treatment than others. An anti-Brexit protester waves an EU flag outside the Houses of Parliament (Image: PA) 8:45 KEY EVENT North East manufacturers suffer profits fall due to exchange rate woes \nThe full impact of the falling pound on North East manufacturers has been laid bare after one of the region’s largest companies fell into the red despite adding more than £40m to its turnover . \nThe results at automotive firm Gestamp Tallent mirror a similar picture at lawnmower manufacturer Husqvarna, both of whom are based in Newton Aycliffe, County Durham, and source many of their parts from abroad. \nGestamp, which employs more than 2,400 people, recorded a loss of £15.8m - its first loss since 2009 - even though it had seen turnover increase £49m to £517.6m. \nBusiness leaders are now calling on the Government to provide more clarity surrounding Brexit negotiations as unpredictable exchange rates cause huge problems for firms operating in overseas markets. \nJonathan Walker, head of policy and campaigns at the North East England Chamber of Commerce , said: \nOur recent Quarterly Economic Survey shows members concerns about exchange rates have increased significantly in recent months. \nThe weakening of the pound against the euro has made our exports more competitive but it has harmed those that import goods or components. \nIt is becoming increasingly imperative the Government provides reassurance to those trading internationally by pressing ahead with Brexit negotiations and providing clarity on future trading arrangements as soon as possible. \nIn its accounts for 2016, Gestamp said the loss was caused by “large fluctuations in the euro exchange rate” which “led to increases costs from revaluation of loans”. In total Gestamp’s operating costs rose by £78.9m. Jonathan Walker, head of policy and campaigns, North East England Chamber of Commerce (Image: Handout) 8:40 Carillion appoints new chief executive \nCarillion has appointed Andrew Davies as the company’s new chief executive officer. \nMr Davies currently works as the chief executive of Wates Group, and prior to that held a series of roles with BAE Systems Plc over a 28 year period. \nHe is also a non-executive director of Chemring Group Plc. \nHe will join Carillion on April 2 2018. \nCarillion chairman Philip Green said: \nAndrew has the ideal combination of commerciality, operational expertise and relevant sector experience to build on the conclusions of the strategic review and to lead the on-going transformation of the business. His experience and his people focussed personal style are an ideal combination for our business. \nWe are pleased that he has agreed to join us and we are grateful to Keith Cochrane for his interim leadership of Carillion. Carillion Jonathon Manning Newcastle restaurant Dabbawal stops London eaterie copying its name \nA popular Indian restaurant in the North East has won a David and Goliath-style trademark fight against a multinational hotel group . \nDabbawal, which has two restaurants in Newcastle, was one of the pioneers of the Indian street-food concept, winning fans across the North East since it first opened on High Bridge in 2008. \nBut the company had to turn to trademark lawyers when the Leela Group, one of India’s largest hoteliers planned to open a new restaurant in London’s Mayfair called Dabbawala. \nThe name for the restaurant comes from debbawalas, a lunchbox delivery system that operates in the Indian city of Mumbai and sees bicycle-riding delivery men transport freshly made, home-cooked food to thousands of office workers across the city. \nJane Matthews, business development manager at Dabbawal, said: \nOver the years we have become accustomed to a number of operators replicating our innovative ideas, but through constant development we have always stayed ahead of the market. \nHowever, The Leela Group began to market their new restaurant as ‘Mumbai’s hottest new export’, championing the dabbawalas, and looking to serve street food and chaats, along with home-style recipes, all of which are an integral part of the Dabbawal concept. \nWe decided that we had to take action to protect the Dabbawal brand, which we have worked so hard to grow over the past decade. \nThe team at Dabbawal enlisted London law firm Sheridans to argue that Dabbawal is a registered trademark established over a number of years, and that it was at the forefront of the UK’s street food scene. \nThe owners of the proposed new restaurant backed down and have instead called the new venue Bombay Bustle. Jane Matthews from Dabbawal restaurant in Newcastle. Dabbawal took on a London firm for using the same name as them and won (Image: Newcastle Chronicle) 8:30 KEY EVENT Investors cheer Twitter results despite miscalculation of monthly user figures \nTwitter shares surged after third-quarter earnings beat expectations, while investors shrugged off a company mistake that resulted in an over-estimation of monthly active users going back three years.The social media giant said adjusted operating profit rose to $207m (£157m) in the third quarter, compared with $181m (£137m) during same period last year.That was despite a 4% decline in revenue for the period to $590m (£446m).Investors were also cheering a jump in monthly average user (MAU) figures to 330 million, which was up 4% year on year and marked an increase from 326 million in the previous quarter.Daily active users meanwhile surged 14% on an annual basis.The news sent Twitter’s shares - which are listed on the New York Stock Exchange - up nearly 10% in pre-market trading.Chief executive Jack Dorsey said: \nThis quarter we made progress in three key areas of our business: we grew our audience and engagement, made progress on a return to revenue growth, and achieved record profitability. \nWe’re proud that the improvements we’re making to the product continue to bring people back to Twitter on a daily basis. \nHowever, the company was forced to admit a mistake that caused a miscalculation of MAUs dating back nearly three years. \nThe firm said: \nWe discovered that, since the fourth quarter of 2014, we had included users of certain third-party applications as Twitter MAUs that should not have been considered MAUs. Twitter Jonathon Manning Newcastle City Council consultation could be big opportunity for businesses \nA consultation being carried out by Newcastle City Council could provide a major opportunity for land, property and business owners, according to a firm of chartered surveyors. \nAs part of the Draft Development and Allocations plan, the city council is asking for comments and submissions on the development of Newcastle up to 2030. \nThe plan is focusing on providing more detailed policies to support planning decisions, allocations of housing, employments sites and the designation of areas such as retail centres. \nCraig Ross, associate at George F. White, said: \nThe consultation is an opportunity for any land, property and business owners to get involved at an early stage and to help promote and make the most of their assets. \nAlternatively, for those who wish to seek to protect their assets and interests, this can also be done through the plan making process. \nWe are currently working across the region providing specialist planning and development advice on this and a whole range of other planning and development services. \nThe consultation closes on November 20 2017 and responses need to be submitted before this date. \nMr Ross added: \nWith such a short window of opportunity it is important that everyone who wants to get involved does so in the most effective way. \nOur new city centre location is allowing us to meet new and existing clients quickly and easily which in turn allows us to respond to such opportunities on their behalf. Newcastle Civic Centre (Image: Newcastle Chronicle) 8:20 Jonathon Manning RBS posts third consecutive quarterly profit \nRoyal Bank of Scotland (RBS) has posted its third consecutive quarter in the black after swinging to a third quarter profit.The bank, which is still 72% owned by the taxpayer, recorded a £392m profit for the three months to September 30, which compares with a £469 million loss in the same period last year.Chief executive Ross McEwan again signalled that the lender is moving on from its troubled past.He said: \nOur strategy to deliver a simpler, safer, customer-focused bank, is working. \nWe have grown income, reduced costs, made better use of our capital and continued to make progress on our legacy conduct issues. \nOur core bank continues to generate strong profits and we remain on track to hit our financial targets.” A Royal Bank of Scotland sign (Image: Philip Toscano/PA Wire) 8:15 ", "external_links": [], "published": "2017-10-27T10:00:00.000+03:00", "crawled": "2017-10-27T10:20:59.000+03:00", "highlightTitle": ""}