{"organizations": [], "uuid": "f93418ffbb109cc29b6173282fb897e08aed618a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13813300.ece/ALTERNATES/s1200/Brexit.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/chris-heaton-harris-no-joe-13824367", "country": "GB", "domain_rank": 21960, "title": "Chris Heaton-Harris is no Joe McCarthy - he's just an idiot", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-29T07:00:00.000+02:00", "replies_count": 0, "uuid": "f93418ffbb109cc29b6173282fb897e08aed618a"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/chris-heaton-harris-no-joe-13824367", "ord_in_thread": 0, "title": "Chris Heaton-Harris is no Joe McCarthy - he's just an idiot", "locations": [], "entities": {"persons": [{"name": "joe mccarthy", "sentiment": "negative"}, {"name": "chris heaton-harris", "sentiment": "negative"}, {"name": "mccarthy", "sentiment": "none"}, {"name": "joseph mccarthy", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "thom brooks", "sentiment": "none"}, {"name": "mr heaton-harris", "sentiment": "none"}, {"name": "jo johnson", "sentiment": "none"}, {"name": "heaton-harris", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "daily mail", "sentiment": "none"}, {"name": "durham law school", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nChris Heaton-Harris is clearly a prize prat. \nHe’s the Conservative MP and government whip who wrote to universities asking them to name professors teaching pupils about Brexit. \nThe MP wanted a copy of the syllabus being taught, and links to online lectures. \nHis intentions seem pretty clear. He wanted to find out what lecturers were telling their students. \nWhy? Well, given that he’s a self-proclaimed eurosceptic, there’s been a tendency to assume he was on the lookout for pro-Brussels academics forcing EU propaganda on to hapless students. Perhaps his intention was to name and shame academics who criticise Brexit. \nUniversities Minister Jo Johnson offered a different explanation, suggesting Mr Heaton-Harris was researching a book. \nBut in that case, why did he send his request on House of Commons notepaper, and fail to mention anything about a book in his letter? Writing books is not part of his job as an MP. Read More Building work at Parliament cuts off MPs' phones and it's caused a bit of a problem \nWhatever Mr Heaton-Harris is up to, however, it doesn’t quite merit the hysteria his letter prompted. \nIt’s McCarthyism, according to one newspaper. This is a reference to Joseph McCarthy, the US senator who led a witch-hunt against Communists in the 1950s. \nThe difference is that McCarthy actually had influence. He ruined lives. \nAnd the movement was far bigger than one man. People in academia, the entertainment industry and law enforcement lost their jobs because they were accused of Communist sympathies. \nNothing similar is happening here. \nUniversities roundly told Mr Heaton-Harris ho get lost, and rightly so. Read More \nThom Brooks, dean of Durham Law School, set the tone when he stated: “Let me make something clear. I will NOT be answering his request. We’re a university. Not thought police.” \nOther North East universities also refused to respond. \nOur universities are pretty robust institutions. They can defend themselves. \nAnd they can cope with a little bit of flack. \nThe Daily Mail newspaper has been accused of censorship by inviting students to get in touch and name tutors who are a little too anti-Brexit . \nNo doubt the aim is to write a hostile piece about lefty academics. And this is indeed ridiculous (not least because it’s hardly news). \nBut our universities can take a bit of flack. \nThey’re not above criticism - and they’re quite capable of standing up for themselves. Like us on Facebook ", "external_links": [], "published": "2017-10-29T07:00:00.000+02:00", "crawled": "2017-10-29T07:32:23.029+02:00", "highlightTitle": ""}