{"organizations": [], "uuid": "a4a89044c079893afbf9b5358a8124dd23b0304e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13760086.ece/ALTERNATES/s1200/JS111289979.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/heres-no-deal-brexit-disaster-13760047", "country": "GB", "domain_rank": 21960, "title": "Here's why a 'no-deal Brexit' will be a disaster for the North East's economy, businesses and people", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-15T10:00:00.000+03:00", "replies_count": 0, "uuid": "a4a89044c079893afbf9b5358a8124dd23b0304e"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/heres-no-deal-brexit-disaster-13760047", "ord_in_thread": 0, "title": "Here's why a 'no-deal Brexit' will be a disaster for the North East's economy, businesses and people", "locations": [], "entities": {"persons": [{"name": "colin lawther", "sentiment": "none"}, {"name": "hammond", "sentiment": "none"}, {"name": "david davis", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "michel barnier", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "heathrow", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}], "organizations": [{"name": "house of commons", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "jaguar land rover", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "customs union", "sentiment": "none"}, {"name": "state", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "houses of parliament", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nPrime Minister Theresa May told the House of Commons last week that the Government was preparing for the possibility of leaving the European Union without a replacement trade deal. \nShe still hopes to get a deal, of course. \nBut some of the £250m set aside for Brexit preparations would be used to examine the option of quitting in March 2019 without one. \nAnd perhaps that’s for the best. Because there’s evidence that negotiations with the EU are going wrong. \nMichel Barnier, the French politician representing the EU in talks with the UK, last week said they were in “a state of deadlock”. EU Chief Brexit Negotiator Michel Barnier, right, and British Secretary of State David Davis make statements as they arrive at EU headquarters in Brussels on Monday, June 19, 2017 (Image: AP) \nIt means the prospect of a “no-deal Brexit” is growing more likely. \nBut this would cause enormous harm to the UK economy - to our jobs and incomes. \nFor example, carmakers such as Nissan or Jaguar Land Rover have complex supply chains, with parts bought in from across Europe. \nAt the moment, they can be transported across borders as needed, thanks to what’s known as the Customs Union. But as things stand, we leave the Customs Union once we leave the EU. \nUnless there’s a replacement agreement, it means delays and uncertainty about when things arrive, as parts would be subject to checks from officials at borders. \nThis would be a disaster for major manufacturers including carmakers. Colin Lawther, Nissan’s European senior vice president for manufacturing \nColin Lawther, a senior vice president at Nissan - which is responsible for 40,000 UK jobs - explained this to a Commons inquiry. \nHe said: “If you take the Sunderland plant as an example, we hold about a half a day’s stock inside the plant itself and then obviously that is continuously replenished. Every day we use about 5 million parts, so 5 million parts have to come into the plant.” Read More Energy price cap will help 18 million homes but not until next year - here's what it means \nHe added: “Any disruption to that supply chain is a complete disaster.” \nAnd making it clear that even a short delay would cause huge problems, he explained: “We are talking about two, three, four, six minutes a day of downtime on the production line; more than that is a disaster. \n“If you start talking about interruption of supply of parts for hours, that is completely off the scale.” An EU flag flying in front of the Houses of Parliament (Image: PA) \nCar manufacturing is a key part of the North East economy. What would happen to us if there is no trade deal? \nMr Hammond knows, but he won’t say. He told a Commons inquiry last week that the Treasury had produced a series of assessments looking at “a wide range of scenarios” and the impact on different regions as well as specific industries. Read More A senior Government advisor has criticised the delay building Heathrow's third runway \nBut he said: “We are not planning to publish this work. It is sensitive in the context of the negotiation.” \nThe Chancellor doesn’t want to admit it, but crashing out of the EU without a replacement deal would be a real disaster for the North East and its people. Like us on Facebook", "external_links": [], "published": "2017-10-15T10:00:00.000+03:00", "crawled": "2017-10-15T10:21:37.002+03:00", "highlightTitle": ""}