{"organizations": [], "uuid": "6b0b1b631fdb0767a92374aadd9d906453130576", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.birminghammail.co.uk/incoming/article13715781.ece/ALTERNATES/s1200/may-coughs.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/grant-shapps-plot-against-theresa-13727117", "country": "GB", "domain_rank": 21960, "title": "Grant Shapps plot against Theresa May will buy the Prime Minister some time", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-07T07:00:00.000+03:00", "replies_count": 0, "uuid": "6b0b1b631fdb0767a92374aadd9d906453130576"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/grant-shapps-plot-against-theresa-13727117", "ord_in_thread": 0, "title": "Grant Shapps plot against Theresa May will buy the Prime Minister some time", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "grant shapps", "sentiment": "negative"}, {"name": "michael green", "sentiment": "none"}, {"name": "michael fabricant", "sentiment": "none"}, {"name": "anne-marie trevelyan", "sentiment": "none"}, {"name": "laura pidcock", "sentiment": "none"}, {"name": "shapps", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}], "locations": [{"name": "maidenhead", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}], "organizations": [{"name": "bbc", "sentiment": "none"}, {"name": "cabinet", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Grant Shapps plot against Theresa May will buy the Prime Minister some time News of a plot against Prime Minister Theresa May will strengthen her position but only for a while Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nNothing helps rally the troops more than giving them a good villain to unite against. \nAnd Tory MP Grant Shapps has found himself cast into the role of villain. \nHis attempt to lead a coup against Theresa May prompted a wave of public support for the Prime Minister, as MPs lined up to condemn his actions. \nIt emerged on Friday that he had gathered support from about 30 Conservative MPs who want a new leader. \nIt seems that news of the plot was actually leaked by Government whips - the people charged with strengthening Mrs May’s position. \nMr Shapps told the BBC’s Today programme: “I’m slightly surprised that the whips briefed the newspapers about it.” \nThey had their reasons. By making news of the plot public, they put pressure on MPs to take sides. \nAnd at this stage, many Tories are unwilling to force Mrs May out. \nThey are also reluctant to be seen to side with Mr Shapps, whose behaviour appears disloyal. Read More Theresa May condemns Laura Pidcock as an example of a 'big problem' in British politics \nMr Shapps has a difficult reputation. He quit as Conservative Party Chairman after it emerged he had known about claims of bullying among young activists. He also admitted to having a second job as a web entrepreneur, under the pseudonym Michael Green. \nPutting him in the spotlight focused attention briefly away from Mrs May’s disastrous speech to the Conservative conference, where she suffered from a cough, was interrupted by a comedian handing her a P45 and letters fell off the stage backdrop behind her. \nOne backbench MP, Michael Fabricant, said on Twitter that he “wouldn’t buy a used car” from Mr Shapps. \nAnne-Marie Trevelyan, Conservative MP for Berwick-upon-Tweed in Northumberland , is a firm backer of Theresa May. She said the Prime Minister was “ideally suited” to lead the country in the ongoing Brexit talks. \n“It is detailed, it is gritty, it is a hard negotiation and she is very good at that. \n“As far as I’m concerned, while she had a cold and lost her voice she certainly hasn’t lost the skills she’s always had.” \nAnd she pointed out that Mrs May had set out plans to tackle big domestic issues such as improving mental health services and providing housing. \n“We want to crack on and get on with it. And it would be nice if some people who seem aggrieved that they re not in government at the moment could get behind her.” Read More The three reasons why Theresa May's big conference speech was a disaster \nMrs May insisted she was carrying on, when she spoke at her Maidenhead constituency last week. \nShe told reporters: “Now what the country needs is calm leadership, and that’s what I am providing with the full support of my Cabinet.” \nStill, she may not be out of the woods yet. \nVery few Conservative MPs want Mrs May to lead their party into the next general election. They assume she will resign before then. \nAnd there are some who agree with Mr Shapps that the best thing for the party would be if she goes now. \nTheir theory is that the Conservatives can’t begin to sort out their any problems until they have a new leader, and the sooner they start that task the better. \nMrs May’s opponents realise they are in the minority and need to convince colleagues. \nTory whips have made their job harder by bringing the conspiracy out into the open. \nBut the plotters won’t give up. They think forcing Mrs May out is the only way to save their party. Like us on Facebook", "external_links": [], "published": "2017-10-07T07:00:00.000+03:00", "crawled": "2017-10-07T07:17:49.002+03:00", "highlightTitle": ""}