{"organizations": [], "uuid": "067ebf2ff97736416b9af5374e68e0120a7ba554", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article682865.ece/ALTERNATES/s1200/2014-stormPNG.png", "site_section": "http://www.devonlive.com/rss.xml", "section_title": "devonlive - frontpage", "url": "http://www.devonlive.com/news/devon-news/government-urged-find-30million-cut-682836", "country": "US", "title": "Government urged to find £30million to cut rail journey times through Devon", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-26T11:57:00.000+03:00", "replies_count": 0, "uuid": "067ebf2ff97736416b9af5374e68e0120a7ba554"}, "author": "Daniel Clark", "url": "http://www.devonlive.com/news/devon-news/government-urged-find-30million-cut-682836", "ord_in_thread": 0, "title": "Government urged to find £30million to cut rail journey times through Devon", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "News Government urged to find £30million to cut rail journey times through Devon “It’s bizarre that with some services you have to look at the weather forecast and the shipping forecast.” Share Click to play Tap to play The video will start in 8 Cancel Play now Comments \n£30million in next month’s Budget should be committed to cut the rail journey from Plymouth to Exeter by three minutes, Labour MP Luke Pollard told a debate in Parliament on Wedneday. \nLeading a Westminster Hall debate, Mr Pollard also called on the Government to make a long-term investment to reduce journey times from Plymouth to London from three hours 30 minutes to two hours 15 minutes. \nMr Pollard, Labour MP for Plymouth Sutton and Devonport, said the Devon Banks – steep inclines between Plymouth and Exeter – were being repaired next year. Read More Devon trains could run faster thanks to 'spot electrification' Labour MP Luke Pollard \nWhile this work is going on the track could be straightened, rails replaced and the speed limit lifted from 60mph to 75mph, cutting three minutes off the Plymouth-Exeter journey, he said, as the Plymouth Herald reports. \nTorbay MP Kevin Foster referring to the vulnerable Dawlish/Teignmouth section, and said: “It’s bizarre that with some services you have to look at the weather forecast and the shipping forecast.” Read More Iconic Dawlish Warren railway carriages holiday park hopes to open all year round A train on the sea-battered Dawlish line \nGary Streeter said successive governments had failed to give the Westcountry the investment it deserves. “It’s another slap in the face,” he said. \nMr Streeter said he was disappointed the Government was not formally responding to the 20-year plan drawn up by the Peninsula Rail Task Force. \nHe said the onboard connectivity was seen as even more crucial than journey times and called for the new Global System for Mobile communications – Railways to be installed on Westcountry trains. “We want this now,” he said. “We want it in 2018.” Read More 'Beast of Bodmin big cat' - multiple sightings reported in the last week \nBen Bradshaw added: “With the storm clouds of Brexit gathering ... we’re running out of time to get meaningful investment in our infrastructure.” \nHe said that the line was cut at Cowley Bridge twice in the three years before the 2014 Dawlish crisis but there was still no funding allocated “We are facing another risk that the line will be flooded there.” Like us on Facebook ", "external_links": [], "published": "2017-10-26T11:57:00.000+03:00", "crawled": "2017-10-26T12:16:55.009+03:00", "highlightTitle": ""}