{"organizations": [], "uuid": "35cb7e74cf3988aaed7217f531888909637e9147", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13792713.ece/ALTERNATES/s1200/Hunter-Kelly-restructurinmg-partner-at-EY-in-Yorkshire.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/warning-signs-north-east-economy-13791219", "country": "GB", "domain_rank": 21960, "title": "Warning signs on North East economy highlighted in two new reports", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-23T02:01:00.000+03:00", "replies_count": 0, "uuid": "35cb7e74cf3988aaed7217f531888909637e9147"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/warning-signs-north-east-economy-13791219", "ord_in_thread": 0, "title": "Warning signs on North East economy highlighted in two new reports", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "none"}, {"name": "hunter kelly", "sentiment": "none"}, {"name": "richard halstead", "sentiment": "none"}, {"name": "philip hammond", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "yorkshire", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north", "sentiment": "none"}, {"name": "midlands", "sentiment": "none"}], "organizations": [{"name": "ey", "sentiment": "none"}, {"name": "bank of england", "sentiment": "none"}, {"name": "eef", "sentiment": "none"}, {"name": "yorkshire", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Warning signs on North East economy highlighted in two new reports Reports by EEF and EY signal problems in the regional economy due to Brexit uncertainty Share Hunter Kelly, restructuring partner at EY in Yorkshire (Image: handout) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nWarning signs on the state of the region’s economy have been raised in two new surveys being published today. \nA report by the manufacturers’ organisation EEF has shown that investment by North East manufacturers has been hit by the continuing political uncertainty, while accountancy group EY has highlighted a big leap in profits’ warnings being issued in the region in the third quarter of 2017. \nAccording to the EEF/Santander Annual Investment Monitor, while demand conditions should be spurring on investment, a third of companies are only investing to satisfy current plans and waiting for clarity before thinking long term, while 13% of firms are holding off investment altogether. \nThe organisation has now called on Chancellor Philip Hammond to take measures to boost investment and productivity in his November Budget, saying that companies are not investing in improving their production capacity. \nRichard Halstead, membership engagement director for EEF in the North, said: “Manufacturers have navigated a panoply of demand-related challenges in recent years, which have taken a toll on the sector’s appetite and ability to invest. \n“With global demand on the up conditions should be ripe for industry to make new investments in capacity and productivity enhancing technology. But Brexit means the future outlook for investment is not clear cut. Richard Halstead, Midlands region director of the EEF (Image: Publicity Picture) \n“Political uncertainty is adding to the hurdles of cost and lack of skills in holding back spending on automation technology. The forthcoming Budget can at least start to address the latter of these challenges, starting with an ambitious industrial strategy that tackles barriers to investment head on and ensures UK manufacturers are equipped to compete for the future.” \nMeanwhile, EY has reported 14 profit warnings from listed businesses in the North East and Yorkshire in Q3 of 2017, up from eight in the same period last year. \nProblems were seen in a number of sectors, but most noticable in support services and retail. \nHunter Kelly, EY’s head of restructuring for the North East and Yorkshire, said: “Summer brought more mixed fortunes for listed businesses across Yorkshire and the North East with the contrast between growth from overseas markets and the slowing UK economy increasing. \n“Many businesses besieged by pricing pressures before Brexit, are also now feeling the effects of rising domestic uncertainty and rising costs. A rise in multiple warnings reflects the difficulties in predicting what the trends are in such an uncertain economic climate, for example, will the Bank of England raise interest rates? \n“The warnings were due to a number of reasons from contract delays to pricing and cost pressures to lower demand from UK consumers. Not all companies in the same sector have faced the same issues, which highlights the difficulties in determining whether there is an overall trend.” \n​On a national basis, pricing and cost pressures feature in 25% of all profit warnings so far in 2017, compared with 18% in 2016. According to the EY report, these pressures are especially apparent on the consumer side of the economy. Like us on Facebook ", "external_links": [], "published": "2017-10-23T02:01:00.000+03:00", "crawled": "2017-10-23T08:35:51.012+03:00", "highlightTitle": ""}