{"organizations": [], "uuid": "63c86cec25fca9686728db65e97b766643ee68f4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12030599.ece/ALTERNATES/s1200/JS102061068.jpg", "site_section": "http://news.google.com/news?cf=all&ned=uk&hl=en&output=rss", "section_title": "Top Stories - Google News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/north-east-news-live-latest-13749958", "country": "US", "domain_rank": 21960, "title": "North East news LIVE: Latest breaking news, sport, weather, traffic and travel - ChronicleLive", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-12T08:37:00.000+03:00", "replies_count": 0, "uuid": "63c86cec25fca9686728db65e97b766643ee68f4"}, "author": "", "url": "http://www.chroniclelive.co.uk/news/north-east-news/north-east-news-live-latest-13749958", "ord_in_thread": 0, "title": "North East news LIVE: Latest breaking news, sport, weather, traffic and travel - ChronicleLive", "locations": [], "entities": {"persons": [{"name": "hazel macrae", "sentiment": "none"}, {"name": "hammond", "sentiment": "none"}, {"name": "catherine mckinnell", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "hazel", "sentiment": "none"}, {"name": "daniel blake", "sentiment": "none"}], "locations": [{"name": "newcastle road", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "hexham road", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "derwenthaugh road", "sentiment": "none"}, {"name": "wessington way", "sentiment": "none"}], "organizations": [{"name": "newcastle north", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "house of commons treasury committee", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}, {"name": "cross bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "To get breaking news sent straight to your phone, download our app here 7:36 Chris Knight Diame ready for PL opportunity \nThe 30-year-old has yet to start a top-flight match for the Magpies, but has made five substitutes appearances for United this term, as Ayoze Perez has established himself as the Magpies’ first-choice No 10. Mo Diame (Image: Newcastle United) \nDiame was involved in a training-ground bust-up with captain Jamaal Lascelles last week, which left Jonjo Shelvey - who was trying to act as a peacemaker - with a broken finger on his left hand. \nHowever, Rafa Benitez is believed to have sat down with both Diame and Lascelles, who have since made up, and all parties are now keen to move on. \nAnd Diame, speaking before the training-ground incident took place, insists he is determined to grasp his starting opportunity once it arrives. 7:30 Chris Knight Foodbank donations \nAttention Newcastle United fans - here’s a nice little reminder of just how much your donations mean to the city’s West End Foodbank. 7:25 Chris Knight Little Mix review \nLittle Mix were in town at Newcastle’s Metro Radio Arena last night, and here’s a snippet of what our reviewer Simon Duke had to say about the show: \nEvery time they come back to Newcastle, Little Mix do so having seen their career reach another peak but this time round there was two big trump cards under their belts - their biggest selling album to date and their first ever Brit. \nAnd the group who won X Factor nearly six years ago now - what?! - are triumphantly riding on the crest of a very successful wave. (Image: Lewis Fenwick) \nFresh from supporting Ariana Grande in the US and their own outdoor Summer Shout Out tour, the fierce quartet are looking and sounding better than ever. \nTheir likeability, impressive vocals and fine stage presence is what helped them to victory in 2011 and while outfits might leave a little less to the imagination these days, all three qualities are thankfully still there in abundance but with added fierceness and finesse. \nOpening at the Metro Radio Arena in emphatic style with the punchy Power; Jade, Perrie, Jesy and Leigh-Anne delivered yet another polished and pleasing set, which must be harder to pick songs for with each new tour, given the growing list of smash hits they’re accumulating. 7:18 Chris Knight How will Brexit affect the North East? \nHe said experts had produced models showing how different regions would be affected when the UK leaves the European Union. \nBut the findings will not be published because they are commercially sensitive, he said. \nMr Hammond was quizzed by Newcastle North MP Catherine McKinnell, a member of the House of Commons Treasury Committee. \nHe told her the Treasury was “constantly using” a model it had developed to look at how regions would be affected by Brexit, as well as how different sectors of the economy would benefit or suffer. \nShe told him: “You must understand there is a public interest in seeing these assessments and understanding the implications of them.” 07:12 Traffic \nHere’s a quick look at the roads this morning: Congestion is starting to clear on the A1231 Wessington Way has been cleared after an accident. Heavy traffic is being reported on the A694 Derwenthaugh Road at Hexham Road and Shibdon Road Roundabout. Traffic is now moving well on the A167 Newcastle Road headed southbound around A690 Neville’s Cross Bank. 07:04 Why is Hazel's victory so important? \nHer story provoked outrage and touched a nerve with thousands across the country. \nHazel Macrae, a 62-year-old woman - blind since birth - told she was fit to work. \nShe came to the Chronicle, heartbroken, after the Department for Work and Pensions decided she could - she should - seek employment. \nHer story echoed that of the award-winning movie I, Daniel Blake which shows how the welfare system is affecting some of the most vulnerable in our North East community.", "external_links": [], "published": "2017-10-12T08:37:00.000+03:00", "crawled": "2017-10-12T09:20:21.012+03:00", "highlightTitle": ""}