{"organizations": [], "uuid": "12805e0792a242ad09147d02a28a045761921c43", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article11588562.ece/ALTERNATES/s1200/JS81937054.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/conservative-mp-anne-marie-trevelyan-13702332", "country": "GB", "domain_rank": 21960, "title": "Conservative MP Anne-Marie Trevelyan admits her own son may not vote for her", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-02T10:00:00.000+03:00", "replies_count": 0, "uuid": "12805e0792a242ad09147d02a28a045761921c43"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/conservative-mp-anne-marie-trevelyan-13702332", "ord_in_thread": 0, "title": "Conservative MP Anne-Marie Trevelyan admits her own son may not vote for her", "locations": [], "entities": {"persons": [{"name": "anne-marie trevelyan", "sentiment": "negative"}, {"name": "mrs trevelyan", "sentiment": "none"}, {"name": "johnson", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "andrew marr", "sentiment": "none"}, {"name": "boris johnson", "sentiment": "none"}, {"name": "trevelyan", "sentiment": "none"}, {"name": "heseltine", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}], "locations": [{"name": "northumbria", "sentiment": "none"}, {"name": "florence", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "france", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "bbc", "sentiment": "none"}, {"name": "cabinet", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "cancel play", "sentiment": "none"}, {"name": "the sun", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nConservative MP Anne-Marie Trevelyan has admitted she isn’t sure whether her own son would vote for her. \nThe Northumbria MP made the comment as Conservatives gathered in Manchester for their annual conference, where one of the themes is how to win back young voters. \nShe also backed Theresa May, amid speculation over how long she can carry on as Prime Minister. \nIt follows June’s general election, in which Labour gained 30 seats partly because of support from younger voters. \nThe Tories are announcing a series of policies designed to appeal to the young, including raising the threshold for tuition fee repayments, which means many graduates will save up to £360 a year. \nSpeaking to the BBC’s Sunday Politics, Mrs Trevelyan said: “My son is 18, missed being able to vote in the election this year by five days, which is probably just as well because he might not have voted for his mother, but the reality is that the young vote is split.” \nShe said younger voters may oppose Brexit but it was important for the Conservative Party to explain what Brexit really meant. Read More Conservative Party Conference 2017: What to expect from Manchester \n“Some of the arguments that I had from young voters who said well I won’t be able to fly to France anymore, you know these misconceptions that the Remain campaign seem to feed at the time were so frustrating because that is not what being outside the EU means. It’s just a different relationship in terms of trade and security and control of our borders.” \nMrs Trevelyan also insisted the Cabinet was united behind Mrs May, who she described as her political mum. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \n“As a Brexiteer and as an absolute supporter of the Prime Minister, I mean she’s so sensible about things, I’ve always thought of her politically a bit like my political mum. \n“She’s been a leader as a female politician for me always. She’s just not pushed around so she will move the Brexit debate forwards in a way that gets us the steady outcome that we need.” \nMrs May’s leadership was in the spotlight as the conference began. She delivers her speech to the party faithful on Wednesday. \nForeign Secretary Boris Johnson gave an interview to The Sun in which he set out four red lines lines in the Brexit negotiations, including a demand that the transition period should not last a “second longer” than two years. \nIt was seen as the second time he’s undermined the Prime Minster, after he wrote a 4,000-word piece on Brexit ahead of her major speech in Florence. Read More Here are the policies announced at the Conservative conference \nMr Johnson is also reported to have told allies he believes Mrs may will be gone “in a year” and he is planning a bid to replace her. \nBut Mrs May dismissed suggestions she should sack Mr Johnson, when she was interviewed by BBC journalist Andrew Marr. \nTory grandee Lord Heseltine said her failure to dismiss Mr Johnson was a sign of her weakness. Like us on Facebook ", "external_links": [], "published": "2017-10-02T10:00:00.000+03:00", "crawled": "2017-10-02T10:36:05.043+03:00", "highlightTitle": ""}