{"organizations": [], "uuid": "a7f61f60b8445ba20a2924bfd5b788ee81866f2a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article680740.ece/ALTERNATES/s1200/Roundup.jpg", "site_section": "http://www.middevongazette.co.uk/politics.rss", "section_title": "devonlive - News", "url": "http://www.devonlive.com/news/devon-news/gardeners-could-face-ban-glyphosate-680724", "country": "GB", "title": "Gardeners could face ban on glyphosate weedkillers", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-25T18:32:00.000+03:00", "replies_count": 0, "uuid": "a7f61f60b8445ba20a2924bfd5b788ee81866f2a"}, "author": "Keith Rossiter", "url": "http://www.devonlive.com/news/devon-news/gardeners-could-face-ban-glyphosate-680724", "ord_in_thread": 0, "title": "Gardeners could face ban on glyphosate weedkillers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Gardeners could face ban on glyphosate weedkillers European Parliament backs ban but member states have final say Share The popular weedkiller Roundup contains Glyphosate Share \nThe European Parliament has backed a full ban on glyphosate-based herbicides by December 2022 and immediate restrictions on the use of the substance. \nThe chemical is used on many Westcountry farms, and is the active ingredient of Roundup, one of the most common garden weedkillers. \nIts licence runs out on December 17, and MEPs opposed the European Commission’s proposal to renew the controversial herbicide licence for ten years. \nInstead, MEPs said the EU should draw up plans to phase out the substance, starting with a complete ban on household use and a ban in use for farming when biological alternatives such as “integrated pest management systems” work well for weed control. \nThe parliament’s vote was non-binding, and member states represented on the standing committee on plant animal food and feed put off making a decision at their meeting yesterday. \nThe European Commission is planning another meeting and a revised proposal with a shorter authorisation period of three years in order to get a qualified majority. \nThe EU risk assessment process before renewing the substance’s licence was mired in controversy, as the UN cancer agency and EU food safety and chemicals agencies came to different conclusions. Poppy fields are becoming common again as weedkiller use falls (Image: John Giles/PA) \nSouth West MEP Molly Scott Cato, who sits on the Agriculture Committee, said: “We don’t have to smother our food in toxins; alternative approaches to tackling weeds and pest exist and are being successfully used across Europe. \n“We need to support farmers who are turning to chemical-free methods by offering financial support and incentives, training and information sharing mechanisms. If Michael Gove’s green Brexit means anything it has to mean supporting a ban on glyphosate and funding moves towards chemical-free agriculture.” \nJulie Girling, a former Conservative MEP who was suspended from her party as a Brexit rebel, warned that the ban ignored “robust scientific evidence” and risked undermining the EU’s regulatory approval process for herbicides. “Ignoring evidence because politicians do not agree with it is not an option. Farmers rely on glyphosate and the uncertainty surrounding its renewal, which exploits emotional judgment for political gain, won’t go away if it’s only approved for a further five years,” she said. \nThe NFU said it was disappointed that no agreement had been reached “despite the overwhelming weight of science and evidence”. \nGuy Smith, NFU vice-president, said: “We’re disappointed that member states failed to reach agreement ... although we welcome the fact the UK continues to support the full reauthorisation of glyphosate. Read More People encouraged to build their own ‘bee hotels’ after they prove successful at Devon zoo \n“Glyphosate helps to protect soil and cut greenhouse gas emissions by reducing the need for ploughing, and it enables farmers to grow crops that help produce safe, affordable, high quality British food.” \nLaura MacKenzie, Soil Association Head of Policy, said: “Today’s vote shows that major public health and environmental concerns around glyphosate have not been resolved, and this controversial weed killer’s days are clearly numbered. Whilst we wait for new Commission proposals, the UK Government should immediately ban spraying glyphosate in public places such as playgrounds and parks, and on food crops prior to harvest. Read More The bad advice putting Cornwall homeowners at risk from Japanese Knotweed \n“Not all farmers use glyphosate - it has never been permitted in organic agriculture, and an increasing number of non-organic farmers are exploring alternative methods of managing weeds. This is partly due to recent research suggesting glyphosate could be causing significant harm to soil health and fertility. We need to build on the excellent work being done by farmers and researchers to develop alternatives to glyphosate so that farm businesses can continue to thrive if a decision is reached by EU countries to phase-out its use, whether on grounds of human health risks or environmental harm.” Like us on Facebook", "external_links": [], "published": "2017-10-25T18:32:00.000+03:00", "crawled": "2017-10-25T18:47:36.000+03:00", "highlightTitle": ""}