{"organizations": [], "uuid": "8cec9936c5b9c3f6bbf577cf084d407b4e761424", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article13663569.ece/ALTERNATES/s1200/British-Prime-Minister-Delivers-Landmark-Brexit-Speech.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/conservative-party-conference-2017-what-13693371", "country": "GB", "domain_rank": 21960, "title": "Conservative Party Conference 2017: What to expect from Manchester", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-01T07:00:00.000+03:00", "replies_count": 0, "uuid": "8cec9936c5b9c3f6bbf577cf084d407b4e761424"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/conservative-party-conference-2017-what-13693371", "ord_in_thread": 0, "title": "Conservative Party Conference 2017: What to expect from Manchester", "locations": [], "entities": {"persons": [{"name": "ben houchen", "sentiment": "none"}, {"name": "opperman", "sentiment": "none"}, {"name": "david davis", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "andy street", "sentiment": "none"}, {"name": "george osborne", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "northumberland tory", "sentiment": "none"}, {"name": "houchen", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "anne-marie trevelyan", "sentiment": "none"}, {"name": "tom watson", "sentiment": "none"}, {"name": "guy opperman", "sentiment": "none"}, {"name": "osborne", "sentiment": "none"}, {"name": "boris johnson", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}], "locations": [{"name": "manchester", "sentiment": "none"}, {"name": "getty images europe", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "west midlands", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "tees valley", "sentiment": "none"}], "organizations": [{"name": "manchester", "sentiment": "none"}, {"name": "conservative arts and creative industries network", "sentiment": "none"}, {"name": "tories", "sentiment": "none"}, {"name": "northern powerhouse", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "berwick", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}, {"name": "hexham", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "manchester central", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nConservatives need to find a way to appeal to young people, Prime Minister Theresa May has admitted. \nAnd this will be one of themes of the Conservative conference in Manchester this week. \nIn a pre-conference interview, Mrs May said: “I think there is a generation out there who feel that they’re going to be worse off than their parents. And what we want as Conservatives is that people should be able to see a brighter future for their children.” \nLabour leader Jeremy Corbyn’s success in appealing to younger voters is seen as one of the reasons the Tories lost their majority in June’s General Election while Labour gained 30 seats. British Prime Minister Theresa May (Image: Getty Images Europe) \nHere we look at what to expect from the Tory conference, which runs from October 1-4. \nConference to become a leadership contest \nConservatives are still in power. But the conference will be something of a post-mortem, as Tory MPs and activists try to figure out what went wrong. \nAnd the question of the party leadership will be on everyone’s minds. \nIt’s widely assumed that Theresa May will stand down at some point before the next election, perhaps shortly after Brexit takes place in March 2019. \nConservatives will naturally be thinking about what happens after that. It means speeches by potential leadership candidates, such as Home Secretary Amber Rudd, Foreign Secretary Boris Johnson or Brexit Secretary David Davis, will be watched particularly closely. Police and security at Manchester Central before the Conservative Party conference (Image: MANCHESTER EVENING NEWS) \nTheresa May wants to return to the theme of social justice \nThe highlight of the conference will still be on Wednesday, when the Prime Minister delivers her speech. \nHer theme will be “building a country that works for everyone”. \nMrs May hopes to show that there is more to her Government than Brexit. \nWhen she first became Prime Minister, in July 2016, she delivered a speech promising to fight “the burning injustices” of modern Britain. \nThis included the difference in living standards between the rich and the poor, the fact that women earn less than men and the difficulty young people face in buying a house. \nAnd the Prime Minister will attempt to show that she hasn’t forgotten about this promise. Foreign Secretary Boris Johnson (Image: Getty Images Europe) \nHow the North will be represented \nSocial justice will also be the theme of a debate involving Guy Opperman, MP for Hexham in Northumberland. Read More Outspoken new North East MP has 'quite a future' in politics, says Tom Watson \nHe will speak at a fringe event organised by think tank Bright Blue titled “From burning injustice to social justice”. \nMr Opperman will also take part in fringe events looking at changes to the pensions system, in his role as a Pensions Minister. \nAnd fellow Northumberland Tory, Berwick MP Anne-Marie Trevelyan, will take part in a debate about the sort of agriculture and forestry policies the UK should have after Brexit. \nBut they aren’t the only people who want to talk about the North during the conference. \nBen Houchen, the Conservative elected as mayor of Tees Valley earlier this year, will join former Chancellor George Osborne and others for a major debate on the Northern Powerhouse. \nMr Osborne was the architect of the policy, which was designed to improve the economy of the North of England, largely by improving transport links between the major cities \nIt will be a chance for him to comment on how the Government has handled the Northern Powerhouse idea since he left the Government. Read More The key messages from Jeremy Corbyn's speech at Labour's annual conference \nMr Houchen will also take part in a debate looking at how mayors can help big cities succeed, where he will be joined by West Midlands mayor Andy Street. \nRight-wing political magazine The Spectator is holding a debate on whether the Northern Powerhouse policy can still deliver. \nAnd a body calling itself the Conservative Arts and Creative Industries Network will hold a debate on the Northern Powerhouse and the creative industries. Like us on Facebook ", "external_links": [], "published": "2017-10-01T07:00:00.000+03:00", "crawled": "2017-10-01T09:45:30.000+03:00", "highlightTitle": ""}