{"organizations": [], "uuid": "f2553289f407f28d62080e7fec855ec4e7baffc7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://i3.leicestermercury.co.uk/incoming/article644000.ece/ALTERNATES/s1200/35293220.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/news/business/clifton-packaging-boss-shahid-shiekh-643995", "country": "US", "domain_rank": 48128, "title": "Clifton Packaging boss Shahid Shiekh wants to make Uganda - ‘Pearl of Africa’ - shine brightly again - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.985, "site_type": "news", "published": "2017-10-18T11:53:00.000+03:00", "replies_count": 0, "uuid": "f2553289f407f28d62080e7fec855ec4e7baffc7"}, "author": "Tom Pegden", "url": "http://www.leicestermercury.co.uk/news/business/clifton-packaging-boss-shahid-shiekh-643995", "ord_in_thread": 0, "title": "Clifton Packaging boss Shahid Shiekh wants to make Uganda - ‘Pearl of Africa’ - shine brightly again - Leicester Mercury", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Shahid (left) had a private audience with the president of Uganda Yoweri Museveni Share Comments \nThe boss of one of Leicestershire’s most successful manufacturers wants to share his expertise with entrepreneurs in Africa. \nShahid Sheikh OBE, who runs Clifton Packaging, had a private audience with the Uganda president Yoweri Museveni to discuss sharing his business knowledge with companies in the East African nation. \nMr Sheikh said the country – which has been tainted by accusations of corruption and human rights abuses – needs to open up to the outside world to attract inward investment and support. \nHe was born in Uganda, but like many of his countrymen left with his family during the oppressive Idi Amin regime. \nHe and his three brothers set up Clifton Packaging in 1981 and it has become a major manufacturer of flexible packs for products ranging from baby foods to rice and ready meals. (Image: Will Johnston) \nIt was named Company of the Year at the 2016 Leicester Mercury Business Awards. \nMeanwhile, Clifton Packaging Group has issued annual accounts showing turnover grew marginally last year to £19.1 million, while pre-tax profits were down fractionally at £2.6 million. \nThe company’s annual report said uncertainties created by the Brexit vote – and subsequent strengthening of the euro – meant investment had to be put on hold last year “which had an impact on planned growth”. \nHowever, the business, which has more than 100 staff, said it was investing £2 million this year to meet rising demand for its products. \nMr Sheikh – a finalist in the Institute of Directors national director of the year awards and national Asian Achievers Awards – said he was invited to meet Mr Museveni a week after speaking on a panel at a Ugandan business convention in London. \nHe said: “The president already knows us from past meetings and he’s a ‘do-er’ not a ‘talker’, so within an hour of him landing in London we had a call inviting us to meet him. Clifton packaging was named Leicester Mercury Business of the Year in 2016 \n“He has given me a personal invitation to visit Uganda. There are huge opportunities there, but so much red tape. \n“I told him Uganda needed to up its game to embrace businesses like ours. \n“Uganda used to be called the ‘Pearl of Africa’ and we want to make that shine brightly again with knowledge and transfer programmes. \n“I’m more than happy to go over there to help build packaging companies and help educate their business people. Read More Pharmaceuticals boss Dr Nik Kotecha wins IoD accolade \n“Uganda is brilliant and has 40 million people. The opportunities are huge within the food sector. \n“They have got minerals and crops that people within the UK would cry out for, but they are not good at adding value. \n“A lot of people are scared to enter Africa and dealing with people is a lot harder, but this is about sowing the seeds for the future.” Read More Leicester City star Christian Fuchs dreams of cracking USA with #NoFuchsGiven clothes range \nMr Sheikh said turnover at Clifton was expected to grow this year. \nHe said: “We are putting £2 million into more printing and converting machines and we could be taking on 20-25 more people in the next year.” \nHe said he hoped to visit Uganda next month. Like us on Facebook ", "external_links": [], "published": "2017-10-18T11:53:00.000+03:00", "crawled": "2017-10-19T02:49:25.001+03:00", "highlightTitle": ""}