{"organizations": [], "uuid": "c8f32896b8a7913a2725ec267154328afc7562d9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article12772504.ece/ALTERNATES/s1200/KOR_NJL_170317stan_06.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13771827", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Housebuilder Bellway booms as sales top £2.5bn sales, plus latest news", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-17T10:35:00.000+03:00", "replies_count": 0, "uuid": "c8f32896b8a7913a2725ec267154328afc7562d9"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13771827", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Housebuilder Bellway booms as sales top £2.5bn sales, plus latest news", "locations": [], "entities": {"persons": [{"name": "jason honeyman", "sentiment": "none"}], "locations": [], "organizations": [{"name": "housebuilder bellway", "sentiment": "negative"}, {"name": "bellway", "sentiment": "negative"}, {"name": "group", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford North East science centre gets £8.3m backing to develop next generation of treatments \nA North East centre that aims to pioneer medical treatments of the future has received £8.3m in funding. \nThe Centre for Process Innovation (CPI) has received the grant from the Local Growth Fund run by the North East LEP, with work on its Centre for Healthcare Photonics at Sedgefield’s NETPark, due to start this month so that it can open next December. \nThe centre will be a world-leading facility in photonics – a rapidly-growing area of healthcare in which light is used to diagnose and treatement a range of illnesses. \nIt is hoped the centre will help turn academic research and early stage inventions in the field into both practical treatments for patients and commercial businesses operating in the field. Dr Tom Harvey, strategic programmes manager at CPI, said: “This new centre will provide the infrastructure and support for companies to bring to market their highly innovative products, which have the potential to be cost-effective and provide improvements to patient care. \n“We will be looking at applications spanning the full range of healthcare settings, from hospitals and GPs through to home-based care,” said \nHans Moller, innovation director at the North East LEP, said: “This is an exciting time for the life sciences industry and we’re thrilled that the North East will once again be leading the way in the field with the National Centre for Healthcare Photonics, which will allow our region’s exceptional innovation expertise to flourish.” CGI of new centre for photonics at Sedgefield (Image: CPI) 9.23 Coreena Ford Airbus snaps up majority stake in Bombadier C Series jets \nAirbus has acquired a majority stake in Bombardier’s C Series aircraft programme, the companies have announced. \nThe move has been hailed as a “positive step forward” by business secretary Greg Clark and comes after the US Government proposed a 300% duty on exports of the planes to the US amid an international trade dispute.] \nDUP leader Arlene Foster said it was “significant news” for Bombardier, which employs more than 4,000 people at its Belfast factories and is due to begin delivering a blockbuster order for up to 125 new C Series jets to Atlanta-based Delta Airlines next year. \nAirbus has obtained a 50.01% stake in the C Series Aircraft Limited Partnership and the deal will help improve sales. \nLast month, the US Department of Commerce (DoC) announced it would impose an interim tariff of nearly 220% on the jets - with unions warning the move could cost jobs in Belfast. A second preliminary levy of 80% has been loaded on the sales of the Canadian-based Bombardier. \nDavy Thompson, regional officer of Unite, welcomed the news. He said: “We have received assurances that this will mean that employment associated with the manufacture of C Series wings will remain in Belfast. “This deal, which will see Airbus take on responsibility for procurement, sales and marketing and customer support expertise has the potential to open the door to new markets and ensure long-term sustainability of C Series production, despite the ongoing difficulties experienced with onerous tariffs being imposed on the company by a protectionist United States. 9.20 Coreena Ford ASOS raises forecasts as profits soar \nAsos has reported a surge in full-year profits and upgraded its sales forecasts after it was boosted by a strong international performance. \nThe firm clocked a 33% rise in revenues to £1.9bn in the year to August 31, with pre-tax profits growing 145% to £80m. \nOn a constant currency basis, sales rose 27% and, stripping out exceptional items, pre-tax profits rose 26%. \nOverseas revenue rose 36% to £1.17bn, while Asos described a 16% rise in UK turnover to £698m as “solid”. \nChief executive Nick Beighton said: “It’s been a great year for Asos, with continued growth in sales and profits. “Our international performance was excellent as we reinvested foreign exchange tailwinds and benefited from our continually improving customer proposition. \n“In a competitive UK market, we achieved strong full price performance whilst further increasing market share.” \nAs a net exporter, the collapse in the value of sterling since the Brexit vote has helped the group’s international sales rocket and allowed it to plough more into price cuts. ASOS Premium satin double breasted suit jacket £55 and matching culottes £38 9.15 Coreena Ford Bannatyne Group to create 'hundreds of jobs' with £50m investment \nThe Bannatyne Group has embarked on a £50m investment drive creating “hundreds of jobs” after successfully pumping up profits. \nThe Darlington firm, owned by Dragon’s Den star Duncan Bannatyne, said its three-year overhaul will see it buy more businesses and upgrade existing health clubs with new spa facilities. \nAs part of the plan, the company will add 10,000 new items of equipment and refurbish 850,000sqft of property across its 69 health clubs and spas. \nBannatyne, which employs 3,000 people and has 200,000 members, said the move follows “strong” trading this year, building on the £11.6m of profit recorded at the end of 2016. \nThe group had planned to raise £300m by floating on the stock exchange, but pulled the plug on an initial public offering (IPO) last year. \nChief executive Justin Musgrove said: “Throughout this investment programme we will install 10,000 items of new equipment, refurbish 850,000sqft of property and bring members the most dynamic health club experience available in the UK. \n“New technology is already giving many members access to information about their fitness training, it will be extended further, with some pioneering initiatives coming in the months ahead. Our acquisition programme is also on track to deliver new facilities to the group.” Justin Musgrove CEO of the Bannatyne Group (Image: publicity) 9.00 KEY EVENT Virgin Money CEO hails bank's customer focus for bringing in new business \nThe chief executive of North East challenger bank Virgin Money has hailed the firm’s customer-focused strategy for serving up excellent third quarter results. \nIn a trading update for Q3 2017, Jayne-Anne Gadhia highlighted lifts in mortgage balances, credit card balances and deposit balances. \nThe firm has credit card balances of £2.9bn, while gross mortgage lending of £6.5bn to the end of Q3 shows the bank has a market share of 3.5%. \nMrs Gadhia said: \nOur low risk business model and customer-focused strategy continues to deliver excellent results and I am delighted with the ongoing momentum of the business. \nThe UK housing market continues to prove resilient and in a competitive mortgage market we remain focused on growing assets at the right price and quality. \nOur prime credit card business is developing as planned and, as a responsible lender, the strict and consistent application of underwriting standards supports a low and stable cost of risk as well as resilience in the future. \nEnsuring that our customers are always at the heart of our strategy has seen our overall Net Promoter Score improve to +40 in 2017, making Virgin Money one of the best-rated retail banks in the UK for customer satisfaction. I am delighted that more customers than ever before would recommend us to their friends and family. Virgin Money Chief Executive Jayne-Anne Gadhia (Image: PA) 8.55 Coreena Ford Thousands of North East firms hauled into court as they struggle to pay rising business rates \nPressure to reform the controversial system of business rates is growing after new figures showed more than 7,500 companies in the North East were summonsed for non-payment. \nThe total of 7,693 firms in Tyne and Wear, Northumberland and County Durham summonsed for non-payment of business rates in 2016-7 represents one in eight companies in the region, with North Tyneside having the highest rate of non-payment in the country at 34% of companies eligible for the payment. \nThe figures have been unveiled in a Freedom of Information request carried out by rents specialist CVS, which also revealed Middlesbrough Borough Council issued the second biggest percentage of summonses, writing to 27% of firms calling them before magistrates. \nA number of business organisations - including CBI, the North East England Chamber of Commerce and the Federation of Small Businesses - have called on the Government to reform business rates, saying their basis on property values is no longer a fair reflection of a company’s value. \nThe huge rate of businesses struggling to pay the rates will add to the reform calls, with CVS chief executive Mark Rigby now calling on Chancellor Philip Hammond to freeze 2018 business rates as part of his Autumn Budget next month, saying the economic environment is already punishing struggling businesses. \nHe said: “Brexit is driving inflation. Import prices have risen given the fall in the pound with prices rising faster than wages, causing households to ‘tighten their belts’ on spending, especially on ‘big ticket’ items. Business investment has slowed and confidence fallen. \n“Against this backdrop we already have the highest property taxes not only in Europe, but the world. The Chancellor must be bold within his upcoming Budget next month through an unprecedented stimulus of freezing rate rises in April 2018.” A pile of ten pound notes (Image: Surrey Advertiser) 8.50 What's the FTSE latest? \nThe FTSE-100 index at 8.15am was down 4.08 at 7522.89. \nThe pound at 8am was 1.3253 dollars compared to 1.3285 dollars at the previous close. The euro at 8am was 0.8873 pounds compared to 0.8890 pounds at the previous close. 8.45 Coreena Ford Hornby warns over profits as chairman disembarks \nHornby has again warned over full-year profits and the group’s chairman is to quit as the model toymaker grapples with falling revenue. \nThe Scalextric-to-Airfix business confirmed that its performance for the year to date has been “below expectations”, adding that, as part of a new strategy to maximise the value of its brands, Hornby will no longer sell large amounts of stock at a discount. \n“This, coupled with the new approach to discounting stock, means it is now clear that the shortfall is unlikely to be recouped in the current year,” Hornby said. \n“It is expected that revenue will be lower and, consequently, there will be a material impact on profitability in the current financial year.” \nNew chief executive Lyndon Davies was drafted in earlier this month and has been tasked with driving through the remaining stages of an overhaul at the troubled firm. \nHornby’s turnaround has seen it reduce product ranges and cut back on investment as part of plans to shore up the balance sheet. \nTo compound matters, interim chairman David Adams has told the Hornby board he intends to step down to take up another appointment. \nEarlier this year, Phoenix Asset Management increased its stake in Hornby to about 72%, seizing control of the firm. A Hornby Class 29 model train. The toymaker has narrowed its losses. 8.40 Coreena Ford Bear Grylls Adventure attraction set to be launched by Alton Towers owner \nThe owner of Madame Tussauds and Alton Towers has unveiled a deal to launch a Bear Grylls attraction - and to take Peppa Pig worldwide. \nMerlin Entertainments is launching a new adventure-based attraction with TV’s survival expert Bear Grylls. \nThe first Bear Grylls Adventure attraction will open in Birmingham next year. \nThe firm has also struck an agreement with Entertainment One - which owns the rights to the popular children’s cartoon character Peppa Pig - to develop new attractions and themed accommodation based on the pre-school favourite. \nHowever, the deal does not cover the UK, where there is already Peppa Pig World at Paultons Park in Hampshire under a long-standing agreement, and also excludes China. \nMerlin said the deal with Entertainment One will see the first new Peppa Pig attractions open within existing resorts in 2018, with a standalone attraction due to open in 2019. \nIt comes after Merlin last week denied takeover talks with SeaWorld following reports suggesting it had approached the group. \nDetails of the agreement come as Merlin’s latest trading figures confirmed the hit from terrorist attacks on UK attractions in the peak summer months, which left group like-for-like revenue growth almost grinding to a halt, edging up 0.3% in the 40 weeks to October 7. \nPoor weather across the UK and Northern Europe and extreme weather in Italy and Florida were also to blame. Survival expert Bear Grylls (Image: LD Communications) 8.30 KEY EVENT Bellway booms as sales reach £2.5bn, but skills shortage pressures continue \nThe strength of the new housing market shows no sign of slowing as Newcastle housebuilder Bellway reports a 14.2% lift in revenue to £2.558bn. \nThe firm built a record number of homes in the year ended July 31 2017, with the number of completions rising by 10.6% to a record 9,644 homes. \nThis significantly contributed to the increase in operating profit, which rose by 16.2% to £571.6m. \nEarnings per share has risen by 12.7% to 370.6p, paving the way for a 13% rise in the proposed total dividend per share to 122.0p. \nThe group also contracted to acquire 11,613 plots, providing a secure base to build for future growth. \nHowever, the growth in the sector is putting extra pressure on the ability to find skilled workers, prompting the launch of a new apprenticeship scheme this financial year. \nA 20th regional division is also set to be launched in the North. \nJason Honeyman, the group’s chief operating officer, said: “Given the opportunity for growth, Bellway has continued to expand its workforce, employing an average of 2,544 employees during the year, an increase of 7.5%. \n“Housebuilding has a positive net effect on the economy and we estimate that we supported 26,000 to 28,000 jobs, both directly and indirectly through subcontract labour and the Group’s supply chain. \n“Notwithstanding this growth in employee numbers, the industry continues to face a skills shortage, with the demand for labour exacerbated by ongoing growth in the sector. We implemented a number of initiatives during the year to assist with the attraction and retention of talent, including an enhanced Bellway induction programme and improvements to our core benefits. \n“In addition, recognising the longer term skills shortage, we have created a set of structured apprenticeship programmes which are due to launch in the current financial year and have continued to increase the number of apprentices and graduates within the business by 11% to 92 people . \n“Bellway has significant capacity for further volume growth, both from its existing divisional structure and as a result of its ability to open new divisions in areas of strong demand.” Bellway", "external_links": [], "published": "2017-10-17T10:35:00.000+03:00", "crawled": "2017-10-17T10:42:16.001+03:00", "highlightTitle": ""}