{"organizations": [], "uuid": "08d3b14aa32e5d53e6bae4cf27e80a72edd7aded", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13588380.ece/ALTERNATES/s1200/Brexit.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/mps-angry-way-brexit-going-13824258", "country": "GB", "domain_rank": 21960, "title": "Some MPs are angry at the way Brexit is going but they're getting what they voted for", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-29T10:00:00.000+02:00", "replies_count": 0, "uuid": "08d3b14aa32e5d53e6bae4cf27e80a72edd7aded"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/mps-angry-way-brexit-going-13824258", "ord_in_thread": 0, "title": "Some MPs are angry at the way Brexit is going but they're getting what they voted for", "locations": [], "entities": {"persons": [{"name": "kenneth clarke", "sentiment": "none"}, {"name": "anna soubry", "sentiment": "none"}, {"name": "catherine mckinnell", "sentiment": "none"}, {"name": "david davis", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "davis", "sentiment": "none"}, {"name": "chuka umunna", "sentiment": "none"}, {"name": "ian lavery", "sentiment": "none"}, {"name": "malhotra", "sentiment": "none"}, {"name": "nicky morgan", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "sarah wollaston", "sentiment": "none"}, {"name": "seema malhotra", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "westminster", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "wollaston", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "state", "sentiment": "none"}, {"name": "conservative", "sentiment": "none"}, {"name": "eu withdrawal bill", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "house", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News opinion Some MPs are angry at the way Brexit is going but they're getting what they voted for MPs who don't like the way David Davis is handling negotiations should admit they made a mistake when they voted for Article 50 Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nSome MPs appear shocked by the way the Brexit negotiations are going. \nBrexit Secretary David Davis told MPs last week that they will get a vote on any future deal with the European Union - but it might not happen until we’ve left. \nAnd he said that if they reject the deal, it just means that we’ll leave the EU anyway. \nIt provoked an angry reaction. \nBut MPs shouldn’t have been surprised. Because this is exactly what most of them (including most Labour MPs ) voted for, in February this year. \nAnd if they don’t like the results then they should have the courage to stand up and admit to making an historic mistake - and call for the decision to be reversed. \nA major row broke out in Westminster last week when Mr Davis announced on Wednesday that a vote on any future EU deal might not be held after the UK has actually left. \nHe told a House of Commons committee that he believed the EU would only finalise a deal with the UK at the last possible moment. Talks could continue right up to the day we leave - on March 29 2019, he said. \nLabour MP Seema Malhotra spotted a problem with this. The Government has promised that Parliament will get a “meaningful vote” on whether to approve a deal - so was Mr Davis saying that the vote might not happen until after Brexit takes place? \nMr Davis told her: “Yes, it could be. It can’t come before we have the deal.” Brexit secretary David Davis (Image: PA) \nThat was in the morning. \nHis comments were picked up by the media, and by a number of angry MPs. And by lunchtime, the Government’s position had changed. \nPrime Minister Theresa May told MPs she was “confident” that the EU and UK would complete their negotiations “in time for Parliament to have the vote to which we committed ourselves.” \nAnd the Department for Exiting the European Union, which Mr Davis leads, then issued a statement pointing out that the EU itself had said it hoped to get a deal agreed by October 2018. This would leave plenty of time for Parliament to hold a vote. \nSo can we now be certain that the House of Commons will get to approve a deal before Brexit takes place? \nThe answer is no. North East politician lands key role in David Davis' Brexit team \nMr Davis made this clear when he was summoned to the Commons on Thursday to try to clear up the whole mess. \nHe made a point of saying that he didn’t actually have control over when a deal will be agreed. \n“If I controlled the timetable, I would happily do so; but it is a negotiation, so I do not,” said Mr Davis. \nIn other words, it’s still possible Parliament won’t get a vote until after Brexit. \nThe dilemma is that the UK has already said it will leave the EU by March 30 2019. That date is set in stone. \nBut nothing else is. Mr Davis is simply telling the truth when he says there’s no way of knowing for sure when, or if, a deal with the EU will be agreed. \nHow did this happen? It happened because the House of Commons voted on February 8 2017 to authorise Prime Minister Theresa May to trigger Article 50 of the Lisbon Treaty (by backing the European Union (Notification of Withdrawal) Bill)- which means we leave the EU within two years. \nMPs knew full well that Mrs May would begin the process by the end of March 2017, because she had said so repeatedly. \nIn other words, they voted that the UK should leave the EU by the end of March 2019. Read More MP Ian Lavery could face new standards inquiry over greyhound revelations \nAnd they did this without any guarantee that the UK and the EU would have agreed a deal by the time Brexit takes place. \nIn fairness, 122 of the 650 MPs in the House of Commons voted against triggering Article 50. They included 52 Labour MPs - although the official Labour policy was to vote in favour. \nIt seems that some MPs are only now beginning to understand what they’ve done. \nMr Davis also made it clear that if Parliament rejects the EU deal then it would simply mean that the UK leaves without a replacement arrangement in place. \nThis seemed to come as a shock to Conservative MP Dr Sarah Wollaston , who told Mr Davis: “No deal would be a very bad deal indeed for this country. What if the House votes on the final deal and rejects it? Is the Secretary of State implying that those who voted against it would be saying that they would like to leave with no deal at all?” \nBut why was she surprised? \nParliament has already decided that we will leave the EU by the end of March 2019. And guess what - Dr Wollaston was one of the MPs who voted to do just that. \nWhat happens, then if Parliament rejects the deal? \nIn a perfect world, perhaps, Ministers could rush back to Brussels and quickly negotiate a better one, giving Parliament a chance to hold a second vote. \nBut in practice, that’s not going to happen before March 2019. \nMPs can blame Mr Davis for the timetable if they like, but they made the decision themselves. \nThere is, however, a subtext to all of this. Something going on behind the scenes, which few people want to say out loud. \nSome Brexiteers believe all this talk about a deal or no deal, or when exactly a vote will take place, is code for debate about whether Brexit should take place at all. \nThey’re absolutely right. \nThere are MPs, in both the Labour and Conservative parties, who are horrified by the damage they believe Brexit will inflict on this country. They believe voters who backed Brexit in the 2016 referendum will be deeply disappointed with the outcome. \nBut with a few exceptions, they dare not say what they really mean. \nPerhaps it’s time they did. Because the clock is ticking, and Brexit is going to take place in 17 months unless something very dramatic happens. \nThat’s not to say there won’t be more debate. On November 14, the EU Withdrawal Bill will return to the House of Commons. \nNearly 400 amendments have been submitted. Tory remainers such as Kenneth Clarke, Nicky Morgan and Anna Soubry have joined forces with Labour allies such as Ms Malhotra, Chuka Umunna and Newcastle MP Catherine McKinnell to try to change the Bill to ensure UK does not implement any withdrawal agreement until it is approved by Parliament. \nBut the EU Withdrawal Bill simply changes UK law. It doesn’t affect whether we leave the EU or not. \nIf we actually want to stay then we need go back to the EU and say we’ve changed our minds, and hope they agree to end the process of kicking us out. \nThe Liberal Democrats are willing to float this idea, saying it should be put to the British public in a referendum. \nBut even the most anxious Tory and Labour MPs are reluctant to discuss it. \nThe truth is there are only two choices open to this country. The first is to press ahead with the Article 50 process, which as a statement of fact means leaving in March 2019 regardless of whether we have a deal by that time. \nThe second is to tell the EU we want to cancel the process. \nThere’s no third option. If MPs really don’t like what’s happening now then they must have the courage to stand up and say they want to end it. Like us on Facebook", "external_links": [], "published": "2017-10-29T10:00:00.000+02:00", "crawled": "2017-10-29T10:05:27.010+02:00", "highlightTitle": ""}