{"organizations": [], "uuid": "429575fd3f27d1c3c90a309ebbe28bd2d504fd2e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://i1.devonlive.com/news/devon-news/article671333.ece/ALTERNATES/s1200/LEW_9620JPG.jpg", "site_section": "http://www.middevongazette.co.uk/cullompton.rss", "section_title": "devonlive - News", "url": "http://www.devonlive.com/news/devon-news/ann-widdecombe-brexit-boris-mogg-671342", "country": "GB", "title": "Ann Widdecombe on Brexit, Boris, Mogg, Trump, the NHS and why Anton should have replaced Bruce Forsyth on Strictly Come Dancing", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-24T03:03:00.000+03:00", "replies_count": 0, "uuid": "429575fd3f27d1c3c90a309ebbe28bd2d504fd2e"}, "author": "Lewis Clarke", "url": "http://www.devonlive.com/news/devon-news/ann-widdecombe-brexit-boris-mogg-671342", "ord_in_thread": 0, "title": "Ann Widdecombe on Brexit, Boris, Mogg, Trump, the NHS and why Anton should have replaced Bruce Forsyth on Strictly Come Dancing", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "News Ann   The Devon based former Conservative policitian has not held back in giving her views on a range of subjects Share Ann Widdecombe talks   in Uffculme Share Comments \nFormer Shadow Home Secretary and Conservative Party heavyweight has been sharing her views on Brexit, Boris, Tump and Moggmania. \nWiddecombe, 70, who retired from politics in 2010, later went on to become a star on the ballroom floor in  , as well as perform in pantomime, host documentaries, and have a run in with Jimmy Carr on Have I Got News For You. \nToday she spends her time living Dartmoor and is now an established author as well as writing a column for the Daily Express. Read More \nEarlier this month, she took a host of questions from residents in the Mid Devon parish of Uffculme while giving a talk to the Uffculme Library Friends. Here’s what Ann had to say... How do you see our country in ten years’ time? \n“I think our country is going to be in very very good shape in ten years’ time. I voted Brexit, and I did that principally for three reasons. \n“First of all, I wanted us to be able to control our own laws, secondly, to control our own borders, thirdly, to be governed by a democratically elected body. We couldn’t do any of those with the European Union. \n“I think there are also other huge advantages, not least that we can now open up to global trade without the restrictive terms which are in place because of the EU. \n“I’m glad you said ten years because I think there will be a few bumps along the way and I think it would be foolish if we did not recognise that. There was a huge bump when we voted out and look how well we have recovered. \n“I suspect in ten years we will be booming and thriving and wondering why on earth we ever stayed in for so long.\" I’m glad you think the country will be in good hands in ten years, do you think they will be in the hands of Boris Johnson? \n“The one thing that will ruin our prospects, of course, is if they are in the hands of Jeremy Corbyn, but I’d rather assume that that probably isn’t going to happen. \n“I don’t actually think – and I could be wrong – that Boris will be the next leader of the Conservative Party. He is great fun, he is not the buffoon he pretends to be, and he’s got a brain like a laser. He’s a very clever man, but he’s also a tiny bit of a liability. Read More Devon MP calls on Boris Johnson to resign following 'grossly insensitive' Libya dead bodies comment \n“Look what happened last time. There he was the prime candidate against Theresa May, and suddenly he wasn’t running anymore. I have a theory it’s because he didn’t get his nomination papers in on time because I didn’t really see any other reason for him not to. \n“I do have difficulty trying to imagine Boris in a meeting of world leaders with Putin. He may be, but I would have thought the balance was against him. If the country is in his hands, he is much cleverer than he likes to make out and I would be perfectly happy. Ann Widdecombe in Uffculme Would Jacob Rees-Mogg be a good Prime Minister? \n“I don’t think Jacob Rees-Mogg is going to become leader either but I think he will be a fairly valued Member of Parliament for a very long time because he says what he thinks, and for that reason he may not actually like Government where it’s collective responsibility, and you have to say what the Government thinks, not what you think, and that is quite a tie. Read More \n“I don’t see him being a leader, but maybe he will be a very senior member.” Who do you see as the leader? \n“I actually respect hugely, despite the pressure he is under at the moment with everybody saying rude things about him, I respect Phillip Hammond. \n“The reason for that is this; when I was the Shadow Health Secretary, Phillip was my number three, and I had Alan Duncan as my deputy, and Phillip was the next one. Phillip saw things quicker than either Alan or I did, and he made predictions about what the other side would do which were absolutely right. He was very imaginative at looking at the financing. \n“I have a lot of time for Phillip Hammond, and I think he's very unfairly treated at the moment. Yes, he did vote remain, so did Theresa May in case anybody’s forgotten. It doesn’t really matter that he voted remain, what matters is that he’s trying to get the country through Brexit, in what he considers to be an orderly fashion. Read More South West set to march on Downing Street \n“He has said that we’re going to have Brexit and that no deal is better than a bad deal, but that no deal is also a bad option. That seems to be a perfectly sensible attitude to be taking. \n“If it came to an election and Hammond was a candidate, and I’ve got a vote, then I would probably vote for him. \n\"But why are we talking about leadership elections? We’ve got one. Always, always, when things go wrong, we start talking about the leader. We would have gotten rid of Churchill. Things went very wrong for him in case anyone has forgotten, in his first two years. He didn’t win a single battle. \n“People stuck with it because we had a calmer attitude in those days and didn’t expect that everything would always be right. Everything won’t always be right no matter who is the Prime Minister.” Do you feel sorry for our MEPs who are surely going to be made redundant? \n“No, I don’t feel at all sorry for them. \n“Some of them, people like Farage himself of course and also people like Daniel Hammond from the very start said that they look forward to the day when they no longer have a job because it was a Mickey Mouse institution. \n“I’m not sorry for them, and the fact is most of them will come onto the Westminster lists anyway or their sufficiently old that they don’t want to. \n“How many people can name their local MEP? The majority of people know who their MP is, but you don’t know who your MEP is and that says it all. Would you be brave enough to give us your views on Donald Trump? \n“I always say this to the younger ones in my family. I tell them don’t take your impressions from the media. Look carefully at what he’s doing. \n“What I wish he wouldn’t do is Tweet. It’s unpresidential; it’s undignified, and he Tweets off the cuff which is always dangerous. I wish he wouldn’t Tweet. \n“If you actually look at some of the speeches he’s made in an international context they’ve been good. Let’s look at North Korea; a year ago the Chinese president was visiting North America, and Trump said China must sort out North Korea because if it doesn’t, we’re going to have to. Read More Devon County Council refuses to condemn Trump over climate change \n“His first preference was the straightforward diplomatic option, that China should sort the mess, rather than the west having to get entangled with it. A year later, China has not sorted the mess, and Kim Jong Un is firing rockets over Japan. \n“What is Trump supposed to do except up the rhetoric and say, ‘if China doesn't sort this, we will have to, and if you really do have the capacity to hit America, we will react’? \n“Even the Obamarites are saying that you can’t actually wait until he’s got the capacity to hit America, you can’t wait for that point. So from the war monger, ignoramus that everybody thinks he is, and actually, he’d do himself such a big favour if he’d stop Tweeting and stuck to his script in speeches which are usually very well written and very good. \n“When he’s off the cuff and answering questions off the cuff, he speaks as Donald Trump, he’s got to remember to speak as the President of the United States, and speak as the President, just as I had to when I was a minister, I had to speak as a minister, I didn’t speak as Ann Widdecombe.” Ann answers questions from the audience in Uffculme Do you think there’s too much debate and sometimes vitriolic comments made by social media and the press about what’s going on in politics, rather than allowing politicians to get on with their job? \n“The calibre of politician has very sharply declined. When I went in ’87, we took it for granted that we had very big people in Parliament. In my own intake that year there was a brain surgeon on the Labour side, there was a consultant gynaecologist on the Conservative side, there were people who had made fortunes in business from nothing, and there were top lawyers – not just qualified QCs – we took all that for granted in those days. \n“You look around Parliament now, and you’ll see very few of them. \n“There are a lot of reasons for that, but overwhelming reason is the treatment by the press and media. \n“Firstly, the fact that there is now much greater intrusion into family life than there used to be. Look what happened to poor old Euan Blair. He was 16, and you may think you know everything at 16, but actually, you’re massively vulnerable. He finished celebrating his GCSEs just a trifle too enthusiastically, and he had a little snooze in Leicester Square, and he came to the attention of the constabulary. \n“If any other young man in the country had done that, he wouldn’t have got two lines in his local paper. That poor lad at 16 had banner headlines across all the press and media because his dad was the PM. \n“Let’s suppose you’re a serious, successful person with a good record in the outside world and you’re looking to give something back. There was a time when public service through Parliament would have been an actual first choice. Now, if you have got anybody in the family who has had a difficulty that you don’t want to be rehearsed in the public prints or anybody who is vulnerable in any way, or perhaps even just a spouse saying ‘actually darling I don’t quite want to lose privacy on quite that scale, you won’t do it. You’ll give back some other way.’” \n“The other thing that has happened – again largely through the press and media – is the sheer trivialisation of political discourse in this country. You are all lead to believe that MPs are sleazy, lazy and in it for themselves. \n“The expenses scandal is a very good illustration of that. What do you remember; the moat, the duck house, the helipad, all wrong. \n“The helipad was a little square patio on which sat a table and two chairs. It was nicknamed by the family ‘the helipad’. The gardener shared in the joke obviously, and when he put in his bill, he put in some work that he’d done on the helipad. Michael Spice had told the Daily Telegraph 6 o'clock the night before when they rang him up, that there wasn’t a helipad and that they could go and see it, it was just a patio. \n“Everybody believed it was a helipad. The Telegraph said – quite wrongly as you can change things at that hour – that they couldn’t change the copy. The BBC flew over it wanting to land on it; needless to say, they did not find that possible. There was no helipad, but were you allowed to know that? No. \n“Then we had the duck and the moat house. Neither of those two men claimed for the duck or the moat house; neither of them. What used to happen was that you could put in a schedule for the fees office if you wanted to do it that way rather than as you went along, listing all the work that you would have had done on your second home, they went up to the limits that they were allowed to, and they would tick what was eligible and pay that. \n“At the moment of handing his schedule to the fees office Peter Viggers said ‘I’m not expecting the duck house’ and they all laughed. So as far as you know, he claimed for a duck house. He did not claim for a duck house nor did Douglas Hogg pay for the moat. \n“Douglas went, and it was a big loss to Parliament. He had a very keen mind and was one of the very few people that argued against the Iraq war from the Conservative side and was a hugely successful barrister. He left because he said ‘I am not going to spend the whole election campaign justifying myself, I see no reason why I should.’ \n“So, if you’re one of these people with a lot of success in the outside world, do you want to join a profession where every single bus ticket is going to be held up to ridicule? The answer is no. \n“That is why you now have a trivialisation of debate. If you actually want a flavour of Parliament, listen to Today in Parliament, because there you actually get some of the backbench contributions as well as opposed to just the controversial highlights. You get a real flavour of the debate, and I can assure you most debate in Parliament if not all of it – when you take our Prime Minister’s Questions which is a weekly shouting match – is extremely serious. \n“They are passing legislation, it’s extremely serious, and it’s dumbed down by the media.” Do you have any views on Tim Farron feel he had to step down as leader of the Liberal Democrats because of questions surrounding his Christian faith? \n“I think it is first of all ironic that a party that calls itself a liberal party is sufficiently illiberal not to be able to have an active Christian as its leader. Secondly, I think it is very worrying that you can’t now express our views in this country if they’re not politically correct. \n“If a political leader can’t express a view that’s not politically correct, then I don’t know where we’re going. \n“I think the Liberal Democrats were wrong to do what they did; I also thought it was going to be inevitable from the moment he was pressed, and I also think that Tim Farron should have been a bit more up front. He spent a very long time in the election creating a great deal of uncertainty by refusing to answer the question as to what he actually thought. My belief is, you answer the question, it doesn’t do you any harm; look at William Rees-Mogg and what he said the other day, and he’s still as popular. \n“A lot of people will respect you if you say what you think, but if you hold your hand and bluff and are forced into admitting later, you will inevitably weaken your position, but I thought it was a sad day for Britain when that happened.” What should we do about the NHS? \n“We won’t admit that the NHS was never set up to deal with today’s circumstances. It was set up on the completely false premises, which sounds silly now, but wouldn’t have looked at all silly for the founding fathers of the NHS in the 1940s. \n“The first was that because we had a health service, we would all grow healthier, which is true, we have. Therefore, Bevan thought that because we were all going to get healthier, demand would decline. He could not have foreseen the explosion of medical and surgical science, which took off in the second half of the ‘60s and has kept going ever since, and has driven demand towards infinity. At it’s very simplest, before there was any hip replacement surgery, there was no queue for hip replacements. \n“Every time there is a medical or surgical advance, it doesn’t matter whether it’s drugs or procedures, a huge trail of demand comes after it, so he got that wrong. Ann Widdecombe when she was the Shadow Health Secretary \n“The second thing he got wrong was that he assumed we would all live a bit longer, but not much. We now have 14,000 centenarians in this country. When Bevan was looking to set up the welfare state, you had done well if you got to 75, you had done very well if you got to 85 and you were a rarity if you got to 95. Now we take it for granted we’re going to live until our 80s or 90s. He couldn’t have foreseen that. \n“The other thing he didn’t foresee was; he believed in the circumstances which were there, that the National Insurance system, or the stamp as it was then called, was going to pay a huge contribution to spending on the NHS. It was never going to do it all, and some were going to come from the taxes, but the NI was going to make a big contribution. It’s a very long time since it’s done that. \n“In the early 1990s when I was Pensions Minister, had to take money from the taxes to put into the NI fund just to cover the pensions, never mind the NHS. So he got it wrong for understandable reasons. \n“What we’ve done now is confused his vision with the vehicle he chose to deliver it. The vision was one which I’m sure we still all share; that nobody in this country should be denied health services because they’re too poor to pay for them. A great vision. \n“The vehicle he chose was ‘free to everybody at the point at reception’, and even he rode back on that mighty quickly when he introduced prescription charges. That was the vehicle, not the vision, and we’ve come to confuse the two. To say that Bevan’s vision was free at the point of reception, it wasn’t. Bevan’s vision nobody too poor to access health. \n“What we need is a grown-up, mature, cross-party debate, not just in Parliament, but nationwide with practitioners, patients, everybody else, to debate about what we could do and look at other countries. When we’ve decided what we could do from the various options we have to decide what we should do. When we decide what we should do, we’ve got to decide something even more complex, which would be how on earth we get there from here. \n“We haven’t even started that, and I asked that in 1998 when I was Shadow Health Minister. If we had started then, we would have been in a much better state now.” In one of your intimate moments with Anton on  , I wonder if he ever confided in you on whether he was offered Bruce’s job? Ann Widdecombe on   \n“I wanted Anton to replace Bruce. I actually think it would have been more sensible because you have two women now presenting, Claudia and Tess, but the whole basis of Strictly is that it’s predicated on a man and a woman. I would have preferred to have seen a man and a woman presenting. \nI would have liked to see Anton do it. He’s got, of course, a good history of both presenting as well as dancing. When that didn’t happen – he was disappointed – I rather hoped he would replace Len, that didn't happen either. \n“I wrote in my Express column – a very good column every Wednesday – and I did actually write that if they treat people like that, they shouldn’t be surprised if they lose their professional dancers. If there’s no career ladder there, then where are you going to go?” I did like your quiz show Cleverdicks, and I wondered if you had any plans to bring it back? \n\"I loved Cleverdicks; I really loved it. We were told that we were going to get a second series and that the studios had been booked. I wanted that to go on. \n\"Sadly, the internal politics saw the person who commissioned it go on maternity leave, and while she was on maternity leave, the person standing in for her wanted to make her mark and dropped it. \n\"That does happen occasionally, and every time it’s on Challenge people come up to me and ask when it’s coming back. I’m afraid the sad answer is it isn’t. \n\"If you want Cleverdicks to come back, write to Sky; they were the ones who commissioned it and then dropped it.\" Like us on Facebook", "external_links": [], "published": "2017-10-24T03:03:00.000+03:00", "crawled": "2017-10-24T03:07:56.002+03:00", "highlightTitle": ""}