{"organizations": [], "uuid": "a1e9f79d7047fedf5cfe83fd12998bee7e7005a2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12011559.ece/ALTERNATES/s1200/JS101143000.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13703070", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Monarch Airlines collapses as administrators at KPMG are called in", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-02T10:40:00.000+03:00", "replies_count": 0, "uuid": "a1e9f79d7047fedf5cfe83fd12998bee7e7005a2"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13703070", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Monarch Airlines collapses as administrators at KPMG are called in", "locations": [], "entities": {"persons": [{"name": "alex macheras", "sentiment": "none"}, {"name": "devereux", "sentiment": "none"}, {"name": "chris grayling", "sentiment": "none"}, {"name": "macheras", "sentiment": "none"}, {"name": "nimmo", "sentiment": "none"}, {"name": "andrew swaffield", "sentiment": "none"}, {"name": "thomas cook", "sentiment": "none"}, {"name": "blair nimmo", "sentiment": "none"}, {"name": "mark thompson", "sentiment": "none"}, {"name": "cooper", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "london luton airport", "sentiment": "none"}, {"name": "ibiza", "sentiment": "none"}, {"name": "fitzrovia", "sentiment": "none"}, {"name": "egypt", "sentiment": "none"}, {"name": "sharm el-sheikh", "sentiment": "none"}, {"name": "gatwick", "sentiment": "none"}, {"name": "turkey", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "qatar", "sentiment": "none"}, {"name": "gatwick airport", "sentiment": "none"}, {"name": "tunisia", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "ryder architecture", "sentiment": "negative"}, {"name": "newcastle", "sentiment": "negative"}, {"name": "kpmg", "sentiment": "negative"}, {"name": "monarch airlines", "sentiment": "negative"}, {"name": "boeing", "sentiment": "none"}, {"name": "caa", "sentiment": "none"}, {"name": "pm group", "sentiment": "none"}, {"name": "devereux architects", "sentiment": "none"}, {"name": "civil aviation authority", "sentiment": "none"}, {"name": "air travel organiser", "sentiment": "none"}, {"name": "airbus", "sentiment": "none"}, {"name": "monarch aircraft engineering", "sentiment": "none"}, {"name": "ryanair", "sentiment": "none"}, {"name": "ryder", "sentiment": "none"}, {"name": "easyjet", "sentiment": "none"}, {"name": "qatar airways", "sentiment": "none"}, {"name": "transport", "sentiment": "none"}, {"name": "british airways", "sentiment": "none"}, {"name": "ryder architecture ltd", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "\nNEW YORK: the Dow Jones closed up 23.9 at 22405.1. 9.17 KEY EVENT Take a look inside the Gateshead factory where 50 million banknotes are produced each week \nThe factory at the very end of Team Valley is in many ways similar to all the other industrial plants that make up the giant business park. \nOn the walls are whiteboards monitoring productivity and levels of happiness among the staff. The office has a five-a-side football trophy on the shelf and a thank-you card from a local charity. There is even a can of WD40 next to an expensive looking piece of kit to keep it going. \nBut that is where the similarities end, because this is the De La Rue factory and it is, as the old joke goes, a licence to print money. \nJournal business editor Graeme Whitfield is given a rare look inside the De La Rue factory in Gateshead to see currency from around the world being printed. Inside De La Rue's Gateshead factory (Image: belben wells/ De La Rue) 9.10 Coreena Ford Monarch Airlines reaction: Union accuses government of allowing firm to collapse \nMinisters have been accused of “sitting on their hands” while airline Monarch went bust as an operation to repatriate 110,000 travellers was launched. \nThe Unite union, which represents around 1,800 engineers and cabin crew working for Monarch, claimed that ministers rebuffed requests by Monarch to provide a bridging loan, charged at commercial rates, to tide the company over while it restructured the business to focus on its long-haul operations. National officer Oliver Richardson said: \nMonarch’s workforce has worked tirelessly and loyally, with great sacrifice, to try and turn the airline around in the last year. \nTheir hard work has been undone by a Government seemingly content to sit on its hands and allow one of the UK’s oldest airlines go into administration. There were a number of factors that impacted negatively on the company. \nHowever, continuing uncertainty surrounding Brexit and the ability of UK airlines to fly freely in Europe after the UK has left the EU undoubtedly hindered Monarch getting the investment it needed to restructure and survive. \nThis uncertainty, combined with the apparent unwillingness of the Government to assist at commercial rates and at a profit to the taxpayer, has left thousands of jobs at a great British airline hanging by a thread. \nNow is not the time for Government ministers to wash their hands of a problem they have contributed to. \nMinisters need to act fast by intervening in a similar way as their German counterparts did with Air Berlin and help secure a future for Monarch. 9.00 Coreena Ford Hiscox counts cost of hurricanes Irma and Harvey \nInsurer Hiscox has laid bare the impact of hurricanes Harvey and Imra, revealing the natural disasters will cost the firm approximately $225 million (£168 million) in claims. \nThe FTSE 250 firm said the estimate was within the modelled range for a disaster of that scale and was based on an insured market loss of $35 billion for Hurricane Irma and $25 billion for Hurricane Harvey. \nParts of the Caribbean and US have been devastated by the hurricanes, with insurers expected to stomach a total hit of around £150 billion. \nChief executive Bronek Masojada said the natural disasters are already having an impact on insurance rates. \nEarlier this month Hiscox, which provides cover for around 60,000 homes in the UK, warned that “natural catastrophes” would run up a big bill for the insurance industry this year, but assured that the sector would be able to cope. \nThe group added that it stills has depth of cover in its reinsurance programme. (Image: PA) Coreena Ford Reece Group is innovating its way back into profit despite tough times \nReece Group is innovating its way back into profit after tough trading conditions last year knocked profits and revenue. \nThe Newcastle group, based in the renovated Armstrong Works on Scotswood Road, has published accounts for 2016 which reveal a 28% fall in turnover from £54m to £42m. \nIts loss for the year also widened from £928,000 to £3.9m, and the workforce was also reduced from an average of 525 employees to 462. \nThe group’s companies include global defence manufacturer Pearson Engineering, subcontract manufacturer Responsive Engineering, international road repair specialists Velocity UK, food manufacturers Continuous Retorts Ltd and Reece Innovation, which develops new products and has forged strong links with the utilities sector. \nThis year the firm said it has continued to diversify into new markets with high-profile contract wins in the rail and nuclear industries. \nAs a result of this diversification, executive chairman John Reece is forecasting a return to profit in 2017. Reece Group in Newcastle (Image: Reece Group) 8.55 Coreena Ford Losses widen at stamps specialist Stanley Gibbons \nLosses at Stanley Gibbons widened last year as the stamp and coin specialist’s financial situation deteriorates. \nThe company posted an £8.8 million trading loss in the year to March, up from £3.9 million in 2016. \nOn a pre-tax basis, losses rose from £27.9 million to £30.2 million. Revenue also slumped, from £59.1 million to £42.5 million as Stanley Gibbons confirmed that it was in default on its loans and is “dependent on the bank’s ongoing support”. \nThe group has been stung by a slowdown in the stamps and collectables market and hankered by a string of failed historic acquisitions. \nIt is now trying to dump non-core assets in an effort to raise cash. \nChairman Harry Wilson said: “There can be no guarantee that the bank will provide facilities beyond 31 May 2018 and the company is likely to require access to further liquidity in the intervening period. \n“The company remains in constructive discussions with the bank, regarding its short-term liquidity requirements, and the terms of such funding in such form as it may become available.” \nHowever, he added that the board has “reasonable grounds” to believe that alternative finance will be available via further asset disposals or from an “alternative finance provider” should lenders pull the plug. \nEarlier this year, Stanley Gibbons put itself up for sale as part of a review being led by finnCap, with private equity firm Disruptive Capital thought to be interested. Stanley Gibbons ", "external_links": [], "published": "2017-10-02T10:40:00.000+03:00", "crawled": "2017-10-02T10:56:00.001+03:00", "highlightTitle": ""}