{"organizations": [], "uuid": "1db6866b2193964c8de9f8e197449c72070173fa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article12186307.ece/ALTERNATES/s1200/PNP_NEC_290116andrew_008JPG.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/smd-chief-executive-andrew-hodgson-13801459", "country": "GB", "domain_rank": 21960, "title": "SMD chief executive Andrew Hodgson to step down from job", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-23T18:16:00.000+03:00", "replies_count": 0, "uuid": "1db6866b2193964c8de9f8e197449c72070173fa"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/smd-chief-executive-andrew-hodgson-13801459", "ord_in_thread": 0, "title": "SMD chief executive Andrew Hodgson to step down from job", "locations": [], "entities": {"persons": [{"name": "andrew hodgson", "sentiment": "negative"}, {"name": "mike jones", "sentiment": "none"}, {"name": "jones", "sentiment": "none"}, {"name": "mike", "sentiment": "none"}, {"name": "hodgson", "sentiment": "none"}, {"name": "tyne", "sentiment": "none"}, {"name": "andrew", "sentiment": "none"}], "locations": [{"name": "gateshead", "sentiment": "none"}, {"name": "wallsend", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "south tyneside", "sentiment": "none"}, {"name": "north tyneside", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "tyneside", "sentiment": "none"}], "organizations": [{"name": "lep", "sentiment": "none"}, {"name": "lep board", "sentiment": "none"}, {"name": "smd ltd.", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "newcastle premier inn", "sentiment": "none"}, {"name": "north east local enterprise partnership", "sentiment": "none"}, {"name": "crrc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business SMD chief executive Andrew Hodgson to step down from job Top businessman will stay in his role with the North East LEP but is handing over to his deputy at SMD Share Andrew Hodgson of SMD Ltd. in Wallsend Share Get business   Thank you for subscribing! Could   \nOne of the region’s best known business figures is stepping down from his day job to concentrate on his public role. \nAndrew Hodgson will be leaving his role as CEO of Wallsend offshore engineering firm SMD but will be continuing as chair of the North East Local Enterprise Partnership (LEP), the body tasked with the development of the region’s economy. \nMr Hodgson is one of the region’s most prominent business figures, and even before his role with the LEP had won a number of regional and national awards, as well as receiving the OBE for services to manufacturing and the regional economy. \nHe has been succeeded by his deputy Mike Jones as part of a two-and-a-half year succession period put in place when SMD was acquired by Chinese company CRRC in a £120m deal. \nMr Hodgson said: “I’m proud to have been a part of SMD for the last nine years and see everything it has achieved despite the challenges facing the offshore industry in that time. We are coming to the end of a three-year turnaround on target with strong growth and revenue across all our business divisions. \n“We’ve invested in our services, added products, expanded our global network and lowered operating costs. We’ve dealt effectively with competitive challenges and now the business is more stable it is the appropriate time to hand over to Mike. \n“People are integral to the business and very committed and Mike brings a wealth of experience and expertise to the role. I’d like to wish Mike and the team all the very best for the future.” \nSMD had recently posted accounts showing a sharp fall in turnover in 2016, which were attributed to Russian sanctions and the turmoil in the oil and gas market. Around 100 jobs were lost as a result. \nBut the company said it had seen a recovery in 2017 with a strong sales pipeline and an increase in its order backlog. Read More Got a spare £3.5m? A Newcastle Premier Inn hotel has gone up for sale \nAnnouncing his decision to leave SMD, Mr Hodgson said the move would allow him “additional freedom” to work with businesses in the region as devolution for the north of Tyne area comes nearer. \nHe said: “Stepping down from SMD is a pivotal moment for me and I’m looking forward to the new opportunities that are ahead. I remain fully committed to championing the region on behalf of the North East LEP. \n“Since joining the LEP Board in 2011 and becoming the chair in January 2016, it’s been a privilege to work with the LEP and its partners to drive forward the vision in the Strategic Economic Plan to create 100,000 more and better jobs. \n“Brexit and devolution lie ahead, and this will give me additional freedom to work with key stakeholders to ensure the North East economy is strengthened and we collectively benefit from both.” Read More Jobs saved as buyer found for Greenwoods menswear - but Newcastle shop closes \nMr Hodgson has been a vocal supporter of devolution in the North East, saying the region was the best place to set the priorities on driving the regional economy. \nSpeaking earlier this month at an event on Tyneside , he said: “A North East devolution deal is hugely important. No business person would leave the crucial decisions about their business to be taken by someone hundreds of miles away.” \nIt is believed a decision on devolution for Newcastle, North Tyneside and Northumberland could be agreed in the next few weeks. \nA wider deal for the whole of the North East collapsed in 2016 when Durham, Sunderland, South Tyneside and Gateshead pulled out. Read More New era at Newcastle's P F Burridge & Sons as brother completes family MBO \nMr Jones said: “It is a privilege to take over from Andrew to guide SMD through its next phase of development. It’s a business for which I have a deep understanding and passion, being part of its evolution during the past 25 years. \n“We have a very experienced, dedicated and talented team backed by a committed and patient owner. We operate in some interesting markets with great potential and I’m looking forward to working together with our stakeholders in the North East and internationally to take the business forward and build great future.” Like us on Facebook", "external_links": [], "published": "2017-10-23T18:16:00.000+03:00", "crawled": "2017-10-23T18:52:01.001+03:00", "highlightTitle": ""}