{"organizations": [], "uuid": "0a7da9ffd91ecdc8cc18f89fc42542eb53d26d99", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13831124.ece/ALTERNATES/s1200/SMR_NEC_301017FM2018Gay.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/uk-news/latest-football-manager-game-includes-13830467", "country": "GB", "domain_rank": 21960, "title": "Latest Football Manager game includes feature where players come out as gay", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-30T15:00:00.000+02:00", "replies_count": 0, "uuid": "0a7da9ffd91ecdc8cc18f89fc42542eb53d26d99"}, "author": "nechronicle", "url": "http://www.chroniclelive.co.uk/news/uk-news/latest-football-manager-game-includes-13830467", "ord_in_thread": 0, "title": "Latest Football Manager game includes feature where players come out as gay", "locations": [], "entities": {"persons": [{"name": "newgen", "sentiment": "none"}, {"name": "robbie rogers", "sentiment": "none"}, {"name": "rogers", "sentiment": "none"}, {"name": "ex-aston villa", "sentiment": "none"}, {"name": "thomas hitzlsperger", "sentiment": "none"}, {"name": "miles jacobson", "sentiment": "none"}, {"name": "jacobson", "sentiment": "none"}], "locations": [{"name": "usa", "sentiment": "none"}, {"name": "republic of ireland", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}], "organizations": [{"name": "sports interactive", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "leeds united", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Latest Football Manager game includes feature where players come out as gay Last year Sports Interactive introduced Brexit features into Football Manager and now fictional footballers can reveal they are gay Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily   Thank you for subscribing!   \nComputer game Football Manager is introducing a pioneering feature where footballers can come out as gay. \nThe addictive management simulation is released in two weeks, but fans playing an early ‘beta’ version of the game have come across the new feature. \nDevelopers Sports Interactive have confirmed that footballers in the game can reveal their sexuality, which Football Manager gamers are alerted to through a news item. \nIt doesn’t mean big-name real life footballers will come out as gay in the game, only 'newgen' fictional players can. \nIn an interview with Mirror Football , Sports Interactive director Miles Jacobson said: \"They are fake players that come into the game every year as the youth intake of football clubs. \n\"It doesn’t happen with any real life players because of course we don’t know who in real life is gay and who isn’t, and we didn’t want to wrongly be outing players.\" \nNo current Premier League players have come out as gay, but former Leeds United player Robbie Rogers and ex-Aston Villa winger Thomas Hitzlsperger both announced they are gay after they retired. Rogers returned to playing in the USA after he came out. \nThe feature does have some impact on gameplay, although it makes no difference to a footballer’s statistics or attributes. Newgen fictional players can come out as gay in Football Manager 2018 (Image: Sports Interactive) \n\"It happens quite rarely,\" said Jacobson. “But we believe if a player were to come out they wouldn’t get much trouble, and the clubs themselves would see a merchandise boost because you’d be having a different audience wanting to support that player. \n\"If you look at any time when someone has come out it does mean that there is support for them from people who might not have been as supportive in the past. \n\"The LGBT community is incredibly strong, and they do support each other because they know how difficult some of them have had it and how other people have made it easier.\" \n\"From what I’ve been told about the experiences of people who are out in football, it doesn’t change the dynamics at all, so there was no need for us to do anything there because it just hasn’t been a problem for those who have been able to come out. \n\"And there are those who have come out privately in football, just not publicly, and that’s completely up to them about what they think is necessary.\" Read More \nLast year’s Football Manager game grabbed headlines for including a host of Brexit scenarios in the game. These included the possibility of an independent Scotland, and Northern Ireland uniting with the Republic of Ireland. \nSports Interactive says it will continue including any political change which is relevant to football. \n\"We’re not trying to push an agenda onto anyone, we just believe this is something that is going to happen in real life,\" he said. \"If there is something we feel passionately about in the studio that is going to be part of football then yes, absolutely. \n\"With Brexit being in the game, it was completely non-political. There were hundreds of thousands for different scenarios because there are hundreds of thousands of different scenarios for what could happen to football, post-Brexit. \n\"We try to be inclusive of everyone in the game.\" Like us on Facebook", "external_links": [], "published": "2017-10-30T15:00:00.000+02:00", "crawled": "2017-10-30T17:38:56.004+02:00", "highlightTitle": ""}