{"organizations": [], "uuid": "536606e207d0d12c7def3c56eefa07cb7c98af6f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/business/article335349.ece/ALTERNATES/s1200/0J8A7401-Carly-Wongs-conflicted-copy-2017-05-03.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "devonlive - frontpage", "url": "http://www.devonlive.com/news/business/forthglade-create-25-jobs-appetite-699690", "country": "GB", "title": "Forthglade to create 25 jobs as appetite for gourmet pet food grows", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-30T13:01:00.000+02:00", "replies_count": 0, "uuid": "536606e207d0d12c7def3c56eefa07cb7c98af6f"}, "author": "Hannah Finch", "url": "http://www.devonlive.com/news/business/forthglade-create-25-jobs-appetite-699690", "ord_in_thread": 0, "title": "Forthglade to create 25 jobs as appetite for gourmet pet food grows", "locations": [], "entities": {"persons": [{"name": "gerard lovell", "sentiment": "none"}, {"name": "carly wong", "sentiment": "none"}, {"name": "chris brooking", "sentiment": "none"}, {"name": "brexit  carmen peacock", "sentiment": "none"}, {"name": "forthglade", "sentiment": "none"}], "locations": [{"name": "okehampton share bo", "sentiment": "none"}, {"name": "devon  established", "sentiment": "none"}, {"name": "turkey", "sentiment": "none"}, {"name": "okehampton", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "okehampton east business park", "sentiment": "none"}], "organizations": [{"name": "piper private equity", "sentiment": "none"}, {"name": "forthglade foods ltd", "sentiment": "none"}, {"name": "santander growth capital", "sentiment": "none"}, {"name": "forthglade natural pet food", "sentiment": "none"}, {"name": "piper", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Forthglade to create 25 jobs as appetite for gourmet pet food grows The natural pet food manufacturer wants to expand its overseas business with a new facility in Okehampton Share Bo - faithful friend of Forthglade joint MD Gerard Lovell checks out what's for tea (Image: Carly Wong) Share \nAn award-winning Devon pet food supplier has secured £5 million funding to help its UK and overseas expansion plans as well as the development of a larger manufacturing facility. Read More \nOkehampton-headquartered Forthglade Foods Ltd, which currently employs 80 people, is set to create a further 25 jobs when it completes the move to the new state of the art facility at Okehampton East Business Park in Devon. Chris Brooking & Gerard Lovell – Joint MDs for Forthglade Natural Pet Food – based in Devon \nEstablished initially in 1971, Forthglade manufactures 100 per cent natural wet pet food with sales of private label and own brand through major pet food retailers, wholesalers and an increasing online offering. \nIn June this year, Forthglade launched a selection of Gourmet natural meals for dogs including Beef & Wild Boar with root vegetables and apple and also Turkey & Goose with pumpkin and cranberries. \nForthglade was taken over by the current management team in 2011, with a successful strategy to develop and expand in the UK and overseas. The business attracted private equity interest from Piper, a specialist investor in consumer brands, in 2015 to accelerate further the sales and marketing of the own brand label. The new factory, set for completion in 2018, will help increase production of its natural pet food, to boost its exports and fulfil its ambition to become one of the UK’s leading producers of 100 per cent natural pet food. \nThe funding is through Santander Growth Capital loans, targeted at businesses with annual turnover of up to £50 million which have a demonstrated history of high year-on-year growth in turnover, profit or employment. Read More \nAs well as the financial support, high-growth businesses can also access other support from Santander which includes training (masterclasses), mentoring and seminars as well as access to overseas trade missions and part-funded interns through our partner universities. \nClick here for the latest jobs in Devon. \nGerard Lovell, Managing Director at Forthglade Foods Ltd, said: “We are delighted to work with Santander Growth Capital in the next stage of our business’ development. Their support will enable us to build a state of the art production facility in Okehampton and invest in the local economy while accelerating our strategy for growth. The Santander team has been very proactive in developing a relationship with us since we first met them in 2013 and their continued engagement and interest in the business gave us the confidence that they are the right partner for us.” Read More Exeter bids to remain in 'leading pack' of high-growth cities after Brexit \nCarmen Peacock, Relationship Management, Santander Growth Capital, said: “Forthglade is a fantastic business with a leading product offering and a very experienced management team backed by Piper Private Equity. We are delighted to support them in their business expansion plans with the development of a new manufacturing facility in Devon as well as investment in continued UK and international growth opportunities for their own brand products. We look forward to working with the business and seeing it grow from strength to strength.” Like us on Facebook", "external_links": [], "published": "2017-10-30T13:01:00.000+02:00", "crawled": "2017-10-30T13:17:02.008+02:00", "highlightTitle": ""}