{"organizations": [], "uuid": "1498ff2968d77461b022042836546d91fd07dd22", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13805564.ece/ALTERNATES/s1200/JS134430692.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/tory-mps-brexit-letter-north-13805416", "country": "GB", "domain_rank": 21960, "title": "Tory MP's Brexit letter - North East universities to ignore 'sinister' information request", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-24T18:00:00.000+03:00", "replies_count": 0, "uuid": "1498ff2968d77461b022042836546d91fd07dd22"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/tory-mps-brexit-letter-north-13805416", "ord_in_thread": 0, "title": "Tory MP's Brexit letter - North East universities to ignore 'sinister' information request", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nUniversity chiefs in the North East have reacted with concern to a “sinister” letter sent to them asking about Brexit. \nIt was written by Tory MP and government whip Chris Heaton-Harris to vice-chancellors across the country asking what they are teaching students about Brexit and also to provide a list of professors lecturing on it. \nThe MP’s behaviour has been condemned for being “McCarthyite” while the tone of the letter has been described as both sinister and “Orwellian”. \nProf Thom Brooks, dean of Durham Law School, first took to Twitter to say: “Let me make something clear. I will NOT be answering his request. We’re a university. Not thought police.” Thom Brooks \nSpeaking later, Prof Brooks said the PM urgently needed to clarify the government’s stance on the letter. \nHe said: “He is a government whip - he’s not just an MP - and his job is to keep people in line for the government. \n“It was sent on House of Commons letter headed paper. It’s all looking official and with that baggage it will be really interesting to know - did it have the support and encouragement of the Prime Minister?” \nHe added: “Given his position within the government it raises the stakes and it should also raise concerns about what he would like to do with the information.” \nMr Heaton-Harris, Conservative MP for Daventry and a staunch Eurosceptic, wrote the letter at the start of this month asking for the names of any professors involved in teaching European affairs “with particular reference to Brexit”. On Tuesday the letter sent to David Green, Vice-Chancellor at the University of Worcester, was made public. Daventry MP Chris Heaton-Harris (Image: Publicity Picture) \nA spokesperson for the Prime Minister said today the letter was written by Mr Heaton-Harris “in his capacity as an MP not as a government whip”. \nThe spokesperson added: “The Prime Minister has always been very clear about the freedom of universities and the role they play in creating and stimulating debate.” \nHowever the political fallout from the letter continued today. \nIn a short statement, a spokesperson for Newcastle University said: “A letter from Mr Heaton-Harris MP was sent to our Vice-Chancellor and we will not be responding to it.” British Prime Minister Theresa May (Image: Getty Images Europe) \nAlso the University and College Union (UCU) said the letter had the “acrid whiff of McCarthyism” about it and called on universities minister Jo Johnson to condemn it. \nUCU general secretary Sally Hunt said: “Our society will suffer if politicians seek to police what universities can and cannot teach. This attempt by Chris Heaton-Harris to compile a hit list of professors has the acrid whiff of McCarthyism about it and Jo Johnson must disown it in the strongest terms. Read More This is how much a 'no-deal' Brexit would drain out of Newcastle and the rest of the North East \n“Our universities and colleges must lead the way in defending academic freedom, where received wisdom can be challenged and controversial ideas debated.” \nAnd the elite Russell Group of 24 leading universities of which Newcastle and Durham are members also spoke out. \nHead of policy Jessica Cole said: “Russell Group courses are designed to be intellectually rigorous and help students develop the capacity to grapple with complicated issues. Brexit certainly falls into this category. Universities are independent of government and detailed course content and hiring decisions are matters for individual institutions. \n“Whether academics supported leave or remain at the referendum has no bearing on their ability to deliver stimulating, challenging courses which include a full range of views and opinions on our relationship with Europe.” Read More", "external_links": [], "published": "2017-10-24T18:00:00.000+03:00", "crawled": "2017-10-24T18:18:16.002+03:00", "highlightTitle": ""}