{"organizations": [], "uuid": "64561dd932b6c93af31dd103533c43c8c87a39a4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12711311.ece/ALTERNATES/s1200/Computer-hacker-stealing-information-with-laptop.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13744712", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Almost 700,000 customers' information stolen in Equifax cyber attack", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-11T10:00:00.000+03:00", "replies_count": 0, "uuid": "64561dd932b6c93af31dd103533c43c8c87a39a4"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13744712", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Almost 700,000 customers' information stolen in Equifax cyber attack", "locations": [], "entities": {"persons": [{"name": "jonathon manning telford", "sentiment": "negative"}, {"name": "telford", "sentiment": "none"}, {"name": "robert forrester", "sentiment": "none"}, {"name": "chris petts", "sentiment": "none"}, {"name": "ofgem", "sentiment": "none"}, {"name": "grant thornton", "sentiment": "none"}, {"name": "david dunckley", "sentiment": "none"}, {"name": "owen pugh", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "bill", "sentiment": "none"}, {"name": "jon di-stefano", "sentiment": "none"}, {"name": "petts", "sentiment": "none"}, {"name": "vertu", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "ofgem", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "parliament.dermot nolan", "sentiment": "none"}], "organizations": [{"name": "equifax", "sentiment": "negative"}, {"name": "telford homes", "sentiment": "negative"}, {"name": "jonathon manning council", "sentiment": "none"}, {"name": "owen pugh jonathon manning ofgem", "sentiment": "none"}, {"name": "north tyneside council", "sentiment": "none"}, {"name": "vertu motors", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KEY EVENT Makers of 'Newcastle's best burger' forced to change name after clash with London firm \nA cult burger business in Newcastle has had to change its name after getting the threat of legal action from a London firm with a similar name . \nAfter first launching at the Quayside Market just over a year ago, The Grind has built up a faithful following through a pop-up venture at city centre bar No 28, and appearances at festivals, food markets and events. \nJournal restaurant reviewer The Secret Diner hailed the firm’s Mid-Western Burger as the “best burger in Newcastle” and the company’s first year success has also sparked plans for a permanent base at the Grainger Market, which are progressing well. \nFrom the start of next month, however, The Grind will have new branding and be known as Meat:Stack, after a cease-and-desist letter was sent to the firm’s founders by a London coffee shop company with a similar name. \nUnable to engage in a costly legal battle to keep the name, the founders of the small business – Allan Hyslop, Charlie Mair and Tom Westman – have agreed to requests from the London cafe business, which has seven coffee shops across the capital. \nMr Hyslop said: \nA cease-and-desist letter arrived a couple of months ago from the coffee shop company, accusing us of passing ourselves off as them. It was a bit of a shock. \nWe spoke to our lawyer and he said we could fight it, and possibly win it and keep the name, but it would cost around £25,000 and we haven’t even got our own shop yet. \nSo we decided it wasn’t worth it, and that we should do a rebrand because we are a small company. \nWe have to stop using The Grind in all facets from November 1, so we are unveiling our new name Meat:Stack now, to get everyone used to it. \nThis might all be a blessing in disguise because we’ve now had time to think about the name. It comes from the fact that in America any burger is called a stack. We only do two burgers or more in a bun so Meat:Stack exactly matches what we do. The new branding for Newcastle burger business Meat:Stack is revealed (Image: Meat:Stack) 8:47 Jonathon Manning Countryside buoyed by strong demand \nCountryside Properties ramped up its housebuilding efforts last year as increased demand from first-time buyers and low interest rates drove demand.The group, which has its headquarters in Essex and floated on the stock market last year, said completions rose 28% to 3,389 homes in the year to September 30.Countryside added that its private forward order book is up 8% at £242.4m and net reservation rates rose to 0.84 from 0.78.It said the Government’s Help to Buy scheme is also underpinning sales.However, the average selling price of its homes fell 8% to £430,000 as it reduced exposure to higher end properties amid a slowdown in sales in that market.In its partnerships division, prices increased by 12% to £343,000, driven by strong price growth in outer London and regional cities, the firm added.Boss Ian Sutcliffe said: \nWe have successfully positioned our business to meet the strongest areas of customer demand and are greatly encouraged by the continued and increased political support for mixed tenure housing. \nWe see further opportunities for both our partnerships and housebuilding divisions and remain entirely confident in delivering our medium-term growth plans. Countryside Properties has been buoyed by strong demand for housing (Image: Joe Giddens/PA Wire) 8:42 Jonathon Manning Telford boosted by 'chronic' London housing shortage \nTelford Homes has said London’s “chronic” need for new houses will help the firm mitigate economic and political uncertainty around Brexit, although half-year profits are expected to come in lower.In a trading update, the group said profit for the first six months of the year is expected to be “significantly lower” than the comparable period in 2016.Telford said this is due to the “programmed timing of development completions”, adding that full-year profit is on track to hit £40m.On housing demand, the firm said: \nThere remains an ongoing and acute need for more homes to be built across London which is recognised by all political parties and the mayor. \nThis is particularly true for non-prime locations where homes can be developed at more affordable prices and rents. \nThe imbalance between this need and the supply of new homes continues to underpin the board’s long-term belief in growing Telford Homes and increasing the group’s development capacity. \nTelford pointed to an existing pipeline of more than 4,000 new homes to be delivered across London, with the average expected price standing at £530,000.However, the firm added that London has been “somewhat subdued” by economic and political uncertainty around Brexit negotiations and the election outcome.It also said it would continue to focus on the lucrative build-to-rent sector, with contracts for nearly 500 homes worth more than £230m under its belt.Chief executive Jon Di-Stefano said: \nI expect more build-to-rent transactions as institutional demand continues to grow alongside continuing open market sales at our well-located developments. \nOur ultimate belief in what we do is underpinned by a chronic lack of supply and we expect to deliver more of the homes that London needs in the coming years. A house being built (Image: PA) 8:37 Jonathon Manning Council pledges to help 300 Owen Pugh workers facing uncertain future as firm collapses \nNorth Tyneside Council has said it will do all it can to help the 300 Owen Pugh workers who face a doubtful future following the firm’s collapse into administration. \nChris Petts and David Dunckley of Grant Thornton have stepped in at Dudley-headquartered Owen Pugh, a group of civil engineering firms with a 71-year history in the North East, following months of battling cash flow issues. \nThe join administrators say a number of prospective purchasers have already expressed an interest in acquiring parts of the business and assets of the group – but the 300-plus employees, spread across five sites in the North East, have been told they cannot be given “any certainty as to how these discussions will progress, or any guarantees as to their future employment prospects with the group”. \nNow, North Tyneside Council has said it is working to help the workforce. \nA spokesman said: \nIt is disappointing to hear reports that a major business based in the borough has gone into administration. Alongside our partners we as a council will try to help those workers affected find alternative employment. \nThe firm was forced to call in help after struggling with cash flow pressures, triggered by work on numerous large and high profile projects, which they said proved to be commercially unsuccessful. \nAs the firm’s cash position slumped, the group brought in external investment and further support from funders, but cash pressure intensified, culminating in parts of the group being presented with winding up petitions in recent weeks. \nMr Petts said: \nI am working with the employees and customers to establish if there are elements of the Group that can be rescued, and a buyer located, in very short order. Owen Pugh Jonathon Manning Ofgem extends price cap ahead of energy legislation \nEnergy regulator Ofgem is to extend its prepayment price cap to one million more vulnerable households this winter, saving them £120 a year.Ofgem added that it will work on extending price protection to at least another two million vulnerable households for winter next year, once the timing of a Government price cap is confirmed.It follows Prime Minister Theresa May’s announcement of an energy price cap last week, and Ofgem said it will work with the Government so that all customers on standard variable and other “default tariffs” receive price protection “as soon as possible if legislation is in place”.The Conservatives are expected to publish draft legislation to enforce a cap on some energy prices on Thursday.Ofgem will consult on the design of a “safeguard tariff” for default deals while the Government’s draft Bill progresses through Parliament.Dermot Nolan, chief executive of Ofgem, said: \nOfgem shares the Government’s concern that the energy market is not working for all consumers and is determined to reduce the detriment suffered by those overpaying for their energy, particularly those who are vulnerable. \nThe Government’s proposed Bill to provide price protection to those who remain on poor value default deals, such as the standard variable tariff, will give these households peace of mind about the price they pay for their energy. \nHowever, the regulator warned energy suppliers that they must step up efforts to get more customers on default tariffs on to better value deals.Ofgem is introducing new rules to allow suppliers to roll customers coming to the end of their contracts on to another fixed deal, instead of a poor value standard variable tariff.It will monitor suppliers to ensure any new default deals do not “become another way to penalise customers who rarely switch”. Ofgem is to extend its prepayment price cap to one million more vulnerable households this winter (Image: Free editorial use) 8:26 KEY EVENT Vertu motors reports flat turnover of £1.45bn \nGateshead car dealership Vertu Motors has revealed that its turnover has remained flat during the first six months of the 2017/18 financial year. \nThe firm’s interim results showed that the the firm brought in £1.45bn during the six months ending August 31 2017, roughly the same figure during the first half of the previous year. \nVertu continues to struggle with what it describes as a “softening new vehicle market”, which has seen consumers by fewer new cars due to currency pressures increasing their cost. \nHowever, like-for-like used vehicle sales increase by 1.1%, which is the twelfth consecutive half year period of continuous growth. \nCommenting on the results, chief executive Robert Forrester said: \nThe Board is pleased to see further growth in used car volumes and aftersales revenues against a back drop of the weakness of Sterling reducing the supply and increasing the prices of new cars. \nPleasingly, underlying operating expenses reduced year on year in the period as a result of management focus at a time of increasing costs across the industry. \nOur group’s net cash position, strong property portfolio and very low level of used vehicle stock financing places us in a unique position to take advantage of consolidation opportunities and to continue to increase returns to shareholders. The Board is confident that opportunities to expand the business will arise in the next 18 months and these are likely to be at more attractive valuations. \nVertu managed to increase its operating profit by 24% to £21.7m. Robert Forrester, CEO of Vertu Motors (Image: vertu motors) 8:21 ", "external_links": [], "published": "2017-10-11T10:00:00.000+03:00", "crawled": "2017-10-11T10:46:30.004+03:00", "highlightTitle": ""}