{"organizations": [], "uuid": "e85b14ac2519a491a7abe830190a5bb68da72578", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article691727.ece/ALTERNATES/s1200/EHFM-mtg-Dave-KnightJPG.jpg", "site_section": "http://www.devonlive.com/rss.xml", "section_title": "devonlive - frontpage", "url": "http://www.devonlive.com/news/devon-news/exmoor-farming-communities-back-exmoor-691732", "country": "US", "title": "Exmoor farming communities back the Exmoor Ambition", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-27T17:15:00.000+03:00", "replies_count": 0, "uuid": "e85b14ac2519a491a7abe830190a5bb68da72578"}, "author": "Lewis Clarke", "url": "http://www.devonlive.com/news/devon-news/exmoor-farming-communities-back-exmoor-691732", "ord_in_thread": 0, "title": "Exmoor farming communities back the Exmoor Ambition", "locations": [], "entities": {"persons": [{"name": "dave knight", "sentiment": "none"}, {"name": "dave knight chairman of the ehfn", "sentiment": "none"}, {"name": "robin milton", "sentiment": "none"}], "locations": [{"name": "european union", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "exmoor hill farming network", "sentiment": "none"}, {"name": "national parks", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "exmoor society", "sentiment": "none"}, {"name": "exmoor national park authority", "sentiment": "none"}, {"name": "hill farming network", "sentiment": "none"}, {"name": "national park authority", "sentiment": "none"}, {"name": "exmoor ambition", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Exmoor farming communities back the Exmoor Ambition Networking meeting is the \"Go To\" hub of the Exmoor farming community Share EHFN Chairman Dave Knight addressing the Exmoor Ambition meeting Share Comments \nAround 80 mainly upland farmers attended an Exmoor Ambition meeting of the Exmoor Hill Farming Network (EHFN) recently. The meeting discussed the development of proposals for farming support schemes and the environment through a reshaped agricultural policy as the UK prepares to leave the European Union. \nThe ‘Exmoor Ambition is to: \n· develop a locally delivered mechanism that secures and enhances the many benefits that Exmoor’s farmed landscape gives to Exmoor communities and the nation. \n· demonstrate to others the value of approaches piloted on Exmoor and develop a pilot that would be of interest in other English uplands, other protected landscapes and more widely. Read More \"Great uncertainty\" ahead for Britain's National Parks, warns Exmoor Society chairman \nAs the UK prepares to leave the European Union, the government has a unique opportunity to reshape how to maintain the benefits that upland areas can deliver. \nDave Knight Chairman of the EHFN said: “The Exmoor Ambition event was a tremendous success - easily our best attended meeting to date, and it demonstrates the credibility of the Network that so many people recognised the importance of what we are proposing. \n“The Exmoor ambition event goes to show the continuing confidence and trust within the Network as the \"go to hub\" for Exmoor's farming community. Following our Exmoor Ask paper last autumn, the proposals put forward have been a year in the making. There is a huge amount more work to do, but the ringing endorsement from the event attendees shows that we're on the right track.” Read More Polar blast to send Devon temperatures plummeting next week \nRobin Milton, Chairman of Exmoor National Park Authority added: “A unanimous vote concluded a fantastic evening of debate by farmers at the recent Exmoor Hill Farming Network event where integrating farming and environmental management was recognised as a major asset in determine future policies. \n“Exmoor farmers are ready to take up the post-Brexit challenge with an Exmoor Ambition offer to government.” \nThe Hill Farming Network will now finalise the Exmoor Ambition proposals with the National Park Authority, with the aim of presenting them formally to the Government in the New Year. Like us on Facebook", "external_links": [], "published": "2017-10-27T17:15:00.000+03:00", "crawled": "2017-10-27T18:31:04.004+03:00", "highlightTitle": ""}