{"organizations": [], "uuid": "0657c3143baab50d467b53ea12a3992b514585ac", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.birminghammail.co.uk/incoming/article13715606.ece/ALTERNATES/s1200/may-speechm.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/key-points-theresa-mays-big-13716710", "country": "GB", "domain_rank": 21960, "title": "The key points from Theresa May's big Conservative conference speech", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-04T17:15:00.000+03:00", "replies_count": 0, "uuid": "0657c3143baab50d467b53ea12a3992b514585ac"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/key-points-theresa-mays-big-13716710", "ord_in_thread": 0, "title": "The key points from Theresa May's big Conservative conference speech", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "simon wessely", "sentiment": "none"}, {"name": "brexit  mrs may", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}], "organizations": [{"name": "house of commons", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "daily mirror", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "conservative party conference", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The key points from Theresa May's big Conservative conference speech Theresa May's speech to the Conservative conference included some major new announcements - and an apology Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nTheresa May’s speech to the Conservative conference in Manchester was interrupted by a heckler who attempted to present her with a P45. \nAnd the Prime Minister lost her voice, repeatedly coughing as she tried set out her plans. \nBut there were some major announcements in Theresa May’s speech. \nAnd she also attempted to set out her personal philosophy - and to apologise for the June general election, when Conservatives lost their majority in the House of Commons. Prime Minister Theresa May arrives to make her keynote speech to delegates and party members on the last day of the Conservative Party Conference in Manchester I’m sorry \nTheresa May admitted the Tory general election campaign had been “too scripted” and “too presidential”. \nShe said: “I take responsibility. I led the campaign. And I am sorry”. Tackling injustice \nMrs May attempted to explain why she is in politics . She said: “I do it to root out injustice and give everyone in our country a voice.” \nShe said she wanted to “renew the ‘British Dream’ for a new generation and bring our country back together”. \nAnd she attacked Labour leader Jeremy Corbyn as “a politician who lets anti-Semitism, misogyny and hatred run free, while he doesn’t do a thing to stop it.” An eventful speech by Theresa May to conference (Image: Daily Mirror) Changes to organ donation \nThe Prime Minister said her government would introduce a new system “shifting the balance of presumption in favour of organ donation”. \nIt means your organs may automatically be used to help others if you die, unless you have specifically said you don’t want this to happen. \nIt’s a change from the current system, where you have to make an effort to join the organ donor register for your organs to be used. \nMrs May did not give further details, but it’s possible relatives will still be able to boycott the use of organs if a loved one dies. \nThe planned new system is known as a system of presumed consent. Support for families affected by major disasters \nA new “advocate” will be appointed to represent families affected by major disasters. \nIt follows the Grenfell tower fire. Intruder prankster who approached Theresa May during her speech to conference (Image: Daily Mirror) A review of mental health \nMrs May said she had appointed psychiatrist Sir Simon Wessely “to undertake an independent review of the Mental Health Act, so that we can tackle the longstanding injustices and discrimination in our mental health system once and for all.” An end to austerity? \nMrs May appeared to say that there would be a change in the way the Government deals with public spending, with a new emphasis on “balancing” the need to cut the deficit and fund services. \nShe said the economy is “back on track” after the banking crisis. \n“Over the years ahead this government will adopt a balanced approach to the economy - dealing with our debts, keeping taxes low, but investing in our priorities too. \n“Things like vital public services, our schools, our police, housing, and our great national achievement, the NHS”. More money for the NHS \n“We will increase funding per head for every year of this parliament, we will oversee the biggest expansion in training for doctors and nurses”. More free schools \n100 new free schools to built ever year. Mrs May said this would help ensure people in the North had schools just as good as those in the south. \nShe also highlighted plans to build “technology institutes” in every major city. A massive housebuilding programme \nMrs May announced a housing white paper to ensure councils release land for housing and give them new powers to ensure developers actually build homes once they are given planning permission to do so. \nAn extra £10 billion for help to buy schemes, to help more than 130,000 more families with the deposit they need \nAn extra £2 billion for affordable housing, taking total budget to £9 billion. Councils as well as housing associations to be invited to bid for the money. Read More Continuing to spend 0.7% of GDP on aid \nThe Government will continue its aid spending. A major review of university funding and student financing \nMrs May said the Government would scrap the increase in fees that was due next year. The maximum fee rate will be frozen. And the salary graduates need to earn to start repaying fees wil be increased to £25,000. Energy prices \nThe Government will publish a Bill to cap energy prices next week \nIt will give Ofgem powers to impose a cap on “standard variable tariffs”, a type of contract in which prices can go up or down, which often offer the most expensive prices. \nOfgem are expected to come out with their plans for how they will safeguard customers on the poorest value tariffs, according to the Conservative Party. Brexit \nMrs May said the UK was leaving the European Union in March 2019 and insisted: “Our first and most important duty is to get Brexit right”. \nBut Brexit , deliberately, was only a small part of her speech. She wanted to show that her government is doing more than preparing the UK to leave the EU. \nMrs May said “a deep and special relationship is our ambition and our offer” to the rest of the EU. Like us on Facebook", "external_links": [], "published": "2017-10-04T17:15:00.000+03:00", "crawled": "2017-10-04T18:08:03.007+03:00", "highlightTitle": ""}