{"organizations": [], "uuid": "d05f0b7ed7499eadf0af94eaf6093dbf9ee84809", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13834126.ece/ALTERNATES/s1200/IMP_MGA_040717mgatraffic_07JPG.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/northern-powerhouse-ever-investment-needs-13833972", "country": "GB", "domain_rank": 21960, "title": "Will the Northern Powerhouse ever get the investment it needs?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-30T20:25:00.000+02:00", "replies_count": 0, "uuid": "d05f0b7ed7499eadf0af94eaf6093dbf9ee84809"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/northern-powerhouse-ever-investment-needs-13833972", "ord_in_thread": 0, "title": "Will the Northern Powerhouse ever get the investment it needs?", "locations": [], "entities": {"persons": [{"name": "brown", "sentiment": "none"}, {"name": "norman", "sentiment": "none"}, {"name": "dispatches", "sentiment": "none"}, {"name": "leeming", "sentiment": "none"}, {"name": "tyne", "sentiment": "none"}, {"name": "jesse norman", "sentiment": "none"}, {"name": "david davis", "sentiment": "none"}, {"name": "nick brown", "sentiment": "none"}, {"name": "barton", "sentiment": "none"}, {"name": "azuma", "sentiment": "none"}, {"name": "hull", "sentiment": "none"}], "locations": [{"name": "heathrow airport", "sentiment": "none"}, {"name": "north west", "sentiment": "none"}, {"name": "leeds", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "metro centre", "sentiment": "none"}, {"name": "ellingham", "sentiment": "none"}, {"name": "darlington", "sentiment": "none"}, {"name": "penrith widening", "sentiment": "none"}, {"name": "manchester airport", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}, {"name": "midlands", "sentiment": "none"}, {"name": "wear metro", "sentiment": "none"}, {"name": "london underground", "sentiment": "none"}, {"name": "yorkshire", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "sheffield", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "north", "sentiment": "none"}, {"name": "crossrail", "sentiment": "none"}], "organizations": [{"name": "northern powerhouse", "sentiment": "neutral"}, {"name": "national audit office", "sentiment": "none"}, {"name": "newcastle east", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "coal house", "sentiment": "none"}, {"name": "north’s transport infrastructure", "sentiment": "none"}, {"name": "newcastle gateshead western bypass", "sentiment": "none"}, {"name": "middlesbrough", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "liverpool", "sentiment": "none"}, {"name": "north east combined authority", "sentiment": "none"}, {"name": "department for transport", "sentiment": "none"}, {"name": "transport strategy", "sentiment": "none"}, {"name": "penrith", "sentiment": "none"}, {"name": "northern rail", "sentiment": "none"}, {"name": "statutory instruments", "sentiment": "none"}, {"name": "wear metro", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}, {"name": "tees valley combined authority", "sentiment": "none"}, {"name": "northern powerhouse rail", "sentiment": "none"}, {"name": "north east combined authority - not transport", "sentiment": "none"}, {"name": "transport for london", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}, {"name": "transpennine express", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Will the Northern Powerhouse ever get the investment it needs? As the North draws up plans for a £20 billion new rail line, Channel 4's Dispatches asks whether the Government is ready to provide the cash Share Traffic chaos on the A66 near Middlesbrough (Image: Evening Gazette) Share Get daily   Thank you for subscribing!   \nA new documentary warns the North of England is in danger of missing out on urgently needed transport improvements. \nChannel 4’s Dispatches says the region’s leaders are set to ask the Government to build a new £20 billion rail network, which could dramatically speed up travel times. \nThe new Northern Powerhouse Rail line is likely to connect Manchester, Leeds, Sheffield, Hull, Newcastle and Liverpool, as well as Manchester Airport. \nBut in a documentary broadcast Monday night, Dispatches warns that the region’s new transport authority, called Transport for the North, is set to have very little power and funding in comparison to a similar body in the south called Transport for London. Northern Rail train (Image: Evening Gazette) What is Transport for the North? \nTransport for the North is a transport authority set up by 19 local and regional councils, including the North East Combined Authority and Tees Valley Combined Authority as well as councils in Yorkshire and the North West. \nIt is working on plans for a new Northern Powerhouse rail network, also known as Crossrail for the North, and is expected to present proposals to the Government later this year. \nMinisters have repeatedly highlighted the scheme as proof that they are committed to the Northern Powerhouse, and the Conservative general election manifesto included a promise to “continue our programme of strategic national investments, including High Speed 2, Northern Powerhouse Rail and the expansion of Heathrow Airport.” General view of Central station (Image: Newcastle Chronicle) What’s the problem? \nDispatches has obtained a copy of the Statutory Instruments which will turn Transport for the North into a statutory body, giving it official legal status and responsibilities. \nDocumentary makers say that its role will largely be to advise the Government. \nThis is a contrast with Transport for London, which operates public transport in the capital and has direct control over £10.2 billion a year. \nIt suggests that London’s transport body will be able to raise and spend money on improving transport, while the North’s equivalent body can only offer advice to ministers. Does this matter? \nIt’s important to note that Transport for the North has not in fact asked for the power to raise and spend large sums of money. \nIt submitted a formal proposal to the Department for Transport to become a statutory Sub-National Transport Body in October 2016. \nAnd it said its role would be largely to advise the Transport Secretary. For example, this will include preparing a Transport Strategy for the North. \nThe key difference is that Transport for London directly operates services in the capital such as the London Underground, while the North has a range of more local transport bodies. For example, the Tyne and Wear Metro is operated by Nexus, which is accountable to the North East Combined Authority - not Transport for the North. Nick Brown (Image: Newcastle Chronicle) So is the North being shortchanged? \nThe North is not getting the investment it needs, says Newcastle East MP Nick Brown. \nFor example, he pointed out that the Government has still not confirmed it will fund urgently-needed new trams for the Tyne and Wear Metro. \nMr Brown said: “If the Northern Powerhouse means anything at all, transport infrastructure must be a significant part of it. \n“The Government is not committing itself to anything near the levels of investment in the North of England that are being spend in the south.” Read More Building work at Parliament cuts off MPs' phones and it's caused a bit of a problem \nHe pointed out that the Government was building a high speed rail line between London and Birmingham, which the National Audit Office expects to cost £27 billion. This is phase one of the HS2 high speed rail network, which will eventually stretch to Leeds and Manchester, but not Newcastle. \nMr Brown said: “We have repeatedly called for a clear commitment to the North’s Transport Infrastructure and await a meaningful response from Government.” Is any investment coming to the North East? \nA DfT spokesperson said: “The government has made a commitment to Northern Powerhouse Rail which has the potential to transform the north of England. \n“In October, the Chancellor announced £300 million to ensure that HS2 can accommodate future Northern Powerhouse Rail services, making it easier and less disruptive to build the scheme in the future. Read More North East politician lands key role in David Davis' Brexit team \n“We are carrying out the biggest investment in transport in the region for a generation, investing billions of pounds across the north of England to better connect communities, build the Northern Powerhouse and deliver improved journeys for passengers right across the region. All trains on the Northern route will be brand new or refurbished by 2020. \n“We have also given Transport for the North £60m to develop plans and look forward to working with them once proposals are submitted later this year.” Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nHowever, the Government points out that transport improvements are taking place which benefit the North East - and more are planned. They include: Dualling the A1 in Northumberland, to create a dual carriageway on the entire stretch of the route between Newcastle and Ellingham. Construction work on the £290 million scheme is expected to start in the 2019-2020 financial year. Dualling 15 miles of road on the A66, which links Darlington and Penrith, as well as improving junctions on the A66 around Penrith Widening around four miles of the A1 Western Bypass between Coal House and Metro Centre at a cost of £61 million. This work “has already improved journey times on the A1 Newcastle Gateshead Western Bypass”, Ministers say. £300 million in rail improvements to connect existing rail lines in the North and the Midlands to the HS2 high speed rail scheme. £380 million to upgrade the A1 between Leeming and Barton, both in Yorkshire. This work is not taking place in the North East but Transport Minister Jesse Norman told the House of Commons it would benefit the region, saying: “Once the £380m scheme to upgrade the A1 between Leeming and Barton is completed in spring 2018, there will be a continuous motorway link between London and Tyne and Wear.” The new Northern and TransPennine rail franchises, which began last year, will benefit the North, say Ministers. Mr Norman said: “Rail connectivity will be improved by the new Northern and TransPennine Express franchises, which will provide new trains, more than 500 new carriages, room for 40,000 extra passengers and more than 2,000 extra services a week, by 2020. As part of this, the frequency of Transpennine trains between Newcastle and York/Leeds/Manchester will increase from one to two trains per hour.” New state-of-the-art Azuma trains will be introduced to the East Coast Main Line in 2018, providing more than 12,000 extra seats and making journeys faster. The Government says it will replace aging trains on the Tyne and Wear Metro, but is still discussing how to fund the £400 million scheme with transport body Nexus. And then there’s the Northern Powerhouse Rail project - although no firm decision will be made on whether to fund this until Transport for the North presents its scheme to Ministers. Like us on Facebook", "external_links": [], "published": "2017-10-30T20:25:00.000+02:00", "crawled": "2017-10-30T20:47:58.001+02:00", "highlightTitle": ""}