{"organizations": [], "uuid": "629287c2657badf758a61f6090f40a6b29a31be6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article689605.ece/ALTERNATES/s1200/20171027_082953.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "devonlive - frontpage", "url": "http://www.devonlive.com/news/devon-news/lib-dem-leader-vince-cable-689547", "country": "GB", "title": "Lib Dem leader Vince Cable tells South Devon business community to prepare for 'difficult problems ahead'", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-27T15:29:00.000+03:00", "replies_count": 0, "uuid": "629287c2657badf758a61f6090f40a6b29a31be6"}, "author": "Caroline Abbott", "url": "http://www.devonlive.com/news/devon-news/lib-dem-leader-vince-cable-689547", "ord_in_thread": 0, "title": "Lib Dem leader Vince Cable tells South Devon business community to prepare for 'difficult problems ahead'", "locations": [], "entities": {"persons": [{"name": "vince cable", "sentiment": "none"}, {"name": "vince", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "vince cable mp", "sentiment": "none"}, {"name": "nick bye", "sentiment": "none"}], "locations": [{"name": "south devon", "sentiment": "none"}, {"name": "exeter science park", "sentiment": "none"}, {"name": "newton abbot", "sentiment": "none"}, {"name": "eastern europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "riviera international conference centre", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}], "organizations": [{"name": "sir vince cable", "sentiment": "none"}, {"name": "torquay", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "torbay business forum", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}, {"name": "torbay conservative association", "sentiment": "none"}, {"name": "south devon university technical college", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "torbay business forum’s business breakfast", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Lib Dem leader Vince Cable tells South Devon business community to prepare for 'difficult problems ahead' Sir Vince Cable MP was the guest speaker at a Torbay Business Forum event Share Click to play Tap to play The video will start in 8 Cancel Play now Comments \nLiberal Democrat leader Sir Vince Cable MP has told members of Torbay’s business community to ‘get to grips with reality’ and prepare for the ‘very difficult problems’ ahead. \nAddressing more than 80 guests at Torbay Business Forum’s Business Breakfast, the MP for Twickenham, who was the Secretary of State for Business from 2010 to 2015, spoke on issues affecting the South West region and the country as a whole, including the railway network, affordable housing and skills shortages. \nIn a 25-minute speech at the event at Torquay’s Riviera International Conference Centre on Friday, he said the economy was ‘bumping along’ but there was ‘a loss of business confidence because of the Brexit issue’. Liberal Democrat leader Sir Vince Cable MP \nHe said: “We had a big devaluation which encourages people to stay at home rather than go abroad for their holidays, and there may have been some benefit to you from that but it makes imports more expensive. Wages are flat and people’s living standards are stagnating or falling. People are borrowing to keep up their spending and we’re seeing a big increase in personal debt. \n“The second impact is we’re beginning to see people drifting away from residential homes and hospitals. People who were working here are drifting back home to Eastern Europe. \nShortages of labour are becoming a feature of what’s happening.” Sir Vince Cable MP was the guest speaker at Torbay Business Forum's Business Breakfast \nHe said he has been to this region ‘quite a lot’ and the same issues are brought up each time. \nThe first issue he raised was the ‘poor’ rail connection. He said: “The problem is Network Rail is privately run but classed as a nationalised industry which means investment in the railways is technically controlled by the Treasury. Investment has been curbed and there is direct competition between projects around the country. The route to the South West is fairly low down the pecking order. \n“We desperately need to challenge the Treasury about the way investment is managed. There’s a fixed pot and if one part of the country gets money, another doesn’t. It would make a lot of difference here if we had an effective rail system.” Read More Halloween warning \nThe second issue was skills shortages, with the risk of losing the people who were coming to the UK from places such as Eastern Europe. \nHe said: “We need to be giving more priority to education and training. Everyone’s focus is on universities not the vocational side. This whole area of the economy has been starved of resources. Unless we get it sorted out quickly and have proper apprenticeship schemes and proper careers advice and guidance we’re going to suffer with skills shortages.” Read More Jeremy Corbyn reveals his family's Devon connections at sold out show \nThe third issue was access to capital. He said many companies are still finding it difficult to get access to capital for investment projects, and said ‘the British banking system isn’t geared up to the interest of small and medium companies’. \nThe fourth issue he raised was housing, without which it would be difficult to attract people to work in the region. He said ‘people are being driven out’ by high house prices. \nHe said: “This part of the country, among others, is being crippled by a lack of affordable housing for young people. There must be a much more dramatic commitment to affordable housing than we’re getting. At the moment there isn’t the funding commitment to get developments launched.” Read More Polar blast to send Devon temperatures plummeting next week \nThe last point was that ‘having a voice and representation is critical’. He said: “Parts of the country with feuding local councils and no strong voice aren’t being listened to because people don’t know what they’re trying to say. I get the impression Devon doesn’t have a voice. When you need something, and affordable housing is an example, you don’t get it.” \nHis speech was followed by half a dozen questions from the floor on topics ranging from inflation to the sustainability of the NHS. \nTorbay Councillor Nick Bye, chairman of Torbay Conservative Association, said the morning had been ‘miserable’ and said: “Isn’t political leadership about offering hope?” Read More Devon's bikers to ride out on Christmas toy mission \nSir Vince replied: “If you’re running a company you hope for the best but prepare for the worst. You’ve got to be realistic otherwise you get into trouble. The brutal truth of the matter is businesses have stopped investing because they’re looking at the facts. If Brexit happens, we’ve got to look for business opportunities wherever they are. The first step is to get to grips with reality and there are some very difficult problems ahead.” \nFollowing the event, he was due to visit South Devon University Technical College in Newton Abbot and then Exeter Science Park. Like us on Facebook ", "external_links": [], "published": "2017-10-27T15:29:00.000+03:00", "crawled": "2017-10-27T15:48:50.028+03:00", "highlightTitle": ""}