{"organizations": [], "uuid": "38abd4fdba62a17fc9a9ee3231779a6f9268a85d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13780268.ece/ALTERNATES/s1200/The-Pound-Falls-Against-The-Dollar-Ahead-Of-Theresa-Mays-Brexit-Speech.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/big-rise-business-rates-could-13780169", "country": "GB", "domain_rank": 21960, "title": "Big rise in business rates could be death knell for many companies, experts warn", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-18T17:45:00.000+03:00", "replies_count": 0, "uuid": "38abd4fdba62a17fc9a9ee3231779a6f9268a85d"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/big-rise-business-rates-could-13780169", "ord_in_thread": 0, "title": "Big rise in business rates could be death knell for many companies, experts warn", "locations": [], "entities": {"persons": [{"name": "helen dickinson", "sentiment": "none"}, {"name": "mike cherry", "sentiment": "none"}, {"name": "philip hammond", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "brc", "sentiment": "none"}, {"name": "fsb", "sentiment": "none"}, {"name": "british retail consortium", "sentiment": "none"}, {"name": "ashchem", "sentiment": "none"}, {"name": "journal", "sentiment": "none"}, {"name": "budget", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Big rise in business rates could be death knell for many companies, experts warn British Retail Consortium and Federation of Small Business say many firms won't be able to cope with 4% rise Share Money (Image: Getty Images Europe) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nPressure is growing on the Chancellor to freeze business rates after warnings that a big rise in inflation could signal the death knell for many companies. \nRates are set to rise by almost 4% next April because they are based on the retail price inflation rate for September. \nThe publication of the RPI rate at 3.9% earlier this week is expected to lead to a £1bn increase in business rates, but groups including the British Retail Consortium (BRC) and the Federation of Small Businesses (FSB) have warned that many companies will not be able to cope with the increases. \nEarlier this week The Journal reported that the North East has had some of the country’s highest rates of businesses being summonsed for non-payment of business rates, with one in eight companies around the region having failed to pay some or all of their rates. \nChancellor Philip Hammond is facing pressure to freeze business rates in his Budget in November, while the Government has been facing a number of calls for long-term reform on the property-based system that is widely thought to not reflect the realities of the modern world. \nBRC chief executive Helen Dickinson said: “The consequences of the RPI figures could be severe for many shops in a precarious position and struggling to survive. Consumers, already seeing household incomes eroded, will face further misery as the pound in their pocket buys them less at the checkout. \n“For retailers this will be compounded if UK Ministers fail to act and stem the hefty near four per cent rise in business rates, which is set to add an extra quarter of a billion pounds to retailers’ already unreasonable business rates burden. Helen Dickinson, the new Director General of the British Retail Consortium (Image: Handout) \n“For many shops this may be the last straw. Across the country, especially in economically deprived and vulnerable communities, the cost of failing to take action will likely be seen in yet more empty shops and gap-toothed high streets. \n“There are also other risks. Those shops who continue to trade may look to pass this extra rates cost onto hard pressed consumers. \n“Ministers’ mustn’t bury their heads in the sand. In his Budget next month, the Chancellor needs to get a grip on the matter and rule out a rise in business rates to help save shops, protect jobs, and preserve high streets.” \nMike Cherry, national chairman of the FSB, said: “The RPI figure follows six months of business rates misery for our small business community. Since April’s bruising revaluation we’ve had the staircase tax, introduction of an unworkable appeals platform and chronic delays to the Chancellor’s £435m relief package. Read More North East pharmacy chain Ashchem bought up by new chemists' group \n“A near 4% bill increase next April, on top of losing year one transitional caps, will be the last straw for many. \n“With the Brexit clock ticking, other nations are trying to tempt our entrepreneurs to their shores. The Budget is the Chancellor’s opportunity to position the UK as the best place in the world to do business. Bringing forward CPI-indexation for rates bills from 2020 to 2018 would be a good place to start. Our business rates are already the highest in Europe.” \nThe likely increase in business rates comes after a controversial revaluation earlier this year, which saw rates rise by as much as 60% for some businesses in London, though many North East firms saw their rates decreased. Like us on Facebook", "external_links": [], "published": "2017-10-18T17:45:00.000+03:00", "crawled": "2017-10-18T18:47:32.015+03:00", "highlightTitle": ""}