{"organizations": [], "uuid": "0ee228af118342af95c5b0139ebbb8f3fe16def0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article379030.ece/ALTERNATES/s1200/Live-Blog.png", "site_section": "", "section_title": "", "url": "http://www.devonlive.com/news/devon-news/live-live-traffic-weather-news-688187", "country": "US", "title": "", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "", "spam_score": 0.2, "site_type": "news", "published": "2017-10-27T18:23:00.000+03:00", "replies_count": 0, "uuid": "0ee228af118342af95c5b0139ebbb8f3fe16def0"}, "author": "Daniel Clark", "url": "http://www.devonlive.com/news/devon-news/live-live-traffic-weather-news-688187", "ord_in_thread": 0, "title": "", "locations": [], "entities": {"persons": [{"name": "sarah gotham", "sentiment": "none"}, {"name": "laura ashley", "sentiment": "none"}, {"name": "harry", "sentiment": "none"}, {"name": "bothma", "sentiment": "none"}, {"name": "vince cable", "sentiment": "none"}, {"name": "darryl goddard", "sentiment": "none"}, {"name": "cheriton fitzpaine", "sentiment": "none"}, {"name": "clarence", "sentiment": "none"}, {"name": "david davies-hind", "sentiment": "none"}, {"name": "vince", "sentiment": "none"}, {"name": "clarence hotel", "sentiment": "none"}, {"name": "helen smith", "sentiment": "none"}, {"name": "james bothma", "sentiment": "none"}, {"name": "pike", "sentiment": "none"}, {"name": "devon  lib", "sentiment": "none"}, {"name": "craig forbes", "sentiment": "none"}, {"name": "peter winterflood", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "anthony pike", "sentiment": "none"}], "locations": [{"name": "exeter city", "sentiment": "none"}, {"name": "whiddon down  a382 exeter road eastbound", "sentiment": "none"}, {"name": "wales", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "north devon district hospital  four", "sentiment": "none"}, {"name": "south west england", "sentiment": "none"}, {"name": "royal clarence", "sentiment": "none"}, {"name": "gotham", "sentiment": "none"}, {"name": "winslade park", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "devon county", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "haldon hill long", "sentiment": "none"}, {"name": "royal clarence hotel", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "ipplepen", "sentiment": "none"}, {"name": "north devon district hospital", "sentiment": "none"}, {"name": "clyst st mary", "sentiment": "none"}, {"name": "castle fine art gallery", "sentiment": "none"}, {"name": "newton abbot", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "forde park", "sentiment": "none"}, {"name": "grindle brook", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "haldon hill", "sentiment": "none"}, {"name": "powderham road", "sentiment": "none"}, {"name": "barnstaple", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}, {"name": "splatford split", "sentiment": "none"}], "organizations": [{"name": "royal british legion", "sentiment": "none"}, {"name": "playmobil", "sentiment": "none"}, {"name": "peppa pig  mothercare", "sentiment": "none"}, {"name": "winslade house", "sentiment": "none"}, {"name": "waterstones", "sentiment": "none"}, {"name": "community shop for cheriton fitzpaine", "sentiment": "none"}, {"name": "northern devon healthcare nhs trust", "sentiment": "none"}, {"name": "plymouth crown court", "sentiment": "none"}, {"name": "east devon district council", "sentiment": "none"}, {"name": "newton abbot  police", "sentiment": "none"}, {"name": "poppy appeal", "sentiment": "none"}, {"name": "friends life limited", "sentiment": "none"}, {"name": "exeter cathedral", "sentiment": "none"}, {"name": "clyst st mary", "sentiment": "none"}, {"name": "ladywell unit", "sentiment": "none"}, {"name": "royal british legion’s poppy shop", "sentiment": "none"}, {"name": "exeter poppy appeal", "sentiment": "none"}, {"name": "independent police complaints commission", "sentiment": "none"}, {"name": "costa coffee", "sentiment": "none"}, {"name": "cheriton fitzpaine community shop share offer", "sentiment": "none"}, {"name": "customer service team", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now \nWelcome to our live breaking news service on Friday, October 27, with the latest traffic, travel and weather advice as well as headlines from across Devon, the South West and beyond. \nIf there's anything you want Devonlive.com to know about, tweet @devonlivenews, message us on Facebook or email newsdesk@devonlive.com \nYou can also call 01392 348444. \nGet all the headlines, pictures, analysis, opinion and video on the stories that matter to you. Have you got anything to add? Get in contact with us on social media or email . \nFollow us on Twitter @DevonLiveNews - we're also on Facebook/devonlivenews. \nFollow all the latest in our live blog below. 17:14 Watch the moment a Carillion van driver executes a 'punishment pass' of cycle mum and daughter \nA driver who subjected a school-run mum to a so-called punishment pass has escaped with a warning from the police. \nMother Yarrow Wolfe was riding along a notorious stretch of road on the way to the Steiner Academy in Exeter earlier this month, taking what the Highway Code calls “primary position” in the centre of the lane. \nShe was shocked when the Carillion van passed her too closely and then cut in just feet ahead of her and her daughter, who was being towed behind her in a child buggy. 17:11 All lanes open on the A379 near Ikea in Exeter 17:07 Gas returns to Exeter homes after pipe is damaged at IKEA site \nGas supplies are now returning to 1,000 homes hit a serious gas leak in Exeter. \nThe houses were left without gas after contractors working on the construction of IKEA damaged a major pipe on Thursday night. \nWales & West Utilities had to shut off gas supplies in over 30 streets around the Rydon Lane area while engineers fixed the problem. \nThe damaged pipe has now been repaired and engineers are visiting each home to turn the gas supply back on. 17:01 Here is this weekend's weather forecast 17:00 Ikea gas leak \nOne lane of the A379 is still closed due to gas leak on A379 Northbound near Newcourt Way. 16:56 Man who stabbed Paignton lecturer to death in random attack jailed for life \nA “dangerous” man with paranoid schizophrenia has been jailed for life for stabbing a university lecturer from Paignton to death in a random attack. \nMark Loveridge, 39, had been cared for in the community since 2015 even though he had a history of violence and drug abuse which made his mental health worse. \nHe had stopped taking medication before he carried out unprovoked knife attacks on two young men as they made their way to work on January 19 last year \nDaniel Young, 30, from Paignton, died after being stabbed in the stomach in a park near Morden Tube station in south London. 16:23 Mothercare launch HUGE half price sale - and it includes Peppa Pig \nMothercare has launched a huge half price sale - just as many parents start their Christmas shopping. \nThe store has slashed the prices of hundreds of toys for little ones. \nWith 50% off many items, including Peppa Pig, Playmobil and many others - it’s the perfect time to bag a bargain. 16:20 Cheriton Fitzpaine residents launch community shop share offer \nA Community Shop For Cheriton Fitzpaine has got one step closer with the launch of a public Share Offer \nCheriton Fitzpaine’s one and only shop and post office closed in December 2016 and a small group of determined volunteers has been working ever since to find and secure a building site, draw up architects plans, apply for planning permission and put together a detailed business plan and share offer document. This week sees the launch of the Cheriton Fitzpaine Community Shop Share Offer. 16:15 Vehicle fire at Whiddon Down \nA382 Exeter Road Eastbound partially blocked at Whiddon Down, queueing traffic due to vehicle fire between A3124 and A30 (Whiddon Down / Merrymeet Junction). 16:08 Insulting Facebook post about paedophile pair lands man in a cell \nA judge threw a man in the cells during the first trial into the paedophile pair Sarah Gotham and Craig Forbes because he made insulting comments online about the defendants. \nJames Bothma, aged 31, was dragged before the Plymouth Crown Court amid fears of online vigilantes interfering with the case. \nBothma called Gotham and his former friend Craig Forbes “stupid c***” and urged people to attend the trial. 16:01 Missing man from Newton Abbot \nPolice are asking for help from members of the public to find a 20-year-old who has gone missing from Newton Abbot. \nDavid Davies-Hind, who is also known as Harry, was last seen at 10.45am on Friday heading in the direction of Forde Park in the town. \nA police spokesman said: “Harry is described as white, 5ft 10ins, slim build and long dark hair that may be in a ponytail. He was wearing a white t-shirt, cream linen trousers, black and orange trainers, and two wooden beaded bangles on the upper part of his arm. 15:32 Cathedral Yard Fire: How the blaze hit businesses near the Royal Clarence \nA year on from the Cathedral Yard fire and businesses around the Royal Clarence Hotel are still counting the cost of what was Exeter’s worse fire since the Blitz. \nAlong with the Royal Clarence, the neighbouring Castle Fine Art Gallery, Waterstones, Laura Ashley, Well House Tavern and Costa Coffee were all badly damaged or completely destroyed by the blaze. \nThe whole of Cathedral Yard was cordoned off with most businesses not able to reopen until at least a week after the fire. \nMost say that the loss of the Royal Clarence is still having an impact on trade 12 months on. 15:30 Burnt out car removed 15:09 Exeter Poppy Appeal shop opens as 30,000 red poppies to go on show in Exeter Cathedral \nThe Royal British Legion’s Poppy Shop in the Guildhall shopping centre opens on Saturday as more than 30,000 handcrafted red poppies made to mark the centenary of the First World War at the Devon County Show will go on display at Exeter Cathedral. \nFrom Saturday, October 28, until Saturday, November 11, the Royal British Legion have a pop-up shop from which they are selling poppies and collecting donations for the Poppy Appeal. 14:58 A38 at Haldon Hill has cleared 14:57 Husband chased ex's new boyfriend down street with knives \nAn estranged husband who chased his wife’s now boyfriend through a Devon village while carrying two kitchen knives has been given a suspended jail sentence. \nAnthony Pike was living across the road from his wife and her new partner when the build up of tension caused him to ‘lose it’ and go into the street with the knives. \nShop manager Pike had been drinking at a cricket club before the incident in Ipplepen, near Newton Abbot, in September. 14:20 Hospital staff suspended as death of baby sparks investigation \nStaff at the maternity unit of a Devon hospital have been suspended after a series of incidents - including the death of a baby, DevonLive.com understands. \nNorth Devon District Hospital in Barnstaple has confirmed that “changes to working patterns for consultants” have been introduced as a result of investigations into “recent incidents” at its maternity unit, known as the Ladywell Unit. \nAlthough no members of staff at the unit are currently suspended, DevonLive.com understands that there have been recent suspensions in connection with these incidents - though the hospital could not confirm how many people were previously suspended. 14:19 Ikea Gas Leak update - engineers still visiting affected properties to turn off the gas mains \nDarryl Goddard, Wales & West Utilities Area Engineering Manager for South West England said: “We have now visited 90% of affected homes to turn their gas off and are making good progress in repairing the damage to the pipe. We will need to visit every customer again to safely turn their gas back on. All our engineers are carrying identification. \n“This is a very complex job we are still not yet able to say how long it will take. We have more than 50 engineers working round the clock to get the gas flowing again as safely and as quickly as possible. \n“We are giving vulnerable customers in the area alternative heating and cooking facilities if required. If anyone needs assistance or knows of a neighbour who may, our Customer Service Team is ready to take your call. You can contact us on 0800 912 2999 or by enquiries@wwutilities.co.uk . Alternatively, you can contact us on Twitter @WWUtilities or Facebook.com/wwutilities. \n“We will keep people updated on our progress by posting information on our website, on social media and updating local media. \n“We would like to thank local people for their patience while we repair the damage caused to the gas network by contractors working in the area.” 14:14 Vince Cable discusses Brexit, the Lib Dems' future and visits to Devon \nLib Dem leader Sir Vince Cable says he ‘won’t criticise the public’ for voting to leave the European Union but the impact of Brexit is already being noticed in Devon and across the UK. \nSpeaking to DevonLive.com during a tour of the county on Friday morning, Sir Vince described the Government as ‘all over the place’ but said that despite challenges Devon had a lot of things going for it. 13:42 Mum of man who died because there ‘weren’t enough ambulances’ begins fundraising for her son’s funeral \nThe mother of a 30-year-old who was found dead at his home after paramedics were unable to attend because there weren’t any ambulances available, has begun fundraising for his funeral. \nThe Independent Police Complaints Commission are investigating the death of father-of-two Peter Winterflood, who was found underneath a wardrobe at an address in Powderham Road on September 23. \nNow, his mother Helen Smith has begun fundraising to pay for his funeral, and has written about her ‘worst nightmare’ of losing her son. 13:41 Wards closed as outbreak of norovirus confirmed at North Devon District Hospital \nFour wards at North Devon District Hospital were forced to close due to an outbreak of the vomiting and diarrhoea bug norovirus. \nNorthern Devon Healthcare NHS Trust is asking people not to visit the hospital if they have had, or been in contact with someone who has had, diarrhoea or vomiting in the last 48 hours, unless their visit is essential. \nNorovirus is a highly contagious gastro-intestinal virus, which causes diarrhoea and vomiting. 13:41 Iconic Ghostbusters car Ecto 1 and giant Stay Puft marshmallow man are in Exeter RIGHT NOW \nGhostbusters’ fans rejoice because the iconic car Ecto 1 and giant Stay Puft marshmallow man are in Exeter today - and crowds of people are currently eagerly waiting in line just to get a selfie with them. 13:39 Decision delayed on homes plan for ‘high risk flood zone' \nA decision of plans to build homes and employment land on a ‘high risk flood zone’ at Clyst St Mary has been delayed. \nThe plans, submitted by Friends Life Limited, are outline plans for 150 new homes and 0.7 hectares of employment land, which will include full permission for 67 homes and conversion of Winslade House and The Stables on the land at Winslade Park. \nThe application is also seeking outline permission for means of access only for up to 83 homes, new workplace units of 1,809sq m and associated infrastructure on the site of the Aviva buildings in Clyst St Mary. \nIt was due to go before East Devon District Council’s planning committee on Tuesday and had been recommended for approval – despite residents of Clyst St Mary have expressed major concerns due to the flood risk because historically the Grindle Brook and River Clyst have frequently caused severe damage. 13:04 \nHighways England are reporting 20 minutes of delays around the Splatford Split heading towards Exeter 13:03 Tickets for Exeter City in the FA Cup on general sale 12:39 This is the scene at the top of Haldon Hill Long delays on the A38 after earlier collisions 12:37 Cause of Exeter's devastating Royal Clarence Hotel fire 'will never be known' as report due \nThe cause of a fire which raged for three days and completely destroyed the oldest hotel in England will never be known, a report due out next week will reveal. Exeter’s Royal Clarence Hotel was reduced to a burnt-out shell containing smoldering ashes a year ago by the ferocious blaze which broke out in the early hours of Friday, October 28, and continued through the weekend. \nAround 100 firefighters were on the scene at the height of the fire, which started in the building housing Castle Fine Art on Cathedral Yard and spread to the iconic hotel, reputedly the oldest coaching inn in the country. \nA fire service report - due out on Friday but now delayed until next week - was expected to shed light on the origin of the devastating blaze. \nBut the destruction of the ancient terrace overlooking Cathedral yard was so bad that a meaningful probe into the cause was impossible. 12:36 ", "external_links": [], "published": "2017-10-27T18:23:00.000+03:00", "crawled": "2017-10-27T18:54:08.022+03:00", "highlightTitle": ""}