{"organizations": [], "uuid": "184dd90c4fdd24991ea0c595bb43cb479c072f50", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13157990.ece/ALTERNATES/s1200/IMG_20170608_161035.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/you-can-married-join-army-13752799", "country": "GB", "domain_rank": 21960, "title": "You can get married and join the army - but should you be allowed to vote at 16?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-12T18:00:00.000+03:00", "replies_count": 0, "uuid": "184dd90c4fdd24991ea0c595bb43cb479c072f50"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/you-can-married-join-army-13752799", "ord_in_thread": 0, "title": "You can get married and join the army - but should you be allowed to vote at 16?", "locations": [], "entities": {"persons": [{"name": "pip chamberlain", "sentiment": "negative"}, {"name": "corby", "sentiment": "negative"}, {"name": "corbett", "sentiment": "negative"}, {"name": "ian mearns", "sentiment": "none"}, {"name": "grahame morris", "sentiment": "none"}, {"name": "catherine mckinnell", "sentiment": "none"}, {"name": "ronnie campbell", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "chris skidmore", "sentiment": "none"}, {"name": "laura pidcock", "sentiment": "none"}, {"name": "mary glindon", "sentiment": "none"}, {"name": "yougov", "sentiment": "none"}], "locations": [{"name": "sunderland", "sentiment": "none"}, {"name": "blyth valley", "sentiment": "none"}, {"name": "easington", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "wales", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "north tyneside", "sentiment": "none"}], "organizations": [{"name": "newcastle north", "sentiment": "none"}, {"name": "snp", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}, {"name": "north west durham", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "cabinet office", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Pip Chamberlain tweeted her dog Corbett (Corby), voting in Sunderland from @chambopip saying: \"Despite the rain #VoteLabour #forthemany. Corby dog likes the sound of this @jeremycorbyn\" (Image: UGC TNE) Share Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nNorth East MPs have joined calls for the voting age to be lowered to 16. \nIt follows an apparent surge in the youth vote in June’s general election. \nMPs pointed out that 16 year olds can get married, pay income tax, become a company director, consent to medical treatment, and join the armed forces at 16 - but they’re not allowed to vote in a general election . \nThey could even join a political party and vote in the contest to choose a leader, who might go on to become Prime Minister. \nScotland has already cut the voting age to 16 for elections to the Scottish Parliament. Recent legislation also gave Wales the power to cut the voting age to 16 for the Welsh assembly. \nMPs have sponsored a Commons motion with “calls on the Government to give 16 and 17 year olds a say in their long-term future by legislating to reduce the voting age to 16 for all national and local elections and referendums at the earliest possible opportunity.” \nThose signing it include Blyth Valley MP Ronnie Campbell , North Tyneside MP Mary Glindon, Newcastle North MP Catherine McKinnell, Gateshead MP Ian Mearns, Easington MP Grahame Morris and North West Durham MP Laura Pidcock. Read More How will Brexit affect the North East? The Treasury knows but they're not going to tell you \nAccording to polling company YouGov, 57% of 18-19 year olds voted in June’s general election . This was a significant increase on the turnout figure of 43% in 2015, although not quite the surge in the youth vote that some people have claimed. \nLabour, the Liberal Democrats , the SNP and the Green party all supported reducing the voting age to 16 in their election manifestos this year. \nBut Conservatives reject the idea. poll loading Should the voting age be lowered to 16? 0+ VOTES SO FAR Yes - lower it to 16 No, leave it at 18 \nCabinet Office Minister Chris Skidmore this week told MPs the government had made no assessment of the impact of lowering the voting age, saying: “The Government have stated in their manifesto a clear commitment to maintain the voting age of 18, and therefore the Government have no plans to lower the voting age in elections.” Read More Mental health funding in Newcastle and Gateshead to be cut despite promises to improve services \nHe added: “The position of the Government remains clear: on the parliamentary franchise, the age will remain at 18. Of course, I look forward to the many contributions that will be made in the debate on that.” \nPrime Minister Theresa May also ruled out cutting the voting age earlier this year. She said: “This is one of those questions where you have to draw a line, you have to pick a point at which you think it is right for the voting age to be. \n“I continue to think it is right for it to be 18. Of course we now expect young people more to stay in education or training up to the age of 18 and I think that is an appropriate point at which we allow people to have a vote in parliamentary elections.” Like us on Facebook", "external_links": [], "published": "2017-10-12T18:00:00.000+03:00", "crawled": "2017-10-12T18:34:26.027+03:00", "highlightTitle": ""}