{"organizations": [], "uuid": "01f646290c24a59737e2a89947703dccff9a8d88", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13731174.ece/ALTERNATES/s1200/UKIP-Party-Conference-2017-Day-Two.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/sunday-politics-long-read-ukips-13731120", "country": "GB", "domain_rank": 21960, "title": "The Sunday politics long read: Ukip’s civil war, new leader and hopes for the future", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-08T10:00:00.000+03:00", "replies_count": 0, "uuid": "01f646290c24a59737e2a89947703dccff9a8d88"}, "author": "Sean Seddon", "url": "http://www.chroniclelive.co.uk/news/north-east-news/sunday-politics-long-read-ukips-13731120", "ord_in_thread": 0, "title": "The Sunday politics long read: Ukip’s civil war, new leader and hopes for the future", "locations": [], "entities": {"persons": [{"name": "henry bolton", "sentiment": "negative"}, {"name": "ukip", "sentiment": "negative"}, {"name": "david kurten", "sentiment": "none"}, {"name": "paul nuttall", "sentiment": "none"}, {"name": "nigel farage", "sentiment": "none"}, {"name": "john rees-evans", "sentiment": "none"}, {"name": "anne marie waters", "sentiment": "none"}, {"name": "geert wilders", "sentiment": "none"}, {"name": "marine le pen", "sentiment": "none"}, {"name": "jane collins", "sentiment": "none"}, {"name": "arnott", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "bolton", "sentiment": "none"}, {"name": "chroniclelive", "sentiment": "none"}, {"name": "jonathan arnott", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "north east ukip", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "kenya", "sentiment": "none"}], "organizations": [{"name": "ukip", "sentiment": "negative"}, {"name": "foreign office", "sentiment": "none"}, {"name": "islam", "sentiment": "none"}, {"name": "liberal", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Newly elected UKIP leader Henry Bolton stands on the beach (Image: Getty Images Europe) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nWhile everybody was focused on turmoil in the Conservative party and Brexit negotiations, Ukip were quietly going through an unpredictable and traumatic leadership election. \nThe party stared a deep, probably fatal, split in the face, survived an attempted takeover by the far-right and elected a former Liberal Democrat as their new leader - and nobody really noticed. \nIt’s the politics story of the year you probably missed - and North East Ukip MEP Jonathan Arnott has revealed all about the race from the inside. \nHe says that the stakes now couldn’t be higher for newly elected leader, Henry Bolton, admitting “either he succeeds or the party dies”. \nSo how did Ukip, the party which dominated the political agenda in the UK for several years, end up peering over the brink? And will they ever manage to attract North East voters en masse again? \nIt began on June 9. Following the departure of Paul Nuttall, who presided over the party’s disastrous June general election showing, Ukip began the process of selecting its third permanent leader since the resignation of Nigel Farage just 12 months earlier. \nMembers were presented with a crowded, seven-deep field of candidates - among them: John Rees-Evans, who said Brits with dual-citizenship should be paid £9000 to leave the UK; Jane Collins, who was told by a judge to pay £162,000 in damages to three Labour MPs she had libelled; and David Kurten, who allegedly once claimed homosexuality was linked to being sexually abused as a child. Jonathan Arnott MEP \nFor the entirety of the race there was no frontrunner, Mr Arnott said: “I didn’t know what was going to happen right up until the night before the result, it was incredibly difficult to predict. \n“There were arguments for believing that six of the seven candidates could have won it.” \nThe split-field left the path open for Anne Marie Waters, a far-right activist who models herself on controversial European figures like French presidential candidate Marine le Pen and Dutch politician Geert Wilders. \nArnott, like several other party figures, signalled to ChronicleLive back in July that he would leave the party in the event of an Anne Marie Waters victory. \nHe said: “Her political project is fundamentally flawed on two counts: first, her obsession with Islam depends on a series of falsehoods; and second, even if she was right about Islam, it wouldn’t lead to success for Ukip because it isn’t one of the main issues that comes up on the doorstep.” \nBut despite a concerted effort to commandeer the party from Ms Waters’ supporters, Ukip avoided a mass exodus of elected officials when an unlikely unity candidate emerged: Henry Bolton. \nA former Liberal Democrat who was born in Kenya, Mr Bolton is a former soldier, police officer and Foreign Office diplomat who, like Nigel Farage, is married to a woman born outside of the UK. \nBeating Ms Waters into second place with 29.9% of the vote to her 21.3%, he has signalled he wants to take the party in a more mainstream direction (although he appealed to the party’s right wing by telling reporters shortly after his victory that British culture is being “buried” by immigration and Islam). Read More What new UKIP leader Henry Bolton thinks of immigration and Islam \nMr Arnott didn’t back any candidate publicly but says he “spoke to [Bolton] the night before he was elected and passed on my personal best wishes” and that “on a private level I hoped that he would win” by the time conference came around. \nSo can Bolton restore Ukip as a force in British politics once again? \nMr Arnott says he is cautiously optimistic: “There’s going to be a huge task ahead of him, it was never going to be easy for anybody. \n“Since he’s been elected he’s said very much the right things about his vision for the party. \n“He has a lot of experience outside of politics which suggest he should be able to manage an organisation.” \nThe key to success, he said, will be to wait for the wheels to come of the government’s Brexit negotiating strategy. \nHe said: “We’ve got a lot of rebuilding to do in the North East and nationally and, if we’re going to get this right, there’s a lot to do before the council election in May. \n“The seats that will be up for election are the same as in 2014 when Ukip did incredibly well so there’s a very high watermark. \n“But I do think there could be a bounce back for Ukip next year - I think that is the point it will become crystal clear to people that the government are mishandling Brexit. \n“It’s a narrow path to get there but if we get it right there will come a moment where Ukip will have an opportunity to take off again.” \nFollowing the general election, Arnott resigned his position as party general secretary, again citing his opposition to the party’s stance on issues relating to Islam. \nAsked if he could see himself adopting a more central position in a Bolton-led Ukip, he said “I can see myself getting on with my job”, suggesting his focus is on his work as a North East MEP. \nMr Bolton’s victory may just have saved Ukip for now but, with Anne Marie Waters announcing her intention to form a new political group, the party’s quiet crisis may not yet be over. Like us on Facebook", "external_links": [], "published": "2017-10-08T10:00:00.000+03:00", "crawled": "2017-10-08T12:57:04.000+03:00", "highlightTitle": ""}