{"organizations": [], "uuid": "7bf94e0531ded3d2d1bc7e461b947385959c5649", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://i4.devonlive.com/news/devon-news/article624313.ece/ALTERNATES/s1200/emptyshops.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "devonlive - frontpage", "url": "http://www.devonlive.com/news/devon-news/empty-shops-tiverton-growing-concern-624305", "country": "GB", "title": "Empty shops in Tiverton a 'growing concern'", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-13T17:59:00.000+03:00", "replies_count": 0, "uuid": "7bf94e0531ded3d2d1bc7e461b947385959c5649"}, "author": "Lewis Clarke", "url": "http://www.devonlive.com/news/devon-news/empty-shops-tiverton-growing-concern-624305", "ord_in_thread": 0, "title": "Empty shops in Tiverton a 'growing concern'", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "none"}, {"name": "brenda hull", "sentiment": "none"}, {"name": "mrs hawkins", "sentiment": "none"}, {"name": "crediton", "sentiment": "none"}, {"name": "rosemary berry", "sentiment": "none"}, {"name": "samantha hawkins", "sentiment": "none"}, {"name": "sam", "sentiment": "none"}, {"name": "cullompton", "sentiment": "none"}, {"name": "john bodley scott", "sentiment": "none"}, {"name": "addie", "sentiment": "none"}], "locations": [{"name": "tiverton", "sentiment": "none"}, {"name": "devon live", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "cullompton outer", "sentiment": "none"}, {"name": "broad oaks", "sentiment": "none"}, {"name": "cullompton", "sentiment": "none"}], "organizations": [{"name": "economy policy development group", "sentiment": "none"}, {"name": "children's hospice south west tiverton friends group’s craft & food fair", "sentiment": "none"}, {"name": "hawkins insolvency", "sentiment": "none"}, {"name": "crediton", "sentiment": "none"}, {"name": "council’s economic development team", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Empty shops in Tiverton a 'growing concern' Internet shopping boom, Brexit and the crash of 2007 has hit retailers hard says insolvency firm Share Empty shops in Tiverton are a cause for concern Share Comments \nCouncillors have expressed disappointment in the number of empty shops in Tiverton. \nSpeaking at the Economy Policy Development Group on Thursday, September 7, Councillor Brenda Hull (Castle, Conservative) said: “It’s very disappointing to see the number of empty shops that we have, and I know how difficult times are. Hopefully, we can get some of these filled up again. \n“I think the town is looking really good at the moment. The flowers are looking exceptionally good, and I think it’s looking very attractive which is not helping to fill the shops, but it is helpful.” Read More Gifts and treats galore as new shop Addie & Sam opens in Cullompton \nCouncillor Rosemary Berry (Cullompton Outer, Conservative) questioned why Crediton’s town centre seemed “hugely better” than either Cullompton or Tiverton. \nIn response to her question, John Bodley Scott, the Council’s Economic Development Team Leader said: “Crediton does have its own retail economy which is much more based on independent shops. \n“It’s also got a number of businesses which are down some of the alleys, and what has happened, is some of those have, when shops have become available, come out onto the front, so there seems to be a constant stream of shops moving up, or shifting around that central part, which is why it always full. \n“What you don’t see is outside of the shopping area, there are number retail units that were in the past closed, so there has been a consolidation of shops towards the shopping area.” Read More Something for everyone at Children's Hospice South West Tiverton Friends Group’s Craft & Food Fair \nSpeaking to Devon Live, Samantha Hawkins, from Hawkins Insolvency said: “Everybody knows about the 2008/09 crash and retailers thought they were going to recover from that, but what we didn’t take into account is the surge of online shopping is never going to change. \n“The retail sector has been experiencing uncertain times since the online shopping boom. \n“I also think that the consumer mind-set has changed. People are less frivolous now than they were when credit easily available. From my point of view, the high street has an eco-system. You have a high street with butchers, bakers and coffee shops all selling goods which people need on a daily basis. \n“You will rarely see an ironmonger on the high street anymore or a haberdashery, and you’ll very rarely see a greengrocer. If businesses are to survive, they need to give customers a reason to go into their shop. If you excel in anything, footfall is not going to come in.” Read More Exeter's Oggy Oggy Pasty Co: 'We are not going anywhere' \nMrs Hawkins continued to say that shop closures can have a domino effect on the rest of a town centre. \n“If you see a row of shops closed, why would you take a lease on a shop in the middle or at the end? It has a knock on effect that impacts the whole community. If you can’t get all your goods on the high street, you’ll end up going to the supermarket. \n“This affects locally embedded independent shops. If your butcher closes down, perhaps your baker will close down as well. It has a wider impact because it’s not good for a high street to have empty units.” \nMrs Hawkins added that the closure of firms like Broad Oaks last year would have also affected the community with fewer people spending money in the town. \n“Smaller independent retailers realise that they have to diversify to survive or recognise that things are never going to get any better because the internet isn’t going to go away, Brexit isn’t going to go away, and the crash of 2007 isn’t going to go away. \n“They either diversify, or they have to have a total restructure and rethink their business model.” Like us on Facebook", "external_links": [], "published": "2017-10-13T17:59:00.000+03:00", "crawled": "2017-10-13T18:16:09.000+03:00", "highlightTitle": ""}