{"organizations": [], "uuid": "d0c85b0889bdc046c35795f20a59ac0f8bada76e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13770697.ece/ALTERNATES/s1200/Payments-survey.jpg", "site_section": "http://www.thejournal.co.uk/business/?service=rss", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/thousands-north-east-firms-hauled-13770654", "country": "GB", "domain_rank": 21960, "title": "Thousands of North East firms hauled into court as they struggle to pay rising business rates", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-16T19:14:00.000+03:00", "replies_count": 0, "uuid": "d0c85b0889bdc046c35795f20a59ac0f8bada76e"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/thousands-north-east-firms-hauled-13770654", "ord_in_thread": 0, "title": "Thousands of North East firms hauled into court as they struggle to pay rising business rates", "locations": [], "entities": {"persons": [{"name": "mark rigby", "sentiment": "none"}, {"name": "philip hammond", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "tyne", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}, {"name": "north east england", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "metrocentre", "sentiment": "none"}, {"name": "wales", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "north tyneside", "sentiment": "none"}, {"name": "tyneside", "sentiment": "none"}], "organizations": [{"name": "cvs", "sentiment": "none"}, {"name": "local government", "sentiment": "none"}, {"name": "gateshead council", "sentiment": "none"}, {"name": "middlesbrough borough council", "sentiment": "none"}, {"name": "federation of small businesses", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "cbi", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "bannatyne group", "sentiment": "none"}, {"name": "chamber of commerce", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Thousands of North East firms hauled into court as they struggle to pay rising business rates In North Tyneside more than one in three of all rateable businesses were issued with court summons Share Get business   Thank you for subscribing!   \nPressure to reform the controversial system of business rates is growing after new figures showed more than 7,500 companies in the North East were summonsed for non-payment. \nThe total of 7,693 firms in Tyne and Wear , Northumberland and County Durham summonsed for non-payment of business rates in 2016-7 represents one in eight companies in the region, with North Tyneside having the highest rate of non-payment in the country at 34% of companies eligible for the payment. \nThe figures have been unveiled in a Freedom of Information request carried out by rents specialist CVS, which also revealed Middlesbrough Borough Council issued the second biggest percentage of summonses, writing to 27% of firms calling them before magistrates. \nA number of business organisations - including CBI, the North East England Chamber of Commerce and the Federation of Small Businesses - have called on the Government to reform business rates, saying their basis on property values is no longer a fair reflection of a company’s value. \nThe huge rate of businesses struggling to pay the rates will add to the reform calls, with CVS chief executive Mark Rigby now calling on Chancellor Philip Hammond to freeze 2018 business rates as part of his Autumn Budget next month, saying the economic environment is already punishing struggling businesses. \nHe said: “Brexit is driving inflation. Import prices have risen given the fall in the pound with prices rising faster than wages, causing households to ‘tighten their belts’ on spending, especially on ‘big ticket’ items. Business investment has slowed and confidence fallen. \n“Against this backdrop we already have the highest property taxes not only in Europe, but the world. The Chancellor must be bold within his upcoming Budget next month through an unprecedented stimulus of freezing rate rises in April 2018.” Read More Bannatyne Group to create 'hundreds of jobs' with £50m investment \nThe CVS statistics show that 164,757 business premises in England and Wales were hauled before a magistrate in 2016/2017 after failing to pay their business rates, equating to around one in every eight businesses in the UK. \nIn the current financial year alone, starting from April 1 when the controversial business rates revaluation took place, to the end of August, a total of 81,093 businesses have already been summoned to court for failing to pay their business rates. \nIn the North East, Gateshead council issued 16% of all of its liable businesses with summonses, with more than 1,000 being affected. Newcastle (9%) and Northumberland (7%) had the region’s lowest rates of non-payment. \nCVS expects a hefty rise in business rates next year, as the September Retail Price Index (RPI), used to determine the following year’s increase, is set to come in at 4% when official figures are released. Read More Pop-up Christmas shop coming to Metrocentre to sell booze-filled baubles and North craft drinks \nIt means the Government could rake in an extra £1.2bn in business rates - which are calculated based on the rateable open rental value of a premises - on top of the £23.9bn it is expected to bring in from English businesses this year. \nA spokesman for the Department for Communities and Local Government said: “Following the recent revaluation, the majority of businesses will see a fall in their rates from this year. \n“In addition (in) the spring Budget the Chancellor announced a £435m package of rate relief that is now being rolled out across the country.” Like us on Facebook", "external_links": [], "published": "2017-10-16T19:14:00.000+03:00", "crawled": "2017-10-16T19:31:12.002+03:00", "highlightTitle": ""}