{"organizations": [], "uuid": "5b8215c2aa80b8f989c6483b181a7e4340cdde6a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13563586.ece/ALTERNATES/s1200/MKR_NEC_010917rights_12.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/history/earl-grey-martin-luther-king-13814120", "country": "GB", "domain_rank": 21960, "title": "From Earl Grey to Martin Luther King - the North East's links with civil rights", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-26T18:00:00.000+03:00", "replies_count": 0, "uuid": "5b8215c2aa80b8f989c6483b181a7e4340cdde6a"}, "author": "Amanda Cashmore", "url": "http://www.chroniclelive.co.uk/news/history/earl-grey-martin-luther-king-13814120", "ord_in_thread": 0, "title": "From Earl Grey to Martin Luther King - the North East's links with civil rights", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Dr Martin Luther King, the American civil rights leader, pictured at Newcastle University for the receiving of an honorary degree of Doctor of Civil Law Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nAs Black History Month draws to a close the region’s role in the civil rights movement has been thrown into focus. \nNorthumbria University’s Brian Ward is famed for having tracked down parts of Martin Luther King’s 1967 speech at Newcastle University . \nHis primary question was why would King make the trip: “As an American historian, what interested me was why would he bother?” \nThrough Ward’s research, he found that there were a long line of civil rights figures passing through the region, long before King. \nIn 1853, William Wells Brown, who had been a slave in the US, visited Newcastle and remarked on the kindness of the Geordies he met there. He is quoted as saying, “In no place in the United Kingdom has the American Slave warmer friends than in Newcastle.” Read More Newcastle's iconic Tyne Bridge is to host the spectacular Freedom on the Tyne finale \nNewcastle pushed hard for the abolition of the slave trade, then slavery, and then American slavery. The historian believes the fight for black rights came about here because of popular political radicalism, religious dissent, and a free press coupled with an public who could read. \nAlthough the North East wasn’t as implicated in the trade as hubs like London and Bristol, Ward explains that the region was still involved in slavery and the horrors it brought. “Someone built those ships and made those manacles. Every time someone in the North East put ginger in their food, or drank rum, or sweetened their tea with sugar - they were implicated in the slave trade.” \nHowever, those who had a stake in the slave trade were not put out of business due to its abolition - they had a greater stake in business globally, which meant there was less of a backlash. \nOf course, the tales of the black slaves who visited Newcastle should never be forgotten either. Northumbria University’s Professor Brycchan Carey tells the story of some of the key figures of the abolition movement. Frederick Douglass who escaped slavery in America and went on fight for African-American rights \nFrederick Douglass was one of the most prominent characters of racism and slavery in the 19th century. He escaped slavery in Maryland, catching a train to Philadelphia with false papers. \nDouglass wrote a memoir, then visited Newcastle on his book tour. He was amazed at the support he received here - two local women fundraised £150 to buy his freedom from the slavers he ran away from. \nFrederick is quoted as saying that the money was, “to protect my ransom from slavery.” \nProfessor Carey explains that his choice of words is key: “He calls it a ransom - he doesn’t say it’s the price of his freedom. In American law, it was his freedom being bought.” \nAnother slave who found relief when coming to the North East was Bill Richmond. He became a servant for the second Duke of Northumberland after leaving slavery in the US in 1777. \nRichmond became a nationally famous boxer in England, and was taught to read and write at the expense of the Duke. \nWithout a doubt, the most famous visit to Newcastle was Martin Luther King in 1967, when he received his honorary doctorate from Newcastle University. Read More Fragile mementoes of Martin Luther King's visit to Newcastle go on display \nProfessor Ward explains that the speech given by King after being awarded his doctorate did not include anything new by way of content, but the intertwining of his key talking points was powerful. “There’s nothing much that he hasn’t said somewhere else in some shape or form before in terms of substance, but the way that he actually brings these things together to make a speech that’s perfect for the occasion… he’s a masterful orator.” \nKing was at that point a celebrity. His visit to the UK prompted national media coverage, and Ward credits The Evening Chronicle for its reporting throughout the civil rights movement. \n“It wouldn’t say it was a crusading newspaper, but its editorials are almost always sane and sensible. I think a conscientious and widely available media and press is really important process, and it remained so in the 60s.” \nIs it important is it to remember the North East’s history with the civil rights movement and racism today, with tensions at a high following Brexit? Ward says resolutely: “Absolutely.” Like us on Facebook", "external_links": [], "published": "2017-10-26T18:00:00.000+03:00", "crawled": "2017-10-26T18:18:37.007+03:00", "highlightTitle": ""}