{"organizations": [], "uuid": "1f1c109b8d36d5ffc6641d3b53ad4667ef017e4b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13827704.ece/ALTERNATES/s1200/bills.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/how-queens-speech-affect-you-13219242", "country": "GB", "domain_rank": 21960, "title": "Travel, health, Brexit and mortgages - the new laws planned for the next two years", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-29T20:00:00.000+02:00", "replies_count": 0, "uuid": "1f1c109b8d36d5ffc6641d3b53ad4667ef017e4b"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/how-queens-speech-affect-you-13219242", "ord_in_thread": 0, "title": "Travel, health, Brexit and mortgages - the new laws planned for the next two years", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "negative"}, {"name": "bill  this bill", "sentiment": "none"}, {"name": "bill", "sentiment": "none"}], "locations": [{"name": "crewe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}], "organizations": [{"name": "getty images europe", "sentiment": "none"}, {"name": "armed forces bill  enables", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "draft domestic violence", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily   Thank you for subscribing!   \nThe are the new laws that could be changing your life over the next two years. \nThey were announced by the Government as part of the Queen’s Speech earlier this year - and here’s a complete run-down. \nFirst, an explanation about the jargon. These proposed laws are called “Bills” because they haven’t been approved by Parliament yet. \nIf they are approved by Parliament, and receive Royal Assent from the Queen, then they become “Acts” instead. \nSo here’s what’s planned: Automated and Electric Vehicles Bill An electric vehicle is re-charging at a point (Image: Getty Images Europe) \nSets up a national network of charging points in garages and motorway service stations for electric cars, and ensures that insurance is available for self-driving cars. The aim is to help motor manufacturers by making their products more attractive to motorists. Space Industry Bill \nMakes it easier for businesses to launch spacecraft, from satellites to trips into space for tourists. High Speed 2 Phase 2A Bill \nAllows the extension of the high speed rail line from Birmingham to Crewe. Laws have already been approved which allow the line from London to Birmingham to be built. Smart Meter Bill \nContinues the process of putting smart gas and electricity meters in homes. Travel Protection Bill \nGives more protection to travellers who book a holiday on the internet, for example if the travel company goes bust. Draft Tenants’ Fees Bill \nBans landlords and estate agents from forcing tenants in private rented accommodation to pay letting fees. It also fixes the maximum security deposit that can be demanded at one month’s rent. Draft Domestic Violence and Abuse Bill \nCreates a Domestic Violence and Abuse Commissioner, creates a legal definition of domestic abuse and allows courts to hand down a tougher sentence if a child is affected by domestic abuse. Civil Liability Bill \nThis Bill is designed to crack down on fraudulent whiplash claims and is expected to reduce motor insurance premiums by about £35 per year. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now Courts Bill \nEnds direct cross examination of domestic violence victims by their alleged perpetrators in the family courts, allowing more victims to participate in trials without having to meet their alleged assailant face-to-face. Financial Guidance and Claims Bill \nCombines three financial advice bodies into one, ensuring that people across the UK are able to seek the help and advice they need to manage their finances. Goods Mortgage Bill \nMakes it easier to take out a mortgage on objects such as a car. Armed Forces Bill \nEnables limited flexible working in the armed forces. Read More", "external_links": [], "published": "2017-10-29T20:00:00.000+02:00", "crawled": "2017-10-29T20:30:19.017+02:00", "highlightTitle": ""}