{"organizations": [], "uuid": "b1c4d689b63aa6f989e04362175f3ce051829f0e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13747703.ece/ALTERNATES/s1200/Manufacturing-figures.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-manufacturers-fear-future-13747648", "country": "GB", "domain_rank": 21960, "title": "North East manufacturers fear for the future despite good current performance", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-12T02:01:00.000+03:00", "replies_count": 0, "uuid": "b1c4d689b63aa6f989e04362175f3ce051829f0e"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-manufacturers-fear-future-13747648", "ord_in_thread": 0, "title": "North East manufacturers fear for the future despite good current performance", "locations": [], "entities": {"persons": [{"name": "john mccabe", "sentiment": "none"}, {"name": "jonathan walker", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "north east england", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "federation of small businesses", "sentiment": "none"}, {"name": "north east england chamber of commerce", "sentiment": "none"}, {"name": "share workers", "sentiment": "none"}, {"name": "vertu motors", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "chamber of commerce", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "North East manufacturers fear for the future despite good current performance Quarterly Economy Survey from the North East England Chamber of Commerce highlights fears for the future Share Workers in a factory (Image: PA) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nManufacturers in the North East are performing well but worried about their future, a regional survey has shown. \nThe Government’s lack of clarity over Brexit has been blamed for the fall in confidence among manufacturers after it was shown up in the latest North East England Quarterly Economic Survey. \nThe survey, which is published by the North East England Chamber of Commerce , is the largest independent analysis of business opinions in the region. \nThe results for the most recent survey show that most key indicators for businesses in the region are generally in positive territory. Companies’ sales and orders, both in the UK and overseas, are growing, with firms continuing to perform strongly and showing a substantial increase on this time last year. \nCompanies in the service sector are still positive about the future but there has a marked dramatic downturn in the future confidence among manufacturers. \nChamber president John McCabe said: “It is easy to speculate why there is this outlook when in reality there a number of factors that affect business confidence. However, the ongoing uncertainty about our future trading relationship with Europe is clearly inhibiting exporters’ ability to plan ahead. North East England Chamber of Commerce president John McCabe \n“The Chamber has been pushing the Government to provide reassurance and clarity to businesses. Regardless of individual perspectives on the referendum and Brexit , it is imperative that our manufacturers are safe in the knowledge they will be able to access all potential markets. \n“If this reassurance is provided, then hopefully the fears expressed in this survey will not come to pass.” \nThe Chamber survey comes just two weeks after research by the Federation of Small Businesses highlighted business confidence falling to the lowest level since the EU referendum, with the political climate the main cause of the problem. Read More Vertu Motors hits record profit levels but drop in sterling delays acquisition plans \nJonathan Walker, Chamber head of policy and campaigns, said: “Perhaps the most striking aspect of this quarter’s results is the dramatic decline in the future turnover, profitably and workforce scores for manufacturing sector, which is in stark contrast to the optimism shown by service sector businesses. \n“While the uncertainty over future trade is a likely contributor to this, a more immediate factor is the effect of exchange rate fluctuations. More than two-thirds of our manufacturers see this as a growing concern, while increased competition was the highest overall concern. \n“The fieldwork for this survey coincided with a consistent slide in the value of the pound vs the Euro, which may have fed these concerns, especially for businesses who rely on importing components and products.” Like us on Facebook ", "external_links": [], "published": "2017-10-12T02:01:00.000+03:00", "crawled": "2017-10-12T02:41:27.027+03:00", "highlightTitle": ""}