{"organizations": [], "uuid": "02287d5fc186fa9cc4eb9dfa233289330716d000", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article13723398.ece/ALTERNATES/s1200/GWR_-NJL_051017expo_01.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/newcastle-city-leader-says-government-13723326", "country": "GB", "domain_rank": 21960, "title": "Newcastle city leader says Government has 'turned our back to Europe'", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-05T20:00:00.000+03:00", "replies_count": 0, "uuid": "02287d5fc186fa9cc4eb9dfa233289330716d000"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/newcastle-city-leader-says-government-13723326", "ord_in_thread": 0, "title": "Newcastle city leader says Government has 'turned our back to Europe'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Newcastle city leader says Government has 'turned our back to Europe' Nick Forbes hits out at poor UK presence at major investment event in Europe Share Get business   Thank you for subscribing!   \nA city leader in the North East has hit out at the lack of representation for the UK at one of Europe’s top trade shows as he tries to get investment for the region in the run-up to Brexit . \nNewcastle City Council leader Nick Forbes is representing the city at the Expo Real event in Munich, Germany, where business and political leaders from around the world are competing to attract investment to their cities. \nAround 30,000 people are expected to attend the three-day event, with Coun Forbes flying the flag for Newcastle alongside city leaders from other UK cities, including Manchester, Glasgow and Liverpool. \nBut Coun Forbes expressed his frustration at finding that the event had no presence from the UK Government , particularly at a time when the Brexit negotiations have made attracting investment to the UK more crucial than ever. Labour Councillor Nick Forbes \nCoun Forbes recently used his annual State of the City speech to highlight the need to attract investment to Newcastle following recent successes in bringing in new employers and attracting funding for multimillion-pound developments at Science Central and the Stephenson Quarter. \nIn a tweet from the event, Coun Forbes said: “30,000 potential investors and the UK doesn’t even have its own stall, let alone British sponsors. It’s like we’ve turned our back to Europe.” Read More Devolution for North of Tyne 'possible this year', says Treasury Minister \nHe later told The Journal : “It is vital we are ahead of the curve on job creation, given the uncertainty of Brexit. \n“We cannot simply pull up the drawbridge and hope for the best. We have to be seen to be part of the global economy, and events such as this are a big part of promoting Newcastle to an international audience. \n“I was shocked and surprised to see that there wasn’t a specific stand promoting the UK. Other European countries were well represented, but the only UK presence was a small joint stand with Ireland, sponsored by Dublin airport and HSBC. \n“This is surely a missed opportunity to promote Britain at such an important and significant gathering of international investors. \n“While Tory ministers plot about who will become Prime Minister, the uncertainty they create risks damaging our economy. Now, more than ever, is the time to tell the world we are open for business.” Read More Newcastle needs Brexit deal that doesn't undermine its economic growth, leader says \nExpo Real is Europe’s larges real estate and investment event, and is known as a prime market place for cities wanting to attract overseas investors to back job creation schemes. \nThe event attracts more than 30,000 participants from 77 different countries, with most major cities having a presence at it. \nA spokesman for the Department for International Trade said: “We do have someone at this event and we’ll be looking to attract more investment at the Mipim UK event later in October.” Like us on Facebook", "external_links": [], "published": "2017-10-05T20:00:00.000+03:00", "crawled": "2017-10-05T20:14:12.002+03:00", "highlightTitle": ""}