{"organizations": [], "uuid": "7e9ef31cb1d878a7f48d2944440fd3307fda4638", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://i2.leicestermercury.co.uk/news/article177107.ece/ALTERNATES/s1200/EastMidsAirport.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/news/local-news/east-midlands-airport-new-destinations-671442", "country": "US", "domain_rank": 48128, "title": "Expansion and new destinations could be on the way at East Midlands Airport - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.983, "site_type": "news", "published": "2017-10-24T10:05:00.000+03:00", "replies_count": 0, "uuid": "7e9ef31cb1d878a7f48d2944440fd3307fda4638"}, "author": "Dan Robson", "url": "http://www.leicestermercury.co.uk/news/local-news/east-midlands-airport-new-destinations-671442", "ord_in_thread": 0, "title": "Expansion and new destinations could be on the way at East Midlands Airport - Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "cliffe", "sentiment": "none"}, {"name": "andy cliffe", "sentiment": "none"}, {"name": "andy", "sentiment": "none"}], "locations": [{"name": "east midlands airport", "sentiment": "none"}, {"name": "heathrow", "sentiment": "none"}, {"name": "frankfurt", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "east midlands airport great", "sentiment": "none"}, {"name": "west coast", "sentiment": "none"}, {"name": "bournemouth airport", "sentiment": "none"}, {"name": "toton", "sentiment": "none"}, {"name": "amsterdam", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "castle donington", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "usa", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "north west", "sentiment": "none"}, {"name": "south east", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "segro logistics park east midlands gateway", "sentiment": "none"}, {"name": "india", "sentiment": "none"}, {"name": "bournemouth", "sentiment": "none"}, {"name": "stansted", "sentiment": "none"}, {"name": "midland", "sentiment": "none"}, {"name": "ningbo", "sentiment": "none"}, {"name": "london stansted", "sentiment": "none"}, {"name": "midlands engine", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "schiphol", "sentiment": "none"}, {"name": "east midlands", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}], "organizations": [{"name": "leicestershire enterprise partnership", "sentiment": "none"}, {"name": "ryanair", "sentiment": "none"}, {"name": "manchester airports group", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "dhl", "sentiment": "none"}, {"name": "ups", "sentiment": "none"}, {"name": "nottingham post", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Expansion and new destinations could be on the way at East Midlands Airport The airport has bounced back after the economic crash Share Click to play Tap to play The video will start in 8 Cancel Play now Comments \nThe managing director of East Midlands Airport has signalled that change could be on the horizon at the busy transport hub. \nThe airport is bouncing back after the economic crash forced many families to scale back their holiday plans. \nThat means Andy Cliffe can consider the next stages of growth - and the potential is great. \nWhile the summer season passenger load has finally equalled the golden era of 2008, climbing by about 200,000 each year to reach 3.3 million people again in the six months to September 30 this year, the annual figure continues to lag at 4.7 million compared to around 5.8 million nine years ago. \nMr Cliffe told the Nottingham Post that winter traffic has not yet reached the same heights as before but he also acknowledges another key issue – the lack of major European hubs, all key economic centres that also offer links to the rest of the world, in the list of destinations available to the East Midlands traveller. “Those short-haul destinations are an ambition to us, for sure, and it is an immediate priority for us,” he says. \n“Places like Paris and Amsterdam, with multiple daily frequencies, are the types of services we want to get back. \n“They’ll be crucial in supporting trade from our industries. In a post-Brexit climate, that connectivity to the European market is going to be really important, but it also gives us wider connections as well. \n“If you fly to Frankfurt, for example, you can then connect to long-haul flights. It’s the same principle to Paris and Amsterdam. We know there’s demand in our region that we can serve better, and there’s definitely an opportunity to provide more business services. \n“But when we put those services on, it will be really important for the major businesses around our region to support them. The dilemma is it’s a ‘use or lose it’ situation.” \nFurther afield, many businesses and the universities would like to see connections to second-tier Chinese cities such as Ningbo, India and the United States – all key markets in the post-Brexit world alluded to by Andy. Andy Cliffe, managing director of East Midlands Airport \nHe adds: “Long-haul connectivity is also an ambition. The region has important connections into the Indian subcontinent, which is a key focus for us. \n“There’s a lot of businesses in the East Midlands that want to connect into the West Coast of the USA and New York. \n“But you have to bear in mind that Manchester is the only airport outside London to attract a Chinese flight. \n“They’re difficult to make stick but we have talked about the ambition for East Midlands. \n“We’ve joined trade missions with colleagues from the region and began a sister relationship with an airport in Ningbo last year, which is about collaboration between our cities and regions. \n“It’s those sorts of things that start to provide a platform for connectivity going forward.” Read More Video shows brave pilots battling crosswinds to land at East Midlands Airport \nQualified accountant Andy, 44, has spent 18 years with Manchester Airports Group (MAG), the parent company of East Midlands Airport (EMA) that also owns Manchester, London Stansted and Bournemouth airports. \nHe became managing director of EMA four-and-a-half years ago, with Bournemouth Airport – the smallest in the group by far – also in his remit. \nAlthough he commutes from his home in the North West, he spends a lot of time in Castle Donington and sits on East Midlands groups including Marketing NG and Leicester and Leicestershire Enterprise Partnership. \nDuring his time at the helm, he says a “huge amount” has changed. \nOne of his first major challenges was to replace the gap left after Monarch pulled out of the airport in April 2015 (before its eventual demise this year). Jet2 plane at East Midlands Airport \nThe airline had begun operating at East Midlands after Castle Donington-based British Midland and BMIbaby – which had offered routes to major airports including Brussels, Paris and Schiphol – ceased trading three years earlier. \nAndy says: “We lost 10 percent of our traffic as Monarch provided 450,000 passengers a year. \n“We backfilled those with a combination of Jet2.com and Ryanair to different destinations, and now we’ve got all that back, constantly growing during that period. \n“We’ve grown well and the performance of the business has been very strong over the past number of years, adding new routes and carriers into the mix. \n“During that time, there’s been no bit of terminal infrastructure we haven’t improved, while we’ve also introduced new car parking systems and expanded the security area. \n“All those things have led us to a point where we’re getting the best customer experience scores in the airport’s history.” Read More This is why you should always queue early for a Ryanair flight if you're carrying hand luggage East Midlands' role within wider airport group \nAs part of MAG, which is headquartered in Manchester, East Midlands is very much one of the little brothers as the third largest out of the four airports. \nIn its most recent accounts, revenue grew by 3.6 percent to £62.4m for the year to March 2017 – far behind Manchester’s 12.5 percent growth to £444.5m, but slightly above the three percent figure for Stansted, which had a £294.1m turnover. \nManchester has also enjoyed the highest increase in passenger numbers – 11.5 percent up to 26.2 million – while Stansted’s 4.7 percent rise to 24.3 million slightly eclipses East Midlands’ 4.4 percent growth to 4.7 million. \nAndy stresses, though, that EMA demands as much attention as others in the group, pointing out the £50m investment over the past five years. East Midlands Airport \nThis included a new £15m runway last year that required the temporary closure of the airport, terminal improvements costing £16m in 2014 and other investments in customer-facing areas, such as expanding the security area. \n“The focus is right across all our airports,” says Andy, who is part of the MAG executive committee. \n“MAG sees the East Midlands as an opportunity for growth, which is set within our long-term vision.” \nAndy’s vision for the future – one which he says is shared by MAG and part of its business plan – is to more than double passenger numbers to 10 million and almost treble the amount of freight to a million tonnes by around 2030 to 2035. That could also mean the number of employees, currently at 7,000 people, doubling. Read More Leicestershire distribution complex bids to become a main supplier for £16.5bn Heathrow expansion Creating an airport fit for the 21st century \nWith the core of the current airport built in 1965, he has previously spoken about building a new terminal once it reaches six million passengers. \nIs that still on the agenda? \n“Potentially,” says Andy. “We will continue to review how best to accommodate the rising number of passengers. \n“We’ve had 5.6 million people at our peak so 6.5 million is a good planning number. \n\"We’re looking at the options for how to expand facilities. It’s likely that we will incrementally expand in the short-term and then look at significantly expanding thereafter. “It wouldn’t be another terminal, it would be an expansion or a replacement of the existing building.” \nWhile the airport already sits as the central transport hub in the region, Andy believes it could become an even more vital cog. \nGetting the links right to the HS2 hub station in Toton is crucial, and the airport has been mentioned prominently in Midlands Connect, the emerging transport plan that is part of the Midlands Engine strategy. \nAndy adds: “International connections and access to global markets is one of the fundamental parts of the Midlands Engine and Midlands Connect strategies, while the airports themselves provide economic assets in terms of the number of people we employ. \n“The East Midlands is forecast to be one of the fastest-growing regions outside the South East in the next year, and we have a hugely important role to play. \n“That’s a huge opportunity and one we can definitely grasp if we all come together and work for a common purpose that takes advantage of the strengths each of the three cities has.” East Midlands Airport Great for freight \nIt's not all about passengers for East Midlands Airport. \nIt is the UK’s largest pure freight airport – for aircraft dedicated to carrying cargo – in the UK. \nEvery year, it carries a total of 350,000 tonnes of freight and cargo through a 24/7 operation, facilitating about £9 billion of trade and exports. \nLogistics giant DHL has grown by 50 percent after a £90m expansion to the south west of the airport, while UPS has submitted a planning application for a similar-sized warehouse at the eastern end. \nWork also started earlier this year on a huge rail freight terminal, known as SEGRO Logistics Park East Midlands Gateway , taking advantage of links to the M1 and airport, which it will sit beside. Read More ", "external_links": [], "published": "2017-10-24T10:05:00.000+03:00", "crawled": "2017-10-24T11:33:57.001+03:00", "highlightTitle": ""}