{"organizations": [], "uuid": "2e24bd25feaa97eefc4de2233fd63a27ef2dffda", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article672133.ece/ALTERNATES/s1200/grotto1.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "devonlive - frontpage", "url": "http://www.devonlive.com/news/devon-news/torquay-christmas-lights-are-on-672262", "country": "GB", "title": "Torquay Christmas lights are ON", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-24T14:06:00.000+03:00", "replies_count": 0, "uuid": "2e24bd25feaa97eefc4de2233fd63a27ef2dffda"}, "author": "Tina Crowson", "url": "http://www.devonlive.com/news/devon-news/torquay-christmas-lights-are-on-672262", "ord_in_thread": 0, "title": "Torquay Christmas lights are ON", "locations": [], "entities": {"persons": [{"name": "anton", "sentiment": "none"}, {"name": "ann widdecombe", "sentiment": "none"}, {"name": "steve", "sentiment": "none"}, {"name": "bruce forsyth", "sentiment": "none"}, {"name": "mogg", "sentiment": "none"}, {"name": "fleet walk", "sentiment": "none"}, {"name": "boris", "sentiment": "none"}, {"name": "mike bailey", "sentiment": "none"}, {"name": "andy styles", "sentiment": "none"}, {"name": "steve holdup", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "torquay", "sentiment": "none"}, {"name": "torwood street", "sentiment": "none"}, {"name": "africa", "sentiment": "none"}, {"name": "union square", "sentiment": "none"}, {"name": "park lane", "sentiment": "none"}, {"name": "union street", "sentiment": "none"}], "organizations": [{"name": "on town", "sentiment": "none"}, {"name": "torquay", "sentiment": "none"}, {"name": "fleet walk", "sentiment": "none"}, {"name": "torquay chamber of commerce", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "rotary club grotto", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Torquay Christmas lights are ON Town businesses paid because they don't want a blackout for the festive season Share Click to play Tap to play The video will start in 8 Cancel Play now Comments \nTorquay’s Christmas lights are ON. Local businesses have rallied round and lights will be bringing festival sparkle to many areas across the town centre. \nLocal traders have stumped up the cash not only for lights on their premises but for across the streets covering the majority of the town, though there will be some notable exceptions. They will be switched on for the Christmas Carnival in November. \nIt’s a real turnbaround from September when it was feared the town would be blacked out. Torquay Chamber of Commerce which put up the lights last year said then: “It is unclear to the Torquay Chamber of Commerce what plans are being made by the Mayor about ensuring Torquay has Christmas lights this year. Steve Holdup (Image: Andy Styles) \n“There appears to be no funding available, and no appetite from either the council or the town’s retailers to pay for Christmas lights.” \nBut boss of Torbay Display, Steve Holdup, who has put up the lights in not only Torquay but many towns for many years, said that after a lot of work he now had sufficient support from local businesses to put lights up in Union Street, excluding most of the pedestrian area, Fleet Street, The Strand and Torwood Street. Read More Ann Widdecombe on Brexit, Boris, Mogg, Trump, the NHS and why Anton should have replaced Bruce Forsyth on Strictly Come Dancing \nHe thanked Fleet Walk, Union Square, businesses in The Strand, Park Lane and Pier Point for stepping up to the mark. \nSteve said: “There has been a lot of negative comment about Torquay and Christmas lights, we have just got to turn that round. The lights going up in Fleet Street (Image: Andy Styles) \n“Unfortunately when it was announced in September that nothing was being done on the Christmas lights it was too short a timespan to collect thousands of pounds to do it all. I have done my utmost and some people who already pay for nice lights on their buildings said they want the streets lit up as well. We are doing as much as we can with the money we have this year. Read More \n“There will be some gaps this year but next year we will have a new positive committee and a plan to move forwards and make sure we are never in this situation again.” Ipplepen Carnival float Africa (Image: Andy Styles) \nThis year’s Rotary Club Grotto will be bigger than ever has the charity fundraiser it has taken over the former Jade’s restaurant upstairs in Fleet Walk. \nThe Christmas Carnival is taking place on Saturday November 18. To enter call Mike Bailey on 07403 259916 or Steve Holdup on 01803 327154. Like us on Facebook ", "external_links": [], "published": "2017-10-24T14:06:00.000+03:00", "crawled": "2017-10-24T15:13:10.007+03:00", "highlightTitle": ""}