{"organizations": [], "uuid": "a11d98c37e5002ea2a3b09ea0edfba962169307f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://i2.devonlive.com/news/devon-news/article590755.ece/ALTERNATES/s1200/Johnny-Mercer-tenseJPG.jpg", "site_section": "http://www.middevongazette.co.uk/politics.rss", "section_title": "devonlive - News", "url": "http://www.devonlive.com/news/devon-news/mp-former-army-captain-criticised-590486", "country": "GB", "title": "MP and former Army captain criticised for calling Jeremy Corbyn a bigger threat to UK than ISIS", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-06T19:58:00.000+03:00", "replies_count": 0, "uuid": "a11d98c37e5002ea2a3b09ea0edfba962169307f"}, "author": "Phil Goodwin", "url": "http://www.devonlive.com/news/devon-news/mp-former-army-captain-criticised-590486", "ord_in_thread": 0, "title": "MP and former Army captain criticised for calling Jeremy Corbyn a bigger threat to UK than ISIS", "locations": [], "entities": {"persons": [{"name": "jeremy corbyn", "sentiment": "none"}, {"name": "elizabeth", "sentiment": "none"}, {"name": "johnny mercer", "sentiment": "none"}, {"name": "ben bradshaw", "sentiment": "none"}, {"name": "sutton", "sentiment": "none"}, {"name": "luke pollard", "sentiment": "none"}, {"name": "mr mercer", "sentiment": "none"}, {"name": "bradshaw", "sentiment": "none"}, {"name": "mercer", "sentiment": "none"}, {"name": "oliver colvile", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "devonport", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "wales", "sentiment": "none"}, {"name": "hms ocean", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}], "organizations": [{"name": "army", "sentiment": "none"}, {"name": "isis news", "sentiment": "none"}, {"name": "bbc", "sentiment": "none"}, {"name": "ministry of defence", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "tories", "sentiment": "none"}, {"name": "plymouth moor view", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "tory johnny mercer", "sentiment": "none"}, {"name": "hms albion", "sentiment": "none"}, {"name": "navy", "sentiment": "none"}, {"name": "armed forces", "sentiment": "none"}, {"name": "general election", "sentiment": "none"}, {"name": "isis", "sentiment": "none"}, {"name": "loyal opposition", "sentiment": "none"}, {"name": "conservative", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "mercer", "sentiment": "none"}, {"name": "royal navy", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News MP and former Army captain criticised for calling Jeremy Corbyn a bigger threat to UK than ISIS Tory Johnny Mercer said biggest danger faced by country has 'got a beard, and he sits opposite me at work' Share Johnny Mercer Share \nMP Ben Bradshaw has blasted Plymouth’s Johnny Mercer as a Tory “bonehead” after the former Army captain claimed Jeremy Corbyn to be a bigger danger to the UK than ISIS, Russia and North Korea. \nMercer, a three–tour war veteran and MP for Plymouth Moor View since 2015, claimed the Labour leader was a bigger threat than the Islamic group, which has claimed responsibility for a string of fatal terror attacks in the country. \nHe said: \"The biggest strategic threat to this nation as we know it today, this country we have all worked hard for over so many generations, is not North Korea. \n\"It is not ISIS, it's not Russia. It's got a beard, and he sits opposite me at work \nThe extraordinary twitter outburst on Friday was described as “absurd” by Bradshaw, Exeter’s Labour MP since 1997. Ben Bradshaw, former Culture Secretary \nHe said: \"It seems Johnny Mercer, along with his Conservative colleagues, is losing the plot. \n“To suggest the democratically elected leader of Her Majesty's Loyal Opposition is more of a threat to our country than ISIS or North Korea is patently absurd. \n“The Tories seem to be suffering a collective nervous breakdown because of their boneheaded drive for an extreme damaging Brexit and the sooner the country is rescued from this madness by a Labour Government the better.\" \nThe comments by Mr Mercer, a campaigner for the Armed Forces and veterans, were followed by a video setting out his opposition to proposals to take two of Devonport's \"most capable\" warships out of service. \nThe amphibious assault ships HMS Albion and HMS Bulwark, which are both based at Plymouth's naval base, could be scrapped in a new round of cost cutting measures, the BBC’s Newsnight claimed on Thursday. \nIt said such a move, which the Ministry of Defence described as “pure speculation”, would save money and free up crew for the two new aircraft carriers, HMS Queen Elizabeth and HMS Prince of Wales. \nPlymouth is already about to lose the Navy’s flagship, HMS Ocean, which is due to be scrapped next year. \nLuke Pollard, MP for Sutton and Devonport, branded the move as “the biggest betrayal of Devonport by any Government in a generation”. Luke Pollard said he was 'cautious' about the proposed merger \nThe Labour MP also raised concerns about the nation's amphibious capabilities if, as he put it, three of Devonport’s “most capable ships” were removed from service. \n“I will fight these Tory defence cuts tooth and nail in Westminster,” he said. \n“The Tories have no military strategy, no coherent policy and are destroying our naval capabilities to satisfy over-zealous treasury accountants without consideration for our military or national defence. \n“In uncertain times we need a strong Royal Navy.\" \nHe added: \"Scrapping three of Devonport’s most capable ships will remove our nation’s amphibious capabilities and usher in dark clouds over the Royal Marines too. \n“I will fight these cuts and stand up for Plymouth’s defence jobs. As the son of a submariner I know how vital theses Royal Navy jobs are for our city and I won’t let the Tories cut them without one hell of a fight.” Johnny Mercer is a former Army captain \nMr Mercer said he would do \"everything I can\" to prevent the vessels being taken out of service. \nThe Conservative MP said: \"Clearly this story is disturbing.\" \nReferring to his former colleague Oliver Colvile, who lost his seat at the General Election in June, Mr Mercer added: \"This was one of my fears on losing a good hard-working constituency Conservative MP - that the focus on defence would shift away from Devonport. \n“This is speculation at present, but it is clearly something I will do everything I can to prevent.” \nAn MOD spokesman said: “In the face of ever-changing threats, we are contributing to the cross-government review of national security capabilities and looking at how we best spend our rising defence budget to support that. \n“No decisions have yet been made and at this stage, any discussion of the options is pure speculation.” Like us on Facebook", "external_links": [], "published": "2017-10-06T19:58:00.000+03:00", "crawled": "2017-10-06T20:20:22.000+03:00", "highlightTitle": ""}