{"organizations": [], "uuid": "aa35162e22ebf0329f6a545b500772d1a8454310", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article12470023.ece/ALTERNATES/s1200/Hooded-computer-hacker-with-magnifying-glass-stealing-internet-p.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13808053", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Major offshore law firm for super-rich hit by cyber 'incident'", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-25T10:00:00.000+03:00", "replies_count": 0, "uuid": "aa35162e22ebf0329f6a545b500772d1a8454310"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13808053", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Major offshore law firm for super-rich hit by cyber 'incident'", "locations": [], "entities": {"persons": [{"name": "ms gadhia", "sentiment": "none"}, {"name": "judith", "sentiment": "none"}, {"name": "hill", "sentiment": "none"}, {"name": "john hays", "sentiment": "none"}, {"name": "jonathon", "sentiment": "none"}, {"name": "antonio horta-osorio", "sentiment": "none"}, {"name": "john hay", "sentiment": "none"}, {"name": "jayne-adde gadhia", "sentiment": "none"}, {"name": "dorner", "sentiment": "none"}, {"name": "hays", "sentiment": "none"}, {"name": "judith doyle", "sentiment": "none"}, {"name": "doyle", "sentiment": "none"}, {"name": "mark carney", "sentiment": "none"}, {"name": "philip hammond", "sentiment": "none"}, {"name": "glen instone", "sentiment": "none"}, {"name": "virgin money", "sentiment": "none"}, {"name": "mark tewdwr-jones director", "sentiment": "none"}, {"name": "mcguinness", "sentiment": "none"}, {"name": "jonathon manning lloyds", "sentiment": "none"}, {"name": "jonathon manning newcastle", "sentiment": "none"}, {"name": "thomas cook", "sentiment": "none"}, {"name": "ms mcguinness", "sentiment": "none"}, {"name": "george osborne", "sentiment": "none"}, {"name": "john marshall", "sentiment": "none"}, {"name": "gadhia", "sentiment": "none"}, {"name": "irene dorner", "sentiment": "none"}, {"name": "jayne-anne gadhia", "sentiment": "none"}], "locations": [{"name": "manning square", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "swindon", "sentiment": "none"}, {"name": "peterborough", "sentiment": "none"}, {"name": "royal quays", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "ridley place", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "key event hays travel", "sentiment": "negative"}, {"name": "newcastle", "sentiment": "negative"}, {"name": "treasury select committee", "sentiment": "none"}, {"name": "canterbury", "sentiment": "none"}, {"name": "hays travel facebook", "sentiment": "none"}, {"name": "bank of england", "sentiment": "none"}, {"name": "lloyds banking group", "sentiment": "none"}, {"name": "newcastle united foundation", "sentiment": "none"}, {"name": "husqvarna uk limited", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "gateshead college", "sentiment": "none"}, {"name": "lloyds", "sentiment": "none"}, {"name": "city of london corporation", "sentiment": "none"}, {"name": "metro bank", "sentiment": "none"}, {"name": "newton aycliffe", "sentiment": "none"}, {"name": "hsbc usa", "sentiment": "none"}, {"name": "newcastle city futures", "sentiment": "none"}, {"name": "jonathon manning metro bank", "sentiment": "none"}, {"name": "houses of parliament", "sentiment": "none"}, {"name": "tewdwr-jones jonathon manning newcastle united foundation", "sentiment": "none"}, {"name": "husqvarna uk", "sentiment": "none"}, {"name": "virgin money", "sentiment": "none"}, {"name": "rolls-royce", "sentiment": "none"}, {"name": "rbs", "sentiment": "none"}, {"name": "fca", "sentiment": "none"}, {"name": "smart cities", "sentiment": "none"}, {"name": "husqvarna group", "sentiment": "none"}, {"name": "axa", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "ncf", "sentiment": "none"}, {"name": "independent", "sentiment": "none"}, {"name": "navigant consulting", "sentiment": "none"}, {"name": "st james", "sentiment": "none"}, {"name": "huawei smart cities index", "sentiment": "none"}, {"name": "metro bank jonathon manning county durham", "sentiment": "none"}, {"name": "huawei uk", "sentiment": "none"}, {"name": "newcastle university", "sentiment": "none"}, {"name": "husqvarna", "sentiment": "none"}, {"name": "royal bank of scotland", "sentiment": "none"}, {"name": "pra", "sentiment": "none"}, {"name": "hays travel", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KEY EVENT Hays Travel launches new contact centre in Newcastle - and it's set to create jobs \nNorth East holiday firm Hays Travel has launched a new centre to handle its social media presence after acquiring a team of staff from a fellow travel company. \nThe Sunderland headquartered firm, launched by John Hays, has set up a dedicated social media division in Newcastle, after taking on 35 members of Thomas Cook’s North East support team who were facing redundancy. \nMr Hays says engaging customers on social media is helping to drive the business forward, leading to rising bookings across its growing network of shops, and the team is set to be doubled in time. \nThe firms’ founder and chairman said: \nSocial media is really important to us and each branch has its own Facebook page, where they create their own offers and customers can contact them, and that’s working really well for us. In addition we have a main Hays Travel Facebook page and it’s generating lots of leads. \nSo we came to the decision that we have not got enough people to answer all of the leads coming in, so decided to form a dedicated team in the centre of Newcastle, to answer various social media leads and chat messages – all of the non-telephone leads basically. \nAround the same time, we heard how Thomas Cook was making around 50 people redundant in support roles. They had historically been in a call centre environment up at Royal Quays. \nHe added: \nIn the end we basically took on 35 people who had been made redundant, and they are forming the back bone of our new contact centre in Ridley Place, Newcastle. \nIt’s all still relatively new and in the teething phase. The new staff members joined us about six weeks ago and are currently going through Hays Travel training. \nBut certainly the plan is to keep bringing more people in – the plan is to double the numbers we have got. \nThe new social media team is based in the offices above Hays Travel’s existing retail shop in Newcastle, where investment has been made to the three floors above the shop to kit it out with all the equipment needed for the new, expanding team. John Hay founder of Hays Travel 8:55 Jonathon Manning Square mile firms will trigger Brexit plans without deal clarity by year-end \nSquare Mile firms will begin activating their Brexit contingency plans unless the Government provides clarity over a transition period by year-end, the City of London Corporation has warned in a letter to the Chancellor.Catherine McGuinness, the corporation’s policy and resources chairman, told Philip Hammond that it was “critical” that UK-based financial services firms have “urgent clarity” from the UK and EU on “time-limited, legally binding transitional arrangements” as well as the principles that underpin them. \nIn a letter to the Chancellor, Ms McGuinness wrote: \nWhile businesses will have different cut-off points for activating contingency plans, clarity will be needed by the end of this year. \nIf delivered in time, those details could allow companies to slow, or even scrap, their contingency plans, she said. \nFor businesses that have already begun activating contingency plans, clarity on transition will allow them to decelerate those plans. \nFor others, it may help them avoid taking unnecessary contingency measures entirely. The earlier transitional arrangements are agreed, the more value they will have for businesses and their customers. \nThe letter, written ahead of the Chancellor’s Budget on November 22, also included calls to cut tax rates down from 17% for corporate treasury centres, which are common among Asian multinationals and operate as in-house banks for their businesses.The City of London Corporation wants to make UK rates competitive and “allow London to win more business from Asian rivals” including Singapore and Hong Kong, who tax at 8% and 8.25%, respectively.It was part of a broader call to action on fiscal policy, which Ms McGuinness said “must go beyond Brexit considerations”.But Germany’s financial regulator warned earlier this week that Britain is nearing a “point of no return” for financial services firms, which are unable to wait much longer for a mutual recognition agreement that would allow them to continue serving customers in each others’ markets. Anti-Brexit protesters waving EU flags outside the Houses of Parliament in London (Image: PA) 8:50 Jonathon Manning Newcastle named as top city for digital jobs growth, according to Smart Cities report \nNewcastle has been named as one of the UK’s top smart cities after it was revealed it to have the second fastest growing region for digital and tech jobs. \nWith 30,000 people now employed in Newcastle’s technology and digital sector, London was the only region in the UK to have a faster rate of job creation. \nThe figures were revealed in the Smart Cities Index, which is commissioned by Huawei UK and conducted by Navigant Consulting. The report praised Newcastle’s smart city initiatives, such as Newcastle City Futures (NCF). \nProf Mark Tewdwr-Jones Director, director of Newcastle City Futures at Newcastle University, said: \nWe’re extremely proud to be included and recognised in this year’s Huawei Smart Cities Index, as it shows the scale of progress we have made over the past 18 months. \nAn important element to the city’s success is key funding in smart city initiatives and projects that are set to transform Newcastle to an all-around digital city. \nHe added: \nWe’re pressing ahead with a refreshed vision and unique partnership model to accelerate the adoption of smart, clean and digital technologies that will enable us to overcome the economic and social challenges our city is currently facing. \nNewcastle was also named as the top UK city for innovation within the education sector, thanks to the work of its universities. Prof Mark Tewdwr-Jones Jonathon Manning Newcastle United Foundation appoints Gateshead College's chief executive to board \nNewcastle United Foundation has appointed Gateshead College’s chief executive Judith Doyle to its board of trustees. \nMs Doyle took over the running of the college in 2013 and since then it has received an “outstanding” rating from Ofsted and was named the fourth best in the UK based on the success rates of its students. \nShe joins the charity’s board as it sets about building a state-of-the-art hub for sport, learning and well-being next to St James’ Park. \nCommenting on her appointment, Judith Doyle said: \nI am thrilled to be playing a role in helping the foundation develop a dynamic learning hub that provides a wide range of sporting and education opportunities for young people. At Gateshead College, our goal is to equip people with the skills and attributes that benefit local businesses and lead to rewarding careers – and we’re delighted that the foundation shares this aim. \nI hope to use my experience of industry and FE to help the foundation fast-track the next generation of sporting and industry talent. \nJohn Marshall, chair of trustees, added: \nWe are delighted that Judith has agreed to join our board. Judith’s expertise in education will be invaluable as we further develop our learning and skills programmes. Above all, she brings characteristic energy and enthusiasm to our growing board and we are excited about working with her. Gateshead College chief executive Judith Doyle 8:40 Jonathon Manning Metro Bank revolution sees record customer growth as profits rise \nMetro Bank has reported rising third quarter profits as it promised to take its “revolution” to the streets of Swindon, Canterbury and Peterborough.The challenger bank, which launched in 2010, saw underlying pre-tax profits rise 77% to £7.2m in the three months to September 30.Metro Bank also notched up record quarterly customer growth as 79,000 new accounts were opened, taking its total to 1.1m.Vernon Hill, the lender’s chairman and founder, said: \nWe are the Revolution in British banking, offering real choice to consumers and businesses. \nAs we take the revolution to the high streets of Swindon, Canterbury and Peterborough, we are giving those urban communities and businesses a real alternative and a reason to love their bank at last. Metro Bank Jonathon Manning County Durham firm Husqvarna adds £43m to turnover - but sees profits fall \nChainsaw and lawnmower manufacturer Husqvarna UK Limited saw its profits fall last year despite adding £43m to its turnover. \nThe Newton Aycliffe firm saw its turnover grow from £153.2m to £196.4m for the year ending December 31 2016. \nHowever, the firm failed to capitalise on the improved sales figures and saw its operating profit fall 22%, from £8.4m to £6.5m. \nCommenting on its results Husqvarna said the poor profit figures were a result of increased costs, particularly as a result of the fall in the pound. \nA spokeswoman for the firm said: \nSales increased significantly with the main increase coming from sales to affiliate overseas group companies, although there was an improvement in domestic sales too. \nThe earnings were reduced largely due to material cost pressure. However on an overall group level we are satisfied with the performance of the UK business. \nThe material cost pressures were largely caused by the weak value of the pound against the US dollar. Husqvarna UK purchases a large quantity of its components in US dollars meaning that the real cost of the materials soared due to the Brexit-hit pound. \nHusqvarna’s strong sales growth was achieved because of an increased demand for its robotic products. \nIn the company accounts, chief financial officer Glen Instone said: \nTurnover increased by 28% with a combination of increase in export sales of robotic lawnmowers manufactured in the Aycliffe production facility, which included a 3% increase in UK consumer sales. \nCosts outstripped turnover growth throughout the year, however, with Husqvarna’s total sales costs increasing by 35% to £173.6m. Husqvarna Group celebrates production of 1 millionth robotic lawnmower at Newton Aycliffe (Image: Opr) 8:32 KEY EVENT Virgin Money lines up all female leadership team \nNewcastle’s Virgin Money is close to becoming the only FTSE 350 company with an all-female leadership team after the bank revealed it is in talks to appoint Irene Dorner as its new chair elect. \nMs Dorner previously held the role of president and chief executive of HSBC USA, and has been named the most powerful women in banking by an American trade publication. She now works as a non-executive director at Rolls-Royce and insurance firm Axa. \nIn a statement to shareholders Virgin Money said: \nFollowing recent press speculation, Virgin Money confirms that the Company is in advanced discussions with respect to the appointment of Irene Dorner as Independent non-executive director and chair elect to the Virgin Money board of directors. Any appointment would be subject to regulatory approval. \nIf talks come to fruition, Ms Dorner will work along side chief exeuctive Jayne-Adde Gadhia at the bank. Virgin Money Chief Executive Jayne-Anne Gadhia (Image: Newcastle Chronicle) 8:30 Jonathon Manning Lloyds sees profits rise on strong performance \nLloyds Banking Group has unveiled a hefty rise in third quarter profits as the once state backed lender hailed a “strong financial performance”.The company saw pre-tax profits more than double to £1.95bn in the three months to September 30.The figure compares to £811m in the same period last year, when Lloyds was hit by payment protection insurance (PPI) provisions.Underlying profit for the period nudged up from £1.9bn to £2bn.Chief executive Antonio Horta-Osorio said: \nIn the first nine months of the year we have delivered strong financial performance with increased underlying and statutory profit, a significant improvement in returns and strong capital generation. \nThese results highlight the strength of our customer focused, simple and low risk business model and the benefits of our competitive advantage in the UK. Lloyds Banking Group chief executive Antonio Horta-Osorio 8:25 KEY EVENT Jayne-Anne Gadhia outlines sexism in business - including colleague expected to sleep with boss \nThe boss of Newcastle bank Virgin Money has backed calls for a “ministerial board” championing the economic benefits of gender diversity, but said companies must also explain why they have not signed a charter targeting female equality in financial services. \nJayne-Anne Gadhia said a move by City regulators to sign up to the Women in Finance charter had forced finance firms to confront the issue of gender equality. \nBut she said there were still prominent companies - including two investment banks - that had failed to put their names to the Government-backed charter, which links executive bonuses to gender diversity targets such as achieving a 50/50 split of women and men in senior roles. \nHer comments came as she reaffirmed that the UK economy would benefit from stronger productivity if more women were in senior positions. \nSpeaking at the Treasury Select Committee, Ms Gadhia said: \nWe have been really pleased with the impact the charter has had and the thing that I have noticed about it that has been so supportive is that the Treasury and the Chancellor - both George Osborne and Philip Hammond - have taken a personal interest in this. That has been very powerful. \nThe support of Bank of England Governor Mark Carney when the charter was launched has not gone unnoticed. \nThe PRA and the FCA have both signed up to the charter. I think having your main regulators absolutely 100% behind it has meant that financial services companies cannot ignore it. \nI think doing that more broadly at a national level through Government is of course going to make a big difference. \nThe one thing that I would say is - despite all of that - we still have companies that have not signed and we should be doing everything that we can to make sure those that haven’t explain why they haven’t, or sign up. \nMs Gadhia also outlined a number of sexist experiences she had seen while working in business. \nShe said that during her time at Royal Bank of Scotland (RBS) there was a very male culture and a “pervading sexism”. \nShe added: \nI remember a very senior woman being very upset one day telling me that she was expected to sleep with her boss. \nThat sort of thing of course means there are issues for women progressing through financial services. \nRBS said that the allegations were shocking and clearly unacceptable. the bank added it has a whistle blower facility where staff can talk in confidence about such issues. Virgin Money Chief Executive Jayne-Anne Gadhia (Image: PA) 8:15", "external_links": [], "published": "2017-10-25T10:00:00.000+03:00", "crawled": "2017-10-25T11:09:50.004+03:00", "highlightTitle": ""}