{"organizations": [], "uuid": "0cbe2caacbf20acb03f4eb78160c6b9d540f8192", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13792671.ece/ALTERNATES/s1200/North-West-Durham-MP-Laura-Pidcock-speaks-during-Prime-Ministers-Questions-on-October-18.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/universal-credit-non-vote-oxford-13792676", "country": "GB", "domain_rank": 21960, "title": "Universal Credit 'non-vote' and Oxford social apartheid reveal a dis-United Kingdom", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-21T18:00:00.000+03:00", "replies_count": 0, "uuid": "0cbe2caacbf20acb03f4eb78160c6b9d540f8192"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/universal-credit-non-vote-oxford-13792676", "ord_in_thread": 0, "title": "Universal Credit 'non-vote' and Oxford social apartheid reveal a dis-United Kingdom", "locations": [], "entities": {"persons": [{"name": "george osborne", "sentiment": "none"}, {"name": "pidcock", "sentiment": "none"}, {"name": "david lammy", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "bill", "sentiment": "none"}, {"name": "edward leigh", "sentiment": "none"}, {"name": "laura pidcock", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "cambridge", "sentiment": "none"}, {"name": "north west durham", "sentiment": "none"}], "organizations": [{"name": "oxford", "sentiment": "negative"}, {"name": "house of commons", "sentiment": "none"}, {"name": "universal credit", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "tories", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "citizens advice newcastle", "sentiment": "none"}, {"name": "north west durham", "sentiment": "none"}, {"name": "labour and conservative", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily   \nIt’s been a week book ended by two seemingly unrelated stories which when combined actually reveal just how broken and divided Britain is. \nFirst there was Universal Credit and the government’s political body swerve by choosing not to vote on a Labour motion to pause it. \nWhile they might argue it was a political body swerve of Labour’s to put the motion up in the first place, what can’t be argued is it was backed by the likes of Citizens Advice Newcastle which is at the sharp end of dealing with the grief it is causing at present. \nAnd then we had Oxford ‘social apartheid’ revealed by an FOI of Labour MP David Lammy which showed 10 out of 32 Oxford colleges did not award a place to a black British pupil with A-levels in 2015. \nSimilar data released by Cambridge revealed six colleges there failed to admit any black British A-level students in the same year. North West Durham MP Laura Pidcock speaks during Prime Minister's Questions on October 18 (Image: Reuters Live Stream) \nTaken together they are just yet more examples of a society divided along so many fault lines - ethnicity, wealth, poverty and work status and that is even before you get to Brexit. \nWe have been told, often, by its architects that in principle Universal Credit is a good thing, simplifying a hugely complicated system. Yet in practice it is underfunded - one of George Osborne’s many negative legacies - and its scope and complexity is more vast than first thought. \nThose suffering, yet again, are the vulnerable and no matter what tales of debts, eviction, hunger, mental breakdown, stress, suicide and poverty this government will not brook any suggestion to call a halt temporarily until the issues be rectified. Instead it wants to carry on regardless. Read More \nOne of the most telling comments during the debate came from Laura Pidcock, newly elected MP for North West Durham. \nWas Universal Credit motivated by was “gross incompetence” or “calculated cruelty” she asked Theresa May. Former minister Sir Edward Leigh speaking in the House of Commons during the second reading of the European Union (Withdrawal) Bill (Image: PA) \nThe Prime Minister said it was all working a lot better than the previous system - why not call the Universal Credit hotline to find out? It’ll be free soon. Or words to the effect. \nMs Pidcock made quite a stir when first entering parliament by saying she wouldn’t hang out with Tories as she considered them the enemy. \nShe was accused of peddling hate and there was a lot of harrumphing by right wing commentators like she was some left wing demagogue. \nHowever more and more people agree now that the division between Labour and Conservative is so stark social niceties are going out of the window. Read More Pause Universal Credit rollout or face dire consequences, warns charity ahead of Commons vote \nAnd those divisions get deeper when May and her ministers don’t face up to the consequences of a 299-0 defeat - a defeat they knew was coming even before they chose to abstain - when the consequences of them not pausing Universal Credit are so dire for many disadvantaged people. \n“The road to tyranny is paved with executives ignoring Parliaments,” as someone said after Wednesday’s no-vote. \nAnd that person was Tory MP and former minister Sir Edward Leigh. Like us on Facebook", "external_links": [], "published": "2017-10-21T18:00:00.000+03:00", "crawled": "2017-10-21T18:09:26.004+03:00", "highlightTitle": ""}