{"organizations": [], "uuid": "78bef035f665d6f54a55f4e96cb6144660f9b47d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13834250.ece/ALTERNATES/s1200/JS117813835.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/newcastle-mps-warning-harassment-commons-13834032", "country": "GB", "domain_rank": 21960, "title": "Newcastle MP's warning about harassment in Commons bar was dismissed", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-30T21:20:00.000+02:00", "replies_count": 0, "uuid": "78bef035f665d6f54a55f4e96cb6144660f9b47d"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/newcastle-mps-warning-harassment-commons-13834032", "ord_in_thread": 0, "title": "Newcastle MP's warning about harassment in Commons bar was dismissed", "locations": [], "entities": {"persons": [{"name": "chi onwurah", "sentiment": "negative"}, {"name": "stephen crabb", "sentiment": "none"}, {"name": "andrea leadsom", "sentiment": "none"}, {"name": "guido fawkes", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "bercow", "sentiment": "none"}, {"name": "mark garnier", "sentiment": "none"}, {"name": "mcfall", "sentiment": "none"}, {"name": "ms leadsom", "sentiment": "none"}, {"name": "onwurah", "sentiment": "none"}, {"name": "john bercow", "sentiment": "none"}, {"name": "leadsom", "sentiment": "none"}], "locations": [{"name": "westminster", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "house of commons", "sentiment": "none"}, {"name": "members of parliament", "sentiment": "none"}, {"name": "house", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "share newcastle", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Newcastle MP's warning about harassment in Commons bar was dismissed Chi Onwurah told Commons officials that researchers felt 'deeply uncomfortable' but was told it happens everywhere Share Newcastle MP Chi Onwurah reported allegations of harassment in a House of Commons bar Share Get daily   Thank you for subscribing!   \nNewcastle MP Chi Onwurah reported allegations of harassment by MPs in a House of Commons bar - only to be told it “happens in pubs all over the country”. \nShe revealed that a number of male and female researchers had been made to feel “deeply uncomfortable” by MPs in the Sports and Social club, one of a number of House of Commons bars. \nBut when she reported her concerns to Parliamentary officials, they were dismissed. \nMs Onwurah revealed the incident as Commons speaker John Bercow along with Prime Minister Theresa May and opposition parties agreed urgent action is needed to protect Commons staff, journalists and others who work at Westminster. \nMrs May has proposed setting up a new “contractually binding grievance procedure” allowing people to take action if they are treated badly. \nIn a letter to Mr Bercow, she said: “I do not believe that this situation can be tolerated any longer. It is simply not fair on staff, many of whom are young and in their first job post-education.” \nThere have been a series allegations about abuse or harassment at Westminster, including: Brexit Minister MP Mark Garnier admitted calling his former secretary “sugar tits” and asking her to buy sex toys Former Cabinet Minister Stephen Crabb apologised for sending sexually explicit texts to a 19-year-old woman after he interviewed her for a job. The Guido Fawkes website claimed Tory aides had compiled a spreadsheet of 36 Conservative MPs - including 20 ministers - accused of inappropriate behaviour. The Conservatives declined to comment. MPs including Cabinet Ministers were named as sex-pests to avoid by female staff in a WhatsApp group, the Sun newspaper revealed. \nThe Sports and Social is a bar popular with researchers, many of whom are in their 20s as the job tends to attract recent graduates. \nMs Onwurah welcomed measures to eradicate harassment in Parliament, adding “But when I complained recently to an officer of Parliament who had some responsibility in this area that I knew a number of researchers - male and female - who had been made to feel deeply uncomfortable in the Sports and Social club here by Members of Parliament, I was told that happens in pubs all over the country. \n“Would the Leader of the House confirm that the duty of care we owe extends 24/7 and to every restaurant and bar in this place?” \nCabinet Minister Andrea Leadsom, leader of the Commons, replied: “I’m very happy to give that absolute assurance. There should be no place here on the estate or in our constituency offices where people can be abused or allegations not taken seriously. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \n“I can assure you that I will be meeting with Lord McFall to discuss the specific issues around the Sports and Social Bar tomorrow.” \nSpeaking in the Commons chamber with Prime Minister Theresa May by her side, Ms Leadsom said there was a vital need for better support and protection for thousands of people working in the Palace and that action was needed “in days rather than weeks”. Read More \nMs Leadsom said it was clear the “current system is inadequate” and set out the proposed reforms. \nShe told MPs the Government’s guiding principles were: Everyone in Parliament should “have the right to feel at ease as they go about their work”. An existing confidential helpline must be strengthened as a “dedicated support team” with more resources. The support team should be able to recommend the onward referral of a case to ensure “appropriate investigation and action”. Specialised pastoral support should be available to anyone in distress as a consequence of their treatment in the workplace. The support team should “strongly recommend” that any criminal allegations are reported to the police. \nHouse of Commons Speaker John Bercow also called for change at Westminster amid what he called “disturbing” allegations about a “culture of sexual harassment”. \nMr Bercow said Mrs May’s call for a Commons-wide mediation service and contractually-binding grievance procedure for MPs and staff should be considered. \nConcern over Government plans to give prisoners the right to vote Read More \nBut in a statement to MPs he stressed: “In the first instance I hope that parties will live up to their responsibilities, demonstrating both an appetite for change and a practical means of delivering that change without delay. \n“Make no mistake, there is a need for change.” Like us on Facebook", "external_links": [], "published": "2017-10-30T21:20:00.000+02:00", "crawled": "2017-10-30T21:37:21.008+02:00", "highlightTitle": ""}