{"organizations": [], "uuid": "351498ff1c1a093ce91a646f8f0bd4d49f2502c3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13750768.ece/ALTERNATES/s1200/psm_SCU_270217obama01.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/should-free-food-housing-internet-13750587", "country": "GB", "domain_rank": 21960, "title": "Should we get free food, housing and internet access? The idea is being taken seriously", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-14T10:00:00.000+03:00", "replies_count": 0, "uuid": "351498ff1c1a093ce91a646f8f0bd4d49f2502c3"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/should-free-food-housing-internet-13750587", "ord_in_thread": 0, "title": "Should we get free food, housing and internet access? The idea is being taken seriously", "locations": [], "entities": {"persons": [{"name": "jonathan portes", "sentiment": "none"}, {"name": "john mcdonnell", "sentiment": "none"}, {"name": "portes", "sentiment": "none"}, {"name": "henrietta moore", "sentiment": "none"}, {"name": "gordon brown", "sentiment": "none"}], "locations": [{"name": "gateshead", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}], "organizations": [{"name": "department for work", "sentiment": "none"}, {"name": "universal basic services", "sentiment": "none"}, {"name": "ubs", "sentiment": "none"}, {"name": "university college london", "sentiment": "none"}, {"name": "national insurance", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "institute for global prosperity", "sentiment": "none"}, {"name": "king’s college", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "cabinet office", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Should we get free food, housing and internet access? The idea is being taken seriously Politicians are taking a serious look at proposals to hand out free 'basic services' to everyone who needs them Share The Labour Party want to push a Universal Basic Income, which will see people provided with the 'necessities' for a reasonable standard of living (Image: PA Photo/thinkstockphotos) Share Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email Should the Government provide us with free food, transport , a phone and an internet connection? \nThat’s the question raised in a new report by academics. \nIt may sound like science fiction, but Labour is taking the idea seriously. \nJohn McDonnell, Labour’s Shadow Chancellor, said: “Rapid technological changes are a profound challenge for our economy and society. This report offers bold new thinking on how we can overcome those challenges and create an economy that is radically fairer and offers opportunities for all. \n“It makes an important contribution to the debate around Universal Basic Income, and will help inform Labour’s thinking on how we can build an economy that truly works for the many not the few.” \nIt was published by the Institute for Global Prosperity, which is based at University College London. The Labour Party want to push a Universal Basic Income, which will see people provided with the 'necessities' for a reasonable standard of living (Image: Getty Images/iStockphoto) \nThose involved include Jonathan Portes, a Professor of Economics and Public Policy at King’s College, London, who was previously a senior economist at the Department for Work and Pensions and the Cabinet Office. \nThe report’s authors call their idea Universal Basic Services and say it would cost £42bn. \nBut the idea is that you would also increase income tax, so that the Treasury would get the money back. \nSpecifically, they suggest cutting the personal allowance - the amount you need to earn each year before you start paying income tax - to £4,300, down from £11,500 now. It would mean even people on fairly modest incomes paid a bit more tax. \nSo in a sense, the services wouldn’t be free any more than they are now. If you can afford to pay for them then you will, through the tax system. \nBut the proposal is meant to ensure that one way or another, everybody got the basic things they need in order to have a reasonable standard of living. \nThat would include somewhere to live, offered at zero rent with the people who need homes most first in the queue. There would be a seven-year building schedule, with the Government spending between £6.1bn and £13bn a year on new homes. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nEverybody would get a travel pass similar to the Freedom Pass which is currently provided to people over the age of 60. It would allow everyone to use public transport for free. \nAnd everybody would have a free basic mobile phone and calls package, an internet service and a free TV licence. \nThere would also be a food service, although this would only apply to the 2.2 million households deemed to experience “food insecurity” each year. They would get one third of their meals provided for free. \nIt’s a variation on an old idea called Universal Basic Income, in which the state would provide everyone with a regular payment to ensure we all have enough money to eat and put the fire on. Read More Mental health funding in Newcastle and Gateshead to be cut despite promises to improve services \nOnce again, people who could afford it - even those on fairly modest incomes - would pay the money back through the tax system. \nBut it would avoid the complex and expensive process of making people fill out forms to prove that they need benefits. After all, most working people already pay income tax and National Insurance, and the system works pretty smoothly. \nAnother possible advantage of Universal Basic Income is that it would eliminate the so-called poverty trap. \nThis is when people actually become worse off by going to work, because their benefits are cut. Alternatively, some people get a job and find their wages are only slightly higher than the benefits they lose, so it feels like they are putting a lot of effort in and getting very little back. \nFormer Chancellor Gordon Brown’s tax credit system, and the current Government’s Universal Credit scheme, are partly attempts to eliminate the poverty trap (both schemes might also be considered flawed for various reasons). \nThe Institute for Global Prosperity says that providing everyone with a Basic Income of £73.10 a week, the current Jobseekers Allowance level, would cost just under £250bn a year. \nSo their proposed Universal Basic Services idea is cheaper and might be easier to implement, although they say a “modest” Basic Income might be needed as well. \nAnd a debate about how we ensure everyone has their basic needs yet is increasingly urgent, they say. Read More How will Brexit affect the North East? The Treasury knows but they're not going to tell you \nSome experts predict around half of all paid jobs could be carried out by robots or artificial intelligences. \nTaking the country as a whole, this doesn’t have to make us poorer. Businesses might do just as much as before (or more) - but with fewer people. \nBut it does mean that more of us won’t have jobs, or any real hope of getting one, while others just have to accept low-paid and insecure work. \nIf the predictions come true, we may have to think about how we ensure everyone has a reasonable standard of living in a world where getting on your bike and looking for work just isn’t an option. \nProfessor Henrietta Moore, director of institute for global prosperity, said: “Without radical new ideas that challenge the status quo, we face a future where the changing shape of our society and labour market leaves more and more people struggling simply to achieve the basics – let alone having the resources and mental energy to allow themselves and their families to flourish. \n“As a society, we already accept that certain services like health and education should be provided free at the point of use to the whole population, because we understand that all of society benefits as a result. \n“The concept of UBS is a logical extension of this principle.” \nProfessor Portes said: “The role of the state is to ensure an equitable distribution of not just money, but opportunity to participate and contribute to society. For that to be meaningful, there are likely to be certain services everyone should be able to access. \n“Universal Basic Services, like basic income, has the potential to improve work incentives, especially for lower paid workers. \n“It reduces the cash income required, through the benefit system or from savings, for individuals or families to survive at an acceptable standard of living if they have little or no income from labour; and if services are provided to all regardless of work status, then there is no disincentive effect from the loss of access as people move into work or increase their earnings.” Like us on Facebook ", "external_links": [], "published": "2017-10-14T10:00:00.000+03:00", "crawled": "2017-10-14T10:31:44.006+03:00", "highlightTitle": ""}