{"organizations": [], "uuid": "f31a01edf5d0c87729834a2d5b65e01ecddcf0af", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13812758.ece/ALTERNATES/s1200/Prime-Ministers-Questions.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/poll-reveal-labour-popularity-under-13812683", "country": "GB", "domain_rank": 21960, "title": "Does poll reveal Labour popularity under Jeremy Corbyn has peaked?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-29T07:00:00.000+02:00", "replies_count": 0, "uuid": "f31a01edf5d0c87729834a2d5b65e01ecddcf0af"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/poll-reveal-labour-popularity-under-13812683", "ord_in_thread": 0, "title": "Does poll reveal Labour popularity under Jeremy Corbyn has peaked?", "locations": [], "entities": {"persons": [{"name": "jeremy corbyn", "sentiment": "negative"}, {"name": "blenkinsop", "sentiment": "none"}, {"name": "tom blenkinsop", "sentiment": "none"}, {"name": "martin farr", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "farr", "sentiment": "none"}], "locations": [{"name": "east cleveland", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "negative"}, {"name": "house of commons", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "icm", "sentiment": "none"}, {"name": "middlesbrough south", "sentiment": "none"}, {"name": "the labour", "sentiment": "none"}, {"name": "tories", "sentiment": "none"}, {"name": "newcastle university", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "invalid email  has labour", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Does poll reveal Labour popularity under Jeremy Corbyn has peaked? Despite Tory in-fighting and a discredited 'lame duck' leader the the party is still neck and neck with Labour Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nHas Labour peaked in popularity under leader Jeremy Corbyn ? \nThe question has been asked after the latest ICM opinion poll reveals the party neck and neck with the Conservative party on 42%. \nThis, some are pointing out, is despite a Tory party being torn apart by Brexit and in-fighting with a leader seen as a ‘lame duck’ since the general election in June. \nFormer Labour MP Tom Blenkinsop tweeted this week after seeing the poll: “Level pegging with May. Worst Tory leader in a generation, and he’s level. Says it all.” Labour party leader Jeremy Corbyn speaks during Prime Minister's Questions in the House of Commons (Image: PA) \nMr Blenkinsop, a former MP for Middlesbrough South and East Cleveland, did not fight the seat at the general election, saying he could not campaign for Labour while Jeremy Corbyn was its leader. \nSo is it as good as it gets? Politics expert Dr Martin Farr acknowledged the point Mr Blenkinsop made. \nHowever he added: “The trouble with this is we keep saying he has gone as far as he can and he keeps exceeding expectations.” Read More 'We are a government in waiting' Jeremy Corbyn warns Theresa May as parliament gets back to work \nDr Farr of Newcastle University said the general election provided a ‘perfect storm of opportunity’ for Labour under Corbyn. \nHe said older party loyalists begrudgingly voted Labour despite not liking Corbyn as leader thinking he was going to suffer a big defeat. \nThen there was an ambitious manifesto and popular campaign which compared favourably with that of the Tory’s as well as a huge upsurge in the youth vote which helped Labour win 40% of the popular vote. Although the Tories got 42.6%, it still lost its majority. \nDr Farr said: “The key is to maintain the support he had among the young and the first time voters. They’re not usually very reliable when it comes to voting. They didn’t vote like that in the EU referendum, if they had it might have been a different result.” Prime Minister Theresa May leaves 10 Downing Street (Image: PA) \nAnd while studies have showed the so-called ‘main stream media’ has a bias against Corbyn, its influence isn’t what it was and there has been a massive growth in alternative news sites, many of which are left leaning. \n“They’re influence continues to grow which has become a factor,” said Dr Farr. \nOverall, he doesn’t think Labour under Corbyn has hit a ‘ceiling’ in popularity with the electorate. \nHe said: “The party is a lot more united than it’s been for a while and they are pitching their fight as a ‘once in a lifetime’ opportunity to vote in a truly radical Labour party into office.” Read More \nDr Farr added: “The main attack line of the Tories on Labour had been that of ‘competence’ which is not an argument they can make at the moment. \n“The Labour opposition has now got an increasingly competent leader against an increasingly incompetent government.” \nHowever he believes it will be a full five year parliament before Labour gets the chance to take the Tories on at the polls again. \nHe said: “The ironic thing is we now have a fixed term parliament act which was introduced to keep the Lib Dems happy in Coalition that is now keeping the Tories in office.” Like us on Facebook ", "external_links": [], "published": "2017-10-29T07:00:00.000+02:00", "crawled": "2017-10-29T07:32:22.010+02:00", "highlightTitle": ""}