{"organizations": [], "uuid": "8f5425e41e3013080805c3ce3aed7078ef9955ec", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article13394439.ece/ALTERNATES/s1200/2025-GDP-target.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/conservatives-announce-400-million-northern-13702493", "country": "GB", "domain_rank": 21960, "title": "Conservatives announce £400 million for Northern Powerhouse road and rail", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-02T02:00:00.000+03:00", "replies_count": 0, "uuid": "8f5425e41e3013080805c3ce3aed7078ef9955ec"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/conservatives-announce-400-million-northern-13702493", "ord_in_thread": 0, "title": "Conservatives announce £400 million for Northern Powerhouse road and rail", "locations": [], "entities": {"persons": [{"name": "phillip hammond", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "chris grayling", "sentiment": "none"}, {"name": "hammond", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "philip hammond", "sentiment": "none"}], "locations": [{"name": "north west", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "north", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "midlands", "sentiment": "none"}, {"name": "east midlands", "sentiment": "none"}], "organizations": [{"name": "northern powerhouse", "sentiment": "negative"}, {"name": "pfi", "sentiment": "none"}, {"name": "leeds", "sentiment": "none"}, {"name": "yorkshire", "sentiment": "none"}, {"name": "northern powerhouse rail", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "transport", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "cancel play", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Conservatives announce £400 million for Northern Powerhouse road and rail Transport improvements in the North to be announced in Chancellor Phillip Hammond's speech to Conservative conference Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nChancellor Philip Hammond will promise £400 million extra funding for road and rail in the North and Midlands today, as Conservatives put the Northern Powerhouse at the heart of their annual conference. \nThere will be £300 million for rail projects designed to ensure every part of the North is connected to the HS2 high speed rail line. \nHS2 is due to run to Manchester and Leeds , but does not come to the North East. However, the Government insists it will benefit the region, with services transferring on to the East Coast Main Line and running to Newcastle. \nMr Hammond will also announce £100 million for road improvements, including ten road schemes in the North East. \nHe will set out the plans in his speech to the Conservative annual conference , in Manchester. \nTories have gathered in the wake of June’s general election, which saw Labour gain 30 seats while Conservatives lost their Commons majority. Read More Here are the policies announced at the Conservative conference \nAnd they are keen to demonstrate that they are still committed to the Northern Powerhouse project , and dispel the notion that Brexit has become the Government’s sole focus. \nThe £300 million for rail will be used to create connections between the HS2 line and cities not directly on the route. \nIt is the first step towards creating a rail network to be known as Northern Powerhouse Rail, Mr Hammond will say. Cities in the East Midlands, like Leicester, would also benefit from the investment. \nMr Hammond said taking a balanced approach to the economy was critical to ensure investment in all parts of the country - bringing new jobs, businesses and homes. Read More Hospitals, roads and schools: The £12bn cost of the North East's PFI projects revealed \n“Poor infrastructure can be a barrier to progress. That’s why, as the party of progress, we are investing record amounts to strengthen transport links. \n“Today I am announcing a further £300 million to future-proof the railway network in the North. This investment will go towards ensuring HS2 infrastructure can link up with future Northern Powerhouse and Midlands rail projects - helping the towns and cities of the North reach their full potential.” \nIn his speech to the party conference, the Chancellor is expected to defend the idea of a market economy, after Labour leader Jeremy Corbyn attacked the “capitalist system” and “neo-liberalism” in his Labour conference speech last week. Read More Conservative Party Conference 2017: What to expect from Manchester \nMr Hammond will say: “Our economy is not broken: it is fundamentally strong. And while no one suggests a market economy is perfect, it is the best system yet designed for making people steadily better off over time and underpinning strong and sustainable public services for everyone. \n“As this model comes under renewed assault, we must not be afraid to defend it. \n“The market economy frees people and businesses, encourages them to create, take risks, give ideas a go because they can see the results and benefit from their success. Read More HS2 - why is it not coming to the North East? Disappointment over plans \n“It’s the profits from such businesses that underpin our savings and our pensions. And the wealth that a strong market economy creates which, in the end, pays for our public services.” \nTransport Secretary Chris Grayling said: “Today I can announce that we will deliver £100 million for local road schemes across the North of England. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \n“This Investment will help to reduce traffic congestion in the North West the North East, Yorkshire and the Humber. The details of individual schemes will be announced in due course.” Like us on Facebook", "external_links": [], "published": "2017-10-02T02:00:00.000+03:00", "crawled": "2017-10-02T02:16:01.002+03:00", "highlightTitle": ""}