{"organizations": [], "uuid": "a3ca805c22761c11f6135c0f36d335e006a71845", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13749425.ece/ALTERNATES/s1200/IBP_NEC_111017hazel_dwp_07JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/blind-diabetic-hazel-macrae-fit-13759121", "country": "GB", "domain_rank": 21960, "title": "Why blind diabetic Hazel Macrae is fit to do at least one job we know of", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-14T13:00:00.000+03:00", "replies_count": 0, "uuid": "a3ca805c22761c11f6135c0f36d335e006a71845"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/blind-diabetic-hazel-macrae-fit-13759121", "ord_in_thread": 0, "title": "Why blind diabetic Hazel Macrae is fit to do at least one job we know of", "locations": [], "entities": {"persons": [{"name": "hazel macrae", "sentiment": "negative"}, {"name": "walker", "sentiment": "none"}, {"name": "byker", "sentiment": "none"}, {"name": "hazel", "sentiment": "none"}, {"name": "blind hazel macrae", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "universal credit", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "dwp", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News opinion Why blind diabetic Hazel Macrae is fit to do at least one job we know of Was the DWP which last week overturned its decision that Hazel was fit to work being too hasty? Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nYou may well have read last week how Hazel Macrae from Walker , Newcastle, who has been blind since birth, suffers from epilepsy, Type 2 Diabetes and osteoarthritis and is housebound was deemed fit to work by the Department for Work and Pensions. \nAfter first standing by its decision, the DWP later changed its mind after reassessing the case. It of course had nothing to do with the fuss that followed the Chronicle’s original story . \nHowever, after further thought, perhaps Hazel is fit to work because I can think of at least one job she can do just as well as the person in the post right now - the one who decided she was fit to work in the first place. Hazel MacRae from Byker (Image: Newcastle Chronicle) \nIdeally everyone who can work should work. However sometimes they really, really can’t no matter what targets - or cuts - are set. \nIt’s all made worse by the fact that while the public purse strings are being tightened for the needy and vulnerable, they’re being loosened for the wealthy. Read More Victory: Blind Hazel Macrae wins her fight after she was deemed fit for work by DWP \nFor example last week it was revealed the Government was still interested in finding a titanic £100m to build a new Royal yacht. \nPro-Brexit politicians believe commissioning the boat, a “floating palace” for the Queen, could also help showcase the “best in Britain” and secure trade deals after the UK leaves the EU. \nThere is talk of it being privately funded but with grand schemes like this the public purse often has to be opened to get them over the line. \nLet’s not forget the Queen is one of the UK’s richest people and her wealth is contributed to by the benefits she gets from the state. \nHowever what she receives isn’t generally viewed as a ‘state hand out’ as it goes under the quaint name of the Sovereign Grant. There is no doubt what mere mortals like Hazel get is a hand out as it comes under the more prosaic sounding title Employment Support Allowance. \nWhich brings me to Universal Credit. A lot of people are saying it could be a good change - in theory. The problem is putting it into practice. \nBasically it’s rolling six existing benefits for low income families into one monthly payment making everything simpler. Read More Blind from birth, epileptic and unable to leave home alone - but Government says she's fit to work \nBut I fear there is something suspicious about its implementation. \nMaybe it’s just me but the problems that have hurt people most - the immediate stopping of the previous benefits payment and a six week wait (in some cases longer) for the first Universal Credit payment - saves a lot of cash for the Government. \nIn simple terms, six weeks of payment is not paid. Multiply that by all those affected and you’re talking a sizeable sum. \nWhile there is emergency funding available this has to be repaid from the money people eventually get. Doesn’t this in effect leave in perpetuity a six week black hole in finances? \nAnd let’s not forget the Universal Credit helpline that costs up to 55p a minute to call which is just so wrong you can imagine the person who dreamed it up cackling like the Wicked Witch of the West from the Wizard of Oz at the thought of it. \nBut that’s the world we live in at the moment. Like us on Facebook ", "external_links": [], "published": "2017-10-14T13:00:00.000+03:00", "crawled": "2017-10-14T13:18:36.009+03:00", "highlightTitle": ""}