{"organizations": [], "uuid": "3330b4a33b771b33e8319ed9375e1b6671f0991a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13822842.ece/ALTERNATES/s1200/GWR_-NJL_271017sandra_01.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/accountants-ey-see-newcastle-office-13822230", "country": "GB", "domain_rank": 21960, "title": "Accountants EY see Newcastle office top 600 employees", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-30T02:01:00.000+02:00", "replies_count": 0, "uuid": "3330b4a33b771b33e8319ed9375e1b6671f0991a"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/accountants-ey-see-newcastle-office-13822230", "ord_in_thread": 0, "title": "Accountants EY see Newcastle office top 600 employees", "locations": [], "entities": {"persons": [{"name": "sandra thompson", "sentiment": "none"}, {"name": "prudhoe", "sentiment": "none"}, {"name": "steve varley", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "st james boulevard", "sentiment": "none"}, {"name": "usa", "sentiment": "none"}, {"name": "ey", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "ey", "sentiment": "none"}, {"name": "data analytics", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Accountants EY see Newcastle office top 600 employees North East office contributes to 9% rise in revenues at Big Four accountancy firm Share Sandra Thompson, North East Senior Partner at EY (Image: Copyright unknown) Share Get business   Thank you for subscribing!   \nProfessional services group EY has reported a 9% growth in income during a year in which its headcount in the North East topped 600. \nThe Big Four accountancy group saw its income rise to £2.35bn in the UK, with distributable profits before tax increasing by 2.7% from £452m to £464m and distributable profit per partner increasing 2.3% to £677,000. \nEY expanded its office in Newcastle in February, taking an additional 22,950 sq ft at the CityGate development on St James Boulevard and increasing headcount from 560 to 600. The new office has space to grow by a further 300 people over the next three years. \nSandra Thompson, North East senior partner at EY, said: “It has been an exciting few months since I fully took over the reins in July and I feel that the EY Newcastle team has already achieved so much. \n“We are seeing opportunities from a wide range of businesses across the North East and further afield, from entrepreneurial tech start-ups, which are flourishing in the North East, to our traditional manufacturing businesses and large publicly quoted multinationals. We are continuing to invest in innovative solutions to service our clients as well as our Centres of Excellence in Managed Services and Data Analytics. \n“Newcastle is already a major financial services hub for EY and we are committed to investing in talent in the region. We hope that the city as a whole will benefit from the jobs we create.” \nIn September, the North East practice took on nine graduates and welcomed eight apprentices to EY’s Business Apprenticeship programme. Last week, it announced 22 senior promotions in Newcastle in its tax, audit and managed services teams. \nNationwide, EY saw significant growth across all of its four service lines in 2017. Transaction advisory services was the fastest growing area with revenue up 15.1% to £396m, while assurance grew by 11.3% to £689m and tax was up 9.1% to £634m due to a strong performance in its M&A practice and its global compliance and reporting team. Read More Businesswoman acquires Prudhoe's Fun Station after making complete career change \nSteve Varley, EY’s UK chairman, said: “This is a strong performance, particularly in an environment where Brexit and other geopolitical events have added a new dimension to doing business in the UK. We’ve seen growth across all of our service lines, sectors and our main offices across the UK. \n“Our success this year is the result of a long-term global strategy. We have invested in new technologies and our people, as clients turn to us for more innovative products and services and adapt to domestic and global economic trends. \n“At a time of global flux clients have also particularly valued our ability to draw on EY’s operations across 150 countries as they seek to navigate new trading opportunities with countries such as the USA, Australia, China and India. We are also helping our clients outside of the UK to access opportunities here.” Like us on Facebook", "external_links": [], "published": "2017-10-30T02:01:00.000+02:00", "crawled": "2017-10-30T05:20:35.001+02:00", "highlightTitle": ""}