{"organizations": [], "uuid": "58295414b3d4a34ff4228fd99c91a78b34dde342", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13805062.ece/ALTERNATES/s1200/JS116748661.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/county-durham-firm-husqvarna-adds-13804968", "country": "GB", "domain_rank": 21960, "title": "County Durham firm Husqvarna adds £43m to turnover - but sees profits fall", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-24T15:35:00.000+03:00", "replies_count": 0, "uuid": "58295414b3d4a34ff4228fd99c91a78b34dde342"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/county-durham-firm-husqvarna-adds-13804968", "ord_in_thread": 0, "title": "County Durham firm Husqvarna adds £43m to turnover - but sees profits fall", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Get business updates   Thank you for subscribing!   \nChainsaw and lawnmower manufacturer Husqvarna UK Limited saw its profits fall last year despite adding £43m to its turnover. \nThe Newton Aycliffe firm saw its turnover grow from £153.2m to £196.4m for the year ending December 31 2016. \nHowever, the firm failed to capitalise on the improved sales figures and saw its operating profit fall 22%, from £8.4m to £6.5m. \nCommenting on its results Husqvarna said the poor profit figures were a result of increased costs, particularly as a result of the fall in the pound. Read More Newcastle floodlight firm Barrier-Ex to create jobs after striking major export deals \nA spokeswoman for the firm said: “Sales increased significantly with the main increase coming from sales to affiliate overseas group companies, although there was an improvement in domestic sales too. \n“The earnings were reduced largely due to material cost pressure. However on an overall group level we are satisfied with the performance of the UK business.” \nThe material cost pressures were largely caused by the weak value of the pound against the US dollar. Husqvarna UK purchases a large quantity of its components in US dollars meaning that the real cost of the materials soared due to the Brexit-hit pound. \nHusqvarna’s strong sales growth was achieved because of an increased demand for its robotic products. Husqvarna Group celebrates production of 1 millionth robotic lawnmower at Newton Aycliffe (Image: Opr) \nIn the company accounts, chief financial officer Glen Instone said: “Turnover increased by 28% with a combination of increase in export sales of robotic lawnmowers manufactured in the Aycliffe production facility, which included a 3% increase in UK consumer sales.” \nCosts outstripped turnover growth throughout the year, however, with Husqvarna’s total sales costs increasing by 35% to £173.6m. \nHusqvarna UK Limited operates through four main division. The Husqvarna Division focuses on forest, park and garden products, while its Gardena branch specialises in watering and lawn care products. Read More SMD chief executive Andrew Hodgson to step down from job \nThe firm’s consumer brands division contains a portfolio of retail brands, while the construction division deals in machinery and diamond tools for the stone industries. \nHusqvarna added that it believed its local profits were not comparable on a year-on-year basis because it operates a global transfer price model. \nThe spokeswoman also said that the fact that the UK company paid a dividend to its parent company underlined the group’s confidence in Husqvarna UK Limited. Like us on Facebook", "external_links": [], "published": "2017-10-24T15:35:00.000+03:00", "crawled": "2017-10-24T16:28:34.001+03:00", "highlightTitle": ""}