{"organizations": [], "uuid": "61e63ed654f99725db2b7d53c9154e5adf4317a6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13718638.ece/ALTERNATES/s1200/Juice-Festival-2017.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/whats-on/whats-on-news/juice-festival-back-again-half-13718590", "country": "GB", "domain_rank": 21960, "title": "Juice Festival is back again this half term - Here are the dates and highlights", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-04T21:24:00.000+03:00", "replies_count": 0, "uuid": "61e63ed654f99725db2b7d53c9154e5adf4317a6"}, "author": "David Whetstone", "url": "http://www.chroniclelive.co.uk/whats-on/whats-on-news/juice-festival-back-again-half-13718590", "ord_in_thread": 0, "title": "Juice Festival is back again this half term - Here are the dates and highlights", "locations": [], "entities": {"persons": [{"name": "chloe daykin", "sentiment": "none"}, {"name": "rumpelstiltskin", "sentiment": "none"}, {"name": "chris", "sentiment": "none"}, {"name": "scott akoz", "sentiment": "none"}, {"name": "martin luther king", "sentiment": "none"}, {"name": "hancock", "sentiment": "none"}, {"name": "chris batstone", "sentiment": "none"}], "locations": [{"name": "juice", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "team juice", "sentiment": "none"}, {"name": "dance city", "sentiment": "none"}, {"name": "northern stage", "sentiment": "none"}, {"name": "tyne bridge", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "great north museum", "sentiment": "none"}, {"name": "newcastle civic centre", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "river tyne", "sentiment": "none"}, {"name": "shipley art gallery", "sentiment": "none"}, {"name": "tyneside", "sentiment": "none"}], "organizations": [{"name": "ngi", "sentiment": "none"}, {"name": "northern stage", "sentiment": "none"}, {"name": "freedom city", "sentiment": "none"}, {"name": "tyneside cinema", "sentiment": "none"}, {"name": "gateshead central library", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "newcastlegateshead initiative", "sentiment": "none"}, {"name": "bare toed dance company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Team Juice (Image: NewcastleGateshead Initiative, Juice) Share Get what's on updates   \nJuice is the festival that refreshes and energises and it’s back again this month to put zest into the half-term holiday. \nThe annual festival, produced by NewcastleGateshead Initiative (NGI), takes place at theatres, libraries, public spaces and other cultural venues on both sides of the River Tyne. \nIt will run this year from Friday, October 20 until Saturday, October 28. \nA traditionally wide-ranging programme includes art, dance, theatre, film and more. \nAs usual, it will see outstanding work by children and young people presented alongside that of professional artists and performers from around the region and further afield. Imagine That: Creative Family Day (Image: NewcastleGateshead Initiative, Juice) \nOnce again the festival offers the chance to try something for the first time and meet people with similar interests. \nJuice Festival could, as ever, be the springboard for some rising North East stars. \nBut some things about the 2017 edition of the festival are a little different. \nThis year it has been inspired by Freedom City 2017, the programme of events marking the 50th anniversary of Martin Luther King’s visit to Newcastle to receive an honorary degree from the university. Read More Newcastle's iconic Tyne Bridge is to host the spectacular Freedom on the Tyne finale \nAnd, as director Chris Batstone pointed out, the official description of the festival has been tweaked. \nIt is now (as you’ll see on the cover of the blue programme) “a festival for everyone, created with children and under-25s”. \nChris said: “There’s loads for families and young people to do but also for other people as well. \n“People think of Juice as being for kids but what we’ve found is that parents and older people like it too. You’re not excluded if you’re 33.” \nOnce again Chris and his colleagues at NGI and the participating venues will be assisted by Team Juice. Comics Takeover (Image: NewcastleGateshead Initiative, Juice) \nThese dedicated volunteers, aged between 18 and 25, were recruited in the spring to help put the programme together. \nChris said: “The challenge we gave to Team Juice this year was to respond to the Freedom City themes, bringing in young people from across Newcastle and Gateshead as well as artists. \n“The result is Our Time, an immersive, multi-artform event which celebrates diversity and acceptance and the ways in which young people can change things for the better.” \nIt’s to take place at the Great North Museum: Hancock (on Saturday, October 21 at 8pm) and in the programme it’s described as a party full of music, performances, installations and workshops “celebrating how young people can take inspiration from the past and present to shape the future”. \n“They’ve created the event and they’ve selected the artists,” said Chris. “It should be a great night.” \nOnce again Juice is supported by Arts Council England , Newcastle and Gateshead councils and other trusts and foundations. \nOn the first day of the festival (Friday, October 20), Random Selection, at the Tyneside Cinema’s Pop Up Film School, will celebrate the talent of young film-makers who participated in Random Acts. \nAn evening of popcorn, screenings and awards is promised. Our Time (Image: NewcastleGateshead Initiative, Juice) \nMeanwhile an exhibition called Illustrate will open at Gateshead Central Library on the same day. \nFeaturing the work of primary school pupils who have worked with artists on the theme of freedom, it will be accompanied by workshops throughout the festival. \nThe return (for the seventh year) of Anime Attacks on Saturday, October 21 will see fans of Japanese anime and manga gathering for a day-long convention at Gateshead Central Library and Shipley Art Gallery. \nCircus in the City, taking place in a big top near Newcastle Civic Centre, will run throughout the festival with workshops and performances from Newcastle-based Circus Central. Read More Baltic and Baltic 39 are hosting an exhibition visiting Tyneside for the first time in 68 years \nOn Sunday, October 22, hip-hop specialists will compete at Dance City in the Just Jam Battle Finals organised by Bad Taste Cru. \nNorthern Stage is the place to see a show called iPet on Monday, October 23 (two performances at 11.30am and 2pm). \nIt’s about two magicians for whom everything is going swimmingly until their mischievous iPad intervenes. \nThe following day, also at Northern Stage, you can see Fairytales Gone Bad in which a poetic storyteller will reveal “the true stories behind the happily ever afters” (performances at 11.30am and 1.30pm). \nAnd Northern Stage is also the place to catch the world premiere of Rumpelstiltskin, the latest from acclaimed dance company balletLORENT, which runs at Northern Stage from October 24-28. Just Jam (Image: Scott Akoz) \nImagine That is a creative family day at Gateshead Central Library on Thursday, October 26. Chloe Daykin, author of Fish Boy, will be in attendance. \nAlso on that day (and on the following Friday, too) the aerial performers of Bare Toed Dance Company will be in action at Northern Stage with Above and Beyond. \n“Harness your dancing energy and try out dance take-offs and landings using harnesses, ropes and green screen landscapes,” they challenge. \nMeanwhile some of the stars of the future will take the microphone at Northern Stage on October 26 in Young People’s First in Three, featuring new writing, comedy, theatre, music and more. \nPolitics enter the arena on Friday, October 27 with What Once Was Ours, a co-production between Zest Theatre and Half Moon. \nThe performance at Northern Stage was made in consultation with young people and is set against the background of Brexit. \nThere will be a comics takeover of Seven Stories on Saturday, February 28 as Juice reaches its grand finale. \nBetween 10am and 5pm visitors can immerse themselves in the best of comic art and have a go at making some themselves. \nFor the full programme and ticket details go to www.juicefestival.co.uk Like us on Facebook", "external_links": [], "published": "2017-10-04T21:24:00.000+03:00", "crawled": "2017-10-04T21:42:25.009+03:00", "highlightTitle": ""}