{"organizations": [], "uuid": "67fe0d9bc6e98962a0b5d47efa93163230560e35", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://i2.leicestermercury.co.uk/incoming/article663691.ece/ALTERNATES/s1200/32370733.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/news/local-news/revealed-rising-tide-hate-crime-663065", "country": "US", "domain_rank": 48128, "title": "Revealed: the rising tide of 'hate crime' in Leicestershire - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.986, "site_type": "news", "published": "2017-10-22T15:21:00.000+03:00", "replies_count": 0, "uuid": "67fe0d9bc6e98962a0b5d47efa93163230560e35"}, "author": "Ciaran Fagan", "url": "http://www.leicestermercury.co.uk/news/local-news/revealed-rising-tide-hate-crime-663065", "ord_in_thread": 0, "title": "Revealed: the rising tide of 'hate crime' in Leicestershire - Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "stevie-jade hardy", "sentiment": "none"}, {"name": "hardy", "sentiment": "none"}, {"name": "bach", "sentiment": "none"}, {"name": "darren goddard", "sentiment": "none"}, {"name": "willy", "sentiment": "none"}, {"name": "goddard", "sentiment": "none"}], "locations": [{"name": "leicestershire", "sentiment": "none"}, {"name": "wales", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "manchester arena", "sentiment": "none"}, {"name": "westminster bridge", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "nspcc  leicestershire police", "sentiment": "none"}, {"name": "leicestershire police", "sentiment": "none"}, {"name": "home office", "sentiment": "none"}, {"name": "university of leicester", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now Share \nThe scale of hate crime in Leicestershire has been revealed in new figures from police. \nThe force says it is recording a growing number of crimes committed against people because of their race, religion, sexual orientation or disability. \nIt recorded 1,213 crimes or incidents in the 2015/16 financial year and 1,363 in the following 12 months – an increase of approximately 12 per cent. Read More Sadistic killer who cut up victim's body with hacksaw fails to overturn conviction \nHowever in the first six months of the current financial year, the number of recorded cases exceeded 850, suggesting a further year on year increase lies ahead. An image from The University of Leicester’s Centre for Hate Studies film, I Can’t Ignore Hate Crime: Can You? (Image: University of Leicester) \nThe force and academics believe the true magnitude of the problem is unknown and that the official recorded offences are only the tip of the iceberg. \nDarren Goddard, the force’s hate crime officer said it was unclear to what extent the figures reflected a genuine growth in intolerance. Read More More than 50 Leicestershire children targeted by sexual groomers in two years, says NSPCC \nLeicestershire Police and other organisations across the city and county have been at the forefront of efforts to encourage victims to break their silence and speak out about crimes committed against them, he said. \nThis week was designated national Hate Crime Awareness Week and has seen events taking place across the city and the county to examine the scale of offending and to offer victims ways of seeking help. \nMr Goddard said: “We have seen an increase in hate crimes and incidents being reported to us and research suggests it is still under-reported. Police released the following statistics for hate crimes and incidents \n“So, it may be there has been a real term increase in the number of crimes and incidents but there is also an element of more people coming forward because they have the confidence they will be listened to. \n“People should not ‘get used to’ this kind of behaviour. \n“We see violence against the person and criminal damage, but public order offences always appear to be high. Read More Young couple attacked and robbed in their home by gang of six men \n“There is also the internet, which is a space where some people feel safe to say these things. They appear to feel safe hiding behind a screen.” \nAnalysts say hate crime spiked around the time of the EU referendum and in the wake of terrorist atrocities, such as the Westminster Bridge and Manchester Arena attacks. Darren Goddard, Leicestershire Police's hate crime officer (Image: Leicestershire Police) \nDr Stevie-Jade Hardy, of the Centre for Hate Studies, at the University of Leicester, believes the increase is a combination of more victims coming forward and greater intolerance. \nDr Hardy said: “However, we know there is still significant under-reporting of hate crime. \n“We speak to people – members of new and emerging communities to asylum seekers – and they tell us they are scared to walk down the street. \n“We know that hate crimes do not happen in isolation. Read More Revealed: 'Shocking' rise in violent crime across Leicestershire \n“Perpetrators are influenced by their upbringing and the media they consume as well as the political and economic landscape. \n“There are also key trigger events. In the police’s recorded figures we can see spikes around events such as the Westminster Bridge and Manchester attacks and the Brexit vote.” Dr Stevie-Jade Hardy (Image: University of Leicester) \nLeicestershire’s Police and Crime Commissioner, Lord (Willy) Bach has set tackling hate crime as a priority. \nHe has set aside about £12,000 for a pilot project which will focus on up to 60 offenders. \nResearchers at Centre for Hate Studies are working with Leicestershire Police to develop the project over the next few months. \nThe practice of bringing victims and perpetrators together, also known as restorative justice, is already commonly used by Leicestershire Police, especially in cases of anti-social behaviour. Read More Advice: What can young people do if they're worried about their mental health? \nDependant on victims’ willingness to take part, it enables offenders to apologise for their actions without being put through the courts. \nOffenders are only deemed to have successfully completed the process if their apology and acceptance that their actions were wrong is sincere. \nThe cash allocated by Lord Bach will also pay for new leaflets to explain to the public how they can seek help if they are targeted. \nLord Bach said: “Hate crime and hate incidents are unacceptable and have no place in modern society. An image from The University of Leicester’s Centre for Hate Studies 2016 film, I Can’t Ignore Hate Crime: Can You? (Image: University of Leicester) \n“To be singled out and targeted because of a hostility or prejudice towards your disability, race or ethnicity, religion or belief, sexual orientation or transgender identity, is not simply abhorrent, it is illegal. \n“We know there are people who suffer in silence and don’t feel comfortable reporting hate crime or hate incidents. \n“But I know there is a real commitment from the police and other agencies to encourage victims to come forward. Read More Hero tackles knife-wielding robber to ground, moments after violent attack \nFigures released by the Home Office earlier this week showed there were 80,393 offences across England and Wales in 2016/17, compared with 62,518 in the previous year. \nThe 29 per cent increase represented the largest rise in ‘hate crimes’ since the Home Office began recording figures in 2011/12. Read More ", "external_links": [], "published": "2017-10-22T15:21:00.000+03:00", "crawled": "2017-10-22T18:19:18.014+03:00", "highlightTitle": ""}