{"organizations": [], "uuid": "351895713744eae14387640cb931acb256aa8af9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://i1.devonlive.com/incoming/article574945.ece/ALTERNATES/s1200/4013646.jpg", "site_section": "http://www.devonlive.com/rss.xml", "section_title": "devonlive - frontpage", "url": "http://www.devonlive.com/news/devon-news/totnes-mp-dr-sarah-wollaston-649637", "country": "US", "title": "Totnes MP Dr Sarah Wollaston the only Tory to rebel against Government on Universal Credit", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-19T09:57:00.000+03:00", "replies_count": 0, "uuid": "351895713744eae14387640cb931acb256aa8af9"}, "author": "Patrick Phelvin", "url": "http://www.devonlive.com/news/devon-news/totnes-mp-dr-sarah-wollaston-649637", "ord_in_thread": 0, "title": "Totnes MP Dr Sarah Wollaston the only Tory to rebel against Government on Universal Credit", "locations": [], "entities": {"persons": [{"name": "sarah wollaston", "sentiment": "none"}, {"name": "nigel dodds", "sentiment": "none"}, {"name": "iain duncan smith", "sentiment": "none"}, {"name": "peter bone", "sentiment": "none"}, {"name": "ben bradshaw", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "abrahams", "sentiment": "none"}, {"name": "david gauke", "sentiment": "none"}, {"name": "debbie abrahams", "sentiment": "none"}, {"name": "anneliese dodds", "sentiment": "none"}, {"name": "bercow", "sentiment": "none"}, {"name": "dodds", "sentiment": "none"}, {"name": "edward leigh", "sentiment": "none"}, {"name": "john bercow", "sentiment": "none"}], "locations": [{"name": "totnes", "sentiment": "none"}, {"name": "wollaston", "sentiment": "none"}, {"name": "oxford east", "sentiment": "none"}], "organizations": [{"name": "universal credit governmen", "sentiment": "none"}, {"name": "government on universal credit totnes", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}, {"name": "universal credit", "sentiment": "none"}, {"name": "state", "sentiment": "none"}, {"name": "conservative", "sentiment": "none"}, {"name": "brexit  labour", "sentiment": "none"}, {"name": "universal credit  she", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "house", "sentiment": "none"}, {"name": "press association", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "uc", "sentiment": "none"}, {"name": "dup", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Totnes MP Dr Sarah Wollaston the only Tory to rebel against Government on Universal Credit Government defeated by Labour motion to pause roll-out of controversial benefits change Share Comments \nDevon MP Dr Sarah Wollaston rebelled against her own Conservative government in a symbolic Commons vote on Universal Credit last night. \nMPs secured the victory over Theresa May’s minority Government after they backed a Labour-led motion to pause Universal Credit – and in a mark of defiance, the motion was backed by senior Tory Dr Wollaston, the Conservative MP for Totnes. \nA vote was forced in the Commons against the backdrop of the Conservatives whipping their MPs to abstain, a move criticised by Dr Wollaston. Read More Ben Bradshaw asks whether it is possible to halt Brexit \nLabour’s motion asking for the Government to halt the roll-out of its flagship welfare reforms, which is non-binding on ministers, was approved by 299 votes to zero. \nThe vote came after more than five hours of debate which saw fierce criticism of Universal Credit's roll-out from the opposition benches, including claims it has been a \"shambles\" and \"idiotic''. \nDr Wollaston, chairwoman of the health committee, at one stage threatened to vote against the Government unless ministers recognised they need to address a \"fundamental flaw\". Totnes MP Sarah Wollaston has rebelled against the Government on Universal Credit \nShe raised concerns about the time it takes for new claimants to receive their first payment under UC, with MPs having already warned that the six-week wait has been causing issues. \nFormer Tory leader Iain Duncan Smith also advised his colleagues to resist the temptation to rebel over UC and instead continue suggesting changes to David Gauke, his successor as Work and Pensions Secretary. \nShadow work and pensions secretary Debbie Abrahams, raising a point of order after the vote, described it as a ``major defeat'' for the Government. Read More \nDr Wollaston rebelled against the Tory whip by voting in favour of Labour's motion. \nShe was the only Conservative MP to do so, according to the division list. \nThe result of the vote released by the House of Commons also said DUP deputy leader Nigel Dodds voted in the aye lobby in support of Labour's motion. \nBut Mr Dodds told the Press Association he did not vote in the aye lobby, adding: “They made a mistake.” \nLabour MP Anneliese Dodds (Oxford East) was not listed on the ayes despite speaking out against UC roll-out in the debate. \nRaising a point of order after the vote, Ms Abrahams said: \"This is a major defeat for the Government on their flagship social security programme. \n\"Conservative whips and the Prime Minister have spent today strong-arming Conservative MPs to vote against a pause of the rollout of Universal Credit. \n\"While the Secretary of State has retreated on various aspects of his Universal Credit policy, in a panicked attempt to appease Tory MPs who know that the policy is not fit for purpose. \n\"Yet again, the Prime Minister and the Tories cannot command a majority in the House of Commons. \n\"The Prime Minister is in office, but not in power.\" \nCommons Speaker John Bercow said: \"A resolution of the House of Commons is just that, an expression of the view of the nation’s elected representatives in the House of Commons. \n\"Constitutionally, and this is important...the House cannot direct ministers, and it is for ministers in the Government to decide how to respond to the clearly expressed view of the House.\" \nMr Bercow added that he felt confident ministers would do so, having granted an urgent debate on the Government’s response to opposition day debates just two weeks ago \nTory MP Peter Bone (Wellingborough) said it would be helpful where a substantive motion was passed that the Government came to the House to explain what they intended to do about it. \nMr Bercow responded it was \"a statement of fact\" Labour’s motion was passed, adding: \"I think it highly desirable that the Government, in the light of the result, should come to the House and show respect for the institution by indicating what it intends to do.\" \nTory former minister Sir Edward Leigh questioned what the point of the Commons was if it merely expresses opinions \"for the sake of it\" as he made a point of order following the vote. \nHe said he had trooped through the lobbies to vote on hundreds of divisions on Wednesdays over 34 years as an MP, and that he was \"under the impression that it served some purpose\". \n\"And what worries me is that surely there is some sort of precedent here. \n\"This is not and should not be a university debating society, what is the point of the House of Commons if we just express opinions for the sake of it and surely when we vote it should have some effect?” \nThe division list was later updated, with Mr Dodds' name no longer on the ayes list and Ms Dodds' name appearing on the list of Labour MPs who supported the motion. Like us on Facebook", "external_links": [], "published": "2017-10-19T09:57:00.000+03:00", "crawled": "2017-10-19T10:09:41.008+03:00", "highlightTitle": ""}