{"organizations": [], "uuid": "348caca8433e43f8ced02efd85cb1d97105cd5ad", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13666826.ece/ALTERNATES/s1200/JBR_NEC_091013p5short_01.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/north-east-politician-lands-key-13823191", "country": "GB", "domain_rank": 21960, "title": "North East politician lands key role in David Davis' Brexit team", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-27T21:07:00.000+03:00", "replies_count": 0, "uuid": "348caca8433e43f8ced02efd85cb1d97105cd5ad"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/north-east-politician-lands-key-13823191", "ord_in_thread": 0, "title": "North East politician lands key role in David Davis' Brexit team", "locations": [], "entities": {"persons": [{"name": "martin callana", "sentiment": "negative"}, {"name": "david davis", "sentiment": "negative"}, {"name": "joyce anelay", "sentiment": "none"}, {"name": "joyce", "sentiment": "none"}, {"name": "baroness anelay", "sentiment": "none"}, {"name": "anelay", "sentiment": "none"}, {"name": "tyne", "sentiment": "none"}, {"name": "adonis", "sentiment": "none"}, {"name": "martin callanan", "sentiment": "none"}, {"name": "baron callanan", "sentiment": "none"}, {"name": "callanan", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "bosnia", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}, {"name": "north east england", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "herzegovina", "sentiment": "none"}], "organizations": [{"name": "european conservatives", "sentiment": "none"}, {"name": "house of lords", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "department for transport", "sentiment": "none"}, {"name": "state", "sentiment": "none"}, {"name": "european parliament", "sentiment": "none"}, {"name": "black hawk", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "st johns", "sentiment": "none"}, {"name": "state of aviation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News North East politician lands key role in David Davis' Brexit team Former Minister Martin Callanan has a new job as a Brexit Minister, after the last one hurt herself jumping out of a helicopter Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates   Thank you for subscribing! Could not subscribe, try again later Invalid Email \nA former North East MP has been given a role overseeing the UK’s Brexit negotiations . \nMartin Callanan has been appointed Minister of State at the Department for Exiting the European Union (DExEU), replacing Joyce Anelay, Baroness Anelay of St Johns. \nShe quit after apparently injuring herself leaping out of Black Hawk helicopter in Bosnia. \nBaroness Anelay was touring Bosnia and Herzegovina to meet victims of war and terror when she sustained the “uncomfortable injury”. \nShe told website Conservative Home : “It was the Black Hawk helicopter that did it. \n“It was 2015, and as a Foreign Office Minister I was touring Bosnia and Herzegovina, meeting victims of war and terror for whom British overseas power had been a ladder out of oppression. Read More Boots accused of failing County Durham pharmacist who took her own life \n“Unfortunately for me, that particular ladder hadn’t materialised when it came to getting out of the helicopter. \n“One ill-judged leap later, and I sustained an uncomfortable injury that has called time on my ministerial career after two decades on the Front Bench.” \nThe baroness, who voted remain in the referendum, said she had accepted the Brexit role because the government had a “duty to act on the instructions of the electorate”. \nHer story was questioned by Labour peer Lord Adonis, who said on Twitter : “Lady Anelay’s accident was two year ago. She took this post 4 months ago. The ‘accident’ causing her departure was Brexit.” (Image: Publicity Picture) \nLord Callanan spent 15 years as a Member of the European Parliament for the North East England constituency from 1999, being re-elected in 2004 and 2009.# \nHe became the leader of the European Conservatives and Reformists group from 2011-2014, and was made a Life Peer on 24 September 2014 taking the title Baron Callanan, of Low Fell in the County of Tyne and Wear. Read More This is how much a 'no-deal' Brexit would drain out of Newcastle and the rest of the North East \nHe previously served as the Parliamentary Under-Secretary of State of Aviation, International and Security at the Department for Transport. \nDavid Davis, Secretary of State for Exiting the European Union, said: “Joyce has made an invaluable contribution to ensuring a successful departure from the EU through her work representing Britain abroad, and representing the Department in the House of Lords. \n“She’s been a great part of our Ministerial team and a good friend. I wish her all the best as she returns to the back benches where she will bring an unparalleled level of experience to the task of scrutinising Brexit legislation on its way through the House of Lords. \n“I’m delighted to welcome Lord Callanan to the Department — he brings with him a wealth of experience in Brussels and a proven ability in political leadership. I look forward to working together as a Ministerial team to continue delivering the important task of negotiating our exit from the European Union and making a success of Brexit.” Like us on Facebook", "external_links": [], "published": "2017-10-27T21:07:00.000+03:00", "crawled": "2017-10-27T21:50:13.000+03:00", "highlightTitle": ""}