{"organizations": [], "uuid": "12fe389c8a3a60759b4c1087e3b38f89bf9300aa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article13733365.ece/ALTERNATES/s1200/Hate-crimes-targeting-mosques.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/hate-crimes-double-against-mosques-13733345", "country": "GB", "domain_rank": 21960, "title": "Hate crimes double against mosques and Muslim places of worship in last year", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-09T07:00:00.000+03:00", "replies_count": 0, "uuid": "12fe389c8a3a60759b4c1087e3b38f89bf9300aa"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/hate-crimes-double-against-mosques-13733345", "ord_in_thread": 0, "title": "Hate crimes double against mosques and Muslim places of worship in last year", "locations": [], "entities": {"persons": [{"name": "muslim", "sentiment": "negative"}, {"name": "abbott", "sentiment": "none"}, {"name": "diane abbott", "sentiment": "none"}], "locations": [{"name": "northumbria", "sentiment": "none"}, {"name": "westminster", "sentiment": "none"}, {"name": "durham constabulary", "sentiment": "none"}, {"name": "manchester share finsbury park mosque", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}, {"name": "finsbury park", "sentiment": "none"}, {"name": "cheshire", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "london bridge", "sentiment": "none"}], "organizations": [{"name": "greater manchester police", "sentiment": "none"}, {"name": "metropolitan police", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "islamic state", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "home office", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "press association", "sentiment": "none"}, {"name": "freedom of information", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Hate crimes double against mosques and Muslim places of worship in last year Figure for attacks in the North East goes up but not as much as in other UK areas like London and Manchester Share Finsbury Park Mosque in north London (Image: PA) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nHate crimes targeting mosques and other Muslim places of worship more than doubled across the UK over the last year, it has been revealed. \nPolice forces recorded 110 incidents between March and July this year, up from just 47 over the same period in 2016. \nThey included three hate crimes in the North East in 2017, up from two last year. \nRacist abuse and threats to “bomb the mosque” feature heavily among the hate crimes, as do incidents of offenders smashing windows on buildings and parked cars. \nOther records include offensive graffiti sprayed on to buildings, violent assaults on worshippers, two cases of arson and two cases of individuals leaving bacon on door handles at mosques. \nShadow home secretary Diane Abbott called the figures “deeply troubling”. \nShe said: “Attacks on any religious group or minority are abominable,. \n“These anti-Muslim attacks will be condemned by all decent people.” Diane Abbott speaking during the Labour Party annual conference (Image: PA) \nThe data was obtained by the Press Association through Freedom of Information requests to UK police forces. \nThe figures were based on 42 responses from 45 forces. \nThey revealed that 25 forces saw a year-on-year increase in hate crimes directed at mosques, with the biggest rise reported by Greater Manchester Police with nine crimes, up from zero and London’s Metropolitan Police, 17 crimes, up from eight. \nMeanwhile threats, harassment or other intimidating behaviour more than tripled, from 14 crimes in 2016 to 49 this year. \nViolent crime against individuals more than doubled from five recorded crimes against worshippers at mosques in 2016 to 11 crimes in 2017. \nVandalism or criminal damage increased from 12 in 2016 to 15 in 2017. \nIn the Durham Constabulary area there were two incidents this year, up from one last year. \nIn the Northumbria Police area, there was one incident this year and one incident last year. Read More Race hate crime in North East soars to record levels in post Brexit period \nDue to differences in how police forces across the UK record their statistics and the fact that not all forces are included in the figures, the true number of hate crimes directed at mosques is likely to be higher still. \nBritain endured a number of terror attacks claimed by Islamic State over the period in which the crimes were recorded, at London Bridge, Westminster and Manchester. \nThe figures come to light within weeks of separate incidents in which an imam and surgeon who treated Manchester bombing victims was stabbed outside a mosque in Cheshire and a 14-year-old boy was stabbed multiple times in the face and neck outside a mosque in Birmingham. Read More Newcastle leaders on 'radicalisation' fears as mosque holds service one week after Manchester attack \nOther high-profile cases of hate crime at mosques this year include the Finsbury Park terror attack in June, a Manchester mosque gutted by fire in an arson attack in July and the sending of a white powder and bomb threats to three mosques across London in July. \nMs Abbott called on the Home Office to publish data on hate crimes against all places of worship “as a matter of course” after “worrying reports of attacks on synagogues as well as mosques”. \nShe said: “Politicians have a particular responsibility in the language they use, the policies they advocate and the climate they create. \n“There should be a unanimous message that violence against any section of our society is unacceptable.” \nA Home Office spokesman said: “All forms of hate crime are completely unacceptable and the UK has some of the strongest laws in the world to tackle it.” Like us on Facebook ", "external_links": [], "published": "2017-10-09T07:00:00.000+03:00", "crawled": "2017-10-09T07:16:00.003+03:00", "highlightTitle": ""}