{"organizations": [], "uuid": "2680fe07778993ccf323cf70047178862a76b02c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13750613.ece/ALTERNATES/s1200/Brexit.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/could-bid-block-brexit-lead-13769311", "country": "GB", "domain_rank": 21960, "title": "Could bid to block Brexit lead to our EU departure never happening?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-16T20:00:00.000+03:00", "replies_count": 0, "uuid": "2680fe07778993ccf323cf70047178862a76b02c"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/could-bid-block-brexit-lead-13769311", "ord_in_thread": 0, "title": "Could bid to block Brexit lead to our EU departure never happening?", "locations": [], "entities": {"persons": [{"name": "theresa may lea", "sentiment": "negative"}, {"name": "caroline lucas", "sentiment": "none"}, {"name": "barnier", "sentiment": "none"}, {"name": "jean-claude juncker", "sentiment": "none"}, {"name": "matt zarb-cousin", "sentiment": "none"}, {"name": "catherine mckinnell", "sentiment": "none"}, {"name": "chris leslie", "sentiment": "none"}, {"name": "vince cable", "sentiment": "none"}, {"name": "david davis", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "john mcdonnell", "sentiment": "none"}, {"name": "lucas", "sentiment": "none"}, {"name": "martin selmayr", "sentiment": "none"}, {"name": "michel barnier", "sentiment": "none"}, {"name": "chuka umunna", "sentiment": "none"}, {"name": "marr", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "chris grayling", "sentiment": "none"}, {"name": "bill", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "john bercow", "sentiment": "none"}, {"name": "peston", "sentiment": "none"}, {"name": "jonathan arnott", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "west midlands", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "bbc", "sentiment": "none"}, {"name": "customs union", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "itv", "sentiment": "none"}, {"name": "european economic area", "sentiment": "none"}, {"name": "committee", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}, {"name": "european commission", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}, {"name": "newcastle north", "sentiment": "none"}, {"name": "bbc one", "sentiment": "none"}, {"name": "hansard society", "sentiment": "none"}, {"name": "read more  transport", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "green", "sentiment": "none"}, {"name": "houses of parliament", "sentiment": "none"}, {"name": "european council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Could bid to block Brexit lead to our EU departure never happening? MPs want to stop Theresa May leaving the EU if there is no replacement deal secured Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily   Thank you for subscribing!   \nMPs have launched a bid to stop Brexit taking place unless the European Union agrees a trade deal with the UK. \nThey have introduced amendments to the European Union (Withdrawal) Bill - also known as the Great Repeal Bill - which would stop Brexit happening until a new treaty between the UK and EU has been approved by Parliament. \nAs things stand, the UK is set to leave the EU in March 2019. \nBut the prospect of the UK failing to agree a replacement trade and customs deal with the EU has encouraged speculation that Brexit might be delayed, or simply never happen. \nThe amendment has been sponsored by 19 Labour and Liberal Democrat MPs, including Newcastle North MP Catherine McKinnell, former Labour Shadow Chancellor Chris Leslie, Liberal Democrat leader Sir Vince Cable and Labour backbencher Chuka Umunna. It is also backed by Green MP Caroline Lucas. \nIt would delay the repeal of the 1972 European Communities Act “until a new Treaty establishing a future relationship between the UK and EU has been agreed and ratified by Parliament”. \nA separate amendment backed by Plaid Cymru MPs and Ms Lucas would make Brexit conditional on the Prime Minister reaching an agreement for the United Kingdom to remain a member of the European Economic Area - effectively keeping us in the single market - and Customs Union. An anti-Brexit protester waves an EU flag outside the Houses of Parliament (Image: PA) \nThe Bill has received its second reading in the Commons and will now move to what’s known as the Committee stage, giving MPs have a chance to propose and vote on amendments. \nA relatively small number of MPs have sponsored the amendments but others can vote for them when the time comes. \nNorth East UKIP MEP Jonathan Arnott said he believed Brexit would go ahead, but attempts to block a “no-deal” Brexit actually made it harder for the UK to agree good terms with the EU. \nHe said: “Imagine this from the other side of the negotiations. If the EU knows there is a concerted move in the UK to say you have to have any deal, no matter how bad it is for the UK, then EU will push for a worse deal for the UK, knowing the British government has no choice other than to sign it.” \nPrime Minister Theresa May says the UK is ready to leave the EU without a deal, if needed. \nBut Labour Shadow Chancellor John McDonnell said over the weekend that his party will attempt to block a “no-deal” Brexit. \nHe told BBC One’s Marr show: “I don’t think no deal is a realistic option. There are enough sensible people in the House of Commons to say ‘this cannot happen, we cannot damage our country in this way’.” \nLabour’s policy is to leave the EU with a trade deal. \nCommons Speaker John Bercow has told MPs they have every right to vote to stop Brexit. \nSpeaking to the Hansard Society last week, he said: “There will be some members of Parliament who say: ‘I want to be able at the end of all this if I’m not satisfied, to say no, to try to persuade other members of parliament to say no, and to hope that no might delay Brexit or prevent Brexit’. \n“Do they have a right to argue that point of view? They absolutely do.” Read More How will Brexit affect the North East? The Treasury knows but they're not going to tell you \nOne of the latest to say Brexit may never happen is Matt Zarb-Cousin, who was Labour leader Jeremy Corbyn’s official spokesman until earlier this year. \nSpeaking on ITV’s Peston show, he said: “Because of the way negotiations have been handled, I don’t think we’re going to get a deal so I think we’re going to end up staying in the European Union.” \nHe predicted Prime Minister Theresa May would resign and the Conservatives would have a leadership contest. \nBut the prospect of the Government and EU failing to agree a new deal is looking increasingly likely. \nMrs May is today, Monday, heading to Brussels to try to kick-start talks. Along with Brexit Secretary David Davis, she will have dinner with European Commission President Jean-Claude Juncker, his chief of staff Martin Selmayr and the EU’s chief Brexit negotiator Michel Barnier. \nMr Barnier last week warned the talks were in “deadlock”. \nThe meeting comes three days before the European Council summit at which EU leaders will decide whether sufficient progress has been made to enable the EU and UK to move on to discussions about their future trade relationship. \nAnd the Government seems to be preparing the ground for the prospect of leaving the EU without a trade or customs deal in place Read More \nTransport Secretary Chris Grayling suggested British farmers could grow more food, to make up for EU products that would vanish from supermarket shelves or become more expensive. \nTreasury has examined how Brexit will affect the West Midlands but won’t publish the findings \nHe told the BBC: “What it would mean would be that supermarkets bought more from home, that British farmers grew more and that they bought more from around the world.” Like us on Facebook", "external_links": [], "published": "2017-10-16T20:00:00.000+03:00", "crawled": "2017-10-16T20:27:48.000+03:00", "highlightTitle": ""}