{"organizations": [], "uuid": "3ab6b345613e68e64ecb13c3cfd454d248db34c9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13321457.ece/ALTERNATES/s1200/Barclays-fraud-campaign.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13813063", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Barclays to ring-fence retail banking arm in case of second banking crisis", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-26T10:00:00.000+03:00", "replies_count": 0, "uuid": "3ab6b345613e68e64ecb13c3cfd454d248db34c9"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13813063", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Barclays to ring-fence retail banking arm in case of second banking crisis", "locations": [], "entities": {"persons": [{"name": "kelleher", "sentiment": "none"}, {"name": "brexit.she", "sentiment": "none"}, {"name": "quinton", "sentiment": "none"}, {"name": "cellnutrition", "sentiment": "none"}, {"name": "emma walmsley", "sentiment": "none"}, {"name": "jonathon", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "jonathan oxley", "sentiment": "none"}, {"name": "john kelleher", "sentiment": "none"}, {"name": "walmsley", "sentiment": "none"}, {"name": "danny lawson/pa wire", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "atlantic ocean", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "fatfield", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "barclays", "sentiment": "negative"}, {"name": "ofcom", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "bt", "sentiment": "none"}, {"name": "cellnutrition quinton ltd", "sentiment": "none"}, {"name": "glaxosmithkline", "sentiment": "none"}, {"name": "cellnutrition", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "jonathon manning pharma", "sentiment": "none"}, {"name": "bic", "sentiment": "none"}, {"name": "gsk", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning Hargreaves' £25m investment in Germany can deliver huge returns, directors say \nA director at one of the North East’s biggest employers has revealed how major investment in a European operation has the potential to deliver huge returns for the whole group. \nDurham’s Hargreaves Services set up a raw materials trading business in Duisberg, Germany, 11 years ago and its success over the years culminated in it being recognised as the “star performer” in the group last year, serving up operating profit of £10.3m. \nThe firm, Hargreaves Raw Materials Services (HRMS), supplies raw materials to major European customers in the steel, foundry, smelting, ferroalloy, sugar, limestone, insulation, refractory and ceramic industries, which continues to be big business in Germany. \nNow the company is committing nearly £25m to building a carbon pulverisation plant in Duisberg which will process carbon-based raw materials, including coal and coke, into a product offering customers technical and cost advantages over alternative materials. \nHargreaves’ UK operations were built upon industrial services, coal distribution and mining earthworks but as heavy industry declines in Britain the group has moved away from the traditional operations to focus on property and energy projects, both of which have great long term potential. \nGermany industry markets however remain strong, prompting the new investment which, finance director Iain Cockburn says, would never have been possible on home soil. \nHe said: \nIt’s taking place in Germany simply because there is still a huge amount of heavy industry in and around that part of Germany, whereas heavy industry that uses these coal based products has almost gone in the UK. \nThe opportunity just simply is not there in the UK to build such a facility. It’s a reflection of UK industrial decline really. \nThe payback on such a plant is long term - it needs to be a long term facility so you need to be sure that the customers will be there in the long term. \nGermany has been a very successful part of the group for 10 years and the markets there are very different. Markets are recovering so we can see long term potential which will give the German business a strong base to trade around. \nWe see Germany as being a very profitable, cash-generating investment for the group. Iain Cockburn, group finance director at Hargreaves Services 9:05 Jonathon Manning North East designed app could save lives and NHS time by explaining how complicated drugs work \nA North East tech firm is helping to save lives as well as valuable NHS time after releasing a new app . \nNorthumberland’s Mistura Informatics has developed MaPPS – which stands for Medicines: A Patient Profile Summary – to help patients receive easy to understand information about their medication. \nThe app is aimed at medical service providers, and allows the user to read concise information about all medicines in less than 250 words. \nIt includes important information such as what the drug is, what is does, possible side effects, and how the medication should be taken. \nThose behind MaPPs says it will reduce medical wastage and by helping to improve patients’ health will also save valuable NHS resources. \nProfessor Steve Bazire, director of content at Mistura Informatics, said: \nOur challenge was to create a technical solution providing up to date, easily understood information containing all a patient’s medications, with additional tools to help manage medicines. \nManufacturers’ patient information leaflets (PIL) are paper-based, complicated by clinical terms, difficult to read, and confusing for patients. \nHealthcare professionals fail to effectively manage to counsel most patients about medicines, contributing to poor adherence with prescribed medication with reduced outcomes plus readmissions. \nAdditionally, hospital admissions for adverse drug reactions remain high, with patient morbidity and death and significant NHS costs. Mistura Informatics MD Dawn Price, David Heller from Surrey And Sussex Healthcare NHS Trust, and Professor Steve Bazire from Mistura Informatics (Image: Unknown) 8:57 Jonathon Manning NHS Cyber attack 'could have been prevented by basic IT security measures' \nA cyber attack which crippled parts of the NHS in May could have been prevented if “basic IT security” measures had been taken, an independent investigation has found.The head of the National Audit Office warned the health service and Department of Health to “get their act together” in the wake of the WannaCry crisis, or risk suffering a more sophisticated and damaging future attack.The NAO’s probe, released on Friday, found that almost 19,500 medical appointments, including 139 potential cancer referrals, were estimated to have been cancelled, with five hospitals having to divert ambulances away after being locked out of computers on May 12.The malware is believed to have infected machines at 81 health trusts across England - a third of the 236 total, plus computers at almost 600 GP surgeries, the NAO found.All were running computer systems - the majority Windows 7 - that had not been updated to secure them against such attacks.The NAO said that while the health service’s IT arm NHS Digital had issued “critical alerts” about WannaCry in March and April, the DoH had “no formal mechanism” to determine whether local NHS organisations had taken any action.Sir Amyas Morse, the head of the NAO, said: \nThe WannaCry cyber attack had potentially serious implications for the NHS and its ability to provide care to patients. \nIt was a relatively unsophisticated attack and could have been prevented by the NHS following basic IT security best practice. \nThere are more sophisticated cyber threats out there than WannaCry so the Department (of Health) and the NHS need to get their act together to ensure the NHS is better protected against future attacks. \nMore than 300,000 computers in 150 countries were infected with the WannaCry ransomware.It crippled organisations from government agencies and global companies by targeting computers with outdated security.At the time security experts warned the NHS that running outdated computer operating systems was a “ticking time bomb”, leaving it vulnerable to further attacks.Medical staff reported seeing computers go down “one by one” as the attack took hold, locking machines and demanding money to release data on them. \nNorthumbria Healthcare NHS Foundation Trust, which runs the new Cramlington hospital, as well as North Tyneside General Hospital and Hexham General Hospital, was one of numerous trusts to have been hit simultaneously on Friday by a ransomware attack. A virus and spyware warning message on a laptop screen, following a major cyber attack on NHS computer systems (Image: PA) 8:50 KEY EVENT Panel of cyber security experts to provide guidance at Journal event \nA panel of experts has been lined up by The Journal for an event exploring one of the biggest challenges to businesses today: cyber security . \nThe event, which takes place at the Centre for Life in Newcastle on November 14, comes as a number of high-profile businesses have suffered cyber attacks but as research has shown that many firms are underprepared for the threat of online fraud. \nThe event is being sponsored by North P&I Club, with Journal business editor Graeme Whitfield chairing the debate. \nThe panel is made up of: Asam Malik, cyber security director at PwC Colin Gillespie, deputy director (loss prevention) at North P&I Club Dan Hoggan, technical director at Mediaworks Dr Maryam Mehrnezhad, research fellow at the School of Computing, Newcastle University Helen Brain is an IP & IT partner at Square One Law Michael Easom, deputy director (IT) at North P&I Club 8:45 KEY EVENT Alive after Five added £131m to Newcastle's economy last year \nNewcastle’s Alive after Five programme was worth an extra £131m to the city’s economy last year, according to new figures. \nThe programme, which was devised by Business Improvement District company Newcastle NE1 Ltd, is designed to keep the city open in the early evening. \nIt works by extending retail opening hours until 8pm throughout the year and is supported by free parking after 5pm at council run car parks. \nBy maintaining a vibrant atmosphere it is hoped that Newcastle can hold its own against other modern European cities. \nSince its launch in 2010 Alive after Five has helped generate an estimate £839m for the city’s economy, with £131m generated last year. \nThe latest figures also show that the scheme encouraged an extra 2.1 million visits to Newcastlebetween 5pm and 8pm last year. Since 2010 an additional 13.7 million visits to the city have been made. \nStephen Patterson, director of communications at Newcastle NE1, said: \nAlive after Five has had a transformational impact on Newcastle’s early evening economy. \nWith the lights on, shutters up and thousands of additional people in the city in the early evening, it is now a far more welcoming and vibrant experience. \nThese results underline the significant impact Alive after Five has had, and whilst the scheme has been a huge success, we cannot afford to be complacent. \nAs a city, we need to be relentless in delivering the best possible customer experience and improving the city’s transport links at a regional, national and international level. Newcastle's Alive after Five programme helped add £131m to Newcastle's economy last year 8:40 Jonathon Manning Debenhams sees full year profits dive \nDepartment store chain Debenhams has reported a collapse in annual profits as boss Sergio Bucher bemoaned an “uncertain” trading environment.The retailer said pre-tax profit fell 44% to £59m in the year to September 2, with like for like sales in the UK coming in flat.The company also booked a £36.2m exceptional charge linked to a restructure being undertaken by the chief executive.Sales rose 2% to £2.95bn and Mr Bucher said that Debenhams is “making progress”. \nWe are making good progress with implementing our new strategy, Debenhams Redesigned, and are encouraged by the results from our initial trials, as well as the number of exciting new partners who want to work with us. \nThe environment remains uncertain and we face tough comparatives over the key Christmas weeks. \nThe chief executive, who took over a year ago, is attempting a turnaround of the firm and the figures show he has made some headway.Sales of beauty, accessories and food and drink helped to mitigate the impact of a weaker clothing market, Debenhams said, with food sales rising 8%.Group like-for-like sales in the year rose 2.1%.However, like other retailers, Debenhams is grappling with soaring inflation linked to the Brexit-hit pound.Inflation, which has soared since the referendum and stands at 3%, has seen costs rocket and is tightening the squeeze on consumer spending, hitting retail sales across the board.To mitigate the impact, Debenhams has also been shaking up its supply chain. \nThe group said: \nWe continue to invest in supply chain improvements which are helping to mitigate some of the additional currency-related costs. In relation to those costs we are unable to offset, we intend to maintain our competitive position, reacting to market conditions as appropriate. Debenhams in Newcastle (Image: Newcastle Chronicle) 8:37 KEY EVENT The Chocolate Smiths are set to open their own shop after moving to a bigger base \nQuirky confectioners The Chocolate Smiths are going global with their unusual treats, tasting sweet success with deals in Australia and Europe . \nThe Chocolate Smiths was launched by Steffi Smith and business partner Amy Francis three years ago, after deciding to go it alone when they were both made redundant from a chocolate shop in Northumberland, just two days before Christmas in 2013. \nThe pair have taken on two other employees to help them deal with demand for their unmistakable, unusual chocolate bars, branded as “luxury chocolate with the fun left in”, often making more than 300 bars a day to send to a host of North East and UK stockists, including long-term supporter Fenwick Food Hall. \nThe wacky flavours are already a big hit in the North East with bars, packaged in Victorian-style wrapping, coming in flavours like Bubblegum Sundae, Banoffee Bread, Americana with peanut butter and pretzels, and seasonal specials such as Chrimbo Dinner. \nAs well as having their own website the Chocolate Smiths also supplies confectionery to a number of North East tourist attractions and companies, such as Beamish Museum’s sweet shop, Alnwick Garden and Easy Teasy tea company, while also supplying an exclusive range to Fenwick with flavours including chip shop curry and gin and tonic. \nNow the firm is flying the flag for North East chocolatiers outside the region and around the world, having struck distribution deals in the Netherlands, Australia and in top stockists in London. \nThe firm’s growing success has also triggered a move from the North Tyne Industrial Estate into a bigger, better equipped unit at West Allotment , where they plan to open a small shop, and where customers can also see how the chocolate bars are made. \nAmy Francis said: \nIn general, it’s all going really well. We’ve been working on Christmas since June and we’ve been really busy making around 300 bars of chocolate every day, depending on what we are doing. \nWe sent an order out to Australia last year and this year we have sent out even more, over 2,500 chocolate bars including the Christmas flavours and our big sellers. \nWe are also now stocked in the Netherlands, in a department store chain called De Bijenkorf which has been described as the Dutch answer to Selfridges. \nI think people like us because we are different. You’ve got lots of companies out there making high quality chocolate, but no one doing great quality chocolate with flavours that are a bit different. Amy Francis and Steffi Smith of The Chocolate Smiths, based in Benton (Image: Newcastle Journal) 8:30 KEY EVENT BT landline-only customers will see bills slashed after Ofcom move \nBT landline-only customers will save more than a third each year on their line rental bill, Ofcom has announced.Up to one million customers will see their monthly bills cut by £7 after the telecoms giant agreed “in full” to a proposal made by the UK’s communications regulator.This adds up to an annual saving of £84 - a 37% reduction from a typical yearly bill. Ofcom said it had conducted a review of the market due to concerns over line rental prices rising despite a fall in wholesale costs.It recommended that BT reduce its monthly bills by between £5 and £7, which the company agreed to “in full”. \nThe move will benefit thousands of elderly callers without broadband, Ofcom said. Nearly two thirds of BT customers who only have a landline are over the age of 65.A customer who currently pays £18.99 a month will pay £11.99 when the changes come into force in April 2018.This will return line rental prices to a similar level to those charged in 2010, Ofcom said.The majority of affected customers - around 800,000 - will see the reduction appear automatically on their bills.A further 200,000 people on BT’s Home Phone Saver package, which offers a separate bundle discount, will be able to choose whether they move to the standard tariff.A BT spokeswoman said: \nWe welcome a balanced voluntary agreement with Ofcom which means that up to 1 million of our customers who don’t have broadband will receive a substantial cut in the price of their line rental from April 2018. \nWe have listened to the concerns of our line-only customers and agreed to reduce the price of line rental for them by £7 a month, or £84 a year, which means they will only pay £11.99 a month for standard line rental. \nJonathan Oxley, Ofcom’s competition group director, said: \nFor many people, their landline is their lifeline. \nBut households who only have a landline - and no broadband - have seen their phone bills soar. \nMany are elderly, and have been with BT for decades. We’ve been clear that they must get a better deal. \nSo I’m pleased BT has responded to our plans in full by cutting these customers’ bills. 8:25 Jonathon Manning Supplement firm Cellnutrition looks to boost sales after moving to Sunderland's BIC \nMineral and supplement specialist Cellnutrition Quinton Ltd is gearing to expand its business across the UK after moving its headquarters to Sunderland’s North East Business and Innovation Centre (BIC). \nCellnutrition was set up by businessman John Kelleher last year, and focuses on distributing a supplement known as Quinton. \nThe business predominantly distributes its products across Ireland but, after moving its head office to Sunderland, it is now looking to sell Quinton across the UK. \nQuinton is used to replenish the body with many of the minerals it requires to stay healthy, and is used by many of Team GB’s Winter and Summer Olympic athletes. \nMr Kelleher said: \nQuinton is harvested from the pristine plankton bloom in the Atlantic Ocean and includes 78 minerals and trace elements which are 100% natural. \nWe currently supply the product to all major pharmacies in Ireland and are now calling for UK pharmacies to get in touch to stock the product. \nAs well as moving its office from Fatfield, in Washington, to the BIC, Cellnutrition also recently won the Best New Product Launch in the 2017 Irish Pharmacy News Over the Counter Awards. \nMr Kelleher added: \nSince the launch of the company last year, the supplement has gone down really well in Ireland and we want to replicate that success here in the UK. Winning the award was just the perfect end to a great first year in business. \nOur move to a multi-purpose business centre comes at a crucial time for us as a growing company. The additional support services available at the BIC, in particular their international connections and projects, will no doubt benefit us as we look to distribute our products more widely. \nThe centre manager has been brilliant during the refurbishment of our new office and has considered our needs during each stage. Cellnutrition team in their new headquarters (Image: Unknown) 8:20 Jonathon Manning Pharma giant GSK to start booking Brexit costs by year-end \nThe boss of GlaxoSmithKline (GSK) has said the pharma giant will start booking costs linked to Brexit contingency plans by year-end but is pressing the Government to give details on a transition deal as soon as possible.Chief executive Emma Walmsley said the company is already laying the groundwork for Brexit as it waits for news on a potential licensing or mutual recognition deal with the EU that would allow the pharmaceuticals industry to continue serving customers across borders. \nMs Walmsley said: \nIn terms of Brexit and the timing of any transition, it would be good to know as soon as possible, as we have said, but we are moving forward with contingency planning right now. \nShe assured that Brexit is not expected to have a “material impact” on the group’s finances, but “will involve real cost”. \nShe explained \nWe will need to start spending really from the end of the year. \nWhile GSK is not planning on moving operations out of Britain, it is looking at duplicating and building up certain facilities within the EU in hopes of securing its continental business after Brexit.She said: \nWe are not thinking of any relocation out of the UK, but of course, as we said, we are looking at contingency planning in terms of testing facilities, to allow us to have as seamless a transition as possible, and make sure we are providing secure supply to the patients that need our drugs and medicines. \nThe pharma giant has “five asks” for the Government, which include ensuring that the UK can participate in the EU regulatory framework, providing frictionless trade, setting up a talent-friendly immigration policy, and predictable funding levels for UK sciences.But Ms Walmsley said the company was most concerned about the lack of certainty over a transition deal with the EU. \nThe most important thing is to get to clarity on an implementation phase for at least two years, potentially longer, but to get clarity on that as soon as possible. \nWe then, absolutely, need to make sure that the UK is able to participate in the EU regulatory framework to the fullest extent possible, whether that be for licensing or pharmacovigilance, clinical trials and really to avoid regulatory divergence, if we can, with maximum mutual recognition agreements. GSK (Image: Danny Lawson/PA Wire) 8:15", "external_links": [], "published": "2017-10-26T10:00:00.000+03:00", "crawled": "2017-10-26T10:44:05.007+03:00", "highlightTitle": ""}