{"organizations": [], "uuid": "adbcf7e2c4b3c27280f4d2a97593d2e018ee1e48", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article691410.ece/ALTERNATES/s1200/de1a1b44-5dc1-4c0b-bf83-a237e756615e.jpg", "site_section": "http://www.devonlive.com/rss.xml", "section_title": "devonlive - frontpage", "url": "http://www.devonlive.com/news/devon-news/exeter-poppy-appeal-shop-opens-691305", "country": "US", "title": "Exeter Poppy Appeal shop opens as 30,000 red poppies to go on show in Exeter Cathedral", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-27T17:06:00.000+03:00", "replies_count": 0, "uuid": "adbcf7e2c4b3c27280f4d2a97593d2e018ee1e48"}, "author": "Daniel Clark", "url": "http://www.devonlive.com/news/devon-news/exeter-poppy-appeal-shop-opens-691305", "ord_in_thread": 0, "title": "Exeter Poppy Appeal shop opens as 30,000 red poppies to go on show in Exeter Cathedral", "locations": [], "entities": {"persons": [{"name": "vince cable on brexit", "sentiment": "none"}, {"name": "deborah custance baker", "sentiment": "none"}, {"name": "devon  she", "sentiment": "none"}, {"name": "dame hannah", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "david cartwright", "sentiment": "none"}, {"name": "claudia kelly", "sentiment": "none"}, {"name": "steward", "sentiment": "none"}, {"name": "seale hayne", "sentiment": "none"}, {"name": "david fitzgerald", "sentiment": "none"}], "locations": [{"name": "exeter cathedral the royal bri", "sentiment": "none"}, {"name": "north devon", "sentiment": "none"}, {"name": "gran canaria", "sentiment": "none"}, {"name": "dorset", "sentiment": "none"}, {"name": "cornwall", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "devon county", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "devon county show", "sentiment": "none"}, {"name": "south devon highway", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}, {"name": "somerset", "sentiment": "none"}, {"name": "east deovn", "sentiment": "none"}], "organizations": [{"name": "exeter cathedral exeter poppy appeal", "sentiment": "none"}, {"name": "exeter poppy appeal", "sentiment": "none"}, {"name": "exeter cathedral", "sentiment": "none"}, {"name": "royal british legion", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "royal british legion’s poppy shop", "sentiment": "none"}, {"name": "lilleshall", "sentiment": "none"}, {"name": "totnes show", "sentiment": "none"}, {"name": "poppy appeal", "sentiment": "none"}, {"name": "bbc devon", "sentiment": "none"}, {"name": "mid devon show", "sentiment": "none"}, {"name": "rbl", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Exeter Poppy Appeal shop opens as 30,000 red poppies to go on show in Exeter Cathedral The Royal British Legion have launched their annual Poppy Appeal Share Click to play Tap to play The video will start in 8 Cancel Play now Comments \nThe Royal British Legion’s Poppy Shop in the Guildhall shopping centre opens on Saturday as more than 30,000 handcrafted red poppies made to mark the centenary of the First World War at the Devon County Show will go on display at Exeter Cathedral. \nFrom Saturday, October 28, until Saturday, November 11, the Royal British Legion have a pop-up shop from which they are selling poppies and collecting donations for the Poppy Appeal. \nClaudia Kelly, community fundraiser for the Royal British Legion for the area of Exeter, and East Deovn and North Devon, said: “We have lots of items on sale and this is the Royal British Legion’s biggest event and appeal of the year. (left) Claudia Kelly, community fundraiser, and (right), David Cartwright \n“It is still as important as it has ever been as there are still loads of beneficiaries that need our help – it is not just the veterans from the First and Second World Wars that many people think. There are very young veterans as well today and it is not just them that we help as we also help serving personnel and their families. Read More Here's when you can and CAN'T legally light fireworks at home - and it could land you a £5k fine \n“We help so many people whether it is helping someone change a light bulb if they need to with our handyman service or if someone has many problems we can help them, or there are many ex-servicemen going into a homeless state and we can help them back on their feet again. \n“If you do have a couple of hours to spare – be it helping out in the shop or getting boxes out or street collections, get in contact with me on 07458 010862 and then we can get you on the rota to help as even a couple of hours will be a fantastic help.” The Exeter Poppy Appeal shop in the Guildhall \nDavid Cartwright, poppy appeal organiser for Exeter centre has been a serving solider for 18 years, and added: “I was injured in service about four years ago when I injured my spine and I have been volunteering now with the RBL for the last few months and helping out with the poppy appeal. They have helped me with my rehabilitation and I have been to the Battle Back centre up near Lilleshall and I think the RBL and poppy appeal is great to try and help serving soldiers and veterans all across the country. Read More 80-year-old disabled wheelchair dancer fears her dancing days could be over again if class doesn't get funding \n“Without the appeal, my recovery would not have been as good as it has been. The Battle Back centre and the courses they have put me on are second to none and it has certainly helped my mental health and physical health.” The Exeter Poppy Appeal shop in the Guildhall \nThe official opening of the Poppy Appeal shop takes place on Saturday, and then from Monday, there is an exhibition of 30,000 handcrafted red poppies at Exeter Cathedral, that runs until Tuesday, November 14. \nThousands of local people supported the ‘people’s tribute’ to the 11,500 Devon men and women who died in the Great War by creating 34,000 poppies. \nThe commemoration was the idea of Deborah Custance Baker, Chief Steward of the Crafts and Gardens Show feature. Read More Sir Vince Cable on Brexit, the Lib Dems' future and visits to Devon \nShe said: “I’d like to say a huge thank you to everyone, young and old, who contributed to the display from all corners of the county. One woman even sent me a photograph from Gran Canaria where she was knitting!. \n“I hope that people realise that their small, individual contributions have, when gathered together, created an impressive display. The poppies have been taken to Devon County Show, Mid Devon Show, Totnes Show and will be going to Dame Hannah, Seale Hayne, in 2018.” \nThe display, poignantly titled ‘Devon Remembers’, will contain the same number of poppies as the lives lost from not just Devon, but also all of the South West. Deborah Custance Baker, Chief Steward of the Crafts and Gardens Show feature, setting up 'Devon Remembers' at the Devon County Show. \nDeborah Custance Baker added: “Each poppy displayed represents a person lost, each poppy is individual, as were the people lost. The numbers mean little until you see the scale of the display. \n“I am immensely grateful to everyone who helped with the project – some people thought that getting 11,500 poppies to represent the Devon men and women lost in the First World War was a ridiculous idea. But thanks to David Fitzgerald and BBC Devon’s support, we ended up with 34,000 poppies representing those lost from Devon, Cornwall, Dorset and Somerset. Read More Drivers are still breaking South Devon Highway speed limits with five serious collisions on the new road \n“The stories that were sent in with some of the poppies were the most moving tribute to people’s parents, grandparents, aunts and uncles and the enormity of the War was really brought home. Some families had entire generations taken from them – and so many of those people lost were so young.” \nThe poppies will be sold in aid of the Royal British Legion for a suggested minimum donation of £1 per poppy. Like us on Facebook", "external_links": [], "published": "2017-10-27T17:06:00.000+03:00", "crawled": "2017-10-27T18:31:08.004+03:00", "highlightTitle": ""}