{"organizations": [], "uuid": "44e932e32713d81f2a3b062c5e48755a567d98fc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article13712085.ece/ALTERNATES/s1200/Frank-Suttie-July16.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/skills-key-growing-companies-fastest-13711911", "country": "GB", "domain_rank": 21960, "title": "Skills are the key for growing companies, Fastest 50 organisers say", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-03T19:05:00.000+03:00", "replies_count": 0, "uuid": "44e932e32713d81f2a3b062c5e48755a567d98fc"}, "author": "chroniclelive.co.uk", "url": "http://www.chroniclelive.co.uk/business/business-news/skills-key-growing-companies-fastest-13711911", "ord_in_thread": 0, "title": "Skills are the key for growing companies, Fastest 50 organisers say", "locations": [], "entities": {"persons": [{"name": "ward hadaway", "sentiment": "neutral"}, {"name": "stephenson", "sentiment": "none"}, {"name": "suttie", "sentiment": "none"}, {"name": "frank suttie", "sentiment": "none"}, {"name": "levy", "sentiment": "none"}], "locations": [{"name": "science central", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}], "organizations": [{"name": "ward hadaway fastest", "sentiment": "none"}, {"name": "short richardson & forth", "sentiment": "none"}, {"name": "google", "sentiment": "none"}, {"name": "invalid email  skills", "sentiment": "none"}, {"name": "ward hadaway", "sentiment": "none"}, {"name": "department for education", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "newcastle university", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "north east futures university technical college", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Skills are the key for growing companies, Fastest 50 organisers say Ward Hadaway partner Frank Suttie says that tackling the skills crisis is crucial for North East businesses that want to grow Share Frank Suttie of Ward Hadaway Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nSkills will help to define which North East companies grow quickest in the years to come, according to organisers of the Ward Hadaway Fastest 50 Awards. \nExperts at Top 100 UK law firm Ward Hadaway, which compiles and stages the definitive run-down of the fastest growing companies in the region, the Ward Hadaway Fastest 50, say that a skilled workforce will be crucial to the success of the North East economy and its fast-growing businesses. \nThe comments come as final preparations are made for the 20th annual Ward Hadaway Fastest 50 Awards , which take place at BALTIC, the Centre for Contemporary Art, in Gateshead this Friday. \nFrank Suttie, partner in the commercial team at Ward Hadaway, has years of experience in the education sector, including acting as a consultant to the Department for Education, and advising companies on apprenticeships and skills issues. \nMr Suttie said that putting the right building blocks in place to create a highly skilled workforce is vital to ensure that the North East remains competitive on a global basis, as well as a national one. \nHe explained: “Fast-growing companies such as those found in the Ward Hadaway Fastest 50 know how important their staff are to the expansion of their businesses – without a good workforce, it is very hard to deliver the goods and services which customers and clients want. \n“Brexit means that it is even more important than before to ensure that staff have the right skills and training to help them contribute to the growth of business and the economy. Read More Fastest 50 celebration of North East's quickest growing firms celebrates 20th anniversary \n“The likelihood of some form of greater restrictions on workers from outside the UK coupled with the need for British businesses to look further afield for their exports gives further onus to the need to create a cohort of skilled, adaptable workers who can compete with the best in the world. \n“I think we are making encouraging strides towards this goal, but there is still some way to go and the solutions need to cover everyone from school pupils to older workers – and I believe it starts with aspirations.” \nA survey last year from vocational education organization City and Guilds found that only 45% of teenagers in the North East think they’ll be in a career of their choice by 2026 and that they believe they will earn up to £6,510 less per year than their counterparts in London predict. \nMr Suttie said: “Such statistics make for rather disappointing reading, but I believe the problem is more one of perception than reality. \n“For example, if you look at the diverse range of businesses in this year’s Ward Hadaway Fastest 50, you can see how the region offers a wide array of different careers in expanding, successful companies operating in a broad spectrum of industries and sectors. \n“As well as these more established companies, the region is also home to one of the UK’s most dynamic and exciting start-up scenes with Newcastle and Gateshead recently named as the city cluster with the 2nd highest number of ‘high growth businesses’ in the UK – ahead of London. \n“We have centres of training excellence covering industries including energy, electric vehicles and train manufacturing and we have some of the finest universities in the country producing thousands of successful graduates every year.” Read More Newcastle law firm Short Richardson & Forth expanding into new areas \nNew developments are also set to play a major part in the North East’s drive to boost skills levels and aspirations. \nThe £12.5m North East Futures University Technical College (UTC) is due to open in Newcastle’s Stephenson Quarter next year to offer 14 to 19-year-olds access to specialist education covering areas including health and life sciences and cutting-edge digital technologies. \nAnd the next Google or Facebook could come from the North East after funding was confirmed for the £30m National Innovation Centre for Data, which will be built at the Science Central site in Newcastle, already home to developments including the £58m Urban Sciences Building from Newcastle University. \nMr Suttie said: “Although these are the headline-grabbers, there is also a lot of excellent work going on in North East companies to upskill their workers and equip them to tackle new challenges. \n“Larger companies have been paying the Apprenticeship Levy since May this year and forward-thinking small to medium sized companies are already looking at ways that they can use the Government’s apprenticeship programme to fill skills gaps and create their workforce of the future. \n“Whilst there are bound to be bumps in the road along the way, future prospects for the North East’s workforce – and hence the welfare of its businesses – would appear bright.” \nWard Hadaway will be honouring the current growth drivers of the region’s economy on Friday at the Ward Hadaway Fastest 50 Awards 2017. \nThe Fastest 50 identifies and highlights the privately-owned, profit-making companies who have seen the biggest average annual expansion in their turnover in recent years. \nOn Friday, awards will be handed out to the fastest growing small, medium-sized and large businesses, for companies with annual turnover of between £1m and £7.5m, between £7.5m and £15m and turnover of more than £15m respectively. \nOne of those three winners will then be crowned the North East’s overall fastest growing business for 2017. Like us on Facebook", "external_links": [], "published": "2017-10-03T19:05:00.000+03:00", "crawled": "2017-10-03T19:46:32.013+03:00", "highlightTitle": ""}