{"organizations": [], "uuid": "3865e6e874f1b10d9251c0dc7730899bcaeddefc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13764201.ece/ALTERNATES/s1200/Brexit.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/brexit-under-threat-serious-movement-13764119", "country": "GB", "domain_rank": 21960, "title": "Brexit under threat - has a serious movement to overturn the result begun?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-15T15:00:00.000+03:00", "replies_count": 0, "uuid": "3865e6e874f1b10d9251c0dc7730899bcaeddefc"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/brexit-under-threat-serious-movement-13764119", "ord_in_thread": 0, "title": "Brexit under threat - has a serious movement to overturn the result begun?", "locations": [], "entities": {"persons": [{"name": "nick clegg", "sentiment": "none"}, {"name": "jessica simor", "sentiment": "none"}, {"name": "david davis", "sentiment": "none"}, {"name": "martin farr", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "simor", "sentiment": "none"}, {"name": "farr", "sentiment": "none"}, {"name": "michel barnier", "sentiment": "none"}, {"name": "yougov", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "liberal", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "newcastle university", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "lib dem", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "houses of parliament", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nA three pronged attack on the government’s Brexit strategy last week could be the start of a movement to overturn the referendum result. \nA North East political expert wondered if this could behind moves which first saw a Freedom of Information request to Theresa May by London lawyer Jessica Simor QC. \nIt asked the Prime Minister to publish secret legal advice that is believed to state that parliament could still stop Brexit before the end of March 2019 if MPs judge that a change of mind is in the national interest. \nFollowing this more than 120 MPs signed a letter demanding that Brexit secretary David Davis publish secret advice his department is gathering on the damaging effects leaving the EU will have on jobs and living standards. \nAnd finally former Liberal Democrat leader Nick Clegg has written a book in which he said MPs were “duty bound” to reject a poor deal and believed the UK could instead stay within some limited form of EU membership. Anti-Brexit protesters waving EU flags outside the Houses of Parliament in London (Image: PA) \nDr Martin Farr, of Newcastle University, said: “It could be an attempted movement - a kite flying exercise to see if there is sufficient breeze. \n“But I can’t see it having long term consequences. It would mean a big change of public opinion and there is no evidence of this. The prevailing mood seems to be for the government to get on with it.” \nHowever, a YouGov survey last week found that only 42% of respondents think it is right to leave the EU, compared with 47% who think it is wrong. This is the biggest gap in favour of remaining in the EU since the referendum. \nThe poll came amid concerns exit talks with Brussels are heading for disaster. Read More \nAs things stand the UK will withdraw from the EU on March 29, 2019 - unless an extension is agreed by the remain 27 EU states. \nMs Simor from Matrix chamber said the UK could change its mind at any time before then. \nAnd she said that while the government has said its policy was not to attempt to reverse the referendum, it has not denied it is legally possible to do so. \nShe said: “Its position accords with advice, which I am told from two good sources the prime minister has received, namely that the article 50 notification can be withdrawn by the UK at any time before 29 March 2019, resulting in the UK remaining in the EU on its current favourable terms.” European Union chief Brexit negotiator Michel Barnier, right, and British Secretary of State for Exiting the European Union David Davis (Image: AP) \nMs Simor explained that Article 50 provides for the notification – not of withdrawal but of an “intention” to withdraw. In law, an “intention” is not a binding commitment; it can be changed or withdrawn. \nAsked what motivated to submit the FOI request, Mr Simor added: “I would like Parliament to act responsibility in the best interests of the whole country.” \nThe letter demanding the advice given on the damaging effect of Brexit was signed by Labour, Lib Dem and SNP MPs. \nIt said: “Leaving the European Union will have a huge impact on our economy for generations to come. \n“We believe it is important that there is a full and frank debate about the impact of Brexit on our economy, jobs, trade and living standards and what can be done to mitigate risks. That is only possible if analysis of the impact of Brexit is published.” Read More Brexit blues - Newcastle's confidence in leaving Europe plummets \nCould this mean another referendum? \nDr Farr, Senior Lecturer in Modern and Contemporary British History, thinks not. He said: “I think the EU referendum has torpedoed the idea that referendums are a good thing.” Like us on Facebook ", "external_links": [], "published": "2017-10-15T15:00:00.000+03:00", "crawled": "2017-10-15T15:08:45.050+03:00", "highlightTitle": ""}