{"organizations": [], "uuid": "ab3023beab2e00023b1b2b530ce35f99a403089f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13123064.ece/ALTERNATES/s1200/Bond-Dickinson-managing-partner-Jonathan-Blair-with-Womble-Carlyle-CEO-Betty-Temple.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/bond-dickinson-reports-flat-turnover-13837278", "country": "GB", "domain_rank": 21960, "title": "Bond Dickinson reports flat turnover in final results before US merger", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-31T16:32:00.000+02:00", "replies_count": 0, "uuid": "ab3023beab2e00023b1b2b530ce35f99a403089f"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/bond-dickinson-reports-flat-turnover-13837278", "ord_in_thread": 0, "title": "Bond Dickinson reports flat turnover in final results before US merger", "locations": [], "entities": {"persons": [{"name": "bond dickinson", "sentiment": "negative"}, {"name": "womble carlyle", "sentiment": "none"}, {"name": "dickinson", "sentiment": "none"}, {"name": "womble bond dickinson", "sentiment": "none"}, {"name": "blair", "sentiment": "none"}, {"name": "jonathan blair", "sentiment": "none"}, {"name": "betty temple", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "fenwick", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "edinburgh", "sentiment": "none"}], "organizations": [{"name": "womble carlyle", "sentiment": "none"}, {"name": "lloyds banking group", "sentiment": "none"}, {"name": "bond dickinson", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "crown estate", "sentiment": "none"}, {"name": "journal", "sentiment": "none"}, {"name": "invalid email  newcastle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "aig", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Bond Dickinson reports flat turnover in final results before US merger The firm, which will tomorrow be renamed Womble Bond Dickinson, brought in £103.2m last year Share Bond Dickinson managing partner Jonathan Blair with Womble Carlyle CEO Betty Temple (Image: Unknown) Share Get business updates   Thank you for subscribing! Could   \nNewcastle’s largest law firm Bond Dickinson has posted flat turnover for its last full year before its merger with US firm Womble Carlyle. \nTurnover at Bond Dickinson stood at £103.2m for the year ending April 30, slightly down on the £103.5m it posted during the previous year. \nThe results mean that the firm’s revenue has fallen for two consecutive years, after it reported its highest ever turnover of £105.8m in 2015. \nAccording to managing partner Jonathan Blair, the firm’s slight dip in turnover was in part a result of there being fewer deals in the market following the Brexit vote . \nMr Blair said: “The firm’s performance in the last financial year was stable despite a dip in M&A activity for several months due to Brexit. \n“It was a good year for a number of different business groups, particularly private wealth which saw a very strong performance. Real estate also performed well. Our corporate and commercial team experienced a dip but activity for that team came back strongly. Read More Newcastle's Bond Dickinson pulls off prize US merger with Womble Carlyle \n“The focus for the firm for the FY 2016/17 was investing in the business. This included planning for the combination with our US alliance partner Womble Carlyle, a new Edinburgh office that opened earlier this year, our recalibrated client programme and our new CRM system OnePlace.” \nMr Blair added that the firm had a “strong pipeline for growth” over the next few years, after winning a number of major panel appointments. \nHe added: “We also had a fantastic 12 months for client wins including a place on the Crown Commercial Services national panel, AIG, Crown Estate and Lloyds Banking Group.” \nNet profit at the firm fell by 8.4% during the year, from £29m to £26.6m last year. \nThe firm operates a modified lockstep structure, meaning that partners receive a higher the profit share depending on their seniority, but payments can also be made based on their individual performance throughout the year. \nLast year the partner with the largest profit share was paid £338,000. Read More Fenwick's to get spa, men's grooming salon and revamped restaurants in £30m plans \nAt midnight tonight Bond Dickinson’s merger with US law firm Womble Carlyle will go live. Following the merger the new firm will be known as Womble Bond Dickinson and will have an estimated turnover of £340m. \nIt will create one of the UK’s largest law firms and one of the top 100 in the world. \nSpeaking to The Journal in June Mr Blair said that the merger would have no impact on jobs in the North East , as the merger would be structured as a “company limited by guarantee”. This means that the business will be split into a UK and US operation, which will have their own partnerships and management teams. \nManufacturing , the North East’s biggest sector, will be a major focus for the new firm, as both Bond Dickinson and Womble Carlyle already have large manufacturing departments. \nThe firm is also look to grow its focus on the UK life sciences and pharmaceutical sector following the deal. Like us on Facebook", "external_links": [], "published": "2017-10-31T16:32:00.000+02:00", "crawled": "2017-10-31T16:57:41.002+02:00", "highlightTitle": ""}