{"organizations": [], "uuid": "6213879d9d27d01f1ccb6f8afa32f504339786e9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://i4.devonlive.com/news/business/article615741.ece/ALTERNATES/s1200/backswweb.jpg", "site_section": "http://www.devonlive.com/rss.xml", "section_title": "devonlive - frontpage", "url": "http://www.devonlive.com/news/business/major-growth-summit-exeter-set-615196", "country": "US", "title": "A major Growth Summit in Exeter is set to put the South West in the spotlight", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-12T14:00:00.000+03:00", "replies_count": 0, "uuid": "6213879d9d27d01f1ccb6f8afa32f504339786e9"}, "author": "Hannah Finch", "url": "http://www.devonlive.com/news/business/major-growth-summit-exeter-set-615196", "ord_in_thread": 0, "title": "A major Growth Summit in Exeter is set to put the South West in the spotlight", "locations": [], "entities": {"persons": [{"name": "steve hindley", "sentiment": "none"}, {"name": "chris garcia", "sentiment": "none"}, {"name": "sajid javid", "sentiment": "none"}, {"name": "sarah heald", "sentiment": "none"}, {"name": "chris loughlin", "sentiment": "none"}, {"name": "karl tucker", "sentiment": "none"}, {"name": "susan davy", "sentiment": "none"}, {"name": "pennon", "sentiment": "none"}, {"name": "toby parkins", "sentiment": "none"}, {"name": "bill martin", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "mark duddridge", "sentiment": "none"}, {"name": "tom marks", "sentiment": "none"}, {"name": "marc hill", "sentiment": "none"}, {"name": "leps", "sentiment": "none"}], "locations": [{"name": "exeter", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}, {"name": "yeo valley", "sentiment": "none"}, {"name": "headforwards", "sentiment": "none"}, {"name": "cornwall", "sentiment": "none"}, {"name": "sandy park", "sentiment": "none"}, {"name": "royal william yard", "sentiment": "none"}, {"name": "great south west", "sentiment": "none"}, {"name": "midlands engine", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "west lep", "sentiment": "none"}], "organizations": [{"name": "falmouth university", "sentiment": "none"}, {"name": "university of exeter", "sentiment": "none"}, {"name": "cbi", "sentiment": "none"}, {"name": "pennon group", "sentiment": "none"}, {"name": "software cornwall", "sentiment": "none"}, {"name": "vodafone", "sentiment": "none"}, {"name": "south west leaders’ forum", "sentiment": "none"}, {"name": "cornwall chamber of commerce", "sentiment": "none"}, {"name": "heart of the south west local enterprise partnership", "sentiment": "none"}, {"name": "northern powerhouse", "sentiment": "none"}, {"name": "kpmg", "sentiment": "none"}, {"name": "nick ames of sc group", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "nuclear south west", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News A major Growth Summit in Exeter is set to put the South West in the spotlight Hundreds of business leaders, politicians and academics are expected to attend the Growth Summit on Friday October 20 at Sandy Park, Exeter. Share The Back The South West campaign supports initiatives that grow the economy. Share Comments \nA major conference designed to keep the South West at the top of the political agenda is being hosted next week in Exeter. \nThe South West Growth Summit – which follows last year’s groundbreaking event – will once again push the case for regional investment while sealing an agenda for economic prosperity. \nSteve Hindley CBE DL, chairman of the South West Leaders’ Forum and the Heart of the South West Local Enterprise Partnership, will speak at the event. Read More Tech innovators say 'there's more to the South West than cream teas and cowpats' and here's why \nHe said: “I can say with conviction that there is a real appetite for transformational growth, and this year’s growth summit will build on the momentum that is driving businesses, LEPs and local authorities to work together and raise the profile of the South West on a global stage. Read More Devon's best law firms profiled in Legal 500 guide \n“We’ve joined forces with our neighbouring LEPs on several successful initiatives, that are already delivering benefits to the business and resident community – such as securing government commitment to improve connectivity through road, rail and broadband and the Nuclear South West partnership through which businesses are working to benefit from the £50billion worth of opportunities in the sector. Steve Hindley, Chairman of the Heart of the south West LEP, pictured at Royal William Yard, Plymouth. (Image: Marc Hill) \n“As the Great South West partnership progresses, I look forward to working on many more cross-LEP projects that will improve productivity and prosperity; and I look forward to addressing the Growth Summit and meeting like-minded ambassadors for the region who are committed to its success.” Read More REVEALED: The shortlist for the Western Morning News Business Awards 2017 \nThe growth summit is part of the Great South West initiative, backed by the region’s LEPs and sponsored by the Pennon Group – a key partner in the Western Morning News’ #BackTheSouthWest campaign . Sarah Heald, Chris Loughlin, Bill Martin, Susan Davy, Mark Duddridge, Sajid Javid and Chris Garcia at the inaugural Growth Summit 2016. \nChris Loughlin, Pennon chief executive, said: “We must work together to ensure our case continues to be made loud and clear at the highest level. \n“This summit will provide another opportunity to focus our collective energy, skills and passion. \n“Undoubtedly, there is a long way to go, but we must not lose sight of the progress made nor the opportunities that lie ahead.” Read More How we are tackling the South West productivity puzzle \nPoliticians, business leaders and academics from across the region are set to speak at the summit. \nIt aims to highlight the region’s unique natural assets, identify emerging sectors and how the region can capitalise on its strengths and traditional industries. \nCrucially, it identifies a need to speak with one voice to rival the fortunes of the Northern Powerhouse or Midlands Engine. \nLast year’s growth summit held at the University of Exeter attracted a huge gathering of regional leaders and resulted in the publication of the South West Growth Charter and the formation of the Great South West initiative. Read More What are the top 150 businesses in Devon and Cornwall? \nBill Martin, Western Morning News editor-in-chief said: “The fact that we are holding a second growth summit is further evidence that this initiative has region-wide support and, most crucially, momentum. \n“With the uncertainty created by Brexit and the vulnerability of the current Government it is more vital than ever that this summit continues that momentum and the next concrete steps in making the South West great are agreed.” \nMore than 300 delegates with an interest in growing the region’s economy will attend. Toby Parkins has over 25 years experience working in the tech sector, is managing director of UKNetWeb, founding director of Headforwards, founder of the Agile on the Beach conference and Software Cornwall and president of the Cornwall Chamber of Commerce. \nSome of the region’s biggest employers will be among the panellists, including Karl Tucker from Yeo Valley, Tom Marks from Vodafone, Toby Parkins of Headforwards and Nick Ames of SC Group. Read More \nThe event will involve panel discussions looking at digital - leveraging new technologies and environment and place - how distinctiveness of place can drive economic growth. \nKPMG, CBI, Falmouth University, Nuclear South West, Spaceport and SW Marine Cluster are among the exhibitors. \nThe South West Growth Summit is being held at Sandy Park, Exeter on Friday October 20, 9am-1pm. \nClick here to register attendance. Like us on Facebook ", "external_links": [], "published": "2017-10-12T14:00:00.000+03:00", "crawled": "2017-10-12T14:28:12.000+03:00", "highlightTitle": ""}