{"organizations": [], "uuid": "ce049236283690e362ad58f41dd1da6d22adacff", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13821746.ece/ALTERNATES/s1200/FCR_NJL_261215Lead_01.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/farming/agricultural-firm-hh-sees-profits-13821740", "country": "GB", "domain_rank": 21960, "title": "Agricultural firm H&H sees profits fall in 'sluggish' market", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-27T17:38:00.000+03:00", "replies_count": 0, "uuid": "ce049236283690e362ad58f41dd1da6d22adacff"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/farming/agricultural-firm-hh-sees-profits-13821740", "ord_in_thread": 0, "title": "Agricultural firm H&H sees profits fall in 'sluggish' market", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Agricultural firm H&H sees profits fall in 'sluggish' market Firm says uncertainty on farm support after Brexit is delaying investment decisions Share Brian Richardson, Chief Executive of the H&H Group Plc (Image: handout) Share Get business   Thank you for subscribing! Could not subscribe, try again later Invalid Email \nAgricultural business H&H Group has reported a small fall in profits in what it has described as a “sluggish economic environment” for the farming sector. \nThe Carlisle group - which operates the auction mart in Wooler, Northumberland - operates in four areas: livestock auctions, estate and land agency, insurance and print. \nResults for the year to June 30 show profit before tax of £682,000, down from £712,000 the previous year, while net assets for the business stood at £17.75m at the year end. A final dividend of 27p has been recommended, making a total of 35p for the full year. \nThe results cover the period in which H&H took over the John Swan company, which operated the marts at Wooler and at Newtown St Boswells, in the Scottish Borders. The company also expanded its estate agency business, taking over Michael CL Hodgson in south Cumbria. Read More Many North East farms would become loss making under hard Brexit, report says \nChief executive Brian Richardson said: “In the four areas we operate; livestock auctioneering and marketing; land agency and property sales/letting; insurance; and print, we have had to work hard against a sluggish economic environment and uncertainty surrounding Brexit. \n“This is a solid set of results in what are some challenging markets and it is testament to the H&H staff that we continue to see development across our customer base. \n“Through our nine mart sites and on-farm trading, Harrison & Hetherington has, for the first time, traded over £170m worth of livestock. Helped by a weak pound, supporting exports and making imports more expensive, livestock prices have been stable in the year. \n“Harrison & Hetherington continue to develop its sites and geographical coverage, and the business is also looking to develop strategic alliances in the meat and meat-processing sectors.” Read More Berwick firm Simpsons Malt sees dip in profits but invests for the future \nMr Richardson said that uncertainty over the future of farm support after Brexit was causing farmers to delay decisions on future strategy and investment. \nH&H had put a new emphasis on its farm insurance business, Mr Richardson added, while its print division had improved its profitability. \nHe added: “As we look to the future, the broader economy in which we operate is uncertain, but given that we are unable to directly influence this, our aim is to continue to focus on developing our businesses, backed by good products and excellent customer service.” Like us on Facebook", "external_links": [], "published": "2017-10-27T17:38:00.000+03:00", "crawled": "2017-10-27T18:05:34.007+03:00", "highlightTitle": ""}