{"organizations": [], "uuid": "3573907369fcfaa41bd0c2473d41d4536cbab7ab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://i2.leicestermercury.co.uk/incoming/article605533.ece/ALTERNATES/s1200/IMG_8448_EDIT.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/news/business/company-car-man-i-wouldnt-605511", "country": "US", "domain_rank": 48128, "title": "Company Car Man: \"I wouldn’t mind a Picasso for my wall\" - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.947, "site_type": "news", "published": "2017-10-10T15:43:00.000+03:00", "replies_count": 0, "uuid": "3573907369fcfaa41bd0c2473d41d4536cbab7ab"}, "author": "Tom Pegden", "url": "http://www.leicestermercury.co.uk/news/business/company-car-man-i-wouldnt-605511", "ord_in_thread": 0, "title": "Company Car Man: \"I wouldn’t mind a Picasso for my wall\" - Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "neil emery", "sentiment": "negative"}, {"name": "boris", "sentiment": "none"}, {"name": "davis", "sentiment": "none"}], "locations": [{"name": "leic", "sentiment": "none"}, {"name": "heathrow", "sentiment": "none"}, {"name": "new walk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "giza", "sentiment": "none"}, {"name": "new walk museum", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}], "organizations": [{"name": "creative triangle", "sentiment": "negative"}, {"name": "leicester mercury comments  this week's company car man", "sentiment": "neutral"}, {"name": "google", "sentiment": "none"}, {"name": "picasso ceramics", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}, {"name": "university of warwick", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Comments \nThis week's Company Car Man is Neil Emery, design consultant at Creative Triangle, in Leicester. Clients range from Heathrow, to the University of Warwick. \nHow do you think the Tory cabinet – May, Boris, Davis et al – came out of the party conference? \nOn a personal level, I felt sorry for the PM. We all have had poor presentations in our careers but not usually in front of the international media and a not necessarily happy audience. Everything went wrong for her. With Brexit imminent, we need a united Down but not out \nGovernment with a clear plan and currently that really doesn’t appear to be the case. \nAugmented reality is increasing in popularity with both Apple and Google releasing their own AR developer kits. Where do you think AR will take us in the coming years? \nAR has been around for more than 20 years within the medical and military industries so it isn’t really a new technology. It has started to be used successfully in the commercial world in recent years so is more in the public eye. I think it could make a massive impact in the education sector if used correctly. \nAlong with concerns over Brexit, the Government has been accused of burdening businesses with too many regulations, taxes and levies. Do you agree? \nThe Government’s job is to tax everyone fairly and ensure it is spent wisely on those areas where it is needed. Thinking of businesses as the only cash cow is wrong. As a small business with 13 employees we fare quite well in tough times as we can offer a high quality service at a more competitive rate. \nA 3,900-year-old gold shell pendant worth £15,000, a £12,000 bronze necklace and two bronze bracelets from Giza worth £7,000 are among items stolen from Leicester’s New Walk Museum. What items would you like in your living room? \nI’m sure my children would love to jump off the dinosaur but I think I could find some room for a bit of Picasso art. Toro bravo, round-bellied water jug, 1955. Picasso Ceramics: The Attenborough Collection, New Walk Museum, Leicester \nJapanese scientists are developing lighter cars from wood and plastic. What’s the most uncomfortable journey you have been on? \nI had the misfortune of having to use the rail system a couple of months ago. A ticket to the north-east cost well over £100 where I had to stand for four hours and deal with two train cancellations due to lack of drivers. No wonder our motorways are chock-a-block. \nYou work in New Walk. Would you walk along there after dark? There have been problems in the New Walk area \nWe love our office and New Walk. We are lucky to have parking and we do not have to work ridiculous hours so do not venture too far in the dark. I’d feel safe to walk after dark, but I think more of a police presence and suitable lighting would make a difference throughout the whole city, not just New Walk. Like us on Facebook ", "external_links": [], "published": "2017-10-10T15:43:00.000+03:00", "crawled": "2017-10-10T21:09:25.003+03:00", "highlightTitle": ""}