{"organizations": [], "uuid": "5d564b57969235d658a0f9c43103737ba9ba7d3b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article690696.ece/ALTERNATES/s1200/ESP_VinceCableVisit_-4JPG.jpg", "site_section": "http://www.middevongazette.co.uk/politics.rss", "section_title": "devonlive - News", "url": "http://www.devonlive.com/news/devon-news/sir-vince-cable-brexit-lib-690362", "country": "GB", "title": "Sir Vince Cable on Brexit, the Lib Dems' future and visits to Devon", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-27T16:13:00.000+03:00", "replies_count": 0, "uuid": "5d564b57969235d658a0f9c43103737ba9ba7d3b"}, "author": "Rom Preston-Ellis", "url": "http://www.devonlive.com/news/devon-news/sir-vince-cable-brexit-lib-690362", "ord_in_thread": 0, "title": "Sir Vince Cable on Brexit, the Lib Dems' future and visits to Devon", "locations": [], "entities": {"persons": [{"name": "vince cable on brexit", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "vince", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "mike badley", "sentiment": "none"}, {"name": "guy newman", "sentiment": "none"}, {"name": "sally basker", "sentiment": "none"}, {"name": "vince cable", "sentiment": "none"}, {"name": "winston churchill", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "basker", "sentiment": "none"}, {"name": "twickenham", "sentiment": "none"}, {"name": "joe pearce", "sentiment": "none"}], "locations": [{"name": "devon", "sentiment": "none"}, {"name": "exeter science park", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "north devon district hospital", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "science park", "sentiment": "none"}, {"name": "newton abbot", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "bristol", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}, {"name": "south devon", "sentiment": "none"}], "organizations": [{"name": "torquay", "sentiment": "none"}, {"name": "south devon university technical college", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "torbay business forum’s business breakfast", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Sir Vince Cable on Brexit, the Lib Dems' future and visits to Devon The Lib Dem leader toured Devon on Friday morning Share Click to play Tap to play The video will start in 8 Cancel Play now Comments \nLib Dem leader Sir Vince Cable says he 'won't criticise the public' for voting to leave the European Union but the impact of Brexit is already being noticed in Devon and across the UK. \nSpeaking to DevonLive.com during a tour of the county on Friday morning, Sir Vince described the Government as 'all over the place' but said that despite challenges Devon had a lot of things going for it. \nHe addressed guests at Torbay Business Forum’s Business Breakfast before visiting South Devon University Technical College in Newton Abbot and holding a seminar with innovative local businesses at Exeter Science Park. Read More Wards closed as outbreak of norovirus confirmed at North Devon District Hospital \n\"I don't want to criticise the public,\" he said. \"We didn't need to have the referendum but the Government brought it in and that's how we voted. \n\"We have no idea what form Brexit is going to take. The Government is all over the place, we don't know whether we're going to have a gentle, gradual Brexit or whether it's going to be chaotic - it could be either. \n\"What we are beginning to see are some of the immediate impacts. We had a big devaluation of the currency after the vote and that pushes up people's cost of living. Sir Vince Cable speaks at Exeter Science Park on Friday (Image: Guy Newman) \n\"It does have some upside to it, if you're in the tourist industry it's certainly given people encouragement to take holidays in Britain. \n\"Businesses are not investing because they're not certain of the future and that is dragging the economy down somewhat. \n\"And we're seeing evidence that eastern Europeans, who were quite an important part of the building trade, working in residential homes, tourism and universities, are going home because they feel they are not wanted.\" \nOn what was his fourth visit to Devon in the last three months, the Lib Dem leader said he had seen some positive signs for the region's economy. Read More Woman taken to hospital after Torquay crash \nPharmaceutical software company Rx-info, presented to Sir Vince at Exeter Science Park alongside reservation provider Rezcomm, engineering entrepreneur Mike Badley of Sigma Technical and Joe Pearce from the SETsquared Exeter incubator. \nSpeaking afterwards, the MP for Twickenham said: \"I'm a fairly regular visitor to Devon and I've seen some really positive things. \n\"You realise that Devon and the South West of England generally has its challenges, problems of access, communications, poor rail system and things of that kind. Sir Vince Cable took part in a seminar with local businesses (Image: Guy Newman) \n\"But there are some really good things going for it as well. There are some really great companies coming up, universities in Plymouth and Exeter and it's a lovely place to be and to live. I'm sure it can emerge as a big success story.\" \nSir Vince made a surprise return to frontline politics following the snap election earlier this year. He regained the seat he lost during the 2015 election and then was elected as Lib Dem leader in July becoming the oldest leader of a major UK political party since Sir Winston Churchill. Read More Jeremy Corbyn reveals his family's Devon connections at sold out show \nAsked about his return to politics, he said: \"It's exciting but it's a bit disorientating because I was 17 years an MP and then I started doing something else - in business, writing books, doing competitive dancing - all these things to occupy me. \n\"But now I've had to switch back into 150 per cent politics but it's a great challenge. \n\"The party had a bad election but I think we're going to bounce back.\" \nSir Vince also heard from Dr Sally Basker, CEO of Exeter Science Park, on its future vision and plans for growth, as well as discussing how the South West as region can strive for an improved business landscape and economical growth. Read More Lib Dem leader Vince Cable tells South Devon business community to prepare for 'difficult problems ahead' \nDr Basker said: “We were thrilled to welcome Sir Vince to the Science Park, not only to discuss our progress and visions for the future of the site, but also our mission to support and engage with the wider region. \n“We’re looking to put the South West on the map as a centre of excellence, with the Science Park hosting and connecting innovative companies, however there are a number of challenges that we need to address to deliver our vision for extraordinary growth. \n“A key challenge for us in the region is how the South West as a brand is often distorted by figures from cities such as Bath and Bristol, meaning that we may not attract the businesses and talent that we need. We were keen to discuss with Sir Vince how we can work as a whole to improve this for the future.” Like us on Facebook ", "external_links": [], "published": "2017-10-27T16:13:00.000+03:00", "crawled": "2017-10-27T17:16:20.006+03:00", "highlightTitle": ""}