{"organizations": [], "uuid": "68a81624d6abc852627812cdc779bb89e74e6fb5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://i2.devonlive.com/news/business/article660651.ece/ALTERNATES/s1200/SW_GROWTH_SUMMIT_0604.jpg", "site_section": "http://www.westernmorningnews.co.uk/politics.rss", "section_title": "devonlive - News", "url": "http://www.devonlive.com/news/business/hundreds-pledge-backthesouthwest-south-west-659920", "country": "GB", "title": "Hundreds pledge to #BackTheSouthWest at South West Growth Summit", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-20T19:46:00.000+03:00", "replies_count": 0, "uuid": "68a81624d6abc852627812cdc779bb89e74e6fb5"}, "author": "Hannah Finch", "url": "http://www.devonlive.com/news/business/hundreds-pledge-backthesouthwest-south-west-659920", "ord_in_thread": 0, "title": "Hundreds pledge to #BackTheSouthWest at South West Growth Summit", "locations": [], "entities": {"persons": [{"name": "esther pearson", "sentiment": "none"}, {"name": "david underwood", "sentiment": "none"}, {"name": "steve hindley", "sentiment": "none"}, {"name": "robert halfon", "sentiment": "none"}, {"name": "underwood", "sentiment": "none"}, {"name": "newton smith", "sentiment": "none"}, {"name": "sajid javid", "sentiment": "none"}, {"name": "sutton", "sentiment": "none"}, {"name": "streeter", "sentiment": "none"}, {"name": "chris loughlin", "sentiment": "none"}, {"name": "luke pollard", "sentiment": "none"}, {"name": "richard harrington", "sentiment": "none"}, {"name": "gary streeter", "sentiment": "none"}, {"name": "toby parkins", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "headforwards", "sentiment": "none"}, {"name": "pennon", "sentiment": "none"}, {"name": "cornwall", "sentiment": "none"}, {"name": "south west coast", "sentiment": "none"}, {"name": "south west devon", "sentiment": "none"}, {"name": "devonport", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "south west like", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}], "organizations": [{"name": "met office", "sentiment": "none"}, {"name": "energy and industrial strategy", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "high performance computing programme", "sentiment": "none"}, {"name": "education committee", "sentiment": "none"}, {"name": "cbi", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Hundreds pledge to #BackTheSouthWest at South West Growth Summit Share Click to play Tap to play The video will start in 8 Cancel Play now Comments \nThe South West is being urged to think big as the BackTheSouthWest campaign takes a major step forward for regional prosperity. \nMore than 320 delegates from the region’s biggest businesses, world class universities and leading politicians pledged to Back The South West at yesterday’s South West Growth Summit. \nAnd up against a government tight for cash and distracted by Brexit, the region must unite to take a bold business case to Government. Gary Streeter MP highlights the next steps in the campaign \nSpeaking at the event – which became the UK’s top five trending topic on Twitter – Gary Streeter, MP for South West Devon said: “ If we as a region want something from a government that cannot do much because of a small majority and distracted by Brexit, we have to speak with a clear voice and demand it. Government is not going to come to us. Hundreds attended the second South West Growth Summit \n“The more we work together, the more we can get from government.” \nThere were video messages from Sajid Javid, Secretary of Stare for Community and Local Government, Richard Harrington, Dept. of Business, Energy and Industrial Strategy and Robert Halfon, Chairman of Education Committee. Chris Loughlin, Chief Executive of Pennon addresses the audience \nMr Streeter said that the next step is to devise a three-point priority plan setting out tasks for the government to meet in order to unlock the region’s growth potential. Read More \nLuke Pollard, MP for Plymouth, Sutton and Devonport, said: “Let’s be bolder, more ambitious, more relentless and frankly more annoying to get what we need from government.” The panel insist that the region must get digital infrastructure \nCurrently, every hour worked in the South West is worth £28.64 in terms of gross value added, compared to London at £40.23 an hour. \nAnd key to boosting prosperity is creating the right environment to allow high earning sectors to thrive. This includes fibre to property broadband, which when introduced to areas in Cornwall increased speed of file transfer to London from 2mps to 20mps. CBI Chief Economist Rain Newton Smith explains how the region performs on productivity \nRain Newton Smith, CBI Chief Economist, identified 5G connectivity as a regional priority. \nShe said: “The South West is an area of natural beauty and it will be hard to built some of these bigger transport projects. But digital can play a major part. \n“We need to make sure we are ready for the next wave of technology so we are 5G ready.” Steve Hindley explains the progress so far this year \nSpeaking on a panel discussing how digital can leverage new technologies, Toby Parkins, director of Headforwards and David Underwood, Deputy Director of High Performance Computing Programme at the Met Office called for investment in skills. Mr Underwood said: “We are looking at the next industrial revolution based around data and information and it will be played out in the next 10 years. \n“We have so many of our children without maths skills. It is not fit for what we are facing as a society over the next 20 years.” The environment panel discuss distinctiveness of place at the South West Growth Summit \nKey to selling the South West is its coast and countryside – a major tourism pull, centre of food production and vital for attracting and retaining talent. \nSpeaking on a panel discussing how environment can drive economic growth, Esther Pearson, Director of the South West Coast path said that it supported 10,000 full time year round jobs. The region is also seeing the largest proportion of growth in overseas visitors, up by 25 per cent. \n“I would like the value of our environment to be considered in every decision we make.” \nHow you can get involved Tweeting your support using the #backthesouthwest hashtag Working collaboratively with others across the region Promoting the SW as a great place to live and work Continuing to put pressure on our MPs to promote the South West Like us on Facebook ", "external_links": [], "published": "2017-10-20T19:46:00.000+03:00", "crawled": "2017-10-20T20:08:05.000+03:00", "highlightTitle": ""}