{"organizations": [], "uuid": "57d067daf857493a748e9f0fed9815c959897dc2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://i3.leicestermercury.co.uk/incoming/article564964.ece/ALTERNATES/s1200/LECG20171002A-046_C.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/news/leicester-news/leicesters-deputy-mayor-rory-palmer-564805", "country": "US", "domain_rank": 48128, "title": "Leicester's deputy mayor Rory Palmer leaves city council and becomes an MEP - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.202, "site_type": "news", "published": "2017-10-02T07:00:00.000+03:00", "replies_count": 0, "uuid": "57d067daf857493a748e9f0fed9815c959897dc2"}, "author": "Dan Martin", "url": "http://www.leicestermercury.co.uk/news/leicester-news/leicesters-deputy-mayor-rory-palmer-564805", "ord_in_thread": 0, "title": "Leicester's deputy mayor Rory Palmer leaves city council and becomes an MEP - Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "rory palmer", "sentiment": "negative"}, {"name": "eyres monsell", "sentiment": "none"}, {"name": "palmer", "sentiment": "none"}, {"name": "rory", "sentiment": "none"}, {"name": "richard iii", "sentiment": "none"}, {"name": "peter soulsby", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "virginia cleaver", "sentiment": "none"}, {"name": "glenis willmott", "sentiment": "none"}], "locations": [{"name": "leicester", "sentiment": "none"}, {"name": "leicester mercury leicester", "sentiment": "none"}, {"name": "nottingham", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "fosse park", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "east midlands", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}, {"name": "virginia", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "leicestershire police", "sentiment": "none"}, {"name": "european parliament", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "premier league", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Leicester's deputy mayor Rory Palmer leaves city council and becomes an MEP \"It's felt a bit like transfer deadline day\" Share Click to play Tap to play The video will start in 8 Cancel Play now Comments \nLeicester’s deputy mayor Rory Palmer has today officially resigned from the post so he can become a Labour MEP for East Midlands. \nCouncillor Palmer is leaving the city council after a decade for the European Parliament - at least until Brexit in 18 months' time. \nHe will be officially confirmed as an MEP from tomorrow. Read More Road shut after lorry sheds huge load in Leicestershire village \nMr Palmer, 35, has been clearing his small office in recent days, packing boxes and throwing out stacks of old accumulated paper work. \nHe told the Mercury: “It’s felt a bit like transfer deadline day. Everyone’s known I’ll be going for a while but the paperwork hasn’t been signed. \n“Now it’s all done. It’s official.” \nOne of Mr Palmer’s first tasks will be to set up a new office - one in Nottingham vacated by retiring Labour MEP Glenis Willmott. \nUnder EU rules he automatically succeeds her in Brussels as he tops Labour's regional candidates list. Read More A deal has FINALLY been struck on £135m Fosse Park expansion \nHe said: “I’ve not long in this job. I haven’t got time to be assembling flat pack furniture and kitting out a new office. \n“I don’t think anyone would thank me for spending tax-payers’ money on a new one when there’s one available and ready to use. \n“To be honest, I don’t want to spend a lot of time sitting in an office. I want to be out and about as a campaigning MEP, in the same way I’ve been a campaigning deputy mayor.” \nMr Palmer, who has also stepped down as councillor for Eyres Monsell, has said he and his family will continue to live in Leicester. \nHe insisted there was still plenty of work to be done before his new role becomes redundant, when Britain leaves the EU. \nHe said: “Most importantly, MEPs will have to vote on the final Article 50 deal. \n“I’ll be honest, I’m p**sed off about the result of the referendum and I regret the outcome but I understand why people voted as they did. \n“People talk about a second referendum but I would worry about the consequences of that and the division it would cause on top of the huge turmoil we have already seen. \n“It also worries me that after all these months that the Government cannot clearly articulate what Brexit means for our economy, people here and in the EU. It has failed miserably to bring the country together.” \nLeicestershire Police has loads of jobs available - here's how to apply \nHe insisted he had not thought about his next move after Brexit. \nHe said: “I’m sitting in my Leicester city council office in my last few hours here. I’ve yet to start my new jobs so I’m certainly not thinking about the next one.” \nMr Palmer said: “During my time as Leicester’s first deputy mayor I've been fortunate to have a front row seat at some historic events. \n“We re-interred Richard III, we planned the celebration for Leicester winning the Premier League. There has been a wonderful randomness to the job. \n“The other side of it has been watching this Government undertake the most sustained and vicious attack on local government finances.” \nMr Palmer paid tribute to his fellow Eyres Monsell councillor Virginia Cleaver. \nHe said: “Eyres Monsell is a proud, strong community full of warm, friendly and decent people. I have been privileged to represent it and to work with Virginia, who has been a passionate and dedicated campaigner.” \nCity mayor Sir Peter Soulsby said: “Rory has played a vital part in shaping the city mayor role in Leicester. His passion for social justice, quality services and sound decision making has been invaluable to me, and he will be missed, not just by me, but by the council and the city. \n“I’m sure he will be a very effective MEP, speaking out for the city and region through the difficult days of Brexit.” Read More ", "external_links": [], "published": "2017-10-02T07:00:00.000+03:00", "crawled": "2017-10-03T00:25:01.000+03:00", "highlightTitle": ""}