{"organizations": [], "uuid": "d8e38e6117807c4866e6419d0a7f25acacc329f9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://i1.leicestermercury.co.uk/incoming/article640912.ece/ALTERNATES/s1200/DSC_5334.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/news/business/gateway-china-conference-part-2017-640890", "country": "US", "domain_rank": 48128, "title": "Gateway to China conference will be part of 2017 Leicester Business Festival - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.256, "site_type": "news", "published": "2017-10-17T16:56:00.000+03:00", "replies_count": 0, "uuid": "d8e38e6117807c4866e6419d0a7f25acacc329f9"}, "author": "Tom Pegden", "url": "http://www.leicestermercury.co.uk/news/business/gateway-china-conference-part-2017-640890", "ord_in_thread": 0, "title": "Gateway to China conference will be part of 2017 Leicester Business Festival - Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "helen donnellan", "sentiment": "none"}, {"name": "peter soulsby", "sentiment": "none"}, {"name": "peter", "sentiment": "none"}, {"name": "jin xu", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "share city", "sentiment": "none"}], "organizations": [{"name": "leicester city council", "sentiment": "none"}, {"name": "department for international trade", "sentiment": "none"}, {"name": "micro-fresh", "sentiment": "none"}, {"name": "chinese embassy", "sentiment": "none"}, {"name": "leicester tigers", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Gateway to China conference will be part of 2017 Leicester Business Festival Business opportunities in world's biggest market will be signposted at Leicester event Share City Mayor Peter Soulsby with Minister Counsellor Jin Xu Share Comments \nA Chinese diplomat will be guest speaker at a business event promoting trade opportunities in the world’s biggest market. \nMinister counsellor Jin Xu – from the commercial section of the Chinese Embassy in London – will address a Gateway to China 2017 conference being held at the Leicester Tigers ground next week. \nHe will be among leaders from the world of government, international trade and business addressing key issues such as post-Brexit opportunities to trade with China. \nThere will be advice on the kind of support available from the Department for International Trade and the practicalities of exporting to China. \nIn addition to keynote sessions, the conference will include a series of focused workshop sessions that explore specific subjects in greater depth. \nThe free event runs from 9am to 3.30pm on Thursday, October 26 and is part of the third annual Leicester Business Festival. \nDelegates will be welcomed by a traditional Chinese Lion Dance and provided with a chance to sample authentic Chinese food. \nHelen Donnellan, is inward investment director at Leicester City Council, charged with attracting new developers, investors and employers to the city. \nShe said “We are very excited to have such high-calibre speakers joining us at Gateway to China. Read More Leicester’s Micro-Fresh grows China operations \n“Conference attendees will have the opportunity to hear the insights of some of the leading voices for international trade, as well as perspectives from our three universities on engagements with China and international talent. It’s shaping up to be a great programme.” \nMinister counsellor Jin Xu recently met with the City Mayor Sir Peter Soulsby, and local representatives who work with China, to learn about the city and its economic offer. \nSir Peter said: “We are so pleased to have welcomed Mr Jin Xu and his delegation to Leicester and are extremely grateful that he has agreed to be our key speaker at the Leicester Business Festival event on October 26. \n“We look forward to a long working relationship with Mr Jin Xu and his colleagues”. \nThe Leicester Business Festival starts on Monday October 23 and runs for a fortnight. \nThere are around 150 events in the festival programme spanning key sectors such as communications, marketing, business support and professional and financial services. \nTo book tickets for the Gateway to China 2017 conference click here . Like us on Facebook ", "external_links": [], "published": "2017-10-17T16:56:00.000+03:00", "crawled": "2017-10-17T23:53:08.004+03:00", "highlightTitle": ""}