{"organizations": [], "uuid": "cfa20f19a303e0051b0d166c18a1b41ec71b4a51", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12815047.ece/ALTERNATES/s1200/Bank-of-England-stress-test.jpg", "site_section": "http://www.thejournal.co.uk/business/?service=rss", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13713657", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Brexit will make it harder to oversee banks, warns Bank of England", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-05T10:00:00.000+03:00", "replies_count": 0, "uuid": "cfa20f19a303e0051b0d166c18a1b41ec71b4a51"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13713657", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Brexit will make it harder to oversee banks, warns Bank of England", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "negative"}, {"name": "scarlett moffatt", "sentiment": "none"}, {"name": "paul briggs", "sentiment": "none"}, {"name": "jamie cook", "sentiment": "none"}, {"name": "ian durant", "sentiment": "none"}, {"name": "gillian marshall", "sentiment": "none"}, {"name": "charlie hoult", "sentiment": "none"}, {"name": "david cliff", "sentiment": "none"}, {"name": "mason bradbury", "sentiment": "none"}, {"name": "freddy hoult", "sentiment": "none"}, {"name": "paul watson", "sentiment": "none"}, {"name": "hoult", "sentiment": "none"}, {"name": "bailey", "sentiment": "none"}, {"name": "david harrison", "sentiment": "none"}, {"name": "emmerdale", "sentiment": "none"}, {"name": "penny mallory", "sentiment": "none"}, {"name": "entrepreneur of the year", "sentiment": "none"}, {"name": "henry boot developments", "sentiment": "none"}, {"name": "jonathon manning", "sentiment": "none"}, {"name": "phil cronin", "sentiment": "none"}, {"name": "harrison", "sentiment": "none"}, {"name": "steven rawlingson", "sentiment": "none"}, {"name": "caroline fox", "sentiment": "none"}, {"name": "geordie", "sentiment": "none"}, {"name": "bessie", "sentiment": "none"}, {"name": "ben rideway", "sentiment": "none"}, {"name": "jonathon manning battle", "sentiment": "none"}, {"name": "ian filby", "sentiment": "none"}], "locations": [{"name": "revolution  britain", "sentiment": "none"}, {"name": "teesside park", "sentiment": "none"}, {"name": "revolucion de cuba", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "mansion house", "sentiment": "none"}, {"name": "iceland", "sentiment": "none"}, {"name": "hoults yard", "sentiment": "none"}, {"name": "bushtucker trials", "sentiment": "none"}, {"name": "stonegate", "sentiment": "none"}, {"name": "gedanken", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "jungle", "sentiment": "none"}, {"name": "collingwood street", "sentiment": "none"}, {"name": "sheffield", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "south tyneside", "sentiment": "none"}, {"name": "dallas", "sentiment": "none"}, {"name": "north-east", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "bank of england jonathon manning true potential", "sentiment": "negative"}, {"name": "entrepreneurs' forum awards  fi", "sentiment": "neutral"}, {"name": "intelligent services group", "sentiment": "none"}, {"name": "entrepreneurs’ forum", "sentiment": "none"}, {"name": "frank university", "sentiment": "none"}, {"name": "über agency", "sentiment": "none"}, {"name": "deltic", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "positive solutions", "sentiment": "none"}, {"name": "itv", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "true potential llp", "sentiment": "none"}, {"name": "frank recruitment", "sentiment": "none"}, {"name": "dfs", "sentiment": "none"}, {"name": "sunderland city council", "sentiment": "none"}, {"name": "samuel knight international", "sentiment": "none"}, {"name": "international advanced manufacturing park", "sentiment": "none"}, {"name": "iamp", "sentiment": "none"}, {"name": "frank recruitment group", "sentiment": "none"}, {"name": "microsoft", "sentiment": "none"}, {"name": "frg technology consulting", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "google", "sentiment": "none"}, {"name": "fca", "sentiment": "none"}, {"name": "henry boot developments", "sentiment": "none"}, {"name": "city", "sentiment": "none"}, {"name": "financial conduct authority", "sentiment": "none"}, {"name": "henry boot developments limited", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}, {"name": "general election", "sentiment": "none"}, {"name": "lep", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}, {"name": "boiler shop", "sentiment": "none"}, {"name": "newcastle upon tyne", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning True Potential and Hoults Yard bosses win prizes at Entrepreneurs' Forum Awards \nFinancial services entrepreneur David Harrison and Hoults Yard mastermind Freddy Hoult were among the big winners at this year’s Entrepreneurs’ Forum Awards . \nMr Harrison, who is managing partner of True Potential LLP, was named as Entrepreneur of the Year at the event held at the Boiler Shop in Newcastle. \nMr Hoult won a lifetime achievement award while the inaugural scale-up prize went to the owners of Intelligent Services Group, Ben Rideway and Jamie Cook. \nOther awards on the night included Emerging Talent, which went to Steven Rawlingson, managing director of recruitment specialist Samuel Knight International, and mentor of the year to Dr David Cliff, of Gedanken. \nThe awards, which are organised by the Entrepreneurs’ Forum in partnership with the North East LEP , are a highlight of the North East organisation’s year. \nChief executive Gillian Marshall said: \nOur annual awards pay tribute the many success stories in the North East, recognising the entrepreneurs that are helping to drive economic growth, create jobs and, ultimately, champion the region as a place of prosperity where successful businesses can be established and scaled up. \nAmong our membership of leading and innovative business leaders are many of the region’s most forward-thinking people and their collective experience and successes have made the North East a real force to be reckoned with. It is vital to respect and recognise their importance to the region’s economic ambitions. \nThe main prize of the evening saw Mr Harrison named Entrepreneur of the Year for his work first with Positive Solutions and latterly with True Potential. Penny Mallory, Lifetime Achievement Award recipient Freddy Hoult, his son Charlie Hoult and Mason Bradbury from award sponsor Corporate Traveller 9:00 Jonathon Manning FCA chief dampens concerns over car finance growth \nThe head of Britain’s financial watchdog has defended the use of car finance products despite widespread fears they could herald the next financial crisis.Andrew Bailey, chief executive of the Financial Conduct Authority (FCA), said the growing popularity of auto loans was not “bad”, but showed consumers were more happy renting than owning a car.However, he said the FCA was “not complacent” and there were “issues” with how well consumers understood the terms of the products.It comes amid concerns that the rapid growth in auto lending could spark an economic crash if the UK is suddenly hit by rising unemployment or higher interest rates.In a speech at Mansion House, Mr Bailey said: \nWe are not at all complacent about the overall consumer credit situation, but I don’t regard, for instance, the shift to PCP-based lending as per se bad. \nIt seems to me to recognise the nature of a car as an asset, that is, consumers are comfortable renting rather than owning the car. \nThat said, there are issues that we seek to understand on the terms of such lending and how well they are understood by consumers, so we are not complacent on such terms. \nThe acceleration in car finance debt has been driven by products such as personal contract purchase (PCP) plans, where consumers make small monthly payments over a two to four-year period before paying a lump sum, or handing the keys back, when the contract ends.Mr Bailey said motor finance counted for around £58bn of Britain’s consumer debt pile of £200bn, with the lion’s share coming from £68bn of credit card debt.He also warned over the problems triggered by the high cost of credit, with around five million people struggling to pay off their balance and facing long-term expensive debt.He added: \nIt is not untypical for such consumers to be paying around £2.50 in interest and charges for every pound of balance they repay. \nFirms can lack incentives to tackle this as these customers are profitable. A woman uses a satellite navigation device in a car 8:53 KEY EVENT Sunderland firm tombola to sponsor I'm a Celebrity...Get Me Out Of Here! \nNorth East gaming giant tombola is set to be unveiled as the new sponsor of major ITV show I’m A Celebrity… Get Me Out of Here! as part of a multimillion-pound deal. \nThe partnership will see the Sunderland online bingo firm sponsor the new series, fronted by Geordie stars Ant and Dec, when it returns towards the end of the year, as well its spin-off Extra Camp on ITV2 and content on the ITV Hub. \nThe value of the deal has not been revealed but it is believed to be worth at least £2m a year, with food firm Aunt Bessie having forked out £6m for a three-year spnsorshop deal back in 2015 and Iceland known to have splashed out several million pounds to reach out to the huge TV audience that watches the show each year. \ntombola, which is currently constructing a new £6m HQ in Sunderland, will also sponsor the show’s app where viewers can vote for celebrities they want to take part in Bushtucker Trials, to leave the show and ultimately who will become King or Queen of the jungle. \nI’m A Celebrity… Get Me Out of Here! is one of the most popular programmes on UK TV and this year will be its 17th series, following on from a record year in 2016 with the finale setting the channel’s biggest audience figure for the year. \nThe grand final last year saw an average of 10.5m viewers tune in to see the North East’s Scarlett Moffatt crowned Queen of the Jungle, and the show reached a peak of 11.4m - making it the most watched final of the show since 2013. \nThe production of the campaign will be managed by Über Agency, continuing their long running relationship with tombola. \ntombola chief executive Phil Cronin said: \nI’m A Celebrity… Get Me Out of Here! is a perfect fit for tombola given both entertainment brands are about having fun and community. \nWith 10m viewers the show is must see viewing including in my own home, so it’s a great match for tombola, which has more players than other bingo site in the UK. \ntombola previously sponsored Emmerdale on ITV for three years so we’re excited to be working with the broadcaster again. This time, we’ll be using our sponsorship to support tombola arcade, which gives people the opportunity to play arcade games on the go. I'm A Celebrity… Get Me Out of Here! is fronted by Ant and Dec (left) and tombola chief executive Phil Cronin (right) 8:46 Jonathon Manning Battle heats up over takeover of nightclub operator Revolution \nBritain’s biggest nightclub operator has turned up the volume in its bid to merge with rival Revolution Bars, which runs a bar in Newcastle, after it outlined its plans to create a bar giant with annual sales of more than £270m.Deltic is proposing an all-paper merger that would see embattled Revolution own 65% of the combined business and Deltic the remaining 35%.The proposed tie-up sees Deltic go head-to-head with Slug And Lettuce owner Stonegate, which struck an agreement in August to acquire Revolution Bars in a £101.5m deal.Revolution, which owns more than 60 Revolution and Revolucion de Cuba high street bars, has already rebuffed an approach from Deltic over “significant concerns regarding both value and deliverability”.But Deltic - whose estate spans 57 nightclubs - said it was “disappointed” by Revolution’s “instant dismissal” of the proposal and wanted to take the merger plan straight to shareholders.It said: \nDeltic has determined that the merger proposal... is best shared directly with Revolution shareholders as it is they who ultimately need to determine the future of Revolution rather than its directors. \nThe group has now given Revolution access to its books.It added: \nDeltic believes the merger proposal represents a compelling value creation opportunity for Revolution and its shareholders and would welcome the opportunity to engage with the board of Revolution on a constructive basis. \nDeltic still has to put forward a firm offer or walk away by 5pm on October 10 under City takeover rules.The latest twist in the takeover saga comes after Revolution revealed earlier this week that annual profits fell by 29% to £3.6m and cautioned over cooling Autumn sales.The Ashton-under-Lyne-based firm said like-for-like sales rose by 1.5% in the year, but added that trading since its year-end has been hit by a “disappointing” September, with first-quarter sales growth easing back to 0.3%. Revolution bar on Collingwood Street, Newcastle Upon Tyne (Image: Newcastle Chronicle) 9:41 KEY EVENT New industrial park set to create 5,000 jobs moves forward as development partner is announced \nA project that aims to create more than 5,000 jobs in the North East has taken a leap forward with the appointment of a development partner. \nSouth Tyneside and Sunderland councils have jointly appointed Henry Boot Developments Limited as development partner for the IAMP (International Advanced Manufacturing Park). \nHenry Boot Developments, headquartered in Sheffield, will lead the project to build the site, which is proposed for an area close to the A19 and to the north of Nissan’s existing manufacturing plant. \nThe IAMP will cover 100 hectares with the aim of attracting £300m of private sector investment and the creation of more than 500 new jobs every year from 2019. \nThe site aims to attract businesses in the automotive, energy, low-carbon, logistics and offshore manufacturing fields, building on the success of the region’s existing expertise in the automotive sector. \nIt is anticipated the IAMP will also help secure more automotive supply chain jobs following Nissan announcements on the Qashqai and X-Trail replacement models being manufactured in Sunderland. \nThe Henry Boot Developments’ contract, the most significant awarded to date for the site, was approved at meetings held by both local authorities following a competitive tender process. \nSunderland City Council leader Paul Watson said: \nWe are delighted to have awarded the development partner contract to Henry Boot Developments, a company with a proven track record of delivering projects of this scale and significance. \nThe IAMP is one of the most strategically important projects in decades for Sunderland, South Tyneside and the entire North-East region. \nWith Nissan as a magnet there is huge interest in IAMP and so it is critical that we assemble a delivery team with the expertise to deliver this project. \nWe know Henry Boot Developments will be a flexible, responsive partner, as this site will be developed to respond to market demand – and there is already a great deal of interest. Aerial view of the International Advanced Manufacturing Park (Image: handout) 8:36 Accountancy watchdog drops PWC-Barclay probe PwC KEY EVENT Newcastle's Frank Recruitment grows international sales team \nFrank Recruitment is hiring an additional 45 members of staff in its US office, only three months after opening its doors in Texas. \nThe Newcastle-headquartered firm - which specialises in recruitment for major computer and IT companies - is launching a new brand focusing on recruiting staff with expertise in cloud-based technology in its Texas office. \nFollowing the launch Frank Recruitment is hiring 45 recruitment consultants and trainees to work under the new brand, which is known as FRG Technology Consulting. \nExecutive vice president Paul Briggs, who heads up the Dallas office, said: \nThis is the next phase of our delivery plan. Texas is a very exciting area for technology startups and industry stalwarts alike. \nDallas is attracting some of the best and brightest tech innovators and thinkers. \nLower taxes, smart regulations, right-to-work laws and pro-growth economic policies are allowing enterprises to thrive, which is why we’re seeing more and more workers and companies flock to the area. With a highly skilled workforce, and more jobs than ever before, it’s an exciting time for job seekers. \nTech giants Apple, Amazon, Facebook, Google and Microsoft have all opened locations in Texas in recent years. The moves have led to Texas being named as the number one US state for technology exports. \nCaroline Fox, global head of internal recruitment, said: \nAll of our recruitment consultants receive industry-leading training through our Frank University training course. We offer all of our employees clear career progression and equip them with all of the resources they need to flourish and succeed. Paul Briggs, Frank Recruitment Group 8:26 KEY EVENT DFS profits slump amid challenging market \nProfits at sofa chain DFS have tumbled after the group was thumped by Britain’s faltering economy, falling consumer confidence and the Brexit-induced collapse in the pound.The company booked a 22.3% fall in pre-tax profits to £50.1m in the year to July 29, while revenue edged up just 0.9% to £762.7m.DFS pointed to a “very challenging furniture market”, with chairman Ian Durant adding: \nContinuing uncertainty in the economy led to a significant deterioration in the consumer market which impacted sales in the second half of the year. \nThe continued weakness of sterling against the US dollar has also created a headwind for gross margins, some of which we have been able to mitigate. \nSoaring inflation caused by the collapse of the Brexit-hit pound has pushed up shop prices for hard-pressed consumers, leading retail sales across the board to slump.DFS flagged in August that profits would take a hit from uncertainty caused by the snap General Election and warm weather, which led to weak trading at its stores.The retailer said it saw significant declines in store footfall and customer orders from April to June.Chief executive Ian Filby added: \nWe have continued to make good strategic progress across all our key areas of growth, while our financial performance reflects the current challenges of the UK furniture market. \nOur recent strategic investments and operating efficiency programme support our confidence in our ability to deliver modest profit growth and cash returns in the current financial year and we continue to have excellent prospects for the long term. DFS store at a Teesside Park shopping centre - the firm has acquired rival Sofology 8:21", "external_links": [], "published": "2017-10-05T10:00:00.000+03:00", "crawled": "2017-10-05T11:11:45.004+03:00", "highlightTitle": ""}