{"organizations": [], "uuid": "fe4b55a3665886cca01ad38a5f86bfedc3797852", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13769636.ece/ALTERNATES/s1200/SGP_NEC_161017FILM01JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/whats-on/?service=rss", "section_title": "nechronicle - What's On", "url": "http://www.chroniclelive.co.uk/whats-on/film-news/its-lights-camera-lots-action-13769410", "country": "GB", "domain_rank": 21960, "title": "It's lights, camera and lots of action as Newcastle Film Festival plans gather pace", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-16T18:00:00.000+03:00", "replies_count": 0, "uuid": "fe4b55a3665886cca01ad38a5f86bfedc3797852"}, "author": "nechronicle", "url": "http://www.chroniclelive.co.uk/whats-on/film-news/its-lights-camera-lots-action-13769410", "ord_in_thread": 0, "title": "It's lights, camera and lots of action as Newcastle Film Festival plans gather pace", "locations": [], "entities": {"persons": [{"name": "caroline", "sentiment": "negative"}, {"name": "caroline goodall", "sentiment": "none"}, {"name": "garen daly", "sentiment": "none"}, {"name": "geordie", "sentiment": "none"}, {"name": "goodall", "sentiment": "none"}, {"name": "jacqui miller-charlton", "sentiment": "none"}, {"name": "kirsty bell", "sentiment": "none"}], "locations": [{"name": "hollywood", "sentiment": "none"}, {"name": "cannes", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "toronto", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "newcastle film festival", "sentiment": "negative"}, {"name": "toronto share click", "sentiment": "none"}, {"name": "boston science fiction film festival", "sentiment": "none"}, {"name": "schindler", "sentiment": "none"}, {"name": "cannes film festival", "sentiment": "none"}, {"name": "boston film", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "It's lights, camera and lots of action as Newcastle Film Festival plans gather pace Actress Caroline Goodall among those taking part as city aims to match Cannes or Toronto Share Click to play Tap to play The video will start in 8 Cancel Play now Get what's on updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nFilmmakers are gearing up for the inaugural Newcastle Film Festival which organisers hope could be the next Cannes or Toronto. \nUS director Garen Daly, who runs the Boston Science Fiction Film Festival, was announced today as the director of the new festival, which will debut from 29 March to 1 April next year. \nHe said: “I came here and I met everyone, and it reminded me of the communities where I grew up. The people are much more down to earth. \n“I want to do it right, it has to make the community feel good. We want to show Newcastle and its history as one of our themes. \n“We’re talking about developing filmmakers, and getting them to show that and share that with people, bringing in films from all over the world. I started going to the movies because I hadn’t seen the world. I think we need to get back to sharing the world through stories. Garen Daly a Boston Film Director at the Tyneside Cinema for the Newcastle Film Festival 2018 (Image: Newcastle Chronicle) \n“Artists are really the true entrepreneurs, when you look at parts of a city that are beaten up it’s the artists that will come in first, the entire area gets lifted up. If you could start bringing in people to make films here that would be awesome. \n“Most of us are incredibly visually literate, we know what’s good and what’s bad, we have that intuition. You see a lot of really good filmmakers out there who know what they’re doing - they’re the future. Hollywood filmmakers are still in a rut, they make the same old comic book movies. \n“The audiences are great - when you meet a film festival audience and you connect, you feel so good. It’s really an emotionally raw experience.” \nEntrants to the festival have until 31 October to submit their films, which will span a wide range of genres including horror films, documentaries and animation. \nActress Caroline Goodall, who has starred in Schindler’s List and The Princess Diaries, said: “We have to show that we are opening our arms across the world. All these festivals started somewhere - Toronto started in 1976 and has grown and grown. Actress Caroline Goodall at the Tyneside Cinema for the Newcastle Film Festival 2018 (Image: Newcastle Chronicle) \n“What we want is an international film festival - my work life has been completely international and I work all over the world. You can provide the city with a smorgasboard of creative offerings. \n“We’re going to have a big Bollywood presence to bring the Asian community in, who are under-served at the moment, we’re bringing entertainment and culture to them as well. Read More Mobike Newcastle city bikes: How to use them and where are they? \n“I spent a lot of my childhood in the North of England. The Geordie spirit is unique. Being a Geordie you have an identity but they are used to travelling, they have a work ethic ingrained and a sense of style that is completely their own. This is a hub and when I go to international festivals around the world, what you need is an environment where everybody can come together.” \nKirsty Bell, the event’s finance and distribution director, has raised more than £200 million for the film industry. \nShe said: “We have had over 2,000 entries from over 80 countries around the world. \n“It’s about Newcastle and its beautiful environment, because so many films have been shot in and around Newcastle, but it’s also about international and independent filmmaking, where people are choosing Newcastle to showcase their work. If Cannes can do it, why not here? We have to look at it in the context of Brexit. \n“Some of the films at the festival nobody will have seen. First of all you can get them a platform. They have to be commercial - passionate projects are great and it’s lovely to meet producers who are passionate about what they are doing, but you can spend an awful lot of money making something and you have to have a strategy.” \nThe festival was launched in May from a yacht at the Cannes Film Festival, where festival president Jacqui Miller-Charlton said it would be a “celebration of filmmaking”. Like us on Facebook", "external_links": [], "published": "2017-10-16T18:00:00.000+03:00", "crawled": "2017-10-16T18:49:19.001+03:00", "highlightTitle": ""}