{"organizations": [], "uuid": "76a03cca5a5eb6d0a89d7f1b39326c5f1f589ac2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13739475.ece/ALTERNATES/s1200/Newcastle-GV.jpg", "site_section": "", "section_title": "", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13766178", "country": "IE", "domain_rank": 21960, "title": "Business Breakfast LIVE: North East firms hauled before courts amid business rates struggle - Chronicle Live", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2017-10-16T11:15:00.000+03:00", "replies_count": 0, "uuid": "76a03cca5a5eb6d0a89d7f1b39326c5f1f589ac2"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13766178", "ord_in_thread": 0, "title": "Business Breakfast LIVE: North East firms hauled before courts amid business rates struggle - Chronicle Live", "locations": [], "entities": {"persons": [{"name": "john wardle", "sentiment": "none"}, {"name": "brown", "sentiment": "none"}, {"name": "mark rigby", "sentiment": "none"}, {"name": "kevin mccloud", "sentiment": "none"}, {"name": "footasylum", "sentiment": "none"}, {"name": "gillian drakeford", "sentiment": "none"}, {"name": "sadler brown", "sentiment": "none"}, {"name": "emma walmsley", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "martin sorrell", "sentiment": "none"}, {"name": "drakeford", "sentiment": "none"}, {"name": "clare nesbitt", "sentiment": "none"}, {"name": "waheed alli", "sentiment": "none"}, {"name": "elizabeth tetlow", "sentiment": "none"}, {"name": "vittorio colao", "sentiment": "none"}, {"name": "kevin brown", "sentiment": "none"}, {"name": "allan cairns", "sentiment": "none"}, {"name": "coreena ford footasylum", "sentiment": "none"}, {"name": "koovs", "sentiment": "none"}, {"name": "stephen", "sentiment": "none"}, {"name": "david makin", "sentiment": "none"}, {"name": "stockton", "sentiment": "none"}, {"name": "philip hammond", "sentiment": "none"}], "locations": [{"name": "north east coast", "sentiment": "none"}, {"name": "greensboro", "sentiment": "none"}, {"name": "haina", "sentiment": "none"}, {"name": "wales", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "carlisle", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "jacamo", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "holland", "sentiment": "none"}, {"name": "turnbull building", "sentiment": "none"}, {"name": "footasylum", "sentiment": "none"}, {"name": "england fund", "sentiment": "none"}, {"name": "hyperdrive", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "haringey", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "visitbritain", "sentiment": "none"}, {"name": "teesside shopping park", "sentiment": "none"}, {"name": "dominican republic", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "uae", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "north tyneside", "sentiment": "none"}, {"name": "koovs", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "coreena ford convatec", "sentiment": "negative"}, {"name": "convatec", "sentiment": "negative"}, {"name": "northumberland national park authority", "sentiment": "none"}, {"name": "university of birmingham", "sentiment": "none"}, {"name": "cvs", "sentiment": "none"}, {"name": "spiral eco home", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "north tyneside council", "sentiment": "none"}, {"name": "luton borough council", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "historic cities", "sentiment": "none"}, {"name": "world", "sentiment": "none"}, {"name": "koovs private label", "sentiment": "none"}, {"name": "local government", "sentiment": "none"}, {"name": "sba", "sentiment": "none"}, {"name": "wpp", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "national coastal tourism academy", "sentiment": "none"}, {"name": "gsk", "sentiment": "none"}, {"name": "sadler brown architects", "sentiment": "none"}, {"name": "n brown  online", "sentiment": "none"}, {"name": "footasylum", "sentiment": "none"}, {"name": "coreena ford", "sentiment": "none"}, {"name": "london stock exchange", "sentiment": "none"}, {"name": "coreena ford ikea", "sentiment": "none"}, {"name": "haymarket metro", "sentiment": "none"}, {"name": "vodafone", "sentiment": "none"}, {"name": "douglas equipment", "sentiment": "none"}, {"name": "middlesbrough borough council", "sentiment": "none"}, {"name": "durham cathedral", "sentiment": "none"}, {"name": "ikea", "sentiment": "none"}, {"name": "koovs", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Greggs opening new Chillingham Road store as part of brand new development. \nhe former car parts store Motor World on Chillingham Road, Heaton , was flattened earlier this year to make way for a three-storey building with a supermarket, retail unit and six apartments. \nSainsbury’s is expected to create a raft of jobs as part of the scheme by taking the large unit – and now Greggs has confirmed it is closing its existing Chillingham Road store to open a larger store within the development. \nAll staff at the current store, just yards away at 265 Chillingham Road, will move to the new Greggs at number 209, and it is hoped new jobs will also be created. \nFloor plans for the shop show that seating will be included too. Greggs pasties are now bakes (Image: Free editorial use) 9.15 Coreena Ford Convatec shares fall amid supply issues \nShares in Convatec slumped on Monday after the medical supplies firm warned over full-year revenues amid “supply issues”. \nThe firm said its performance during the third quarter was “severely impacted” by supply problems in wound and ostomy care, and a lower-than-anticipated revenue contribution from new products. \nIt pointed to the movement of its Advanced Wound Care manufacturing lines from Greensboro in the US to Haina in the Dominican Republic, which resulted in delays in obtaining regulatory certification. \nConvatec now expects full-year organic revenue growth will be between 1% and 2%, but the figure is “dependent on the degree of success in resolving remaining supply issues, fulfilment of back orders and recovery of orders” in the fourth quarter. \nShares in Convatec, which listed only last year, slumped more than 14% to 241p in morning trading. 9.10 KEY EVENT Tourism brings in £100m to North East economy in six months \nThree projects that aim to boost tourism businesses in the North East have been announced after new figures showed the industry brought in more than £100m in the first half of the year. \nFigures from VisitBritain show that though there was only a small increase in visitors to the North East in the first half of 2017, tourists were staying longer - with time spent in the region rising 41% - and spending more, up 14% to £108m. \nNow grants from the Discover England Fund are aiming to build on that momentum, in particular in bringing overseas tourists to the North East’s historic cities, coastline and countryside. \nIn one scheme, the Northumberland National Park Authority has joined forces with England’s other nine national parks to introduce a collection of experiences designed to inspire visitors from Australia and Germany. \nA second scheme by the England’s Historic Cities group will attempt to attract visitors from the US to Durham and Carlisle by using augmented reality to bring the cities and their stories to life. \nA third project from the National Coastal Tourism Academy aims to bring more visitors from Germany, Holland and France to the North East coast by using interactive video technology that allows tourists to build personalised itineraries. Durham Cathedral in the sunshine (Image: Newcastle Chronicle) 9.05 Coreena Ford Hyperdrive Innovation develops clean energy vehicle \nHyperdrive Innovation has continued its work to make clean energy vehicles a common part of UK life after releasing two new products to the market. \nThe Sunderland battery manufacturer played a major role in the production of a new aircraft push-back tractor, which is used to move aircraft before and after a flight. \nThe HEIP-BT has a hybrid engine designed to help airports meet their commitments to reduce CO2 and harmful emissions from their vehicles. \nIt contains a downsized diesel engine, along with an electric driveline and an energy storage device. \nHyperdrive worked in collaboration with the University of Birmingham and manufacturer Douglas Equipment to develop and build the tractor. Hyperdrive CEO Allan Cairns said: “The development of the HEIP-BT has been a fantastic collaboration bringing together innovation and technology from across the UK. \n“At Hyperdrive, we used our world-leading expertise in lithium-ion battery technology to develop the storage device and control system. The project demonstrates brilliantly how our products can be deployed across a whole variety of different applications.” Hyperdrive Innovation CEO Allan Cairns (Image: Unknown) 9.00 Quarter of workers 'exhausted every day through lack of sleep' \nThis is definitely a story for a Monday morning... \nOne in four workers believes their performance is being affected because they have a bad night’s sleep, according to a new study. \nA survey of 1,300 workers by jobs site CV-Library found that a quarter feel exhausted every day. \nMost of those questioned would like to have up to eight hours of sleep a night, but only achieve between five and seven. An alarm clock Coreena Ford Amazing spiral house on Grand Designs devised by Newcastle architects \nA Newcastle architecture firm is celebrating after seeing one of their most unusual homes featured on the Channel 4 programme Grand Designs . \nSadler Brown – whose work has included the Haymarket Metro station and the conversion of Newcastle’s Turnbull Building – designed a “spiral eco home” based on a the shape of a fossil found in the garden of clients Stephen and Elizabeth Tetlow. \nThe £800,000 house in Devon features a curving roof made of a mosaic of glass, solar and wood panels and was described by Grand Designs host Kevin McCloud as being of “outstanding architectural merit” and looking like “a snake basking on a hillside”. \nThe owners wanted to connect their home to the land and Sadler Brown’s creative director Kevin Brown had the idea of basing it on a “Fibonacci spiral” inspired by an ammonite fossil. \nHe said: “To have our work featured on a national TV programme of this magnitude is fantastic news for us all at SBA. We pride our business and reputation on our architectural design skills so to be featured on Grand Designs is an absolute honour for us. \n“It has been a privilege to see this serpentine house take shape in an area of outstanding beauty. It’s a wonder of engineering fused with sacred geometry built for the photovoltaic scales of the property’s skin.” 'Spiral Eco Home' the property at Oat Errish in Devon, design by Newcastle based Sadler Brown Architects which appeared on Grand Designs programme (Image: Copyright unknown) 8.50 Coreena Ford Footasylum announces AIM flotation \nPremium sports retailer Footasylum has announced its intention to float on the London Stock Exchange in a move that could value the firm at £150m. \nThe company is expected to begin trading on London’s junior AIM market in November and will plough the money raised into expansion. \nThe 60-store firm was established in 2005 by the founders of JD Sports, David Makin and John Wardle, and will open up to 10 outlets a year with a target of “at least” 150. \nThe firm currently has four North East stores, including shops at Sunderland’s Bridges shopping centre and intu Metrocentre, but it doesn’t have a Newcastle store. \nFootasylum’s products are aimed at 16 to 24-year-old “fashion conscious customers”, with the company dividing its shoppers into six core “tribes”. Each tribe, Footasylum said, has a “nuanced demographic and regional profile”. \nBoss Clare Nesbitt said: “This is a logical next step in Footasylum’s upward trajectory as we seek to build on our exciting product-led, multi-channel expansion strategy. \n“We pride ourselves on being a dynamic, adaptive and fast-moving business with a strong competitive position, a great stable of third party and own brands, and a disciplined approach to delivering sustainable growth. \n“We see substantial opportunities ahead across our retail, online and wholesales channels, and believe that we have the people, products and strategy to realise them.” Footasylum is launching on the AIM market. 8.45 Coreena Ford Koovs inks deal with N Brown \nOnline fashion firm Koovs has announced its entrance into the UK market through a tie-up with plus-size retailer N Brown. \nThe London-listed Indian company has struck a deal to sell its Koovs Private Label young fashion apparel through N Brown’s Simply Be brand. \nIt comes amid growing overseas expansion at Koovs after being stung domestically by the Indian government’s demonetisation programme. \nChaired by ex-ASOS man Lord Waheed Alli, the retailer saw pre-tax losses deepen to £19.3 million in the year ending in March, compared with a £16.7 million loss in 2016. \nThe firm said it had seen lower margins and higher costs, while also taking a hit from the impact on the wider market from Indian government efforts to root out illicit cash by cancelling high denomination bank notes. \nKoovs has also recently announced a distribution deal in the UAE through Souq.com as part of efforts to grow internationally. The Simply Be and Jacamo store at Teesside Shopping Park, Stockton. 8.37 What's the FTSE latest? \nThe FTSE-100 index at 8:15am was up 7.75 at 7543.19. \nThe pound at 8am was 1.3280 dollars compared to 1.3302 dollars at the previous close. The euro at 8am was 0.8874 pounds compared to 0.8899 pounds at the previous close. Screen displaying the FTSE 100 at the London Stock Exchange (Image: Yui Mok/PA Wire) 8.35 Coreena Ford Ikea boss wants transitional Brexit deal \nThe UK chief of Ikea has thrown her weight behind a Brexit transition period as pressure mounts on the Government to sign a deal to protect Britain’s businesses from a “cliff edge” severance from the EU. \nGillian Drakeford, who heads up the UK arm of the Swedish flat pack furniture giant, demanded “clarity” from Theresa May as companies brace for a new trading relationship with the single bloc. \nShe said: “I’d like to see some clarity, Theresa May talked about a transition period and this would be beneficial for us to adapt to a new trading reality, to allow us to offer products at the best prices.” \nHer comments come after another fraught week for the Government in which divorce talks failed to advance to trade and Chancellor Philip Hammond warned a “cloud of uncertainty” was hanging over the economy. \nEarlier this month, several business leaders are thought to have pressed the Conservatives to ensure a transition period at a summit attended by the likes of GSK boss Emma Walmsley, WPP chief Martin Sorrell and Vodafone head Vittorio Colao. Ms Drakeford admitted that Ikea has had to raise prices after the pound collapsed and inflation soared following the referendum last year. Ikea KEY EVENT 34% of North Tyneside firms hauled before magistrates for business rates non-payment \nA North East authority tops the UK league for issuing the most court summons to companies for failing to keep up with business rate payments. \nNorth Tyneside Council issued summons to 34% of businesses within its jurisdiction, followed by Middlesbrough Borough Council and London’s Borough of Haringey, and Luton Borough Council which called 27% before magistrates. \nThe figures are unveiled in a Freedom of Information request carried out by rents specialist CVS, which shows that 164,757 business premises in England and Wales were hauled before a magistrate in 2016/2017 after failing to pay their business rates. It means that around one in every eight businesses received a summons on those grounds from their local council, CVS said. \nIn the current financial year alone - counting the period from from April 1, when the controversial business rates revaluation took place, to the end of August - a total of 81,093 businesses have been summoned to court for failing to pay their business rates. CVS chief executive Mark Rigby is now calling on Chancellor Philip Hammond to freeze 2018 business rates as part of his Autumn Budget next month, saying the economic environment is already punishing struggling businesses. “Brexit is driving inflation. Import prices have risen given the fall in the pound with prices rising faster than wages, causing households to ‘tighten their belts’ on spending, especially on ‘big ticket’ items. Business investment has slowed and confidence fallen. “Against this backdrop we already have the highest property taxes not only in Europe, but the World. “The Chancellor must be bold within his upcoming Budget next month through an unprecedented stimulus of freezing rate rises in April 2018.” \nBusinesses in England and Wales are bracing themselves for a £1.2 billion tax hike next year, despite the staggering number of companies are being dragged to court for failing to keep up with climbing payments. \nBusiness rates specialist CVS expects a hefty rise in business rates next year, as the September Retail Price Index (RPI) - used to determine the following year’s increase - is set to come in at 4% when official figures are released tomorrow. \nIt means the Government could rake in an extra £1.2bn in business rates - which are calculated based on the rateable open rental value of a premises - on top of the £23.9 billion it is expected to bring in from English businesses this year. \nA spokesman for the Department for Communities and Local Government said: “Following the recent revaluation, the majority of businesses will see a fall in their rates from this year. “In addition (in) the spring Budget the Chancellor announced a £435 million package of rate relief that is now being rolled out across the country.” Money (Image: PA)", "external_links": [], "published": "2017-10-16T11:15:00.000+03:00", "crawled": "2017-10-16T11:19:37.011+03:00", "highlightTitle": ""}