{"organizations": [], "uuid": "473373da5d4379049878adc54159eba00a349a3c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13696298.ece/ALTERNATES/s1200/Lavinia-Woodward-court-case.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/theresa-lavinia-woodward-politics-would-13696302", "country": "GB", "domain_rank": 21960, "title": "Is Theresa May the Lavinia Woodward of politics? Some would say she too got off lightly", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-01T10:00:00.000+03:00", "replies_count": 0, "uuid": "473373da5d4379049878adc54159eba00a349a3c"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/theresa-lavinia-woodward-politics-would-13696302", "ord_in_thread": 0, "title": "Is Theresa May the Lavinia Woodward of politics? Some would say she too got off lightly", "locations": [], "entities": {"persons": [{"name": "lavinia woodward", "sentiment": "neutral"}, {"name": "theresa may", "sentiment": "neutral"}, {"name": "theresa may the lavinia woodward", "sentiment": "neutral"}, {"name": "ian pringle", "sentiment": "none"}, {"name": "mike kelly", "sentiment": "none"}, {"name": "woodward", "sentiment": "none"}, {"name": "rhys jones", "sentiment": "none"}, {"name": "sean mercer", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "jacob rees-mogg", "sentiment": "none"}, {"name": "brexit  may", "sentiment": "none"}, {"name": "pringle", "sentiment": "none"}], "locations": [{"name": "getty images europe", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Opinion Is Theresa May the Lavinia Woodward of politics? Some would say she too got off lightly Both are believed to have been let off for their misdemeanours however they'll pay in the long term, argues Mike Kelly Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nFor some reason last week I got into my head a link between Theresa May and Lavinia Woodward. \nBoth have escaped what a fair slice of the public believe the proper punishment for their ‘misdemeanours’ - one political , the other criminal. \nAnd both, in the long run, will probably pay a higher price for being ‘let off’. \nWoodward made headlines earlier this year when she was not jailed despite stabbing her boyfriend in a drink and drug fuelled frenzy as the judge decided she was to posh and talented to lock up. Or words to that effect. \nAt this earlier hearing Judge Ian Pringle QC reportedly said he believed a custodial sentence would damage her career. \nOn Monday she was given a 10-month jail sentence suspended for 18 months for inflicting unlawful wounding. Lavinia Woodward (Image: PA) \nI’m not trying to say prison is a cushy number but if Woodward had got jail time, however brief, it would have meant she would have become another quickly forgotten statistic. \nBut now she has a life sentence as the woman too posh and too clever to go to jail, a tag which will haunt her for many years to come and woe betide her if she puts a foot wrong again as any subsequent judge will probably throw away the key, no matter what the offence, to head off the type of criticism Judge Pringle got. Read More Prime Minister Theresa May 'sets date to stand down' as she plans to steer Britain through Brexit \nMay’s misdemeanour was losing what was believed to be an unassailable Tory majority at a shoo-in of a General Election. \nDespite this, she hasn’t fallen on her sword in time honoured tradition - nor has she been forced out - and is still PM. But every day she keeps the job diminishes her that little bit more. \nShe should have stepped aside quickly - perhaps to be replaced by Jacob Rees-Mogg. Then she could have joined in the hilarity of watching the country run by a bloke who won’t even change a nappy. British Prime Minister Theresa May gives her landmark Brexit speech (Image: Getty Images Europe) \nHer role now is a demeaning one - to get Brexit through so the next leader of the Tory party won’t be tainted by the compromises that will inevitably come during negotiations. \nWorse for May, it seems she will be keeping the seat warm for someone she doesn’t even like. \nShe has found out the hard way she just is not Prime Minister material. To have any chance of success you at least need the ability to read the public mood, something May totally lacks. \nIt was why during the election campaign the Tories collapsed at the polls. Read More If Rhys Jones' killer Sean Mercer was a talented student he might be free today \nEven now her ability to fly in the face of popular opinion continues apace, hence last week her extolling the virtues of the ‘free market’, viewed not over fondly by the public at large as the free market concept that has cost us all a pretty penny. \nMainly because we’re not deemed posh or clever enough to benefit from the largesse of society as it currently stands. Like us on Facebook ", "external_links": [], "published": "2017-10-01T10:00:00.000+03:00", "crawled": "2017-10-01T16:03:27.006+03:00", "highlightTitle": ""}