{"organizations": [], "uuid": "472400b9ec6a42eab4fdaec51eeca9b635e13aac", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://i2.devonlive.com/incoming/article585829.ece/ALTERNATES/s1200/Americas-Cup-World-Series-in-Plymouth.jpg", "site_section": "http://www.devonlive.com/rss.xml", "section_title": "devonlive - frontpage", "url": "http://www.devonlive.com/news/devon-news/devon-loses-prestigious-yacht-race-585832", "country": "US", "title": "Devon loses prestigious yacht race to France thanks to Brexit", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-06T09:22:00.000+03:00", "replies_count": 0, "uuid": "472400b9ec6a42eab4fdaec51eeca9b635e13aac"}, "author": "Richard Booth", "url": "http://www.devonlive.com/news/devon-news/devon-loses-prestigious-yacht-race-585832", "ord_in_thread": 0, "title": "Devon loses prestigious yacht race to France thanks to Brexit", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "News Devon loses prestigious yacht race to France thanks to Brexit The move is a blow for Plymouth as boating fans from across the Europe would have descended on the city Share Click to play Tap to play The video will start in 8 Cancel Play now Comments \nA major yacht race which was set to be held in Plymouth in 2018 has been moved to France because of Brexit. \nThe base for the Golden Globe Race 2018 will now be in Les Sables d’Olonne on Sunday July 1. \nIt is the 50th anniversary of the event. \nSpokesman Barry Pickthall said: \"We had major sponsors lined up, but no one knows what is happening with Brexit and because of that uncertainty no one wants to spend money. We are by no means the only sporting event affected by this. We feel that we exhausted every avenue before making this decision. \n\"In contrast, Les Sables d’Olonne were ready and willing to offer significant amounts of support for the start and the build up and had sponsors lined up to help pay for the event.\" \nThe race marks the anniversary of Sir Robin Knox-Johnston's victory in the Sunday Times Golden Globe in 1968 – when he became the first man to sail solo non-stop around the planet, reports plymouthherald . \nThe move is a blow for Plymouth as boating fans from across the Europe would have descended on the city however the city council said they could not commit to supporting the event. \nPlymouth City Council was also set stage the famous Plymouth Jazz and Blues Festival in the race village during the event. \nA Plymouth City Council spokesman said: “We are disappointed that the Golden Globe Race 2018 has moved to Les Sables d’Olonne as this was an event we would love to have seen in Plymouth. We were approached earlier in the year by the race organisers and agreed to host the race on the understanding that they were in advanced negotiations with a corporate sponsor. “However, in early September we were informed that the sponsor had withdrawn from the event. The organisers asked if we would consider stepping in to sponsor the race and provide a more extensive package of support which would have involved paying for berthing fees and providing hospitality. Read More ", "external_links": [], "published": "2017-10-06T09:22:00.000+03:00", "crawled": "2017-10-06T10:41:02.806+03:00", "highlightTitle": ""}