{"organizations": [], "uuid": "def40ec6976389cbe7ccd30e7e57e36a5d0d138d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13712877.ece/ALTERNATES/s1200/PROD-Survey-Indicates-Scotland-Have-Different-Views-On-Migration-From-Rest-Of-UK.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/immigration-minister-gives-ominous-brexit-13712804", "country": "GB", "domain_rank": 21960, "title": "Immigration Minister gives ominous Brexit warning to businesses when it comes to staff", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-04T07:00:00.000+03:00", "replies_count": 0, "uuid": "def40ec6976389cbe7ccd30e7e57e36a5d0d138d"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/immigration-minister-gives-ominous-brexit-13712804", "ord_in_thread": 0, "title": "Immigration Minister gives ominous Brexit warning to businesses when it comes to staff", "locations": [], "entities": {"persons": [{"name": "brandon lewis", "sentiment": "none"}, {"name": "lewis", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "alan manning", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}], "organizations": [{"name": "government’s migration advisory committee", "sentiment": "none"}, {"name": "london school of economics", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "mac", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Immigration Minister gives ominous Brexit warning to businesses when it comes to staff Improved productivity and training for British workers can make up for cuts to migrant numbers, says Brandon Lewis Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email Some businesses may have to improve productivity and employ fewer staff after Brexit , Immigration Minister Brandon Lewis has warned. \nHe said freedom of movement would come to an end when Brexit officially takes place in March 2019, despite the Government’s plans for an “implementation period” to last around two years after that. \nMr Lewis told regional journalists at the Conservative conference in Manchester: “We do have to look at productivity and how we develop skills here in this country. \n“So, there are some sectors - let’s look at construction. We build houses here arguably in the way we did 100 years ago, and take roughly 24 weeks and 20 plus people to build one house. \n“Other parts of the world do it in three or four weeks with three or four people. So there are issues like that we’ve got to deal with as well.” Immigration and border control signs (Image: Getty Images Europe) \nThe Government would develop a new immigration policy to ensure different sectors of the economy have the staff they need, but remain committed to getting net migration below 100,000, he said. It is currently 246,000 a year. \nBut immigrant labour would also be replaced by training British workers and by improvements in productivity, he said, \nThe Government’s Migration Advisory Committee (MAC), chaired by Professor Alan Manning of the London School of Economics, would present a report to Government in September, and this would influence plans for a new immigration system after Brexit, he said. Read More £300m for high-speed rail in the North dismissed as 'drop in the ocean' \nBut at the same time, the Conservative target of getting net migration below 100,000 remained in place. \n“We want to deliver net migration which is at sustainable levels, which we think is in the tens of thousands.” \nMr Lewis added: “The MAC report will come back and give us advice about what different sectors need. \n“We as a Government then have to take a decision on policy. \n“On conversations I’ve had with sectors, I think we can deliver sustainable levels of net migration.” Like us on Facebook", "external_links": [], "published": "2017-10-04T07:00:00.000+03:00", "crawled": "2017-10-04T08:51:31.000+03:00", "highlightTitle": ""}