{"organizations": [], "uuid": "1a3b872c062928c28a3aa808cc380728ff4e5eb7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13829392.ece/ALTERNATES/s1200/IBP_NEC_291017freedom_31JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/whats-on/arts-culture-news/hundreds-converge-closed-tyne-bridge-13829079", "country": "GB", "domain_rank": 21960, "title": "Hundreds converge on the closed Tyne Bridge as part of Freedom on the Tyne", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-30T09:34:00.000+02:00", "replies_count": 0, "uuid": "1a3b872c062928c28a3aa808cc380728ff4e5eb7"}, "author": "David Whetstone", "url": "http://www.chroniclelive.co.uk/whats-on/arts-culture-news/hundreds-converge-closed-tyne-bridge-13829079", "ord_in_thread": 0, "title": "Hundreds converge on the closed Tyne Bridge as part of Freedom on the Tyne", "locations": [], "entities": {"persons": [{"name": "tyne martin luther k", "sentiment": "neutral"}, {"name": "jimmie lee jackson", "sentiment": "none"}, {"name": "earl grey", "sentiment": "none"}, {"name": "king", "sentiment": "none"}, {"name": "ku klux klan", "sentiment": "none"}, {"name": "martin luther king", "sentiment": "none"}, {"name": "solomon israel", "sentiment": "none"}, {"name": "tim supple", "sentiment": "none"}, {"name": "jarrow", "sentiment": "none"}, {"name": "sarah stewart", "sentiment": "none"}, {"name": "chi onwurah", "sentiment": "none"}, {"name": "grey", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "tyne bridge", "sentiment": "none"}, {"name": "tyne bridge  later", "sentiment": "none"}, {"name": "northumbria", "sentiment": "none"}, {"name": "sharpeville", "sentiment": "none"}, {"name": "freedom city", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "montgomery", "sentiment": "none"}, {"name": "amritsar", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "peterloo", "sentiment": "none"}, {"name": "alabama", "sentiment": "none"}, {"name": "teesside", "sentiment": "none"}, {"name": "selma", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "gateway studio", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "south africa", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "northumberland street", "sentiment": "none"}], "organizations": [{"name": "easington colliery brass band", "sentiment": "none"}, {"name": "northern roots", "sentiment": "none"}, {"name": "newcastle central", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "newcastle university", "sentiment": "none"}, {"name": "solomon israel", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}, {"name": "newcastle upon tyne", "sentiment": "none"}, {"name": "newcastlegateshead initiative", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "What's On Hundreds converge on the closed Tyne Bridge as part of Freedom on the Tyne Martin Luther King visited Newcastle 50 years ago and it was commemorated by an ambitious pageant involving many people Share Click to play Tap to play The video will start in 8 Cancel Play now Get what's on updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nCity streets and the Tyne Bridge were closed yesterday as hundreds turned out beneath a wide array of banners and placards to witness or take part in Freedom on the Tyne. \nSome motorists might have cursed but away from the traffic this was a good-natured and colourful event, bringing together actors, singers, dancers, stilt-walkers, many volunteer performers and sizeable crowds. \nIt was moving and thought-provoking, too. \nA series of stories from the long, bloody and sadly ongoing struggle for justice, human equality and civil rights had been chosen for the most conspicuous event of Freedom City 2017, a festival marking the 50th anniversary of Dr Martin Luther King’s visit to Newcastle to receive an honorary degree from the university. \nIt was an event with an in-built impossibility. To witness it all you had to be in at least four places at the same time. \nAt various points around Newcastle and Gateshead people were remembering the Amritsar massacre of 1919, when British troops fired on an unarmed crowd, the Sharpeville shootings at the height of apartheid in South Africa in 1960 and the Peterloo atrocity of 1819 when cavalrymen drew swords and charged a peaceful crowd. \nBut I joined a crowd at Newcastle University where a key moment in the eventful but too-short life of Dr King was enacted. An actor playing Martin Luther King addresses the crowd on the Tyne Bridge (Image: Newcastle Chronicle) \nFirst there was an outdoor performance by young dancers of Gateway Studio in Gateshead and then the action moved indoors and we were transported back to 1965 when Dr King led a famous march from Selma to Montgomery in Alabama, meeting armed state troopers with peaceful prayers. \nA Civil Rights Act had been passed, making discrimination on racial grounds illegal, but southern states were dragging their feet. The racist Ku Klux Klan wielded influence and the death of a young black man called Jimmie Lee Jackson prompted protesters to march. \nThe arguments for and against the march were aired by various performers, with actor Solomon Israel making his first appearance as Dr King, getting the accent and tone of softly persuasive eloquence just right. Read More Freedom on the Tyne RECAP: Performers wow crowds on the Tyne Bridge \nLater, on the Tyne Bridge, the actor – as King – would recite the very speech that the American civil rights campaigner delivered when receiving his honorary degree, just months before he was assassinated by a white supremacist back in the United States. \nThere was a procession and there was singing: “We who believe in freedom can’t resist until it comes.” \nThe singing lasted as the performers and audience processed at dignified pace down Northumberland Street as far as Grey’s Monument where there was another performance. \nIn the crowd was Chi Onwurah , MP for Newcastle Central, who has been involved in the Freedom City initiative since the start. \n“It’s amazing to see it coming together,” she said. \n“The key thing is that Martin Luther King’s message still inspires today, here in the North East, just as it did in the American deep south.” \nThis event, she said, was “like bringing all the great struggles for freedom together. \n“When you look around the world and you see all the challenges from Brexit and Trump, and all the wars, the fact that the North East has dedicated itself to the struggle for justice is brilliant, fantastic.” \nI made for the Tyne Bridge but was headed off by a procession of Suffragettes in full Edwardian regalia. They looked as if they meant business, as if they might actually chain themselves to railings. \nOne of them said they were up from Teesside to join other groups who keep the Suffragette cause alive. \nSoon afterwards the Suffragettes were joined by Jarrow Marchers. It was that kind of event, multi-faceted and bringing together a clash of causes and histories. Freedom City 2017 in Newcastle Upon Tyne (Image: Newcastle Chronicle) \nThis was most evident on the Tyne Bridge, eerily devoid of traffic on a night which fell early to the change of the clocks and on which winter seemed to have arrived with a chill bite in the air. \nThe bridge is closed annually for the Great North Run but this was the first time it had been closed for a performance of this nature – probably the one-and-only performance of this nature. \nAs darkness descended so did the crowds from all directions. The Selma followers, the Suffragettes and the Jarrow marchers filed onto the increasingly crowded bridge from the Newcastle end as the Amritsar people arrived from the Gateshead end. \nBursts of Indian music ran up against the newly-arrived Easington Colliery Brass Band while the Selma chant of “We who believe...” was still going strong. Read More From Earl Grey to Martin Luther King - the North East's links with civil rights \nIn an atmosphere of what might be called organised chaos, enormous puppets appeared among the jostling onlookers and then daring aerial dancers, swirling and gyrating on wires suspended from high on the bridge, drew everyone’s gaze upwards. \nSolomon Israel, in a moment which would surely have earned huge applause if people hadn’t been looking this way and that, beautifully delivered that 1967 speech in which Dr King yearned for a time when “the jangling discords of our nation, and of all the nations of the world” would be transformed into “a beautiful symphony of brotherhood”. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nAnd then there was a bang and clouds of white ticker tape, like the feathers of doves, enveloped everyone before drifting off over the dark River Tyne. \nIt was a beautiful ending to an event which clearly involved an enormous feat of organisation and a degree of cooperation that you felt Dr King himself would have appreciated. \nI bumped into Sarah Stewart, chief executive of NewcastleGateshead Initiative, which has helped to organised Freedom City with Newcastle University and Northern Roots. \n“Over the past weeks and months it has brought together so many different groups,” she said. \n“There have been hundreds of community workers and volunteers involved in this, along with some amazing artists.” Read More Northumbria academic publishing story of Martin Luther King's historic Newcastle visit \nA few years after Dr King’s extraordinary visit to Newcastle, when he was under immense pressure back home in America, it had been all but forgotten. \nNow, 50 years on, it has surely become embedded in the North East story. Sarah Stewart was chuffed that Freedom on the Tyne had made the main ITV news on Friday, one small acknowledgement that Newcastle has a special place in the campaign to make the world a better place. \nAt some point I tried to grab a word with the event director, Tim Supple, the renowned theatrical globetrotter for whom no project is too daunting. \nI couldn’t find him. “Oh,” said one of the organisers. “I think I saw him on a bench eating a salad.” Cool as a cucumber! Like us on Facebook", "external_links": [], "published": "2017-10-30T09:34:00.000+02:00", "crawled": "2017-10-30T10:46:31.010+02:00", "highlightTitle": ""}