{"organizations": [], "uuid": "b058bcbd3bbbbecff757fde70ac86c777b45908d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article13712531.ece/ALTERNATES/s1200/Conservative-Party-Conference-2017-Day-Three.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/theresa-may-speech-conservative-conference-13712473", "country": "GB", "domain_rank": 21960, "title": "This is what Theresa May will say in her big speech at the Conservative party conference", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-04T00:30:00.000+03:00", "replies_count": 0, "uuid": "b058bcbd3bbbbecff757fde70ac86c777b45908d"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/theresa-may-speech-conservative-conference-13712473", "ord_in_thread": 0, "title": "This is what Theresa May will say in her big speech at the Conservative party conference", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "neutral"}, {"name": "davidson", "sentiment": "none"}, {"name": "boris johnson", "sentiment": "none"}, {"name": "ruth davidson", "sentiment": "none"}, {"name": "jacob rees-mogg", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "conservative party", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News This is what Theresa May will say in her big speech at the Conservative party conference Prime Minister Theresa May will ask Conservatives to stop focusing on her future and party splits as the Manchester conference comes to a close Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nPrime Minister Theresa May will urge Conservatives to “shape up” and ignore speculation about her leadership or cabinet splits. \nIn her speech to the Conservative conference on Wednesday, she will tell activists to forget about “the gossip pages of the newspapers” and focus on the lives of “ordinary working people”. \nAnd Mrs May will insist : “They must be our focus today. \n“Not worrying about our job security, but theirs.” Prime Minister Theresa May (Image: Getty Images Europe) \nThe Conservative leader will make it clear she has no intention of resigning in the near future, telling her party : “It has never been my style to hide from a challenge, to shrink from a task, to retreat in the face of difficulty, to give up and turn away.” \nThe speech will be the culmination of a conference which has been dominated by questions about the future of Mrs May, and the party as a whole. \nShe has been forced to defend her failure to sack Foreign Secretary Boris Johnson after he made a series of public demands about her Brexit policy, telling broadcast interviewers she does not want a “cabinet of yes men”. \nRuth Davidson, leader of the Conservatives in Scotland, told a conference event the party “needs to get over its current nervous breakdown and man up a little bit”. \nAnd backbencher Jacob Rees-Mogg has addressed packed fringe events, as Tories who see him as a potential future leader flock to his hear him speak. Conservative Party mugs are displayed on the first day of the annual Conservative Party conference on October 1, 2017 in Manchester, England (Image: Getty Images Europe) \nOne of the themes of Mrs May’s speech will be “fulfilling our duty to Britain”. \nExcerpts released in advance reveal she will echo Ms Davidson’s appeal for the party to “man up”, telling the conference: “Let us shape up and give the country the Government it needs. \n“For beyond this hall, beyond the gossip pages of the newspapers, and beyond the streets, corridors and meeting rooms of Westminster, life continues – the daily lives of ordinary working people go on. \n“And they must be our focus today. Read More Tories predict the Jeremy Corbyn bubble is about to 'burst' \n“Not worrying about our job security, but theirs. Not addressing our concerns, but the issues, the problems, the challenges, that concern them. \n“Not focusing on our future, but on the future of their children and their grandchildren – doing everything we can to ensure their tomorrow will be better than our today.” \nMrs May will say that she is in politics “to hand on to the next generation a country that is stronger, fairer and more prosperous”. \nAnd she will warn: “None of this will be easy. There will be obstacles and barriers along the way. Read More £300m for high-speed rail in the North dismissed as 'drop in the ocean' \n“But it has never been my style to hide from a challenge, to shrink from a task, to retreat in the face of difficulty, to give up and turn away. \n“And it is when tested the most that we reach deep within ourselves and find that our capacity to rise to the challenge before us may well be limitless. \n“That is the story of our party. That is the story of our country. And that is the resolve and determination we need as we turn to face the future today. \n“So let us go forward together. Let us fulfil our duty to Britain.” Like us on Facebook", "external_links": [], "published": "2017-10-04T00:30:00.000+03:00", "crawled": "2017-10-04T00:47:52.000+03:00", "highlightTitle": ""}