{"organizations": [], "uuid": "a0a11480ab9e1f8d7227d9a7aa401af9ddf88f7c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article703536.ece/ALTERNATES/s1200/35316201.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/news/business/leicester-business-festival-unfazed-brexit-703380", "country": "US", "domain_rank": 48128, "title": "Leicester Business Festival unfazed by Brexit jitters - with visitors from China, Russia and USA - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.499, "site_type": "news", "published": "2017-10-31T06:00:00.000+02:00", "replies_count": 0, "uuid": "a0a11480ab9e1f8d7227d9a7aa401af9ddf88f7c"}, "author": "Tom Pegden", "url": "http://www.leicestermercury.co.uk/news/business/leicester-business-festival-unfazed-brexit-703380", "ord_in_thread": 0, "title": "Leicester Business Festival unfazed by Brexit jitters - with visitors from China, Russia and USA - Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "jennifer thomas", "sentiment": "negative"}, {"name": "lauren mills", "sentiment": "negative"}, {"name": "simon jacobson", "sentiment": "none"}, {"name": "angie schottmuller", "sentiment": "none"}, {"name": "dana brown", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "andrew brown", "sentiment": "none"}, {"name": "bing", "sentiment": "none"}, {"name": "alister de ternant", "sentiment": "none"}], "locations": [{"name": "usa", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "leicester mercury les phillimore", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}, {"name": "ecuador", "sentiment": "none"}, {"name": "leicester racecourse", "sentiment": "none"}, {"name": "winstanley house", "sentiment": "none"}, {"name": "gatwick", "sentiment": "none"}, {"name": "greece", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "sabrina garufi", "sentiment": "none"}, {"name": "birstall", "sentiment": "none"}, {"name": "israel", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}], "organizations": [{"name": "google", "sentiment": "none"}, {"name": "university of leicester’s college court", "sentiment": "none"}, {"name": "university of leicester innovation hub", "sentiment": "none"}, {"name": "leicester business festival", "sentiment": "none"}, {"name": "anicca digital", "sentiment": "none"}, {"name": "leicester castle business school", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Les Phillimore, Jennifer Thomas and Lauren Mills at the Business Festival launch Share Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nOrganisers of the third annual Leicester Business Festival have welcomed visitors from across the world – seeing it as a sign of the city’s growing international reputation. \nThe fortnight of workshops, seminars, conferences, exhibitions and awards ceremonies has welcomed guests from as far afield as China, the USA and Russia. \nOrganisers said this year’s festival had been the biggest yet, acting as a fantastic celebration of the strength and confidence of Leicestershire’s business community and opportunities for the future – with business people pressing on regardless, despite fears over issues such as Brexit. \nThe festival, now in its third year, covers 13 different sectors across 154 events, ranging from wealth management and financial services to communication, marketing and business support, and creative industries. \nToday’s highlights include an “Innovate in 100 Days” workshop at the University of Leicester’s College Court and a sold-out LLEP event called “Ask the Expert to Make Business Better for All” at the Fire and Rescue headquarters in Birstall. Leicester Business Festival launched in the Highcross shopping centre \nThere is also an E-Commercial Conference taking place at Leicester Racecourse, being organised by city-based SEO specialists Anicca Digital. \nKicking off at 9.40am it will look at all aspects on e-commerce and feature talks from Sabrina Garufi – agency development manager for Google – and Simon Jacobson, who is small to medium business lead for UK and Israel at Bing. \nKeynote speaker will be the Forbes and Entrepreneur top-rated online marketer Angie Schottmuller. \nFestival organiser Alister de Ternant said: “The uptake this year has been phenomenal, and we’ve had people flying in from all over the place. \n“A gateway to China event last week hit the Chinese press and I had phone calls from two tour parties of engineers who had just landed at Gatwick and wanted to come to some of our events. \n“They went to totally random events which was really nice. The Stand Up Challenge was part of 2017 Leicester Business festival - pictured is winner Andrew Brown \n“We’ve had bookings from Russia, China, the USA, France, Greece and even Ecuador, and in terms of putting the region on the map it’s all looking very, very strong. \n“Some of the events so far have been fantastically well attended. We had 80 people at the “Woman Who” networking event at Winstanley House yesterday and at least a third of all the events so far have been sold out. \n“It’s certainly taken a leap forward from last year’s festival and I’ve spoken to so many people from all sorts of industries and sectors. \n“There have been events all over the county and many people have used it as a platform to launch initiatives – like the new University of Leicester Innovation Hub.” \nHe said Brexit uncertainty had led many of the people he had spoken to saying they were trying to put it to the back of their heads to concentrate on the here and now. Dana Brown - principal of festival sponsor Leicester Castle Business School - speaking at the launch \nHe said: “Through the first week people have been saying Brexit will be what it’s going to be and no-one can legislate for that in advance. \n“Also it has meant everybody is talking about trade and about imports and exports. People are asking how we can make ourselves stronger as a city and a county and impress on a global scale.” \nFor details of this week’s festival events click here. Like us on Facebook ", "external_links": [], "published": "2017-10-31T06:00:00.000+02:00", "crawled": "2017-10-31T10:51:15.003+02:00", "highlightTitle": ""}