{"organizations": [], "uuid": "b69756d73c7f2e6faae84b91d1a4b4d465e22f3a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://i2.leicestermercury.co.uk/incoming/article626405.ece/ALTERNATES/s1200/GettyImages-450947285.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/news/business/professional-services-play-major-part-626401", "country": "US", "domain_rank": 48128, "title": "Professional Services play major part in Leicester Business Festival - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.58, "site_type": "news", "published": "2017-10-13T22:33:00.000+03:00", "replies_count": 0, "uuid": "b69756d73c7f2e6faae84b91d1a4b4d465e22f3a"}, "author": "Tess Rushin", "url": "http://www.leicestermercury.co.uk/news/business/professional-services-play-major-part-626401", "ord_in_thread": 0, "title": "Professional Services play major part in Leicester Business Festival - Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "leices", "sentiment": "negative"}, {"name": "brexit", "sentiment": "none"}, {"name": "scott charlish", "sentiment": "none"}], "locations": [{"name": "leicester", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brewin dolphin east midlands", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}], "organizations": [{"name": "professional services", "sentiment": "negative"}, {"name": "leicester mercury professional services", "sentiment": "negative"}, {"name": "medium enterprises", "sentiment": "none"}, {"name": "sport and health", "sentiment": "none"}, {"name": "marketing and business support, food & drink", "sentiment": "none"}, {"name": "creative industries", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}, {"name": "leicester castle business school", "sentiment": "none"}, {"name": "smes", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Professional Services play major part in Leicester Business Festival “Recent events have made Leicester and Leicestershire a truly exciting place to do business.\" Share Comments \nProfessional Services is a dominant sector in the Business Festival with 24 events taking place over the fortnight. Events cover selling or passing on a business, legal basics for SMEs; wealth management and commercial mediation seminars, to managing tax, dealing with Brexit and scary issues that can affect Family or Small to Medium Enterprises. \nScott Charlish, Head of Financial Planning at Brewin Dolphin East Midlands is the sector lead for Professional Services. He said, “I am delighted to be associated with the Leicester Business Festival 2017. Scott Charlish, LBF Professional Services Sector Lead \n“Recent events have made Leicester and Leicestershire a truly exciting place to do business. I firmly believe that the financial and professional services community are very well placed to play our part in the further development of the area which in my view has become one of the most exciting places to conduct business in the UK.” \nThere are over 150 events taking place during the Leicester Business Festival this year, with everything from conferences, seminars, workshops, trade shows to exhibitions, award ceremonies and recruitment fairs taking place. Read More Record number of marketing and business support events planned for Leicester Business Festival 2017 \nMost events are free and open to absolutely anyone in the world to attend. \nEvents span a huge spectrum of legal, financial and business services, and are all put on by organisations from across Leicestershire to address common issues experienced by micro business owners and SMEs in particular. \nAll the events are part of the Leicester Business Festival sponsored by Leicester Castle Business School. The Business Festival is an annual, two-week ‘festival’ of free business events covering a variety of sectors including Professional Services, Marketing and Business Support, Food & Drink, Sport and Health, Tourism and Hospitality, Creative Industries and many more. \nThe Festival is the first of its kind to be run in the UK and now in its third year, it is by far the largest business event in the region. \nAll the events are completely free to attend but places must be booked in advance via the Business Festival website. \nFor more details and tickets, visit www.leicesterbusinessfestival.com Read More ", "external_links": [], "published": "2017-10-13T22:33:00.000+03:00", "crawled": "2017-10-14T09:12:18.013+03:00", "highlightTitle": ""}