{"organizations": [], "uuid": "ad3afc30456e8a157ce5d4f48d564ec3c196af97", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bostonstandard.co.uk", "main_image": "https://res.cloudinary.com/jpress/image/fetch/w_300,f_auto,ar_3:2,c_fill/http://www.bostonstandard.co.uk/webimage/1.8183463.1507211682!/image/image.jpg", "site_section": "http://www.bostonstandard.co.uk/rss/cmlink/1.335257", "section_title": "Boston Standard MBSP.news.feed", "url": "http://www.bostonstandard.co.uk/news/politics/boston-brexit-voters-under-fire-during-minister-s-speech-in-america-1-8183464", "country": "GB", "title": "Boston Brexit voters under fire during minister’s speech in America", "performance_score": 0, "site": "bostonstandard.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-05T16:54:00.000+03:00", "replies_count": 0, "uuid": "ad3afc30456e8a157ce5d4f48d564ec3c196af97"}, "author": "", "url": "http://www.bostonstandard.co.uk/news/politics/boston-brexit-voters-under-fire-during-minister-s-speech-in-america-1-8183464", "ord_in_thread": 0, "title": "Boston Brexit voters under fire during minister’s speech in America", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Boston Brexit voters under fire during minister’s speech in America Alan Duncan. File photo. Photo: Alan Walters EMN-150911-095525001 Published: 14:54 Thursday 05 October 2017 \nBoston Brexit voters have come under fire from a serving minister who accused members of the working class of throwing a ‘tantrum’ over immigration levels. \nSir Alan Duncan, the Europe Minister, was speaking during a visit to the United States while talking at the Chicago Council on Global Affairs, according to Johnston Press’ national title iNews. \nSir Alan, who is Foreign Secretary Boris Johnson’s deputy, campaigned for Remain during the Brexit Campaign and argued that Leave voters’ anger over immigration was ‘slightly artificial’ because they complained about Europeans taking the jobs ‘they refused to do’. \nHe told the Council that Boston was ‘one of the paradoces’ of the campaign because it had voted so heavily for Leave when the local agricultural sector was dependent on migrant workers from Poland. \n“Lincolnshire folk if you like said ‘Oh, they are coming to pinch our jobs’. Well, they wouldn’t do the jobs themselves anyway so it was a slightly artificial anger,” he said. \nEarlier in the meeting he said: “You could feel blue-collar, urban, traditional Labour opinion going viral for Leave. \n“They were stirred up by an image of immigration which made them angry and made them throw a bit of a tantrum.” \n“The manner in which the campaign was fought stirred up a lot of sentiment amongst people who were not habitual voters, particularly on the issue of immigration,” he added. \n“You could feel blue-collar, urban, traditional Labour opinion going viral for Leave. They were stirred up by an image of immigration which made them angry and made them throw a bit of a tantrum.” \nSir Alan was also critical of the way the Remain campaign had been fought, calling it ‘badly conducted’ and saying the result was that it didn’t look as though the Remain argument put a vision of optimism.’ \nSir Alan’s comments come as former Minister Anna Soubry told crowds at the Conservative Party Conference earlier this week that ‘fit, young’ migrant men are ‘not clogging up Boston’s services and housing’ . \nFor the full story see https://inews.co.uk/essentials/news/politics/alan-duncan-working-class-tantrum-contributed-brexit-vote/ Sign in", "external_links": [], "published": "2017-10-05T16:54:00.000+03:00", "crawled": "2017-10-05T17:04:13.012+03:00", "highlightTitle": ""}