{"organizations": [], "uuid": "d2a113704cc3f7f222368890cc1b6f4f9501c5e5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13828149.ece/ALTERNATES/s1200/Argument-App.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/anti-dating-app-matches-you-13828126", "country": "GB", "domain_rank": 21960, "title": "This 'anti-dating app' matches you with people with DIFFERENT opinions - and aims to open your mind", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-30T10:00:00.000+02:00", "replies_count": 0, "uuid": "d2a113704cc3f7f222368890cc1b6f4f9501c5e5"}, "author": "Hannah Graham", "url": "http://www.chroniclelive.co.uk/news/north-east-news/anti-dating-app-matches-you-13828126", "ord_in_thread": 0, "title": "This 'anti-dating app' matches you with people with DIFFERENT opinions - and aims to open your mind", "locations": [], "entities": {"persons": [{"name": "marwan elwaraki", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "kumail hussain", "sentiment": "none"}, {"name": "marwan", "sentiment": "none"}, {"name": "karim alsaka", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "america", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "google", "sentiment": "none"}, {"name": "lindisfarne castle  users", "sentiment": "none"}, {"name": "newcastle university", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nIt’s become a familiar experience in online debates. \nPeople jump to condemn anyone who disagrees with them, with opposing views written off as evil or misinformed. \nOne side might be elitist liberal snobs blind to the concerns of ordinary people, the other could be portrayed as bigoted and ignorant. \nIt’s that sort of thinking that three Newcastle University students have set out to challenge, by encouraging people to engage with different opinions. \nBurst Your Bubble is essentially the opposite of a dating app - setting up conversations between people who hold opposing political views. \nAnyone can post a subject they’ve got a strong opinion about on the public forum - Brexit , for example, or whether Universal Credit should be scrapped. Kumail Hussain, Marwan Elwaraki and Karim Alsaka have developed an app called Burst Your Bubble, that matches people with different opinions (Image: Newcastle Chronicle) \nUsers vote for how they feel about a particular subject, and are then matched with people who voted the opposite way. They’re then left to chat online, sharing each other’s perspectives. \nDevelopers Kumail Hussain, Marwan Elwaraki and Karim Alsaka say they were inspired to set up the app after seeing how polarised online arguments were becoming - in the UK, often around the idea of leaving the EU, and in America, following the election of Donald Trump. \nMarwan, 20, said: “You see people unfriending and unfollowing people who disagree with them - once you’re on one side, you don’t even know that other side exists. \n“Other media and social networks put people in echo-chambers - our mission is to change that. \n“The idea isn’t that you change your mind - if I’m pro-Brexit, I don’t have to come away anti-Brexit, but maybe the other person sees I’m not just a racist, I see that they’re not just trying to ruin my country, for example.” \nThe students, who are hoping to be able to work on their app further after they graduate, say they do their best to keep it ‘hate-free’ and actively discourage aggression or trolling. Read More Unexpected guests ruffling feathers after being discovered at Lindisfarne Castle \nUsers can end their conversations at any time, and the person they were talking to won’t be able to contact them again. They also believe that talking one-on-one makes people less likely to become abusive, as people can feel more able to speak their minds, and a large group can’t pile in on one person they disagree with. \nMarwan said: “We intentionally made it semi-anonymous - if you have a name and a picture you can see it’s a real person, so you’re probably going to be nicer, but there’s no way you can really find out anything about someone else through the app.” \nAnd, they say, based on their experience so far, it genuinely does open minds. \nMarwan has found his own assumptions challenged, after a debate about whether American football players are right to ‘take the knee’ when the national anthem is played at matches, in a controversial protest against racist police violence, an idea with Marwan supported. Read More Own one of these diesel cars? Thousands of motorists are scrapping them \nHe said: “I matched with someone who disagreed with it, and he was making some really valid points. At first I wasn’t very open-minded about it, but then he was talking about why sport shouldn’t be political and about how these famous people have better ways of achieving what they want to achieve - I thought, OK, he’s not just racist, he’s got a point of view and reasons for it.” \nBurst Your Bubble has been live for around a month, and so far has attracted several hundred users. It’s available on the Apple app store, and will launch on Google Play soon. \nFor more, visit https://burst.carrd.co/", "external_links": [], "published": "2017-10-30T10:00:00.000+02:00", "crawled": "2017-10-30T10:46:18.006+02:00", "highlightTitle": ""}