{"organizations": [], "uuid": "10fe727b7243255dee4937ffb917e1b1ae1a4e87", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13730645.ece/ALTERNATES/s1200/Brexit.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/labour-shouldnt-smug-theresa-mays-13730636", "country": "GB", "domain_rank": 21960, "title": "Why Labour shouldn't get too smug about Theresa May's demise", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-08T10:00:00.000+03:00", "replies_count": 0, "uuid": "10fe727b7243255dee4937ffb917e1b1ae1a4e87"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/labour-shouldnt-smug-theresa-mays-13730636", "ord_in_thread": 0, "title": "Why Labour shouldn't get too smug about Theresa May's demise", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "iain duncan smith", "sentiment": "none"}, {"name": "may", "sentiment": "none"}, {"name": "iain duncan", "sentiment": "none"}, {"name": "charlie mullins", "sentiment": "none"}, {"name": "mullins", "sentiment": "none"}, {"name": "simon brodkin", "sentiment": "none"}, {"name": "tony blair", "sentiment": "none"}, {"name": "rod stewart", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "lee nelson", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "boris johnson", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "negative"}, {"name": "tory", "sentiment": "none"}, {"name": "tories", "sentiment": "none"}, {"name": "manchester central convention complex", "sentiment": "none"}, {"name": "pimlico plumbers", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News opinion Why Labour shouldn't get too smug about Theresa May's demise While the Prime Minister is beyond the point of no return politically the only way is up for the Tories Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nWhen the Rod Stewart lookalike head of Pimlico Plumbers says you’ve got to go then surely tonight’s the night to do so. \nCharlie Mullins is the quintessential ‘working class’ lad-made-good, much loved by the Tories as proof of their belief people can be cured of being Labour. \nThe cure is usually a cash enema to flush out all sense of community and before you know it you’re turning up at Tory party conferences like an interview waiting to happen. \nMullins has done well for himself so he can afford to throw a fair few quid into the Tory coffers which gives him a platform to voice his opinions. Managing Director of Pimlico Plumbers Charlie Mullins (Image: PA) \nAnd these days he seems to be the go-to guy for background quotes on the plight of Theresa May and the state of the Tory party. \nSpeaking after May’s multi-car pile up of a conference speech last week he said she should stand down because she is being bullied and undermined by Boris Johnson, which was a bit cart before horse for me, but there you go. Read More The three reasons why Theresa May's big conference speech was a disaster \nAnyway in truth, her speech did all the undermining. \nIt fell into three parts. First the prankster handing her the fake P45 which May accepted with stoic resignation. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nSecond the coughing which reminded many of the brief tenure of Tory leader Iain Duncan Smith whose nervous throat clearing during parliamentary debates saw him dubbed Iain Duncan Cough by Private Eye. \nAnd finally there was another bit of nostalgia this time for TV fans of Crossroads, the Midlands-based soap famed for its wobbly sets, when part of the Tory party sign collapsed. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nCompared to the love-in that was the Labour conference, it showed a party at war with itself. \nHowever Labour should not get too smug. The Tories have been here before and following last year’s party conferences who would have thought May not Jeremy Corbyn would be the bookies favourite to be the first to go. \nAnd stranger still, bearing in mind Labour’s civil war until the general election, if the Theresa May issue is tearing the Tory party apart, Corbyn is the glue that is holding Labour together. Remember he’s 68 and can’t go on forever - who will replace him? Read More Grant Shapps plot against Theresa May will buy the Prime Minister some time \nLet me go all ‘Mystic Mike’ here. I thought May would be kept on to do the Brexit deal but I suspect she’ll go now before any deal is done. And very soon. A new leader will call another snap election on the premise, yet again, of getting a strong mandate this time specifically for a hard Brexit. \nLabour will win - just - and pick up the poisoned chalice and plough ahead with its ‘soft Brexit’ policy faced by a Tory party re-invigorated by an anti Europe stance with its preferred ‘hard Brexit’ approach. \nOne of Corbyn’s shortcomings - as a party leader not as a person - is his inability to speak convincingly of a policy he is not, well, convinced about. Lying, in old money. Does he have Tony Blair’s phone number for tips? Like us on Facebook", "external_links": [], "published": "2017-10-08T10:00:00.000+03:00", "crawled": "2017-10-08T12:57:46.002+03:00", "highlightTitle": ""}