{"organizations": [], "uuid": "dcc7c0b3faa180de221a5b9b1f720dfd337d44e1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article12677499.ece/ALTERNATES/s1200/JS83323601.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13798143", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Shareholders set for record dividend payout of £28.5bn", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-23T10:00:00.000+03:00", "replies_count": 0, "uuid": "dcc7c0b3faa180de221a5b9b1f720dfd337d44e1"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13798143", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Shareholders set for record dividend payout of £28.5bn", "locations": [], "entities": {"persons": [{"name": "pendrag", "sentiment": "negative"}, {"name": "anthony", "sentiment": "none"}, {"name": "chris hunter", "sentiment": "none"}, {"name": "robson laidler", "sentiment": "none"}, {"name": "chris", "sentiment": "none"}, {"name": "evans halshaw", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "martin wardle", "sentiment": "none"}, {"name": "jonathon manning", "sentiment": "none"}, {"name": "hunter kelly", "sentiment": "none"}, {"name": "anthony hunter", "sentiment": "none"}, {"name": "richard halstead", "sentiment": "none"}, {"name": "philip hammond", "sentiment": "none"}], "locations": [{"name": "ibiza", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "north", "sentiment": "none"}, {"name": "midlands", "sentiment": "none"}], "organizations": [{"name": "jonathon manning pendragon", "sentiment": "negative"}, {"name": "pendragon", "sentiment": "none"}, {"name": "ey", "sentiment": "none"}, {"name": "bank of england", "sentiment": "none"}, {"name": "smmt", "sentiment": "none"}, {"name": "chant properties north east in newcastle", "sentiment": "none"}, {"name": "eef", "sentiment": "none"}, {"name": "yorkshire", "sentiment": "none"}, {"name": "evans halshaw", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "chant properties", "sentiment": "none"}, {"name": "society of motor manufacturers", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KEY EVENT Former Forbidden Planet premises could become a bingo hall \nA leisure firm is hoping for a full house from city planners for its proposals to turn a former shop in Newcastle city centre into a bingo hall . \nThe old Forbidden Planet shop on Grainger Street became vacant earlier this year when the cult sci-fi and fantasy specialist moved into a brand new store just a few doors down the street. \nNow, having lain empty for eight months, leisure firm J Noble & Sons Ltd, has submitted plans which could lead to the ground floor and basement of the Grade II listed Chaucer Buildings being transformed into a bingo hall. \nThe Chester-le-Street firm, which trades as Nobles Amusements, has enlisted architectural specialist Wardman Brown to submit two planning applications to the city council, in which it details how the company’s plans would bring a building back into use while also creating jobs. \nThe firm has applied to change the use of the shop to a bingo hall, also sending in a second application asking for permission to make internal and external alterations to the listed building, including adding a new sign on the shopfront. \nThe scheme, if approved, would create two full time and three part time jobs, the documents show, and the bingo hall would be open seven days a week, from 9am to 10pm Monday to Saturday and from 10am to 6pm on Sundays. \nThe design and access and planning statement submitted by Wardman Brown Architectural Services, based in Darlington, states: \nThe application site relates to the former Forbidden Planet Store which was a cult entertainment and comic retailer. \nThe unit is located on the ground floor of the Chaucer Buildings which is a Grade II Listed property comprising shops, offices and formerly the Freemasons Hall constructed circa 1869. The 1st to 3rd floors of the building have recently obtained approval for conversion into residential apartments. \nThe unit is located on the ground floor of the Chaucer Buildings which is a Grade II Listed property comprising shops, offices and formerly the Freemasons Hall constructed circa 1869. The 1st to 3rd floors of the building have recently obtained approval for conversion into residential apartments. The Grainger Street shop in Newcastle which could be turned into a bingo hall (Image: staff photo) 9:10 Jonathon Manning Dr Martends Walking on water in Asia as profits rise \nDr Martens has notched up rising full year sales and profits after the iconic footwear brand was boosted by its popularity in Asia.The British company booked a 25% increase in group revenue to £290.6m in the year to March 31, or 12% up on a constant currency basis.Operating profit rose 27% to £37.5m as the firm hailed a strong performance in Japan and South Korea.Dr Martens’ Asian arm saw revenue rocket 43% to £66.4m as it opened five new stores in Japan and two in Hong Kong.In Japan alone, revenue was up 88% to £22m.Its best-selling boot globally was the 1460 Black Smooth.The results come after boss Steve Murray left the firm earlier this year as part of a “mutual decision”, leaving chairman Paul Mason in the hot seat while the search for a replacement gets under way.Mr Mason said: \nDespite a challenging retail environment, we have delivered double digit growth across all areas of the business and continue to see the investments in our people, structure and operations as an integral part of our aim to deliver long-term sustainable growth. \nDr Martens pointed to challenging trading conditions in the US and “potential headwinds following Brexit” as stumbling blocks for growth. Dr. Martens store in Covent Garden, London 9:04 Sunderland named as most productive area in North East for SMEs \nSunderland is the most productive area in the North East, according to a new report. \nOn average Sunderland SME’s made £111,213 for each worker employed by the company. \nThe research, which was conducted by technology giant Sage in conjunction with Nesta UK, found that small to medium businesses in Sunderland employed 38,200 people across all sectors. Combined the city’s SME turnover came to £5.3bn per year. \nMeanwhile, Hartlepool was revealed as the least productive region after SME’s only brought in £75,000 per worker. \nLondon was by far the most productive region in the country, with the City of London’s SME’s achieving a productivity figure of £1.45m. \nSage’s CEO Stephen Kelly said that the report highlighted the inequality facing small businesses in the UK. \nIn the report Mr Kelly said: \nI see this spirit of determination every day when I go to meet Sage’s customers around the UK. From sole traders to growing businesses to large enterprises with complex supply chains, they all share the same unconquerable passion and drive. Whatever political backdrop they are confronted with, these business builders get up every day and get to work. \nWhat this report also reveals, however, is the stark inequality of opportunity for small businesses. Not just between North and South or urban and rural, but between sectors, and within regions themselves – with an average 5 to 1 difference between the most and least productive local authority within any UK region. We seriously risk leaving parts of the country behind. Stephen Kelly Jonathon Manning Arqiva pushes button on stock market flotation \nTV and mobile infrastructure firm Arqiva has announced its intention to float on the London Stock Exchange in a £6bn listing.The company, owned by Canada Pension Plan Investment Board and Macquarie, is Britain’s largest owner of mobile, TV and radio towers and works with the likes of BBC, ITV, Channel 4, Channel 5.Arqiva plans to raise £1.5bn through the initial public offering (IPO) and will use the proceeds to pay down debt.The deal gives the group a market value of £4.5bn and £6bn including debt.The IPO comes after an aborted attempt to sell the firm privately.Arqiva chief executive Simon Beresford-Wylie said: \nArqiva provides the critical infrastructure and skilled workforce that ensures the effective operation of the UK’s television, radio, telecoms and smart meters. \nWe are very much looking forward to bringing our unique combination of leading assets and skills to the public markets. \nIn documents filed on Monday, Arqiva said that it is well positioned to provide shareholders with “generous” dividends and expects to pay out £195m this year.In the year to June, the firm booked revenue of £943.8m.The company said that it expects to grow the firm by using its infrastructure network to meet the growing demand for data, smart energy and water metering “Internet of Things” applications.Mike Parton, Arqiva chairman, said: \nThe IPO will enable Arqiva’s leadership team to continue to execute on its proven strategy, whilst pursuing additional growth opportunities through our tower portfolio and investing in next generation 5G and fibre technology and returning significant amounts to shareholders. \nFollowing the IPO, the Group’s balance sheet will be appropriate for an asset rich infrastructure company with long-term contracts, blue-chip clients and strong cash flows, providing investment and allowing for significant shareholder returns through a progressive dividend. One pound coin on fluctuating graph 8:40 Jonathon Manning Pendragon profits imperilled by falling new car sales \nCar dealership owner Pendragon has warned that profits will take a hit from falling demand for new cars amid a decline in consumer confidence.The group, which is behind the Evans Halshaw brand, said that it expects full year profit to come in at £60m, down from last year’s £75.4m. \nPendragon said: \nThe decline in demand for new cars and the consequent used car price correction has impacted this year’s profit outturn and we anticipate that our full year underlying profit before tax will now be approximately £60m. \nConsumer confidence “waned” and the firm experienced “significant market pressures” in the quarter, it added.Pendragon is now conducting a strategic review of its premium brands, in order to evaluate by manufacturer the “investment appeal” of their proposition.The announcement comes after the Society of Motor Manufacturers and Traders (SMMT) painted another dismal picture of the new car market in the face of slowing economy as Brexit weighs on growth and pummels consumer spending power.Figures from the SMMT showed that the new car market declined for a sixth consecutive month in September.Just over 426,000 new cars were registered in the month, down 9.3% on the same month last year.Nevertheless, Pendragon said that it expects to return to profitable growth in 2018. \nWe expect the new car market to continue to decline this year and the first half of next year as car manufacturers continue to adjust to the reduced level of demand for new cars. \nHowever, we anticipate resumption of growth in profits in 2018. \nPart of the reason for its optimism is Pendragon’s plan to double its used car revenue over the five years to 2021. Evans Halshaw KEY EVENT Newcastle brothers too young to buy their own house now heading up property investment business \nEntrepreneurial brothers are proving age is no barrier to business growth after setting up a property venture with a multimillion-pound portfolio. \nChris Hunter, 28, bought his first property when he was 19 and he now runs Chant Properties North East in Newcastle, with brother Anthony, 26. \nThe brothers initially tapped into this finance approach because their age hindered them from raising deposits themselves. \nIt has since proved to fill a vital gap in the market for cash rich and time poor investors, meaning the business is now buying an average of one new property a month. \nWith a five-year strategy in place, the brother plan to increase this purchase rate almost three-fold to 30 properties a year by the end of year five. \nChant Properties director Anthony Hunter said: \nThere is a bit of stigma towards being young in business and let’s face it, neither of us look particularly old. People have this pre-conception that we might run off to Ibiza with their money so we have worked hard to build trust with our investors. \nThey now know that we do what we say we are going to do, purchasing and turning round the right properties quickly, and then return their money, with the exact rate of return we promised. And then actually, most of them then see how easy it has been and ask if they can reinvest. \nBuilding trust and credibility, with both investors and estate agents, has been the most crucial thing for us. Followed closely by using the most up-to-date accounting software. We can even set Xero to alert us when rent has not been paid, which is so simple, but means rent arrears would never be allowed to escalate. \nThe pair have grown the rental portfolio up largely by targeting former local authority properties with big rooms, near good schools. \nThey say online accounting software Xero, which they have installed following advice from their accountant, Robson Laidler director Martin Wardle, has been integral in giving them the confidence to expand. Brothers Chris and Anthony Hunter of Chant Properties (Image: Chant Properties) 8:30 Jonathon Manning Warning signs on North East economy highlighted in two new reports \nWarning signs on the state of the region’s economy have been raised in two new surveys being published today. \nA report by the manufacturers’ organisation EEF has shown that investment by North East manufacturers has been hit by the continuing political uncertainty, while accountancy group EY has highlighted a big leap in profits’ warnings being issued in the region in the third quarter of 2017. \nAccording to the EEF/Santander Annual Investment Monitor, while demand conditions should be spurring on investment, a third of companies are only investing to satisfy current plans and waiting for clarity before thinking long term, while 13% of firms are holding off investment altogether. \nThe organisation has now called on Chancellor Philip Hammond to take measures to boost investment and productivity in his November Budget, saying that companies are not investing in improving their production capacity. \nRichard Halstead, membership engagement director for EEF in the North, said: \nManufacturers have navigated a panoply of demand-related challenges in recent years, which have taken a toll on the sector’s appetite and ability to invest. \nWith global demand on the up conditions should be ripe for industry to make new investments in capacity and productivity enhancing technology. But Brexit means the future outlook for investment is not clear cut. \nPolitical uncertainty is adding to the hurdles of cost and lack of skills in holding back spending on automation technology. The forthcoming Budget can at least start to address the latter of these challenges, starting with an ambitious industrial strategy that tackles barriers to investment head on and ensures UK manufacturers are equipped to compete for the future. \nMeanwhile, EY has reported 14 profit warnings from listed businesses in the North East and Yorkshire in Q3 of 2017, up from eight in the same period last year. \nProblems were seen in a number of sectors, but most noticable in support services and retail. \nHunter Kelly, EY’s head of restructuring for the North East and Yorkshire, said: \nSummer brought more mixed fortunes for listed businesses across Yorkshire and the North East with the contrast between growth from overseas markets and the slowing UK economy increasing. \n“Many businesses besieged by pricing pressures before Brexit, are also now feeling the effects of rising domestic uncertainty and rising costs. A rise in multiple warnings reflects the difficulties in predicting what the trends are in such an uncertain economic climate, for example, will the Bank of England raise interest rates? Richard Halstead, Midlands region director of the EEF (Image: Publicity Picture) 8:25", "external_links": [], "published": "2017-10-23T10:00:00.000+03:00", "crawled": "2017-10-23T10:54:05.009+03:00", "highlightTitle": ""}