{"organizations": [], "uuid": "b85e96d2eec2e0735d10780f4d355f77a8ed3fa6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12555956.ece/ALTERNATES/s1200/Sheep-with-lambs-in-Northumberland.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/farming/many-north-east-farms-would-13758722", "country": "GB", "domain_rank": 21960, "title": "Many North East farms would become loss making under hard Brexit, report says", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-13T17:39:00.000+03:00", "replies_count": 0, "uuid": "b85e96d2eec2e0735d10780f4d355f77a8ed3fa6"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/farming/many-north-east-farms-would-13758722", "ord_in_thread": 0, "title": "Many North East farms would become loss making under hard Brexit, report says", "locations": [], "entities": {"persons": [{"name": "gail soutar", "sentiment": "none"}, {"name": "michael gove", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "sarah baker", "sentiment": "none"}], "locations": [{"name": "agricultur", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "scotch corner", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "alnwick rugby club", "sentiment": "none"}, {"name": "agriculture & horticulture development board", "sentiment": "none"}, {"name": "farmers", "sentiment": "none"}, {"name": "food and rural affairs", "sentiment": "none"}, {"name": "horticulture development board", "sentiment": "none"}, {"name": "ahdb", "sentiment": "none"}, {"name": "national farmers’ union", "sentiment": "none"}, {"name": "nfu", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Many North East farms would become loss making under hard Brexit, report says Report from Agriculture and Horticulture Development Board outlines three scenarios for Brexit and its impact on farmers Share A sheep with two lambs in Northumberland (Image: iStockphoto) Share Get business   Thank you for subscribing!   \nMany farms in the North East would become loss making if the UK leaves Europe without a trade deal and with the loss of subsidies for farmers, a new report says. \nThe report by the Agriculture & Horticulture Development Board (AHDB) outlines three possible scenarios for Brexit, with analysis of various factors including the cost of farm labour, different trading relationships with Europe and the rest of the world, and different levels of subsidy. \nThe report says the “worst-case scenario” would cut average farm profits in the UK from £38,000 a year to just £15,000. \nBut in less favoured areas for sheep and beef farming - a classificiation which covers most of the rural North East - farms would become loss making and, the report says, “only the most efficient producers will be economically viable without off-farm income”. \nFarm incomes in the North East would be virtually unchaged under the best scenario envisaged by AHDB, where payments to farmers were maintained at the current level and there was a comprehensive free trade agreement between the UK and the EU. \nBut even the second scenario of “unilateral liberalisation” would see farm incomes in less favoured areas would see farm incomes halved. \nAHDB has now teamed up with the National Farmers’ Union (NFU) to hold roadshows where farmers can discuss the report, with two being held in the North East. \nAHDB senior analyst Sarah Baker said: “The roadshows are a call to action for farmers to get fit for the future. The top 25% of performers in all sectors, regardless of size, will remain viable in all our post-Brexit scenarios, which sketch out the extremes. Read More Farmers urged to log rural crime after big rise in North East offences \n“We will be continuing with this analysis as more information becomes available to ensure our levy payers are kept fully informed and are best positioned for the change ahead. \n“In the meantime, the analysis shows that ‘wait and see’ is a high-risk strategy and that there is plenty that farm businesses can do now to mitigate the effects of Brexit. These roadshows are one of the ways AHDB is helping farmers and growers improve their performance and inspiring them to succeed in a rapidly changing world.” \nNFU’s chief EU exit and international trade adviser Gail Soutar said: “Over the past 12 months, the NFU has presented its vision on the four priority areas of the Brexit negotiations: international trade, labour, regulation and a domestic agriculture policy. \n“But Brexit is a moving feast and we’re constantly developing our policy, alongside our members, to ensure that when we’re making the case for farming to government it’s relevant and it’s right for our industry. \n“During the meetings the team will present the organisation’s latest thinking on the development of a domestic agriculture policy aimed at helping farmers to mitigate volatility, enhance productivity and to deliver environmental benefits once we leave the control of the CAP. \n“The meetings will also cover transitional arrangements required to ensure continuity and certainty for farmers when we leave the EU and give members an update on the NFU’s trade policy priorities.” \nThe AHDB report examines issues including subsidies, labour costs, trade relationships with the EU and the rest of the world, and regulations - all of which could be affected by Brexit. Read More North's 'bioeconomy' could be massive jobs driver, new report says \nFarmers in the UK currently receive more than £3bn a year in subsidies from the EU, and though the Government has pledged to maintain payments until 2022, Environment Secretary Michael Gove has signalled that the way the money is allocated will change after that. \nRoadshows will take place in Alnwick Rugby Club in Northumberland on the afternoon of October 25 and at the Holiday Inn at Scotch Corner, on the evening of the same day. \nA spokesperson for the Department for Environment, Food and Rural Affairs said: “This report is based on hypothetical and highly unlikely scenarios that do not reflect the Government’s negotiating position. \n“Outside the EU and free from the bureaucracy of the Common Agricultural Policy, our farmers will be able to focus on growing, selling and exporting more fantastic produce.” Like us on Facebook", "external_links": [], "published": "2017-10-13T17:39:00.000+03:00", "crawled": "2017-10-13T18:06:18.003+03:00", "highlightTitle": ""}