{"organizations": [], "uuid": "2a0e432f86024a66600df6c1226150088ae97e26", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://i1.devonlive.com/incoming/article562172.ece/ALTERNATES/s1200/A-Monarch-airplane.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "devonlive - frontpage", "url": "http://www.devonlive.com/news/celebs-tv/monarch-customers-fighting-places-flights-562246", "country": "GB", "title": "Monarch customers fighting for places on flights", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-02T11:03:00.000+03:00", "replies_count": 0, "uuid": "2a0e432f86024a66600df6c1226150088ae97e26"}, "author": "Colleen Smith", "url": "http://www.devonlive.com/news/celebs-tv/monarch-customers-fighting-places-flights-562246", "ord_in_thread": 0, "title": "Monarch customers fighting for places on flights", "locations": [], "entities": {"persons": [{"name": "grayling", "sentiment": "none"}, {"name": "linkunaitis", "sentiment": "none"}, {"name": "andrew haines", "sentiment": "none"}, {"name": "karen patrick", "sentiment": "none"}, {"name": "oliver richardson", "sentiment": "none"}, {"name": "deborah bond", "sentiment": "none"}, {"name": "nimmo", "sentiment": "none"}, {"name": "andrew swaffield", "sentiment": "none"}, {"name": "zivile rakauskaite", "sentiment": "none"}, {"name": "blair nimmo", "sentiment": "none"}, {"name": "patrick", "sentiment": "none"}, {"name": "chris grayling", "sentiment": "none"}, {"name": "vilius linkunaitis", "sentiment": "none"}], "locations": [{"name": "london luton airport", "sentiment": "none"}, {"name": "bedfordshire", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "ibiza", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "egypt", "sentiment": "none"}, {"name": "luton airport", "sentiment": "none"}, {"name": "malaga", "sentiment": "none"}, {"name": "gatwick", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}, {"name": "air berlin", "sentiment": "none"}, {"name": "latvia", "sentiment": "none"}, {"name": "rome", "sentiment": "none"}, {"name": "turkey", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "riga", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}, {"name": "tunisia", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "caa", "sentiment": "none"}, {"name": "monarch aircraft engineering", "sentiment": "none"}, {"name": "northamptonshire", "sentiment": "none"}, {"name": "kiwi.com", "sentiment": "none"}, {"name": "monarch airlines", "sentiment": "none"}, {"name": "transport", "sentiment": "none"}, {"name": "kpmg", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "civil aviation authority", "sentiment": "none"}, {"name": "air travel organiser", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Monarch customers fighting for places on flights Customers affected by the company's collapse have been urged to check a dedicated website, monarch.caa.co.uk, for advice and information on flights back to the UK. A 24-hour helpline is also available on 0300 303 2800 from in the UK and Ireland, and +44 1753 330330 from overseas. Share Click to play Tap to play The video will start in 8 Cancel Play now Comments \nMonarch customers have been forced to scramble for flights after the airline's collapse into administration disrupted holiday plans. \nA Lithuanian couple on their honeymoon were among passengers who arrived at Luton Airport in Bedfordshire on Monday morning to find their flight had been cancelled. \nCustomers due to fly out of the UK with Monarch have been warned not to travel to airports as there will be no further flights. \nCustomers affected by the company's collapse have been urged to check a dedicated website, monarch.caa.co.uk, for advice and information on flights back to the UK. A 24-hour helpline is also available on 0300 303 2800 from in the UK and Ireland, and +44 1753 330330 from overseas. \nVilius Linkunaitis, 31, said he and his new wife, Zivile Rakauskaite, 32, felt \"stranded\" and \"lost\" after learning they would not be able to fly. \nHe said: \"We are trying to fly as it's our honeymoon holiday and we are totally screwed at the moment.\" \nThe couple, who married just days ago, had flown to London from Riga, Latvia, and were due to travel on to Malaga in Spain for the end of their honeymoon. \nThey said Monarch was not answering its phones and they could not get through to Kiwi.com, the website operator they booked the flights with. \nMr Linkunaitis said: \"We feel very stranded and just lost and I don't know what to do now.\" \nHe said they had been told by airport staff to go online to find the cheapest seats on an alternative flight. \nKaren Patrick, from Northamptonshire, was due to fly with Monarch Airlines to Rome, Italy, with relatives who are visiting from the United States. \nThe 53-year-old said fights with alternative operators were \"going so quickly\" as the group tried to work out what to do. \nShe said: \"We just could not believe it and we have our relatives who have come from America too. It's just unbelievable.\" \nThe group only discovered that travel with Monarch had been suspended when they arrived at Luton Airport. \nThey have managed to get seats on a flight with easyJet on Tuesday and have been forced to pay for the new flights, but hope the cost will be covered by their insurance. \nMs Patrick's cousin, Deborah Bond, 55, from Texas, said: \"We are not going to let it ruin our holiday.\" \nMinisters have been accused of \"sitting on their hands\" while airline Monarch went bust as an operation to repatriate 110,000 travellers was launched. \nThe Luton-based airline, which was about to mark its 50th anniversary, went into administration early on Monday, triggering uncertainty for customers and a huge effort to get people already on holiday back to the UK. \nThe Civil Aviation Authority (CAA) said it had been asked by the Government to charter more than 30 aircraft to bring the passengers home, with Transport Secretary Chris Grayling calling it the \"biggest peacetime repatriation\" effort. \nA plane carrying 165 passengers from Ibiza was the first to arrive, landing at Gatwick on Monday morning, hours after the airline's board called in administrators KPMG. \nThe collapse - the largest to hit a UK airline - has left some 300,000 future bookings cancelled and customers have been told to keep away from airports as there will be no more flights. \nKPMG partner Blair Nimmo said Monarch , which employs around 2,100 people across its airline and tour group, had struggled with mounting costs and competitive market conditions which saw it suffer a period of sustained losses. \nAdministrators are now considering breaking up the company as no buyer has been found to purchase Monarch in its entirety, he said. \nIn a letter to staff, Monarch chief executive Andrew Swaffield said the \"root cause\" of the airline's plunging revenues was terror attacks in Egypt and Tunisia, as well as the \"decimation\" of the tourist trade in Turkey. \nBut the Unite union, which represents around 1,800 engineers and cabin crew working for Monarch , claimed that ministers rebuffed requests by Monarch to provide a bridging loan, charged at commercial rates, to tide the company over while it restructured the business to focus on its long-haul operations. \nNational officer Oliver Richardson said: \"Monarch's workforce has worked tirelessly and loyally, with great sacrifice, to try and turn the airline around in the last year. \n\"Their hard work has been undone by a Government seemingly content to sit on its hands and allow one of the UK's oldest airlines go into administration. \n\"There were a number of factors that impacted negatively on the company. \n\"However, continuing uncertainty surrounding Brexit and the ability of UK airlines to fly freely in Europe after the UK has left the EU undoubtedly hindered Monarch getting the investment it needed to restructure and survive. \n\"This uncertainty, combined with the apparent unwillingness of the Government to assist at commercial rates and at a profit to the taxpayer, has left thousands of jobs at a great British airline hanging by a thread. \n\"Now is not the time for Government ministers to wash their hands of a problem they have contributed to. \n\"Ministers need to act fast by intervening in a similar way as their German counterparts did with Air Berlin and help secure a future for Monarch .\" \nCAA chief executive Andrew Haines said the decision to stop trading would be \"very distressing for all of its customers and employees\". \n\"We are putting together, at very short notice and for a period of two weeks, what is effectively one of the UK's largest airlines to manage this task,\" he said. \n\"The scale and challenge of this operation means that some disruption is inevitable. We ask customers to bear with us as we work around the clock to bring everyone home.\" \nThe regulator said all Monarch customers who are abroad and due to return to the UK in the next two weeks will be flown home. \nThe flights will be at no extra cost to passengers and they do not need to cut short their stay, the CAA said. New flight details will be available a minimum of 48 hours in advance of customers' original departure times. \nThe Government has warned passengers to expect disruption and delay as it works to ensure there are enough flights to return the \"huge number\" of passengers. \nCommenting on the \"extraordinary operation\", Mr Grayling said: \"I have immediately ordered the country's biggest ever peacetime repatriation to fly about 110,000 passengers who could otherwise have been left stranded abroad. \n\"This is an unprecedented response to an unprecedented situation. Together with the Civil Aviation Authority, we will work around the clock to ensure Monarch passengers get the support they need. \n\"Nobody should under-estimate the size of the challenge, so I ask passengers to be patient and act on the advice given by the CAA.\" \nThe CAA had been expected to announce on Monday whether Monarch would be able to continue selling package holidays. \nThe low-cost airline and holiday company had a deadline of midnight on September 30 before its Air Travel Organiser's Licence (Atol) expired. \nThe firm was granted a 24-hour extension until midnight on October 1, but that also passed without any announcement of a renewal. \nMonarch, whose headquarters are at London Luton Airport, was founded in 1968. \nThe group's engineering operation, Monarch Aircraft Engineering, is not in administration and continues to trade normally. \nMr Nimmo said Monarch had been \"significantly loss-making\" over the last year and those losses were projected to continue in the year ahead. \nIn the last year the airline had taken 14% more customers but revenue was £100 million less, while adverse movement of the pound against the dollar had increased costs including fuel, handling charges and lease payments. \nOn the prospect of job losses, he said that, because of the timing of the announcement, staff have not yet been spoken to about their futures. \n\"We have not spoken to the staff, we have people at all the major sites from KPMG this morning and we are going to ... explain to them exactly where we are with them at the moment and where things are going to move going forward, what their rights and statutory rights are in these circumstances. That should become clearer over the next few hours.\" \nUK travel firms selling holidays and flights are required to hold an Atol, which protects customers with pre-booked holidays from being stranded abroad in the event of circumstances such as the company ceasing to trade. Like us on Facebook ", "external_links": [], "published": "2017-10-02T11:03:00.000+03:00", "crawled": "2017-10-02T11:12:29.000+03:00", "highlightTitle": ""}