{"organizations": [], "uuid": "78b81710383ac14f801518b9484edbea174b01b2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13838565.ece/ALTERNATES/s1200/Ryanair-profits.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/ryanair-still-made-1bn-profit-13838365", "country": "GB", "domain_rank": 21960, "title": "Ryanair still made £1bn profit despite flight cancellation fiasco", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-31T18:34:00.000+02:00", "replies_count": 0, "uuid": "78b81710383ac14f801518b9484edbea174b01b2"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/ryanair-still-made-1bn-profit-13838365", "ord_in_thread": 0, "title": "Ryanair still made £1bn profit despite flight cancellation fiasco", "locations": [], "entities": {"persons": [{"name": "michael o'leary", "sentiment": "none"}, {"name": "michael o’leary", "sentiment": "none"}, {"name": "neil wilson", "sentiment": "none"}], "locations": [{"name": "air berlin", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "ryanair", "sentiment": "negative"}, {"name": "alitalia", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "monarch airlines", "sentiment": "none"}, {"name": "etx capital", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Ryanair still made £1bn profit despite flight cancellation fiasco Budget airline said the flight cancellations that affected the North East and other areas will cost it £22m Share Ryanair boss Michael O'Leary (Image: PA) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nBudget airline Ryanair will suffer a €25m (£22m) blow in the wake of its flight cancellation fiasco, but has still bolstered half-year profits by 11%. \nThe Irish firm said costs in its “sales, marketing and other” bracket had leapt 30%, as it dishes out compensation after around 700,000 customers were disrupted by cancelled flights stretching from September to March next year. \nThe low-cost carrier has come under fire after cancelling around 20,000 flights - including a number in the North East - over the autumn due to an error over pilot holiday rosters. \nPre-tax profits climbed to €1.293bn (£1.139bn) for the six months ending in September, up from €1.168bn (£1.029bn) over the period last year. \nThe jump was driven by a strong Easter period, helping bolster customer numbers by 11% to 72.1m. \nRevenues also picked up 7% to €4.425bn (£3.899bn), as it added 80 new routes and drove down air fares by 5%. \nHowever, moves to boost pilot pay could impact its full year performance by as much as €100m (£88m), the company said. \nChief executive Michael O’Leary said: “These strong H1 results reinforce the robust nature of Ryanair’s low fare, pan-European growth model, even during a period which suffered a material failure in our pilot rostering function in early September. \n“Prior to this event, we were on track to deliver strong H1 results during which we opened three new bases and 80 new routes. \n“We took delivery of 35 new B737s in the first six months of 2017, we stimulated 11% traffic growth with 5% lower airfares, and achieved an industry record load factor of 97% in the peak summer months.” \nThe Dublin-based firm stuck by its annual profit guidance, saying it saw no reason to adjust the measure from between €1.40bn (£1.23bn) and €1.45bn (£1.28bn), despite pilot rostering problems bumping up costs. Read More \nHowever, it said full-year traffic was now expected to slow from 131m customers to 129m after having to ground 25 aircraft. \nShares rose more than 4% in response to the half-year performance. \nNeil Wilson, ETX Capital’s senior market analyst, said: “More passengers, lower fares and on course for another record profit - investors might be wondering what all the fuss was about in the wake of September’s cancellation fiasco. \n“But beneath the rising revenues and passengers there are concerns about rising labour costs that will affect Ryanair’s unit cost advantage over peers.” \nFocusing on Brexit, the airline said the UK Government “continues to underestimate” the flight disruption triggered by uncertainty over Britain’s exit from the European Union. \nIt added: “There remains a worrying risk of a serious disruption to UK-EU flights in April 2019 unless a timely UK-EU bilateral is agreed in advance of September 2018. \n“We, like other airlines, need clarity on this issue before we publish our summer 2019 schedules in mid-2018 and time is running short for the UK to develop a bilateral solution.” \nThe financial update comes during a choppy period for the airline industry, with a string of European airlines - Monarch Airlines, Air Berlin and Alitalia - collapsing into bankruptcy. \nRyanair said it was poised to capitalise on the pressures facing the wider industry by growing its presence in Germany and Italy and adding more aircraft to “take up any slack” created by the demise of Monarch. Like us on Facebook", "external_links": [], "published": "2017-10-31T18:34:00.000+02:00", "crawled": "2017-10-31T19:26:37.001+02:00", "highlightTitle": ""}