{"organizations": [], "uuid": "e0328e4c34e0df870ad19b538a3f3d836ba6e5fa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://i3.devonlive.com/incoming/article361746.ece/ALTERNATES/s1200/Anne-Marie-Morris-MPppPNG.png", "site_section": "http://www.middevongazette.co.uk/politics.rss", "section_title": "devonlive - News", "url": "http://www.devonlive.com/authors/anne-marie-morris/theresa-reminded-us-no-deal-639998", "country": "GB", "title": "As Theresa May reminded us, no deal is better than a bad deal", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-17T15:13:00.000+03:00", "replies_count": 0, "uuid": "e0328e4c34e0df870ad19b538a3f3d836ba6e5fa"}, "author": "Anne Marie Morris", "url": "http://www.devonlive.com/authors/anne-marie-morris/theresa-reminded-us-no-deal-639998", "ord_in_thread": 0, "title": "As Theresa May reminded us, no deal is better than a bad deal", "locations": [], "entities": {"persons": [{"name": "newton abbot", "sentiment": "none"}, {"name": "anne marie morris", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "michael barnier", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}, {"name": "wto", "sentiment": "none"}, {"name": "european court of justice", "sentiment": "none"}, {"name": "henry vii", "sentiment": "none"}, {"name": "ecj", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "\nAnne Marie Morris is the MP for Newton Abbot and has been since 2010. \nThe Transition Agreement \nThe Prime Minister confirmed that Britain would be seeking a transition deal after we formally leave the EU. While clearly we need time to adjust, for me it is key that no transition period goes beyond two years and that during any such period the UK can negotiate free trade deals with other countries and is no longer bound by the four freedoms, particularly the free movement of people. The jury is out as to whether or not this can be or will be delivered. Any payment must I believe reflect our legal obligations and no more. Clearly we should also pay for services we continue to use. \nWe must I believe be very clear that nothing after March 2019 continues to be subject us to the European Court of Justice. The government is not making this case and I am concerned the ECJ will by stealth continue to have a place in our judicial system. British judges are free to consider ECJ rulings. We might find mission creep with these judgements being incorporated into our common law. If ECJ rulings are to be referred to by British courts in determining the rights of EU citizens, we could for example find our pension and benefit system being dictated indirectly by the European court. Read More This is not “project fear”. It is project fact. \nSubstantial work is going on to ensure we do achieve frictionless trade come March 2019 and this talk of a cliff edge is more scaremongering. The UK voted to leave the EU and article 50 has been triggered. The British government must deliver. Work is also in hand to prepare us for no deal at all – together with the funding to support it. In a way this is easier to do than the preparation for a deal which we don’t know the content of and a transitional deal – when we still don’t know what we are transitioning to. Anne Marie Morris MP \nNegotiations \nLast Monday, the Prime Minister warned European leaders that we will make no more concessions on Brexit until they compromise on opening trade and transition talks – it is up to them to break the current stalemate. A customs white paper was released the same day demonstrating some of our preparations for the option of leaving the EU in March 2019 without a deal. The new system will include setting the UK’s own tariffs and quotas and establishing a system for the classification of goods, in line with WTO requirements. It is in our interests for negotiations to succeed but such plans are important as they allow us to walk away from the negotiating table if faced with a bad deal. Read More Fly-tipping must be stopped \nMichael Barnier, the EU’s Chief Negotiator, said the UK showed a willingness to move forward with an orderly withdrawal. He is said to agree that it is time to begin exploring transition and trade talks. The fifth round of negotiations looked at citizens’ rights, the financial settlement, exit arrangements, and Ireland. This is the last round of negotiations before EU leaders meet for a summit. It is far from clear the EU leaders are really prepared to move. The EU must now play ball and negotiate– as Theresa May reminded us, no deal is better than a bad deal. Anne Marie Morris MP \nParliament \nAt home in the House of Commons there are of course additional battles to fight. The Withdrawal Bill which converts EU law to UK law has survived so far but is threatened with amendments which remove much of its power and value. The so called Henry VII powers which enables ministers to deal with some legislation through delegated legislation after the bill becomes law, is proving difficult to get through. Without it, it will be almost impossible to ensure all the legislation which needs to be changed has been identified reviewed and changed by 2021. Read More \nThis is going to be a bumpy journey. The final vote to agree or not agree to any proposed deal is approaching fast. Like us on Facebook ", "external_links": [], "published": "2017-10-17T15:13:00.000+03:00", "crawled": "2017-10-17T16:31:49.002+03:00", "highlightTitle": ""}