{"organizations": [], "uuid": "f2186bbc2ab983b45b167bf70bc17bb80b575c02", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://i1.devonlive.com/incoming/article602797.ece/ALTERNATES/s1200/Julie-GirlingPNG.png", "site_section": "http://www.westernmorningnews.co.uk/editorschoices.rss", "section_title": "devonlive - frontpage", "url": "http://www.devonlive.com/news/devon-news/south-west-tory-mep-whip-602793", "country": "GB", "title": "South West Tory MEP has whip withdrawn after voting to block Brexit progress", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-09T23:13:00.000+03:00", "replies_count": 0, "uuid": "f2186bbc2ab983b45b167bf70bc17bb80b575c02"}, "author": "Daniel Clark", "url": "http://www.devonlive.com/news/devon-news/south-west-tory-mep-whip-602793", "ord_in_thread": 0, "title": "South West Tory MEP has whip withdrawn after voting to block Brexit progress", "locations": [], "entities": {"persons": [{"name": "julie girling", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "kenneth clarke", "sentiment": "none"}, {"name": "julie", "sentiment": "none"}, {"name": "girling", "sentiment": "none"}, {"name": "anne marie morris", "sentiment": "none"}, {"name": "dalton", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "ashworth", "sentiment": "none"}, {"name": "richard ashworth", "sentiment": "none"}, {"name": "dan dalton", "sentiment": "none"}], "locations": [{"name": "downing street", "sentiment": "none"}, {"name": "strasbourg", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "gibraltar", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}, {"name": "south-west", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "south east england", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}], "organizations": [{"name": "cancel play now comments  a south west mep", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "conservative party share click", "sentiment": "none"}, {"name": "army", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "isis", "sentiment": "none"}, {"name": "conservative", "sentiment": "none"}, {"name": "european parliament", "sentiment": "none"}, {"name": "the european parliament", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "South West Tory MEP has whip withdrawn after voting to block Brexit progress Julie Girling has said she is saddened by the decision by the Conservative Party Share Click to play Tap to play The video will start in 8 Cancel Play now Comments \nA South West MEP has had the Conservative whip withdrawn after she voted to block moves towards trade talks between the UK and European Union. \nJulie Girling, who is one of six MEPs for the South West and Gibraltar, declared that “sufficient progress” had not been made in the Brexit talks to move on to discussions on the future relationship between the UK and EU. \nAlongside South East England MEP Richard Ashworth, who also voted against the resolution, the pair have had the Conservative whip withdrawn from them. \nThe whip was removed from the two senior MEPs after consultation between the party’s European parliament chief whip, Dan Dalton, and Downing Street. Ashworth, a former Tory group leader in Strasbourg, and Girling, a former chief whip, backed the non-binding motion, which was passed by 557 votes to 92, with 29 abstentions. Read More PM Theresa May refuses to say if Anne Marie Morris can return to the Conservative Party \nHaving had the whip withdrawn, Julie said: “I am disappointed to have had the Conservative whip withdrawn, especially since it happened before any discussion was held with me about the reason for my vote last week. \n“I have been active in the party for 40 years – 20 as an elected representative – and for 39 of those years our policy has been pro-Europe. Julie Girling MEP \n“I have never considered myself a rebel and have not altered my beliefs. It is the party which has changed, not me, but that does not stop me feeling sadness that such a precipitate response was felt to be appropriate.” \nIn his letter to the pair, Dalton said: “The Brexit negotiations are the most important negotiations our country faces and reaching a new partnership with the European Union is in the interests of both the UK and the EU. \n“The resolution by the European parliament sought to delay progress in the negotiations between the UK and the EU by holding back talks on the future relationship. It also proposed that one part of the UK, Northern Ireland, could remain in the single market and customs union, while the rest of the UK departs – which is not acceptable. \n“Given the seriousness of this issue, and your failure to discuss your intention to vote against the agreed position of the Conservative delegation in advance, I am therefore writing to inform you that I am suspending the Conservative whip from you until further notice.” Read More MP and former Army captain criticised for calling Jeremy Corbyn a bigger threat to UK than ISIS \nExplaining why she voted as she did, Julie said: “I wanted to put forward my explanation for my recent vote on the non-binding resolution on the progress of the Brexit Negotiations. The headlines that you have seen do not reflect the whole resolution, much of the media coverage has reduced the vote to a zero-sum game – not something I recognise. I did not vote to prevent trade talks, in fact in my speech to the Parliament I clearly call on the Council to open up parallel negotiations on trade. I did however vote to acknowledge that not enough progress has been made between the two parties. An opinion which is shared by many on both sides of the Brexit debate. \n“The caricature of two embittered enemies – the UK and the EU – is as facile as it is unsustainable. For the future prosperity and peace of the continent good relations must be preserved, and I feel the European Parliament is uniquely placed to help facilitate this. Many conservatives, myself included, wish to follow the Prime Ministers Florence call for action and assist in moving the negotiations forward. It is patently obvious that the negotiations have not made sufficient progress and I sought to make that clear in my vote. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \n“The European Parliament is particularly experienced in negotiation, consensus and compromise. What is more, the overwhelming majority of MEPs have a very calm and rational view of Brexit, recognising the need for cooperation and not hostility. I sincerely hope that the vote focuses the minds of negotiators, and that the European Parliament will be in a position to help drive more effective negotiations. This is how I will continue to represent the South-West, and this is the only way I can foresee a collegiate conclusion. Read More Devon loses prestigious yacht race to France thanks to Brexit \n“I want to stress that while I have always respected the democratic position of the British people, I have never agreed to silently acquiesce as our country heads towards a cliff edge, with no deal and a complete withdrawal – what Kenneth Clarke accurately called a calamitous act of national self-harm. The constituents of the South-West elected me to represent their best interests, not to preside over wanton economic self-harm. \n“I know many constituents do not agree with me but we still live in a democracy with the right to free speech. I cannot change my mind on an issue of such magnitude based on a party whip. I have always put my constituents and country first and will continue to do so. This does not make me undemocratic, indeed I believe I am doing my duty in protecting the interests of the 48%.” Like us on Facebook", "external_links": [], "published": "2017-10-09T23:13:00.000+03:00", "crawled": "2017-10-09T23:38:02.002+03:00", "highlightTitle": ""}