{"organizations": [], "uuid": "c59685bc1eda62d476d65342ea5c9795fe468a03", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13544519.ece/ALTERNATES/s1200/FILE-PHOTO-British-Airways-Announce-First-Quarter-Losses-of-6-Million-GBP.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/mps-concern-after-government-re-13812143", "country": "GB", "domain_rank": 21960, "title": "MPs' concern after Government re-opens Heathrow third runway consultation", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-25T19:48:00.000+03:00", "replies_count": 0, "uuid": "c59685bc1eda62d476d65342ea5c9795fe468a03"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/mps-concern-after-government-re-13812143", "ord_in_thread": 0, "title": "MPs' concern after Government re-opens Heathrow third runway consultation", "locations": [], "entities": {"persons": [{"name": "getty ima", "sentiment": "negative"}, {"name": "chris grayling", "sentiment": "none"}, {"name": "phil wilson", "sentiment": "none"}, {"name": "adonis", "sentiment": "none"}], "locations": [{"name": "virgin", "sentiment": "none"}, {"name": "heathrow", "sentiment": "none"}, {"name": "sedgefield", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "durham tees valley airport", "sentiment": "none"}, {"name": "newcastle international airport", "sentiment": "none"}, {"name": "gatwick", "sentiment": "none"}], "organizations": [{"name": "government", "sentiment": "negative"}, {"name": "british airways", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "department for transport", "sentiment": "none"}, {"name": "transport", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "A British Airways aircraft taxis past its rival carrier Virgin at Heathrow airport (Image: Getty Images) Share Get   \nNorth East MPs expressed dismay after the Government announced it was re-opening a public consultation into a third runway at Heathrow. \nThe consultation had closed in May - but will continue until December. \nNewcastle International Airport and Durham Tees Valley Airport have been urging Ministers to make a decision, and argue that a third runway at Heathrow would allow them to continue existing services and add new flights. \nMPs say expansion at Heathrow could generate more than 100,000 jobs nationally, including up to 5,000 jobs in the North East . \nSedgefield MP Phil Wilson said: “We need additional air capacity and I just want them to get on with it. \n“There’s been a lot of work gone into the Heathrow option. \n“My concern is that there always seems to be another reason for kicking it further down the road.” Read More Could bid to block Brexit lead to our EU departure never happening? \nTransport Secretary Chris Grayling said: “The case for expanding Heathrow is as strong as ever and we want to hear your views on it. This is an important consultation and I encourage everybody to get involved across the UK.” \nThe DfT insisted it is “on track” to publish final proposals for expansion in the first half of 2018 for a vote in Parliament. \nIf the scheme is approved by MPs, Heathrow will submit a planning application and consult with local communities on detailed proposals. Video Loading   \nThe airport hopes to begin construction in early 2021, with the runway completed by the end of 2025. \nBut although Ministers say they are still committed to expanding Heathrow, new papers published by the Department for Transport suggest that expanding Gatwick could be a better option. \nA new costs and benefits appraisal finds the net public value of a new Gatwick runway, taking into account the impact on the environment and benefits to passengers, is between £72.6bn and £74.4bn, while for Heathrow the benefits are between £67.8bn and £72.6bn. \nThe report said: “Gatwick expansion especially benefits from higher passenger benefits, while Heathrow expansion has relatively higher environmental disbenefits and a greater range of surface access costs. Read More A senior Government advisor has criticised the delay building Heathrow's third runway \n“Taken over the whole 60 year period, the LGW [Gatwick] Second Runway scheme could lead to greater monetised net public value.” \nLord Adonis, the Government’s top infrastructure adviser, condemned the failure to build a third runway at Heathrow in a speech earlier this month. \nHe said: “We have a proud history in this country of delivering world-class infrastructure – but for years funding has been squeezed, policy decisions have been erratic and the network is showing signs of age and strain. \n“The endless delay to a Parliamentary decision on Heathrow is a case in point – and perhaps the most serious infrastructure failure of all.” Like us on Facebook", "external_links": [], "published": "2017-10-25T19:48:00.000+03:00", "crawled": "2017-10-25T20:18:46.012+03:00", "highlightTitle": ""}