{"organizations": [], "uuid": "01a70a78ec4ede0d15c0a6d5e5666849514baab5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article11556603.ece/ALTERNATES/s1200/JS93951432.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/north-east-missing-out-due-13796225", "country": "GB", "domain_rank": 21960, "title": "Is the North East missing out due to lack of local 'voices' in Government?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-23T07:00:00.000+03:00", "replies_count": 0, "uuid": "01a70a78ec4ede0d15c0a6d5e5666849514baab5"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/north-east-missing-out-due-13796225", "ord_in_thread": 0, "title": "Is the North East missing out due to lack of local 'voices' in Government?", "locations": [], "entities": {"persons": [{"name": "david davis", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "nick brown", "sentiment": "none"}, {"name": "peter bould", "sentiment": "none"}, {"name": "david cameron", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "ian lavery", "sentiment": "none"}, {"name": "seema kennedy", "sentiment": "none"}, {"name": "bould", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "anne-marie trevelyan", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "rishi sunak", "sentiment": "none"}, {"name": "andy mcdonald", "sentiment": "none"}, {"name": "guy opperman", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "north west", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "yorkshire", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "south ribble", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}], "organizations": [{"name": "cabinet", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "shadow cabinet", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}, {"name": "howden", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "universal credit", "sentiment": "none"}, {"name": "middlesbrough", "sentiment": "none"}, {"name": "shadow transport", "sentiment": "none"}, {"name": "hexham", "sentiment": "none"}, {"name": "yorkshire conservative", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "cabinet office", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Is the North East missing out due to lack of local 'voices' in Government? A North think tank has warned that the needs of the region's constituents and businesses must be heard at the highest level of government Share Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nConcerns have been raised over the lack of North East “voices” in Government - and opposition. \nLabour leader Jeremy Corbyn has been accused of packing out his Shadow Cabinet with London MPs. \nBut is it really Conservative leader Theresa May who is guilty of ignoring talented northern politicians? \nThink tank Policy North today warned that the Cabinet needs more northern voices. \nAnd it points out that of the current 28 Cabinet attendees, only Brexit Secretary David Davis holds a northern constituency - Haltemprice and Howden in the East Riding of Yorkshire. \nPolicy North director Peter Bould said: “There is a strong case for more northern constituencies to be represented around the Cabinet table and it’s not simply about making up the numbers.” \nAlthough there are a number of London MPs in the Shadow Cabinet, Mr Corbyn has also appointed North East politicians to top positions including Newcastle MP Nick Brown, Labour’s Chief Whip, Wansbeck MP Ian Lavery, the party chair and Minister for the Cabinet Office, and Middlesbrough MP Andy McDonald, the Shadow Transport Secretary. \nBy contrast, there are no North East MPs in the Cabinet. \nAnd Mrs May does have some strong candidates to choose from, according to Policy North. \nThe think tank points out that Conservative Anne-Marie Trevelyan, MP for Berwick-upon-Tweed in Northumberland, fought a 10-year campaign to dual the A1 - which succeeded, with work set to begin in 2020 and investment of almost £300 million agreed. \nAnd it says fellow Northumberland MP Guy Opperman, a pensions minister who represents Hexham, has succeeded in getting the pensions industry onside as he oversees a series of reforms. Read More MPs voted unanimously to pause Universal Credit but the Government plans to ignore them \nMr Bould said: “Theresa May needs to exert her authority and freshen up the face of the Conservative Party, just as David Cameron had to do a decade ago.” \nHe added: “The North voted overwhelmingly for Brexit and denied Theresa May a majority at this year’s election with a string of target seats in the North that failed to turn blue. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \n“Theresa May is leading a One Nation, Brexit government and the Conservatives need to make serious inroads into the North if they are ever to have a majority again. That means listening to the North. \n“And there are numerous rising stars to pick from.” \nOther potential high-fliers include Yorkshire Conservative MP Rishi Sunak, according to Policy North. Read More Theresa May tells EU citizens in UK: 'We want you to stay after Brexit' \nAnd others include North West MP Seema Kennedy, a successful business woman now championing small businesses in South Ribble. \nMr Bould said: “The North deserves better representation around the Cabinet table so that the needs of businesses and constituents in the North can be heard at the highest level.” Like us on Facebook ", "external_links": [], "published": "2017-10-23T07:00:00.000+03:00", "crawled": "2017-10-23T07:58:28.000+03:00", "highlightTitle": ""}