{"organizations": [], "uuid": "6c7140519ebe05f80ab8104d6581773bf4080196", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article12083441.ece/ALTERNATES/s1200/JS94470008.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-manufacturers-suffer-profits-13816640", "country": "GB", "domain_rank": 21960, "title": "North East manufacturers suffer profits fall due to exchange rate woes", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-26T18:15:00.000+03:00", "replies_count": 0, "uuid": "6c7140519ebe05f80ab8104d6581773bf4080196"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-manufacturers-suffer-profits-13816640", "ord_in_thread": 0, "title": "North East manufacturers suffer profits fall due to exchange rate woes", "locations": [], "entities": {"persons": [{"name": "michael nelson", "sentiment": "none"}, {"name": "gestamp", "sentiment": "none"}, {"name": "jonathan walker", "sentiment": "none"}], "locations": [{"name": "newton aycliffe", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}, {"name": "north east england", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "north east england chamber of commerce", "sentiment": "none"}, {"name": "husqvarna", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "gestamp tallent", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "multichem", "sentiment": "none"}, {"name": "chamber of commerce", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business North East manufacturers suffer profits fall due to exchange rate woes Two major businesses in the region have seen their profits shrink despite adding over £40m each to their turnover Share Click to play Tap to play The video will start in 8 Cancel Play now Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe full impact of the falling pound on North East manufacturers has been laid bare after one of the region’s largest companies fell into the red despite adding more than £40m to its turnover. \nThe results at automotive firm Gestamp Tallent mirror a similar picture at lawnmower manufacturer Husqvarna, both of whom are based in Newton Aycliffe , County Durham, and source many of their parts from abroad. \nGestamp, which employs more than 2,400 people, recorded a loss of £15.8m - its first loss since 2009 - even though it had seen turnover increase £49m to £517.6m. \nBusiness leaders are now calling on the Government to provide more clarity surrounding Brexit negotiations as unpredictable exchange rates cause huge problems for firms operating in overseas markets. Jonathan Walker, head of policy and campaigns, North East England Chamber of Commerce (Image: Handout) \nJonathan Walker, head of policy and campaigns at the North East England Chamber of Commerce , said: “Our recent Quarterly Economic Survey shows members concerns about exchange rates have increased significantly in recent months. \n“The weakening of the pound against the euro has made our exports more competitive but it has harmed those that import goods or components. Read More County Durham firm Husqvarna adds £43m to turnover - but sees profits fall \n“It is becoming increasingly imperative the Government provides reassurance to those trading internationally by pressing ahead with Brexit negotiations and providing clarity on future trading arrangements as soon as possible.” \nIn its accounts for 2016, Gestamp said the loss was caused by “large fluctuations in the euro exchange rate” which “led to increases costs from revaluation of loans”. In total Gestamp’s operating costs rose by £78.9m. \nHundreds of investors buy Newcastle student flats in £3m crowdfunding first \nThe two firms are not the only businesses in the region to be affected by increased material costs and the weak value of the pound. Ink manufacturer Multichem has also noticed the impact unfavourable exchange rates have had on its business. \nMichael Nelson, managing director at the Hexham-based firm, said: “We are finding exchange rates, due to the Brexit situation, are affecting our business at present. Our raw materials are imported and there can be price differentiations with the exchange rates changing. \n“On the other hand, some of our customers watch these rates and ask for a price improvement if they see we are benefiting from any fluctuation. \n“There are however, businesses who do understand the situation we find ourselves in at present and are working with us to achieve both price and cash flow stability.” Like us on Facebook", "external_links": [], "published": "2017-10-26T18:15:00.000+03:00", "crawled": "2017-10-26T19:19:44.004+03:00", "highlightTitle": ""}