{"organizations": [], "uuid": "894cf985506c46ee9f3ec9c51e2c1c3e0467c733", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://i2.devonlive.com/incoming/article592911.ece/ALTERNATES/s1200/Untitled-design-52.png", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "devonlive - frontpage", "url": "http://www.devonlive.com/news/devon-news/pm-theresa-refuses-say-anne-592901", "country": "GB", "title": "PM Theresa May refuses to say if Anne Marie Morris can return to the Conservative Party", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-07T13:34:00.000+03:00", "replies_count": 0, "uuid": "894cf985506c46ee9f3ec9c51e2c1c3e0467c733"}, "author": "Daniel Clark", "url": "http://www.devonlive.com/news/devon-news/pm-theresa-refuses-say-anne-592901", "ord_in_thread": 0, "title": "PM Theresa May refuses to say if Anne Marie Morris can return to the Conservative Party", "locations": [], "entities": {"persons": [{"name": "anne marie morris", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "david wood", "sentiment": "none"}, {"name": "newton abbot", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "cllr john hart", "sentiment": "none"}, {"name": "morris", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "south devon", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "itv", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}, {"name": "newton abbot conservatives", "sentiment": "none"}, {"name": "devon county council", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PM Theresa May refuses to say if Anne Marie Morris can return to the Conservative Party The Newton Abbot MP is suspended from the party after she used the n-word Share Anne Marie Morris (left) and Theresa May (right) Share Comments \nPrime Minister Theresa May dodged answering questions this week as to if or when Newton Abbot MP Anne Marie Morris will be allowed back into the Conservative Party. \nMs Morris, who has been the MP for Newton Abbot since 2010, described the UK leaving the EU without a deal as a “real n r in the woodpile” at the launch of a report into the future for the UK’s financial sector after Brexit. \nShe apologised for the remarks, saying: “The comment was unintentional and I apologise unreservedly for any offence caused.” Read More \nBut she has had the whip suspended by her party, which means that although she is still an MP, she is no longer a Conservative MP. Anne Marie Morris MP \nMrs May, who faces questions about her own leadership, refused to answer the question as to whether Ms Morris would be allowed made into the Conservative Party in the future when she was asked explicitly by ITV’s Political Correspondent David Wood at her party's annual conference in Manchester. \nShe said: “You know why we took the decision that we did and she is suspended, and obviously from time to time we will look at the situation. \n“We have suspended her because what she said was wrong and it was inappropriate for her to say what she said. \n“I was concerned when I heard about the remarks which is why I took the action I did.” Read More \nBut when asked whether as an elected official she could return to the Conservative Party after using the language that she did, the Prime Minister reiterated that the Newton Abbot MP is 'suspended'. Anne Marie Morris MP \nNewton Abbot Conservatives have backed Ms Morris and said that although her remarks were inappropriate, they won’t be calling for her resignation, although Cllr John Hart, the Conservative leader of Devon County Council did say that she needed to ‘consider her position’ as a result of her comments. \nAnne Marie Morris' office said: \"The suspension remains in place. The length of the suspension remains a matter for the party. As the situation has not changed we have got no further comment at this time.\" Read More We've won our fight to save train services to South Devon - but there are more battles ahead \nIt is unclear as to whether the MP attended the Conservative Party conference this week as there were no reports on Twitter of sightings of her and her office have not responded to a request asking if she did or was allowed to attend. Like us on Facebook ", "external_links": [], "published": "2017-10-07T13:34:00.000+03:00", "crawled": "2017-10-07T13:56:15.039+03:00", "highlightTitle": ""}