{"organizations": [], "uuid": "f028b7752ca9d25b7bbf62dd4697957a3771ef34", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/news/article680097.ece/ALTERNATES/s1200/Capture.png", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/news/tory-mp-asking-brexit-information-679746", "country": "US", "domain_rank": 48128, "title": "Tory MP asking for Brexit information told 'pay £9k like everyone else' by DMU lecturer - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.914, "site_type": "news", "published": "2017-10-25T19:53:00.000+03:00", "replies_count": 0, "uuid": "f028b7752ca9d25b7bbf62dd4697957a3771ef34"}, "author": "Jacob Jarvis", "url": "http://www.leicestermercury.co.uk/news/tory-mp-asking-brexit-information-679746", "ord_in_thread": 0, "title": "Tory MP asking for Brexit information told 'pay £9k like everyone else' by DMU lecturer - Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "ben whitham", "sentiment": "none"}, {"name": "chris heaton-harris", "sentiment": "none"}, {"name": "david green", "sentiment": "none"}, {"name": "dr ben whitham", "sentiment": "none"}, {"name": "whitham", "sentiment": "none"}, {"name": "jo johnson", "sentiment": "none"}, {"name": "heaton-harris", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "dmu", "sentiment": "negative"}, {"name": "leicester mercury tory", "sentiment": "negative"}, {"name": "de montfort university", "sentiment": "none"}, {"name": "house of commons-headed", "sentiment": "none"}, {"name": "university of worcester", "sentiment": "none"}, {"name": "freedom of information", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Tory MP asking for Brexit information told 'pay £9k like everyone else' by DMU lecturer The academic said he found some of the request 'disturbing' Share Click to play Tap to play The video will start in 8 Cancel Play now Comments \nA De Montfort University lecturer has told a Tory politician who requested details of lectures on Brexit to “pay £9,000 a year like everyone else’’ if he wants the information. \nDr Ben Whitham responded to the MP for Daventry, Chris Heaton-Harris, after he wrote to vice-chancellors nationwide asking for details on “the teaching of European affairs and Brexit’’. \nIn a tweet, the international relations lecturer, said: “Of course you can access my recorded lectures @chhcalling (Chris Heaton-Harris). Just enrol and pay the £9,000 per year your party deems fair, like everyone else.” \nMr Heaton-Harris’ letter, on House of Commons-headed paper, asked for “names of professors involved in teaching European affairs”, adding: “If I could be provided with a copy of the syllabus and links to the online lectures which relate to this area I would be much obliged.” Undated handout photo issued by the University of Worcester of a letter by Chris Heaton-Harris to Professor David Green, Vice Chancellor at the university where the Conservative MP requested the names of professors teaching about Brexit. \nDr Whitham’s post has now been retweeted more than 8,000 times and liked about 19,000 times. \nExplaining his reasoning, he said: “When I saw the letter my feeling was that the language of the request was quite sinister. Particularly asking for a list of lecturers. I found it quite disturbing. \n“But what I also thought some of what he was asking for, our students have access to, but they’re paying £9,000 a year.” DMU international relations lecturer Dr Ben Whitham \nHowever, he said if Mr Heaton-Harris were to submit a formal request through the Freedom of Information Act he would react appropriately. \n“One or two have suggested that I’m funded partly by the government and that I should therefore be willing to give my information. \n“Of course if he [Mr Heaton-Harris] wants to send a Freedom of Information request he’s allowed to do that and that will be done properly,” he added. Read More \nCommenting on the recent excuse for Mr Heaton-Harris’ letter being part of research for a book on attitudes towards Europe, Dr Whitham said it was “incredibly lazy” and “quite rude”. \nUniversities minister Jo Johnson has said the correspondence “probably” should not have been sent. Read More ", "external_links": [], "published": "2017-10-25T19:53:00.000+03:00", "crawled": "2017-10-26T05:16:33.010+03:00", "highlightTitle": ""}