{"organizations": [], "uuid": "577676a034679acbd386ab679dd18efa628a679f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13198770.ece/ALTERNATES/s1200/IMG_4061-1JPG.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/local-news/north-east-news-live-latest-13798087", "country": "GB", "domain_rank": 21960, "title": "North East news LIVE: Latest breaking news, sport, weather, traffic and travel", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-23T08:33:00.000+03:00", "replies_count": 0, "uuid": "577676a034679acbd386ab679dd18efa628a679f"}, "author": "Tom Eden", "url": "http://www.chroniclelive.co.uk/news/local-news/north-east-news-live-latest-13798087", "ord_in_thread": 0, "title": "North East news LIVE: Latest breaking news, sport, weather, traffic and travel", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tom Eden Diabetic hits out over NHS refusal to fund testing system \nA retired police officer has hit out at health bosses for refusing to fund a device that could “save diabetics a lot of pain and the NHS a lot of money”. \nFor more than 30 years Andrew Mills has had to test his blood glucose levels several times a day using the traditional “fingerprick method”. \nThe 59-year-old, from Holywell, Northumberland , said he was “full of hope” when the NHS approved a new system that spared painful procedure and gave diabetics much more information about their levels. \nBut Mr Mills was outraged to hear that a decision to use the device, called the Freestyle Libre, would be left to his local clinical commissioning group (CCG) - and they said they would only fund it for “particular groups of patients”. \nNHS Northumberland CCG says this includes pregnant women with dangerous hypoglycaemia and people with “dangerously erratic glucose levels”. \nAndrew was diagnosed with Type 1 diabetes in 1984, when he was 26-years-old and a serving officer with Northumbria Police. \nFor decades he has had to check his blood glucose levels using the fingerprick method, which involves pricking the fingertip, squeezing a drop of blood onto a test strip and feeding it into a meter which then gives a reading. \nAndrew said: \n“It’s very painful. It makes your fingers sore and it doesn’t get any easier. \n“If you ask any diabetic they’ll tell you the worst thing is fingerpricking.” NUFC Takeover Tom Eden PCP Capital Partners cast an eye on Crystal Palace game \nNewcastle United will continue talks with Amanda Staveley and her PCP Capital Partners group this week. (Image: AFP) \nStaveley did not attend the Magpies’ 1-0 win over Crystal Palace on Saturday but it is believed she never had any plans to do so with the discussions between PCP Capital Partners and United’s hierarchy now well underway. \nOwner Mike Ashley , not a frequent visitor to St James’ Park on match days these days, was also not in the stands against the Eagles and Staveley’s non-appearance is not deemed relevant as far as the takeover bid is concerned. \nAnd while the financier - who is leading a group valued at £29billion - was not at the game, it has emerged that somebody from the group WAS in attendance on a watching brief at St James’ Park. \nIt is expected that this process could go on for up to a month before PCP decide whether or not to put in a formal offer. Politics Tom Eden 'Time to get on with discussing Brexit deal' \nBoris Johnson has urged European leaders to press ahead with Brexit negotiations as British businesses stressed the need for a transition deal to be agreed as quickly as possible. (Image: PA) \nThe Foreign Secretary said “now is the time to get on with it” after last week’s European Council summit agreed to the 27 remaining EU members beginning internal preparations for the next phase of talks, which will cover trading arrangements and a possible transitional phase. \nHe said that if both sides “think very creatively and very positively” then a deal can benefit people and businesses on both sides of the English Channel. \nHis comments came after a draft letter intended for Brexit Secretary David Davis showed that five of Britain’s biggest business lobby groups have stressed the need for an early deal on post-March 2019 arrangements, warning that firms are preparing to make “serious decisions” with consequences for jobs and investment early next year. \nThey called for the transition period to match as closely as possible current trading arrangements with the European Union. \nWith difficulties in negotiations focused on the financial settlement - the so-called divorce bill - Mr Johnson said the UK had made Brussels a “pretty good offer” in Theresa May’s major speech in Florence. 09:49 What it's like for women in the fire brigade \nFemale firefighters are fighting back. \nFed up with sexist attitudes, they are taking matters into their own hands. Firefighter Jade Makarski from Tyne and Wear Fire and Rescue Service (Image: Newcastle Chronicle) \nThe London Fire Brigade has made headlines over recent days for their new campaign #firefightingsexism, demanding a halt to calling firefighters ‘firemen’. \nAnd Tyne and Wear Fire and Rescue Service (TWFRS) are supporting them all the way. \nJade Makarski has been a firefighter for nine years, and works at West Denton Community Fire Station. \nShe finds comments on whether women are able to be firefighters wrong, as well as disrespectful. \n“It is a little bit insulting, but it’s very incorrect. I’d say it’s offensive when you’re doing the same job and you’re both firefighters. \n“I generally find that the public are confused - I’ve turned out to jobs before and they’ve said ‘are you like a firelady?’” 09:31 More than one million potholes reported \nMore than one million potholes were reported to councils last year, according to new research. \nA study for insurance firm Confused.com also revealed that councils paid £3.1 million in compensation to drivers whose vehicles were damaged by poor road surfaces in 2016. \nLocal authorities spent an additional £104 million repairing potholes. \nThe figures were obtained following Freedom of Information requests to 412 local authorities. \nThe website calculated that the UK’s potholes have a total depth of more than 24 miles, which is almost four times deeper than the Pacific Ocean. \nA survey of 2,000 motorists found that one in three (33%) have suffered damage to their vehicles due to poor road surfaces, including tyres and suspension problems. \nWiltshire Council made the biggest pay-outs to pothole victims at £508,000 last year.The cost of repair varies between areas, with Westminster City Council forking out the most per pothole at £2,400. 09:28 Tom Eden TUC calls for devolution to bride North/South divide \nPower should be devolved to workers and local communities to help bridge a “great regional divide” on jobs, a new report urges. Frances O'Grady at the Liberal Democrat Conference 2016 in Brighton \nA study by the TUC found that Britain was “riven” with inequalities, with men’s pay in older industrial areas £200 a month below the national average. \nChildren in the North East are twice as likely to live in workless households compared to the South East, while two-thirds of the jobs created in the North East since 2011 have been insecure forms of work such as zero-hour contracts, research showed. \nThere were also inequalities within areas, said the report, adding that despite the overall wealth of London, 27% of people in the capital live in poverty. \nThe inequalities are the result of failing economic policy and too much power resting with central government, rather than workers and local communities, said the TUC. \nIts report, Great jobs In Great Places, highlights how central government is responsible for 72% of all public expenditure in the UK, compared to 35% in France and 19% in Germany. \nTUC general secretary Frances O’Grady said: \n“Too many people in Britain have been left behind. Whole communities have been abandoned for a generation without the investment they need to build a strong local economy. It has left millions of people stuck in dead-end jobs that don’t pay a decent wage. \n“In the places we looked at, there was no shortage of opportunities to create stronger industries and great jobs, but to unlock the potential of every part of the UK, we need to change how the economy works. That means devolving power and funding back to working people and their local communities. \n“The Government has talked a lot about industrial strategy. We need new investment to bring infrastructure, skills and great jobs to the parts of the country that need them most.” 09:09 Tom Eden Got a story? \nWhen the recovery of a white van is the best I can muster, it’s probably time to appeal again for stories. \nKnow of anything happening? Got something we should cover? \nGet in touch:", "external_links": [], "published": "2017-10-23T08:33:00.000+03:00", "crawled": "2017-10-23T09:15:49.006+03:00", "highlightTitle": ""}