{"organizations": [], "uuid": "4649294e960fe0b3557ced69940fcd146189cf5c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13779656.ece/ALTERNATES/s1200/AGP_MDM_250917LABOUR_023.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/labour-really-block-no-deal-13779609", "country": "GB", "domain_rank": 21960, "title": "Will Labour really block a 'no-deal' Brexit if that's the only one on offer?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-18T23:00:00.000+03:00", "replies_count": 0, "uuid": "4649294e960fe0b3557ced69940fcd146189cf5c"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/labour-really-block-no-deal-13779609", "ord_in_thread": 0, "title": "Will Labour really block a 'no-deal' Brexit if that's the only one on offer?", "locations": [], "entities": {"persons": [{"name": "marr", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "amber rudd", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "john mcdonnell", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "oxfordshire", "sentiment": "none"}, {"name": "derbyshire", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "west midlands", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "negative"}, {"name": "eu", "sentiment": "negative"}, {"name": "jaguar land rover", "sentiment": "none"}, {"name": "pa)  labour", "sentiment": "none"}, {"name": "bbc", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "toyota", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "nissan qashqai", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "houses of parliament", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nWhat exactly happens if the UK fails to agree a deal with the EU? \nLabour has said it will oppose a “no-deal” Brexit . \nBut that may be the only type of Brexit on offer. So the question is, could Labour actually oppose quitting the EU when the time comes? And if so, could this mean Brexit doesn’t happen or, at least, is delayed? \nWe know that Brexit is due to take place in March 2019. John McDonnell MP (Image: Daily Mirror) \nThat’s because the UK officially announced our intention to leave, by triggering Article 50 of the Lisbon Treaty, in March 2017. And under the terms of the Treaty, we’re supposed to go within two years. \nBut the assumption has always been that there would be a new trade deal in place by this time, as well as an agreement on things like the rights of EU citizens living in the UK. \nThe official position of the Government is that we’ll quit the EU without a deal if we have to. Theresa May has said that “no deal is better than a bad deal”. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nBut that’s a negotiating position designed to put pressure on the EU. Mrs May has also said repeatedly that the aim is to get a deal. \nThe trouble is that negotiations are not going well. A “no-deal” Brexit increasingly looks like a real possibility. \nAs a country, we’re having to think about what quitting the EU without a trade and customs deal in place would actually mean. \nAnd it wouldn’t be good. There’s the possibility of trade tariffs - charges on UK goods being sold in EU countries - but also the issue of customs controls being introduced between the UK and the EU. \nThese would lead to delays on goods being transported across borders, and that would be a disaster for UK manufacturers, which employ 2.7 million people. \nCarmaker Nissan , for example, says it has enough car parts in storage at any given time to keep its Sunderland factory operating for about half a day. Nissan Qashqai (Image: Handout) \nIt gets through five million parts a day producing vehicles, and depends on them arriving at the plant on a reliable basis. \nThis just won’t happen if containers coming into the UK are liable to be held up by customs officials. \nIt’s possible to imagine a world where businesses behaved differently. They could source their parts from UK suppliers, or maybe build some more warehouses and keep more parts in storage. \nBut this is wishful thinking. UK-based manufacturers compete successfully with rivals across the world and account for 45% of UK exports, but they do so because they have developed cost-efficient ways of working. Read More North East could lose four MPs in shake-up - with some of Newcastle becoming Gateshead \nMany large manufacturers have complex supply chains. They require specialist items which a limited number of firms - sometimes small engineering businesses - are able to make. \nFinding these businesses and building relationships with them is a major achievement, and not something that can be replicated easily. \nSo can we really leave the EU without a deal? Can we instruct firms like Nissan in the North East, Jaguar Land Rover in the West Midlands, Toyota in Derbyshire or Mini in Oxfordshire to transform the way they operate? \nAmber Rudd, the Home Secretary, told a Commons inquiry this week that it was “unthinkable” there would be no deal. \nBut some MPs are thinking about it. An anti-Brexit protester waves an EU flag outside the Houses of Parliament (Image: PA) \nLabour says it backs Brexit - but also that it won’t support leaving the EU without a deal. This is intended as a criticism of Theresa May’s position, but it also raises a difficult question for Labour leader Jeremy Corbyn which he may eventually have to face. \nIt may become clear well before March 2019 that a no-deal Brexit is the only one on offer. In that case, what will Labour do? \nA complicating factor is that it’s not clear whether Parliament will actually get a vote on leaving the EU without a deal. \nBut Labour wants to change that, by amending the European Union (Withdrawal Bill), currently making its way through the Commons, to ensure a vote takes place. Read More Could bid to block Brexit lead to our EU departure never happening? \nShadow Chancellor John McDonnell told the BBC’s Marr Show on Sunday that Labour was in talks with Conservative MPs about changing the legislation. \nHe said: “When we amend the legislation, which I think we will, I think there’s a majority to do that, to have a meaningful vote is what we’ve said all the way along, we’ll be able to say to government whatever you’re negotiating it will not be on the basis of no deal because the damage to this economy will be so great.” \nIf Labour does succeed in changing the legislation - which would require a few Tory rebels to join the opposition parties in backing the change - then Parliament will have the option of rejecting a “no-deal” Brexit. \nTheoretically, this could mean Ministers were instructed to go back to the EU and try a bit harder to negotiate an agreement. \nBut that’s easier said than done. After all, they do want a deal now. They’re just finding it hard to get one. \nThe logic of Labour’s position is that it could end up blocking Brexit, or at least ensuring the UK misses the March 2019 deadline. Like us on Facebook", "external_links": [], "published": "2017-10-18T23:00:00.000+03:00", "crawled": "2017-10-18T23:42:50.000+03:00", "highlightTitle": ""}