{"organizations": [], "uuid": "831454d033c909f8ea28119dc6dfdf96f046a63b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://i2.devonlive.com/incoming/article586459.ece/ALTERNATES/s1200/anna-2PNG.png", "site_section": "http://www.devonlive.com/rss.xml", "section_title": "devonlive - frontpage", "url": "http://www.devonlive.com/news/devon-news/devon-woman-named-worlds-best-586368", "country": "US", "title": "Devon woman named as the world's best yoghurt producer", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-06T12:02:00.000+03:00", "replies_count": 0, "uuid": "831454d033c909f8ea28119dc6dfdf96f046a63b"}, "author": "devonlive", "url": "http://www.devonlive.com/news/devon-news/devon-woman-named-worlds-best-586368", "ord_in_thread": 0, "title": "Devon woman named as the world's best yoghurt producer", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Devon woman named as the world's best yoghurt producer Post-grad student helps Langage Farm make luxury flavours for Aldi, securing lucrative contract and creating jobs Share Click to play Tap to play The video will start in 8 Cancel Play now Comments \nAfter helping Langage Farm to secure a multi-million pound deal with a supermarket chain, a Devon woman has been hailed as the best in the world. \nThe dairy food producer, more famous for its ice cream, is now pumping out top-quality yoghurts in glass jars for supermarket giant Aldi. \nIt has meant up to 20 jobs are being created at the firm’s factory with turnover expected to jump by up to £2m. \nAnd much of the success of the Specially Selected Farmhouse Yogurts range is being laid at the door of Anna Tatkiewicz, a food science masters graduate who worked with the Smithaleigh-based firm for 18 months to create the mouthwatering yoghurts. Anna Tatkiewicz has helped create a yoghurt 'to die for' \nMs Tatkiewicz, an expert in psychodietetics and biotechnology, joined the firm under a Knowledge Transfer Partnership (KTP) from the University of Plymouth and worked on what Langage Farm managing director Paul Winterton called “a yoghurt to die for”. \nAnd he said: “We gave her the brief and said we’d make her the best yoghurt producer in the world.” Read More Clear night for Devon's spectacular Harvest Moon pictures \nHe said Polish-born Ms Tatkiewicz, who has also studied at the universities of Warsaw and Madrid, has since gone on to star at a diary industry conference in Turkey. \nAnd she was a key part in the firm’s mission to “get the best possible yoghurt to market.” \n“It’s not been easy,” Mr Winterton said. “Its’ been challenging and we have been working long and hard, but we have now made an amazing yoghurt. \n“They are to die for, you won’t taste a yoghurt like it.” Langage Farm's new yoghurts come in jars \nLangage Farm is now producing an average of 60,000 jars of yoghurts a week in four flavours: blood orange and cranberry, beetroot and apple, raspberry and lemon curd. \nAnd the firm estimates that will rise to 120,000 units a week within 18 months. \nThat’s because Langage Farm is also launching its own brand of glass-jar yoghurts, and will be producing for another national retailer from November 2017. Read More Homelessness in Devon could be set to reach record highs \n“We have six or seven different flavours that will come out over the next year or so,” Mr Winterton said. \n“We’re proud to use 100 per cent British milk in our produce from our herd of over 250 Jersey and Guernsey cows who roam freely in the beautiful Devonshire countryside.” \nLangage Farm invested up to £450,000 in installing special machinery to produce up to 4,000 units an hour. \nIt also meant the firm has taken on five extra staff – and is looking for another six. Anna Tatkiewicz studied at the University of Plymouth but worked at Langage Farm \n“And over the next 12 months we will create another 10 jobs,” Mr Winterton said. \nHe said the Aldi contract is expected to boost turnover by £1.5million to £2million – which should push annual sales to up to £5.5million. \n“Yoghurt will be a big piece of the business,” Mr Winterton said. \nHe explained how the yoghurt contract had been a boon following “a difficult couple of years for the dairy industry”. Read More Devon hospitals will work together to cut your waiting times \nCommodity and milk prices have risen, some of this due to the Brexit effect on sterling. \n“The cost of production is going up,” Mr Winterton said. “Brexit has effected commodity markets in Europe, feed prices are going through the roof, and plastic products.” \nMr Winterton said the new yoghurts could not have been made without the support of Aldi and the University of Plymouth. \n“Aldi have been extremely supportive, true partners,” Mr Winterton said. “And our collaboration with the university has been incredible.” Paul Winterton, managing director at Langage Farm \nAldi is now selling the Specially Selected range nationwide, for 69p for a 140g jar. \nThe supermarket described the flavours as ranging from “classic to adventurous” and stressed they are made with British milk, and come in a “beautiful, re-useable, glass jar”. \nJulie Ashfield, joint managing director of corporate buying at Aldi, said: “The Specially Selected Farmhouse Yogurts are our most luxurious yet. \n“We’re proud to be supporting UK, family run businesses such as Langage Farm, to bring our customers the very best of British.” Like us on Facebook", "external_links": [], "published": "2017-10-06T12:02:00.000+03:00", "crawled": "2017-10-06T12:10:23.000+03:00", "highlightTitle": ""}