{"organizations": [], "uuid": "a2d57275b44a7a77fa10769f3f01d14081d7debc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://i4.devonlive.com/incoming/article563709.ece/ALTERNATES/s1200/Beachy-Head.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "devonlive - frontpage", "url": "http://www.devonlive.com/news/devon-news/ukip-like-hard-landing-much-563698", "country": "GB", "title": "If UKIP like a hard landing so much maybe they should jump off a cliff", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-02T14:13:00.000+03:00", "replies_count": 0, "uuid": "a2d57275b44a7a77fa10769f3f01d14081d7debc"}, "author": "Keith Rossiter", "url": "http://www.devonlive.com/news/devon-news/ukip-like-hard-landing-much-563698", "ord_in_thread": 0, "title": "If UKIP like a hard landing so much maybe they should jump off a cliff", "locations": [], "entities": {"persons": [{"name": "michael gove the president-elect", "sentiment": "none"}, {"name": "gerard batten", "sentiment": "none"}, {"name": "ukip brexit", "sentiment": "none"}, {"name": "batten", "sentiment": "none"}, {"name": "winston churchill", "sentiment": "none"}, {"name": "bush", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "boris johnson", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "belfast", "sentiment": "none"}, {"name": "torquay", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "florence", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "ukip", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "boeing", "sentiment": "none"}, {"name": "us department of commerce", "sentiment": "none"}, {"name": "world trade organisation", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News opinion If UKIP like a hard landing so much maybe they should jump off a cliff Anyone who still thinks that life outside the EU is going to be a stroll towards 'sunlit uplands' should be having a rethink Share Click to play Tap to play The video will start in 8 Cancel Play now Comments \nWe all dream of Winston Churchill’s “sunlit uplands”, but rarely reach them. \nAnyone who still thinks that life outside the EU is going to be a stroll towards those uplands should be having a rethink after last week’s Bombardier bombshell. \nEgged on by Boeing, the US Department of Commerce has proposed a 220% tariff on the sale of the Canadian company’s new C Series jets. \nThe aircraft’s wings are made in Belfast, where 4,000 jobs depend on the deal. \nThe Americans! Our cousins. What about the Special Relationship? \nIn January Boris Johnson, the Foreign Secretary, rushed off to Washington to embrace the about-to-be inaugurated President Trump. In a video shot during his visit he said Britain was “first in line” to do a free trade deal with the new US government. \nTheresa May also welcomed Mr Trump’s promise of a “quick” free trade deal, and in an interview with Michael Gove the President-elect said his administration would “work very hard” to get a trade deal “done quickly and done properly”. Read More Driver reported missing after taking... \nMr Trump has always made it clear that the United States is all he really cares about. And he is not the first. \nIn 2002-2003, President Bush imposed tariffs on steel, hitting British high-grade steel production, ignoring British pleas and even a World Trade Organisation ruling against it. \nEventually the Americans backed down. Why? Because Britain asked the EU to help, and Brussels – those wicked unelected bureaucrats – threatened tariffs against key goods such as oranges from Florida, a swing-state run by Bush’s brother. The EU can be our best friend on a very heartless world stage. Just as practically every city in the world wants to cash in on tourism (but usually can’t), every economy in the world wants a favourable trade deal. But there is a lot of foggy ground to cover before we reach the sunlit uplands – if we ever do. \nYet the impatient anti-EU party Ukip – yes, they’re still around – went into its national conference in Torquay at the weekend vowing that “the fight resumes”. Gerard Batten, the Ukip Brexit spokesman, condemned the Prime Minister’s Florence speech, and issued a call to arms. Read More Anti-racist and anti-fascist demo planned outside UKIP annual conference in Torquay \nYou can understand how this happens. Being made a political party’s spokesman on anything puffs up the ego a treat. \nWhen that party has lost its reason to be, such a spokesman will face a simple three-way choice: disappear into obscurity; join another party as a junior member; invent a bogeyman to bash. \nMr Batten has gone for the third option. \nThere is a lobby that is pushing for immediate Brexit, and hang the consequences. Many say we should simply have left on June 24 last year, not caring about everyone else. \nHowever, extricating ourselves from 40 years of partnership without crashing and burning will take time, care and not a little cash. \nIf Mr Batten’s chums don’t mind a hard landing, perhaps they would like to demonstrate what fun it can be by jumping off a cliff. Like us on Facebook ", "external_links": [], "published": "2017-10-02T14:13:00.000+03:00", "crawled": "2017-10-02T14:19:59.004+03:00", "highlightTitle": ""}