{"organizations": [], "uuid": "bf0b91d4bdf5a0fe9833406d3c584a55aef54c4b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://i1.devonlive.com/news/devon-news/article656867.ece/ALTERNATES/s1200/ECC_InternationalTrade_1.jpg", "site_section": "http://www.devonlive.com/rss.xml", "section_title": "devonlive - frontpage", "url": "http://www.devonlive.com/news/devon-news/exeter-bids-remain-leading-pack-656829", "country": "US", "title": "Exeter bids to remain in 'leading pack' of high-growth cities after Brexit", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-20T14:36:00.000+03:00", "replies_count": 0, "uuid": "bf0b91d4bdf5a0fe9833406d3c584a55aef54c4b"}, "author": "Phil Goodwin", "url": "http://www.devonlive.com/news/devon-news/exeter-bids-remain-leading-pack-656829", "ord_in_thread": 0, "title": "Exeter bids to remain in 'leading pack' of high-growth cities after Brexit", "locations": [], "entities": {"persons": [{"name": "trevor horne", "sentiment": "none"}, {"name": "ashwoods", "sentiment": "none"}, {"name": "joe walsh", "sentiment": "none"}, {"name": "iain gillam", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "victoria hatfield", "sentiment": "none"}, {"name": "cllr rachel sutton", "sentiment": "none"}, {"name": "iain", "sentiment": "none"}], "locations": [{"name": "exeter", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "aldershot", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "cambridge", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "ashwoods electric motors", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "exeter city council", "sentiment": "none"}, {"name": "department of international trade", "sentiment": "none"}, {"name": "oxford", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now Comments \nAn international trade event has been held in Exeter to show off the city’s facilities and thriving economy to potential customers worldwide. \nMore than 30 Exeter firms joined representatives from the Department of International Trade (DIT) and Exeter City Council to discuss the potential for new markets post-Brexit. \nIn recent years, Exeter has flourished and is part of the \"leading pack\" of cities that boast economies that have grown by at least one-fifth since 2011. The top five cities include Aldershot (32 per cent), Oxford (25 per cent), Cambridge (23 per cent), Exeter (20 per cent) and London (20 per cent). \nCllr Rachel Sutton, Lead Councillor for Economy at Exeter City Council said: “In recent years, we’ve seen considerable economic growth, particularly in our digital and technology sectors, and have some world class facilities on our doorstep, so the council will be working with businesses to ensure we stay in this ‘leading pack’. \n“Although the economy in Exeter is thriving, there are a number of challenges that the business landscape faces across the country that we must address to ensure that this upward trend continues. Victoria Hatfield presenting to the business community \n“Research has shown that, as a result of Brexit, Exeter will be the most affected area in the UK due to 70 per cent of our exports currently going to EU countries. \n\"However, with an increased number of fast-growth, highly productive businesses relocating to or starting up in Exeter, we are confident that the business community can continue to thrive.” Read More This is not “project fear”. It is project fact. \nTrevor Horne, International Trade Advisor for the DIT, who spoke at the event, said: “International trade is currently the single biggest discussion subject amongst the business community. \n“The DIT is responsible for promoting British trade across the world to ensure the UK takes advantage of all the opportunities available. There is some funding available to support eligible business costs, such as exploring new markets which can help to ensure economies continue to thrive.” \nExeter-based manufacturing and engineering firm Ashwoods Electric Motors is a prime example of how the international market is presenting opportunities for businesses in Exeter. They explained their journey to delegates at the event, with ambitious plans for expansion following their recent purchase of a new manufacturing facility on the outskirts of Exeter. \nAshwoods design and manufacture smaller, lighter and more efficient permanent magnet electric motors across a range of sectors including materials handling, off highway, automotive and marine. Project Manager, Iain Gillam, explained how importing and the cost of running their business will not be largely affected by Brexit, as commodities often come from outside the EU. \nIain said: “Committed to UK manufacture, Ashwoods was concerned that Britain’s decision to leave the EU would impact our export value, and we have noticed that equipment from outside the UK has recently increased in price. Trevor Horne from Department of International Trade \n“However, working closely with Innovate UK to develop new technologies and processes of working, we have found that customers based outside the UK are still keen to work with us, demonstrated by the fact we have recently secured contracts with US and European-based customers.” \nIn short, there has been no tangible effect on business for Ashwoods over the last year since the announcement that the UK is leaving the EU. The value of the pound has helped its products and services in the short-term to appear more attractive cost-wise than non-UK competitor products. Read More Exmouth's new watersports centre plans go on show on Saturday \nDespite Ashwoods remaining positive about the Brexit scenario, other businesses were concerned. It is predicted that when negotiations conclude businesses will be faced with additional paperwork and requirements when exporting goods through customs. \nThis was a particular worry for SFL Chimneys who currently operate on a just-in-time approach to exporting. Likewise, one of Exeter’s most prestigious manufacturers, Arconic, was also concerned about such hurdles, however Brexit may result in them moving more jobs back to head office thus positively impacting Exeter’s economy. \nExeter City Council will be hosting further Brexit focus groups on a quarterly basis. If your business would like to be involved in these please contact Joe Walsh via email: . \nThe event was organised by Invest in Exeter, Exeter City Council’s inward investment initiative. The team provides a co-ordinated, tailored relocation support and advice service for businesses relocating to or expanding in Exeter. \nFor more information about relocating a business to Exeter or about the opportunities available to businesses based in the city, visit www.investinexeter.co.uk or follow @investinExeter on Twitter. Like us on Facebook ", "external_links": [], "published": "2017-10-20T14:36:00.000+03:00", "crawled": "2017-10-20T15:21:01.003+03:00", "highlightTitle": ""}