{"organizations": [], "uuid": "5810fef056964a185e6cfe110381f32a2d2cb3ab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article12230438.ece/ALTERNATES/s1200/JS89388422.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13775241", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Amazon and eBay 'profiting from fraud', report claims", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-10-18T10:30:00.000+03:00", "replies_count": 0, "uuid": "5810fef056964a185e6cfe110381f32a2d2cb3ab"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13775241", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Amazon and eBay 'profiting from fraud', report claims", "locations": [], "entities": {"persons": [{"name": "foxtons", "sentiment": "none"}, {"name": "marc hardy", "sentiment": "none"}, {"name": "mead johnson", "sentiment": "none"}, {"name": "simon wallis", "sentiment": "none"}, {"name": "meg hillier", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "martin gannon", "sentiment": "none"}, {"name": "edward", "sentiment": "none"}], "locations": [{"name": "east wing", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "gateshead quays", "sentiment": "none"}, {"name": "matfen hall", "sentiment": "none"}, {"name": "great hall", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "atlanta", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "sage gateshead", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}, {"name": "morpeth", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "amazon", "sentiment": "negative"}, {"name": "coreena ford domino", "sentiment": "negative"}, {"name": "ebay", "sentiment": "negative"}, {"name": "foxtons", "sentiment": "none"}, {"name": "british hospitality association", "sentiment": "none"}, {"name": "coreena ford foxtons", "sentiment": "none"}, {"name": "metro radio arena", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "matfen hall", "sentiment": "none"}, {"name": "smg europe", "sentiment": "none"}, {"name": "coreena ford top northumberland", "sentiment": "none"}, {"name": "hmrc", "sentiment": "none"}, {"name": "coreena ford online", "sentiment": "none"}, {"name": "house of commons public accounts committee", "sentiment": "none"}, {"name": "reckitt benckiser", "sentiment": "none"}, {"name": "hok", "sentiment": "none"}, {"name": "barcelona", "sentiment": "none"}, {"name": "london stock exchange", "sentiment": "none"}, {"name": "royal town planning institute", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "coreena ford reckitt benckiser", "sentiment": "none"}, {"name": "hm customs", "sentiment": "none"}, {"name": "customs", "sentiment": "none"}, {"name": "reckitt", "sentiment": "none"}, {"name": "pac", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "mercedes-benz stadium", "sentiment": "none"}, {"name": "reckitt benckiser coreena ford flybe", "sentiment": "none"}, {"name": "gateshead council", "sentiment": "none"}, {"name": "northumbrian water", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford Domino's issues warning over Brexit skills gap fears \nDomino’s Pizza has issued a clarion call for young British staff amid fears that Brexit could starve the company of overseas workers. \nThe pizza delivery chain wants more team leadership training in the national curriculum to ensure it has a steady stream of home-grown managers once Britain exits the European Union. \nDomino’s, which employs around 35,000 staff across 1,000 stores, said around 50% of its managers in metropolitan areas come from outside the UK. \nThe move comes as the firm looks to roll out 600 more stores and create 21,000 jobs over the next few years. \nChief operating officer Simon Wallis said: “We have ambitious growth plans and believe Domino’s is a fun place to work with clear progression opportunities for ambitious school leavers with potential. \n“We’d like to see the national curriculum developing basic leadership skills, because our research revealed some concerning results with young people saying they’re ambitious, but lack exposure to positive role models.” \nThe British Hospitality Association said in April that the UK sector needed around 62,000 EU migrants every year if it is to maintain the status quo and drive growth. Domino’s is the latest firm to express concern over a potential Brexit skills gap, with Pret A Manger also looking to recruit more UK staff. \nThe sandwich chain revealed fears of a recruitment crisis in March because just one in 50 of its job applicants was British. \nAs part of its drive, Domino’s is launching an online leadership programme - TeamSkills - in a bid to encourage more young British people to seek management roles in the hospitality sector. Domino's Pizza fears Brexit could starve the company of overseas workers. (Image: PA) 9.15 Coreena Ford What's the FTSE and pound latest? \nThe pound at 9am was 1.3196 dollars compared to 1.3181 dollars at the previous close. The euro at 9am was 0.8924 pounds compared to 0.8917 pounds at the previous close. \nThe FTSE-100 index at 8:45am was unchanged at 7516.17. Screen displaying the FTSE 100 at the London Stock Exchange (Image: Yui Mok/PA Wire) 9.13 Coreena Ford Foxtons sales fall as London market continues to prove challenging \nRevenues at Foxtons slid again in the third quarter as the London-focused estate agent continues to feel the impact of a slowing property market in the capital. The group said turnover fell more than 6% to £35.1m in the three months to September 30 as it was hit by a slowing sales market and “downward pressure on rents”. Total revenue for the first nine months of the year is also down, dropping 11.9% to £93.7m. \nIt comes after Foxtons in July blamed “unprecedented” economic and political uncertainty hitting the property market as its full-year profits sunk. \nThe estate agent flagged the EU referendum as a factor in slowing the London property market, adding that demand has also weakened in conjunction with “inflationary pressures on household incomes”. For the third quarter, Foxtons said it saw modest growth in volumes but falling rents meant that lettings revenue came in slightly lower at £22.5m. Sales revenue in the quarter dropped from £12.3m to £10.3m. 9.10 KEY EVENT New sewers in Morpeth are unlikely pick for the North East's best new development \nWhen it came to deciding the best development in the North East, judges couldn’t separate the two outstanding projects. \nOne is an eye-catching library and cultural centre that has brought national attention to region, and the other is... a new system of sewers for a Northumberland market town. \nNorthumbrian Water’s North Morpeth strategic sewer system was the unlikely joint winner of the Royal Town Planning Institute (RPTI) North East awards, winning praise for the way it has been planned to allow the town to grow and cope with new housing developments. \nThe sewers took top prize alongside The Word, the library and cultural centre which is the centrepiece of the £100m South Shields 365 regeneration masterplan, though even some of its most ardent fans would have to admit that it is “not exactly sexy”. New sewer system in Morpeth 9.06 Coreena Ford Top Northumberland hotel Matfen Hall gets £250,000 refurbishment \nA historic Northumberland resort has announced a £250,000 refurbishment of its wedding spaces to drive forward the next chapter in its history. \nMatfen Hall hotel, golf and spa is using the significant investment to transform the rooms in the East Wing including the Great Hall, Terrace Room and Sir Edward’s Bar, to create new, luxurious surroundings. \nA historic Northumberland resort has announced a £250,000 refurbishment of its wedding spaces to drive forward the next chapter in its history. \nMatfen Hall hotel, golf and spa is using the significant investment to transform the rooms in the East Wing including the Great Hall, Terrace Room and Sir Edward’s Bar, to create new, luxurious surroundings. \nSir Edward’s Bar is also set to be redecorated, with textured wall finishes in blues and greens, as well as brass metalwork and Italian marble, and colours of the decorative plasterwork on the high ceilings of the Terrace Suite will match the panelled walls, inset with crystal cut antiqued mirror panels. \nMarc Hardy, project manager at Space ID, said: “This is a truly sensational opportunity.” How the bar at Matfen Hall will look once completed (Image: Matfen Hall) 9.00 KEY EVENT Top global architect to design £200m conference centre at Gateshead Quays \nOne of the world’s top architectural practices has been appointed to design a £200m conference and exhibition centre on the Gateshead Quays . \nArchitects HOK – whose work includes the recently opened $1.3bn Mercedes-Benz Stadium in Atlanta and a new basketball and ice hockey arena for the Barcelona sporting club – has been appointed to draw up plans for a 12,500-seater arena that would be operated by SMG Europe to replace the Metro Radio Arena in Newcastle. \nThe new arena is set to open in 2021 as part of a development that aims to create 1,100 new jobs. \nHOK – which has offices in 23 countries and is renowned for eye-catching major schemes in some of the world’s largest cities – is one of three companies appointed by Gateshead Council and its development partners to draw up plans for the 10-acre site between the Sage Gateshead and the Baltic art centre. \nGateshead Council leader Martin Gannon said: “The appointment of the design team is a critical and landmark decision for this project. All three organisations have global reputations and that shows our commitment to bringing a world-class arena and conference and exhibition facilities to the North East. \n“Gateshead Quays is already one of UK’s most iconic riverside locations. We’ve always been clear that a high quality design for this site is paramount and we’re now ever more confident that the new buildings and landscape for this site will further enhance Gateshead Quays skyline and reputation.” Artist's impression of the planned conference centre at Gateshead 8.55 Coreena Ford Reckitt Benckiser slashes sales outlook amid cyber attack \nHousehold goods giant Reckitt Benckiser has warned over sales for the second time in three months as it grapples with “challenging” markets and the ongoing impact of a recent cyber attack. \nThe Durex-to-Dettol firm revealed another 2% sales hit from the ransomware attack in June, which significantly disrupted its manufacturing and orders systems across a raft of markets, including the UK. \nIt also announced a corporate overhaul to reorganise the firm into two divisions - its consumer health business, including recently acquired US infant formula company Mead Johnson, and a home and hygiene arm. \nThe group reported a 1% fall in group net revenues for the three months to the end of September as it blamed the cyber attack and difficult trading in a number of its markets, including the UK. \nIt slashed its annual sales outlook as a result, saying it now expects like-for-like sales to be flat over 2017 - down from an already downgraded previous expectation for growth of 2%. \nReckitt said in its latest update it was still working to resolve the impact of the attack, with a backlog in its factories still “not fully caught up”. Reckitt Benckiser Coreena Ford Flybe shares tumble after profit warning \nShares in regional airline Flybe have tumbled almost 15% this morning after issuing a profit warning amid higher than expected costs. \nThe airline, which serves Newcastle among a long list of regional airports, sent out the warning after incurring higher-than-expected aircraft maintenance costs. \nThe firm said its drive to improve the reliability of its planes, in particular the Bombardier Q400 turboprop, will see profits dive in the first half of the year. Flybe said adjusted profit before tax is forecast to come in between the range of £5m to £10m in the period, down from an estimate of £15m. \nThe diminished figure, which compares with a £15.9m profit in the same period last year, also takes in additional IT costs of £6m linked to the development of a new digital platform. \nIn early trading shares fell 14.7% to 37.5. A Flybe plane (Image: Andrew Milligan/PA Wire) 8.40 Coreena Ford Online marketplaces profiting from fraud: eBay and Amazon respond \nHere’s what eBay and Amazon had to say in response to claims online marketplaces are profiting from the sellers who dodge VAT. \nAn eBay spokesman said: \nWe want a fair marketplace for all our buyers and sellers. That’s why we have been working together with HMRC - and going above and beyond their requirements - to continue to ensure that our site is the best possible place to do business. \nAn Amazon spokesman said: \nWe are reviewing the committee’s recommendations and support efforts to ensure businesses and individuals selling across all marketplaces are VAT compliant. \nWe offer extensive information, training and tools to assist sellers in their VAT obligations, and we work closely with HMRC on this matter sharing all requested data on non-EU sellers and promptly removing any seller they inform us is not VAT compliant. 8.35 KEY EVENT Amazon and eBay are 'profiting from fraud by sellers who dodge VAT' \nOnline marketplaces like Amazon and eBay are profiting from fraud by sellers who dodge the VAT they should charge on sales in the UK, a parliamentary report says. \nThe “unfair and illegal” practice allows sellers based outside the EU to undercut British retailers by 20%, hitting sales hard and forcing many to cut staff or even shut down, said the House of Commons Public Accounts Committee (PAC). \nCustoms authorities have been “too cautious” in pursuing fraudsters, said the committee, which said the loss to taxpayers may be much higher than the “out-of-date and flawed” HM Customs and Excise estimate of £1-£1.5bn. \nThe problem is growing fast as online purchases increased from 2% of retail sales in 2006 to 14.5% in 2016. \nThe committee warned it will only get more complicated due to uncertainty over customs arrangements when Britain leaves the EU. \nUnder tax laws, traders based outside the EU selling goods to customers in the UK must charge VAT if the items are present in the UK at the time of sale. But many do not charge the 20% levy, even though the goods are stored in up to 3,000 warehouses known as “fulfilment houses” dotted around the UK. \nBoth Amazon and eBay told the committee that they took action to remove “bad actors” from their sites. \nBut the report found that it was “bewildering that these big companies have taken such little action to date”, adding: “Amazon and eBay, amongst other online marketplaces, continue to profit from fraudulent activities taking place on their sites”. \nThe cross-party committee called for “much more urgency” from HM Revenue and Customs, which “has not named and shamed non-compliant traders and so far has not prosecuted a single seller for committing online VAT fraud”. \nCommittee chair Meg Hillier said: \nOnline VAT fraud is hugely damaging yet, as online sales continue to grow, the response of HMRC and the marketplaces where fraudsters operate has been dismal. \nHMRC needs to be far tougher in protecting the interests of British businesses and taxpayers. As a priority it must inject more urgency into enforcement action. But it should also push the case for further new powers. \nOnline marketplaces tell us they are committed to removing ‘bad actors’, yet that sentiment rings hollow when those same marketplaces continue to profit from the actions of rogue traders. Online marketplaces like Amazon and eBay are profiting from fraud, a parliamentary report says. More On", "external_links": [], "published": "2017-10-18T10:30:00.000+03:00", "crawled": "2017-10-18T12:49:38.010+03:00", "highlightTitle": ""}