{"organizations": [], "uuid": "d5e4d578bb9efcb5ea1a182ed18c59765456da13", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30199087/15902840.jpg", "site_section": "http://www.middevongazette.co.uk/news.rss", "section_title": "Devon Live news RSS feed", "url": "http://www.devonlive.com/ben-bradshaw-has-more-fire-in-his-belly-than-ever-before/story-30199087-detail/story.html", "country": "GB", "title": "After 20 years Ben Bradshaw 'has more fire in his belly than ever...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "After 20 years Ben Bradshaw 'has more fire in his belly than ever...", "spam_score": 0.0, "site_type": "news", "published": "2017-03-13T15:35:00.000+02:00", "replies_count": 0, "uuid": "d5e4d578bb9efcb5ea1a182ed18c59765456da13"}, "author": "Devon Live", "url": "http://www.devonlive.com/ben-bradshaw-has-more-fire-in-his-belly-than-ever-before/story-30199087-detail/story.html", "ord_in_thread": 0, "title": "After 20 years Ben Bradshaw 'has more fire in his belly than ever...", "locations": [], "entities": {"persons": [{"name": "ben bradshaw", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "hitler", "sentiment": "none"}, {"name": "ben", "sentiment": "none"}, {"name": "philip hammond", "sentiment": "none"}, {"name": "john macdonald", "sentiment": "none"}, {"name": "wetherspoon", "sentiment": "none"}, {"name": "sarah wollaston", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "dawlish", "sentiment": "none"}, {"name": "bradshaw", "sentiment": "none"}, {"name": "diane abbot", "sentiment": "none"}], "locations": [{"name": "exeter", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "north devon", "sentiment": "none"}, {"name": "okehampton", "sentiment": "none"}, {"name": "thames", "sentiment": "none"}, {"name": "st david", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}, {"name": "tavistock", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "cornwall", "sentiment": "none"}], "organizations": [{"name": "a&e", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "tories", "sentiment": "none"}, {"name": "aberdeen", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "met office", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "exeter college", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "totnes conservative", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "After 20 years Ben Bradshaw 'has more fire in his belly than ever before' By Devon Live | Posted: March 13, 2017 0 COMMENTS SHARES On the campaign trail in 1997 After 20 years Ben Bradshaw 'has more fire in his belly than ever before'   \nIn his Westminster office overlooking the Thames, Ben Bradshaw speaks candidly about his years as Exeter's MP and his fears for the Labour Party. \"There's a huge responsibility on my shoulders as the sole Opposition MP in our region,\" he says. \n\"To bring my own party back to electability and against this disastrous hard Brexit the Government is hurtling towards, which will be devastating for jobs in our region. I have more fire in my belly now than perhaps I have ever had. This is existential, and will have huge implications for generations to come. Being in opposition is frustrating, but I feel more motivated now than I ever have done.\" \nHe does not believe a snap General Election is likely, even though he thought Theresa May would call one, simply because it made political sense. \n\"She has no mandate of her own and is facing the most difficult negotiations ever undertaken by any country in history with a very small majority and economic clouds gathering on the horizon. I'm surprised she hasn't called an early election. \nRead next: Young woman airlifted after road crash \n\"Labour has to be ready for that possibility, and our campaign machine in Exeter never really got out of top gear.\" \"We will be ready when an election comes.\" \nMr Bradshaw has been critical of his party leader, Jeremy Corbyn, and thinks that a Labour win now would be unlikely \"without a huge change in our fortunes\". \nHe adds: \"There is no point beating about the bush. We are very far behind in the polls; we are far behind on the two essential pre-requisites: economic trust and confidence; and leadership. \n\"We have just had the worst by-election result for any opposition party since the 1870s. But I can see a route through to a Labour victory more now than I have for some time – and it doesn't necessarily mean a change of leadership; we have had two leadership contests. \n\"There is appetite for better performance. Even Jeremy Corbyn's closest supporters – people like Diane Abbot and John MacDonald – have said quite openly that if performance doesn't improve in the next 12 months all bets are off.\" \nIn 2007 Mr Bradshaw was made a Health Minister (and at the same time Minister for the South West). He put the case for private management of health trusts, and now points out that the NHS has always had private sector input, from GPs and pharmacists to dentists. \n\"It's futile to have an argument about this. What is important is that the NHS is a taxation-funded service that delivers care free on the basis of need, not ability to pay. I feel the debate over provision is a distraction. The problem is under-funding. \nRead next: Wetherspoon's food prices are going up . \n\"When we came into government in 1997 the health service was under-funded,\" he says. \n\"We got the NHS to spend at the EU average which it had never been before. It is now back down to where it was when we came in. The results are there for everyone to see. The worst A&E performance, longer waiting times, people finding it much more difficult to get to see a GP.\" \nAnd at the same time you've had 40 per cent cut from local government social care budgets. \n\"Thousands of people in the South West have lost their eligibility for free social care. More and more elderly and frail people are staying in hospital too long because there aren't the social packages to enable them to go home.\" \nIn last week's Budget Philip Hammond, the Chancellor, allocated an extra £2 billion for social care in 2017-18. Mr Bradshaw said that was welcome, but nowhere near enough to make up for the cuts since 2010. The Government has promised a green paper on social care in the autumn, which Totnes Conservative MP Dr Sarah Wollaston insists should look at the NHS and social care as a package. Mr Bradshaw said of the green paper: \"I'm not sure we can wait that long.\" \n\"You've got a perfect storm of a crisis in both our health and social care systems which the government has until now been in denial about. We need a proper, sustainable solution,\" he says. \n\"We've been here before. We had an all-party commission which came up with some sensible recommendations which the Tories then walked away from. It's a tragedy for me as a former health minister who left office in 2010 with public satisfaction at a record high and waiting times at a record low, to see all that starting to unravel. £2 billion is a pinprick, and they are going to have to do a great deal more to rescue the system, which is in danger of collapse.\" \nThe question \"did Labour ignore the South West?\" gets him animated. \"I don't think we did,\" he says. \"We relocated the Met Office to Exeter which was a huge boost for the city and the surrounding economy. We set up one of the first of two new medical schools to be established since the 1960s, which led to a big improvement in the quality of healthcare locally and our ability to attract and retain high-paid graduates. EU Objective One status for Cornwall was the holy grail for decades that nobody thought would happen but was delivered by the Labour government. \n\"The Tories talk a good talk in the South West. But you look at what they've delivered over the past two years, having made all those grandiose promises which we all remember in the 2015 election: tens of billions of infrastructure investment for our railways, almost none of which has been delivered.\" \n\"Labour delivered a record period of sustainable growth, rising living standards, reducing inequality, hugely improved school standards – all of our schools renewed or rebuilt, getting rid of outside toilets.\" \nAnd rebuilding and saving the health service. That's a record anyone would be proud of.\" His three priorities for infrastructure investment now would be transport, broadband and housing. \"Transport is the number one priority for me,\" he says. \n\"It's still my view that we should have an additional Dawlish-avoiding line for high-speed train services to Plymouth.\" \nThis was the route that was almost built in 1939 and thwarted by Hitler. \n\"We need that because we cannot afford a situation where most of the peninsula is cut off whenever we have a bad storm or a cliff fall. Climate change and sea level rise is going to make that line more and more vulnerable,\" he says. \n\"Reconnecting the northern route to Plymouth, through Okehampton and Tavistock, \"would be nice, and a boost to North Devon\", but is not the priority. \n\"We need an effective roll-out of high-speed broadband, which is behind schedule and now not expected to reach the proportion of homes that was promised. Broadband should be considered an essential utility, just like electricity and heating in the modern age.\" \nHe calls for huge investment in housing, saying: \"We have the biggest affordability gap in any region in the UK outside London. That is leading to ordinary people in the Westcountry if they're lucky getting their feet on the property ladder in their late 30s now on average.\" \nThat affordability gap is one of the prices of success. \"Exeter has become a fantastic success story in the past 20 years,\" Mr Bradshaw says. \n\"We are one of the fastest growing cities in the UK.\"Between 1997 and 2010 only Aberdeen grew faster in terms of productivity and that was due to an oil boom. I suspect that since the oil price fell we've overtaken them. We have transformed the quality of our schools. We have one of the best universities in the country and the world. \n\"Exeter College is one of the best performing FE colleges in England. \n\"We had the Met Office relocating here.\"We have one of the first new postgraduate medical schools in the country. And an extremely strong mixed and balanced economy; a highly effective and competent Labour-led local authority, a great place to live and work, with the redevelopment of the city centre. \n\"Exeter's profile has developed nationally and internationally – not just thanks to the university and the Met Office but, for example, the success of the rugby team. But the city has managed to retain a lot of its original charm and character. Inevitably any city that is growing and succeeding will change, but I think we've managed to do it in Exeter in a way which has retained the very strong sense of its own identity and civic pride. And people who can feel pride in their place, which is such an underrated factor in our politics and people's wellbeing. \n\"Of course Exeter has challenges – mainly the challenges of success, like congestion, which is particularly bad at rush hour. There is pressure on housing and housing affordability. \n\"But I would rather have the problems of success than the problems of failure.\"If I look back on those 20 years, it has been a fantastic journey and one I feel proud to have been part of. \n\"My job is a huge privilege – I think it's the most privileged position in the world, to be an elected representative and particularly of a city like Exeter. \n\"I get off the train at St David's at the weekend and think how lucky I am. \nBen thinks an alternative to the weather-sensitive Dawlish railway line is essential \n\"The question of what is his proudest achievement has him rocking back in his chair with laughter. \n\"An old family friend will for ever be grateful to me for being the minister that banned docking of dogs' tails, as part of the 2006 Animal Welfare Act,\" he says. \n\"When I see a dog happily wagging its tail I think, 'That was me! I did that'. And I did it in the face of some quite tough opposition from certain sectors that didn't want me to interfere. \n\"Inevitably in politics as in life there are low points, and Labour's defeat at the 2010 election was one of those. But he sees the loss of the EU referendum as even worse. \n\"What has been gratifying has been that throughout Labour's national troubles, in Exeter we have been able to inoculate ourselves against it. \n\"I trebled my majority in 2015 at time when we lost Plymouth. We increased our majority on the city council last year when we lost Plymouth. The current travails of my own party at national level aren't great, but those things have stoked the fire in my belly.\"", "external_links": [], "published": "2017-03-13T15:35:00.000+02:00", "crawled": "2017-03-13T13:18:57.141+02:00", "highlightTitle": ""}