{"organizations": [], "uuid": "855aaf6d8b9cda8d1ab017b66d5de0f5577e46ae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12244426.ece/ALTERNATES/s1200/JS83480729.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12720335", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast RECAP: BT reaches Ofcom agreement to separate Openreach", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast RECAP: BT reaches Ofcom agreement to separate Openreach", "spam_score": 0.0, "site_type": "news", "published": "2017-03-10T15:17:00.000+02:00", "replies_count": 0, "uuid": "855aaf6d8b9cda8d1ab017b66d5de0f5577e46ae"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12720335", "ord_in_thread": 0, "title": "Business Breakfast RECAP: BT reaches Ofcom agreement to separate Openreach", "locations": [], "entities": {"persons": [{"name": "cooper rose", "sentiment": "none"}, {"name": "john cruddace", "sentiment": "none"}, {"name": "philip hammond", "sentiment": "none"}, {"name": "gary graham", "sentiment": "none"}, {"name": "john lewis partnership", "sentiment": "none"}, {"name": "mrs hodgson", "sentiment": "none"}, {"name": "harry trueman", "sentiment": "none"}, {"name": "charlie mayfield", "sentiment": "none"}, {"name": "ryan maughan", "sentiment": "none"}, {"name": "clas ohlson", "sentiment": "none"}, {"name": "martin", "sentiment": "none"}, {"name": "wetherspoon", "sentiment": "none"}, {"name": "jonathon manning john lewis", "sentiment": "none"}, {"name": "sharon hodgson", "sentiment": "none"}, {"name": "john lewis", "sentiment": "none"}, {"name": "mr martin", "sentiment": "none"}, {"name": "anna gowthorpe/pa wire", "sentiment": "none"}, {"name": "tim martin", "sentiment": "none"}, {"name": "ian mcclelland", "sentiment": "none"}, {"name": "jonathon manning jd wetherspoon", "sentiment": "none"}, {"name": "hammond", "sentiment": "none"}, {"name": "jonathon manning unipres", "sentiment": "none"}, {"name": "steve gooding", "sentiment": "none"}, {"name": "jd wetherspoon", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "somerset", "sentiment": "none"}, {"name": "unipres", "sentiment": "none"}, {"name": "washington business centre", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "northumberland street", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "cardiff", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "sweden", "sentiment": "none"}], "organizations": [{"name": "ofcom", "sentiment": "negative"}, {"name": "bt", "sentiment": "negative"}, {"name": "training academy", "sentiment": "none"}, {"name": "crest photography", "sentiment": "none"}, {"name": "essex", "sentiment": "none"}, {"name": "avid technology", "sentiment": "none"}, {"name": "avid technology", "sentiment": "none"}, {"name": "sunderland west", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "red engineering limited of hexham", "sentiment": "none"}, {"name": "energy technologies institute", "sentiment": "none"}, {"name": "omx nordic exchange", "sentiment": "none"}, {"name": "rac foundation", "sentiment": "none"}, {"name": "sunderland college", "sentiment": "none"}, {"name": "clas ohlson", "sentiment": "none"}, {"name": "royston power", "sentiment": "none"}, {"name": "unipres", "sentiment": "none"}, {"name": "unipres training academy", "sentiment": "none"}, {"name": "enogia s.a.s", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning Three North East firms drive £3.6m project to boost shipping sector's green credentials \nThree North East firms are spearheading a £3.6m project to help the global shipping industry boost its green credentials . \nCramlington company Avid Technology is to lead the multi-million pound project aimed at reducing the costs and emissions from global shipping industry. \nThe firm, which designs and makes electrically-powered systems for low emission vehicles, will have support on the 26-month project from Red Engineering Limited of Hexham and Newcastle-based Royston Power along with France’s Enogia S.A.S. \nThe project has been set in motion by the Energy Technologies Institute (ETI) with an aim to improve environmental standards in the marine industry, which has yet to find a tenable alternative to fossil fuels. \nTogether, the four firms aim to develop and demonstrate a waste heat recovery system that could deliver reduced emissions and fuel efficiency savings of at least 8% for all kinds of ship. \nAt the end of the development stage, the project could result in a system being installed on an offshore support vessel by the end of 2018, ahead of a further six months of testing. \nRyan Maughan, founder and managing director of Avid Technology, which specialises in the design and manufacture of electrically powered systems for low emission vehicles, said: \nUnlike other forms of transport, the marine industry has yet to establish a credible alternative to fossil fuels so the immediate priority is to achieve substantial carbon dioxide reductions by reducing fuel consumption. \nThe technology solution we’re targeting with our partners is based on improving fuel efficiency by recovering heat energy from the exhaust stream therefore reducing the electrical load provided by the ship’s generators and by lowering the temperature of the exhaust gas by converting heat to electricity. \nAvid Technology is already leading the global industry in providing such solutions to road and off-road vehicles so it’s a natural evolution for us to turn our expertise to the marine sector. Ryan Maughan, founder and managing director, AVID Technology (Photo: Crest Photography) 8:57 Jonathon Manning Unipres launches new Training Academy to produce future manufacturing talent \nA production line of manufacturing talent has been set in motion by one of the North East’s largest automotive experts. \nThe Unipres Training Academy was opened by Sharon Hodgson, MP for Washington and Sunderland West, at a ceremony attended by business and civic leaders as well as a host of former and current company apprentices. \nAt its peak, the new facility will turn out more than 100 apprentices a year, and the investment complements the specialist and short courses offered to employees which will also be available to other automotive suppliers. \nThe firm has invested £500,000 in the new academy, based at Washington Business Centre, close to Unipres’s Sunderland factory. \nMrs Hodgson said: \nToday is a fantastic step for the North East and for Sunderland. It’s a credit to Unipres, and to the skills of the team at the company, who have created this fantastic Academy, which I am sure will be hugely successful. \nI am delighted that Unipres is working with Sunderland College. The FE sector has faced incredible scrutiny from Government over the last year or so, but its role in bringing through talented young people ready to take the reins from the leaders of today, cannot be underestimated. \nIt is heartening to see a local business so committed to this city also commited to localism in its work with the education sector, and I am sure it will be a strong partnership. We have some tremendous assets in the city, and we must encourage them to work together to deliver bigger, better things for the next generation. Sharon Hodgson, Harry Trueman, John Cruddace and Unipres MD Gary Graham with the current batch of Unipres apprentices (Photo: Ian McClelland) 8:54 KEY EVENT Northumberland fourth worst area for substandard bridges \nNorthumberland has been shamed as having the fourth highest number of substandard bridges in the country. \nNorthumberland was found to have 148 poor quality bridges. It was named as one of the worst regions in the country behind Devon, Somerset, and Essex. \nSome 3,203 bridges in Britain are not fit to support the heaviest lorries which can weigh up to 44 tonnes, according to motoring research charity the RAC Foundation. \nMany of these structures have weight restrictions and others are under programmes of increased monitoring or managed decline. \nThe number of substandard bridges has increased by 35% over the past two years, the analysis revealed. \nThey represent around 4.4% of the 72,000 bridges on the local road network. Some of these bridges are substandard because they were built to earlier design standards, while others have deteriorated through age and use. \nRAC Foundation director Steve Gooding said: \nIt’s the pothole backlog that normally hits the headlines but it is easy to forget all the other aspects of road maintenance that councils are involved in; from clearing ditches to cutting verges to maintaining bridges. \nIn the face of growing traffic volumes and ageing infrastructure the danger is that without an adequate long-term funding settlement we will see more rather than fewer bridges with weight restrictions, with the backlog bill getting bigger all the time. \nThere has been a spate of lorries causing problems on bridges where they exceed the weight limit. HGVs on the A1 (Photo: Anna Gowthorpe/PA Wire) 9:46 Jonathon Manning JD Wetherspoon sees turnover grow by £10 at half year mark \nDespite JD Wetherspoon chairman Tim Martin using a trading update to condemn the Government’s spring budget, the pub chain had a strong start to the year boasting a £10m rise in revenue. \nTurnover grew from £790.3m to £801.4m for the first six months of the 2016/17 financial year. \nProfit before tax grew by an impressive 42.8%, soaring from 36m to £51.4m. \nFollowing the budget however, Mr Martin complained that the chain would not benefit from the £1,000 per annum decrease in business rates. He said: \nCompanies like Wetherspoon, on examination of the fine print of the budget, are not, in fact, eligible for the £1,000 per annum decrease in business rates, in any event. \nThe company has previously emphasised the far-higher taxes per meal or per pint that pubs pay compared to supermarkets. For example, supermarkets pay less than 2p per pint for business rates, whereas pubs pay around 18p per pint. \nThe increase in business rates per pint for pubs from next month will be around 2p, further exacerbating the tax gap. \nPubs also pay VAT of 20% in respect of food sales, but supermarkets pay almost nothing, enabling supermarkets to subsidise the price of alcoholic drinks. An article written for the trade press on this subject can be found below. The Wetherspoon pub The Cooper Rose in Sunderland 8:40 KEY EVENT Retailer Clas Ohlson closes Newcastle store and signals sell-off of stock \nThe continuing travails of the retail sector have been brought home with two announcements affecting shops in Newcastle city centre. \nSwedish hardware chain Clas Ohlson is closing its Newcastle store , while department store chain John Lewis has announced its lowest bonus for staff in more than 60 years. \nClas Ohlson is set to bring the shutters down on its Northumberland Street shop on March 19, with the loss of 18 jobs. \nThe store had opened to great fanfare at the former Collectables unit in 2011 but signs are now announcing the imminent closure and the fact that 60% has been knocked off all products. \nA spokesman for Clas Ohlson said: \nWe can confirm that as part of our next step in the optimising of the UK store network, our Newcastle store will close on Sunday 19th March. \nLike every retailer, we constantly review our business and our network of stores. We have closed a number of stores in the UK that have not met expectations in terms of sales and profitability. \n18 colleagues have been affected by the Newcastle store closure. During this difficult time for our colleagues, we are supporting them in the very best way we can personally, financially and including offering relocation opportunities where we have vacancies in our existing locations. \nThe move comes 11 months after the firm, which is listed on the OMX Nordic Exchange in Sweden, announced it was to close more than half its UK stores. Clas Ohlson is closing its Newcastle store 8:35 Jonathon Manning John Lewis cuts staff bonus to 6% - lowest level in more than 60 years \nJohn Lewis and Waitrose staff will see bonuses cut to 6% of their annual salary - its lowest level for more than 50 years - after the firm warned of an “increasingly uncertain market”. \nThe cut, the fourth in a row, will see the retailer’s staff share a £89.4m bonus pot, down from £145m last year. \nThe figure compares to 10% of salary last year, 11% in 2015, 15% in 2014 and 17% in 2013. It is thought to be the lowest level since the 1950s. \nChairman Sir Charlie Mayfield said: \nIn January, we said Partnership Bonus was likely to be significantly lower this year. \nThe board has awarded a bonus of 6%, which is equivalent to more than three weeks’ pay. \nBonus is lower because the board has decided to retain more of our annual profits in order to strengthen our balance sheet. \nThis allows us to maintain our level of investment in the face of what we expect to be an increasingly uncertain market this year, while absorbing the costs associated with adapting the partnership for the future. \nThe group warned in January the bonus would be “significantly lower” than last year in the face of a challenging market outlook, partly linked to the collapse in the value of the pound since the Brexit vote. \nJohn Lewis Partnership, which is owned by the employees of the two retail chains, reported pre-tax profits before exceptional items of £370.4m for the 52 weeks to the end of January 28, a 21.2% increase on last year. John Lewis store, Cardiff (Photo: Western Mail) 8:30 KEY EVENT JD Wetherspoon chairman condemns Hammond's 'budget for dinner parties' \nThe chairman of JD Wetherspoon has ripped into Chancellor Philip Hammond, accusing him of delivering a “budget for dinner parties” rather than pub goers. \nTim Martin used a first-half trading statement to highlight nearly £30m of extra charges Wetherspoon will have to pay as a result of tax hikes, and derided Mr Hammond for threatening the pub sector’s survival. \nHe said: \nWe understand the need for the Government to raise taxes. “However, there should be a sensible rebalancing of the taxes paid by pubs and supermarkets, if the pub industry is to survive in the long term. \nMr Martin totted up a business rates bill of £7m, a £2m Apprenticeship Levy charge and a £4m hit from the sugar tax that will contribute to £29m in extra charges the group will face over the next few years. \nHe also poured scorn on a £1,000 business rates discount for pubs with a rateable value of less than £100,000, saying “that sum is dwarfed by tax and regulatory increases” and that Wetherspoon is not eligible for it in any case. \nThe outspoken New Zealander pointed out the disparity between how pubs are taxed versus supermarkets when it comes to VAT on food sales and described Mr Hammond as having been “less-than-frank”. He said: \nThe Chancellor was less-than-frank in his budget speech, since he did not spell out the duty increases, giving the impression to many that there would be no increase. \nIn effect, this was a budget for dinner parties, no doubt the preference of the Chancellor and his predecessor - dinner parties will suffer far less from the taxes outlined above, whereas many people prefer to go to pubs, given the choice JD Wetherspoon chairman Tim Martin (Photo: JD Wetherspoon/PA Wire) 8:22", "external_links": [], "published": "2017-03-10T15:17:00.000+02:00", "crawled": "2017-03-10T12:07:27.158+02:00", "highlightTitle": ""}