{"organizations": [], "uuid": "ba48933aa382d5e10b9ba8ff292fed3834ccffde", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12810633.ece/ALTERNATES/s1200/Prime-Minister-visit-to-Birmingham.jpg", "site_section": "", "section_title": "", "url": "http://www.chroniclelive.co.uk/news/north-east-news/theresa-wants-free-trade-help-12810240", "country": "IE", "domain_rank": 21960, "title": "Theresa May wants 'free trade' to help companies like Nissan as she prepares to trigger Article 50 - Chronicle Live", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 0, "title_full": "Theresa May wants 'free trade' to help companies like Nissan as she prepares to trigger Article 50 - Chronicle Live", "spam_score": 0.009, "site_type": "news", "published": "2017-03-29T12:00:00.000+03:00", "replies_count": 0, "uuid": "ba48933aa382d5e10b9ba8ff292fed3834ccffde"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/theresa-wants-free-trade-help-12810240", "ord_in_thread": 0, "title": "Theresa May wants 'free trade' to help companies like Nissan as she prepares to trigger Article 50 - Chronicle Live", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "mrs may", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "sunderland", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}], "organizations": [{"name": "nissan", "sentiment": "negative"}, {"name": "european council", "sentiment": "none"}, {"name": "europol", "sentiment": "none"}, {"name": "eu commission", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "parliament  mrs", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "chronicle", "sentiment": "none"}, {"name": "department for education", "sentiment": "none"}, {"name": "eu council", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "eec", "sentiment": "none"}, {"name": "european arrest warrant", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Theresa May wants 'free trade' to help companies like Nissan as she prepares to trigger Article 50 Prime Minister responds to Nissan concerns in interview with The Chronicle as she prepare to trigger Article 50 Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nPrime Minister Theresa May said she wants “free and frictionless” trade with the EU, as she prepares to trigger Article 50 on Wednesday. \nCarmakers such as Nissan have stressed the need for continued access to the EU single market, not only so that they can sell vehicles in EU countries but also so that they can import parts from EU suppliers without delays. \nMrs May said she understood the need for “frictionless” trade, in an interview with The Chronicle. \nShe said: “I want to see, if you talk to businesses of all sorts across the country, they value the ability to trade in goods and services as seamlessly and frictionlessly across borders into the European Union. \n“We want a comprehensive free trade agreement with Europe that enables us to have as free and frictionless as possible trade in goods and services with the European Union remaining member states.” Prime Minister Theresa May (Photo: PA) \nThe Prime Minister said she is to talk to European Union leaders about continuing UK involvement in the European Arrest Warrant and the EU police force after Brexit. \nAttention has focused on the UK’s future trade relationship with the EU but Mrs May, a former Home Secretary, said continued co-operation to fight crime and terrorism was also important. \nThe European Arrest Warrant is a warrant valid throughout all member states of the European Union. Once issued, it requires any member state to arrest and transfer a criminal suspect. \nAnd Mrs May also suggested she would talk about continued UK involvement in Europol, the EU’s law enforcement agency. \nShe said: “The important thing is that although a lot of the discussion is about the trade agreement we will be negotiating with the EU, there will be other elements to our negotiations. \n“The whole question of co-operation on security and justice and home affairs will be part of that as well. Workers at Nissan's plant in Sunderland \n“There will be issues like the European Arrest Warrant, like access to Europol. These are all aspects of that security and justice and home affairs area that will be part of the negotiations which will start once we’ve triggered [Article 50] and once the EU council have set their guidelines”. \nThe Prime Minister set out the process of triggering Article 50. \nShe said: “The actual process of triggering is simply I send a letter to President Tusk, as President of the EU Council, invoking Article 50 (2), which enables us to say that we want to leave the European Union. And that will be handed to him. \n“I will make a statement in Parliament.” \nReports have suggested the letter could be six pages long. Asked about this, she said: “Some people think it should be one page long. Some people think it should be 20 pages long.” \nThe European Council, led by Mr Tusk, will meet on April 29 and agree guidelines which will then be sent to the EU Commission, setting out how negotiations are to be conducted. Read More Brexit D-Day - how the historic political event will unfold in Parliament \nMrs May also left the door open for significant changes to a controversial planned new school funding formula. \nShe said her approach to Government was to ask people whether proposals are “going to work” - and to consider changes based on the response. \nAsked if the funding plans could change, Mrs May said: “It is genuinely looking at the responses that we’ve had and the consultation.” \nHer government was putting more emphasis on green papers and white papers - the consultation documents published before firm decisions are made - than previous administrations, she said. \n“The way in which I have been approaching Government is that I think it’s important that government - I mean we’ve been doing far more through green papers and white papers, so far more through a process which is openly saying to people, ‘here’s what we’re looking at doing. We are consulting on you. Is this going to work?’ \n“So it is about looking at the responses and then coming forward with a proposal in due course. \n“And obviously we had a lot of responses. So it won’t be in the next few days that we are responding.” \nHowever, she said changes to the school funding formula were essential. \n“Virtually for as long as I have been involved in politics, I think everybody has accepted for a considerable length of time that the current funding arrangements are not fair. So we’ve got to try and find a fairer funding formula. Read More As Article 50 is triggered - we recall the way we were in January, 1973 when the UK joined the EEC \n“The point about the document and the proposals that the Department for Education put out were that they were a proposal on which we were consultation. The consultation only closed last week. \n“So now we’ve got to take the opportunity to look at the responses that have come in from that consultation and then in due course bring forward our proposals.” Like us on Facebook ", "external_links": [], "published": "2017-03-29T12:00:00.000+03:00", "crawled": "2017-03-29T07:47:40.366+03:00", "highlightTitle": ""}