{"organizations": [], "uuid": "351f14937d22f7ce0068abce1126e6a8b2a5b717", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12710608.ece/ALTERNATES/s1200/Budget-2017.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/tax-changes-self-employed-hold-12713467", "country": "GB", "domain_rank": 21960, "title": "Tax changes for the self-employed will 'hold back North East growth', business group says", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Tax changes for the self-employed will 'hold back North East growth', business group says", "spam_score": 0.0, "site_type": "news", "published": "2017-03-09T03:12:00.000+02:00", "replies_count": 0, "uuid": "351f14937d22f7ce0068abce1126e6a8b2a5b717"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/tax-changes-self-employed-hold-12713467", "ord_in_thread": 0, "title": "Tax changes for the self-employed will 'hold back North East growth', business group says", "locations": [], "entities": {"persons": [{"name": "philip hammond", "sentiment": "negative"}, {"name": "ippr north", "sentiment": "none"}, {"name": "ted salmon", "sentiment": "none"}, {"name": "phil", "sentiment": "none"}, {"name": "ross smith", "sentiment": "none"}, {"name": "carolyn fairbairn", "sentiment": "none"}, {"name": "ed cox  ed cox", "sentiment": "none"}, {"name": "hammond", "sentiment": "none"}, {"name": "anthony devlin/pa wire", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "north", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north east england", "sentiment": "none"}], "organizations": [{"name": "cbi", "sentiment": "none"}, {"name": "federation of small businesses", "sentiment": "none"}, {"name": "ippr north", "sentiment": "none"}, {"name": "north east chamber  north east england chamber of commerce", "sentiment": "none"}, {"name": "northern powerhouse", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}, {"name": "fsb", "sentiment": "none"}, {"name": "the national insurance", "sentiment": "none"}, {"name": "national insurance", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get business   \nBusiness groups in the North East found much to welcome in Chancellor Philip Hammond’s first Budget , but changes in tax rates for the self-employed cast a considerable shadow on the day. \nMr Hammond won cautious praise for his promise to reform business rates, and for putting skills and technical education at the centre of the Government’s approach to Brexit. \nBut his decision to change tax rates for the self-employed - widely seen as a reaction to a number of high-paid workers in the City classing themselves as freelance to lower their tax bills - was described as a “tax hike” that would “hold back North East growth”. \nTed Salmon, North East regional chairman at the Federation of Small Businesses (FSB), said: “We are deeply concerned about the sudden announcement of a tax rise on the self-employed. In the North East there are approximately 100,000 self-employed who contribute £4bn to the economy. \n“They are a hugely important part of the region’s business community and need to be nurtured not neutered. The genuinely self-employed are qualitatively different than employees. Given the spiralling costs of doing business they need help and support from Government, not additional tax burdens. Ted Salmon, North East regional chairman of the Federation of Small Businesses \n“The National Insurance rise to 10% next year and 11% in 2019 should be seen for what it is – a £1bn tax hike on those who set themselves up in business. \n“This undermines the Government’s own mission for the UK to be the best place to start and grow a business, and it drives up the cost of doing business. Future growth of the UK’s 4.8m-strong self-employed population is now at risk.” \nA recent report highlighted that much of the growth in self-employment had been driven by people in higher-paid work, particularly workers in law, accountancy and management consultancy who might previously have been classed as staff employees. Read More Budget 2017: What do people on the streets of Newcastle think of the Chancellor's plans? \nBut the self-employed in the North East are more likely to be sole traders or people moving into running their own business after losing their jobs elsewhere. \nMr Hammond told MPs the “dramatically different” treatment of employees and self-employed people under National Insurance contributions was “no longer justified by the difference in benefits entitlement” and cost the Treasury £5bn this year alone. \n“That is not fair to the 85% of workers who are employees,” he said. “To be able to support our public services in this Budget and to improve the fairness of the tax system, I will act to reduce the gap to better reflect the current differences in state benefits.” Ross Smith, North East Chamber \nNorth East England Chamber of Commerce director of policy Ross Smith said: “We welcome the positive news with regard to skills, with the introduction of T-Levels and retraining for older workers. This is a big issue for our economy, which is already showing the fastest increase in productivity in the UK, and we would hope a sizeable proportion of the pilot funding will come here. \n“There were also some positive signals on infrastructure, but we will be seeking more detail and pushing for the best outcome for North East England. \n“The biggest disappointment was the lack of measures to support our exporters. They have delivered the best trade record in the country and given the uncertainty they face during Brexit negotiations, there should have been further measures to help them build on this success.” \nCBI director-general Carolyn Fairbairn called Mr Hammond’s speech a “breakthrough Budget for skills”, though she sounded a note of caution on the chances to National Insurance regulations for the self-employed. CBI Director-General Carolyn Fairbairn (Photo: Anthony Devlin/PA Wire) \nShe said: “There has never been a more important time for the UK to sit at the global top table of technical education for young people. Firms will be looking for ongoing partnership with the Government as they try to make the Apprenticeship Levy work. \n“However, with inflation rising and the cumulative burden weighing on businesses’ shoulders, limited relief for firms hit hard by business rates falls short. \n“Firms are wholly committed to the health and wellbeing of their people, and are pleased to see an increase in spending on social care. \n“Businesses will be pleased to see the Chancellor’s continued watchful eye on getting the deficit down and avoiding surprises.” \nMr Hammond’s Budget was conspicuous for avoiding the sort of headline-grabbing announcements for individual regions favoured by some of his predecessors. \nApart from praising the North East’s rise in productivity and announcing £90m to tackle congestion on roads in the North, there were few hand-outs for the region. Director of IPPR North, Ed Cox \nEd Cox, director of the IPPR North think tank, said: “The best way to ensure that there is enough gas in the tank as Britain leaves the EU is to invest in a more productive economy outside London. \n“Re-announcing relatively small amounts of infrastructure and research funding not only betrays the political rhetoric on rebalancing but leaves Northern economies more vulnerable to the economic storms on the horizon. \n“It is understandable that ‘spreadsheet Phil’ sought to focus on technical issues rather than bigger government projects like industrial strategy and the Northern Powerhouse, but in the coming weeks we need to see concrete funding, especially on infrastructure.” Like us on Facebook", "external_links": [], "published": "2017-03-09T03:12:00.000+02:00", "crawled": "2017-03-08T22:36:20.688+02:00", "highlightTitle": ""}