{"organizations": [], "uuid": "12d4662140e80bb7e982767107da67b8548ade5e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12685896.ece/ALTERNATES/s1200/Stoke-on-Trent-Central-by-election.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/labour-must-not-just-listen-12685309", "country": "GB", "domain_rank": 21960, "title": "Labour must not just listen to London if it wants to win, says Stoke Central campaign chief", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Labour must not just listen to London if it wants to win, says Stoke Central campaign chief", "spam_score": 0.0, "site_type": "news", "published": "2017-03-05T15:00:00.000+02:00", "replies_count": 0, "uuid": "12d4662140e80bb7e982767107da67b8548ade5e"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/labour-must-not-just-listen-12685309", "ord_in_thread": 0, "title": "Labour must not just listen to London if it wants to win, says Stoke Central campaign chief", "locations": [], "entities": {"persons": [{"name": "paul nuttall", "sentiment": "none"}, {"name": "gareth snell", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "jack dromey", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "st george", "sentiment": "none"}, {"name": "snell", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "dromey", "sentiment": "none"}, {"name": "le pen", "sentiment": "none"}, {"name": "copeland", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "stoke", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "copeland", "sentiment": "none"}], "organizations": [{"name": "stoke central", "sentiment": "negative"}, {"name": "news labour", "sentiment": "negative"}, {"name": "labour", "sentiment": "none"}, {"name": "stoke-on-trent central", "sentiment": "none"}, {"name": "continental europe", "sentiment": "none"}, {"name": "washington post", "sentiment": "none"}, {"name": "national front", "sentiment": "none"}, {"name": "share labour party", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Labour must not just listen to London if it wants to win, says Stoke Central campaign chief Labour MP who ran successful Stoke Central campaign says party must speak out on issues such as Brexit and immigration Share Labour Party leader Jeremy Corbyn greets new Labour MP for Stoke-on-Trent Central, Gareth Snell (Photo: PA) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nPatriotism, Brexit and a firm stance on immigration led Labour to a crucial by-election victory - an MP masterminding the campaign has claimed. \nBut Labour must recognise that views in London are not shared by the rest of the country, said Jack Dromey. \nHe co-ordinated Labour’s successful campaign in the Stoke Central by-election, where the party saw off a threat from UKIP. Labour’s Gareth Snell was elected, beating rival candidate Paul Nuttall, the UKIP leader. \nAt the same time, Labour suffered a devastating loss in a by-election in Copeland, where it lost to the Conservatives. \nMr Dromey said voters in both Stoke and Copeland expressed “discontent” with the political establishment, and to some extent with Labour. \nHe warned: “Our task is not to allow those legitimate discontents to be hijacked by UKIP and the like. Our task is to become the champion of those who are discontented, disconnected and alienated. \n“That means recognising that the politics of London are very different from the politics of Britain. Never allowing Labour somehow to sound like we’re sneering at these discontents. Our task is to hear them, understand them and act upon them.” Read More 'There's no such thing as a safe seat any more' - could the North East's political map turn blue? \nLabour would lose if it simply campaigned on the NHS and avoided issues such as Brexit and immigration, he said. \nMr Dromey said losing Stoke would have been a disaster for Labour, as it would have shown UKIP was “breaking through into Labour’s heartlands.” \nInstead, UKIP is now “in crisis” and Paul Nuttall is “broken”, he said. \nAnd Mr Dromey said the result was “the first significant victory” against a “populism that has been sweeping through much of the western world”. Graffiti at the offices of UKIP in Stoke town centre (Photo: PA) \nIt follows the election of Donald Trump as US President, and what appears to be strong support for Marine Le Pen of the French National Front in the run-up to France’s Presidential elections. \nMr Dromey said: “Had UKIP broken through and won, then they would be breaking through into Labour’s heartlands \n“Conversely, were UKIP to lose, it would be the turning of the tide on UKIP. \n“And of course, that’s exactly what we’ve seen in the past few days. \n“UKIP are now engulfed in a growing crisis. \n“Paul Nuttall said, ‘vote for me and I will break Labour in its heartlands’. \n“Well he failed. UKIP failed. UKIP is now in crisis, and if anyone is broken it is Paul Nuttall.” Read More Why Labour is still the party of the working class - despite academic's claims \nMr Dromey suggested Labour’s victory could have global significance, as it showed that a wave of right-wing populism sweeping the western world could be defeated. \n“We had the world’s press there. It was extraordinary. There were 100 media outlets on the ground, from across Europe to America all the way to Australia. \n“Because, from the Washington Post onwards writing up this by-election, the question was, is it a defining moment in the turning of the tide against that populism that has been sweeping through much of the western world? \n“It is the first significant victory against that populist tide, which is immensely significant. \n“I don’t want to overstate it. But when you get journalists from America and Continental Europe saying will you turn the tide in Stoke? I said yes we will, and we did.” \nLabour must be patriotic and pro-Brexit to win \nLabour’s campaign in Stoke included traditional left-wing messages, such as support for the local hospital. \nBut it also ran a “patriotic” campaign. For example, Labour candidate Mr Snell published a “Plan for the Potteries” setting out how Stoke and the surrounding area (known as the Potteries) could benefit from Brexit, and the document’s cover featured a pottery kiln and the flag of St George. \nMr Dromey said: “We took on what UKIP thought was their territory of Brexit, with a strong message that Britain will leave the European Union. \n“On immigration and on national security.” Video Loading Click to play Tap to play The video will start in 8 Cancel Play now", "external_links": [], "published": "2017-03-05T15:00:00.000+02:00", "crawled": "2017-03-05T10:46:43.928+02:00", "highlightTitle": ""}