{"organizations": [], "uuid": "bb5f7947a34f0d2f3b35e7947e8cfc03c4603bd8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12688740.ece/ALTERNATES/s1200/Norham-House.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/whats-on/arts-culture-news/newcastle-city-centre-building-colonised-12687355", "country": "GB", "domain_rank": 21960, "title": "Why a Newcastle city centre building colonised by artists will soon be empty again", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Why a Newcastle city centre building colonised by artists will soon be empty again", "spam_score": 0.0, "site_type": "news", "published": "2017-03-03T23:00:00.000+02:00", "replies_count": 0, "uuid": "bb5f7947a34f0d2f3b35e7947e8cfc03c4603bd8"}, "author": "David Whetstone", "url": "http://www.chroniclelive.co.uk/whats-on/arts-culture-news/newcastle-city-centre-building-colonised-12687355", "ord_in_thread": 0, "title": "Why a Newcastle city centre building colonised by artists will soon be empty again", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "What's On Why a Newcastle city centre building colonised by artists will soon be empty again Norham House, round the corner from the Odeon on Pilgrim Street, has been home to a thriving creative community Share Click to play Tap to play The video will start in 8 Cancel Play now Charlotte Gregory talks about the NewBridge Project building Share this video Get what's on updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nArtists who brought new life to one of Newcastle city centre’s giant former office blocks are packing up and moving. \nTheir final exhibition – called Moving On Up, Moving On Out – finishes on Saturday and that will be the end of Norham House as a cultural venue. \nThe building on New Bridge Street, opposite Newcastle City Library, is on the East Pilgrim Street site which the city council has earmarked for major regeneration. \nEventually it will be demolished like the old Odeon, on nearby Pilgrim Street, which was on the same site. \nBut it has brought into question the value of having clusters of mostly young artists and creative people in the centre of a university city which has long prided itself on its culture and vibrancy. Norham House, New Bridge Street, Newcastle \nIt was in 2010 that a pair of young fine art graduates were handed the keys to empty Norham House as part of a scheme to keep the city centre alive during the recession when a lot of development projects got put on hold. \nPreviously its five storeys had been occupied by lawyers and accountants. Now the artists invited others to join them, paying a peppercorn rent. \nNorham House became better known as The NewBridge Project with a street level gallery and bookshop and a warren of studios, workshops and exhibition spaces. Read More \nIt has run a programme of exhibitions, talks and other events and has been a popular destination during the annual Late Shows in Newcastle and Gateshead. \nCharlotte Gregory, who studied fine art at Newcastle University , became director of The NewBridge Project in 2014. Visitors to the final exhibition at The NewBridge Project, Norham House \nShe said the artists had been given six months’ notice to leave the building back in October. \n“Norham House includes the bookshop and gallery and there’s also the Maker Space next door and the Alphabetti Theatre underneath,” she said. \n“Then there are the 80 studios we have upstairs along with workshops, a dark room, a film lab and also a rehearsal space and project spaces. \n“Nearly 100 people regularly work here but if you think of our public bookshop, gallery and events, there are a lot more people that benefit from these spaces.” \nCharlotte said the eventual move had always been anticipated but that didn’t make it easier. \n“I think it’s quite difficult for a lot of people because we’ve been here for nearly seven years now. Charlotte Gregory, director of NewBridge Project talks about the 80+ artists based in the NewBridge Project building that are having to move to Carliol House because the building is to be demolished after the Odeon (Photo: Newcastle Chronicle) \n“It forms a big part of people’s lives because it’s not just a work space, it’s about a sense of community and being surrounded by a network of your peers. \n“A lot of development work happens here and there are opportunities for commissions and exhibitions. \n“It has sparked a lot of things for people, enabling them to continue their creative careers and remain in the city. \n“A lot of our studio holders studied at Newcastle and Northumbria universities, and even at Sunderland, and have said they would have moved away if it hadn’t been for things like NewBridge because it’s affordable and there’s an openness. \n“There’s a grassroots feel with the sense that anybody can get involved. \n“So there was initially a lot of sadness and a sense of loss. But there has also been a sense of camaraderie. It has brought people closer together and there has even been a sense of excitement about creating the next space.” Project Space (Photo: Newcastle Chronicle) \nIt’s not the end for the NewBridge artists who have been given the chance to relocate to Carliol House, a Grade II-listed building in the same ownership on the corner of Market Street and Pilgrim Street. \n“The landlords have been quite accommodating, allowing us to have that six months, and the council have been very supportive in helping with the relocation,” Charlotte said. \n“For this building we’re signing a two-year lease. It’s slightly smaller so I think we’re going to have to use it in a slightly different way. \n“But we have also been looking for a more secure space which would be sustainable for the longer term.” \nCharlotte said places like NewBridge were “incredibly important” for cities such as Newcastle which boasted big cultural venues. \n“If you have places like Baltic and Northern Stage you want young creative people to stay in the region and places like NewBridge allow a really experimental approach.” Charlotte Gregory, director of NewBridge Project (Photo: Newcastle Chronicle) \nCharlotte said The NewBridge Project had worked closely with Newcastle University and had commissioned a study by academic Dr Martyn Hudson, looking at the social and economic impact of its work. \nThis was launched at Norham House this week with high profile speakers supporting the idea of creative hubs in the city centre. \nSarah Munro, director of Baltic Centre for Contemporary Art, said places like NewBridge were “absolutely critical” to Baltic and an important constituent of the region’s cultural scene. \nThey ensured a community of artists with a “high quality practice” and a culture of experimentation. \nArtists and smaller arts organisations she likened to bees. “They’re really tiny but you take them out of a system and it collapses.” \nHans Möller, innovation director of the North East LEP (Local Enterprise Partnership) , said “creative people doing creative things” were important economically and socially. General view of Carliol House (Photo: Newcastle Chronicle) \n“Creative/digital is one of the sectors we’re focusing on because you can get access to funding for it,” he said. \n“We need to be better at supporting start-ups in the digital sector.” \nJohn Tomaney, professor of urban and regional planning at University College London but based in the North East, suggested the value of places like NewBridge shouldn’t be measured purely in economic terms. \n“The biggest problem facing Newcastle and the North East is a problem of civic disenchantment which was best expressed in Brexit,” he argued. \n“In terms of the impact and value of NewBridge, rather than its economic value we should be asking, ‘What does it contribute to the city and region as a decent place to live for the majority of people?’ \n“It’s a massive, massive question but worthy of discussion.” Project Space (Photo: Newcastle Chronicle) \nEarlier Tom Warburton, director of investment and development at Newcastle City Council, said: “They have really worked hard, the artists there. \n“They have been on low rents but they have created quite a creative fulcrum so, from the council’s point of view, we’ll continue to liaise with them to keep the vibe going.” \nBut the council, while it doesn’t own the buildings, is keen to see the redevelopment of East Pilgrim Street which it regards as one of the most strategically important in the north of England. \nIt, of course, will benefit from the business rates paid by the eventual occupants of the Northam House area which has been earmarked for retail development. \nNorham House, like other buildings on the East Pilgrim Street site, is managed by Motcomb Estates on behalf of Taras Properties, a company owned by David and Simon Reuben, billionaire property developers. \nA spokesman for Motcomb Estates’ agents in Newcastle, GVA, said no date had been announced for the demolition of any of the buildings but the work would be phased. \nMeanwhile the artists keep ducking and diving, adding colour and variety to urban life. \nFor more about The Newbridge Project go to www.thenewbridgeproject.com Like us on Facebook", "external_links": [], "published": "2017-03-03T23:00:00.000+02:00", "crawled": "2017-03-03T18:25:11.415+02:00", "highlightTitle": ""}