{"organizations": [], "uuid": "700c0617dd3f716850ca6470c483670708e06b8c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30238254/15932244.jpg", "site_section": "http://www.westernmorningnews.co.uk/all-content.rss", "section_title": "Devon Live All Content Feed", "url": "http://www.devonlive.com/south-west-is-ready-to-grow-as-new-brexit-era-dawns/story-30238254-detail/story.html", "country": "GB", "title": "HannahFinch published South West is ready to grow as new Brexit era dawns", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "HannahFinch published South West is ready to grow as new Brexit era dawns", "spam_score": 0.0, "site_type": "news", "published": "2017-03-30T15:58:00.000+03:00", "replies_count": 0, "uuid": "700c0617dd3f716850ca6470c483670708e06b8c"}, "author": "HannahFinch", "url": "http://www.devonlive.com/south-west-is-ready-to-grow-as-new-brexit-era-dawns/story-30238254-detail/story.html", "ord_in_thread": 0, "title": "HannahFinch published South West is ready to grow as new Brexit era dawns", "locations": [], "entities": {"persons": [{"name": "chris loughlin", "sentiment": "none"}, {"name": "caines", "sentiment": "none"}, {"name": "michael caines", "sentiment": "none"}, {"name": "robin hutson", "sentiment": "none"}, {"name": "toby parkins", "sentiment": "none"}, {"name": "ben rhodes", "sentiment": "none"}, {"name": "foot anstey", "sentiment": "none"}, {"name": "simon gregory", "sentiment": "none"}, {"name": "stephens scown", "sentiment": "none"}, {"name": "steve hindley", "sentiment": "none"}, {"name": "matt roach", "sentiment": "none"}, {"name": "redruth", "sentiment": "none"}, {"name": "anstey", "sentiment": "none"}, {"name": "pennon", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "westcountry south west", "sentiment": "none"}, {"name": "exeter airport", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "exeter science park", "sentiment": "none"}, {"name": "east devon growth point", "sentiment": "none"}, {"name": "honiton", "sentiment": "none"}, {"name": "silicon valley", "sentiment": "none"}, {"name": "lympstone manor", "sentiment": "none"}, {"name": "south east", "sentiment": "none"}, {"name": "truro", "sentiment": "none"}, {"name": "headforwards", "sentiment": "none"}, {"name": "cornwall", "sentiment": "none"}], "organizations": [{"name": "commen", "sentiment": "none"}, {"name": "combe", "sentiment": "none"}, {"name": "midas group", "sentiment": "none"}, {"name": "local enterprise partnerships", "sentiment": "none"}, {"name": "falmouth university", "sentiment": "none"}, {"name": "swig finance", "sentiment": "none"}, {"name": "met office super computer", "sentiment": "none"}, {"name": "pennon group", "sentiment": "none"}, {"name": "mole valley farmers", "sentiment": "none"}, {"name": "cornwall business council", "sentiment": "none"}, {"name": "software cornwall", "sentiment": "none"}, {"name": "university of exeter", "sentiment": "none"}, {"name": "met office", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "South West is ready to grow as new Brexit era dawns By HannahFinch | Posted: March 30, 2017 0 COMMENTS SHARES GOONHILLY: Our innovators are changing the face of the Westcountry South West is ready to grow as new Brexit era dawns X \nCopy link to paste in your message / Comments (0) \nHigh-profile figures from construction to food production are set to create the South West Business Leaders' forum - the next step in the #BackTheSouthWest campaign. \nLast year, the campaign spearheaded by the Western Morning News and the Pennon Group and with support of the region's LEPs, culminated in the publication of the South West Growth Charter, which was delivered to Government . \nThe Met Office Super Computer installation has been a major driver for growth of innovative industries in Exeter \nNow the task is to make the aspirations set out in the charter a reality.The aim is to secure a bright economic future and attract new Government investment for the region. \nPennon chief executive Chris Loughlin said: \"The campaign has already achieved so much but it's important that we keep up the momentum and continue to work together as a business community, alongside the Local Enterprise Partnerships, the region's MPs, government and academics to pursue regional growth and secure a great future for the South West.\" \nSome of the region's largest employers – Stephens Scown, Foot Anstey, Falmouth University, University of Exeter , SWIG Finance and Mole Valley Farmers – have joined the second phase of the campaign that champions the region, aims to pool resources and take a unified voice to government. \nThere is no doubt the face of the Westcountry economy is changing. In areas that once relied on farming, micro-enterprise and home working have taken their place.The number of cranes on the Plymouth skyline is testament to the development in our cities where office space is at a premium. Student accommodation is being built faster than the freshers can enrol – this is a recognition of the contribution are universities and educational institutions are making to the economy. \nIt is a far cry from the bucket-and-spade image of Devon and Cornwall but the value of tourism and protecting our natural assets cannot be underestimated.Dartmoor National Park is estimated to be worth £400 million a year for the South West, for example. \nThe natural beauty of our region is one of the main reasons people choose to live and work here.Hotel entrepreneur Robin Hutson is almost a year into the opening of the £9 million PIG at Combe at Honiton and celebrity chef Michael Caines has just opened Lympstone Manor on the edge of the Exe Estuary after a £8.5million refurbishment. Mr Caines said: \"This investment should bring a huge amount of confidence in the local economy. We made a decision to employ local tradesmen for the building project and now we seek to employ local people to run the hotel. Add to that the fact that our demographic of client will be coming from all over the country and indeed the world to experience Lympstone Manor at this outstanding location.\" \nRead next: Michael Caines wants to make Lymptone Manor the best hotel in the UK \nWhile tourism and the rise of high-end staycations continues to be a success story for the region, the downside can be seasonal low skilled work . The outlook for employment is changing – if you are skilled in the right sectors. \nThe Tech Nation 2017 report has revealed how the sector is transforming some of our most deprived communities. From artificial intelligence, to the Internet of Things, cloud-based services, virtual reality or even drone filming, there are more than 680 tech companies in Cornwall supporting more than 1,300 highly paid jobs and all are growing and recruiting at an extraordinary rate. \nThe Tech Cluster at Pool Innovation Centre is at the forefront of Cornwall's fast-growing tech sector which is already contributing more than £39 million to the local economy.With advertised average salaries of £34,367 – almost twice the average salary in Cornwall of £17,340 – this is an industry offering good careers for talented young people keen to stay in the Duchy. \nToby Parkins, co-founder of Headforwards, and leading member of Software Cornwall, said: \"People might not think so because we're in Cornwall, but companies here are pioneering some of the latest ideas and technologies. We are much further forward than many firms in the South East or in London which means that for other companies it is an advantage to work with companies in Cornwall. \n\"If you have the space to think about things and are relaxed you have time to solve problems and be creative.\" \nRead next: Camborne Pool Redruth: How technology is turning a deprived part of Cornwall into Silicon Valley \nThe tech sector is identified in the government's Industrial Strategy as an area to lead the economy as the UK prepares to leave the EU. There is £170million Government cash available for a new emphasis on science, technology, engineering and innovation. It is up to the South West to grab a part of it. \nSteve Hindley, chairman of Midas Group and chairman of the Heart of the South West, said that the region should chase the objectives set out in the strategy to secure investment in infrastructure, training, research and innovation. \nSpeaking at the Devon and Cornwall Business Council spring conference earlier this month, he said: \"I would like to see more co-ordination in the South West with the industrial strategy for our aeronautical, marine, food, nuclear, data analytics and creative sectors. \n\"We have got an enthusiastic bunch of business people that are leading in the agenda and that's the way the Government begins to take notice of the South West. It is my wish that we get our act together before we go to government.\" \nThe South West is more than ready to lead on the Industrial Strategy . The Green Paper sets out technologies where Britain has strengths in research and development which could be supported through the government's new Industrial Strategy Challenge Fund, including smart energy technologies; robotics and artificial intelligence and 5G mobile network technology. \nFrom the Met Office £100 million supercomputer, the Oceangate marine zone development in Plymouth to the Goonhilly satellite and space research hub, the region's big data, research and tech sectors are ready to rocket. \nBen Rhodes, chief executive of the Devon and Cornwall Business Council, said the South West is well placed to take advantage of the deals on offer. He said: \"The South West has led the way by developing a robust and objective 'Science and Innovation Audit', highlighting areas of genuine world-leading research and innovation, which should put the region in a prime position to receive Government backing through the industrial strategy.\" \nThe Tech Nation 2017 report shows the digital tech industry is giving the South West economy a £271 million surge every year – and providing high salaries for workers.In Plymouth, the report says, tech is worth £82 million in digital Gross Value Add digital economic output. \nThe report says 84% of Plymouth tech workers rate digital growth optimism as \"good\", while 83% rate quality of life as \"good\". In Exeter, 98% of workers say the quality of life is \"good\" – the highest rating in the UK. Tech is worth £150 million to Exeter in terms of digital Gross Value Add digital economic output and the average salary is £38,204. \nPart of the continued success has to be investment in transport and digital infrastructure. Foot Anstey chairman Simon Gregory said regional connectivity cannot afford to be compromised as it was in the storms of 2014. He said: \"This caused disruption for many businesses and highlighted how dependent we are on it. In contrast, our online connectivity has seen significant investment, helping the region to create startup businesses, boost entrepreneurial activity and bringing skills and work opportunities to the region. So much so, the recent tech nation report highlights Exeter, Plymouth and Truro and Redruth as tech clusters which are at the forefront of global digital innovation.\" \nHowever, our crumbling road and rail network needs a similar amount of energy to bring it into the 21st century. Our road and rail links need to be fit for purpose as they represent the lifeblood of the region supporting all our major industries.\" \nThe Met Office has been a major catalyst in driving job growth and private sector investment including at the nearby Exeter Science Park. \nPart of that is the success of Exeter Airport that has enjoyed record passenger numbers for the past four years. Collaboration through Exeter and East Devon Growth Point has been key to securing inward investment and infrastructure and working together is vital for the region. \nExeter Airport managing director Matt Roach said: \"If we are to get the levels of infrastructure and investment we need, we have to be consistent and loud enough to get our voice heard. We can't just wait around for things to happen, we have got to get out there and take the initiative ourselves.\" Read next", "external_links": [], "published": "2017-03-30T15:58:00.000+03:00", "crawled": "2017-03-30T12:41:09.657+03:00", "highlightTitle": ""}