{"organizations": [], "uuid": "1c949a5a29daf9176266c5a15fe1cb159bb68060", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article7330360.ece/ALTERNATES/s1200/JS40363549.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/more-high-skilled-jobs-needed-12718122", "country": "GB", "domain_rank": 21960, "title": "More high-skilled jobs needed to transform lives in the North East", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "More high-skilled jobs needed to transform lives in the North East", "spam_score": 0.0, "site_type": "news", "published": "2017-03-10T07:01:00.000+02:00", "replies_count": 0, "uuid": "1c949a5a29daf9176266c5a15fe1cb159bb68060"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/more-high-skilled-jobs-needed-12718122", "ord_in_thread": 0, "title": "More high-skilled jobs needed to transform lives in the North East", "locations": [], "entities": {"persons": [{"name": "john holman", "sentiment": "none"}, {"name": "andrew hodgson", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "john cridland", "sentiment": "none"}, {"name": "sarah green", "sentiment": "none"}], "locations": [{"name": "north east get", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "wallsend", "sentiment": "none"}, {"name": "newcastlegateshead hilton hotel", "sentiment": "none"}], "organizations": [{"name": "cbi", "sentiment": "none"}, {"name": "lep", "sentiment": "none"}, {"name": "gatsby foundation", "sentiment": "none"}, {"name": "smd ltd.", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "north east local enterprise partnership", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nMore high-skilled jobs are needed to transform lives in the North East , according to ambitious plans being put forward by the body charged with driving the region’s economic growth. \nThe North East Local Enterprise Partnership (LEP) will today re-launch its strategic economic plan (SEP) and say that it is ahead of its 10-year target to create 100,000 ‘new and better jobs’ by 2024. \nBut despite that success, the LEP has said it wants more of the new jobs created in the region to be highly skilled - and therefore more likely to be higher paid. \nOf the 53,000 new jobs created in the region since 2014, 63% of these are classed as being higher skilled. With the re-launch of the economic plan, however, the LEP has set itself a target of raising that level to 70% over the next seven years. \nAndrew Hodgson, chair of the North East LEP, said: “We believe that now is the right time to be more ambitious for the North East. The progress we have made towards the targets we set out in the original SEP in 2014 has exceeded our expectations. Andrew Hodgson of SMD Ltd. in Wallsend \n“As well as refreshing our delivery plan, we have also revised our key targets. Our aim will be to reach our target of 100,000 more and better jobs early and stretch that further. \n“Given the need to address the productivity challenge, it is particularly encouraging that the percentage of better jobs created has reached 63%, already ahead of our original target.” \nThe LEP has worked with the business community and others partners across the region to refresh the economic plan for 2017. \nThe aim has been to better reflect a changing business and political landscape dominated by Brexit and the challenges of globalisation. The SEP sets out how the region can build on the LEP’s recent successes and continue to create more and better jobs for the region. \nThe new plan will be outlined to business and political leaders at the NewcastleGateshead Hilton Hotel this morning. Sarah Green, CBI \nSpeakers at the event will include Sarah Green, CBI director of regions and nations, John Cridland, chair of Transport for the North, and Professor Sir John Holman of the Gatsby Foundation, a body that aims to transform careers advice for young people which has been working closely with the LEP. \nAt today’s launch the LEP will say that employment in the North has increased at a rate of 6.6% over the past two years, beating the national average of 5.4% and making the North East a £37bn economy. \nDigital technology, advanced manufacturing, healthcare innovation, energy, the service sector and quality business space are the sectors identified as underpinning the growth in regional employment. \nBut the LEP will admit that key challenges remain for the North East to tackle, with higher productivity essential if the region is to narrow the gap with the rest of the country and economic exclusion a “persistent concern” in some parts of the area. Like us on Facebook", "external_links": [], "published": "2017-03-10T07:01:00.000+02:00", "crawled": "2017-03-10T03:01:37.665+02:00", "highlightTitle": ""}