{"organizations": [], "uuid": "f972806f90a11654692d0781c901f67001ccb17c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12241781.ece/ALTERNATES/s1200/Sports-Direct-agency-worker-conditions.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12738684", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast RECAP: Sports Direct accuses lobby group of 'fake news' over executive pay", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast RECAP: Sports Direct accuses lobby group of 'fake news' over executive pay", "spam_score": 0.0, "site_type": "news", "published": "2017-03-15T14:55:00.000+02:00", "replies_count": 0, "uuid": "f972806f90a11654692d0781c901f67001ccb17c"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12738684", "ord_in_thread": 0, "title": "Business Breakfast RECAP: Sports Direct accuses lobby group of 'fake news' over executive pay", "locations": [], "entities": {"persons": [{"name": "jonathon manning", "sentiment": "negative"}, {"name": "carlos neves", "sentiment": "none"}, {"name": "john treharne", "sentiment": "none"}, {"name": "gemma manson", "sentiment": "none"}, {"name": "neville stanton", "sentiment": "none"}, {"name": "dave prentis", "sentiment": "none"}, {"name": "damian thompson", "sentiment": "none"}, {"name": "jeremy blackburn", "sentiment": "none"}, {"name": "barney frith", "sentiment": "none"}, {"name": "adam corlett", "sentiment": "none"}, {"name": "beth farhat", "sentiment": "none"}, {"name": "jonathan brady/pa wire", "sentiment": "none"}], "locations": [{"name": "slough city centre", "sentiment": "none"}, {"name": "north tyneside", "sentiment": "none"}, {"name": "darlington  the region", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "darlington", "sentiment": "none"}, {"name": "bedford", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "spanish city", "sentiment": "none"}], "organizations": [{"name": "treasury", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "the gym group", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "newcastle building society", "sentiment": "none"}, {"name": "lords science and technology committee", "sentiment": "none"}, {"name": "turbo power", "sentiment": "none"}, {"name": "work institute", "sentiment": "none"}, {"name": "royal institute of chartered surveyors", "sentiment": "none"}, {"name": "company", "sentiment": "none"}, {"name": "tao sustainable power solutions uk", "sentiment": "none"}, {"name": "turbo power inc", "sentiment": "none"}, {"name": "obr", "sentiment": "none"}, {"name": "tuc", "sentiment": "none"}, {"name": "gym group", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "berkshire", "sentiment": "none"}, {"name": "house of lords", "sentiment": "none"}, {"name": "rics", "sentiment": "none"}, {"name": "richard doughty photography", "sentiment": "none"}, {"name": "university of southampton", "sentiment": "none"}, {"name": "jonathon manning boutique", "sentiment": "none"}, {"name": "jonathon manning gym group", "sentiment": "none"}, {"name": "resolution foundation", "sentiment": "none"}, {"name": "square one law", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning 'Motorists' minds will wander at wheel of driverless cars \nDriverless cars could cause crashes because motorists may be encouraged to read, check emails or watch a film at the wheel, peers have warned. \nThe House of Lords raised concerns about people becoming too reliant on technology and failing to react fast enough while using a semi-automated vehicle. \nProfessor Neville Stanton, from the University of Southampton, said there are significant concerns about vehicles which require drivers to take over in an emergency. He told peers: \nAs vehicles become fully autonomous, even the most observant human driver’s attention will begin to wane. \nTheir mind will wander, and they may start to mentally switch off from the job of driving. \nThis is particularly true if they are engaging in other activities such as reading, answering emails, engaged in conversations with passengers, watching movies or surfing the internet. \nThe Lords Science and Technology Committee found that it is not yet clear if driverless cars would reduce accidents caused by human error. \nThe committee stated in its report: \nThe Government should give priority to commissioning and encouraging research studying behavioural questions and ensure it is an integral part of any trials it funds. \nPeers also said industries such as farming are most likely to benefit and that Parliament should not be distracted by “media attention around driverless cars”. A driver at the wheel (Photo: Jonathan Brady/PA Wire) 8:51 KEY EVENT North East has become UK capital of insecure work, new study says \nThe North East has become the UK capital of insecure work, with the equivalent of two-thirds of jobs created in the North East in the last five years being without guaranteed pay or normal employment rights . \nAnalysis by the TUC found that employment in the North East grew by 60,000 between 2011 and 2016, but 40,000 of those jobs were without guaranteed hours or baseline employment rights. \nThe union body estimates that 124,000 people now work in insecure jobs in the region – the equivalent of one in nine workers, giving the North East the highest rate of insecure work in the UK. \nThe study, commissioned by the TUC from the Learning and Work Institute, defines insecure work as seasonal, casual, temporary or agency work, those on zero-hours contracts and low-paid self-employed workers. \nIt said the insecure jobs tend to be in traditional industries such as education, restaurants and social care, rather than newer technology sectors are often highlighted for favouring flexible working conditions. \nTUC Regional Secretary Beth Farhat said: \nInsecure working in the North East has shot up in recent years. \nPeople need jobs they can live on. But if you don’t how much work you will have from one day to the next, making ends meet can be nightmare. \nToo many bosses in our region are getting away with shady employment practices. That’s why we are asking people who feel vulnerable at work to share their stories confidentially with us. \nWe need to keep the pressure up on Government to improve protections for working people. Every day unions expose bad working conditions and win important victories for workers across the country. Beth Farhat KEY EVENT Loss of single market access could put 200,000 constructions jobs under threat \nAlmost 200,000 construction jobs are at risk if access to the single market is lost because of Brexit, a new report warns. \nSome of the country’s biggest infrastructure projects will be threatened by such a huge loss of workers, said the Royal Institute of Chartered Surveyors (RICS). \nAround 8% of construction workers in this country are EU nationals, showing their importance to the industry. Construction is already in the grip of a skills crisis, warned RICS. \nThe group’s head of UK policy, Jeremy Blackburn, said: \nThese figures reveal that the UK construction industry is currently dependent on thousands of EU workers. \nIt is in all our interests that we make a success of Brexit, but a loss of access to the single market has the potential to slowly bring the UK’s £500bn infrastructure pipeline to a standstill. \nThat means that unless access to the single market is secured or alternative plans are put in place, we won’t be able to create the infrastructure needed to enable our cities to compete on a global stage. RICS Head of Policy, Jeremy Blackburn 8:39 Jonathon Manning Boutique hotel operator plans Newcastle opening with Square One Law aid \nA boutique hotel operator is planning a Newcastle opening after linking up with law firm Square One Law. \nThe Newcastle-based firm said its work with a major operator, which is looking to open a hotel in a city centre landmark, is just one of a number of clients that are proving that the leisure sector is booming. \nThe sector is serving up a boost with the law firm, with commercial property transactions significantly on the rise within the North East and beyond. \nWhile some analysts have predicted a downturn in confidence and demand from investors, the Newcastle law firm said its has seen an upturn in volumes, with many clients seeing this as an opportune time to expand their portfolios. \nThe firm has been involved in hotel developments in North Tyneside and Berkshire, and is currently working with developers on a number of Newcastle city centre developments, including with a boutique hotel operator poised for an opening. \nSquare One Law has seen an upturn in the volume of commercial property activity in the leisure sector, having advised on an increasing number of transactions over the last year. \nBarney Frith, commercial property specialist and head of Square One Law’s property team, said: \nNot only are we involved in the development of a 68-bed Premier Inn at Spanish City, but we have also recently advised on a 131-bed Premier Inn in Slough City Centre for London-based developer client Landid, and acted on behalf of an investor on the acquisition of a 40-bed Travelodge in Bedford. Barney Frith head of property team at Square One Law at Spanish City (Photo: Square One Law) 8:35 Jonathon Manning Newcastle Building Society invests in new branch for Darlington \nThe region’s biggest building society is raising its presence in the North East as part of a branch network investment programme. \nNewcastle Building Society is on the move into a new open plan branch and financial advice centre in Darlington, where better access to services and private meeting spaces for customers will also be served up. \nWork has started on the ten-week building programme, with the official opening expected to take place in early May. \nThe society’s existing Darlington branch, on Skinnergate, will remain open until the new branch is ready, when the five-strong branch team, led by manager Gemma Manson, will all move across to premises on Horsemarket. \nDamian Thompson, customer director at Newcastle Building Society, said: \nWhile our high quality telephone and digital services are extremely well used, our branch network remains at the heart of the services we provide, and we are constantly looking for ways to improve the face-to-face experience for our customers. \nWe strongly believe that financial advice should be easily available to everyone and this commitment is very visible in our branch developments. \nPeople prefer a face-to-face discussion when making important financial decisions, and the dedicated private meeting rooms for our financial advisers, alongside an open and welcoming space for general branch transactions provides the right environment for just that. \nThe society’s latest investment in Darlington follows major enhancements at a number of other locations across the North East in the last year. Newcastle Building Society's Darlington branch manager Gemma Manson (Photo: Richard Doughty Photography) 8:30 Jonathon Manning Public sector workers feel the pinch as real pay levels fall \nThe average pay of public sector workers is falling following years of wage restraint coupled with rising inflation, a new report reveals. \nThe Resolution Foundation forecast that average real pay will fall back below 2004/5 levels by the end of the current Parliament in 2020. \nOn current trends, the average pay of public sector workers will be £1,700 lower in 2020 than its peak in 2010, said the think tank. \nAdam Corlett, economic analyst at the Resolution Foundation, said: \nWhile rising inflation is applying the brakes to real pay growth across the board, the outlook for public sector pay looks particularly weak. \nPay is now actually falling and, worst, is expected to continue for the rest of the parliament, with levels at the end of the parliament dropping back to levels last seen in 2004. \nAlthough public sector pay restraint is important to the government’s deficit reduction plans, falling real pay is likely to see increasing recruitment strains. \nThe Government should be planning now how to manage those strains, alongside any wider changes to policies like migration that will also have an impact. \nThe lowest earners will be protected from falling pay because of planned increases in the National Living wage, it was predicted. \nPay growth has been particularly weak in in health and social work and could fall by a further 6% by 2020, it was found. \nUnison General Secretary Dave Prentis commented: \nAfter years of pay restraint those delivering our public services are facing yet more financial hardship. \nSchool staff, nurses and council workers are struggling to make ends meet. If ministers don’t reverse their damaging policy of zero or 1% rises it will be harder to recruit new staff or keep those with experience. \nA Treasury spokesman said: \nThe Government has made difficult decisions on public sector pay to maintain fiscal discipline and protect jobs. \nThe OBR has forecast that current pay policy will protect approximately 200,000 jobs across the UK. Nurse are among those whose real pay is falling (Photo: PA) 8:25 Jonathon Manning Gym Group plans more openings after posting first full-year profit \nOpenings in the North East helped low-cost fitness chain The Gym Group post its first full-year profit . \nThe company - which has opened three gyms in Newcastle in the last year - said it swung out of the red with maiden pre-tax profits of £6.9m in 2016 against losses of £12.4m the previous year. \nThe Gym Group, which floated in November 2015, added another 72,000 members in the year, up nearly a fifth at 448,000, after opening another 15 gyms. \nIt said the new year fitness drive helped it notch up record numbers of new members in January and February, with another 47,000 signed up. \nIt now plans to open nearly 20 gyms over 2017 - at the top end of its previous expectations for between 15 to 20. \nJohn Treharne, chief executive of The Gym Group, said 2016 had been a “good year” for the group. \nHe added: \nWe will continue to expand rapidly in 2017 through a well-developed site pipeline. \nWe have had an encouraging start to 2017 with January and February, key months for any gym business, showing record membership levels. Inside one of The Gym Group's fitness centres 8:20 KEY EVENT Gateshead's struggling Turbo Power Inc continues hunt for buyer \nGateshead-headquartered Turbo Power Inc is continuing its search for a buyer after revealing the company made a £765,000 loss last year. \nThe power solutions company said that it has received “expressions of interest” in the business and that further announcements of these discussions would be made in due course. \nThe firm said, in a statement made in its accounts, said: \nA strategic review of the Company’s business, remains ongoing. \nThe Board notes, as previously reported, that all expressions of interest received to date from potential offerors for 100% of the issued and to be issued share capital of the Company on a debt-free, cash-free basis have been indicatively priced at a substantial discount to the prevailing share price. \nFurther announcements will be made in due course, as appropriate. \nThe comments were made in the firm’s latest financial results for the year ending December 31 2016. Turbo Power’s made a net loss of £765,000 at the year end, a reduction in the £848,000 loss it made in 2015. \nDespite the poor profit figures the firm increased its revenue by 4%, from £13.39m to £13.92m. \nTurbo Power has also terminated a project, that had been backed by a grant issued by the Regional Growth Fund. As a result the business repaid the £419,000 to the Regional Growth Fund, and used its parent company Tao Sustainable Power Solutions UK as a guarantor. \nTurbo Power chief executive Carlos Neves said: \nI am extremely proud of the whole TPS team for the results achieved in 2016. The improved performance versus the previous year in revenues, gross margin and investments in R&D confirms the turnaround being achieved by the business. Adjusted Operating Profit of £0.38 million is up 138% from 2015 and it demonstrates the sustainable profitability achieved by the business. \nThe increasing order intake in 2016 is a testament to the Company’s product offering that coupled with the strong pipeline of enquiries give us confidence in the outlook for 2017. Electricity pylons (Photo: Andrew Milligan/PA Wire) 8:15", "external_links": [], "published": "2017-03-15T14:55:00.000+02:00", "crawled": "2017-03-15T11:28:14.943+02:00", "highlightTitle": ""}