{"organizations": [], "uuid": "3e9bb63d03cadcf73b1651358942fdff37027cd8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article11710229.ece/ALTERNATES/s1200/JS70842399.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/farming/farming-leaders-welcome-reassurances-ministers-12791995", "country": "GB", "domain_rank": 21960, "title": "Farming leaders welcome reassurances from Ministers over Brexit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Farming leaders welcome reassurances from Ministers over Brexit", "spam_score": 0.0, "site_type": "news", "published": "2017-03-24T22:15:00.000+03:00", "replies_count": 0, "uuid": "3e9bb63d03cadcf73b1651358942fdff37027cd8"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/farming/farming-leaders-welcome-reassurances-ministers-12791995", "ord_in_thread": 0, "title": "Farming leaders welcome reassurances from Ministers over Brexit", "locations": [], "entities": {"persons": [{"name": "george eustice", "sentiment": "none"}, {"name": "meurig raymond", "sentiment": "none"}, {"name": "defra", "sentiment": "none"}, {"name": "darren pepe", "sentiment": "none"}, {"name": "mrs leadsom", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "andrea leadsom", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "raymond", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "brexit farming", "sentiment": "negative"}, {"name": "brexit nfu", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "whitehall", "sentiment": "none"}, {"name": "share national farmers union", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "nfu", "sentiment": "none"}, {"name": "hexham", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Farming leaders welcome reassurances from Ministers over Brexit NFU leaders have met Government Ministers as concerns grow over how Brexit will affect the agricultural industry Share National Farmers Union President Meurig Raymond (Photo: Darren Pepe) Share Get business   Thank you for subscribing!   \nFarming leaders have welcomed assurances from Ministers that the Government is ready to fight the case for the agricultural industry in the Brexit negotiations. \nWith Prime Minister Theresa May set to trigger Article 50 next week, a number of farming groups have expressed concerns that a ‘hard Brexit’ would be harmful to the agricultural sector. \nConcerns have also been expressed that much of the current rhetoric around immigration would leave farming businesses in many parts of the country unable to access the seasonable labour it needs. \nBut NFU president Meurig Raymond has struck a more positive tone after a meeting this week with Environment Secretary Andrea Leadsom and Farming Minister George Eustice. \nMr Raymond said: “I am delighted that the Defra ministerial team shares our ambition to maintain free and open trade with the EU once we leave, and that they also acknowledge the need to ensure that future reforms to the immigration system accommodate the labour requirements of the food and farming sectors. \n“We had an encouraging discussion about the form of a future domestic agricultural policy once we are no longer subject to the CAP. Read More Hexham young farmers' competition aims to find the stockmen of tomorrow \n“I am pleased the Secretary of State and farming minister are in broad agreement with us that farmers should continue to be supported after 2020 to mitigate volatility, reward environmental delivery, and to promote greater productivity and competiveness in their businesses. This will allow us to secure a resilient future for UK farming that delivers for both farmers and the wider public. \n“The news stories over the weekend about the activities of Brazilian meat processers trading rotten beef and poultry have reminded us of the importance of supporting domestic producers who uphold the high standards of British food production and enjoy the trust of UK consumers.” \nMr Raymond said he was also reassured by Mrs Leadsom’s positive assessment of the readiness of her department for the task ahead. \nHe said: “She has good reason to believe that Defra is attracting some of the best talent, both within and outside Whitehall, to manage its Brexit workload and to ensure food, farming and the environment continue to be at the heart of the government’s thinking in its Brexit negotiations. Read More North East farmers welcome decision that commonly-used weedkiller does not cause cancer \n“It’s crucial that this continues to be the case, and we will be working closely with Defra to make sure our priorities are also the government’s priorities in the weeks and months ahead.” \nThe farming industry is widely thought to be among those with the most to lose - or gain - from Brexit. \nIt has been estimated that EU subsidies currently make up an average of 60% of farm incomes, and that 90% of farm businesses would fail without subsidies. \nBut a number of farmers have also expressed hope that a new deal for farmers could cut some regulations and leave the county better able to trade with the rest of the world. Like us on Facebook", "external_links": [], "published": "2017-03-24T22:15:00.000+03:00", "crawled": "2017-03-24T17:38:21.884+03:00", "highlightTitle": ""}