{"organizations": [], "uuid": "d5a6ac34fc6a203cbf844315f7f587e82094c74d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12514626.ece/ALTERNATES/s1200/JS110215088.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/internet-giants-facebook-google-could-12823171", "country": "GB", "domain_rank": 21960, "title": "Internet giants Facebook and Google could be told to subsidise local news media", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Internet giants Facebook and Google could be told to subsidise local news media", "spam_score": 0.0, "site_type": "news", "published": "2017-03-31T01:50:00.000+03:00", "replies_count": 0, "uuid": "d5a6ac34fc6a203cbf844315f7f587e82094c74d"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/internet-giants-facebook-google-could-12823171", "ord_in_thread": 0, "title": "Internet giants Facebook and Google could be told to subsidise local news media", "locations": [], "entities": {"persons": [{"name": "helen", "sentiment": "negative"}, {"name": "helen goodman", "sentiment": "none"}, {"name": "goodman", "sentiment": "none"}, {"name": "mrs goodman", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}], "organizations": [{"name": "google", "sentiment": "negative"}, {"name": "facebook", "sentiment": "negative"}, {"name": "kings college london", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "nuj", "sentiment": "none"}, {"name": "national union of journalists", "sentiment": "none"}, {"name": "bishop auckland", "sentiment": "none"}, {"name": "competition and markets authority", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Internet giants Facebook and Google could be told to subsidise local news media North East MP Helen Goodman looks for ways to keep local newspapers open but also criticises publishers Share The Google logo (Photo: Yui Mok/PA Wire) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nInternet firms such as Google and Facebook could be asked to pay more tax to subsidise local and regional newspapers, Ministers have been told. \nBishop Auckland MP Helen Goodman said news was increasingly read online, but firms such as Google and Facebook had the lion’s share of the online advertising market. \nAnd she suggested the Competition and Markets Authority, the Government body which promotes competition and prevents monopolies forming, could investigate. \nLeading a Commons debate, she said: “Many of us think it is reasonable, in the current climate, to tax the large social media organisations such as Facebook and Google, and others as well. \n“I know everybody wants to tax them because they are evading their taxes and everyone has schemes for spending the money that would be raised, but I think some direct read-across to the very industries that those companies are undermining would be reasonable.” \nNews was increasingly read online but the industry struggled to gain online advertising revenue, she said. \n“Facebook and Google are expected to have a three-quarters share of the advertising market by 2020. I wonder whether the Competition and Markets Authority ought to look at that, and whether it can look at the behaviour of these big international corporations after Brexit.” \nThe Labour MP , who chairs the National Union of Journalists (NUJ) parliamentary group, was leading a Commons debate on local and regional news providers. Helen Goodman (Photo: PA Wire) \nLocal news is essential for democracy but the industry is currently under threat, she said. \nMrs Goodman told MPs that communities are “bound together” through local media, adding: “It is through local newspapers and radio stations that people know what is going on and identify with their local communities.” \nBut the MP highlighted a study by academics at Kings College London and commissioned by the NUJ which found that 200 local newspapers have closed since 2005. \nIn the past 18 months, 22 have closed and 13 have been set up, a net loss of nine. And 418 journalists’ jobs have gone. \nShe said: “It is a matter of concern that 58% of people in this country have no local daily newspaper. That hollowing out is dangerous. \n“Newspapers are not really local if they are run by such a small number of journalists that, in effect, they are four pages of local news wrapped around centrally-produced content, which is mainly lifestyle articles and listicles.” \nMrs Goodman also warned that the number of businesses involved in running local newspapers had fallen, as the remaining papers were bought up by a small number of firms. \nLocal news should be seen as a public service rather than a purely commercial operation, she said. \n“We need to get back better control of the way newspapers are run and restore the idea ... that journalism is a sort of public service. It is not purely a commercial enterprise; it is also a public service.” \nHowever, she also said newspaper publishers had unrealistic expectations about profits. \nSupermarket chains were content with profit margins on 7% but publishers expected margins of 20% or 30%, she said. \nMrs Goodman also suggested that newspaper publishers considering closing a title could be asked to offer it to local community organisations before shutting it down. Like us on Facebook", "external_links": [], "published": "2017-03-31T01:50:00.000+03:00", "crawled": "2017-03-30T21:35:56.839+03:00", "highlightTitle": ""}