{"organizations": [], "uuid": "39350fdfbbbf52b7f43c753c594d2648caf6101c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12737211.ece/ALTERNATES/s1200/JS45895489.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12732197", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast RECAP: Stadium Group on hunt for further acquisitions", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast RECAP: Stadium Group on hunt for further acquisitions", "spam_score": 0.0, "site_type": "news", "published": "2017-03-14T14:55:00.000+02:00", "replies_count": 0, "uuid": "39350fdfbbbf52b7f43c753c594d2648caf6101c"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12732197", "ord_in_thread": 0, "title": "Business Breakfast RECAP: Stadium Group on hunt for further acquisitions", "locations": [], "entities": {"persons": [{"name": "george eustice", "sentiment": "none"}, {"name": "ian paisley", "sentiment": "none"}, {"name": "neil stephenson", "sentiment": "none"}, {"name": "paisley", "sentiment": "none"}, {"name": "eustice", "sentiment": "none"}, {"name": "hadaway", "sentiment": "none"}, {"name": "alastair waite", "sentiment": "none"}, {"name": "jonathon manning ward hadaway", "sentiment": "none"}, {"name": "john schorah", "sentiment": "none"}, {"name": "mathieson", "sentiment": "none"}, {"name": "weightman", "sentiment": "none"}, {"name": "ward hadaway", "sentiment": "none"}, {"name": "fiona cruickshank", "sentiment": "none"}, {"name": "amanda white", "sentiment": "none"}, {"name": "ion", "sentiment": "none"}, {"name": "schorah", "sentiment": "none"}, {"name": "joe giddens/pa wire", "sentiment": "none"}, {"name": "gabriel", "sentiment": "none"}, {"name": "jamie martin", "sentiment": "none"}, {"name": "jonathon manning brexit", "sentiment": "none"}, {"name": "alistair waite", "sentiment": "none"}, {"name": "rob mathieson", "sentiment": "none"}, {"name": "yvette cooper", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "leeds", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "north antrim", "sentiment": "none"}, {"name": "tyneside", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "republic of ireland", "sentiment": "none"}], "organizations": [{"name": "jonathon manning social media giants", "sentiment": "negative"}, {"name": "committee", "sentiment": "none"}, {"name": "dup", "sentiment": "none"}, {"name": "altec engineering", "sentiment": "none"}, {"name": "leeds", "sentiment": "none"}, {"name": "commons home affairs", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "facebook and twitter", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "ward hadaway", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "ion", "sentiment": "none"}, {"name": "northern farming conference 8:55 jonathon manning newcastle", "sentiment": "none"}, {"name": "ayo digital", "sentiment": "none"}, {"name": "farmers", "sentiment": "none"}, {"name": "onyx group", "sentiment": "none"}, {"name": "liverpool", "sentiment": "none"}, {"name": "google", "sentiment": "none"}, {"name": "redu group", "sentiment": "none"}, {"name": "twitter", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning Social media giants quizzed over hate crime reponses \nSocial media companies will be grilled by MPs over their response to hate crime and abuse. \nSenior representatives of Google, Facebook and Twitter will appear at the Commons Home Affairs committee. \nThey will be quizzed about their firms’ efforts to tackle hatred and abuse on their platforms. \nLabour MP Yvette Cooper, chair of the Committee, said: \nWe’ve seen too many cases of vile online hate crimes, harassment or threats where social media companies have failed to act. \nIt cannot be beyond the wit and means of multibillion-dollar social media companies like Twitter, Facebook, and Google to develop ways to better protect users from hatred and abuse. \nThey have a duty to do so. We will be asking the companies about specific cases, why they didn’t act, and what they intend to do about it now. \nHate crime has come under the spotlight in recent months after figures showed reports of incidents to police surged in the aftermath of the EU referendum. And a number of high-profile trolling cases have sparked scrutiny of the issue of online abuse. Yvette Cooper (Photo: Joe Giddens/PA Wire) 9:00 Jonathon Manning Brexit will allow farmers to cash in on chicken feet exports, minister says \nFarmers could cash in on chicken feet by increasing exports to China for business after Brexit, a farming minister has said. \nGeorge Eustice said there were opportunities to increase exports of the popular snack to China and other regions where parts of the bird often rejected by British shoppers are highly sought after. \nMinisters have previously agreed a deal to export pigs’ trotters to China to increase access to new markets. \nThe comments came during a Commons debate led by DUP MP Ian Paisley (North Antrim) about the effect of Brexit on poultry producers. \nMr Eustice told MPs: \nIt never ceases to amaze me that chicken feet are a delicacy in China and can attract a high value, far, far higher than they can get here in the UK. \nBut there are real opportunities to create value from parts of the carcass for which there is no market in the UK or indeed in Europe. \nThe other point I would make is there has always been quite a worldwide trade in poultry because we consume more white poultry meat than we produce, so we import white poultry meat traditionally but we have also had to export dark poultry meat which is in demand in other parts of the world.” \nMr Paisley also raised concerns about a cap on the number of migrant workers on the industry and called for a frictionless border between Northern Ireland and the Republic of Ireland to prevent problems with movement of poultry. George Eustice at the Northern Farming Conference 8:55 Jonathon Manning Newcastle tech firm ION steps up growth and secures support from high-profile trio of investors \nA Tyneside tech firm is stepping up a gear after securing support from three high-profile North East business figures . \nNewcastle-based ION has been providing Salesforce CRM (customer relationship management) software and cloud computing solutions to clients since it was launched last summer. \nNow it has secured major private investment from Neil Stephenson, former CEO of Onyx Group and chairman of Redu Group, Alistair Waite, CEO of Altec Engineering and Fiona Cruickshank, founder of The Specials Laboratory and Gabriel Investors. \nThe firm was set in motion in August 2016 by Rob Mathieson, who was previously a director of AYO Digital until it went into liquidation in 2014. \nION is a registered consulting partner for Salesforce, which is designed to allow companies of all sizes to connect to their customers using the latest innovations in cloud, social, mobile and data science technologies. \nThe Gosforth-based firm’s key markets include the manufacturing, engineering and pharmaceutical sectors but the new investment will help ION expand its team of developers and Salesforce specialists, extending its reach into new markets. \nMr Mathieson said: \nThe systems we implement help firms significantly increase sales by enabling them to sell faster and smarter. Since launching ION, we have delivered Salesforce across multiple markets in the North East. \nThis new investment in ION will support us in realising our growth objectives and allow us to boost our staff levels further, providing services to a wider range of clients. \nWe are actively recruiting for developers and cloud consultants to join our team and we’re excited to be accelerating our growth with the support of three of the North East’s most experienced and forward-thinking business figures. Rob Mathieson managing director of ION, second left, with investors Alastair Waite, Fiona Cruickshank OBE and Neil Stephenson (Photo: ION) 8:50 KEY EVENT North East job market suffering fall in confidence as Brexit approaches \nThe jobs market is being hit by Brexit , with hiring confidence falling in the North East, according to a new study. \nThe study by employment group Manpower on whether firms are looking to take on new workers found confidence in the North East had fallen by 1%, matching the national average. \nLarger falls were seen in London and Scotland, however, with the capital said to be the least optimistic region in England for the first time in three years. \nManpower said that small companies are being hit by a raft of measures including pension changes, the living wage and business costs. \nThe group also reported continued concerns about a shortage of skilled workers, which it warned could hit flagship construction projects. \nAmanda White, head of specialist markets for Manpower, said: \nEmployment in the region has held fairly steady as we approach the triggering of Article 50. The region’s employers have recorded a slight fall in optimism, but we have seen much bigger falls elsewhere in the country. \nDespite the slight fall in optimism, the region has some real bright spots so job-seekers should be optimistic. Investment in infrastructure and new building projects in Newcastle and elsewhere in the region is fueling job creation in the construction sector, but skills shortages remain a huge problem. \nBricklayers are in such high demand that they can earn more than £50K a year in the Tyne and Wear. Employers are reacting to the twin challenges of a skills shortage and an ageing workforce by providing more funding for apprenticeships. \nWe’re seeing lots of new opportunities in the region’s call centres and employers are continuing to compete to find candidates for more technical roles. Jobseekers are increasingly reluctant to commute long distances, so employers are having to dig deep into local talent pools to find the people they need. Some employers are becoming more open to taking on staff with less relevant experience and offering on-the-job training. Amanda White, operations manager at Manpower (Photo: Publicity Pic) 8:45 Jonathon Manning Ward Hadaway merger will not lead to job cuts in the North East \nA merger between Newcastle law firm Ward Hadaway and a Liverpool firm would not lead to job losses in the North East , according to Weightmans managing partner John Schorah. \nLast month Ward Hadaway broke its long tradition of independence by revealing it was in merger talks with fellow Northern firm Weightmans. \nA potential merger between the two businesses would create a new firm with revenues of around £130.9m and a headcount of around 1,850. \nFounded in Newcastle in 1988, Ward Hadaway has since expanded across the North of England after launching offices in Manchester and Leeds. \nBut while Ward Hadaway is one of Newcastle’s biggest law firms, its £35.8m turnover is dwarfed by Weightman’s £95.1m revenue. \nWeightmans has 11 offices across the country including two in Manchester and Leeds. \nDespite the differences in size, Weightman’s managing partner John Schorah has said that if the merger deal is agreed jobs North East jobs will remain safe. \nSpeaking to The Journal Mr Schorah said: \nThis is a positive thing. There won’t be loads of job cuts or anything like that. The Manchester and Leeds offices will be easier as we will put them together. \nEven though we are three times their size we don’t want this to be a takeover. \nThe final merger deal will be subject to a vote by the partners at both law firms. A proposal has yet to be finalised although it could only be a matter of weeks before a deal is presented to partners. Jamie Martin, managing partner at Ward Hadaway 8:40", "external_links": [], "published": "2017-03-14T14:55:00.000+02:00", "crawled": "2017-03-14T13:20:14.314+02:00", "highlightTitle": ""}