{"organizations": [], "uuid": "89f927097d9ac396f02cf2050231dd4e58f865a9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12773473.ece/ALTERNATES/s1200/LAP_NEC_201115canteen_12JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/roaring-twenties-speakeasy-bar-set-12773342", "country": "GB", "domain_rank": 21960, "title": "Roaring Twenties speakeasy bar set for Newcastle Quayside opening within weeks", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Roaring Twenties speakeasy bar set for Newcastle Quayside opening within weeks", "spam_score": 0.0, "site_type": "news", "published": "2017-03-21T19:25:00.000+02:00", "replies_count": 0, "uuid": "89f927097d9ac396f02cf2050231dd4e58f865a9"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/roaring-twenties-speakeasy-bar-set-12773342", "ord_in_thread": 0, "title": "Roaring Twenties speakeasy bar set for Newcastle Quayside opening within weeks", "locations": [], "entities": {"persons": [{"name": "jo", "sentiment": "negative"}, {"name": "adamson", "sentiment": "none"}, {"name": "faulkner", "sentiment": "none"}, {"name": "john adamson", "sentiment": "none"}, {"name": "barry faulkner", "sentiment": "none"}, {"name": "archie", "sentiment": "none"}, {"name": "porter", "sentiment": "none"}, {"name": "j. porter", "sentiment": "none"}], "locations": [{"name": "newcastle quayside", "sentiment": "none"}, {"name": "hardwick hall", "sentiment": "none"}, {"name": "dean street", "sentiment": "none"}, {"name": "botanical garden", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "norton", "sentiment": "none"}, {"name": "teesside", "sentiment": "none"}, {"name": "milburn house", "sentiment": "none"}], "organizations": [{"name": "newcastle brown ale share milburn house", "sentiment": "none"}, {"name": "medicine bar", "sentiment": "none"}, {"name": "newcastle brown ale", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "ramside estate group", "sentiment": "none"}, {"name": "la pharmacie", "sentiment": "none"}, {"name": "bellway", "sentiment": "none"}, {"name": "rhum bar", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Roaring Twenties speakeasy bar set for Newcastle Quayside opening within weeks Ramside Hall owner John Adamson is opening a bar named after the founder of Newcastle Brown Ale Share Milburn House, Dean Street, which had housed Canteen & Cocktails, will now be turned into a 1920s-themed bar (Photo: Newcastle Chronicle) Share Get business   \nA roaring Twenties-style speakeasy bar with prosecco flowing from teapots, secret rum classes and monthly talks delivered by politicians is weeks away from opening in Newcastle city centre . \nColonel Porter’s – full name Colonel Porter’s Tavern, Botanical Garden and Rhum Bar - will have a staff of 20 when it opens next months in Milburn House, Dean Street. \nTaking its name from Colonel J. Porter, the creator of Newcastle Brown Ale who originally came up with the brew in 1925, the venture is the brainchild of John Adamson, managing director of Durham-based Ramside Estate Group, which includes the prestigious Hardwick Hall and Ramside Hall hotels. \nMr Adamson is investing a significant sum into converting the bar, which was the Canteen and Cocktails bar until recently and One Oak restaurant before that. John Adamson (Photo: Newcastle Chronicle) \nHe said: “It’s going to be a happening and cool 1920s-style bar serving up something that’s a little bit different. \n“We’re going to serve cask ales, cocktails and really good food in the shape of sharing platters, and I’m planning a few extras too. \n“On Fridays, Saturdays and Sundays we’ll have Tipsy Tea, where we’ll be offering afternoon tea and prosecco served out of teapots and gin and rum infused tea. \n“We’ll have mixologist classes, a rum bar and regular events like comedy nights and masquerade balls. \n“I’m also planning on hosting monthly guest speakers, welcoming in politicians past and present, entrepreneurs and explorers who can deliver talks on their experiences.” \nMr Adamson said his plans require a complete makeover for the interior of the bar, and a fit-out is now starting to take shape. \nHe said: “It’s a very quirky bar and we’re going to carry out a total refit. Read More Housebuilder Bellway sees profits rise 9% as buyers shrug off Brexit uncertainty \n“When Colonel Porter’s opens it will have a completely new colour scheme, furnishings, lighting - the lot. I’m spending a significant sum. \n“As well as remodelling the bar area we’ll have a separate ‘speakeasy’ bar called Archie’s Lab, where the rum classes will take place with more than 100 different types of rum. It’s going to be a really fun place to be – I’m excited.” \nMr Adamson originally ran Canteen and Cocktails with Barry Faulkner, owner of several successful bars and restaurants on Teesside including La Pharmacie, the Medicine Bar, the town’s Empire nightclub and Canteen and Cocktails in Norton. \nMr Faulkner is now looking to focus more heavily on the restaurant sector with the imminent launch of a new restaurant, Scran, also in Norton. Like us on Facebook", "external_links": [], "published": "2017-03-21T19:25:00.000+02:00", "crawled": "2017-03-21T15:01:55.819+02:00", "highlightTitle": ""}