{"organizations": [], "uuid": "077be84b62562301b1b0fa9f077822aeb23e42a2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12621075.ece/ALTERNATES/s1200/Defence-Minister-Philip-Hammond-leaves-a-cabinet-meeting-at-10-Downing-Street.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12704261", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Budget predictions see Chancellor set to deliver positive post-Brexit prospects", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast LIVE: Budget predictions see Chancellor set to deliver positive post-Brexit prospects", "spam_score": 0.0, "site_type": "news", "published": "2017-03-08T15:00:00.000+02:00", "replies_count": 0, "uuid": "077be84b62562301b1b0fa9f077822aeb23e42a2"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12704261", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Budget predictions see Chancellor set to deliver positive post-Brexit prospects", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford   \nThe North East’s business community might be lacking diversity, but it’s certainly not lacking in brilliant business women. \nOur Journal investigation highlighted the lack of women in top jobs within the North East’s leading companies, but the other side of the coin is the many fantastic women who are bucking that trend - and here are 25 who are providing that it is possible to rise to the top. \nOur list includes leaders of business, young entrepreneurs and champions of the region’s business sector. They include well-established businesswomen with national profiles and up-and-coming stars already marked out as ones-to-watch. \nThe 25 women listed here are by no means a definitive list of the region’s female business talent, but they are all inspirational figures. North East business women - Bethany Ainsley, Penny Marshall, Sarah Glendinning and Jacqueline de Rojas 8.15 KEY EVENT Women outnumbered at North East's top firms by men from abroad \nWomen are so under-represented in the top jobs at   businesses that they are now outnumbered by men from abroad,   can reveal. \nAnalysis of company information for the region’s largest 200 companies carried out to coincide with International Women’s Day reveals that women hold only 141 (15%) of the 944 directorships, while men from overseas take 152 of those positions. \nMore than half of the region’s top companies have all-male boards, our research found, while women hold chief executive positions in only nine of the top 200 firms. \nBusiness leaders in the region say   is not only unfair to female staff but also bad for business, with growing evidence showing that firms with a more balanced leadership team tend to perform better commercially. \nSarah Glendinning, the CBI’s director in the North East, said: “These findings once again raise the important issue of greater gender diversity in the workplace. \n“Not only is it the right thing to do, a variety of voices make for better business decisions and we believe there is a strong case for placing diversity and inclusion at the heart of business. \n“To attract the best talent into our top roles, we must prioritise effective leadership, employee engagement and inclusive recruitment practices, alongside better careers advice in schools, mentoring support at work and practical family friendly policies.” Women take only 15% of board positions at region's largest companies (Photo: iStockphoto) 8.10 Coreena Ford County Durham firm donates testing equipment to world's largest floating hospital \nA North East business has donated medical test equipment to a private hospital ship that provides healthcare to some of the world’s poorest nations. \nRigel Medical has donated its equipment to Mercy Ships, the world’s largest floating hospital. \nBased in Peterlee , Rigel Medical manufacturers specialist testing equipment for hospitals and medical professionals. The firm has provided the international charity with kits that test the accuracy and safety of important pieces of medical equipment used in saving lives. \nJack Barrett, national business development manager at Rigel Medical, said: “We’re delighted to help the important work of Mercy Ships. \n“The team behind Mercy Ships deliver work that is nothing short of incredible, and for Rigel to play a small part in that process is a real honour.” \nRigel Medical employs 170 people at its base in Peterlee. The business has a long-standing commitment to charitable organisations and has previously shipped equipment to be used in voluntary missions in Asia and Africa. A Mercy Ships nurse treating patients (Photo: Unknown) 8.05 Coreena Ford Budget - £5m to mark centenary of women's vote \nA £5m fund to celebrate the upcoming centenary of the legislation which gave women the right to vote will be unveiled by Chancellor Philip Hammond in the Budget. The fund will support projects to mark the passing of the 1918 Representation of the People Act and to educate young people about its significance. The Act gave some women the vote for the first time and paved the way for the introduction of universal suffrage 10 years later, which saw women win equal voting rights to men. \nMr Hammond said: “It was the decisive step in the political emancipation of women in this country and this money will go to projects to mark its significance and remind us all just how important it was.” \nShadow equalities secretary Sarah Champion said: \nIt’s right that we mark and celebrate the achievements of so many women who risked their homes, families and freedom to fight for democracy and economic equality. \nHowever, 99 years later, women are still having to fight for economic equality under this Tory government. \nFrom cuts to universal credit and 54,000 women losing their jobs through maternity discrimination, to the treatment of thousands of women born in the 1950s who have been left with a crisis in their retirement planning, this Government is systematically turning back the clock on gender economic equality. The suffragette stockings - produced to promote the Women’s Social and Political Union 8.00 KEY EVENT Chancellor expected to give upbeat assessment of economic prospects \nPhilip Hammond is expected to deliver an upbeat assessment of Britain’s economic prospects after Brexit in his first Budget as Chancellor, despite admitting that more austerity is in the pipeline as he battles to get the deficit down. \nThe Chancellor will say that he is ready to take further “difficult decisions” on tax hikes and spending cuts to get the books into balance, even though he recognises that many voters are still feeling the pinch 10 years on from the financial crash of 2007/08. \nBut he will insist that the Government’s economic programme is laying the foundations for a “stronger, fairer, better Britain” outside the EU and will promise to do everything he can to help ordinary working families. \nAcknowledging the concerns of many parents that their children will not get the same opportunities in life that they enjoyed, he will say the Government is investing in young people’s chances to go to a good school and get the qualifications they need for the jobs of the future. \nHe was given an eve-of-Budget boost yesterday when a leading international think tank upgraded its forecasts for UK economic growth. \nThe Paris-based Organisation for Economic Co-operation and Development (OECD) said it now expected growth of 1.6% this year - up from the 1.2% it was predicting in November. \nThe increase is expected to be reflected in a similar rise when Mr Hammond unveils the latest official forecasts from the Office for Budget Responsibility in his Commons statement. \nSome analysts have calculated that higher tax receipts could give him a £45 billion windfall over the next five years, but the Chancellor has insisted there will be no Budget giveaway. \nWhile he has signalled extra support for hard-pressed local authority social care services and firms hit by big rises in business rates, it is expected the measures will be paid for through limited tax rises. \nMr Hammond is reported to be preparing to announce an additional £1 billion for social care in England over the next two years, but is expected to resist demands from Labour and the British Medical Association for a large cash injection for the NHS. \nIt’s also expected that Mr Hammond will herald a wider reform of the way the needs of the elderly are funded in a rapidly-ageing population. \nMr Hammond is also reported to have been looking at a possible increase in duties on alcohol. \nAhead of today’s statement, Mr Hammond has already set out plans for £500m for additional spending on schools in England, with £320m for 140 new free schools - including new grammar schools promised by Theresa May. \nThere will be a further £500m to boost science and innovation with support for electric vehicles, robotics and artificial intelligence. Chancellor of the Exchequer Philip Hammond (Photo: Stefan Rousseau/PA Wire) Share", "external_links": [], "published": "2017-03-08T15:00:00.000+02:00", "crawled": "2017-03-08T10:25:21.436+02:00", "highlightTitle": ""}