{"organizations": [], "uuid": "1d961d7acfcba96469d72633b922bd6ce3dff3c0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30197869/15902130.jpg", "site_section": "http://www.middevongazette.co.uk/all-content.rss", "section_title": "Devon Live All Content Feed", "url": "http://www.devonlive.com/torquay-s-riviera-wheel-back-for-five-years/story-30197869-detail/story.html", "country": "GB", "title": "TinaCrowson commented Torquay's iconic Riviera Wheel - back for five years?", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "TinaCrowson commented Torquay's iconic Riviera Wheel - back for five years?", "spam_score": 0.0, "site_type": "news", "published": "2017-03-12T23:12:00.000+02:00", "replies_count": 0, "uuid": "1d961d7acfcba96469d72633b922bd6ce3dff3c0"}, "author": "TinaCrowson", "url": "http://www.devonlive.com/torquay-s-riviera-wheel-back-for-five-years/story-30197869-detail/story.html", "ord_in_thread": 0, "title": "TinaCrowson commented Torquay's iconic Riviera Wheel - back for five years?", "locations": [], "entities": {"persons": [{"name": "tinacrowson", "sentiment": "none"}, {"name": "bovey tracey", "sentiment": "none"}, {"name": "brixham", "sentiment": "none"}, {"name": "foley", "sentiment": "none"}, {"name": "wendy bennett", "sentiment": "none"}, {"name": "carolyn custerson", "sentiment": "none"}, {"name": "louise memorial stone", "sentiment": "none"}, {"name": "torcross", "sentiment": "none"}, {"name": "darren shaun charles breen", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}], "locations": [{"name": "riviera", "sentiment": "none"}, {"name": "riviera wheel", "sentiment": "none"}, {"name": "ashburton", "sentiment": "none"}, {"name": "hyde park", "sentiment": "none"}, {"name": "south devon  as princess gardens", "sentiment": "none"}, {"name": "warren road", "sentiment": "none"}, {"name": "princess gardens", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "berry head", "sentiment": "none"}, {"name": "slapton", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "totnes civic hall", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "paignton", "sentiment": "none"}, {"name": "south devon", "sentiment": "none"}], "organizations": [{"name": "torquay", "sentiment": "none"}, {"name": "devon county council", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "torquay pavilion", "sentiment": "none"}, {"name": "torbay clinical commissioning group", "sentiment": "none"}, {"name": "riviera international conference", "sentiment": "none"}, {"name": "nfa", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "guardhouse cafe", "sentiment": "none"}, {"name": "dartmouth", "sentiment": "none"}, {"name": "medway magistrates court", "sentiment": "none"}, {"name": "save our hospital services", "sentiment": "none"}, {"name": "ccg", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Torquay's iconic Riviera Wheel - back for five years? By TinaCrowson | Posted: March 12, 2017 1 COMMENTS SHARES The Riviera Wheel features in the English Riviera's 2017 publicity Torquay's iconic Riviera Wheel - back for five years? X \nCopy link to paste in your message / Comments (1) \nTorquay’s much loved Riviera Wheel could be back in town for a further five years. But planners are being asked for a new site to be found. Happily for its fans the proposed new site is only just over 100 metres further away in the seafront Princess Gardens. \nCouncillors are being asked to agree that the illuminated wheel can move from its site for the past five years next to Torquay Pavilion, for which approval has just been granted for restoration as part of a hotel and apartments project for the marina car park site. \nThe proposed new site is overlooking the harbour from the gardens behind the Princess Theatre, between the theatre and the war memorial. The application includes the 50m observation wheel but also a 14m diameter carousel, ticket officer, catering unit and seating area. The wheel would be set at an angle rather than being parallel with the theatre. \nThe planners have received 17 letters of objection and one of support. The English Riviera BID company says the wheel features in its promotional material for 2017. \nChief executive Carolyn Custerson wrote: \"The fact is the English Riviera is a leading UK resort that has been voted as a Top 10 Destination by Trip Advisor for the past three years and we need to ensure that we keep going forwards and offer our 4.6 million visitors spending £530 million every year the very best visitor experience we can and the English Riviera Wheel is an important part of that winning formula. It's night time value is particularly valuable with families able to enjoy the wheel during the evenings and the wheel encourages more people to visit the harbour in the evening to eat and drink also.\" \nHowever Wendy Bennett, general manager of the Princess Theatre has objected saying: \"As one of its nearest neighbours the wheel has been a fantastic addition over the previous five years and has enhanced the visitor experience however I would suggest that \"shoe horning\" the observation wheel onto the proposed new footprint in Princess Gardens, squashed in between the War Memorial, the Princess Louise Memorial Stone and the existing public shelter is in my opinion wholly inappropriate and not an option. It is totally over-bearing, out-of-scale and out of character in terms of its appearance on this new site.\" \nSeveral residents in Warren Road have also objected. If permission is granted, the wheel would be in position between mid-March and October 31 each year until 2021. Previously it was considered putting the wheel more permanently in its old location adjacent to the Pavilion would not be considered acceptable because of the impact on the Grade II listed building. \nREAD MORE: Fight continues to save hospital services in South Devon \nAs Princess Gardens are listed themselves, it is proposed that some £60,000 of the wheel rental income should be used by the council over the next five years to improve the gardens themselves. The existing \"inappropriately designed seating shelters which are often subject to vandalism would be removed and the war memorial and the cast iron foundain could be repaired and maintained with the income. \npossible sites identified as potential viable options have been discounted and the current suggested position is considered the least harmful to the gardens. It is not considered there is serious impact on privacy as the wheel would be some 100m away from the nearest properties on Warren Road. Measures are suggested to limit light pollution, and the movement of vehicles building and dismantling the wheel which usually spends winter in Hyde Park, London. \nMembers of the development management committee are being recommended to approve the application subject to satisfactory resolution of certain matters. The committee is meeting at the Riviera International Conference centre at 2pm on Monday. The Riviera Wheel was dismantled last November. \nREAD MORE: \nExcitement as South Devon's humpback whale spotted off Brixham \nWalkers enjoying Brixham's nature reserve at Berry Head got a big surprise on Sunday morning when they spotted a humpback whale offshore. The whale which has been ranging up and down the shore off Slapton and Torcross for the past three weeks to the delight of nature lovers had obviously gone off for a bit of a stroll further along the South Devon coast.Alex Foley who runs the Guardhouse Cafe at Berry Head national nature reserve said the whale had been spotted next to a fishing boat at about 9.30am. \nMotion made to protect Devon's nature after Brexit \nA motion calling to protect Devon's nature from the risks of leaving the European Union has been endorsed by Devon County Council's cabinet.It has been recommended to full council next month that councillors support a coalition of green charities and a government environmental committee, asking the government to apply at least the same level of protection in UK law as exists under EU law. \nAround the courts: who has been before the magistrates in South Devon. \nMAGISTRATES' COURT REGISTER Monday, February 20. Darren Shaun Charles BREEN, NFA. Age: 24. On 12/02/2017 at Exeter without lawful excuse, damaged silver VW Golf to the value of £100 belonging to a male, intending to destroy or damage such property or being reckless as to whether such property would be destroyed or damaged. Plea: Guilty. Commission of a further offence during the operational period of a suspended sentence order made by Medway Magistrates Court on 13/10/2016 for an offence of burglary. \nFight continues to save hospital services in Devon \nThe fight to save hospital services in Devon continues with plans announced for a \"real\" consultation. Campaigners opposing plans to close community hospitals in South Devon have organised a public consultation outside Totnes Civic Hall next Tuesday, March 14, at 6.30pm. The Save Our Hospital Services South Devon –The 'Real' Review is being held in an attempt to get South Devon and Torbay Clinical Commissioning Group (CCG) to reconsider plans to close Paignton, Dartmouth, Bovey Tracey and Ashburton and Buckfastleigh community hospitals.", "external_links": [], "published": "2017-03-12T23:12:00.000+02:00", "crawled": "2017-03-12T20:45:53.847+02:00", "highlightTitle": ""}