{"organizations": [], "uuid": "763ebd0563c022b3769c0cf222647c3d9323edb1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30192513/15898829.jpg", "site_section": "http://www.middevongazette.co.uk/news.rss", "section_title": "Devon Live news RSS feed", "url": "http://www.devonlive.com/council-terminate-contract-with-head-designer-of-bus-station-redevelopment/story-30192513-detail/story.html", "country": "GB", "title": "More chaos for Exeter bus station development as council part...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "More chaos for Exeter bus station development as council part...", "spam_score": 0.0, "site_type": "news", "published": "2017-03-10T01:17:00.000+02:00", "replies_count": 0, "uuid": "763ebd0563c022b3769c0cf222647c3d9323edb1"}, "author": "Alex_Richards", "url": "http://www.devonlive.com/council-terminate-contract-with-head-designer-of-bus-station-redevelopment/story-30192513-detail/story.html", "ord_in_thread": 0, "title": "More chaos for Exeter bus station development as council part...", "locations": [], "entities": {"persons": [{"name": "pete edwards", "sentiment": "none"}, {"name": "cllr pete edwards", "sentiment": "none"}, {"name": "cllr andrew leadbetter", "sentiment": "none"}, {"name": "cllr phil bialyk", "sentiment": "none"}, {"name": "cllr bialyk", "sentiment": "none"}], "locations": [{"name": "exeter", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "green party", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "st sidwell", "sentiment": "none"}, {"name": "exeter tory", "sentiment": "none"}, {"name": "leisure complex board", "sentiment": "none"}, {"name": "exeter city council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "More chaos for Exeter bus station development as council part ways with design team By Alex_Richards | Posted: March 09, 2017 0 COMMENTS SHARES Comments (0) \nMore bad news for Exeter's multi-million pound landmark bus station redevelopment - the council has parted ways with a major part of its head design team. \nIn a shock move, international designer and consultants Arcadis are now no longer part of the project, despite playing a major role in getting the project off the ground. \nAccording to a spending report, the council forked out £788,580 with Arcadis for bus station and leisure centre consultancy between July and September last year. \nThe team were present at key meetings, presenting the latest developments in the scheme to the council's Bus Station and Leisure Complex Board chaired by Cllr Phil Bialyk. \nThey also engaged with members of the public at several consultation events at both Exeter Guildhall and the council-owned Corn Exchange off Market Street. \nAn Exeter City Council spokesman said: \"We can confirm that Arcadis are not involved in the St Sidwell's Point development and the delivery of a new bus station. This will not affect the council's ability and commitment to deliver this project.\" \nIt is the latest in a recent string of events that has thrown the entire project into doubt. \nLast month it was announced that the project will be delayed indefinitely and the current £26m and £6.25m price tags, attached to St Sidwell's Point Point and the replacement bus station respectively, will increase. \nThe council said it needed more time to finish the procurement process with a contractor. Cllr Bialyk said: \"There is no doubt the Brexit and the current state of the economy has had its impact, more than we expected. \n\"Not everything is marvellous in the country, despite what the Brexiteers tell you. There are a number of projects not going ahead, or not going ahead as quickly. \n\"But we are incredibly nervous about getting this right. We want this to work and that's our plan.\" \nHe added that the hi-tech passivhaus standard they want to build it to is not the sole reason for delay with tenders, despite few operators able to fulfill its demands. \n\"It isn't just me and [council leader] Pete Edwards meeting with builders behind closed doors. \n\"That sort of attitude might've worked when I got my kitchen done - instead there is a lot of professional people engaging on this. \nHe added: \"Can I give you finite date for when we get back on track? No. Is it going to happen? Yes.\" \nPolitical opposition have seized the opportunity to ask the Labour council tough questions about the current debacle, and the Green Party even gained a defected Labour councillor over it. \nExeter Tory leader Cllr Andrew Leadbetter even ordered an emergency meeting of the council after blasting the city council for \"biting off more than it can chew\" with their unrealistic \"passion project.\" \nThe meeting has been agreed by council leader Cllr Pete Edwards, and will be held at 6pm on Tuesday, March 21.", "external_links": [], "published": "2017-03-10T01:17:00.000+02:00", "crawled": "2017-03-09T23:05:46.279+02:00", "highlightTitle": ""}