{"organizations": [], "uuid": "66b5176871793e1cd9a6c4aa48cbb0d4665c9c32", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bostonstandard.co.uk", "main_image": "http://res.cloudinary.com/jpress/image/fetch/w_300,f_auto,ar_3:2,c_fill/http://www.bostonstandard.co.uk/webimage/1.7857894.1489052729!/image/image.jpg", "site_section": "http://www.bostonstandard.co.uk/rss/cmlink/1.335283", "section_title": "Boston Standard MBSP.sport.feed", "url": "http://www.bostonstandard.co.uk/sport/football/boston-united/column-bring-on-the-arsenal-our-man-says-boston-united-fans-should-be-showing-their-support-for-lincoln-city-ahead-of-their-historic-fa-cup-clash-1-7857896", "country": "GB", "title": "COLUMN: Bring on the Arsenal! Our man says Boston United fans should be showing their support for Lincoln City ahead of their historic FA Cup clash", "performance_score": 0, "site": "bostonstandard.co.uk", "participants_count": 0, "title_full": "COLUMN: Bring on the Arsenal! Our man says Boston United fans should be showing their support for Lincoln City ahead of their historic FA Cup clash", "spam_score": 0.0, "site_type": "news", "published": "2017-03-09T16:36:00.000+02:00", "replies_count": 0, "uuid": "66b5176871793e1cd9a6c4aa48cbb0d4665c9c32"}, "author": "", "url": "http://www.bostonstandard.co.uk/sport/football/boston-united/column-bring-on-the-arsenal-our-man-says-boston-united-fans-should-be-showing-their-support-for-lincoln-city-ahead-of-their-historic-fa-cup-clash-1-7857896", "ord_in_thread": 0, "title": "COLUMN: Bring on the Arsenal! Our man says Boston United fans should be showing their support for Lincoln City ahead of their historic FA Cup clash", "locations": [], "entities": {"persons": [{"name": "pete b", "sentiment": "none"}, {"name": "clive nates", "sentiment": "none"}, {"name": "paul farman", "sentiment": "none"}, {"name": "danny cowley", "sentiment": "none"}, {"name": "lincoln", "sentiment": "none"}, {"name": "harry gration", "sentiment": "none"}, {"name": "cowley", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "nigel farage", "sentiment": "none"}, {"name": "wenger", "sentiment": "none"}, {"name": "arsène wenger", "sentiment": "none"}], "locations": [{"name": "york street", "sentiment": "none"}, {"name": "altrincham", "sentiment": "none"}, {"name": "emirates", "sentiment": "none"}, {"name": "costa rica", "sentiment": "none"}, {"name": "braintree", "sentiment": "none"}, {"name": "lincoln city", "sentiment": "none"}, {"name": "harrogate", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "boston", "sentiment": "none"}, {"name": "lincolnshire", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}, {"name": "islington", "sentiment": "none"}, {"name": "sincil bank", "sentiment": "none"}], "organizations": [{"name": "lincoln city", "sentiment": "none"}, {"name": "boston united", "sentiment": "none"}, {"name": "bbc radio lincolnshire", "sentiment": "none"}, {"name": "bayern munich", "sentiment": "none"}, {"name": "imps", "sentiment": "none"}, {"name": "lincoln", "sentiment": "none"}, {"name": "harlem globetrotters", "sentiment": "none"}, {"name": "football league", "sentiment": "none"}, {"name": "sutton united", "sentiment": "none"}, {"name": "halfords", "sentiment": "none"}, {"name": "arsenal", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Have your say \nCome on mate, get off that bandwagon. Standard columnist and Boston United fan Pete Brooksbank’s going all soft for Lincoln City... \nThe protests began early in Islington on Tuesday night, a 200-strong mob of concerned citizens gathering before Arsenal’s match against Bayern Munich to wish Arsène Wenger a happy early retirement. Paul Farman could have been playing Altrincham at the Jakemans on Saturday. But that deal never went through and he'll have to make do with a day at the Emirates instead. \nJudging by what they were chanting, they weren’t there to collect cash for Amazon vouchers. \nA couple of hours later, their anger had gone nuclear. \nMeanwhile, somewhere in the guts of the ostentatious monument to his remarkable early reign, Mr Wenger stared dolefully at the floor in front of the cameras, visibly flinching at each question like a man in Halfords being told his clutch has gone. \nIt is into this faintly surreal maelstrom that around 9,000 completely unsympathetic Lincoln City fans – 8,700 of whom were washing their hair for the midweek trip to Braintree - will arrive late on Saturday afternoon, hoping to see the greatest FA Cup upset in the history of the competition. \nAnd the crazy thing is, such an upset is not as implausible as you might think. \nIndeed, such is the frenzy that one BBC Radio Lincolnshire journalist cancelled a holiday to Costa Rica, while some Imps fans queued outside Sincil Bank for up to four hours for tickets. \nNormally, if you live in Lincolnshire and find yourself in a four-hour queue, it’s because you’re stuck behind a tractor on the A17. \nCancelling a holiday, though? Mate. \nStill, these are clearly not normal circumstances. \nThe region’s football clubs rarely get people this excited. \nAs bemusing as it is, little old Lincoln have somehow assumed the role of being this season’s Leicester; the feel-good story that erupts from the back pages and ends up on the One Show as a slightly patronising celebration of funny local types with haircuts that suggest they probably all voted Brexit. \nTheir electrifying cup run has helped revive long-dormant pangs of romanticism in the FA Cup’s most cynical detractors and brought the national spotlight on a small, friendly club in one of the country’s most underrated cities. \nThroughout it all, the Imps have conducted themselves with class and humility, pointedly skirting the circus that marred Sutton United’s grubby, self-inflicted tabloid farce. \nIt’s a commendable attitude, one that reflects their hugely impressive manager, Danny Cowley. \nMagnanimous in defeat, level-headed in victory, Cowley is an intelligent, articulate student of the game, and the brightest young coach operating outside the Football League. \nLincoln’s only regret is that he will surely be stolen from them sooner than they’d like. \nNot that they will be surprised when the inevitable happens. \nCowley’s newly-energised Imps are nonchalantly batting aside all-comers in a style that suggests their 2016/2017 campaign will end up on a commemorative DVD narrated by Harry Gration. \nTo paraphrase a certain bizarre politician, Lincoln are winning big league. So big league they’d probably win a snap general election. It’s a story you can’t help but feel good about. \nWell, unless you’re a Boston United fan. We all want them to trip up, right? \nI’m not so sure. \nOf course, there will be plenty of Boston fans who would take perverse delight in seeing Lincoln City annihilated at the Emirates, lose the National League title and collapse in the FA Trophy. \nNothing will convince them that rooting for Lincoln is anything other than a betrayal of local pride. \nI get it. They’re the next big city down the road and so we’re expected to loathe them, and many Pilgrims fans are resentful of Clive Nates’ chequebook, especially when their club can’t even compete with Harrogate. \nThat may be true, but City’s sudden transformation into the Harlem Globetrotters has been the adrenaline shot our thoroughly moribund local football scene desperately needed. \nFor years now, south Lincolnshire’s senior clubs have served their supporters a steady diet of disappointment. \nBoston’s play-off appearances have provided brief moments of promise, only to end in horrifying circumstances, and City’s lost years adrift at the wrong end of the National League threatened to cast them off into irrelevance. \nThat’s all changed now. \nThe only problem is that we haven’t been invited to the party down the road. \nWhile Lincoln get to waltz into the Emirates after Bayern Munich, Boston’s season has been as sexy as watching Nigel Farage trying to eat a kebab on the dodgems. \nIt has, sadly, been a campaign cloaked in misery and, looking at the state of York Street’s crumbling terraces, bird muck. \nSo as counter-intuitive as it may seem, the rise of the Imps is something even Boston fans should celebrate. \nOnly a few months ago, Boston fans were waiting for the hapless and hopeless City to fall to our level. \nMisery breeds misery. Failure breeds failure. The reverse is true of success, and optimism. \nBoston now have something aspire to. \nWe have a reason to hope that great things can happen in a part of the world where feel-good headlines are rarely written. \nLincoln won’t always be this good, so let’s not begrudge them their moment. \nEvery team, every fan, deserves one. This is theirs. Ours will come. \nIt will be sweeter for the wait. Sign in", "external_links": [], "published": "2017-03-09T16:36:00.000+02:00", "crawled": "2017-03-09T12:52:27.608+02:00", "highlightTitle": ""}