{"organizations": [], "uuid": "b43604676d4bcb1a7b0c19da075cd4de4ef1a4e1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12814919.ece/ALTERNATES/s1200/BRITAIN_Brexit_124414.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/how-brexit-affect-house-prices-12814876", "country": "GB", "domain_rank": 21960, "title": "How Brexit will affect house prices, pensions, and even playing the EuroMillions", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "How Brexit will affect house prices, pensions, and even playing the EuroMillions", "spam_score": 0.0, "site_type": "news", "published": "2017-03-29T21:24:00.000+03:00", "replies_count": 0, "uuid": "b43604676d4bcb1a7b0c19da075cd4de4ef1a4e1"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/how-brexit-affect-house-prices-12814876", "ord_in_thread": 0, "title": "How Brexit will affect house prices, pensions, and even playing the EuroMillions", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "negative"}, {"name": "theresa may", "sentiment": "none"}, {"name": "donald tusk", "sentiment": "none"}, {"name": "tim barrow", "sentiment": "none"}, {"name": "michel barnier", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "belgium", "sentiment": "none"}, {"name": "halifax", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}], "organizations": [{"name": "national lottery", "sentiment": "none"}, {"name": "ons", "sentiment": "none"}, {"name": "share news", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "eu council", "sentiment": "none"}, {"name": "bank of england", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "office for national statistics", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}, {"name": "house", "sentiment": "none"}, {"name": "european broadcasting union", "sentiment": "none"}, {"name": "eec", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News How Brexit will affect house prices, pensions, and even playing the EuroMillions We look at what the future has in store for a post-Brexit United Kingdom and how this could affect your day to day life Share News Britain's permanent representative to the European Union Tim Barrow, left, hand delivers British Prime Minister Theresa May's Brexit letter in notice of the UK's intention to leave the bloc under Article 50 of the EU's Lisbon Treaty to EU Council President Donald Tusk, in Brussels, Belgium, Wednesday, March 29, 2017 (Photo: REUTERS POOL) Share Get daily   \nHow will Brexit change your life ? \nArticle 50 was triggered on Wednesday and the UK now has two years to formally withdraw from the European Union . \nHow this is set to affect day to day life remains to be seen but there are already indications how it could change the world we live in. \nHere we answer your questions on how leaving the EU will affect everything from house prices, jobs and pensions to whether you will still be able to play the EuroMillions. How will Brexit affect... House prices \nHouse prices accelerated in February rising by 4.5% in a year, according to the Nationwide, and by 5.1%, according to the Halifax. In the North east, the figure was nearer 2%. \nThe outlook for the market is uncertain, with the Nationwide predicting a 2% rise in UK house prices over the course of 2017. \nExperts say housing demand is being supported by an economy that continues to perform well with employment still expanding. \nSo in the long term, house prices are dependant on the country gets a good Brexit deal or a bad one. The economy Prime Minister Theresa May announces in the House of Commons, London, that she has triggered Article 50, starting a two-year countdown to the UK leaving the EU (Photo: PA) \nFirst the good news. The UK economy grew by more than previously reported in the final three months of 2016, according to the latest official estimate. \nGross domestic product increased by 0.7%, up from 0.6%, according to the Office for National Statistics (ONS). \nHowever the ONS cut its estimate for growth in 2016 as a whole to 1.8%, down from the 2%. \nThere are hints that Brexit uncertainty is hitting business confidence. \nThe ONS also said there had been a slowdown in business investment, which fell by 1% compared with the three months to the end of September. The pound \nSterling fell dramatically after the Brexit vote last year, and since then has been trading around 15% lower compared to the dollar and 12% lower compared to the euro than it was before the referendum . \nThe fall in the pound has helped exporters but it has made foreign holidays more expensive for British tourists. \nIt has also increased import costs for manufacturers which is a key factor for sectors such as the car industry, where vehicles which may be completed in the UK often have imported component parts. Interest rates Bank of England (Photo: PA) \nMany forecasts of immediate economic gloom did not take into account possible compensatory action by the Bank of England in the wake of a Brexit vote. \nAfter the referendum it took steps to boost the economy. In particular it cut interest rates from 0.5% to 0.25% in August - the first reduction in the cost of borrowing since 2009 - taking UK rates to a new record low. \nRates are unlikely to go up any time soon. Read More What is Brexit, have we left the EU yet and other questions answered \nMy account which is in a foreign owned bank \nFor example Santander. Most banks operating in the UK, even if their parent company is elsewhere, are fully UK-regulated banks. Santander is a fully-regulated UK bank. Its funds are ring-fenced from the Spanish parent group. So don’t think of it as Spanish. My pension \nThere was much talk about a huge economic downturn and the state pension having to be cut to pay for it. \nWith no downturn as yet, the state pension stays the same. \nWhether there’ll be any change to it is a question of policy for future Governments, but there’s nothing definite planned currently. \nPrivate pensions are largely invested in companies listed on the stock market and their performance mirrors that of the stock market. Shares have soared since the EU referendum but a ‘hard’ Brexit could adversely affect their value. Read More As Article 50 is triggered - we recall the way we were in January, 1973 when the UK joined the EEC The rights of EU nationals in the UK and vice versa \nThe European Union’s chief Brexit negotiator, Michel Barnier, told a delegation of EU citizens living in the UK and UK nationals living in Europe that he hopes to have an agreement in principle to secure their future by the end of the year. If he is as good as his word, Brexit won’t have as big an affect as first feared. The NHS \nLots of EU nationals work in the NHS but they are already leaving the country in droves. An agreement about their status better be put in place quickly or the UK could really suffer a massive post-Brexit headache here. Read More Theresa May wants 'free trade' to help companies like Nissan as she prepares to trigger Article 50 Will I still be able to play the EuroMillions? \nCamelot, which runs the National Lottery, has confirmed that we will still be able to play the EuroMillions despite Brexit. Will we still be in Eurovision? \nSadly yes. Eurovision is done by the European Broadcasting Union, not the EU, so there’s no change there. Like us on Facebook", "external_links": [], "published": "2017-03-29T21:24:00.000+03:00", "crawled": "2017-03-29T16:35:39.396+03:00", "highlightTitle": ""}