{"organizations": [], "uuid": "ed10059cbe3cd0244775d980a759adf98bb16a46", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12768822.ece/ALTERNATES/s1200/GWR_-NJL_200317space_01.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/new-funding-sees-north-east-12768797", "country": "GB", "domain_rank": 21960, "title": "New funding sees North East companies get help to do business in outer space", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "New funding sees North East companies get help to do business in outer space", "spam_score": 0.0, "site_type": "news", "published": "2017-03-20T21:07:00.000+02:00", "replies_count": 0, "uuid": "ed10059cbe3cd0244775d980a759adf98bb16a46"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/new-funding-sees-north-east-12768797", "ord_in_thread": 0, "title": "New funding sees North East companies get help to do business in outer space", "locations": [], "entities": {"persons": [{"name": "andrew richardson", "sentiment": "none"}, {"name": "catherine mealing-jones", "sentiment": "none"}, {"name": "simon goon", "sentiment": "none"}, {"name": "nick veck", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "sedgefield", "sentiment": "none"}, {"name": "north east centre", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}], "organizations": [{"name": "realsafe technologies", "sentiment": "none"}, {"name": "smes", "sentiment": "none"}, {"name": "business durham", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "uk space agency", "sentiment": "none"}, {"name": "brexit  companies", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "New funding sees North East companies get help to do business in outer space Extra funding will see the North East Satellite Applications Centre of Excellence working for another three years Share L-R: Prof Nick Veck, Dr Simon Goon, managing director of Business Durham, and Catherine Mealing-Jones (Photo: unknown) Share Get business   Thank you for subscribing! Could   \nA centre which helps North East businesses tap into the billion-pound space sector has won an extension to its programme after successfully supporting new businesses and job creation. \nThe North East Satellite Applications Centre of Excellence, which is based at NETPark, in Sedgefield, County Durham , will operate for a further three years, focussing on identifying opportunities to use satellite data and space technology to develop products and services to help people feel safer. \nThe three-year extension will be co-funded by the Satellite Applications Catapult and the UK Space Agency and aims to support more than 300 businesses, create or safeguard 100 jobs and attract more than £5m of funding into the North East. \nCatherine Mealing-Jones, director of growth at the UK Space Agency, said: “I am delighted that the UK Space Agency is supporting the North East Centre of Excellence – they have developed a vibrant space community in the region and the next phase of funding will build upon and strengthen this network, delivering new collaborations and bringing further new players into the sector.” Read More North East water company named one of the most ethical firms in the world \nProfessor Nick Veck, head of strategy at the Satellite Applications Catapult, said: “The North-East Centre of Excellence has made a significant impact in helping to develop and expand the space sector in the North East. \n“They are successfully working with the local community, helping entrepreneurs and SMEs develop new businesses, solutions and applications using space data. We are delighted to be able to extend their funding for a further three years.” \nThe centre is one of only five in the country, and was established three years ago by a consortium led by Business Durham. \nIt aims to help companies in the region which are taking advantage of the burgeoning space market and has secured funding from the EU to promote research and innovation in space and photonics. Read More Fentimans considering opening European factory if tariffs rise after Brexit \nCompanies to have benefited from the centre include Realsafe Technologies, which has an app which connects motorbike riders involved in an accident to the nearest ambulance service. \nAndrew Richardson, chief commercial officer of Realsafe Technologies, said: “The competition helped to get us accreditation as the first and only 999 certified app on the market. \n“If we hadn’t worked with the NETPark team at the Satellite Applications Centre, we wouldn’t have been able to open the doors into the competition which has done so much for us to help raise our profile.” Like us on Facebook", "external_links": [], "published": "2017-03-20T21:07:00.000+02:00", "crawled": "2017-03-20T17:09:19.024+02:00", "highlightTitle": ""}