{"organizations": [], "uuid": "98d09f478a731bccf19bb91042e260dfb695c0da", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article10230942.ece/ALTERNATES/s1200/JS74039993.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/tensions-rise-newcastle-asylum-seekers-12742385", "country": "GB", "domain_rank": 21960, "title": "Tensions rise as Newcastle asylum seekers face sharing same bedroom with people they don't know", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Tensions rise as Newcastle asylum seekers face sharing same bedroom with people they don't know", "spam_score": 0.0, "site_type": "news", "published": "2017-03-15T01:50:00.000+02:00", "replies_count": 0, "uuid": "98d09f478a731bccf19bb91042e260dfb695c0da"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/tensions-rise-newcastle-asylum-seekers-12742385", "ord_in_thread": 0, "title": "Tensions rise as Newcastle asylum seekers face sharing same bedroom with people they don't know", "locations": [], "entities": {"persons": [{"name": "coun kilgour", "sentiment": "none"}, {"name": "karen kilgour", "sentiment": "none"}, {"name": "jomast", "sentiment": "none"}, {"name": "coun karen kilgour", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "cabinet member for adult care and health", "sentiment": "none"}, {"name": "council", "sentiment": "none"}, {"name": "home office", "sentiment": "none"}, {"name": "newcastle city council", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Tensions rise as Newcastle asylum seekers face sharing same bedroom with people they don't know The city council is now bidding to stop the practice with new agreement with accommodation providers G4S Share Cabinet member responsible for the elderly and mental health, Karen Kilgour, at the Civic Centre in Newcastle Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nAsylum seekers in Newcastle are being put at risk by having to share bedrooms with people they don’t know who may not even speak the same language, it has been revealed. \nNow a bid has been launched by the city council to stop the practice which it feels flies in the face of its status as a ‘City of Sanctuary’. \nCoun Karen Kilgour, Cabinet Member for Adult Care and Health said: “Being made to share a bedroom with someone you aren’t related to or don’t know is not acceptable. \n“It can lead to health and safety issues, exacerbate mental and physical health problems and increase tensions between individuals and communities.” Read More Race hate crime in North East soars to record levels in post Brexit period \nShe added: “We don’t expect anyone else to live in this way and it would be unfair to impose these requirements on asylum seekers who are sent to live in our city without any say in where they live.” \nStandards of accommodation for asylum seekers are set out in the Home Office COMPASS contracts and providers are expected to comply with these. \nThe contractors in Newcastle are G4S. They, and their sub-contractors Jomast, must consult with the city council on how they intend to accommodate asylum seekers. G4S \nWhile local authorities have little influence over these contracts and receive no government funding to support asylum seekers, the city council has decided to act. \nAt a council Cabinet meeting on Monday, the implementation of a formal Asylum Accommodation Standards Policy 2017 will be proposed. \nIt states that room sharing by unrelated individuals will not be supported by the Council and G4S and Jomast will be expected to comply with this under the terms of their COMPASS contract. \nThe policy aims to ensure asylum seekers placed in the city are located in a property which ensures their safety, health, and wellbeing. This includes prohibiting the use of room sharing arrangements for unrelated adults. \nIt is accepted practice for unrelated asylum seekers to be accommodated in one property. An individual, couple or family have their own bedroom but share facilities such as a bathroom and kitchen with others living in the property. Read More Warning over child asylum seekers and trafficked kids going missing in the North East \nThe council says there has always been an understanding in Newcastle that requiring unrelated people to share a bedroom is unacceptable. \nIt said it does not expect tenants housed by us or through commissioned services to be housed on a room share basis. This should also apply to asylum seekers. \nAs a City of Sanctuary, Newcastle is part of a network of towns and cities throughout the UK which pride themselves on being places of safety for people seeking sanctuary. \nCoun Kilgour added: “This policy formalises a long-standing and accepted practice and will help us ensure that those seeking sanctuary in Newcastle are treated with respect and dignity.” \nA G4S spokesperson said: “Our contract with the Home Office is very specific in terms of the standards to be maintained and rules that need to be followed. \n“The agreement with the Home Office and current arrangements with Newcastle City Council permit room sharing by people who may not necessarily be related. \n“Those asylum seekers who do share rooms have given specific consent. We will wait and see what decision the council reaches about any changes to those arrangements on Monday.” Like us on Facebook", "external_links": [], "published": "2017-03-15T01:50:00.000+02:00", "crawled": "2017-03-14T21:41:02.401+02:00", "highlightTitle": ""}