{"organizations": [], "uuid": "7fe2fb1b667081e92a02af7cc585f12f67ece5e1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article11533351.ece/ALTERNATES/s1200/JS93401665.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/second-scottish-independence-referendum-could-12736796", "country": "GB", "domain_rank": 21960, "title": "Second Scottish independence referendum could take place next year", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Second Scottish independence referendum could take place next year", "spam_score": 0.0, "site_type": "news", "published": "2017-03-14T15:00:00.000+02:00", "replies_count": 0, "uuid": "7fe2fb1b667081e92a02af7cc585f12f67ece5e1"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/second-scottish-independence-referendum-could-12736796", "ord_in_thread": 0, "title": "Second Scottish independence referendum could take place next year", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "none"}, {"name": "guy opperman", "sentiment": "none"}, {"name": "sturgeon", "sentiment": "none"}, {"name": "dave anderson", "sentiment": "none"}, {"name": "dave anderson  he", "sentiment": "none"}, {"name": "nicola sturgeon", "sentiment": "none"}, {"name": "blaydon", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "united kingdom parliament", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "bute house", "sentiment": "none"}, {"name": "edinburgh  however", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "edinburgh", "sentiment": "none"}, {"name": "westminster", "sentiment": "none"}], "organizations": [{"name": "national party", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "hexham", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "state", "sentiment": "none"}, {"name": "scottish parliament", "sentiment": "none"}, {"name": "snp", "sentiment": "none"}, {"name": "bute house", "sentiment": "none"}, {"name": "parliament  she", "sentiment": "none"}, {"name": "scots", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Second Scottish independence referendum could take place next year North East MP and Shadow Scottish Secretary Dave Anderson slams move as a 'vanity exercise' Share Nicola Sturgeon during a press conference at Bute House in Edinburgh Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nScotland could hold a second vote on independence as soon as next year, Scottish First Minister Nicola Sturgeon has announced. \nMs Sturgeon, leader of the Scottish National Party (SNP), said Scotland should have another referendum on leaving the UK because of Brexit - even though Scots voted against independence as recently as 2014. \nHowever Dave Anderson, MP for Blaydon and Labour’s Shadow Scottish Secretary of State, condemned the referendum proposal as a “vanity exercise”. Dave Anderson \nHe said: “It’s incredibly disappointing that Nicola Sturgeon has announced plans to put a vote on independence to the Scottish Parliament. \n“Scotland voted to remain within the UK in 2014, but Nicola Sturgeon is not interested in listening to the wishes of the Scottish people as it is in contradiction to her views. \n“Scotland is an equal, valued member of the UK and we must fight tooth and nail to ensure that remains the case. It is not in the best interests of Scotland, or indeed the rest of the UK, to continue along this divisive route. \n“ As a result of Brexit, the UK is divided enough without adding fuel to the fire, and it is time that the SNP stopped playing these constitutional games. \n“I’m convinced that it is in the interests of us all to stay together and to work together to deliver a better future. Scotland has so much to add to our joint futures as they have always done in the past and I believe that the majority of the Scottish people will recognise that as we face this self interested vanity exercise.” Hexham MP Guy Opperman \nConservative MP Guy Opperman, MP for Hexham, said: “I campaigned repeatedly during the last Scottish referendum to persuade the Scottish people to stay as part of the United Kingdom. It remains my strong view that we are better together.” \nThe Scottish Parliament in Edinburgh, where the SNP is the largest party, could vote to hold a second referendum. However, it doesn’t have the legal power to do this without the approval of the United Kingdom Parliament at Westminster. \nBoth the Conservatives and the Labour Party support keeping Scotland in the United Kingdom, but could tell their Westminster MPs to vote to allow a referendum to go ahead if that’s what the Scottish Parliament wants. Prime Minister Theresa May (left) meets with Scotland's First Minister Nicola Sturgeon at Bute House in Edinburgh \nHowever, Prime Minister Theresa May could say she won’t allow a second referendum to take place until after the UK has left the EU, which is unlikely to be before 2019. \nAnnouncing plans for a referendum, Ms Sturgeon said in a speech at Bute House in Edinburgh: “In my view it is important that Scotland is able to exercise the right to choose our own future at a time when the options are clearer than they are now, but before it is too late to decide our own path.” Read More Theresa May to trigger Article 50 by end of March after victories in Parliament \nShe said she wanted a vote to be held between the autumn of 2018 and spring 2019, with the choice between “a hard Brexit” and independence which would “secure a real partnership of equals with the rest of the UK and our own relationship with Europe”. Like us on Facebook", "external_links": [], "published": "2017-03-14T15:00:00.000+02:00", "crawled": "2017-03-14T10:35:56.322+02:00", "highlightTitle": ""}