{"organizations": [], "uuid": "fb272b4a8249627627aa0c80b5e7171d4355c33c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/30183074/15890988.jpg", "site_section": "http://www.thisisleicestershire.co.uk/specialolympics/rss.html?chid=181121", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/business-opinion-chancellor-should-splash-out-in-budget-while-sun-shines/story-30183074-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "TomPegden commented BUSINESS OPINION: Chancellor should splash out while it shines", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "TomPegden commented BUSINESS OPINION: Chancellor should splash out while it shines", "spam_score": 0.0, "site_type": "news", "published": "2017-03-06T21:47:00.000+02:00", "replies_count": 0, "uuid": "fb272b4a8249627627aa0c80b5e7171d4355c33c"}, "author": "TomPegden", "url": "http://www.leicestermercury.co.uk/business-opinion-chancellor-should-splash-out-in-budget-while-sun-shines/story-30183074-detail/story.html", "ord_in_thread": 0, "title": "TomPegden commented BUSINESS OPINION: Chancellor should splash out while it shines", "locations": [], "entities": {"persons": [{"name": "philip hammond", "sentiment": "negative"}, {"name": "tompegden", "sentiment": "negative"}, {"name": "sytner", "sentiment": "none"}, {"name": "joanne", "sentiment": "none"}, {"name": "harriet harman", "sentiment": "none"}, {"name": "hammond", "sentiment": "none"}, {"name": "joe", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "loughborough", "sentiment": "none"}, {"name": "east midlands", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "cambridge", "sentiment": "none"}], "organizations": [{"name": "arriva", "sentiment": "none"}, {"name": "a&e", "sentiment": "none"}, {"name": "leicester city council", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "stagecoach", "sentiment": "none"}, {"name": "bank of england", "sentiment": "none"}, {"name": "national living wage", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "This week's budget could be seen as a chance for Chancellor Philip Hammond to make hay while the sun shines. \nWhether he actually does that is yet to be seen. \nDespite the consequences of the 2007 Credit Crunch, the impact of the Brexit vote, rising house prices, Trump's election or rising inflation, the economy is in fine fettle. \nEmployment continues to head upwards, the FTSE 100 is going through the roof and consumer spending is growing faster than people's incomes. \nSweetening the mix further, the Bank of England has revised upwards its growth forecast for the year. \nRight now, the average Joe or Joanne in the street is not terrified about losing their job or losing their home. \nThe Chancellor's home - 11 Downing Street \nAs if to illustrate the point, Leicester's very own business bank – called Cambridge and Counties – has just announced record results, showing that businesses themselves are more confident to borrow or have more cash to bank. \nIt also shows there is more confidence in the banking sector – one of the first things to go after the 2007 crash. \nBut Mr Hammond says no spending sprees are in the offing because he wants to ensure the Government has \"gas in the tank\" to pay for Brexit. \nNot only that but the Government has also said public sector austerity measures will continue before the next election. \nIt might be right that the Government is sticking to its promises, but try telling that to stretched A&E staff on the verge of nervous breakdowns, or the 21 Leicester City Council cleaning staff facing redundancy under plans to cut £700,000 a year from its cleansing budgets. \nRead more: Stagecoach and Arriva among three firms in running for East Midlands rail franchise \nSo what can we expect on Wednesday? \nWe have already heard that half a billion pounds is being made available to train more skilled workers and boost Britain's economy. That cash will significantly increase training for 16 to 19-year olds. \nEducation is key when it comes to bridging the skills gap – where employers are desperate for trained workers – and help us compete with Europe and the rest of the world. \nJust like education, infrastructure is also key to a strong economy and productive society. Support for new affordable housing would be welcomed, as would more help to ease congestion on our roads, cutting emissions and making it easier for Britain to do business. \nLikewise more support for 5G mobile technology would help make Britain's economy more competitive with our neighbours. \nAll that would follow on nicely from the recent announcement that a new Enterprise Zone is being created on Leicester's science park and waterside area and in two science, technology and pharmaceutical parks in Loughborough. \nThe blueprints are there, as is the will, while the business tax, planning and other breaks that come with these zones are also beneficial. \nNow the Government needs a progressive proposals aimed at supporting new business, that will take things to the next level. \nBusiness rates are a hot topic right now with many small firms worried next month's re-evaluation of rates will hit them hard. The Chancellor needs to think hard and fast about this to ensure Leicestershire's high streets don't see even more shops pulling out. \nBUSINESS OPINION: Sytner's success is sign of confidence \nLikewise, with the low pound impacting on the price of imports, a continued freeze on fuel duty would be welcomed by any commuter, haulier or cabbie. \nA change that is already happening next month will be the rise in the National Living Wage – seen as a cornerstone in the campaign to wean people of benefits. This is welcome, so long as those who are genuinely dependent on benefits don't find themselves spiralling into a vicious cycle of misery, debt and poverty. \nFollowing on from that, Harriet Harman was in Leicester last week to hear about the shocking number of illegal sweatshops still using underpaid and un-contracted staff. \nIt will be some time before her human rights committee reports back to Parliament, but in the meantime it would be nice to see the Chancellor providing more support to organisations such as HMRC to help them ensure people are paid an honest wage for an honest day's work.", "external_links": [], "published": "2017-03-06T21:47:00.000+02:00", "crawled": "2017-03-06T19:03:40.118+02:00", "highlightTitle": ""}