{"organizations": [], "uuid": "c9387d57a19df8afbd58da1b53f1ca7348e2bfd5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30184881/15891898.jpg", "site_section": "", "section_title": "", "url": "http://www.devonlive.com/seven-things-in-the-budget-that-could-leave-you-worse-off-tomorrow/story-30184881-detail/story.html", "country": "US", "title": "Seven things in The Budget that could leave you worse off tomorrow | Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "Seven things in The Budget that could leave you worse off tomorrow | Devon Live", "spam_score": 0.109, "site_type": "news", "published": "2017-03-07T14:13:00.000+02:00", "replies_count": 0, "uuid": "c9387d57a19df8afbd58da1b53f1ca7348e2bfd5"}, "author": "Devon Live", "url": "http://www.devonlive.com/seven-things-in-the-budget-that-could-leave-you-worse-off-tomorrow/story-30184881-detail/story.html", "ord_in_thread": 0, "title": "Seven things in The Budget that could leave you worse off tomorrow | Devon Live", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Seven things in The Budget that could leave you worse off tomorrow By Devon Live | Posted: March 07, 2017 0 COMMENTS SHARES Seven things in The Budget that could leave you worse off tomorrow X \nCopy link to paste in your message / Comments (0) \nThe weekend before the Budget is always awash with rumours about what that famous red box may contain. For his part, Chancellor Philip Hammond has signalled he will prioritise building up a Brexit safety net fund instead of launching a spending spree in Wednesday's Budget. \nRead more: 'Walter Mitty' social worker who lied about qualifications never let his mask of deception slip \nMr Hammond made it clear he wanted to ensure the country had enough resources in reserve to cope with any Brexit turbulence over the next two years. \nThat appears to suggest yet more austerity, perhaps with a cash sweetener to ease the social care crisis, and increases in taxes rather than any loosening of the public purse strings. \nSo here are seven Budget issues that could leave you worse off by Wednesday tea time. TOBACCO MINIMUM PRICING \nSmokers are well used to unrelenting hikes in the tax charged on cigarettes. But if reports on Sunday are to be believed then the Budget will include plans to force a minimum price on cigarette manufacturers. It could raise the price of the cheapest pack to £8.68. CHILD BENEFIT FREEZE \nChild benefit – currently £20.70 a week for the first child and £13.70 for other children – has been frozen for 2017-18. While not being cut, inflation is expected to increase to three per cent over the next year, meaning child benefit will be worth less in real terms. \nRead more: Two arrested after body of woman found in street JOBSEEKERS ALLOWANCE \nWe already know that unemployment benefit has been frozen again. The rate for under-25s stays at £57.90 a week and £73.10 for those aged 25 or older. \nThe value of the benefit has steadily been eroded by inflation. The amount paid in March 2018 will be the same as in April 2015. \nThe Government had announced that youngsters, aged 18-21, who are out of work will not be automatically entitled to housing benefit. SELF EMPLOYED TAX \nWith Prime Minister Theresa May pledging to begin the process of the UK's withdrawal from the EU as early as March 2017, we asked small business owners: what's your take on business after Brexit? \nAnother option being weighed by Mr Hammond, the rumour mill would suggest, is an increase in taxes for self-employed people. \nThey currently pay less in National Insurance (NI) contributions than people who are employees. It could see \"Class 4\" national insurance from to 12 per cent from nine per cent. THE PRICE OF A PINT \nJust like smokers, people who enjoy a tipple have become used to forking out more after Budget day. \nThis time last year, former chancellor George Osborne announced that beer duty would be put on hold. \nWhile Mr Hammond could opt to raise the tax, he'll also be conscious that many pubs are already facing their own budget pressures because of increases in business rates. CAR INSURANCE \nFears that motorists could be faced with further hikes to the cost of their cover have been raised by the AA. \nInsurance premium tax (IPT) affects the cost of new policies bought by a wide range of insurance customers, including those buying home insurance, motorists, private medical insurance customers and pet owners. \nA string of increases to IPT have already been made, and as announced in the Autumn Statement, from June 1, the IPT rate will increase further, from 10% to 12%. TAX CREDITS \nAlmost all the universal credit rates have been frozen for 2017-18, which, just like child benefit, means a real-term cut once rising inflation is taken into the equation. In terms of child tax credit, important changes come into effect from April 6 which limits it to two children. ", "external_links": [], "published": "2017-03-07T14:13:00.000+02:00", "crawled": "2017-03-07T10:06:54.364+02:00", "highlightTitle": ""}