{"organizations": [], "uuid": "9e35809e93b426ff00b5ecaf18ee9ea46f8e0409", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30219539/15918637.jpg", "site_section": "http://www.middevongazette.co.uk/news.rss", "section_title": "Devon Live news RSS feed", "url": "http://www.devonlive.com/council-leader-battles-opposition-at-heated-debate-on-exeter-pool-scheme/story-30219539-detail/story.html", "country": "GB", "title": "Council leader clashes with opposition at heated debate on Exeter...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "Council leader clashes with opposition at heated debate on Exeter...", "spam_score": 0.0, "site_type": "news", "published": "2017-03-22T05:58:00.000+02:00", "replies_count": 0, "uuid": "9e35809e93b426ff00b5ecaf18ee9ea46f8e0409"}, "author": "Alex_Richards", "url": "http://www.devonlive.com/council-leader-battles-opposition-at-heated-debate-on-exeter-pool-scheme/story-30219539-detail/story.html", "ord_in_thread": 0, "title": "Council leader clashes with opposition at heated debate on Exeter...", "locations": [], "entities": {"persons": [{"name": "pete edwards", "sentiment": "none"}, {"name": "cllr pete edwards", "sentiment": "none"}, {"name": "andrew leadbetter", "sentiment": "none"}, {"name": "cllr edwards", "sentiment": "none"}, {"name": "cllr phil bialyk", "sentiment": "none"}, {"name": "cllr rob newby", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "cllr kevin mitchell", "sentiment": "none"}, {"name": "cllr bialyk", "sentiment": "none"}], "locations": [{"name": "exeter", "sentiment": "none"}], "organizations": [{"name": "the conservative group", "sentiment": "none"}, {"name": "liberal", "sentiment": "none"}, {"name": "bus station and leisure complex board", "sentiment": "none"}, {"name": "st sidwell", "sentiment": "none"}, {"name": "cil", "sentiment": "none"}, {"name": "labour group", "sentiment": "none"}, {"name": "exeter conservative", "sentiment": "none"}, {"name": "exeter city council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Council leader clashes with opposition at heated debate on Exeter pool scheme By Alex_Richards | Posted: March 21, 2017 0 COMMENTS SHARES Comments (0) \nAn emergency meeting was held tonight to debate Exeter's delayed £32 million leisure centre and bus station redevelopment, revealing brand new information about the controversial development. \nThe heated Exeter City Council extraordinary meeting heard questions about delays to the major city centre project, its management and environmental aspects of the scheme. \nMembers of the council had tabled a whopping 170 questions to council leader Pete Edwards on the in-limbo project. Some remaining unanswered. Return to home page or read a blow-by-blow account of tonight's council meeting \nAmong concerns raised was the financial burden of delaying the scheme. The cost of the council-led project, which combines the cost for leisure centre St Sidwell's Point and a replacement bus station, is set to increase as a result of being put on hold. \nFollowing a question tabled by Cllr Rob Newby, it was revealed that the council has already spent part of the budget, with £3.4 million on the leisure complex and £760,000 on the bus station. \nBelow: Council Leader Pete Edwards reads an opening statement \nCllr Phil Bialyk, chair of the Bus Station and Leisure Complex Board, told the meeting: \"We have to get the best deal for Exeter, and that is what we are going to do.\" \nRegarding the possible outsourcing of the contractor to run the proposed pool, he added: \"I would prefer to do things in-house. It became clear to me that we do not have the skills in-house or capacity to turn that round at the moment. It was not the best route. I am confident we will provide a good operator for this project.\" Return to home page or read a blow-by-blow account of tonight's council meeting \nWhen asked by Liberal Democrat Cllr Kevin Mitchell why Brexit has been cited as part of the reason the project has been delayed, Cllr Bialyk responded: \"A number of issues took place during middle of last year and number of consequences took place. An event took place last year that changed a number of things. \n\"The pound decreased and a number of projects across the country went on hold. We've all been listening and watching the news. We're seeing the consequences of the construction market not being confident, not being buoyant, not being able to find workers.\" \nDuring the course of the meeting, Cllr Edwards may have inadvertently dropped a minor bombshell about his future as Exeter's Labour leader. \nWhen asked to defend the project he declared: \"If this pool doesn't make any money, I'll go.\" Adding: \"Oh well, I'm going anyway.\" He later declined the expand on the comment. \nFollowing the meeting, Exeter Conservative leader Andrew Leadbetter said: \"The Conservative Group asked a large number of questions to attempt to get to the bottom of what's going on and the real situation regarding the Swimming Pool. As predicted the Labour Group was evasive and did not want to answer our questions. It is clear that they have no Sports Strategy or clear vision for the Pool. \n\"It is clear that the Pool is going to cost even more than the £32M projected cost (they admitted the quotes were higher) what is outrageous is that Cllr Edwards said that they would take CIL money meant to pay for School provision and divert it to the Pool. How could a Swimming Pool be more important than education? It is clear that this project is out of control.\" \nFollowing the meeting, Cllr Edwards said: \"The meeting was extremely positive. I am glad to have had the opportunity to discuss in detail such a wide range of issues relating to the project. I'd like thank all of the members of the public who attended and I hope they found it informative. \n\"It is unfortunate that opposition councillors demonstrated a lack of understanding of basic and publicly available details of the scheme. Nothing has emerged as a result to undermine the rationale or process for the project. We remain committed to delivering a much needed, 21st century leisure centre and bus station for Exeter, and will continue our work towards this.\" \nBelow: Cllr Pete Edwards and Cllr Phil Bialyk share their thoughts tonight \nWhile questions were answered about the council's side of the Exeter Bus and Coach Station redevelopment, The Crown Estate appear to be pressing on with their section of the redevelopment. \nLast week they handed in the last major planning application before works begin. The reserved matters application, which goes into precise details on the layout, scale and appearance of the major scheme, has been recommended for approval by city planning officers. \nIt will be decided at a planning meeting on Monday, March 27.", "external_links": [], "published": "2017-03-22T05:58:00.000+02:00", "crawled": "2017-03-22T01:48:43.449+02:00", "highlightTitle": ""}