{"organizations": [], "uuid": "276f72f0ed57e39747ef8a7954c48e6526cc46dc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30200083/15903926.jpg", "site_section": "http://www.middevongazette.co.uk/news.rss", "section_title": "Devon Live news RSS feed", "url": "http://www.devonlive.com/devon-motorists-set-to-save-money-as-asda-cuts-petrol-prices/story-30200083-detail/story.html", "country": "GB", "title": "Devon motorists set to save money as Asda cuts petrol prices", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "Devon motorists set to save money as Asda cuts petrol prices", "spam_score": 0.0, "site_type": "news", "published": "2017-03-13T22:50:00.000+02:00", "replies_count": 0, "uuid": "276f72f0ed57e39747ef8a7954c48e6526cc46dc"}, "author": "Zoe_Stevens", "url": "http://www.devonlive.com/devon-motorists-set-to-save-money-as-asda-cuts-petrol-prices/story-30200083-detail/story.html", "ord_in_thread": 0, "title": "Devon motorists set to save money as Asda cuts petrol prices", "locations": [], "entities": {"persons": [{"name": "devon", "sentiment": "none"}, {"name": "lee fraser", "sentiment": "none"}, {"name": "charmaine", "sentiment": "none"}, {"name": "paul darlow", "sentiment": "none"}, {"name": "charmaine charlesworth", "sentiment": "none"}, {"name": "dave tyrer", "sentiment": "none"}, {"name": "fraser", "sentiment": "none"}], "locations": [{"name": "ford park road", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "newton abbot", "sentiment": "none"}, {"name": "porlock hill", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}], "organizations": [{"name": "asda", "sentiment": "none"}, {"name": "torquay", "sentiment": "none"}, {"name": "royal marine", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "devon royal marine", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Devon motorists set to save money as Asda cuts petrol prices By Zoe_Stevens | Posted: March 13, 2017 0 COMMENTS SHARES Devon motorists set to save money as Asda cuts petrol prices X \nCopy link to paste in your message / Comments (0) \nA major supermarket has announced that it will be dropping the price of fuel by up to two pence per litre, bringing prices down to a new national price cap of 114.7ppl on unleaded and 116.7ppl on diesel at all 301 filling stations. Effective from Tuesday, motorists will benefit from cheaper fuel prices following wholesale prices falling over the last week. \nThe fuel cut, announced by Asda, will be welcomed by the millions of drivers who have seen fuel prices rise since Brexit due to the sharp fall in the pound. \nRead next: Exeter is officially one of the best places to live in the country \nIn Asda's latest Income Tracker Report vehicle fuel, one of the key essential items for consumers, increased by 16.8 per cent year on year, caused by a combination of currency movement and an increase in worldwide oil prices, along with the continuous rise in inflation to 1.8 per cent. Petrol prices had the largest impact on the rise of the cost of living for families. \nAsda's head of petrol trading, Dave Tyrer, said: \"Today's latest move shows that Asda is once again leading the way in reducing the price at the pumps to help the millions of motorists across the UK. Our new national price cap of 114.7ppl on unleaded and 116.7ppl on diesel will be welcomed by the millions of drivers who have seen fuel prices climb over the last 12 months.\" READ NEXT: \n'Fearless' worker drives 2.5-ton machine up Porlock Hill - the steepest road in the UK \nIt's one of the steepest roads in the UK - and one unlucky groundworker has had to drive a two and a half ton roller up it! Resurfacing work is taking place on the A39 at Porlock Hill, reportedly the steepest A-road in the country. It boasts a 1 in 4 gradient (25%) and, as anyone who has ever driven up or down it, can be a challenge for your gearbox and brakes. \nFears for safety of missing schoolgirl Charmaine 14 Police are increasingly concerned for the welfare of Charmaine Charlesworth, 14, who is missing from Newton Abbot. Charmaine is from Torquay and was last seen in Newton Abbot at 8.30am today. Police are appealing to the public to help them locate her. She is described as white, 5ft 1ins tall, long mousy-coloured hair, and was last seen wearing her school uniform consisting of a black blazer with a logo, a turquoise striped tie and a white shirt.\nRoyal Marine denies rape and assault A Devon Royal Marine has gone on trial accused of raping and assaulting a woman. Lee Fraser, 34, denies raping a woman in Devon between June 4 and June 8, 2015. Fraser, of Ford Park Road, Mutley, Plymouth also denies assaulting her causing actual bodily harm between the same dates. Judge Paul Darlow had the jury sworn and made some preliminary remarks\nThis is why there's six more weeks of delays for Exmouth's £1m sewer upgrade \nBad weather and a burst sewer have been blamed for a delay in a £1m scheme to improve Exmouth's water and sewerage networks. The South West Water scheme to upgrade both drinking water and sewer mains in the town to improve the service to residents was due to be completed by March 10.", "external_links": [], "published": "2017-03-13T22:50:00.000+02:00", "crawled": "2017-03-13T19:22:08.594+02:00", "highlightTitle": ""}