{"organizations": [], "uuid": "2519f1ebe7b61f6575206b89e271154bc8cd24e2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30185233/15892367.jpg", "site_section": "http://www.westernmorningnews.co.uk/news.rss", "section_title": "Devon Live news RSS feed", "url": "http://www.devonlive.com/labour-and-conservatives-to-blame-for-spiraling-pool-costs/story-30185233-detail/story.html", "country": "GB", "title": "Labour and Conservatives to blame for spiraling Exeter pool costs...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "Labour and Conservatives to blame for spiraling Exeter pool costs...", "spam_score": 0.0, "site_type": "news", "published": "2017-03-07T17:46:00.000+02:00", "replies_count": 0, "uuid": "2519f1ebe7b61f6575206b89e271154bc8cd24e2"}, "author": "Devon Live", "url": "http://www.devonlive.com/labour-and-conservatives-to-blame-for-spiraling-pool-costs/story-30185233-detail/story.html", "ord_in_thread": 0, "title": "Labour and Conservatives to blame for spiraling Exeter pool costs...", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Labour and Conservatives to blame for spiraling Exeter pool costs - letter By Devon Live   0 COMMENTS SHARES Plans for the new swimming pool complex Labour and Conservatives to blame for spiraling Exeter pool costs - letter X \nCopy link to paste in your message / Comments (0) \nThe following letter was sent by Adrian Fullam, Exeter Liberal Democrats. \nThe least surprising news was reported recently that the proposed new pool in Exeter will be delayed and the Labour run Council forced to admit that costs will rise. To put this into context, the combined project is already costed at an eye watering £32 million. There are about 40,000 homes in Exeter, so this is already about £800 per household, just for this one scheme. Where will it end? \nThe recent protests of Conservative Councillors is laughable. I recall in my time on the Council voting against these proposals as my Lib Dem colleagues and I could foresee this exact situation. Conservatives argued in favour of the Labour vision and the voting records are all formally online to see the proof. Now they have withdrawn their backing at this late stage, when they are complicit with the mistake. \nRead more: Exeter bus station redevelopment in deep water as Tories hit out at council \"passion project\" \nRecent years have seen most Lib Dems replaced with Labour Councillors. Not one of these new Labour Councillors will call out any decision of the clique dominating Council policy no matter how disastrous. The city desperately needs to return to a more balanced Council with opposition members with the courage, ability and judgement to expose Council decisions to the most robust scrutiny to avoid blunders of this magnitude. \nLabour Councillors blame Brexit and the state of the economy. They constantly claim credit for how well Exeter is doing, do they take responsibility when it is not so good? As for Brexit, this is something they are all behind now with their leader Jeremy Corbyn demanding Labour MPs vote to trigger article 50. \nThe risks from Brexit arise mainly because they unconditionally support the isolationist and protectionist direction of quasi-Ukippers, May, Johnson, Davis and Fox. When we leave the EU we still need an open, pro-trade economy and positive relations with our international partners and their citizens. Maybe this is something Labour Councillors and former supporters may want to reflect on when they are tempted to vote to shore up this disfunctional Council regime.", "external_links": [], "published": "2017-03-07T17:46:00.000+02:00", "crawled": "2017-03-07T14:13:08.661+02:00", "highlightTitle": ""}