{"organizations": [], "uuid": "4de2dfdf1148882c95e06e48f7c86c6a841d795b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/30190143/15896719.jpg", "site_section": "http://www.thisisleicestershire.co.uk/weathernews/rss.html?chid=182806", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/budget-reaction-east-midlands-chamber-of-commerce-and-fsb/story-30190143-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "TomPegden commented BUDGET REACTION: East Midlands Chamber of Commerce and FSB", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "TomPegden commented BUDGET REACTION: East Midlands Chamber of Commerce and FSB", "spam_score": 0.0, "site_type": "news", "published": "2017-03-09T00:38:00.000+02:00", "replies_count": 0, "uuid": "4de2dfdf1148882c95e06e48f7c86c6a841d795b"}, "author": "TomPegden", "url": "http://www.leicestermercury.co.uk/budget-reaction-east-midlands-chamber-of-commerce-and-fsb/story-30190143-detail/story.html", "ord_in_thread": 0, "title": "TomPegden commented BUDGET REACTION: East Midlands Chamber of Commerce and FSB", "locations": [], "entities": {"persons": [{"name": "scott knowles", "sentiment": "negative"}, {"name": "tompegden", "sentiment": "negative"}, {"name": "les phillimore", "sentiment": "none"}, {"name": "hammond", "sentiment": "none"}], "locations": [{"name": "east midlands", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "castle donington", "sentiment": "none"}, {"name": "mountsorrel", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "east midlands chamber of commerce", "sentiment": "negative"}, {"name": "fsb comments", "sentiment": "negative"}, {"name": "federation of small businesses", "sentiment": "none"}, {"name": "commission", "sentiment": "none"}, {"name": "small business relief", "sentiment": "none"}, {"name": "fsb", "sentiment": "none"}, {"name": "business rates", "sentiment": "none"}, {"name": "national insurance", "sentiment": "none"}, {"name": "breedon group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Comments (1) \nReacting to today's Budget, Scott Knowles, Chief Executive at East Midlands Chamber of Commerce , said: \"It was a cautious budget, no rabbits out of the hat and some more details on things announced previously, but given the imminent triggering of Article 50, that's more or less what we expected. \n\"It was disappointing that there wasn't any mention of the Industrial Strategy Green Paper, which is still open for consultation, and barely any reference to the Midlands Engine beyond saying that there would be an announcement about it tomorrow. \n\"Both are initiatives that the Government wants business to get behind but, again, we weren't given anything to work with. \n\"The message to entrepreneurs and the self-employed seemed misplaced. \n\"On the one hand Government is trying to encourage entrepreneurialism to send out a message that UK plc is very much open for business and then on the other hand, having quoted that there are 4.8 million self-employed people in this country, the Chancellor announced increases in National Insurance and suggested that many people choose self-employment just for the tax advantages and don't contribute their share to the economy. \n\"We feel this could be a disincentive to people wanting to start their own business, and certainly that was the feeling expressed by the panel of business people who watched the budget with us at PwC, at Castle Donington, and took part in the debate afterwards. \n\"It was felt that the measures set out in the budget were something of a blunt instrument where a finer touch was necessary, including considering ability to pay. \n\"It would have been good to have seen something that would encourage confidence in UK plc post-Brexit, but there wasn't anything to bite at. \nBUDGET REACTION: Are you a winner or a loser? \n\"For some time now, we have been calling for a complete review of the broken Business Rates system which discourages investment, takes no account of a business' ability to pay and is based on the wrong price index. \n\"Following the outcry about the recent revaluations, which will see many businesses facing substantial increases in Business Rates from next month, it was good to see that pubs will get a further £1,000 of relief and some small businesses that find themselves falling out of the Small Business Relief safety net, will be entitled to extra relief, but the £300 million pledged to help them will barely scratch the surface of the problem. \n\"A promise of a review of the revaluations process before the next revaluation falls due will do nothing to help businesses today or tomorrow. \nUPDATE: Breedon Group turnover could hit £650m this year \n\"It was also good to see that businesses with turnover below the VAT threshold will be allowed another year's grace before having to start quarterly reporting for tax purposes, but it's a deferment, not a long-term change. \n\"It's good to see the Chancellor looking to level the playing field between businesses that have to invest in bricks and mortar and those operating in a digital environment who don't have to pay Business Rates, but the devil will be in the detail. \n\"What was good, although it was announced at the weekend, was the £500m for vocational and technical training and the emergence of the new T-level qualification that will have parity of esteem with the more academically-focused existing A-levels and degree courses. \n\"This will encourage more young people to choose a technical rather than academic approach to education and should help close the skills gap between what academia delivers and what employers need. \n\"In short, this was an opportunity for the Chancellor to make a statement about a vision for Britain post-Brexit. \n\"More could have been made of the Industrial Strategy, for example, but instead what he delivered was rather bland. \n\"Business had been advised not to expect much in the way of change and it's fair to say that Mr Hammond did not disappoint on that front. \n\"Given the current circumstances, that might prove to be nothing bad.\" \nLes Phillimore is regional chairman of the Federation of Small Businesses and managing director of The Director-e executive jobs board, in Mountsorrel \nHe said: \"The FSB welcomes the fact that the Chancellor has listened to the small business-led campaign on business rates which we have provided evidence for from our particularly hard hit local boroughs. \n\"We have been campaigning for more transitional relief and a discretional fund for Local Authorities to help those businesses most hard-hit. \n\"The £435 million of new money is a direct and much-needed response to those facing sudden large hikes in their business rates. \n\"This immediate relief is vital in the short-term, and action on more frequent revaluations will also help. But this tax remains out-of-date, so today we call for a cross-party Commission to create a simple, fair tax system for a modern economy. \n\"Mr Hammond announced that he would take forward FSB's proposals to help the self-employed in the benefits system. \n\"We look forward to working with him on what this may mean for maternity benefits and paternity leave. \n\"However, the National Insurance rise to 10% next year and 11% in 2019 should be seen for what it is – a £1 billion tax hike on those who set themselves up in business. \n\"This undermines the Government's own mission for the UK to be the best place to start and grow a business, and it drives up the cost of doing business. \n\"Our 2,500 members in Leicestershire have been experiencing hikes in the cost of doing business as well as increasing uncertainty over the last 12 months, and the 4.8 million strong self employed small business owners, who are the backbone of the economy in this country need support. \n\"Increasing the tax burden, effectively funded by a reduction in corporation tax over the same period, is the wrong way to go.\" \nLooking for a job? Click here for the latest vacancies in Leicestershire", "external_links": [], "published": "2017-03-09T00:38:00.000+02:00", "crawled": "2017-03-08T22:32:38.969+02:00", "highlightTitle": ""}