{"organizations": [], "uuid": "eeaab685c5efe6da08aa2148bbb08fc5fdb4940a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12807112.ece/ALTERNATES/s1200/VRR_JNL_290317_therocket_01.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/commercial-property/opportunity-knocks-property-investors-looking-12806720", "country": "GB", "domain_rank": 21960, "title": "Opportunity knocks for property investors looking to lay down roots in the North East", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Opportunity knocks for property investors looking to lay down roots in the North East", "spam_score": 0.0, "site_type": "news", "published": "2017-03-29T19:00:00.000+03:00", "replies_count": 0, "uuid": "eeaab685c5efe6da08aa2148bbb08fc5fdb4940a"}, "author": "Vicky Robson", "url": "http://www.chroniclelive.co.uk/business/commercial-property/opportunity-knocks-property-investors-looking-12806720", "ord_in_thread": 0, "title": "Opportunity knocks for property investors looking to lay down roots in the North East", "locations": [], "entities": {"persons": [{"name": "bradley hall", "sentiment": "none"}, {"name": "catherine walker", "sentiment": "none"}, {"name": "tyne", "sentiment": "none"}, {"name": "christopher ives", "sentiment": "none"}, {"name": "jeremy middleton", "sentiment": "none"}, {"name": "paul watson", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "julie dodds", "sentiment": "none"}, {"name": "neil foster", "sentiment": "none"}, {"name": "neil hart", "sentiment": "none"}, {"name": "marston", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "cannes", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "pallion", "sentiment": "none"}, {"name": "durham county council", "sentiment": "none"}, {"name": "brunel street", "sentiment": "none"}, {"name": "bradley hall", "sentiment": "none"}, {"name": "doxford international business park", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "belmont business park", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "south east", "sentiment": "none"}, {"name": "south tyneside", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "castletown", "sentiment": "none"}, {"name": "carillion", "sentiment": "none"}], "organizations": [{"name": "north east business opportunity", "sentiment": "negative"}, {"name": "milburngate house", "sentiment": "none"}, {"name": "arlington real estate and richardsons capital", "sentiment": "none"}, {"name": "hanro group", "sentiment": "none"}, {"name": "international advanced manufacturing park", "sentiment": "none"}, {"name": "quayside house", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "north east england chamber of commerce", "sentiment": "none"}, {"name": "bede house", "sentiment": "none"}, {"name": "iamp", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}, {"name": "arch", "sentiment": "none"}, {"name": "durham county council", "sentiment": "none"}, {"name": "legal & general capital", "sentiment": "none"}, {"name": "ryder architecture", "sentiment": "none"}, {"name": "bradley hall", "sentiment": "none"}, {"name": "sunderland city council", "sentiment": "none"}, {"name": "northern powerhouse", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "invest newcastle", "sentiment": "none"}, {"name": "middleton enterprises", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Opportunity knocks for property investors looking to lay down roots in the North East Why should companies invest in the North East? Commercial property experts in the region give their views about what the area has to offer Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \n“We have a strong presence in the North East and we see more opportunities to invest in the region. The southern market is saturated and opportunities there are limited. We would rather invest in the Northern Powerhouse.” \nThis ringing endorsement of the North East’s potential comes from Christopher Ives, development director at Carillion, the firm that’s driving forward the high-profile Milburngate scheme along with Arlington Real Estate and Richardsons Capital. \nThe £150m mixed-use scheme will bring premium restaurants and bars, high-spec apartments and sustainable, energy-efficient offices to Durham city centre. It will also boost employment in the area, with an estimated 1,000 new jobs up for grabs. (Photo: Handout) \nMilburngate House, which was originally built in the 1960s, has now been demolished to make way for the new development and an agreement has been struck with Marston’s to house a Pitcher and Piano bar on site. An Everyman cinema will also be part of the regeneration scheme, which will attempt to generate long-term investment in the area in the post-Brexit era. \n“Brexit has made people a lot more cautious again,” said Mr Ives. “If you’re making components for the automotive sector, for example, you might hold off to see what the impact of Brexit will be. \n“It’s difficult to say at this stage. Brexit might even be a good thing in that it may stimulate more investment in the region.” \nRegardless of the fall-out from Britain’s decision to leave the EU, commercial property professionals are determined to fly the flag for the North East and talk up the benefits of investing there. \nDelegates from Northumberland development company Arch and chartered surveyor and estate agent Bradley Hall jetted out to Cannes in southern France recently to attend MIPIM, a four-day real estate exhibition, conference and networking bonanza that attracts thousands of influential property professionals from all over the globe. \nArch and Bradley Hall were accompanied by 23 other private sector organisations from the North East – including Port of Tyne, Ryder Architecture and The Hanro Group – who joined forces as part of Invest Newcastle to encourage investment opportunities in the region. \nNeil Hart, managing director at Bradley Hall, said: “We’re delighted to be joining the best professionals in the international property industry and sharing our opportunities with the world’s leading investors and business people. \n“The North East is an area with an outstanding amount of opportunity for business and investors. We can provide business people with those opportunities while being guided by the most talented and experienced professionals.” \nArch said the occasion would provide a fantastic platform to promote Northumberland as a place to do business. \nJulie Dodds, head of economic growth at Arch, said: “We enjoyed networking with some of the most influential professionals in the international property market, while having the opportunity to really push the message that Northumberland is one of the most exciting, up-and-coming areas for investment and business opportunities.” (Photo: Handout) \nInvest Newcastle said its vision for the future was to see the city become a leading European destination. Inward investment director Catherine Walker said: “Newcastle is home to the fastest-growing tech sector in England and 2016 saw active demand for more than 400,000sqft of Grade A office space. \n“Our retail sector has been heavily redeveloped over the past ten years with more plans set to come into fruition in the coming years – providing a wide range of opportunities for investors, developers and corporate occupiers.” \nSome of these opportunities have already been snapped up. Late last year Legal & General Capital sealed a £65m deal to provide funding that will deliver more than 200,000 sq ft of Grade A office space at Newcastle ’s Science Central, a £350m scheme that’s expected to create 4,000-plus jobs, 500,000sqft of office space and 450 new homes. \nMeanwhile, Middleton Enterprises is quietly building up a property portfolio that includes the high-spec Bede House office development on Belmont Business Park, the Brunel Street industrial development in Newcastle and the four-storey Quayside House that accommodates several businesses in Sunderland. (Photo: Handout) \nSerial entrepreneur Jeremy Middleton, who runs Middleton Enterprises, said: “There are many reasons to invest in the North East. It’s a low-cost place to do business and there’s a good pool of labour and strong work ethic here. If you compare our region to the South East, it’s cheaper, there’s more available land and more people with the right skills. It’s also a really nice place to live and easy to get around.” \nHe said Enterprise Zones were an integral part of a “good investment landscape” in the region, with companies able to capitalise on business rate relief and generous capital allowances. Meanwhile, retail spaces in town centre locations are being snapped up by leisure and hospitality firms hoping to capitalise on local appetite for fine dining. The region’s transport infrastructure is also a major draw for investors, with the North East benefiting from highways, railway links and established ports and airports. \nDespite these obvious attractions, however, heard-headed investors will continue to base their investment decisions on financial numbers. If the sums don’t add up, it will outweigh any other consideration. \nCouncillor Neil Foster, cabinet member for regeneration and economic development at Durham County Council, said: “It has to be a commercially viable project for investors to come here. People won’t invest if there’s no long-term value in the site.” \nHe believes the public sector has a vital role to play in attracting inward investment, plugging funding gaps and helping the private sector kick-start schemes in the region. \n“One approach for local authorities to take is to partner with them [companies] and take long-term leases where it’s the right decision,” he said. “That can help to lay a funding platform. \n“Also, can local authorities work with companies to draw down money from the Local Growth Fund to get projects off the ground? \n“There’s plenty of appetite for investment in the North East, as you can see by the changing landscape. From our point of view at Durham County Council, we’re engaging with the private sector in a positive manner. We’re starting to develop a perception that this is a good place for investment and this good news is spreading fast.” \nCouncillor Paul Watson, leader of Sunderland City Council, puts forward the case for investing in Sunderland (Photo: Handout) \nSunderland is a brave city, a bold city, and we’re not afraid to innovate. \nPeople and investors like these attributes. As I look ahead to the new bridge opening next year, as developments on our award-winning seafront take shape, as a new central business district develops at the Vaux site, how Next plc is moving into the city centre with a major new store, how the City of Culture bid is moving forward, or our hosting of the Tall Ships Race in 2018, I can see a common theme of taking the long view, working in partnership and remaining at the heart of our region. \nIt was noted by the North East England Chamber of Commerce recently how there was growing momentum around Sunderland with the New Wear Crossing taking shape and how plans were moving on for the International Advanced Manufacturing Park (IAMP). All credit to them for this recognition. \nIf you don’t know these projects, the crossing is the new bridge between Castletown on the north side of the River Wear to Pallion on the south; and the IAMP, equivalent to more than 100 football pitches, is for land to the north of Nissan and west of the A19. \nThis bridge and its approach roads are currently the region’s biggest civil engineering project and the A-frame pylon, which rises to 105 metres (344ft), is a new landmark for the region. But this is about more than transport benefits or symbolism; the crossing is also about helping to open up new development and economic opportunities. (Photo: Handout) \nThe IAMP, too, is about securing more automotive supply chain jobs following Nissan’s recent announcement that the Qashqai and X-Trail replacement models are to be manufactured here from 2020. Also, in case you didn’t know, the IAMP has been recognised as a nationally significant infrastructure project by the Government and is designed to attract more than 5,000 jobs and £300m of private sector investment over the next ten years. \nThis is what we do. We’re always making and finding opportunities, there’s a strong ‘can do’ culture here, and we open up opportunities – this is “MAKE It Sunderland”. \nAcross the city council, partnerships in the community, with agencies, organisations and companies at a national, regional and local level, are promoting and securing investment. Similarly, the land that has been identified for the IAMP isn’t all in Sunderland and so this is very much a partnership with our neighbours in South Tyneside on a project to benefit all of the North East. \nThis partnership-working isn’t something that has happened overnight. Sunderland has a strong and proud record of attracting investment, both public and private. Growth and opportunities don’t happen in isolation and so Sunderland works and makes opportunities with and in partnerships. \nI don’t need to cite the 30-year-old example of how Nissan has gone from a couple of hundred workers to grow and create a cluster of industry and employment that attracts headlines across the world – but I have. Our IAMP is also a project that will grow that cluster further and create more manufacturing. \nIn the 1990s and at the turn of the millennium, Sunderland was attracting investment at Doxford International Business Park with its contact and back-office functions. Recent figures suggest that in the last six years there has been more than £1.3bn of public and private investment here and, as another example, in the last ten years a software cluster of several thousand jobs has grown from virtually nothing. We are continuing to attract investment and there is always momentum in Sunderland. Like us on Facebook", "external_links": [], "published": "2017-03-29T19:00:00.000+03:00", "crawled": "2017-03-29T14:38:18.035+03:00", "highlightTitle": ""}