{"organizations": [], "uuid": "2e13a307d538ffe42cbeca35b62f751c7e94c26f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30183273/15891290.jpg", "site_section": "http://www.westernmorningnews.co.uk/business.rss", "section_title": "Devon Live Business RSS feed", "url": "http://www.devonlive.com/torquay-cake-factory-to-feature-on-bbc-brexit-documentary/story-30183273-detail/story.html", "country": "GB", "title": "Torquay cake factory to feature on BBC Brexit documentary", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "Torquay cake factory to feature on BBC Brexit documentary", "spam_score": 0.0, "site_type": "news", "published": "2017-03-06T23:44:00.000+02:00", "replies_count": 0, "uuid": "2e13a307d538ffe42cbeca35b62f751c7e94c26f"}, "author": "RomPEllis", "url": "http://www.devonlive.com/torquay-cake-factory-to-feature-on-bbc-brexit-documentary/story-30183273-detail/story.html", "ord_in_thread": 0, "title": "Torquay cake factory to feature on BBC Brexit documentary", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Torquay cake factory to feature on BBC Brexit documentary By RomPEllis | Posted: March 06, 2017 0 COMMENTS SHARES Ministry of Cake managing director Chris Ormrod Torquay cake factory to feature on BBC Brexit documentary X \nCopy link to paste in your message / Comments (0) \nSuccessful Torquay-based dessert manufacturer Ministry of Cake is to feature in a BBC documentary on Brexit this week. Ministry of Cake, which recently received praise from Prime Minister Theresa May, was visited by the BBC's political editor Laura Kuenssberg and former Conservative leader Iain Duncan Smith recently. \nManaging director Chris Ormrod took the opportunity to quiz the Tory MP about the implications of leaving the European Union on the business in the local economy. \nMr Ormrod said: \"It was another interesting day at Ministry of Cake. We are trying to get Donald Trump next week – watch this space. Seriously, given that Brexit is one of the biggest discussions I am having with my directors at the moment it was a very useful day. The chance to get across our views and concerns about the impact of Brexit on our business was very welcome.\" \nThe company, which employs 400 staff in factories in Watcombe and Somerset, was recently bought by French pudding giant Mademoiselle Desserts. \nMinistry of Cake also announced the opening of its new Department of Traybake, responsible for the production of a brand new range. The dessert manufacturer is now launching traybakes in eight of the best loved varieties including chocolate brownies, millionaire shortbread and rocky road bringing a jobs boost to Torquay. \nREAD NEXT: Ultrafast broadband comes to Dartmoor Zoo \nMinister in Charge, John Gregson, said: ''This is an exciting development within our product capabilities. As well as the cakes, puddings and cheesecakes we are well known for, we now have a completely new range that we can talk to our customers about. From the research into traybakes currently in the market, I'm confident that we have great tasting, amazing looking collection of products and at price points that our customers will be excited about.'' \nThe new lines are being made at the Ministry of Pudding's site in Torquay, in the new Department of Traybake production area, now fully operational after an investment of £500,000 in specialist equipment. This extension has also meant that the company has been able to take on 25 additional staff from the local area. \nREAD NEXT: Bovey Tracey Primary School reopens following three day closure after sickness outbreak \nThe full range is - Flapjack, Granola Bar, Chocolate Brownie, Raspberry and Coconut Slice, Millionaire Shortbread, Cherry Bakewell, Rocky Road and All Butter Shortbread. All are pre-portioned into 12 slices. \nMrs May recently described Ministry of Cake's chocolate fudge cake as 'delicious' after the dessert was sent to 10 Downing Street. Brexit: Britain's Biggest Deal is broadcast at 9pm on Thursday on BBC Two. READ NEXT:", "external_links": [], "published": "2017-03-06T23:44:00.000+02:00", "crawled": "2017-03-06T19:42:52.503+02:00", "highlightTitle": ""}