{"organizations": [], "uuid": "4ab9f2fce52f8f48b51e45921ca37f45aa63cc30", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article11173184.ece/ALTERNATES/s1200/JS59064771.jpg", "site_section": "http://www.thejournal.co.uk/business/?service=rss", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/ringtons-plans-express-delivery-service-12740360", "country": "GB", "domain_rank": 21960, "title": "Ringtons plans express delivery service for tea-drinkers in a hurry", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Ringtons plans express delivery service for tea-drinkers in a hurry", "spam_score": 0.0, "site_type": "news", "published": "2017-03-14T21:55:00.000+02:00", "replies_count": 0, "uuid": "4ab9f2fce52f8f48b51e45921ca37f45aa63cc30"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/ringtons-plans-express-delivery-service-12740360", "ord_in_thread": 0, "title": "Ringtons plans express delivery service for tea-drinkers in a hurry", "locations": [], "entities": {"persons": [{"name": "ringtons", "sentiment": "negative"}, {"name": "colin smith", "sentiment": "negative"}, {"name": "byker", "sentiment": "none"}, {"name": "simon smith", "sentiment": "none"}, {"name": "jon malton", "sentiment": "none"}, {"name": "nigel smith", "sentiment": "none"}], "locations": [{"name": "ringtons", "sentiment": "none"}, {"name": "east africa", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}], "organizations": [{"name": "facebook", "sentiment": "none"}, {"name": "google", "sentiment": "none"}, {"name": "brand division", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The Ringtons Operational Directors, (left to right) Colin Smith Managing Director of Production Division, Jon Malton Managing Director of the Brand Division, Simon Smith, CEO and Nigel Smith, Chair Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nNorth East family tea firm Ringtons is exploring options that could see customers getting traditional treats delivered within two hours. \nThe Byker business already has a popular online service in additional to its branded products available in selected stores, its network of doorstep delivery vans and rapidly-rising number of business-to-business clients. \nNow the 110-year-old firm is seeking to attract younger customers, by looking into a ‘Ringtons express’ service which could deliver products within hours of placing online orders. \nJon Malton, brands director at Ringtons, said: “We’ve continued to grow the doorstep business and are trying to attract more customers to it, but we do realise longer term that delivery pattern might not suit the younger generation. \n“So we need to develop business moders and revenue streams more suitanle to the modern day. The online business has grown by 20%, and we’re continuing to develop that so we’re looking at developing a subscription service and looking for a way people can commit to a regular order, not just one-offs. \n“And we’re looking at ways of delivering in a more timely way. \n“For example, wouldn’t it be great if you could go online, place an order and have that product delivered in Newcastle within two hours - a Ringtons express type thing - these are all ideas and we’re developing plans. We’d certainly want to trial those in the next couple of years. I think’s very exciting, actually.” Ringtons Kenyan Gold tea bags (Photo: Magenta) \nThe news comes as Ringtons unveiled its latest accounts for the year ended June 24 2016, which show how the firm is continuing to buck the national trend of declining tea sales. \nTurnover was up 5.1% to £54.46m on last year’s £51.8m, while operating profit also rose, by 6% to £4.52m, while retained profits after dividends and tax for reinvestment were stable at £2.5m. \nFurther growth has continued since the year end at the business, which also boosted its workforce by another 22 members of staff, taking total headcount to 532. \nHowever, while the firm predicts its sales will grow again this financial year, it said it will feel the impact of currency fluctuations and commodity price increases, which will affect the business this year and next. \nDrought conditions in East Africa, together with the fall in the pound against the dollar have led to much higher commodity prices - around 20% - creating greater uncertainty on prices and margins going forward. \nThis could lead to some price increases, but Ringtons directors said they will look to absorb as much as possible within the business. Read More Celebrating Tyneside's famous Ringtons brand as Google honours the cuppa \nCEO Simon Smith said: “We’ve made significant and continued progress on all fronts - there’s not an area of the business in which we have not made progress. Margins will be hit but that doesn’t mean we won’t make progress. \n“The business is divided into two divisions, the tea packaging division and branded divison. \n“The branded division has continued to make significant progress in terms of sales and profitability, on the doorstep and on beverages which is one of the fastest growing growing areas which we expect to continue. The Rington's cart \n“The tea market continues to be in decline but our tea business is growing with almost all of our customers. The decline is around 2%, but there are spikes - black tea has been subsidised by green tea and fruit and herbal teas. It’s under pressure, potentially generationally. \n“But we benefit from fruit and herbal areas because we do all areas of the tea market. Against the tea decline of 2% they are growing by 10% - green tea by even more.” \nChairman Nigel Smith: “The drought conditions in East Africa, Brexit and therefore currency exchange are having an impact on our business. \n“But because we carrry stocks the impact will be slower than people will imagine but it is going to impact this year and next year. \n“It’s affecting us now, more and more. Unfortunately there are some needs for price rises, but we will absorb a lot and we expect lower profits next year even though turnover is likely to rise. We are doing our best to absorb as much as we can.” Like us on Facebook", "external_links": [], "published": "2017-03-14T21:55:00.000+02:00", "crawled": "2017-03-14T17:50:34.399+02:00", "highlightTitle": ""}