{"organizations": [], "uuid": "93a20b25a18a4a5e139c267cbf9b8255c9abc093", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12712057.ece/ALTERNATES/s1200/CFR_NJL_080317formica_01.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/formica-creates-new-european-hq-12710728", "country": "GB", "domain_rank": 21960, "title": "Formica creates new European HQ on Tyneside amid £40m investment plan", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Formica creates new European HQ on Tyneside amid £40m investment plan", "spam_score": 0.0, "site_type": "news", "published": "2017-03-08T22:45:00.000+02:00", "replies_count": 0, "uuid": "93a20b25a18a4a5e139c267cbf9b8255c9abc093"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/formica-creates-new-european-hq-12710728", "ord_in_thread": 0, "title": "Formica creates new European HQ on Tyneside amid £40m investment plan", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Business Formica creates new European HQ on Tyneside amid £40m investment plan New jobs will also be created at the North Shields factory as part of the multi-million pound plans Share Mark Adamson, CEO of Fletcher Building, which owns Formica (Photo: Formica) Share Get business updates   Thank you for subscribing!   \nThe group owners of Tyneside manufacturers Formica have affirmed their commitment to the North East through a £40m investment plan that includes creating a new European headquarters for the business in the region. \nNew Zealand group Fletcher Building bought the Formica corporation, including its North Shields base, 10 years ago and one of their first moves was to relocate all office staff from the North Shields factory to a base at Cobalt Business Park. \nNow, however, the Auckland-based parent company is investing heavily at Formica’s east factory as part of multi-million pound plans, refurbishing the old offices to provide brand new European headquarters, following a board decision made after the UK vote to leave the EU . Renovation work being carried out in the original Formica building in North Shields (Photo: newcastle chronicle) \nInvestments are also set to be made in new machinery at the west factory, the production facility, which could potentially create new jobs. \nA renovation project at the two-storey building close to the Coast Road is close to completion and back office staff in customer services, IT, human resources, finance, sales, marketing and business development are preparing to move back in. \nMeanwhile, there are plans to centralise manufacturing activities under one roof in the west factory, located behind the east building. \nThe investment details were unveiled by Mark Adamson, the Consett-born CEO and managing director of Fletcher Building, who is now based in Auckland with his family, having first joined the Formica Group almost 20 years ago. \n“It’s a plant that’s been around since the 1940s. We’ve spent money in North America and so now we’re upgrading the North Shields facility. \n“It’s a three-year programme and represents fairly major investment in brand new machinery.” \nThe plan got under way last year and is being executed in three phases, starting with the full refurbishment of the Coast Road building. Mark Adamson, CEO of Fletcher Building, which owns Formica (Photo: Formica) \n“We are looking at getting it back at the plant, and they are now set to move back in,” said Mr Adamson. “There are 80-plus people in IT, marketing, HR and administration roles and they will augment the 300 people already at the site.” \nMr Adamson said the decision to create a new European headquarters for Formica at the factory as part of plans drawn up after last June’s referendum. Read More 29 jobs set to leave Newcastle as Siemens confirms training site move \nHe said: “Myself and the board made the decision following the Brexit vote. We came down on the side that having a productive business in the UK is a good thing. \n“40% of the units made come from North Shields and all of our rivals are in Europe – we can help it be the best in the UK. From a manufacturing point of view a low pound helps the North East.” \nThe third phase of the investment at the firm, which turned over £65.6m in the year ended June 2015, involves the potential launch of new products - a move which will increase the headcount, although Mr Adamson said it is not yet known how many new jobs will be created. \nHe added: “Stage three is to bring in new types of machinery to make new products, and we will need new people to do that. It’s too early to say how many, but we will need new people.” Like us on Facebook", "external_links": [], "published": "2017-03-08T22:45:00.000+02:00", "crawled": "2017-03-08T18:12:02.861+02:00", "highlightTitle": ""}