{"organizations": [], "uuid": "adb05f1ff7e9a62915397e679fd4e1a69bb2e61c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/30206237/15908580.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/melton-mowbray-pork-pies-could-be-under-threat-because-of-brexit/story-30206237-detail/story.html", "country": "US", "domain_rank": 48128, "title": "Melton Mowbray pork pies could be under threat - because of Brexit | Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "Melton Mowbray pork pies could be under threat - because of Brexit | Leicester Mercury", "spam_score": 0.999, "site_type": "news", "published": "2017-03-15T22:03:00.000+02:00", "replies_count": 0, "uuid": "adb05f1ff7e9a62915397e679fd4e1a69bb2e61c"}, "author": "", "url": "http://www.leicestermercury.co.uk/melton-mowbray-pork-pies-could-be-under-threat-because-of-brexit/story-30206237-detail/story.html", "ord_in_thread": 0, "title": "Melton Mowbray pork pies could be under threat - because of Brexit | Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "melton mowbray", "sentiment": "negative"}, {"name": "o'callaghan", "sentiment": "none"}, {"name": "defra", "sentiment": "none"}, {"name": "velluti", "sentiment": "none"}, {"name": "cornish", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "dona velluti", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "defra", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "leicester mercury", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}, {"name": "samworth brothers", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "usa", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "cumberland", "sentiment": "none"}, {"name": "charnwood", "sentiment": "none"}, {"name": "melton", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "uk protected food names association", "sentiment": "none"}, {"name": "rural affairs", "sentiment": "none"}, {"name": "minister for food", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "columbian coffee", "sentiment": "none"}, {"name": "stilton", "sentiment": "none"}, {"name": "melton mowbray pork pie federation", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "ceta", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Melton Mowbray pork pies could be under threat - because of Brexit By Merc_Reporter | Posted: March 15, 2017 2 COMMENTS SHARES Could Brexit open up Melton Mowbray pork pie to cheap imitations Melton Mowbray pork pies could be under threat - because of Brexit X \nCopy link to paste in your message / Comments (2) \nMelton Mowbray pork pies could be under threat due to foreign imitations flooding into the UK after Brexit. \nUnder European Union rules, pork pies bearing the name 'Melton Mowbray' can only be produced in a specific area which includes the town of Melton. \nOther iconic foods that have similar geographically protected status include Cumberland sausages, Stilton cheese and Cornish pasties. \nBut concerns have been raised that the products' protected status could be under threat, meaning cheap fake imports of the foodstuffs could flood the UK once it leaves the EU. \nIn a letter to the Leicester Mercury, reader Dona Velluti warned that under the Comprehensive Economic Trade Agreement (CETA), a free-trade agreement being finalised between Canada and the European Union to which the UK will be subjected even after Brexit, there is a 'list it or lose it' principle. \nUnder the principle, local food producers will not be allowed to protect their geographical identity trademark, such as 'Melton Mowbray' pork pies. \nWhereas some countries, such as France and Italy, have listed foods they want protected, that has not happened in this country. \nMs Velluti said she feared CETA was about to be ratified by the UK Government without a parliamentary debate. \nGeographical status is also under threat from the simple fact that once the UK leaves the EU, the EU protection the foods currently enjoy will no longer apply to UK products.Matthew O'Callaghan is chairman of the UK Protected Food Names Association and of the Melton Mowbray Pork Pie Federation. \nHe said members had met the Minister for Food on January 20 to discuss the concerns. \nHe said: \"We are lobbying with Defra for a new scheme under UK law. \n\"We need to gain protection against other countries, as well as those in the EU.\" \nMelton Mowbray pork pies brand is one of around 70 location-related trademarks in the UK that need protecting. \nMr O'Callaghan said: \"We are hoping to introduce a scheme very similar to the current EU scheme now, but we also want it to cover other countries outside the EU, not just Canada, but Japan, China, USA and the rest of the world.\" \nHe said the Department for Environment, Food and Rural Affairs (Defra) was making ongoing progress towards introducing such a scheme. \nBut Mr O'Callaghan said the minister said that while it was important, that there are many other issues to be addressed too. \nMr O'Callaghan said: \"Our job is to make sure the government sees preserving our protected food labels as a high priority.\" \nHe said the ideal would be that the Melton Mowbray pork pie would be protected against label theft in all major countries and the agreement would be reciprocal, with UK honouring their geographical brands in the same way. \nHe added that a country did not need to be part of the EU in order to have their products protected, for example Columbian Coffee. \nFears of other countries manufacturing goods and stealing the Melton Mowbray pork pie label were raised early last year. \nIn Leicestershire, trade organisations got together to try to encourage a general fair trade agreement with USA. \nFears of 'geographical' copycat branding from the USA cropped up at the meeting, held at Samworth Brothers in Charnwood. \nIn the absence of little progress towards any such agreement with the US, fears are growing that with Britain's exit from the European Union, the protection for our so-called geographic labels will be lost, and other countries outside Europe, such as Canada, USA and China will be better able to target UK with fake pork pie labels. ", "external_links": [], "published": "2017-03-15T22:03:00.000+02:00", "crawled": "2017-03-15T18:59:29.810+02:00", "highlightTitle": ""}