{"organizations": [], "uuid": "27ac6df129b0d31706a16326a94f426e1d16ef08", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/30233951/15929090.jpg", "site_section": "http://www.thisisleicestershire.co.uk/elections2009/rss.html?chid=181299", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/article-50-leicestershire-mps-on-the-formal-start-of-brexit/story-30233951-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "danjmartin published Leicestershire MPs on Article 50 and Brexit: 'An historic moment...", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "danjmartin published Leicestershire MPs on Article 50 and Brexit: 'An historic moment...", "spam_score": 0.0, "site_type": "news", "published": "2017-03-28T23:43:00.000+03:00", "replies_count": 0, "uuid": "27ac6df129b0d31706a16326a94f426e1d16ef08"}, "author": "danjmartin", "url": "http://www.leicestermercury.co.uk/article-50-leicestershire-mps-on-the-formal-start-of-brexit/story-30233951-detail/story.html", "ord_in_thread": 0, "title": "danjmartin published Leicestershire MPs on Article 50 and Brexit: 'An historic moment...", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "hinckley", "sentiment": "none"}, {"name": "liz kendall", "sentiment": "none"}, {"name": "wigston", "sentiment": "none"}, {"name": "andrew bridgen", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "bridgen", "sentiment": "none"}], "locations": [{"name": "united kingdom", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "rutland", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "harborough", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "oadby", "sentiment": "none"}, {"name": "blaby", "sentiment": "none"}, {"name": "east midlands", "sentiment": "none"}, {"name": "south east", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "melton", "sentiment": "none"}, {"name": "north west leicestershire", "sentiment": "none"}], "organizations": [{"name": "leicestershire", "sentiment": "negative"}, {"name": "european union", "sentiment": "none"}, {"name": "brexit  tory north west leicestershire", "sentiment": "none"}, {"name": "labour leicester west", "sentiment": "none"}, {"name": "customs union", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "bosworth", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Comments (0) \nTheresa May is to officially begin the process of withdrawing the United Kingdom from the European Union on Wednesday. \nThe Prime Minister is to trigger Article 50 of the Lisbon Treaty and formally start Brexit – eight months after \nFifty-two per cent of British voters said they wanted to leave the union. \nMrs May is to notify other European leaders of Britain's intention to quit EU and, in doing so, launch two years of \nintense negotiations to set out the terms on which the departure takes place. \nRead more: A simple Q&A about Article 50, the EU and Brexit \nTory North West Leicestershire MP Andrew Bridgen led the Leave referendum campaign in the East Midlands. \nHe said: \"This is a momentous day for democracy as we take the first steps to becoming a sovereign nation once again. \n\"Let us remember that more people voted to leave the EU than have voted for anything ever before in our history and that Brexit is being delivered by Theresa May and a Conservative Government.\" \nBut Mr Bridgen added: \"This is not a time for triumphalism as we have a long negotiation period ahead. \n\"We need to secure a deal which is good for both the UK and the EU, so we can continue to trade freely while bringing back control of our immigration policy, control of our trade arrangements around the world and, most importantly of all, control over our own laws, but our first priority must be to secure the rights of EU citizens living and working here and our citizens living in the EU.\" \nRead more: MP says sorry for not declaring HS2 home sale compensation deal \nLabour Leicester West MP Liz Kendall campaigned for Remain votes in the June referendum. \nShe said: \"When Theresa May triggers Article 50 it will be an historic moment that will shape our country for years to come. \n\"As always my focus will be on holding the Government to account for its actions and getting the best deal for my constituents. \n\"Conservative Ministers say they want Britain to have the 'exact same benefits' as we currently enjoy through our membership of the single market and Customs Union. \n\"Local companies don't want to see unnecessary tariffs on their goods, or red tape getting in the way of how they do business, so ensuring the Government delivers on this commitment is vital. \n\"Whatever deal we get has got to deliver for regions like the East Midlands – not just London and the South East. \n\"It must also guarantee rights at work and ensure decent environmental standards. I don't want employees to face a race to the bottom, or our environment to suffer, in order to try and keep Britain competitive. \n\"Protecting the public and tackling terrorism means Britain must continue to work closely with police and national security forces in the remaining EU countries. \n\"We also need to agree a new approach on immigration that manages migration fairly and keeps the best interests of Britain at its heart. \n\"The Brexit negotiations will be tough and there will have to be give and take on both sides. \n\"We need more realism and honesty about the difficult issues that lie ahead, and respect for people on all sides of the debate.\" \nThe EU referendum result in Leicestershire \nIn Leicester, people voted narrowly to remain in the EU by 51.1 per cent to 48.9 per cent on a 65.1 per cent turnout. \nParts of the county voted overwhelmingly to leave the EU. \nIn Oadby and Wigston, 55 per cent of voters opted to leave with 61 per cent in North West Leicestershire. \nIn Charnwood, the Leave campaign secured 54 per cent of the vote and in Melton it was 58 per cent. \nSome 60 per cent of Blaby voters opted for Leave with 51 per cent in Harborough and Rutland. \nHinckley and Bosworth came out for leave by 60.3 per cent.", "external_links": [], "published": "2017-03-28T23:43:00.000+03:00", "crawled": "2017-03-28T21:24:05.084+03:00", "highlightTitle": ""}