{"organizations": [], "uuid": "25eec300b9bbdbc19058be5bbdbb35ea1616a200", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30175416/15885654.jpg", "site_section": "http://www.middevongazette.co.uk/all-content.rss", "section_title": "Devon Live All Content Feed", "url": "http://www.devonlive.com/15m-boost-for-british-lamb-as-lucrative-trade-route-re-opens/story-30175416-detail/story.html", "country": "GB", "title": "AthwennaIrons published £15m boost for British lamb as lucrative trade route...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "AthwennaIrons published £15m boost for British lamb as lucrative trade route...", "spam_score": 0.0, "site_type": "news", "published": "2017-03-02T23:39:00.000+02:00", "replies_count": 0, "uuid": "25eec300b9bbdbc19058be5bbdbb35ea1616a200"}, "author": "AthwennaIrons", "url": "http://www.devonlive.com/15m-boost-for-british-lamb-as-lucrative-trade-route-re-opens/story-30175416-detail/story.html", "ord_in_thread": 0, "title": "AthwennaIrons published £15m boost for British lamb as lucrative trade route...", "locations": [], "entities": {"persons": [{"name": "george eustice", "sentiment": "none"}, {"name": "jean-pierre garnier", "sentiment": "none"}, {"name": "francis clark", "sentiment": "none"}, {"name": "eustice", "sentiment": "none"}, {"name": "mornflake", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "cheshire", "sentiment": "none"}, {"name": "defra", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "camborne", "sentiment": "none"}, {"name": "dubai", "sentiment": "none"}, {"name": "gulfood", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "gulf", "sentiment": "none"}, {"name": "kuwait", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}], "organizations": [{"name": "department for environment, food and rural affairs", "sentiment": "none"}, {"name": "redruth", "sentiment": "none"}, {"name": "lfa", "sentiment": "none"}, {"name": "horticulture development board", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "£15m boost for British lamb as lucrative trade route re-opens By AthwennaIrons | Posted: March 02, 2017 0 COMMENTS SHARES Diners in Kuwait will soon be enjoying British-produced lamb, after a significant trade route between the two countries was re-opened £15m boost for British lamb as lucrative trade route re-opens X \nCopy link to paste in your message / Diners in Kuwait will soon be enjoying British-produced lamb, after a significant trade route between the two countries... Comments (0) \nWestcountry sheep farmers could be set to benefit from a £15 million boost for British lamb exports, following the re-opening of a significant trade route. \nFarming Minister George Eustice confirmed the new deal with Kuwait today (March 2), which is hoped will support farmers and help raise the profile of British lamb to overseas diners. \nThe Camborne and Redruth MP, speaking after the trade mission to the Gulf, said British lamb has a \"fantastic reputation around the world\" for both its taste and quality. \n\"I'm delighted this export success will now be available for diners in Kuwait,\" he commented. \n\"This move to re-open the market for UK-produced lamb is another example of how we are working hard to tap into international markets and build stronger relationships with trading partners around the world.\" \nThree major UK suppliers are already set to benefit from the five-year deal, added Mr Eustice, with shipments prepped to leave soon. \nRead next: PKF Francis Clark: Farmers urged to get Brexit plans in place \nThe UK exported £625 million worth of food and drink to the region last year, including £80 million of cereal and £22 million of cheese. \nTotal lamb exports from the UK reached £330 million in 2016, up from £300 million the previous year. \nLamb production is one of the mainstays within South West agriculture. According to the latest 2016-17 Farm Business Income forecast from the Department for Environment, Food and Rural Affairs (Defra), profits on grazing livestock (cattle and sheep) farms are predicted to rise by 58% (£19,000) on lowland farms and 29% (£4,500) for those in the Less Favoured Area (LFA). \nThe statistics show that increase in output is expected for sheep enterprises as prices for fat and store lambs have been higher for most of the year due to tighter supplies, plus a weaker sterling value which has reduced imports and assisted exports. \nThe Gulf trade mission included a visit to Gulfood in Dubai, where cereal brand Mornflake from Cheshire and a mozzarella producer from Durham were among around 100 UK food and drink companies exhibiting at the world's largest annual trade show. \nJean-Pierre Garnier, head of export trade development at the Agriculture and Horticulture Development Board (AHDB), added: \"We have found for some time a high level of appetite from Kuwaiti importers and distributors for British lamb and are delighted to be able at last to supply this market. \nRead more: Farmers unite with food hamper to show minister value of UK farming \n\"We are committed to expanding sales of meat and dairy products in the Gulf region and support the Government's export work. \n\"Our presence at the important Gulfood exhibition with meat and dairy stands testifies our willingness to grow sales and open new markets.\" \nAs part of the minister's visit he witnessed the signing of two Memorandums of Understanding allowing greater collaboration between the UK government and Gulf on projects in aquaculture, fisheries, climate change and marine environments.", "external_links": [], "published": "2017-03-02T23:39:00.000+02:00", "crawled": "2017-03-02T20:54:04.919+02:00", "highlightTitle": ""}