{"organizations": [], "uuid": "b352a441b65e1b300506907dc3564010f80dc5df", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article9084069.ece/ALTERNATES/s1200/JS61708382.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/what-happen-northumberland-scotland-leaves-12742446", "country": "GB", "domain_rank": 21960, "title": "What will happen to Northumberland if Scotland leaves the UK?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "What will happen to Northumberland if Scotland leaves the UK?", "spam_score": 0.0, "site_type": "news", "published": "2017-03-15T12:00:00.000+02:00", "replies_count": 0, "uuid": "b352a441b65e1b300506907dc3564010f80dc5df"}, "author": "Michael Muncaster", "url": "http://www.chroniclelive.co.uk/news/north-east-news/what-happen-northumberland-scotland-leaves-12742446", "ord_in_thread": 0, "title": "What will happen to Northumberland if Scotland leaves the UK?", "locations": [], "entities": {"persons": [{"name": "nicola sturgeo", "sentiment": "neutral"}, {"name": "graeme pearson", "sentiment": "none"}, {"name": "dave anderson  dave anderson", "sentiment": "none"}, {"name": "jack", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "guy opperman", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "sturgeon", "sentiment": "none"}, {"name": "nicola sturgeon", "sentiment": "none"}, {"name": "danny lawson/pa wire", "sentiment": "none"}, {"name": "blaydon", "sentiment": "none"}], "locations": [{"name": "scotland", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "aberdeen", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "north northumberland", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "newcastle quayside", "sentiment": "none"}, {"name": "edinburgh", "sentiment": "none"}, {"name": "republic of ireland", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "none"}, {"name": "ms sturgeon", "sentiment": "none"}, {"name": "state", "sentiment": "none"}, {"name": "scottish parliament", "sentiment": "none"}, {"name": "snp", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "union", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "scottish national party", "sentiment": "none"}, {"name": "opperman  hexham", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "What will happen to Northumberland if Scotland leaves the UK? Scottish First Minister Nicola Sturgeon wants to hold a second referendum on Scottish independence Share Nicola Sturgeon (Photo: Danny Lawson/PA Wire) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nWith Scotland mooting the idea of a second independence referendum what does that mean for North Northumberland ? \nScottish First Minister Nicola Sturgeon confirmed she will ask for permission to hold a second referendum on Scottish independence. \nMs Sturgeon said she wanted a vote to be held between the autumn of 2018 and the spring of the following year. \nThat would coincide with the expected conclusion of the UK’s Brexit negotiations. \nThe Scottish first minister said the move was needed to protect Scottish interests in the wake of the UK voting to leave the EU. \nSpeaking after the cabinet meeting in Edinburgh on Tuesday, Ms Sturgeon said: “It should be up to the Scottish Parliament to determine the referendum’s timing, franchise and the question. \n“There should be no strings attached, no blocking mechanisms applied and no Downing Street diktat - Scotland’s referendum must be made in Scotland. \n“That was the exact description the UK Government themselves used ahead of the 2014 referendum, and the same principle should apply now.” A Saltire, Union Jack and EU flags flutter in the wind outside the Scottish Parliament \nIf the referendum goes ahead and Scotland votes to leave the UK then it will inevitably have an impact on North Northumberland. \nPeople crossing the boarder could need their passports to travel to an independent Scotland if it adopts weaker immigration controls than the remaining UK. \nIn particular, Scotland could join the Schengen Agreement - an EU scheme allowing people to travel between countries without a passport. \nThe UK is not a member, and it would mean you needed a passport to get between Scotland and the UK. \nAhead of the first referendum, the Scottish Government said “there would be no need for border checks” as Scotland would remain part of the existing common travel area between the UK and the Republic of Ireland. \nThe prospect of “indyref2” could also create a potential headache for businesses trading in Scotland. \nThe Scottish National Party stresses that it wants to prevent barriers to trade emerging between an independent Scotland and the rest of the UK. \nBut over time, different laws could create a myriad of changes to this level playing field. Dave Anderson \nDave Anderson, MP for Blaydon and Labour’s Shadow Scottish Secretary of State, has called for Scotland to remain part of the UK. \nHe said: “It’s incredibly disappointing that Nicola Sturgeon has announced plans to put a vote on independence to the Scottish Parliament. \n“Scotland voted to remain within the UK in 2014, but Nicola Sturgeon is not interested in listening to the wishes of the Scottish people as it is in contradiction to her views. \n“Scotland is an equal, valued member of the UK and we must fight tooth and nail to ensure that remains the case. Read More Pro-Europe protesters gather on Newcastle Quayside to demonstrate against Brexit bill \n“It is not in the best interests of Scotland, or indeed the rest of the UK, to continue along this divisive route. \n“As a result of Brexit, the UK is divided enough without adding fuel to the fire, and it is time that the SNP stopped playing these constitutional games. \n“I’m convinced that it is in the interests of us all to stay together and to work together to deliver a better future.” Guy Opperman \nHexham MP Guy Opperman said: “I campaigned repeatedly during the last Scottish referendum to persuade the Scottish people to stay as part of the United Kingdom. \n“It remains my strong view that we are better together.” \nMeanwhile, Prime Minister Theresa May said it is important that the constituent parts of the UK “come together” ahead of Brexit negotiations. \nPro-union activists are now preparing to stage a day of campaigning across Scotland in the wake of the referendum announcement. \nScotland in Union said it aims to rally No voters who are “angry that their 2014 vote is being ignored”. \nThe non-party movement, which has about 15,000 supporters, will take its campaign to towns and cities across the country on Saturday as the SNP meets for its spring conference in Aberdeen. \nScotland in Union chief executive Graeme Pearson said: “I’m here to say independence is not inevitable. And neither is another referendum. \n“We can stop this. But we can only stop the nationalists if those who support Scotland in the UK find their voice. \n“The silent majority spoke up in 2014. Now we must do so again. \n“The future of our country will be decided by the people of Scotland, not politicians . I believe through organisation and persuasion we can force Nicola Sturgeon to back off.” Like us on Facebook", "external_links": [], "published": "2017-03-15T12:00:00.000+02:00", "crawled": "2017-03-15T07:28:53.049+02:00", "highlightTitle": ""}