{"organizations": [], "uuid": "203d0fcff177a103a7eb2d963b3aba3c4317054a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30202712/15905881.jpg", "site_section": "http://www.westernmorningnews.co.uk/politics.rss", "section_title": "Devon Live Politics RSS feed", "url": "http://www.devonlive.com/devon-hospital-faces-20-million-deficit-as-social-care-crisis-bites/story-30202712-detail/story.html", "country": "GB", "title": "Devon hospital faces £20 million deficit as social care...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "Devon hospital faces £20 million deficit as social care...", "spam_score": 0.0, "site_type": "news", "published": "2017-03-14T21:20:00.000+02:00", "replies_count": 0, "uuid": "203d0fcff177a103a7eb2d963b3aba3c4317054a"}, "author": "Devon Live", "url": "http://www.devonlive.com/devon-hospital-faces-20-million-deficit-as-social-care-crisis-bites/story-30202712-detail/story.html", "ord_in_thread": 0, "title": "Devon hospital faces £20 million deficit as social care...", "locations": [], "entities": {"persons": [{"name": "meg hillier", "sentiment": "none"}, {"name": "philip dunne", "sentiment": "none"}, {"name": "peter heaton-jones", "sentiment": "none"}, {"name": "sarah wollaston", "sentiment": "none"}, {"name": "hillier", "sentiment": "none"}, {"name": "newton abbot", "sentiment": "none"}, {"name": "anne marie morris", "sentiment": "none"}, {"name": "kevin foster", "sentiment": "none"}, {"name": "bradshaw", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "ben bradshaw", "sentiment": "none"}], "locations": [{"name": "devon", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "west devon", "sentiment": "none"}, {"name": "exeter hospital", "sentiment": "none"}, {"name": "totnes", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north devon", "sentiment": "none"}, {"name": "north", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}, {"name": "royal devon", "sentiment": "none"}, {"name": "wollaston", "sentiment": "none"}], "organizations": [{"name": "a&e", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "public accounts committee", "sentiment": "none"}, {"name": "budget", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Devon hospital faces £20 million deficit as social care 'crisis' bites X \nCopy link to paste in your message / Comments (0) \nThe Royal Devon and Exeter hospital is facing a £20 million deficit, city MP Ben Bradshaw warned a debate on health and social care in Parliament. Meg Hillier, Labour chair of the Public Accounts Committee, called the debate, which was dominated by Devon MPs. \nMs Hillier warned: \"We are in the grip of a crisis in social care.\" \nMr Bradshaw said the clinical commissioning group which provides health services in North, East and West Devon is facing a £40 million deficit. \nAnd the Royal Devon and Exeter Hospital – \"one of the best run hospitals in the country\" – is facing a £20 million deficit. \nMr Bradshaw urged the government to \"end the uncertainty\" over EU nationals working in the health and social care system. \n\"We face a workforce crisis exacerbated by uncertainty over Brexit. \n\"People are already leaving and they are not able to recruit. The workforce crisis is going to do more damage in the short term than anything else.\" \nMr Bradshaw added: \"We need to have an honest conversation with the British public about how we fund this.\" \nHe called on Health Minister Philip Dunne to say whether the government had ruled out a \"posthumous levy\" on people's estates. \nDevon MPs urged the government to ensure fairer funding for rural areas. \nCouncils have been given the right to raise an extra 3% from April to pay soaring adult social care costs. \nIn his Budget last week the Chancellor allocated an extra £2 billion for social care. \nSarah Wollaston, MP for Totnes and chair of the Commons Health select committee, said: \"While £2 billion over three years is welcome, I would like the minister to address how this gets to the front line and is distributed according to need.\" \nShe warned that £1.2 billion had been transferred from capital to revenue budgets, hampering the ability to put in place effective plans. \nThe Chancellor also announced that GPs would be \"co-located\" in A&E departments. \nDr Wollaston said that GP practices would struggle to provide that service while they also have to offer out-of-hours and Sunday services, and alongside a \"retirement bulge\". \nShe said spending had been squeezed just as Britain was experiencing an \"extraordinary demographic change\", and called on the government to stop and take stock. \nMost of the MPs joined Dr Wollaston in calling on the government to widen its proposed green paper review of adult social care to include the NHS. \nAnne Marie Morris, Conservative MP for Newton Abbot, said: \"The NHS is the envy of the world. The social care system, frankly, is not. \nShe said social care took £14.4 billion – a third of local authority spending. \"Those of us in rural areas are clearly having to pay more because we pay more council tax overall,\" she said. \"We have a disproportionate number of over-85s, we have rural sparsity not properly dealt with.\" \n\"The government must face up to the problem, but the public must also play its part. We must accept change.\" \nNorth Devon MP Peter Heaton-Jones said the number of Devon MPs speaking in the debate reflected concern that rural areas of the South West are not getting their fair share of funding. \nHe said the NHS \"sustainability and transformation plan\" reforms were causing concern in North Devon, particularly about the future of some acute services at the district hospital. \nAny cuts at the hospital would be \"absolutely unacceptable\" because of the \"three Ds\" – distance, demographics and deprivation. \nKevin Foster, the Torbay MP, said the problems had been caused by the success of the NHS, which meant that people were living longer. \nREAD MORE:", "external_links": [], "published": "2017-03-14T21:20:00.000+02:00", "crawled": "2017-03-14T19:17:33.208+02:00", "highlightTitle": ""}