{"organizations": [], "uuid": "9eeb0cebc15f00fefee1e15c6ee91b5d345afddd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12823926.ece/ALTERNATES/s1200/JS115751789.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12818633", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast RECAP: Adderstone Group backs management buyout of AIM-listed Turbo Power Systems", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast RECAP: Adderstone Group backs management buyout of AIM-listed Turbo Power Systems", "spam_score": 0.0, "site_type": "news", "published": "2017-03-31T15:10:00.000+03:00", "replies_count": 0, "uuid": "9eeb0cebc15f00fefee1e15c6ee91b5d345afddd"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12818633", "ord_in_thread": 0, "title": "Business Breakfast RECAP: Adderstone Group backs management buyout of AIM-listed Turbo Power Systems", "locations": [], "entities": {"persons": [{"name": "carlos neves", "sentiment": "none"}, {"name": "coreena ford john lewis", "sentiment": "none"}, {"name": "cathal doocey", "sentiment": "none"}, {"name": "tom stuart", "sentiment": "none"}, {"name": "paula nickolds", "sentiment": "none"}, {"name": "philip hammond", "sentiment": "none"}, {"name": "ian baggett", "sentiment": "none"}, {"name": "stuart", "sentiment": "none"}, {"name": "nigel jakeman", "sentiment": "none"}, {"name": "greg funnell/pa wire", "sentiment": "none"}, {"name": "ian hares", "sentiment": "none"}, {"name": "phil richardson", "sentiment": "none"}, {"name": "jonny manning", "sentiment": "none"}, {"name": "john lewis", "sentiment": "none"}, {"name": "jonathan oxley", "sentiment": "none"}, {"name": "hammond", "sentiment": "none"}, {"name": "maria ludkin", "sentiment": "none"}, {"name": "charles rendell", "sentiment": "none"}, {"name": "james foster", "sentiment": "none"}, {"name": "stephenson", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "eaton", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "stockton", "sentiment": "none"}, {"name": "hardwick hall hotel", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "bowesfield lane", "sentiment": "none"}, {"name": "team valley", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "tyneside", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "south tyneside", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "olympia building", "sentiment": "none"}, {"name": "saudi arabian monorail", "sentiment": "none"}, {"name": "sunderland software centre", "sentiment": "none"}, {"name": "teesside", "sentiment": "none"}], "organizations": [{"name": "adderstone group", "sentiment": "negative"}, {"name": "turbo power systems coreena ford north east company", "sentiment": "negative"}, {"name": "energy and defence", "sentiment": "none"}, {"name": "newcastle  congrats", "sentiment": "none"}, {"name": "coreena ford northern tech awards", "sentiment": "none"}, {"name": "ukar", "sentiment": "none"}, {"name": "uk express", "sentiment": "none"}, {"name": "northstar ventures", "sentiment": "none"}, {"name": "double eleven", "sentiment": "none"}, {"name": "bt", "sentiment": "none"}, {"name": "northern stars", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "coreena ford ofcom", "sentiment": "none"}, {"name": "mbo", "sentiment": "none"}, {"name": "bradford & bingley", "sentiment": "none"}, {"name": "london stock exchange", "sentiment": "none"}, {"name": "turbo power systems plc", "sentiment": "none"}, {"name": "teesside university", "sentiment": "none"}, {"name": "blackstone", "sentiment": "none"}, {"name": "uk power networks", "sentiment": "none"}, {"name": "company", "sentiment": "none"}, {"name": "bombardier", "sentiment": "none"}, {"name": "coreena ford", "sentiment": "none"}, {"name": "boiler shop", "sentiment": "none"}, {"name": "bt openreach key event adderstone group", "sentiment": "none"}, {"name": "turbo power systems  north east", "sentiment": "none"}, {"name": "gmb", "sentiment": "none"}, {"name": "the company", "sentiment": "none"}, {"name": "ofcom", "sentiment": "none"}, {"name": "boeing", "sentiment": "none"}, {"name": "prudential", "sentiment": "none"}, {"name": "turbo power systems", "sentiment": "none"}, {"name": "northstar", "sentiment": "none"}, {"name": "fscs", "sentiment": "none"}, {"name": "nram", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "finance for business north east proof of concept fund", "sentiment": "none"}, {"name": "cpd", "sentiment": "none"}, {"name": "adderstone group limited", "sentiment": "none"}, {"name": "teesside company", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}, {"name": "chicago transport systems", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford North East company gets £250,000 investment to set up online land marketplace \nA North East digital start-up that is aiming to create an online market place for the buying and selling of land has received £250,000 investment to help it grow. \nLand Trader, which was founded in Sunderland by Tom Stuart, has won backing from venture capital firm Northstar Ventures, which has invested £130k from the Finance for Business North East Proof of Concept Fund. It has also received a £120k investment from an angel investor. \nThe site matches customers’ needs with land that is available and also offers advice from a team of industry experts on valuing, negotiating and completing land transactions. \nThe new company has attracted the experienced businessman and landowner Lord Mancroft to be its chairman. \nMr Stuart said: “Owning land is a dream shared by a great many British people, and even more are involved in the sale and servicing of the land sector. Yet working in or with the industry can sometimes feel an isolated place to be, particularly as an individual or small business. \n“The North East has a wealth of knowledge and skill in the land sector and with strong support from experienced partners we are forging an infrastructural service, a marketplace and a communications tool for all, from the most professional to the individual. \n“We’re now into the design and development phase, all thanks to Northstar and our Angel investor. We’re based in Sunderland Software Centre which is a superb place to innovate.” James Foster, Northstar Ventures, Phil Richardson and Tom Stuart, Land Trader (Photo: www.crestphotography.co.uk) 9.05 Coreena Ford John Lewis boss warns of job losses and price rises as firm faces 'challenging time' \nThe new boss at department store chain John Lewis has laid bare the difficulties she faces as she warned over a “turbulent and challenging” high street amid cost pressures from the pound and a dramatic shift in consumer spending. \nPaula Nickolds - who in January became the first female managing director in the chain’s 152-year history - said the group was facing “significant” input cost hikes from the Brexit-hit pound , with around 70% of its products imported, but said it “remained to be seen” how much of this would be passed on to the consumer. \nShe cautioned this was compounding already difficult trading conditions, as consumers are switching spending away from clothes towards eating out and holidays. \nShe said: “I’m taking over at a turbulent and challenging time. \n“This is a tough environment and there will be casualties - we can’t be under any illusion on that.” \nShe confirmed there would be more job losses across the group this year, following from the announcement last month that nearly 400 jobs were being axed, but declined to give numbers. Paula Nickolds, managing director of John Lewis (Photo: Greg Funnell/PA Wire) 8.57 Coreena Ford Fresh legal action on behalf of gig economy \nFresh legal action is being taken on behalf of workers in the so-called gig economy, involving drivers at online giant Amazon. \nThe GMB union is taking a case against logistics firm UK Express, which is based in Birmingham but employs staff across the UK. \nThe GMB said it believes the drivers fall into the same category as those at taxi firm Uber, and should be classed as workers, not self-employed. \nThe case is the latest being brought by the GMB to tackle the growing trend of what it calls “bogus” self-employment and gig economy “exploitation”. \nMaria Ludkin, GMB legal director, said: “This is another case in a long line of legal battles around bogus self-employment. \n“Employers might not like paying the minimum wage or giving their workers the protections they’re entitled to in the workplace, but I’m afraid it’s not optional. \n“UK Express deliver for some of the world’s largest companies, in this case Amazon. \n“The drivers delivering for Amazon, like Uber drivers and delivery drivers for DX, cannot be classed as anything other than employed when you look at the law. “We don’t get to pick and choose which laws we adhere to and which we don’t like the look of. \n“This is a much wider issue than individual companies like UK Express or Uber. \n“This is about employment in 21st century Britain.” The Amazon logo (Photo: PA) 8.52 FTSE and Pound latest \nThe FTSE-100 index at 8:15am was down 26.63 at 7342.89. \nThe pound at 8am was 1.2460 dollars compared to 1.2489 dollars at the previous close. The euro at 8am was 0.8575 pounds compared to 0.8589 pounds at the previous close. 8.47 KEY EVENT Turbo Power Systems now seeking AIM cancellation \nThe new owners of Turbo Power Systems have got big plans, starting by tearing up the existing strategy and drawing up a new five-year plan. \nAnd top of the list is cancelling its AIM admission. \nTWC3N wants to build on the company’s sustained improvement in financial performance over recent years and on the investments, relationships and expertise of the company in its core Rail, Industrial, Energy and Defence markets \nThe board now now considers that seeking a cancellation of its admission to AIM is in the best interests of the company and its shareholders as a whole, for the following reasons, they said: \nThe considerable cost, management time and the legal and regulatory burden associated with maintaining the company’s admission to trading on AIM which, in the Board’s opinion, are disproportionate to the benefits to the Company; \nThe free float and liquidity of the Common Shares is limited; \nThe AIM listing of the Common Shares does not, in itself, offer investors the opportunity to trade in meaningful volumes or with frequency within an active market. With little trading volume, the Company’s share price can move up or down significantly following trades of small numbers of shares; \nDue to the Company’s limited liquidity in its shares and, in practical terms, a small free float and market capitalisation, continuing admission to trading on AIM no longer sufficiently provides the Company with the advantages of providing access to capital or enabling the Common Shares to be used to effect acquisitions. \nThe Company intends to seek shareholders’ approval of the cancellation at its annual general meeting on May 25 - and bearing in mind TWC3N, who following the transaction hold 89.4% of the company’s issued share capital, it’s highly likely that the Cancellation will become effective shortly after the AGM. 8.38 Were you at the Teesside heat of the North East Business Awards? \nWere you and your colleagues caught on camera in your finery last night? \nThe chances are you were - we’ve got oodles of photos . North East Business Awards at Teesside University. 8.35 Coreena Ford From £1 to £8m: CPD Bodies is named Teesside Company of the Year \nAnd an even bigger congratulations goes out to CPD Bodies, a company bought for just £1 by a 25-year-old entrepreneur which is now the triumphant Teesside company of the year. \nCPD Bodies, which was rescued by Cathal Doocey in 2009 and is now thriving at its base in Bowesfield Lane in Stockton, took the main award at the Teesside heat of the North East Business Awards . \nFrom a failing company with just one employee, CPD Bodies now has a turnover of almost £8m, with almost 100 employees making commercial vehicle bodies on a 13-acre site. It won last night’s title against strong competition from shortlisted finalists Double Eleven and Sound Training. \nThe event at Teesside University’s Olympia Building was a celebration of the best of Teesside business, with more than 380 guests cheering small businesses, newcomers, exporters and apprentices as they won their titles. \nThe winners now go forward to the grand final at Hardwick Hall Hotel on April 27, where they will compete against winners from the heats in Northumberland and Tyneside, and Durham, Sunderland and South Tyneside. Company of the Year winners, CPD Bodies 8.30 Coreena Ford Northern Tech Awards hosted in Newcastle \nCongrats to everyone at the Northern Tech Awards, held at the Boiler Shop in Newcastle’s Stephenson Quarter last night. \nOnce a year GP Bullhound holds the Northern Tech Awards to bring together the stars of the tech community and celebrate the fastest growing and most promising companies. \nThe night saw the unveiling of the Top 50 Fastest Growing Tech Companies and the judges also selected six companies worthy of Judges’ Awards, and a winner from the Region’s 20 Northern Stars. \nMy colleague Jonny Manning was there last night, so he’ll likely serve up a report when he comes in soon. Well done all! 8.24 KEY EVENT Chancellor to sell off £11.8bn of Bradford & Bingley loans \nChancellor Philip Hammond has triggered the sale of £11.8 billion worth of Bradford & Bingley loans acquired during the financial crisis. \nThe Government said the funds would be sold to Prudential and Blackstone and delivered “value for money” for the taxpayer. \nMr Hammond said: “The sale of these Bradford & Bingley assets for £11.8 billion marks another major milestone in our plan to get taxpayers’ money back following the financial crisis. \n“We are determined to return the financial assets we own to the private sector and today’s sale is further proof of the confidence investors have in the UK economy.” \nThe Government said the price reflected the “strong credit quality” of the portfolio and was the result of a highly-competitive sale process. \nIt added that borrowers would not need to take action because there would be no change to the terms and conditions of the loans sold. \nUK Asset Resolution (UKAR) manages Bradford & Bingley and NRAM’s closed loan books on behalf of the taxpayer. \nUKAR was established in 2010 to facilitate the orderly management of the so-called “bad banks” closed mortgage books by selling off assets to reduce Government debt. \nIan Hares, UKAR chief executive, said: “This sale of assets is a significant milestone in the phased repayment of the FSCS loan extended to Bradford & Bingley and when complete will reduce UKAR’s balance sheet to £22 billion from £116 billion in 2010 when it was formed. \n“We are very pleased with the price achieved which delivers excellent value for the taxpayer. \n“The transaction delivers against our overarching objective to develop and execute divestment strategies which protect and maximise value for the taxpayer whilst treating customers fairly.” \nThe sale is expected to be completed by 2017/18, with any further sales being made subject to market conditions, the Government added. Ian Hares, chief executive of UKAR 8.20 Coreena Ford Ofcom to cut wholesale price Openreach can charge \nOfcom said it will cut the wholesale price Openreach can charge telecoms companies to help boost investment in superfast broadband. \nThe move would see the prices charged by BT’s infrastructure arm falling from the current level of £88.80 per year to £52.77 per year in 2020/2021, the watchdog said. \nIt said it expected companies to pass down the costs savings to customers in the form of lower bills. \nJonathan Oxley, Ofcom’s competition group director, said: \nOur plans are designed to encourage long-term investment in future ultrafast, full-fibre networks, while promoting competition and protecting consumers from high prices. \nPeople need reliable phone and broadband services more than ever. We’re making sure the market is delivering the best possible services for homes and business across the UK. \nThe measures will also demand Openreach fixes faults and rolls out broadband lines at a quicker pace. The telecoms watchdog said it could fine the operation if it fails to meet the new targets. BT Openreach KEY EVENT Adderstone Group backs MBO of AIM-listed Turbo Power Systems \nNorth East based property and investment business Adderstone Group has backed a buyout that will see the management team take control of Turbo Power Systems Plc (TPS) from Brazilian mining giant Vale. \nTPS specialises in the design and manufacture of world class power conversion systems to the likes of Eaton, Bombardier and UK Power Networks. \nIts technology, designed and built in the Team Valley, is used in many high profile global projects such as the Boeing 787 Dreamliner, Chicago Transport Systems and Saudi Arabian Monorail. \nThe deal will see the buyout company - known as TWC3N - own an 89.4% controlling stake in TPS, which is AIM Listed on the London Stock Exchange. \nTWC3N is entirely owned by Carlos Neves, CEO, who has 26.5% voting rights, Charles Rendell, chief financial officer of the Company, who has 26.5% voting rights, Nigel Jakeman, engineering and business development director, who also has 26.5% voting rights and Adderstone Group Limited, which has 20.5% voting rights \nThe new owners are confident that TPS will continue to focus on offering its clients world class products, accelerate through its exciting research and development pipeline and ultimately add significant value to the business. \nAnd one of the first things they are doing is seeking shareholder approval for cancellation of its AIM listing. \nWhilst Adderstone Group is known primarily as one of the largest property development businesses in the region, it has a long and successful track record at founding and growing a range of investments. \nIan Baggett, CEO and Founder of Adderstone Group said: “We have been blown away by the exceptional technology being developed by TPS on the Team Valley. We are confident we can add value in a number of respects and that there are many synergies to exploit between our businesses. \nThe entire team at Adderstone Group is looking forward to supporting its new partners at every opportunity.” \nTPS CEO and Executive Director, Carlos Neves said: “This management buyout is the culmination of many years of hard work from the entire TPS team and a long process of strategic review. \n“The team brought TPS to a sustainable position and now the focus must be on growing the business. Adderstone Group has a strong track record and will help us grow TPS organically and through key strategic investments. I believe we have the perfect partner to help us deliver our strategic plan.” The TPS team during the buyout announcement Share", "external_links": [], "published": "2017-03-31T15:10:00.000+03:00", "crawled": "2017-03-31T13:07:04.926+03:00", "highlightTitle": ""}