{"organizations": [], "uuid": "a87af4141e72d8a57003709e636a60429f74c2fa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30237035/15931508.jpg", "site_section": "http://www.middevongazette.co.uk/all-content.rss", "section_title": "Devon Live All Content Feed", "url": "http://www.devonlive.com/jo-pavey-thrilled-to-finally-be-awarded-bittersweet-world-championship-bronze-from-2007/story-30237035-detail/story.html", "country": "GB", "title": "David_Byrom published Jo Pavey thrilled to finally be awarded bittersweet World...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "David_Byrom published Jo Pavey thrilled to finally be awarded bittersweet World...", "spam_score": 0.0, "site_type": "news", "published": "2017-03-30T00:02:00.000+03:00", "replies_count": 0, "uuid": "a87af4141e72d8a57003709e636a60429f74c2fa"}, "author": "David_Byrom", "url": "http://www.devonlive.com/jo-pavey-thrilled-to-finally-be-awarded-bittersweet-world-championship-bronze-from-2007/story-30237035-detail/story.html", "ord_in_thread": 0, "title": "David_Byrom published Jo Pavey thrilled to finally be awarded bittersweet World...", "locations": [], "entities": {"persons": [{"name": "david_byr", "sentiment": "none"}, {"name": "jo pavey", "sentiment": "none"}, {"name": "pavey", "sentiment": "none"}, {"name": "david wheeler", "sentiment": "none"}, {"name": "elvan abeylegesse", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "getty jo pavey", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}], "locations": [{"name": "exeter", "sentiment": "none"}, {"name": "yeovil town", "sentiment": "none"}, {"name": "turkey", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "exeter city", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}], "organizations": [{"name": "commonwealth", "sentiment": "none"}, {"name": "mansfield", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jo Pavey thrilled to finally be awarded bittersweet World Championship bronze from 2007 By David_Byrom | Posted: March 29, 2017 0 COMMENTS SHARES Getty Jo Pavey admitted she felt she had let people down by finishing fourth in the 2007 World Championships Jo Pavey thrilled to finally be awarded bittersweet World Championship bronze... X \nCopy link to paste in your message / Pictures: Getty Jo Pavey admitted she felt she had let people down by finishing fourth in the 2007 World Championships Comments (0) \nJo Pavey admits it is a bittersweet feeling to have finally been awarded the bronze medal for the 10,000m in the 2007 World Championships. \nThe Exeter athlete has been given the award after Turkey's Elvan Abeylegesse, who finished second in the original race, was found guilty of an in-competition offence during the championships in Japan. \nPavey says she is thrilled to have been given the medal – her first global accolade after previously winning medals at Commonwealth and European level – but feels she was robbed of the proper opportunity to celebrate the achievement. \nShe said: \"I'm thrilled but it's bittersweet at the same time as I didn't get the chance to go onto the podium. I thought it was one of the best shapes I've got into during my career and I lined up and gave it my absolute all – I was so close to getting a medal on the day, finishing fourth, I wasn't trailing back in fourth, I only missed out on the line as I was in third but couldn't hold on. \n\"When I crossed the line I just felt massive disappointment as you feel you've let people down who've been supporting you and your friends and family. I just couldn't have given any more and ended up lying on the track after I've finished just feeling so disappointed that it had been such a massive opportunity and I just couldn't quite do enough. \n\"So I felt so much disappointment whereas now I know I should have had the moment where I'd have felt thrilled with the result having achieved a World medal – I'll never get that back, so it's bittersweet. \n\"I'm thrilled to eventually receive the medal but I missed the moment that should have been a nice moment rather than a frustrating one.\" \nPavey does not know when she will receive the medal and says the negative experience of how she is being awarded it will not dampen her enthusiasm for athletics. \nRead more: David Wheeler column: Exeter City winger on Yeovil Town comeback, Mansfield game and Brexit day \n\"I've heard that I might be presented it at a meeting in the UK at some point, which would be really nice and a lovely honour to receive it on home soil,\" she said. \"It's all a bit sudden really because I've been waiting to hear if it was officially that I'd be getting the bronze medal and it's been a long time sorting out but I'm very grateful that it has been sorted out. \n\"It makes you thrilled but also frustrated as you start to wonder how many other medals you might have missed out on in your career because you have your suspicions but you don't have any proof. \n\"So it's frustrating, all the hard work you put in day in, day out and your career gets spoiled to a certain extent by people cheating in the sport and you can never get those moments back. \n\"Obviously I don't want to be very negative about this all the time as I'll never forget all the lovely memories I had in my career and all the wonderful people I've met. \n\"Hopefully there'll be a brighter future for all the youngsters coming into the sport because it is a lovely sport and you don't want to be talking about it in a negative way.\" \nThe 43-year-old, who competed in her fifth Olympics last summer, says that the best way for clean athletes to overcome drugs cheats is by just working as hard as they can. \nRead more: Devon football team make history by scoring one of the quickest ever goals \nShe explained: \"Obviously it's been 10 years since that race nearly, so it's been a very long time where I could have felt pleased that I've got a World medal but that time has passed. \n\"I think, as a clean athlete, I was at a stage in my career where I was more in my prime, you're enjoying it but, at the same time, you keep having the frustrations where there are certain championship races where you're just out of the medals. \n\"You have that frustration and you go back to the drawing board to improve training and work really hard and you start wondering what you can do to improve, but then you realise that you're getting a lot of things right but, when people are taking banned substances, it makes it harder to achieve performances. \n\"You've always got to feel you can beat the cheats by just training really hard and believing in yourself, but, at the end of the day, it does make it so much more difficult. \n\"When you're stood on the start line, you have to put all those thoughts behind you and just give it your all, whatever the circumstances.\"", "external_links": [], "published": "2017-03-30T00:02:00.000+03:00", "crawled": "2017-03-29T19:21:44.810+03:00", "highlightTitle": ""}