{"organizations": [], "uuid": "458f042d28b4dff71b536b3708f2e7cd6ce024f7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12715245.ece/ALTERNATES/s1200/RBP_MAI_280715lewis11JPG.jpg", "site_section": "", "section_title": "", "url": "http://www.chroniclelive.co.uk/business/business-news/john-lewis-cuts-staff-bonus-12715214", "country": "IE", "domain_rank": 21960, "title": "John Lewis cuts staff bonus to 6% - lowest level in more than 60 years - Chronicle Live", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 0, "title_full": "John Lewis cuts staff bonus to 6% - lowest level in more than 60 years - Chronicle Live", "spam_score": 0.759, "site_type": "news", "published": "2017-03-09T17:38:00.000+02:00", "replies_count": 0, "uuid": "458f042d28b4dff71b536b3708f2e7cd6ce024f7"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/john-lewis-cuts-staff-bonus-12715214", "ord_in_thread": 0, "title": "John Lewis cuts staff bonus to 6% - lowest level in more than 60 years - Chronicle Live", "locations": [], "entities": {"persons": [{"name": "john lewis", "sentiment": "negative"}, {"name": "charlie", "sentiment": "none"}, {"name": "john lewis partnership", "sentiment": "none"}, {"name": "charlie mayfield", "sentiment": "none"}], "locations": [{"name": "cardiff", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}], "organizations": [{"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "John Lewis store, Cardiff (Photo: Western Mail) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nJohn Lewis and Waitrose staff will see bonuses cut to 6% of their annual salary - its lowest level for more than 50 years - after the firm warned of an “increasingly uncertain market”. \nThe cut, the fourth in a row, will see the retailer’s staff share a £89.4m bonus pot, down from £145m last year. \nThe figure compares to 10% of salary last year, 11% in 2015, 15% in 2014 and 17% in 2013. It is thought to be the lowest level since the 1950s. \nChairman Sir Charlie Mayfield said: “In January, we said Partnership Bonus was likely to be significantly lower this year. \n“The board has awarded a bonus of 6%, which is equivalent to more than three weeks’ pay. \n“Bonus is lower because the board has decided to retain more of our annual profits in order to strengthen our balance sheet. \n“This allows us to maintain our level of investment in the face of what we expect to be an increasingly uncertain market this year, while absorbing the costs associated with adapting the partnership for the future.” \nThe group warned in January the bonus would be “significantly lower” than last year in the face of a challenging market outlook, partly linked to the collapse in the value of the pound since the Brexit vote. \nJohn Lewis Partnership , which is owned by the employees of the two retail chains, reported pre-tax profits before exceptional items of £370.4m for the 52 weeks to the end of January 28, a 21.2% increase on last year. Read More Budget 2017: What have we learned from the Chancellor's big statement? \nThe group said the bonus applied to 86,700 staff. \nThe company once again flagged that the impact of the collapse in the pound will hurt it in the year ahead, while also pointing to competition in the retail sector. \n“In the year ahead, trading pressures will continue as a result of the wider changes taking place in retail. \n“The two major influences are pricing, where the rate of change in selling prices is likely to be significantly slower than the rate of change in input costs as a result of weakness in the sterling exchange rate, and the continued shift from shops to online. \n“These factors are significant for the outlook where we expect both inflationary cost pressures and competition to intensify in the market as a whole.” \nJohn Lewis said in January it would axe nearly 400 jobs across its restaurants and home fittings service as it grapples with the acute pressures facing the retail sector. Read More Sevcon on the move to new Gateshead premises as expansion plans step up a gear \nSir Charlie warned on Thursday the firm is “seeking significant cost reductions”, especially in contract labour and consultancy support. \nHe also said the partnership began limited trials of “robotic process automation” last year and expects to see these develop into a “significant productivity initiative during 2017”. \nLike-for-like sales at John Lewis rose 2.7% over the year, while they dipped 0.2% at Waitrose. \nGross sales across the group rose 3.2% to £11.4bn. \nOperating profit before the bonus and exceptional items rose 9% to £253.5m at Waitrose, while it dipped 2.8% to £243.2m at John Lewis. \nThe company added the average hourly rate of pay for its non-management staff will rise beyond the current £8.67 following an April pay review. Like us on Facebook ", "external_links": [], "published": "2017-03-09T17:38:00.000+02:00", "crawled": "2017-03-09T13:25:34.287+02:00", "highlightTitle": ""}