{"organizations": [], "uuid": "643a6ef9ff520462ef70ab4eafd9bcb8492ee554", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12813522.ece/ALTERNATES/s1200/Brexit.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/theresa-urges-nation-stop-arguing-12816499", "country": "GB", "domain_rank": 21960, "title": "Theresa May urges nation to stop arguing and unite behind Brexit as she triggers Article 50", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Theresa May urges nation to stop arguing and unite behind Brexit as she triggers Article 50", "spam_score": 0.0, "site_type": "news", "published": "2017-03-30T00:05:00.000+03:00", "replies_count": 0, "uuid": "643a6ef9ff520462ef70ab4eafd9bcb8492ee554"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/theresa-urges-nation-stop-arguing-12816499", "ord_in_thread": 0, "title": "Theresa May urges nation to stop arguing and unite behind Brexit as she triggers Article 50", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "negative"}, {"name": "theresa may", "sentiment": "negative"}, {"name": "mrs may", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "chi onwurah", "sentiment": "none"}, {"name": "tyne north", "sentiment": "none"}, {"name": "tusk", "sentiment": "none"}, {"name": "tim barrow", "sentiment": "none"}, {"name": "donald tusk", "sentiment": "none"}, {"name": "catherine mckinnell", "sentiment": "none"}, {"name": "tim farron", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}], "organizations": [{"name": "european council", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "chi onwurah  labour", "sentiment": "none"}, {"name": "european court of justice", "sentiment": "none"}, {"name": "newcastle central", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "european commission", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Theresa May urges nation to stop arguing and unite behind Brexit as she triggers Article 50 History is made as the European Union receives the letter signed by Prime Minister Theresa May saying the UK wants to leave Share Click to play Tap to play The video will start in 8 Cancel Play now IN FULL: Theresa May's statement as she triggers Article 50 Share this video Get daily   Thank you for subscribing! Could   \nPrime Minister Theresa May urged the nation to put aside disagreements about Brexit and unite, as she formally triggered the process of withdrawal from the European Union. \nIn a letter to European Council president Donald Tusk triggering Article 50, Mrs May said the UK wanted a “deep and special partnership” with the future EU of 27, but restated her determination that the UK should regain control of its borders, leave the single market and escape the jurisdiction of the European Court of Justice. \nBut she was accused of threatening the EU with a withdrawal of security collaboration, after the letter warned failure to reach agreement on trade would mean “our co-operation in the fight against crime and terrorism would be weakened”. Prime Minister Theresa May in the cabinet signing the Article 50 letter (Photo: PA) \nNewcastle upon Tyne North MP Catherine McKinnell raised concerns about the apparent threat in the House of Commons, asking Mrs May: “The Prime minister’s letter to President Tusk states, ‘In security terms a failure to reach agreement would mean our cooperation in the fight against crime and terrorism would be weakened.’ \n“Given this, is she still threatening to walk away with no deal if she doesn’t get the economic deal she wants?” \nMrs May told her in reply that her goal was to obtain a deal. \nLiberal Democrat leader Tim Farron described the warning as “utterly scandalous”, adding: “This letter is a blatant threat, security co-operation has been lumped together with trade.” European Council President Donald Tusk (Photo: AP Photo/Virginia Mayo) \nThe six-page letter, signed in ink by the Prime Minister, was hand-delivered to Mr Tusk in his Brussels office by UK permanent representative Sir Tim Barrow at around 12.20pm just minutes before Mrs May made a statement to MPs on her plans. \nThe European Council president was the first officially to announce its receipt, posting a photograph on Twitter while Mrs May completed her weekly session of Prime Minister’s Questions in Westminster. \nMrs May told MPs the Government was acting on the democratic will of the British people with the “clear and convincing” support of Parliament by taking Britain out of the EU in what was one of “the great turning points in our national story”. \nThe Prime Minister issued a plea for unity following last year’s divisive referendum, saying: “I want this United Kingdom to emerge from this period of change stronger, fairer, more united and more outward-looking than ever before.” Tim Barrow, the UK Permanent Representative to the EU (Photo: AP Photo/Thierry Monasse) \nSetting out Britain’s negotiating position in her letter, she made clear she wants a new trade deal to be negotiated at the same time as the “divorce deal” extricating the UK from its 44-year membership. \nAmid expectations the European Commission plans to present the UK with a £50 billion “divorce bill”, Mrs May said she was ready to discuss a “fair settlement” of Britain’s rights and obligations as a departing member, but gave no hint of the amounts she is prepared to contemplate. \nShe accepted the UK’s rejection of the EU principle of free movement of people meant it could not “cherry pick” the benefits of the single market. \nAnd she said she was ready to agree an implementation period following the formal date of Brexit in 2019, to allow changes to business arrangements to be phased in gradually, avoiding a “cliff edge”. Chi Onwurah \nLabour MP Chi Onwurah, who represents Newcastle Central said: “The PM’s attempt to be a stateswomen undermined by the entire absence of passion, principles, proposals or plan.” \nA sombre-faced Mr Tusk held up the letter at a Brussels press conference as he sent a farewell message to the UK: “We already miss you. Thank you and goodbye.” Read More The Great North East Survey - your chance to tell us what life is like in the region \nThe European Council president confirmed he would set out his draft negotiating guidelines on Friday, ahead of an extraordinary summit of the remaining 27 leaders on April 29 which is expected to pave the way for talks to begin in earnest in May. \nLabour leader Jeremy Corbyn said Mrs May’s Brexit plans were “both reckless and damaging” as he warned his party “will not give this Government a free hand to use Brexit to attack rights, protections and cut services.” Like us on Facebook", "external_links": [], "published": "2017-03-30T00:05:00.000+03:00", "crawled": "2017-03-29T19:27:53.554+03:00", "highlightTitle": ""}