{"organizations": [], "uuid": "2c31ac4894e0597d9f8115f02e5f127eeb89756c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12691783.ece/ALTERNATES/s1200/Jeremy-Corbyn-Leaves-His-London-Home.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/news-opinion/how-long-can-jeremy-corbyn-12691765", "country": "GB", "domain_rank": 21960, "title": "How long can Jeremy Corbyn survive as Labour leader and what will his legacy be?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "How long can Jeremy Corbyn survive as Labour leader and what will his legacy be?", "spam_score": 0.0, "site_type": "news", "published": "2017-03-04T23:00:00.000+02:00", "replies_count": 0, "uuid": "2c31ac4894e0597d9f8115f02e5f127eeb89756c"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/news-opinion/how-long-can-jeremy-corbyn-12691765", "ord_in_thread": 0, "title": "How long can Jeremy Corbyn survive as Labour leader and what will his legacy be?", "locations": [], "entities": {"persons": [{"name": "jeremy corbyn", "sentiment": "neutral"}, {"name": "philip hammond", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "george osborne", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "tory", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "getty images europe", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Opinion How long can Jeremy Corbyn survive as Labour leader and what will his legacy be? The beleaguered Labour leader Jeremy Corbyn has done much to shift the party back to its roots Share Click to play Tap to play The video will start in 8 Cancel Play now Corbyn grills May on Brexit Share this video Get   \nAs Jeremy Corbyn’s leadership of the Labour party comes under increasing fire after a series of poor election results, his future in the top job looks increasingly in doubt. \nBut if he were to go we shouldn’t let the aspirations of the people for a fairer and more just society that propelled him to the post in the first place to be forgotten. \nI can’t think of a policy he stands for I don’t agree with and I’m not alone. \nYet I’m not sure what Theresa May actually stands for. I know what she does - pander to the extreme right and people’s prejudices - to stay in power. But as for what her beliefs are, I haven’t got a clue. \nShe pledged to fight injustice and make Britain ‘a country that works for everyone’ on becoming PM but all that’s happened since don’t bear out her words. \nWith the worsening NHS and social care crisis, poverty levels spiralling, homelessness on the increase and the amount of people on zero hour contracts about to hit one million, inequality in the UK has reached unprecedented levels. \nThis was the situation when Corbyn was chosen a leader as well as why because people saw him as someone who genuinely wanted to do something about this inequality. \nHere’s the thing, no matter what you read, it was no hard left coup that got Corbyn the job. His detractors made out his leadership was the devil’s spawn of various Marxist/Trotskyite/Leninist groups. Labour Party leader Jeremy Corbyn (Photo: Getty Images Europe) \nYet with him as leader Labour party membership currently stands at a record 600,000 and the members are of all ages, all ethnic groups and both sexes. \nThey don’t want class war, they want to oppose the existing class war which discriminates so much between the wealthy and the rest of us. \nThey want a government that wants to govern and not sell off its responsibilities to the lowest bidder, usually venture capitalists to make a quick profit, or pass on any losses to the taxpayer. \nThat’s why Corbyn became leader because fighting inequality is what he has stood for all his political life. Read More Texts to Newcastle leader revealed secret deal between Government and wealthy Tory council \nAn alternative to the so-called ‘hard choices’ which George Osborne made with apparent lip smacking relish which saw benefits cut and council budgets slashed and show no sign of abating under his successor, Philip Hammond. \nCorbyn has struggled because he could never quite convince the public he could make a Prime Minister. While a poisonously biased press has contributed to this perception, Corbyn often gave the impression he could never quite convince himself he actually wanted the job. \nWhatever happens now, what he has done is shift Labour towards its roots as a party supporting radical and fairer policies and maybe, in years to come, those who criticise him might just come to appreciate the positive impact he has had. Like us on Facebook", "external_links": [], "published": "2017-03-04T23:00:00.000+02:00", "crawled": "2017-03-04T18:33:37.166+02:00", "highlightTitle": ""}