{"organizations": [], "uuid": "846e717a34521c7ad201bafeba1692b5ab834348", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12815723.ece/ALTERNATES/s1200/March-for-Europe.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/tim-farron-north-east-hit-12815742", "country": "GB", "domain_rank": 21960, "title": "Tim Farron: The North East will be hit hardest by Brexit - so you must have the final say", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Tim Farron: The North East will be hit hardest by Brexit - so you must have the final say", "spam_score": 0.0, "site_type": "news", "published": "2017-03-30T01:00:00.000+03:00", "replies_count": 0, "uuid": "846e717a34521c7ad201bafeba1692b5ab834348"}, "author": "chroniclelive.co.uk", "url": "http://www.chroniclelive.co.uk/news/north-east-news/tim-farron-north-east-hit-12815742", "ord_in_thread": 0, "title": "Tim Farron: The North East will be hit hardest by Brexit - so you must have the final say", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Liberal Democrats leader Tim Farron (Photo: PA) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nToday Theresa May will fire the starting gun on the Brexit talks , marking the beginning one of the most perilous and complex negotiations in British political history. \nOur economy, future opportunities for our children and grandchildren and Britain’s place in the world all hang in the balance. \nThis Conservative government has decided to go for the hardest and most divisive form of Brexit. Instead of standing up for British businesses, \nTheresa May has waved the white flag and given up on our membership of the Single Market before she has even started to negotiate. This is a decision that could have huge repercussions for people in the North East. \nOur role now is to hold this Government to account and fight to ensure people here are not forgotten about in the rush towards a hard Brexit. \nResearch has consistently found that the North East will be one of regions with the most to lose from a hard Brexit. Every year £7bn goods from the North East are sold into the EU Single Market, more than three times what the region sells to the US and China combined. \nNewcastle and Sunderland are amongst the cities in the UK most reliant on trade with Europe. Despite what the Brexiteers may say, new trade deals struck with faraway countries won’t replace the world’s biggest market sitting on our doorstep. \nBusinesses here, from the car industry to renewable energy, thrive from being able to trade easily with the continent. This Government’s reckless decision to leave the Single Market is putting jobs, investment and people’s futures at risk. \nMeanwhile Jeremy Corbyn’s Labour has waved the white flag, failing as an opposition and giving Theresa May a blank cheque to pursue her divisive Brexit plans. \nLocal hospitals are also losing out because this Government is failing to give EU nationals working in our NHS the reassurance they need. Over 1,200 nurses, doctors and other NHS staff working in hospitals across the North East come from other EU countries . \nMany of these hard-working staff are leaving because they are worried about their futures in Britain. And against a backdrop of a huge shortage of nurses, the Royal College of Nursing has published figures showing the number of nurses coming to work here from the EU is plummeting. \nOn top of this, the future of NHS funding is at risk from the £100 billion black hole Brexit is set to blow in the nation’s finances. At a time when our health service is already struggling, this Government is making matters even worse through its reckless decision to leave the Single Market and refuse to guarantee the right of EU nationals here to stay. Read More Brexit should mean we re-open our coal mines says ex miners' leader Arthur Scargill \nThe response from the Tory Brexiteers is clear. They accuse anyone who dares question their headlong, blindfold charge towards hard Brexit of trying to thwart the will of the people. \nBut the Single Market or the right of EU nationals who live here to stay was never on the ballot paper on the June 23. \nIt was Theresa May’s choice to opt for the most extreme form of Brexit, taking us out of the Single Market before she has even tried to negotiate. The Brexiteers are terrified of giving people a say because they don’t want to be answerable for the lies and myths they told during the referendum campaign. Read More What is Brexit, have we left the EU yet and other questions answered \nIf and when things start to go pear shaped, they don’t want to be held to account. But the good news is, it’s not too late to stop a hard Brexit that would inflict huge damage on the north East. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now", "external_links": [], "published": "2017-03-30T01:00:00.000+03:00", "crawled": "2017-03-29T21:37:55.446+03:00", "highlightTitle": ""}