{"organizations": [], "uuid": "06459eb41f4ed787264599498318bb7e999102f7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article10586852.ece/ALTERNATES/s1200/JS77966375.jpg", "site_section": "http://www.thejournal.co.uk/business/?service=rss", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/no-deal-europe-would-disaster-12794967", "country": "GB", "domain_rank": 21960, "title": "'No deal' on Europe would be disaster for North East manufacturing, industry group says", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "'No deal' on Europe would be disaster for North East manufacturing, industry group says", "spam_score": 0.0, "site_type": "news", "published": "2017-03-27T07:01:00.000+03:00", "replies_count": 0, "uuid": "06459eb41f4ed787264599498318bb7e999102f7"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/no-deal-europe-would-disaster-12794967", "ord_in_thread": 0, "title": "'No deal' on Europe would be disaster for North East manufacturing, industry group says", "locations": [], "entities": {"persons": [{"name": "mrs may", "sentiment": "none"}, {"name": "owen humphreys/pa wire", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "liz mayes  liz mayes", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "society of motor manufacturers and traders", "sentiment": "none"}, {"name": "wto", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "eef", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business 'No deal' on Europe would be disaster for North East manufacturing, industry group says EEF has warned Ministers to tone down their rhetoric on Europe and concentrate instead on getting a good deal Share Workers at Nissan's plant in Sunderland on the production line for the Infiniti Q30 (Photo: Owen Humphreys/PA Wire)   \nPrime Minister Theresa May has been urged to tone down her rhetoric on Brexit or risk massive damage to the North East’s manufacturing industry. \nEEF, which represents the manufacturing sector, has described Mrs May’s stance that ‘no deal is better than a bad deal’ as “simply unacceptable to an industry that accounts for 45% of all UK exports”. \nThe call from EEF to concentrate on negotiating a good deal for the industry adds to pressure on Ministers to secure agreement on access to the European market for a number of key North East employers. \nThis weekend the trade union Unite and the Society of Motor Manufacturers and Traders joined forces to warn that failure to secure a trade deal for the automotive industry - one of the largest North East employers and a key growth sector for the region - would be catastrophic. \nAnd senior figures from Nissan , which employs 7,000 people at its Sunderland plant with thousands more in the regional supply chain, have also warned that adding tariffs to cars produced in the UK could affect future decisions on where the company produces its new models. Liz Mayes \nLiz Mayes, North East Region Director at EEF, said: “The EU is our sector’s single biggest trading partner in a complex, tightly interwoven trading environment. Undermining the building blocks of this relationship – the single market and the customs union – without any other supportive structure in place would undoubtedly hurt our industry and condemn us to a painful and costly Brexit. \n“The idea of being able to walk away empty-handed might be a negotiating tactic, but it would in reality deliver a risky and expensive blow. The rhetoric from the UK Government needs to focus instead on achieving a deal that will work for the UK and the EU. \n“Close consultation between Government and industry is now vital if we are to successfully deliver a deal that supports trade and minimises costs and uncertainty. Brexit will be the most complex unravelling that any UK Government is ever likely to have to undertake and Government will need the help of industry to identify, understand and mitigate the implications. \n“It is going to be tough, but we must focus on developing a strategic approach that aims to preserve frictionless trade while building a launch-pad from which the UK can secure ever more ambitious deals from around the world. \n“Obtaining fully-fledged WTO membership is key, alongside a clear and well-considered UK position on customs arrangements and a sensible transition period. Together these would provide businesses with some much-needed certainty on which to base their own plans.” \nThe EEF warning has come just a few days before Mrs May triggers Article 50 to start the process of the UK leaving the EU. \nThere has been increasing disquiet around her earlier suggestion that she would rather walk away from the negotiations with Europe than accept a poor deal. \nThose words have been widely interpreted as an early negotiating stance, but EEF says that UK’s manufacturing sector would bear much of the brunt of the loss of trade if the UK could not secure a deal to trade its goods in Europe. \nThe ‘no deal’ option worries manufacturers because of the higher tariffs likely to be placed on their goods, but also because of the complex supply chains which often sees products moving in and out of Europe and the UK before finally coming to market. \nThe UK is currently the ninth largest industrial nation in the world, but EEF said that strength is “underpinned by its trading relationship with the EU”. Like us on Facebook", "external_links": [], "published": "2017-03-27T07:01:00.000+03:00", "crawled": "2017-03-27T03:11:47.028+03:00", "highlightTitle": ""}