{"organizations": [], "uuid": "c460b20d3047468ac9c42ae2ded7fe43bf6da65f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30177568/15887258.jpg", "site_section": "http://www.westernmorningnews.co.uk/farming.rss", "section_title": "Devon Live Farming RSS feed", "url": "http://www.devonlive.com/stephens-scown-ask-how-bright-is-the-future-for-solar-power/story-30177568-detail/story.html", "country": "GB", "title": "Stephens Scown ask: How bright is the future for solar power?", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "Stephens Scown ask: How bright is the future for solar power?", "spam_score": 0.0, "site_type": "news", "published": "2017-03-03T21:49:00.000+02:00", "replies_count": 0, "uuid": "c460b20d3047468ac9c42ae2ded7fe43bf6da65f"}, "author": "AthwennaIrons", "url": "http://www.devonlive.com/stephens-scown-ask-how-bright-is-the-future-for-solar-power/story-30177568-detail/story.html", "ord_in_thread": 0, "title": "Stephens Scown ask: How bright is the future for solar power?", "locations": [], "entities": {"persons": [{"name": "stephens scown", "sentiment": "none"}, {"name": "sonya bedford", "sentiment": "none"}, {"name": "francis clark", "sentiment": "none"}, {"name": "sonya", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "wheal jane", "sentiment": "none"}], "locations": [{"name": "o&m", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "cornwall", "sentiment": "none"}], "organizations": [{"name": "stephens scown llp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Comments (0) \nThe renewable energy industry has had its fair share of ups and downs over the last ten years, writes Sonya Bedford, partner and head of renewable energy at Stephens Scown LLP. \nFarmers have borne the brunt of the influx and decrease of solar installations with constant calls on land and roofs for leased and owned installations. \nThere is now 10 GW of solar installed across the UK and much of that is on farms and rural properties. With the cuts to solar subsidies and the potential VAT rate rises many are wondering if it is still worth investing in solar PV. The answer to this is yes, but solar needs to be viewed as an investment for the right reasons. \nLet's look at payback – the length of time it will take to recover the cost of the installation. In the height of solar subsidy, payback could be in as little as five years, while in the current market a system might pay back within 12 years. However, that still leaves eight years of return and savings. \nSolar PV is likely to reach grid parity (the point at which the cost of solar PV matches the cost of other generation, including fossil fuel) in the next five years. It would have reached it sooner had subsidy not been cut, however the costs of modules are still coming down which makes the economics look solid. \nSo this issue now, is now about maximising your investment in solar PV. \nMaximise your investment \nNow is the time to maximise existing assets and make more of the returns that can be gained from a solar investment. Based on the experience we have gained working with hundreds of farmers, land owners and developers, we have co-written a solar white paper, which outlines how this can be achieved and how to deal with the technical aspects of a solar park. \nSome of the main lessons to be learnt are: \nEnsuring that the site was built as contracted that the \"EPC\" (the contractor and the contract that governs the construction and performance of the solar park) did its job and the site is available for generation and generating as much as it is contracted to; \nThe need to drive down initial capital cost and to develop a financial model that provides an optimised return on investment results in future operation and maintenance costs being pared back so far that they become unrealistic; \nThe cost of complying with planning, environmental, landscaping and operational factors also need to be considered. Often planning conditions are not thought about and can contain expensive outputs –such as tree planting or wildflower meadow planting. Are these measures in place? How is the site recovering and is the ground under the site being maximised to its full potential? \nAgreeing in advance the full range of electrical and non-electrical tests that will be carried out to ensure that all types of assets have been installed correctly and then properly commissioned is essential. Appropriate tests and a record of and report on test values obtained are required for third parties to evidence that design and installation have been successful. \nOFGEM will carry out audits to investigate generating stations with existing full accreditation under the scheme. These audits are comprehensive and investigate all aspects of the solar park compliance with the underlying requirements of the FIT scheme including the specifics of commissioning; the 'site' of the generating station; the metering arrangements and the information provided in support of the accreditation application. The requirement to provide this information reinforces the need to ensure that detailed records, testing and commissioning data is managed proactively; \nThe operation and maintenance (O&M) contract will require the contractor to provide a monthly performance report including a report on unplanned incidents and progress against the scheduled programme of maintenance work. Maintaining a close working relationship with the O&M contractor and the field staff is important so that the site is well-maintained and incipient matters caught early. Overall site performance can deteriorate if not closely monitored and any departure from the assumed and modelled output should be examined against actual performance and the response to this investigated jointly. \nRead more: PKF Francis Clark: Farmers urged to get Brexit plans in place \nThe future \nFrom the very first solar park to be granted planning permission in the UK, Wheal Jane in Cornwall, to our 300th solar park project this year, the renewables team at Stephens Scown has seen and been involved in pretty much every permutation and nuance involved in developing, financing, constructing and operating solar parks and roof top solar. We've seen good work and we've seen room for improvement! \nWe are proud to play a strong part in the transition of the UK to a future powered by renewable energy and to have contributed to the 10 GW of solar power now installed. In order for solar parks to continue to contribute to our renewable future and for more to be built it is important that they are managed and built efficiently. \nRead also: Falling pound gives income boost to farmers, figures reveal \nThe future is bright, provided that all the various aspects of a solar project line up including low cost equipment, potential use of battery storage, maximised installation and use of energy generated directly on site. \nTo contact Sonya or her team, please call 01392 210700 or email renewables@stephens-scown.co.uk. To download a copy of the solar white paper go to www.stephens-scown.co.uk", "external_links": [], "published": "2017-03-03T21:49:00.000+02:00", "crawled": "2017-03-03T21:41:47.641+02:00", "highlightTitle": ""}