{"organizations": [], "uuid": "99c4fe3f795eb6b8621d4e6e89df959bef7bf5f3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12709869.ece/ALTERNATES/s1200/Budget-2017.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-budget-wishlist-10-12709316", "country": "GB", "domain_rank": 21960, "title": "North East budget wishlist: the 10 things the Chancellor could do to help this region", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "North East budget wishlist: the 10 things the Chancellor could do to help this region", "spam_score": 0.0, "site_type": "news", "published": "2017-03-08T19:15:00.000+02:00", "replies_count": 0, "uuid": "99c4fe3f795eb6b8621d4e6e89df959bef7bf5f3"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-budget-wishlist-10-12709316", "ord_in_thread": 0, "title": "North East budget wishlist: the 10 things the Chancellor could do to help this region", "locations": [], "entities": {"persons": [{"name": "philip hammond", "sentiment": "negative"}, {"name": "david cameron", "sentiment": "none"}, {"name": "andrew percy", "sentiment": "none"}, {"name": "hammond", "sentiment": "none"}], "locations": [{"name": "wear metro", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "south east", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "leeds", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "newcastle airport", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "south", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}], "organizations": [{"name": "surrey county council", "sentiment": "none"}, {"name": "northern powerhouse", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "budget", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Chancellor Philip Hammond (Photo: PA) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nChancellor Philip Hammond will set out the Government’s spending priorities in today’s Budget - but what will it mean for the North East? \nThe Westminster gossip has it that Mr Hammond will be fairly cautious in today’s speech, essentially squirelling away an unexpected recent tax boost to help the country cope with economic problems that most commentators believe are just around the corner. \nSpending on infrastructure and schools has been widely trailed, as has changes to the tax system for people who are self-employed. \nBut what will the Budget have in store for the North East? \nHere is our wishlist of the 10 things the Chancellor could do for this region - just don’t get your hopes up. 1. Transport \nEarly indications are that while the Budget will feature few big giveaways, there will be announcements of spending on transport infrastructure . \nThe North East has received only a fraction of the money spent on London and the South East in recent years, and Northern Powerhouse Minister Andrew Percy said last month that this imbalance would have to be addressed soon. \nIt’s unlikely we’ll see a massive spending spree from the Chancellor, but upgrades and extensions to the Tyne and Wear Metro, full dualling of the A1 and the A69, plus better road and rail links to our ports and airports are all needed. A high speed rail link between Leeds and Manchester would also benefit the North East, if indirectly. 2. Skills and education \nMore money for schools has also been signalled in advance, but whether that will address the region’s skills shortage is a moot point. \nMore likely is that any new money will be to address the shortage of school places, more of a problem for the South than our region. \nIn a perfect world the Government would increase funding for North East schools to address some of the deep-seated problems this region has in the same way London schools were helped during the last Labour Government. 3. Air passenger duty \nAs the most northerly airport in England, Newcastle Airport could be uniquely at risk if, as expected, the Scottish Government reduces air passenger duty from its airports. \nIf it becomes less attractive to fly from Newcastle and airlines choose airports north of the border, there would be a knock-on effect on the North East economy. \nPrevious Prime Minister David Cameron promised that English airports would not be disadvantaged by devolution, but we now need some concrete measures to back up those words Read More Why North East could face more expensive holidays and possible job losses over little-known tax 4. Business rates \nThe much-discussed changes to business rates mostly help this region, with lower property prices translating into reduced rates. \nBut the very public backlash from Tory MPs, mostly in the south, has put pressure on the Chancellor to change tack. \nMost people agree that business rates need to be overhauled to reflect the growth of online businesses, but the danger is that the Chancellor will tinker with the existing system to ease pressure from the south and take away the benefits this region is set to receive. 5. Health and social care \nThe two topics that were bizarrely absent from the Chancellor’s Autumn Statement, but after a winter of stories about an NHS crisis, that is unlikely to be repeated. \nWith evidence growing that Ministers did a sweetheart deal with Surrey County Council to avoid an embarassing referendum about raising council tax, councils in the North East will be wanting to ensure that they get their fair share of any extra funding. 6. Help for the offshore industry \nThe slump in the global oil price has led to cheaper petrol prices, but it has been disastrous for many North East engineering companies, with hundreds of jobs lost. \nSupport for the industry that has been so important for the North East economy in recent years will be vital. Read More 7. Support for research and development \nThe North East has great universities and a growing number of cutting-edge technology companies. \nIncreased support for R&D, and ensuring the region gets its fair share of whatever grants are made available, is crucial. 8. Lay off small businesses \nStill the main driver of employment in this and most other regions, our number of small businesses has grown in recent years, partly as a result of people going it alone after losing their jobs elsewhere. \nIt has been widely trailed that the Chancellor is likely to close loopholes that mean many self-employed workers pay less tax than their salaried counterparts. This could be this year’s ‘pastie tax’, the measure that comes back to haunt the Chancellor through the law of unexpected consequences. 9. Brexit \nThe pre-Budget rumours have been that the Chancellor will essentially bank the money he has received from the unexpected recent upturn in the economy to ease the pain most economists believe is on the way. \nAs an exporting region, the North East arguably has much to lose from Brexit and the Chancellor needs to protect a region that still has the highest unemployment in the country. \nWe still don’t know what Ministers said to convince Nissan to build its next two models at Sunderland, but more of the same would be most welcome. 10. Cheaper beer", "external_links": [], "published": "2017-03-08T19:15:00.000+02:00", "crawled": "2017-03-08T14:53:06.627+02:00", "highlightTitle": ""}