{"organizations": [], "uuid": "64f8a4541f0c216feacd7b1ce482b2b11a64273d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article11764677.ece/ALTERNATES/s1200/JS62777845.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12772124", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Screwfix builds £787m profit for Kingfisher", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast LIVE: Screwfix builds £787m profit for Kingfisher", "spam_score": 0.0, "site_type": "news", "published": "2017-03-22T15:20:00.000+02:00", "replies_count": 0, "uuid": "64f8a4541f0c216feacd7b1ce482b2b11a64273d"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12772124", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Screwfix builds £787m profit for Kingfisher", "locations": [], "entities": {"persons": [{"name": "griffith", "sentiment": "negative"}, {"name": "ruth davidson", "sentiment": "none"}, {"name": "david acheson", "sentiment": "none"}, {"name": "holyrood", "sentiment": "none"}, {"name": "philip whitcomb", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "jeremy helsby", "sentiment": "none"}, {"name": "moore blatch", "sentiment": "none"}, {"name": "bonas griffith", "sentiment": "none"}, {"name": "jonathon manning", "sentiment": "none"}, {"name": "nicola sturgeon", "sentiment": "none"}, {"name": "adamson", "sentiment": "none"}, {"name": "graeme roy", "sentiment": "none"}, {"name": "john adamson", "sentiment": "none"}, {"name": "helsby", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "fraser", "sentiment": "none"}, {"name": "porter", "sentiment": "none"}, {"name": "dave watson", "sentiment": "none"}, {"name": "j. porter", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "hardwick hall", "sentiment": "none"}, {"name": "holyrood", "sentiment": "none"}, {"name": "portadown", "sentiment": "none"}, {"name": "dean street", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "botanical garden", "sentiment": "none"}, {"name": "newcastle quayside", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north sea", "sentiment": "none"}, {"name": "asia pacific", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "milburn house", "sentiment": "none"}], "organizations": [{"name": "kingfisher jonathon manning sunderland", "sentiment": "negative"}, {"name": "ulster carpets  sunderland", "sentiment": "neutral"}, {"name": "savills", "sentiment": "none"}, {"name": "griffith textile machines", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "ulster", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "gtm", "sentiment": "none"}, {"name": "strathclyde university", "sentiment": "none"}, {"name": "labour and liberal democrat", "sentiment": "none"}, {"name": "ms sturgeon", "sentiment": "none"}, {"name": "jonathon manning farmers", "sentiment": "none"}, {"name": "ulster carpets", "sentiment": "none"}, {"name": "jonathon manning estate", "sentiment": "none"}, {"name": "farmers", "sentiment": "none"}, {"name": "allander institute", "sentiment": "none"}, {"name": "snp", "sentiment": "none"}, {"name": "newcastle brown ale", "sentiment": "none"}, {"name": "canteen & cocktails", "sentiment": "none"}, {"name": "ulster group", "sentiment": "none"}, {"name": "ramside estate group", "sentiment": "none"}, {"name": "university of strathclydes fraser of allander institute", "sentiment": "none"}, {"name": "rhum bar", "sentiment": "none"}, {"name": "milburn house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning Sunderland manufacturing company bought buy Ulster Carpets \nSunderland’s Griffith Textile Machines (GTM), a major manufacturer of textile machinery, has been acquired by Ulster Carpets. \nGTM, formerly known as Bonas Griffith, the Washington-based firm’s acquisition is designed to help Ulster Carpets improvement its carpet weaving technology. \nThis acquisition begins the second phase of the £35m regeneration of all Woven manufacturing facilities at Ulster’s Portadown site. \nPhase one was the recent completion of a £8m dye house and energy centre increasing manufacturing efficiency as well as bringing a number of major environmental benefits. Ulster Carpets said the regeneration project will ensure that manufacturing remains in Portadown long term, securing employment for the local area. \nDavid Acheson, Ulster’s head of strategic operations said: \nUlster’s ethos and future plans very much revolve around quality, design excellence and technical innovation, and Griffith Textile Machines fits this perfectly. \nWe are delighted to have secured this purchase and are excited about the future prospects as the two businesses combine their skills. \nDave Watson, GTM’s Managing Director added: \nWith our shared strategic objectives and being such a clear fit, joining the Ulster Group was an obvious next step for both parties. We are thrilled with the rare opportunity to focus on developing innovative solutions based on our joint peerless technology. \nJoining the Ulster Group is the culmination of a twenty five year business relationship and will encourage GTM to achieve its maximum potential to the benefit the group. \nThe acquisition is being funded from Ulster’s cash reserves. A woman holding £20 pound notes (Photo: Getty Images/iStockphoto) 9:08 Jonathon Manning Roaring Twenties speakeasy bar set for Newcastle Quayside opening within weeks \nA roaring Twenties-style speakeasy bar with prosecco flowing from teapots, secret rum classes and monthly talks delivered by politicians is weeks away from opening in Newcastle city centre. \nColonel Porter’s – full name Colonel Porter’s Tavern, Botanical Garden and Rhum Bar - will have a staff of 20 when it opens next months in Milburn House, Dean Street. \nTaking its name from Colonel J. Porter, the creator of Newcastle Brown Ale who originally came up with the brew in 1925, the venture is the brainchild of John Adamson, managing director of Durham-based Ramside Estate Group, which includes the prestigious Hardwick Hall and Ramside Hall hotels. \nMr Adamson is investing a significant sum into converting the bar, which was the Canteen and Cocktails bar until recently and One Oak restaurant before that. \nHe said: \nIt’s going to be a happening and cool 1920s-style bar serving up something that’s a little bit different. \nWe’re going to serve cask ales, cocktails and really good food in the shape of sharing platters, and I’m planning a few extras too. \nOn Fridays, Saturdays and Sundays we’ll have Tipsy Tea, where we’ll be offering afternoon tea and prosecco served out of teapots and gin and rum infused tea. \nWe’ll have mixologist classes, a rum bar and regular events like comedy nights and masquerade balls. \nI’m also planning on hosting monthly guest speakers, welcoming in politicians past and present, entrepreneurs and explorers who can deliver talks on their experiences. \nMr Adamson said his plans require a complete makeover for the interior of the bar, and a fit-out is now starting to take shape. Milburn House, Dean Street, which had housed Canteen & Cocktails, will now be turned into a 1920s-themed bar (Photo: Newcastle Chronicle) 9:02 Jonathon Manning Estate agent Savills sees profits rise to £100m despite Brexit hit to sales \nProfits at Savills edged up last year, despite the upmarket estate agent flagging a Brexit hit to UK sales at both its residential and commercial units. \nThe company said pre-tax profit in the year to December 31 rose 1% to £100m, helped by a strong performance in continental Europe and China. \nGroup revenue rose 13% to £1.4bn, with chief executive Jeremy Helsby hailing a “record performance in 2016 despite the geopolitical distractions”. \nBut Savills also laid bare the impact of the Brexit vote on London, with the estate agent booking a 3% fall in revenue at its UK residential arm to 124.4m, and contract exchanges falling 5% in the capital. \nSavills added that revenue from UK commercial transactions decreased 13% to £86m against a backdrop of an overall 28% fall in investment volumes. \nHowever, it added that the collapse in the value of the pound helped mitigate the impact, with the top end of the residential market getting a boost and foreign buyers piling into the commercial market. \nSavills said: \nThe weakness of sterling after the Brexit referendum began to catalyse international investor interest over the summer, although there being little distress among owners, there was a significant mismatch between demand and supply of stock. \nSince then, a large majority of the stock traded, particularly in central London, has been acquired by overseas investors, particularly from Asia Pacific and the Middle East. \nThe central London leasing market also saw a 21% reduction in the take-up of City offices, while the vacancy rate in the Square Mile rose to 5.7% against as rents continued to increase. \nMr Helsby added: \nWe entered 2017 with a continuation of global macro-economic concerns, rising bond yields, uncertainty over the impact of Brexit negotiations in the UK and continental Europe and a new administration in the US. \nSavills is a strong and diverse global firm and we continue to look at opportunities to develop our business. We have started the year well and our expectations for the full year remain unchanged. Savills For Sale sign in London 8:56 Jonathon Manning Farmers could lose 'hundreds of thousands of pounds' from diversifying business, warn lawyers \nFarmers could lose ‘hundreds of thousands of pounds’ in the long run if they attempt to diversify their business after Brexit, according to lawyers at Moore Blatch. \nThe decision to leave the EU will mean that subsidies received by UK farmers will cease, and has caused many in the industry to consider diversify their business. This includes letting farm buildings be used for holiday homes, sports facilities, or for retail purposes. \nHowever, lawyers at Moore Blatch have warned that farmers could lose hundreds of thousands of pounds if such changes are not carried out correctly. This is because many of the changes would not qualify for Agricultural Property Relief from inheritance tax. \nPhilip Whitcomb from Moore Blatch said: \nOur Rural Services team has already dealt with a number of cases where famers and land owners look to diversify their income stream, from installing solar panels and wind farms to using farm buildings for holiday lets. With the current level of support for farmers looking increasingly vulnerable, we expect to see a growth in diversification in the use of farm land. \nHowever, diversification comes with risks, specifically farmers’ ability to qualify for Agricultural Property Relief from inheritance tax as this often does not apply to many forms of diversification and can be worth tens or hundreds of thousands of pounds. Tractor spraying wheat field with sprayer (Photo: iStockphoto) 8:52 KEY EVENT Holyrood set to back indepence referendum call in MSP vote \nScotland MSPs are expected to back Nicola Sturgeon’s call for a second independence referendum when they reach decision time at Holyrood this evening. \nThe vote will follow a two-day debate in the Scottish Parliament over whether the First Minister should seek permission to hold another ballot between autumn next year and spring 2019. \nTheresa May has declared “now is not the time” for another vote, indicating she will reject the SNP’s preferred timetable. \nOpening the debate on Tuesday, Ms Sturgeon told the chamber it would be “wrong, unfair and utterly unsustainable” for the UK Government to block her request. Scottish Conservative, Labour and Liberal Democrat politicians have already made clear they will vote against another referendum. \nThe Scottish Greens are expected to help the minority Scottish Government pass its motion asking for a mandate to take forward discussions with the UK Government on the details of a section 30 order - the mechanism to transfer the legal powers for a vote. \nA total of 62% of Scottish voters backed the UK remaining part of the EU in June 2016 and the SNP manifesto for last year’s Holyrood elections made clear another ballot on independence should take place if there were a “material change in circumstances” from the previous ballot in 2014. The example cited for that was for Scotland to be removed from the EU against its wishes. \nOn Tuesday, Ms Sturgeon said: \nIn the circumstances we now face, for the UK Government to stand in the way of Scotland even having a choice would be, in my view, wrong, unfair and utterly unsustainable. \nScottish Conservative leader Ruth Davidson insisted the majority of Scots did not want another referendum now. She said: \nThis referendum may be the First Minister’s priority. It is not mine. Nor that of my party. First Minister Nicola Sturgeon (Photo: Handout) 8:46 KEY EVENT Brexit and independence vote could slow economic recover, report warns \nScotland’s economy is forecast to continue to recover this year but uncertainty caused by Brexit and a second Scottish independence referendum will slow growth, a new report has found. \nResearchers at Strathclyde University’s Fraser of Allander Institute predict the Scottish economy will continue to lag behind the UK, largely due to the downturn in the North Sea oil and gas industry. \nIn the three months to September 2016, the Scottish economy grew by 0.2% while the UK economy grew by 0.6%, while for the year Scotland’s GDP increased by 0.7% compared to a UK increase of 2.2%. \nThe institute’s latest forecasts for Scottish economic growth are 1.2% in 2017, 1.3% in 2018 and 1.4% in 2019, broadly unchanged from the previous forecast figures from December. \nThe report found in the 10 years since the start of the financial crisis, the Scottish economy has grown by an average of just 0.7% each year - less than a third of its long-term trend, squeezing household income despite unemployment rates at near record lows of 4.7%. \nInstitute director Graeme Roy called on both the Scottish and UK governments to “provide clarity and reassurance” over independence and Brexit respectively. \nHe said: \nGrowth in the Scottish economy continues to lag behind the rest of the UK, driven in part but not entirely, by the ongoing challenges in the oil and gas sector. \nThe immediate outlook for 2017 is marginally more positive than for 2016, with some important business surveys suggesting an increase in new orders and demand. \nThat being said, in the current climate sentiment can change quickly and there remains a high degree of margin for error in all economic forecasts at the current time. \nIrrespective of your views over the long-term benefits of Brexit or independence, the increase in uncertainty caused by the triggering of Article 50 and the prospects of a second independence referendum will act as a headwind for many businesses. \nJust as it is the responsibility of the UK Government to provide clarity and reassurance wherever possible through the Brexit process, it is incumbent on the Scottish Government to do likewise around independence and to re-double their efforts to support the Scottish economy through these unprecedented times. Professor Graeme Roy, Director of the University of Strathclydes Fraser of Allander Institute 8:43", "external_links": [], "published": "2017-03-22T15:20:00.000+02:00", "crawled": "2017-03-22T11:35:12.676+02:00", "highlightTitle": ""}