{"organizations": [], "uuid": "9555795a0585ecfa11bdba53a02a79d6ff4efe22", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30233911/15928999.jpg", "site_section": "http://www.westernmorningnews.co.uk/editorschoices.rss", "section_title": "Devon Live Editor's Choices RSS feed", "url": "http://www.devonlive.com/international-business-festival-heads-to-exeter/story-30233911-detail/story.html", "country": "GB", "title": "International business festival heads to Exeter", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "International business festival heads to Exeter", "spam_score": 0.0, "site_type": "news", "published": "2017-03-28T23:23:00.000+03:00", "replies_count": 0, "uuid": "9555795a0585ecfa11bdba53a02a79d6ff4efe22"}, "author": "Zoe_Stevens", "url": "http://www.devonlive.com/international-business-festival-heads-to-exeter/story-30233911-detail/story.html", "ord_in_thread": 0, "title": "International business festival heads to Exeter", "locations": [], "entities": {"persons": [{"name": "scaleup", "sentiment": "none"}, {"name": "richard branson", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "andrew ellis", "sentiment": "none"}, {"name": "chris moss", "sentiment": "none"}, {"name": "andrew", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "chris", "sentiment": "none"}, {"name": "christine copley", "sentiment": "none"}], "locations": [{"name": "exeter", "sentiment": "none"}, {"name": "exeter castle", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "william prance road", "sentiment": "none"}, {"name": "southernhay", "sentiment": "none"}, {"name": "fore street", "sentiment": "none"}, {"name": "shanghai", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "virgin atlantic", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "derriford", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "paddington", "sentiment": "none"}, {"name": "chagford", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}], "organizations": [{"name": "exeter international", "sentiment": "none"}, {"name": "astley media", "sentiment": "none"}, {"name": "tsb", "sentiment": "none"}, {"name": "on digital", "sentiment": "none"}, {"name": "itv digital", "sentiment": "none"}, {"name": "gwr", "sentiment": "none"}, {"name": "southernhay house", "sentiment": "none"}, {"name": "mint methodist church", "sentiment": "none"}, {"name": "royal british legion", "sentiment": "none"}, {"name": "lloyds bank", "sentiment": "none"}, {"name": "torquay", "sentiment": "none"}, {"name": "university of exeter", "sentiment": "none"}, {"name": "dean clarke house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "International business festival heads to Exeter By Zoe_Stevens   0 COMMENTS SHARES Some 250 delegates will hear from international business speakers, take part in immersive masterclasses and debate with renowned business experts during panel sessions and lunches across Exeter International business festival heads to Exeter X \nCopy link to paste in your message / Some 250 delegates will hear from international business speakers, take part in immersive masterclasses and debate with... Comments (0) \nAn international business festival, which is held in London and New York is heading to Exeter. The Like Minds Ideas Festival will arrive in Devon in September, with business leaders and speakers from the US, Europe and the UK taking part. \nSome 250 delegates will hear from international business speakers, take part in immersive masterclasses and debate with renowned business experts during panel sessions and lunches across the city. \nBusiness innovator Chris Moss, who helped build three global billion dollar brands - Virgin Atlantic, Orange and 118 118 - will be one of the speakers at the Like Minds Exeter 'From Startup to Scaleup' Ideas Festival. \nRead next: Tributes to Exeter dad of three who died suddenly aged 28 \nDuring his eight years as marketing director of Virgin Atlantic, Chris Moss took the company from a single aircraft to a loved international brand, creating Premium Economy, seat-back TV and on-board ice creams along the way. Chris is also the founder of the famous mobile Orange brand, led the brand switch from On Digital' to 'ITV Digital, oversaw the brand merger of Lloyds Bank and TSB and was CEO of 118 118. \nChris will also be the guest speaker at the first of a series of Like Minds business events in Exeter held in partnership with Exeter-based PR, marketing and design agency Astley Media in the run up to September's festival. \nRead next: High profile Torquay tourist shelter boarded up after becoming home to rough sleepers \nChris, who now runs business consultancy MAV3ERICK, said: “With its openness, pinpoint discussions and incredible line up of innovators from around the world, I've always loved Like Minds and it's fantastic that it's coming back to Exeter. \n“I'm dyslexic so I constantly look for different connections, and an interesting thing about Richard Branson is he's dyslexic too. In his case, it means he's a really good connecter – he meets lots of different people, and brings them all together. I guess that's one of the attractions of LIke Minds, it brings a lovely blend of people together and gets them talking.\" \nAndrew Ellis, the founder of Like Minds, said: “The 'From Startup to Scaleup' Ideas Festival will give people opportunities to learn, share, develop new ideas and make new connections. Like Minds is the perfect environment to engage and network with some of the UK and Europe's leading entrepreneurs and business leaders. The time is right to bring an international festival focused on growth to the fastest-growing city for population in the UK right now.\" \nRead next: Europe's first permanent rainbow crossing gets green light for Devon town \nAs well as international business speakers, LIke Minds Exeter will feature a Futures Room, showcasing key regional activity set to propel the South West's economy over the next decade and beyond. There will also be exhibition space, a Sponsors and Speakers Dinner, off-site lunches at restaurants around Exeter for delegates, each one hosted by a different speaker, and an after party in the city on the Friday evening. GWR is offering discounted travel for people travelling from London for the festival and for those traveling from Paddington there will be an 'Entrepreneurs Express' on the Thursday evening. \nRead next: Final approval for Exeter's £75m Princesshay extension - now they need to find someone to build it \nLike Minds events are also being held in London, New York and Shanghai this year. Launched in 2009, its first ever event was actually a business conference in Exeter nearly a decade ago. Since then, from its headquarters in Devon, Like Minds has expanded to run ideas and innovation festivals, business summits, trade missions and immersive training around the world. \nThe festival will be held at Exeter Castle on September 29, after a speakers and sponsors welcome dinner the evening before. An 'Inside Track' business dinner with Chris Moss as guest speaker will be held at Southernhay House on Thursday April 27 and a Business Breakfast Masterclass at Dean Clarke House, Southernhay, on April 28. READ NEXT: \nAnnual Devon Festival of Remembrance has been cancelled \nThis shocking video footage shows an innocent woman being used as a human shield in a fight between two men armed with a machete in a Devon car park this morning, Tuesday March 28.It happened in the car park of the PDSA animal hospital in William Prance Road, Derriford, which is being used as an illegal camp site. Travellers set up camp there at the weekend - and there have since been reports of fighting, illegal fires and men chopping up cars with chainsaws. \nExeter mother bullied starving son and made him eat dog biscuits \nA cruel mother has been found guilty of subjecting her young son to a decade of daily beatings and humiliations. Christine Copley picked on her third son Andrew as he was growing up in the 1980s and early 1990s and imposed a regime of painful and needless punishments. She succeeded in hiding what she was doing from teachers and social workers by moving Andrew from her home in Exeter to her parents in Chagford if he had visible bruises. \nBrexit could spell disaster for Devon wildlife \nThe annual Devon Festival of Remembrance, traditionally held at either Exeter Cathedral or the University of Exeter, has been cancelled because of financial restraints. The organizers have been forced to postpone the Royal British Legion's annual event, held every November for more than a quarter of a century. In its place, a much smaller Remembrance Concert will be held on Thursday, November 2 in the Mint Methodist Church, Fore Street. \nWoman used as human shield in terrifying machete attack \nThis shocking video footage shows an innocent woman being used as a human shield in a fight between two men armed with a machete in a Devon car park this morning, Tuesday March 28. It happened in the car park of the PDSA animal hospital in William Prance Road, Derriford, which is being used as an illegal camp site. Travellers set up camp there at the weekend - and there have since been reports of fighting, illegal fires and men chopping up cars with chainsaws.", "external_links": [], "published": "2017-03-28T23:23:00.000+03:00", "crawled": "2017-03-28T19:54:11.323+03:00", "highlightTitle": ""}