{"organizations": [], "uuid": "ac2c930aeb9f274acabb461e8c6a13af7e156573", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12743553.ece/ALTERNATES/s1200/the-coty-factory.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/coty-factory-closure-northumberland-latest-12825204", "country": "GB", "domain_rank": 21960, "title": "Coty factory closure in Northumberland - the latest on a meeting to discuss its future", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Coty factory closure in Northumberland - the latest on a meeting to discuss its future", "spam_score": 0.0, "site_type": "news", "published": "2017-03-31T20:00:00.000+03:00", "replies_count": 0, "uuid": "ac2c930aeb9f274acabb461e8c6a13af7e156573"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/coty-factory-closure-northumberland-latest-12825204", "ord_in_thread": 0, "title": "Coty factory closure in Northumberland - the latest on a meeting to discuss its future", "locations": [], "entities": {"persons": [{"name": "campbell", "sentiment": "none"}, {"name": "coty", "sentiment": "none"}, {"name": "ronnie campbell", "sentiment": "none"}], "locations": [{"name": "northumberland", "sentiment": "none"}, {"name": "kent", "sentiment": "none"}, {"name": "blyth valley", "sentiment": "none"}, {"name": "seaton delaval", "sentiment": "none"}, {"name": "ashford", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "parliament", "sentiment": "negative"}, {"name": "arch", "sentiment": "none"}, {"name": "p&g", "sentiment": "none"}, {"name": "northumberland county council", "sentiment": "none"}, {"name": "procter & gamble", "sentiment": "none"}, {"name": "seaton delaval", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "seaton valley community council", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily   \nA new date has been set for Parliament to discuss the proposed closure of the Coty factory in Northumberland which would see up to 450 jobs being lost. \nThe adjournment debate request was tabled by Blyth Valley MP Ronnie Campbell and is now to take place on April 20. \nIt had originally been set for March 22, however this proved to be the day of the Westminster terrorist attack and it was postponed. \nMr Campbell said: “It will be interesting to see what the Business Minister has to say on the subject and whether we can stop the closure is another matter.” \nWe first revealed that the factory in Seaton Delaval , which makes fragrances for global beauty products company, had been earmarked for closure in 2018 - subject to consultation. \nIt was the result of a business review which began last October after a multi-billion pound deal saw Coty take over Procter & Gamble’s beauty products business. The HFC Prestige Coty factory in Seaton Delaval (Photo: Newcastle Chronicle) \nWorkers at Seaton Delaval claimed they were told by management that, despite it being one of the company’s most efficient factories, it had been chosen as it was ‘cheaper’ to close as they had no union representation. \nOne staff member claimed they had always been told not being unionised would work in their favour. \nMr Campbell said: “It appears British employees are the cheapest workers to be made redundant which is in line with their contracts.” \nHowever the company strongly denied this and another suggestion that Brexit uncertainty contributed to the decision. Read More \nIt said its customer base is worldwide - not simply the EU - and a consequence of the merger of P&G brands was Coty now simply has too many factories. \nOne not under threat is located in Ashford, Kent. \nA spokesperson for Coty said: “The proposal to close the Seaton Delaval site is based on the outcomes of Coty’s manufacturing footprint study. \n“As per legal requirements in the UK, we are now seeking representatives for the employee consultation forum with whom we will consult on the proposal. \n“Until then, it would be quite wrong for us to comment on speculation or rumour.” \nThe closure of the factory will be a huge blow to the local community. Read More \nA spokesperson for Northumberland County Council said: “The council is working with Arch to keep in touch with the company and monitor the situation. \n“A response group is being formed and expects to have its first meeting in early April. \n“The group will comprise representatives of the council, Arch and Seaton Valley Community Council plus a range of other agencies which would be able to provide support.” Like us on Facebook", "external_links": [], "published": "2017-03-31T20:00:00.000+03:00", "crawled": "2017-03-31T15:23:34.827+03:00", "highlightTitle": ""}