{"organizations": [], "uuid": "9fe3a1adb2359af58ddbe308e59be220f3d6f8eb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12769670.ece/ALTERNATES/s1200/10866529-high_res-womans-hour.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/lauren-laverne-says-sunderland-doesnt-12769323", "country": "GB", "domain_rank": 21960, "title": "Lauren Laverne says Sunderland 'doesn't get the credit it deserves' as she backs City of Culture bid", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Lauren Laverne says Sunderland 'doesn't get the credit it deserves' as she backs City of Culture bid", "spam_score": 0.0, "site_type": "news", "published": "2017-03-21T01:00:00.000+02:00", "replies_count": 0, "uuid": "9fe3a1adb2359af58ddbe308e59be220f3d6f8eb"}, "author": "Katie Dickinson", "url": "http://www.chroniclelive.co.uk/news/north-east-news/lauren-laverne-says-sunderland-doesnt-12769323", "ord_in_thread": 0, "title": "Lauren Laverne says Sunderland 'doesn't get the credit it deserves' as she backs City of Culture bid", "locations": [], "entities": {"persons": [{"name": "lauren laverne", "sentiment": "negative"}, {"name": "lewis carroll", "sentiment": "none"}, {"name": "granda", "sentiment": "none"}, {"name": "jimi hendrix", "sentiment": "none"}, {"name": "lauren", "sentiment": "none"}, {"name": "wallace", "sentiment": "none"}, {"name": "kenickie", "sentiment": "none"}, {"name": "geno washington", "sentiment": "none"}, {"name": "bogart", "sentiment": "none"}, {"name": "ian west/pa wire", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "uk city", "sentiment": "none"}, {"name": "fenwick", "sentiment": "none"}, {"name": "winter gardens  speaking", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "winter gardens", "sentiment": "none"}, {"name": "mowbray park", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "glass centre", "sentiment": "none"}], "organizations": [{"name": "sunderland", "sentiment": "negative"}, {"name": "bbc", "sentiment": "none"}, {"name": "bbc pictures", "sentiment": "none"}, {"name": "sunderland museum", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "british museum", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Lauren Laverne says Sunderland 'doesn't get the credit it deserves' as she backs City of Culture bid TV and radio presenter Lauren Laverne says her hometown's contribution is 'too great to erase' Share Lauren Laverne (Photo: BBC Pictures') Share   Thank you for subscribing!   \nLauren Laverne has added her formidable voice to Sunderland’s City of Culture bid for 2021, saying her hometown doesn’t “get the credit it deserves”. \nThe BBC 6 Music DJ and former member of band Kenickie, is one of Sunderland’s best-known experts, thanks to TV and radio appearances on everything from The Culture Show to Have I Got News for You. \nAnd in an interview with Luxe magazine, the 38-year-old now has called for the city to “shout about” its cultural achievements more as it vies to be crowned UK City of Culture 2021, with the shortlist due to be announced in late spring. \n“I’m not sure Sunderland always gets the credit it deserves,” she said “But the city’s contribution is too great to erase.” \n“The city has given the world gospels, songs, glass, ships, stories... Maybe that’s why Lewis Carroll named Wonderland just after visiting.” \nLauren’s own version of culture started in Sunderland as a child: “My brother sometimes jokingly refers to our childhood home as the Culture Tardis and it really was. It was a house full of music, books and ideas. At the time, though (in the 1980s) that didn’t feel unusual, or if it was I didn’t know it was. People in Sunderland gathered to pledge their support for the City of Culture 2021 bid (Photo: Handout) \n“I’m from a big extended family and almost everyone in it was into music. Almost everyone sang or danced or just dressed like a pop star. It had always been that way - my Granda was one of 13 and was in a band with his brothers that sang in working men’s clubs. \n“My Dad has always played guitar - he was a regular on the blues and folk scene and played gigs with Jimi Hendrix, Geno Washington and loads of the stalwarts of the 60s folk scene. So it was very natural for my brother and I to carry on with our own version of that. \n“It was also wrapped up in my love of nightclubs and the North East’s ritualistic devotion to a good night out, which I think had a big influence on the way I feel about music.” Read More Sunderland UK City of Culture 2021: key backers make city's case in Westminster \nThough home these days, with husband and two boys, is in London, she returns as much as she can. \n“I love coming home. I always go for a run on the beach first and see friends and family. I also love checking out exhibitions at the Glass Centre, Winter Gardens and other local museums . I’ve seen some brilliant shows at The Empire and we always visit for big events like the Airshow and the Illuminations (I switched them on the other year, which was hilarious!) \n“My kids like to go and say hello to Wallace the Lion and the walruses in Mowbray Park when we’re up, just like I did when I was little. Of course the North East music scene is really vibrant, and it’s so lovely to get the chance to plug into that a bit whenever I can.” Sunderland Museum and Winter Gardens \nSpeaking of culture, Lauren believes her Sunderland inheritance is something of a mix. \n“I suppose I grew up with a regional identity that sat above any awareness of my national identity. I learned the importance of having a sense of humour and inherited a belief that culture is powerful. That what you know and believe, or what you love can count more than your circumstances. \n“On paper my Granda was a miner but who he really was was also about his interior life - a Nat King Cole soundtrack, a laconic sense of humour, Bogart and cowboy films - tons of cool and style. And all that stuff is just as real, just as much a part of who he was as the flesh and blood parts of his life. I think that’s the case for all of us, and that we should all have access to those sorts of riches. I inherited the belief that culture should be available to everyone. Read More Can Sunderland become the hotbed of UK culture? A look at how the city is preparing for 2021 bid \nLauren has made her home in London and those bright lights always beckon for other young people. Sunderland’s Brexit moment, of which she said, “I was sad to see the division that it created, for sure”, might well have created reason to leave for many young people. Would something like a cultural shift, make people stay? \n“Of course there needs to be a strong economy, but it’s also about your life outside of work. I read a survey recently that said kids in the North East have the best access to the natural environment (the coast) in the country, and how important that is for their wellbeing. \n“It’s great that we’ve already got that. And of course there needs to be a rich cultural scene - places to go out, see people and experience whatever it is you’re into, whether that’s hardcore metal or musical theatre. \n“My definition of home has expanded over the years. Lauren Laverne (Photo: Ian West/PA Wire) \n“Sunderland will always be home but now London is, too. I suppose like most people it’s where the people I love are, and they’re in both places. Aside from them I’m happiest with a sea view. I think that’s got to do with being born a couple of hundred yards from Roker beach.” \nOn what the City of Culture honour would mean to Sunderland, Lauren said: “People, investment, spectacle, fun, ideas. It depends how you’re measuring it - the economic impact would be fantastic, but I also love the idea that it would give everyone at home the kind of access to art and culture that people in big cities sometimes take for granted. \n“It’s easy to live in London and never visit the British Museum even though it’s free, but as we all know one of the great things about Sunderland is that if you put on a do, everyone comes! \n“I hope it would be an opportunity that people from across the region could enjoy.” \nLuxe magazine is on sale in Fenwick, Newcastle or via www.luxe-magazine.co.uk Like us on Facebook", "external_links": [], "published": "2017-03-21T01:00:00.000+02:00", "crawled": "2017-03-20T20:18:13.026+02:00", "highlightTitle": ""}