{"organizations": [], "uuid": "f1fb02392ca45297cd467c860cdc012d7d3f28dd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30236300/15930847.jpg", "site_section": "http://www.middevongazette.co.uk/all-content.rss", "section_title": "Devon Live All Content Feed", "url": "http://www.devonlive.com/splatford-split-average-speed-cameras-welcomed-by-councillors/story-30236300-detail/story.html", "country": "GB", "title": "RomPEllis published Splatford Split average speed cameras welcomed by councillors", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "RomPEllis published Splatford Split average speed cameras welcomed by councillors", "spam_score": 0.0, "site_type": "news", "published": "2017-03-29T22:06:00.000+03:00", "replies_count": 0, "uuid": "f1fb02392ca45297cd467c860cdc012d7d3f28dd"}, "author": "RomPEllis", "url": "http://www.devonlive.com/splatford-split-average-speed-cameras-welcomed-by-councillors/story-30236300-detail/story.html", "ord_in_thread": 0, "title": "RomPEllis published Splatford Split average speed cameras welcomed by councillors", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Splatford Split average speed cameras welcomed by councillors By RomPEllis   0 COMMENTS SHARES Splatford Split average speed cameras welcomed by councillors   Comments (0) \nWork to install average speed cameras along the A38 and A380 at the Splatford Split has been welcomed by local councillors. \nHighways England started work on Monday on a £250,000 scheme to improve safety on the road. Following a number of road traffic incidents in this location, average speed cameras will be installed at four locations along a four-kilometre stretch of the eastbound carriageway heading towards Exeter to improve the safety for all road users of the A38 and A380. \nTeignbridge district councillor Kevin Lake, who represents Kenn Valley ward, said: \"This is very welcome news as road safety at Splatford Split does need to be improved. \n\"Government investment in a fourth lane in 2015 improved traffic flow and reduced congestion, but this has meant vehicles are travelling much faster, particularly coming down Haldon Hill and Telegraph Hill, and steps do need to be taken to reduce accidents.\" \nRead more: Bangers to Brexit, says Devon sausage maker supplying the world \nThe four cameras are being installed at the top of Telegraph Hill on the A380, next to the petrol station at the top of Haldon Hill on the A38, at the Splatford Split junction and at a site just north of Kennford on the A38. \nCllr Stuart Hughes, Devon County Council Cabinet Member for Highway Management, said: \"Speed cameras have a positive effect in reducing collisions and injuries and the installation of these cameras will improve safety. By covering the approaches to Splatford Split, it will encourage motorists to maintain a constant speed where traffic merges.\" \nRead more: Why are fighter jets flying over Devon? \nWork to install the cameras started on Monday and will involve two weeks of overnight single lane closures of the eastbound carriageway and one full overnight closure on April 7 to coincide with resurfacing work already planned at the location. \nThe speed limit along the carriageway is 70mph and the move to install cameras is supported by both Devon and Cornwall Police and Devon County Council.", "external_links": [], "published": "2017-03-29T22:06:00.000+03:00", "crawled": "2017-03-29T17:45:29.762+03:00", "highlightTitle": ""}