{"organizations": [], "uuid": "0d25f7ed8cc7df84cd464a90e31c1cd4ef4ebcc1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30190018/15896621.jpg", "site_section": "http://www.westernmorningnews.co.uk/news.rss", "section_title": "Devon Live news RSS feed", "url": "http://www.devonlive.com/north-devon-mp-calls-budget-message-of-confidence-opponents-call-it-complacent/story-30190018-detail/story.html", "country": "GB", "title": "North Devon MP calls Budget 'message of confidence', opponents...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "North Devon MP calls Budget 'message of confidence', opponents...", "spam_score": 0.0, "site_type": "news", "published": "2017-03-08T23:50:00.000+02:00", "replies_count": 0, "uuid": "0d25f7ed8cc7df84cd464a90e31c1cd4ef4ebcc1"}, "author": "JoeBulmer", "url": "http://www.devonlive.com/north-devon-mp-calls-budget-message-of-confidence-opponents-call-it-complacent/story-30190018-detail/story.html", "ord_in_thread": 0, "title": "North Devon MP calls Budget 'message of confidence', opponents...", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "North Devon MP calls Budget 'message of confidence', opponents call it complacent By JoeBulmer | Posted: March 08, 2017 0 COMMENTS SHARES Self-employed people will see an increase in their national insurance contribution North Devon MP calls Budget 'message of confidence', opponents call it complacen... X \nCopy link to paste in your message / Comments (0) \nNorth Devon's MP has called today's Budget \"a very clear message of confidence\" while Labour leader Jeremy Corbyn called it \"a Budget of utter complacency\". \nThe chancellor Philip Hammond today committed to spending an extra £2bn on social care and pledged to help firms dealing with an increase in business rates. \nSelf-employed people will see an increase in their national insurance contribution, a measure Labour Party leader Jeremy Corbyn called, \"cutting living standards for the many and raising taxes for the few\". \nConservative North Devon MP Peter Heaton-Jones has said he believes many people will be better off after today's Budget, he said: \"This was very much a 'steady-as-she-goes' Budget, designed to send a very clear message of confidence in the UK economy as we head towards Brexit. \n\"The most eye-catching measure was the extra funding of two billion pounds for social care over the next three years, with one billion straight away. \n\"There was also the news of extra spending for A&E departments now, and a promise of a multi-year funding settlement for the NHS in the Autumn.\" \nREAD NEXT: Better trains and business rate reform come top of our budget wish list \nHe added: \"These are both major concerns in North Devon, so although these are welcome announcements, I will want to see exactly how our local area will benefit. \n\"The chancellor confirmed increases in both the National Minimum Wage and the income tax threshold, meaning 29 million ordinary working people will be better off. Indeed from next month, the average taxpayer will be £1,000 better off than in 2010.\" \nMr Heaton-Jones also expressed relief that the chancellor had addressed concerns about a rise in business rates. \nHe believes Mr Hammond has listened to those concerns and has welcomed measures to cap rate increases, provide a £300m discretionary fund and give pubs a 90% discount. \n\"Overall this was a Budget that showed the UK economy is in a healthy state and well placed to face the uncertainties of Brexit,\" concluded Mr Heaton-Jones. \n\"There are still challenges of course, but the chancellor's overall strategy is the right one for the UK. I will keep fighting to ensure that North Devon gets our fair share as the economy continues to grow.\" \nDevonLive has also contacted Torridge and West Devon MP, Geoffrey Cox, for his reaction.", "external_links": [], "published": "2017-03-08T23:50:00.000+02:00", "crawled": "2017-03-08T20:11:15.405+02:00", "highlightTitle": ""}