{"organizations": [], "uuid": "1839b0ec463a5925441fb97ac3e5e54110a590d0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article9829876.ece/ALTERNATES/s1200/JS49720637.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/government-faces-second-eu-defeat-12700456", "country": "GB", "domain_rank": 21960, "title": "Government faces second EU defeat as Prime Minister warns House of Lords puts Brexit at risk", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Government faces second EU defeat as Prime Minister warns House of Lords puts Brexit at risk", "spam_score": 0.0, "site_type": "news", "published": "2017-03-07T15:00:00.000+02:00", "replies_count": 0, "uuid": "1839b0ec463a5925441fb97ac3e5e54110a590d0"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/government-faces-second-eu-defeat-12700456", "ord_in_thread": 0, "title": "Government faces second EU defeat as Prime Minister warns House of Lords puts Brexit at risk", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "News Government faces second EU defeat as Prime Minister warns House of Lords puts Brexit at risk The Government could lose a key Brexit vote in the House of Lords on Tuesday, according to a North East peer Share   Thank you for subscribing!   \nThe House of Lords is likely to inflict another Brexit defeat on the Government on Tuesday, according to a North East peer. \nMembers of the Lords will vote on an amendment to the Brexit Bill which bans Prime Minister Theresa May from taking the UK out of the European Union until both Houses of Parliament have voted to approve the terms of a new deal. \nThe amendment would also ban her from simply deciding to quit the EU without any deal, unless she first has the approval of Parliament. \nMrs May has urged peers to reject the amendment - saying it would tie her hands and encourage the EU to refuse to offer the UK a fair agreement. \nBut Labour , which is proposing the amendment, expects to defeat the Government. \nLord Beecham, a Labour shadow minister and former leader of Newcastle City Council, said: “I would expect it to get through. \n“It’s a really critical thing, because otherwise the Government just gets a blank cheque.” \nBut he said the House of Commons could remove the amendment, unless Tory MPs support when the Bill returns to them. \nLord Beecham said: “The question is whether Conservatives in the Commons will vote for it.” \nThe Government wants a simple Bill which allows Brexit to begin without imposing any conditions on Ministers. British Prime Minister Theresa May (Photo: Michel Euler) \nAsked for the Prime Minister’s message to peers in the run-up to the vote, Mrs May’s official spokesman said: “She believes we should not commit to any process that would incentivise the EU to offer us a bad deal. \n“If we are in a position where any deal negotiated by the Prime Minister could be rejected by MPs, that gives strength potentially to other parties in the negotiation.” \nPeers last week voted to amend the European Union (Notification of Withdrawal) Bill 2016-17, which gives Mrs May the power to trigger Article 50 and begin the process of leaving the EU, to ensure that EU migrants currently in the UK legally have the right to stay after Brexit. \nThe Bill has already been approved by the House of Commons, which supported it without amendments. \nBut MPs will have a second chance to consider it, when they are asked whether to keep any changes introduced by the House of Lords or not. \nFormer Conservative Chancellor Norman Lamont has said that amending the Bill will encourage the EU to offer the UK a bad deal. Read More \nLord Lamont said: “The result was clear, the question was simple and unambiguous and yet Brexit is under attack on several fronts. \n“Some say maybe in the future the British people will change their minds. \n“By that they mean they would like to change their minds for them.” \nA labour peer has claimed that the UK will need more allotments after Brexit because of the increased need for home-grown produce. \nBaroness Andrews said that after breaking with Brussels, the UK faced having to “grow a lot more of our own food”. \nShe raised the issue with the Government during a question in the House of Lords, asking a Government Minister: “Does he agree with me that once we have left the European Union we are going to probably have to grow a lot more of our own food and therefore we are going to need many, many more allotments?” Like us on Facebook", "external_links": [], "published": "2017-03-07T15:00:00.000+02:00", "crawled": "2017-03-07T11:02:52.030+02:00", "highlightTitle": ""}