{"organizations": [], "uuid": "b0a0fbe841341a259caf4cbd35ced9571ac5c126", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12720507.ece/ALTERNATES/s1200/stopthesilence.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/billboards-springing-up-across-country-12720414", "country": "GB", "domain_rank": 21960, "title": "These billboards are springing up across the country but what do they mean?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "These billboards are springing up across the country but what do they mean?", "spam_score": 0.0, "site_type": "news", "published": "2017-03-10T18:00:00.000+02:00", "replies_count": 0, "uuid": "b0a0fbe841341a259caf4cbd35ced9571ac5c126"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/billboards-springing-up-across-country-12720414", "ord_in_thread": 0, "title": "These billboards are springing up across the country but what do they mean?", "locations": [], "entities": {"persons": [{"name": "liz holmes", "sentiment": "none"}, {"name": "holmes", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "scotswood road", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}], "organizations": [{"name": "national insurance budget", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News These billboards are springing up across the country but what do they mean? The darkened sign shows a face with tape over its mouth and 'the people are speaking, is parliament listening' on a red band Share Click to play Tap to play The video will start in 8 Cancel Play now Stop The Silence campaign video Share this video Get daily   Thank you for subscribing!   \nAn eye catching billboard by campaigners against what they fear will be a ‘brutal Brexit’ have appeared in Newcastle . \nIt is part of an initiative by the Stop the Silence group with similar posters being put up in cities across the UK. \nThey were paid for by a crowdfunding campaign that raised over £60,000 and the aim is to encourage the public to speak out over the Government’s hard Brexit policy. \nThe sign on Scotswood Road shows a person with black tape over their mouth. It reads: ‘The people are speaking. Is parliament listening?’ \n‘We did not vote for price hikes, hate crimes, brutal Brexit, deal or no deal.’ Read More \nLiz Holmes, founder of Stop the Silence, said it is not anti-Brexit but has come about because of a climate of fear surrounding debate of the issue. \n“It started off with a sense that the debate has shut down in this country,” she said. \n“There was quite a climate of intimidation and abuse generally and we now have a divisive political atmosphere. \n“Yet the thinking was if you voted ‘Remain’ you lost get over it and shut up. \n“We felt there were things that needed to be discussed which affected everybody no matter how they voted . Like leaving the single market. \n“If you look at the polls, never less than 60% - and sometimes up to 90% - want to stay in the single market. \n“It’s a very serious issue we need to ask the government about. We need to make that what happens is in the best interests of the whole of the country.” Read More Government faces Tory rebellion over National Insurance Budget increase on the self-employed \nMs Holmes added: “The Government is ignoring millions of people who are worried about the Brexit cliff-edge, however they voted in the referendum. \n“Billboards are the obvious way to get concerns off social media and literally onto the streets of the UK. \n“We all want a good deal. We do not believe the Government’s current ‘deal or no deal’ position will achieve that. It should be country first, not Brexit first.” \n“The campaign and group aim to influence the character and quality of debate in Parliament over the next two years, in a way which fully engages and involves the views of the entire electorate, much of which has diverse expectations of the Brexit process. \n“The campaign intends to emphasise the foundational British values of open debate and tolerance, where ongoing democratic dialogue must remain accessible, and available, to all of its citizens.” Like us on Facebook", "external_links": [], "published": "2017-03-10T18:00:00.000+02:00", "crawled": "2017-03-10T14:14:57.462+02:00", "highlightTitle": ""}