{"organizations": [], "uuid": "32e2948fec1dfec6d7a8c05be736a0d963a2304c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30197893/15902240.jpg", "site_section": "", "section_title": "", "url": "http://www.devonlive.com/the-rare-2-50p-20p-and-2p-coins-that-are-worth-hundreds/story-30197893-detail/story.html", "country": "US", "title": "The rare £2, 50p, 20p and 2p coins that are worth hundreds | Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "The rare £2, 50p, 20p and 2p coins that are worth hundreds | Devon Live", "spam_score": 0.01, "site_type": "news", "published": "2017-03-12T22:23:00.000+02:00", "replies_count": 0, "uuid": "32e2948fec1dfec6d7a8c05be736a0d963a2304c"}, "author": "", "url": "http://www.devonlive.com/the-rare-2-50p-20p-and-2p-coins-that-are-worth-hundreds/story-30197893-detail/story.html", "ord_in_thread": 0, "title": "The rare £2, 50p, 20p and 2p coins that are worth hundreds | Devon Live", "locations": [], "entities": {"persons": [{"name": "mary rose", "sentiment": "none"}, {"name": "jane austen", "sentiment": "none"}, {"name": "james bible", "sentiment": "none"}, {"name": "mary rose - henry viii", "sentiment": "none"}, {"name": "charles dickens", "sentiment": "none"}, {"name": "brixham  charles dickens", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}], "locations": [{"name": "royal botanical gardens", "sentiment": "none"}, {"name": "kew gardens", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "south devon", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "houses of parliament", "sentiment": "none"}, {"name": "somerset live", "sentiment": "none"}, {"name": "ec", "sentiment": "none"}, {"name": "royal mint", "sentiment": "none"}, {"name": "ebay", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The rare £2, 50p, 20p and 2p coins that are worth hundreds By Rich_Booth | Posted: March 12, 2017 0 COMMENTS SHARES Comments (0) \nIt's time to check your pockets, piggy-banks and down the back of the sofa. For it has come to light that a variety of common coins that have been in circulation for years could be worth a pretty penny… \nWhat with all the buzz around the new plastic £5 notes selling for thousands online , Somerset Live can reveal that rare and special edition 50p, 20p, 2p and £2 coins are selling for far in excess of their normal value. \nHere is what we know so far – check your shrapnel to see if you have any of these common coins with high price tags. \nA special edition 50p piece with Kew Gardens on the back is currently changing hands for more than £50. \nCollectors have been clamouring for this rare piece of coinage, produced in 2011 to mark the 250 anniversary of the Royal Botanical Gardens. \nOnly 210,000 coins were produced by The Royal Mint, compared with the 22.7million featuring the Royal Arms in 2008 and 7.5million with a Girl Guiding design in 2010. \nDateless 20p piece - £100 \nA production error on the part of The Royal Mint made an inadvertent hero out of a 2008 run of 20p coins. \nThe mint decided to switch the date from the reverse of the coin, to the front, however an production error meant the new and old designs were mismatched – leaving a date on neither side. \nSomewhere between 50,000 and 200,000 coins being put into circulation before the mistake was spotted, and a mint-condition coin now sells for up to £100. \nLondon Olympic 50p coin - £3,000 \ni \nA lasting legacy of the London Olympic games was a series of 50p coins with one of 29 designs on the back. \nSome of the designs were produced in higher numbers than the rest, and a full set would normally go for £35. \nSome of the rarer designers featuring football, wheelchair rugby, wrestling and tennis, can be exchanged for £3 or £4 individually. \nHowever, the prize find, recently listed for £3,000 on eBay , is one of 600 original aquatic coins, showing water passing over a swimmer's face, before the design was altered to show a visible face of the sportsman. \nThe EC commemorative 50p coin - £20 \nOne for those Brexiteers, or not. In 1992 and 1993 the Mint issued a commemorative coin to celebrate the British presidency of the council of Europe. Just 109,000 coins were issued, compared to the usual 5-12million, making it highly collectable. \nThe coins are no longer in circulation because the 50p piece was reduced in size in 1997, but if you have one in your penny jar at home it could be worth as much as £20. \nRead next: Motion made to protect Devon's nature after Brexit \nThe 1983 'New Pence' 2p coin - £650 \nAfter British currency went decimal in 1971, all 2p coins had 'New Pence' on the reverse until 1981. \nThe Royal Mint decided to replace 'New Pence\" with 'Two Pence' in 1982. However, in 1983 the Mint accidentally produced a small number that bore the old inscription 'New Pence'. These went into special collectors' sets , but if you do find one that made its way into circulation it could be worth up to £650. \nGuy Fawkes £2 coin - £16 \nThe Royal Mint regularly releases £2 coins with different designs and inscriptions on the edging. This mean, however, that mistakes sometimes creep in. \nThe Guy Fawkes coin was released in 2005 to commemorate the 400th anniversary of the gun powder plot to blow up the Houses of Parliament. On some of the coins released into circulation the inscription read \"Pemember, Pemember the Fifth of November instead of \"Remember, Remember\". \nThose coins usually sell for around £16 on eBay. \nRead next: Excitement as South Devon's humpback whale spotted off Brixham \nCharles Dickens £2 coin - £8 \nIn 2012 the Mint released a £2 coin to commemorate the 200th anniversary of the birth of Charles Dickens. The detailed reverse profile feature the names of the author's books. Only 20,000 coins were minted, making it a collectable coin worth up to four times its face value. \nMary Rose and King James Bible £2 coins - £6 \nThis rare coin marking the 500th anniversary of the Mary Rose - Henry VIII's mighty warship, which sunk in the Solent in 1545 \nBoth designs were released by the Royal Mint in 2011 in limited editions of 20,000 each to mark the 500th anniversary of the Mary Rose and the 400th anniversary of the King James Bible. Both coins are already becoming collectable due to the small numbers and reach double to triple their face value. \nOwning a £5 note with the serial number AA01 will stand you in good stead of generating some pocket money, but if you missed your chance the first time around, the polymer £10 note, which will feature author Jane Austen, will be in every cash-point by next summer. ", "external_links": [], "published": "2017-03-12T22:23:00.000+02:00", "crawled": "2017-03-12T17:45:50.471+02:00", "highlightTitle": ""}