{"organizations": [], "uuid": "3351252095b90b7dd0d2a1b229ed3921da445ab8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12760520.ece/ALTERNATES/s1200/TMP_NEC_010317FentimansRobson07JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/secret-family-recipe-multi-million-12760014", "country": "GB", "domain_rank": 21960, "title": "From a secret family recipe to a multi-million pound business: the Fentimans story", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "From a secret family recipe to a multi-million pound business: the Fentimans story", "spam_score": 0.0, "site_type": "news", "published": "2017-03-19T20:00:00.000+02:00", "replies_count": 0, "uuid": "3351252095b90b7dd0d2a1b229ed3921da445ab8"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/secret-family-recipe-multi-million-12760014", "ord_in_thread": 0, "title": "From a secret family recipe to a multi-million pound business: the Fentimans story", "locations": [], "entities": {"persons": [{"name": "aqua libra", "sentiment": "none"}, {"name": "philip ashurst", "sentiment": "none"}, {"name": "geraldine coombes", "sentiment": "none"}, {"name": "eldon robson", "sentiment": "none"}, {"name": "ashurst", "sentiment": "none"}, {"name": "proctor", "sentiment": "none"}, {"name": "david charlton", "sentiment": "none"}, {"name": "frederick robinson", "sentiment": "none"}, {"name": "joe", "sentiment": "none"}, {"name": "thomas hardy", "sentiment": "none"}, {"name": "fentimans", "sentiment": "none"}, {"name": "uncle joe", "sentiment": "none"}, {"name": "vicky smith", "sentiment": "none"}, {"name": "rose lemonade", "sentiment": "none"}, {"name": "eldon", "sentiment": "none"}, {"name": "philip", "sentiment": "none"}, {"name": "neil denham", "sentiment": "none"}, {"name": "stephenson", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "midde east", "sentiment": "none"}, {"name": "stockport", "sentiment": "none"}, {"name": "leeds", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "tanfield lea", "sentiment": "none"}, {"name": "hexham", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}, {"name": "india", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "south america", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "grey street", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "purdys", "sentiment": "none"}, {"name": "pennsylvania", "sentiment": "none"}, {"name": "new zealand", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}], "organizations": [{"name": "national trust", "sentiment": "none"}, {"name": "royal society of chemistry", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "disney", "sentiment": "none"}, {"name": "tesco", "sentiment": "none"}, {"name": "kpmg", "sentiment": "none"}, {"name": "pink grapefruit tonic water", "sentiment": "none"}, {"name": "asda", "sentiment": "none"}, {"name": "fentimans hq hexham", "sentiment": "none"}, {"name": "hereford", "sentiment": "none"}, {"name": "morrisons", "sentiment": "none"}, {"name": "fearless house", "sentiment": "none"}, {"name": "sainsburys", "sentiment": "none"}, {"name": "bloom gin", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nWhen Eldon Robson first hit upon the idea of relaunching his great-grandfather’s botanical brewing firm, his ambition extended to simply making a living. \nHe wanted a decent car, a nice life for his children and a decent home. \nEldon knew his Uncle Joe still had the original, 100-plus-year-old Fentimans recipe – the formula for ginger beer scratched onto a scrap of paper – tucked away in a drawer. \nMore than 20 years later, Eldon has proved that his mission to bring back the original adult soft drink was ahead of its times. Eldon Robson CEO of Fentimans (Photo: Newcastle Chronicle) \nCurrently turning over £24m and employing 50 people at its Hexham base , the firm behind the unmistakable glass bottles is on the cusp of huge growth, driven by the explosion of the botanics scene, massive demand for their premium mixers and demand for more flavours and products from all corners of the globe. \nNow embarking on a strategy to treble turnover within five years, Fentimans’ revival is a truly inspiring North East success story, delivered by a man now positively fizzing with ambition, who looked to the past and saw a vision of the future. \nNot bad for someone who just wanted to buy a nice house. \n“I was working as manager of Fitzgeralds bar on Grey Street at the time and my ambition was simply to survive – to have a decent car, a decent life for the kids,” he says. “I didn’t see any further than that. \n“It was an instinct to go for it - clearly there was an opportunity to do something in soft drinks that no one else was doing. \n“The original business ended in the mid 1960s but I kicked it all off again with a couple of recipes on a piece of paper that was 55 years old, with a ginger beer recipe on one side and hop ale on the other. Uncle Joe kept the recipe in a drawer in his house in Leeds. He ran the old factory down there. Fentimans botanical brewery Headquarters in Hexham (Photo: Newcastle Chronicle) \n“There was no-one in the North East family who had the recipe so I went down to see Joe, and that really was the starting point of launching botanically brewed ginger beer again. \n“It was originally sold in these stem jars, which represented real thirst quenchers for the working man. \n“The guy would come out of the pits and shipyards, mouthful of dust, and he wanted something really strong to quench his thirst. It was the earliest adult soft drink, before that marketing term even came out. \n“When I started the company again I didn’t want to make pop - carbonated soft drinks. The term adult soft drink had just emerged by then, with the likes of Ame, Aqua Libra and Purdys. \n“But I thought if I launched mine it would be the original because it went back to a process that had been out of date for years. \n“So we resurrected this craft process for making soft drinks, and I suppose by doing that I was a little ahead of my time. It’s quite a complicated process but we take great pride in what we do.” \nIt was a veritable brewing wizard – Dr Philip Ashurst – who helped it relaunch. Vicky Smith at work at Fentimans HQ Hexham (Photo: Newcastle Chronicle) \nDr Ashurst BSc PhD CSci CChem FRSC FIFST, a member of the Royal Society of Chemistry, has written 20 books on the manufacture and use of botanical extracts for use in food and herbal medicines. He is the go-to man within the industry for all the big name firms. \nEldon and his Uncle Joe took a trip to Hereford to see him, asking how they could turn the recipe on the ancient scrap of paper into a new product. \n“I took old Joe with me, who was in his eighties by then. I was trying to explain how we made it in the stone jar and Joe was just sitting there with his cloth cap on, so I said: ‘Come on, give us a hand will you?’ and I’ll never forget how he he said: ‘How man, give us a bucket and a bit’water and I’ll show you how to make it!’ \n“I thought Philip would take umbrage and kick us out, but he smiled and said ‘I think you’ve got something here’.” \nFentimans recently moved to new offices at Fearless House, an investment of at least £1m, with one office filled with multi-lingual staff reaching into new markets, and new audiences through its growing online presence, thanks to an updated website and social media platforms. \nIt’s a far cry from the early days of its rejuvenation in a two-floor industrial unit in Tanfield Lea, County Durham . \nEldon jokes that there were six people working for him in the first week, but only one the second week “because I had to sack them all”. \n“It was an absolute nightmare to begin with. Everything went wrong - I put my foot through the ceiling dashing to the telephone one day, I bought a second hand wagon and the gear box fell out the week I bought it. Everything that could go wrong did go wrong, but we battled through it.” Eldon Robson CEO of Fentimans (Photo: Newcastle Chronicle) \nWith Dr Ashurst’s advice, they brewed the same recipe, but changes had to be made to increase shelf life. \n“In the original bottle it was a live product, like real ale,” he explains. “Being a live product, it’s shelf-life was about seven days. You can’t produce something and sell it in seven days, so we had to change it - we had to carbonate the product, pasteurise it to stabilise it and give it a shelf-life. \n“They call me the Godfather of Craft in the soft drinks movement - the whole process takes seven days from start to finish, whereas other carbonated drinks takes just a couple of hours. \n“That’s what sets us apart from the opposition - a lot of care and attention goes into what we do, there’s a lot of benefits in making products that way, the texture, mouth-feel, depth of flavour.” \nThe vintage-style bottles of Curiosity Cola, Rose Lemonade, Victorian Lemonade and Ginger Beer got initial small deals with high street names and were also sold through English Heritage, National Trust and other national multiples to build their reputation. \nNow, however, you’ll also find them in all supermarkets - Tesco, Waitrose, Sainsburys, Asda, Morrisons, The Co-op - as well in lots of national pub and restaurant chains. \nThe UK market is still the main market but exports are on the up, last year accounting for a third of sales – but by the end of 2020 Eldon believes overseas sales will take up 56% of all turnover. Eldon Robson CEO of Fentimans (Photo: Newcastle Chronicle) \nThe US franchise, which manufactures in Pennsylvania, also continues to trade well, and other markets include Japan, the Midde East, South America, Mexico, Australia and New Zealand and Europe. He also believes the vote to leave EU could also open doors to other markets. \nHe said: “With the opening of the marketplace through Brexit we think India will become an opportunity, it’s been very restrictive prior to this because of the 60% import tax on selling stuff into India which makes it very difficult. \n“I get increasingly frustrated with the negative attitude with politicians and heads of business people towards it because business has to face up with these things and get on with it. You have to embrace the thing. In business you find a way through and around things. If you put your arms up and give up you might as well pack it in. \n“There are some costs involved. We buy some stuff from Europe which will have a bearing, but in all we’re going to embrace it. \n“If tarriffs are imposed we have such a strong holding in Europe now that we’ve already researched the fact that we already manufacture in America so there’s no reason why we couldn’t do a similar thing in Europe somewhere.” Fentimans' products (Photo: ©Neil Denham) \nNew markets are also being explored with new products, including forthcoming syrups and cans which could soon appear as part of drinks offerings on planes and trains. \nBut the real buzzword now is “premiumisation”, a market worth more than £1bn in the UK alone, which sees Fentimans mixers, sold in smaller bottles, in high demand. \nBottles such as Bloom Gin and Dentimans Rose Lemonade or Fentimans tonic also sell big. Fentimans’ premium mixers, sold in 125ml bottles, came about purely by accident, through an eleventh hour collapse of a contract. \nYet how Eldon turned a potential disaster into a brilliant opportunity is an example of his ability to calmly and methodically create a solution. \nHe recalls: “We were approached by a very famous Scottish whisky firm years ago, wanting our ginger beer in a 125ml bottle, as the perfect server with one of their spirits. We had heads of agreement and had bottle moulds made, and had two million of these little bottles made. \n“We had done a lot of PR with photoshoots and produced off-trade packs. All of this investment – and suddenly they pulled the plug on the whole thing. We were left with two million of these bottles wondering what on earth we were going to do with them! \n“So, we developed a tonic water - and that’s how we got into this business. \n“There was something that was a ‘hard luck’ story but it was actyally a blessing and we turned it into something positive. It’s funny how you can turn something around - if you ask me to be negative about business I won’t be - there’s always a way round things.” Eldon Robson CEO of Fentimans (Photo: Newcastle Chronicle) \nFearless House is home to the company’s laboratory, where all flavours and notes are concocted by flavourist, Geraldine Coombes, who often orders key ingredients – lots of lemons, oranges and rose oil, for example – more than a year in advance. Botanical ingredients are sourced from all over the world and there’s traceability in every single ingredient. \nThe initial concoction is brewed over seven days before being sent to one of two manufacturers, Thomas Hardy and Frederick Robinson in Stockport. Read More Newcastle hailed as top city in the UK for independent restaurant openings \nEldon believes it is outsourcing the manufacturing and bottling which had helped the business grow, leaving that part to the experts to free up the Hexham team to focus on all other areas of expertise. \nBut, he says: “If I was 20 to 25 years younger I’d definitely be building a factory in the North East to do it, but I’m no spring chicken anymore.” \nNew flavours have recently been introduced, such as Pink Grapefruit Tonic Water, on the back of the burgeoning botanics sector – just one sector that will help the firm grow. \nEldon, who owns the firm outright, has plans to triple turnover within five years. \nThe strategy was part-triggered by the arrival of new people into senior roles, including operations director David Charlton who came from KPMG, as well as others from big names including Proctor and Gamble and Disney. \nEldon says: “What’s happening now grew from an ambition last year where I thought how we’ve invested all this money in the new premises, well over £1m, including an IT system costing 250,000. \n“We’ve got this solid bridge of managers and out of that we thought we’ve got the people, got the premises, let’s scale up the ambition. It puts us in a very strong position from which we can grow. \n“The business has grown quite substantially over the last couple of years and we’ve gone from 25 people to around 55 altogether. \n“When we started out we were tiny. We sold 20,000 cases in the first year and we sell that in a day now. \n“If you want to have real ambition to go for the future you really have to put the foundations in place. Then you find you scale up your ambition because of the foundations you’ve created. Read More Next phase of Stephenson Quarter in Newcastle is given the go-ahead \n“Everything then becomes a much larger enterprise than you originally thought. You get a different mindset and confidence, and set different targets - and realise ‘I really can triple turnover in five years’. It’s a great position to be in.” \nNow 66, Eldon said he is often asked why he doesn’t retire, but he is clearly enthused by the new strategy and feels like Fentimans is starting out yet again. \nHe said: “At the start it was a question of survival. The only regret I have is that there’s no one around to see it and what it’s turned into. \n“I hope they are looking down from a cloud, very happy to see what’s happened here, and the way it’s gone. \n“I’m just delighted with the way the thing has evolved, and the way we have evolved too. \n“People ask why I don’t retire, but it’s taken 22 years to build it up so why would I give that up? \n“At 66 years of age I feel we are just starting again - I’m re-energized. It’s wonderful.” Like us on Facebook", "external_links": [], "published": "2017-03-19T20:00:00.000+02:00", "crawled": "2017-03-19T15:16:58.889+02:00", "highlightTitle": ""}