{"organizations": [], "uuid": "9bb6e2f3b25ef4fb64b8731d058bd346869cdad3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article11042353.ece/ALTERNATES/s1200/JS63222909-1.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-opinion/businesses-north-east-need-foreign-12803783", "country": "GB", "domain_rank": 21960, "title": "Businesses in the North East need foreign labour, says local CBI leader", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Businesses in the North East need foreign labour, says local CBI leader", "spam_score": 0.0, "site_type": "news", "published": "2017-03-28T01:00:00.000+03:00", "replies_count": 0, "uuid": "9bb6e2f3b25ef4fb64b8731d058bd346869cdad3"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-opinion/businesses-north-east-need-foreign-12803783", "ord_in_thread": 0, "title": "Businesses in the North East need foreign labour, says local CBI leader", "locations": [], "entities": {"persons": [{"name": "sarah glendinning", "sentiment": "negative"}, {"name": "liam fox", "sentiment": "none"}, {"name": "brexi", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "newcastle gateshead", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "cbi", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "cbi like us on facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Businesses in the North East need foreign labour, says local CBI leader Sarah Glendinning on how creative businesses on how the migration system must help creative businesses Share Sarah Glendinning, director, CBI North East Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe UK has a reputation as the world’s creative centre and the sector’s positive economic and cultural impact plays a vital role promoting the UK to the rest of the world. \nWe have phenomenal homegrown talent from the North East and across the UK, but as new opportunities open up in both established and emerging markets post-Brexit, it is important that a new migration system cements the UK’s global reputation. \nBritain is synonymous with outstanding creative achievement and there is no richer creative heritage anywhere in the world. The upcoming Great Exhibition of the North being held in Newcastle Gateshead in 2018 showcasing the dynamic arts, cultural, design and innovation in the north of England is a wonderful example of this. \nThe Creative sector supports almost 2m jobs, contributes over £87bn to the UK economy and was responsible for exporting almost £20bn of services in 2014 - over 40% of which went to the EU. \nUK culture is an international success story and an absolutely vital driver of growth and soft power. But the UK still hasn’t reached its creative peak. UK artists, architects and advertisers continue to innovate at an unprecedented rate. \nIt is in the UK’s best interest to maintain this growth by creating an environment in which the sector can continue to thrive, export and attract inward investment. We need a Brexi t that works for business, for Britain and for the creative sector. Read More Liam Fox criticised for 'too lazy and too fat' comments on UK businesses \nMany international firms base themselves here and they do this, in part, because they’re able to source skills from across Europe. The creative industries are no different and recruit European citizens at a higher rate than the economy as a whole. Therefore the post-Brexit environment must maintain the pipeline of talent that has done so much to fuel Britain’s creative fires. \nAnd more widely, business needs certainty on what immigration system the Government has in mind post-Brexit. The longer the uncertainty, the greater the impact on the economy will be. It’s welcome that the Government intends to consult with business over the summer on this system, but soon after we need to see more detail. \nWhat might our future immigration system look like? Well, it’ll should have three components. \nFirst, it should grant current overseas employees the right to stay in the UK. We must remove the current uncertainty that is causing some skilled people to consider leaving these shores. Read More 'No deal' on Europe would be disaster for North East manufacturing, industry group says \nSecond, it should allow an element of non-graduate migration. It’s worth noting mid-skilled creatives, including artists and musicians, often lack traditional evidence of expertise such as university degrees. They might rely on a portfolio of work, or on self-taught mastery of an instrument, so we need a flexible system that recognises the value of these people to the sector and the wider economy. \nAnd third, it should include provision for highly skilled roles, giving us access to the ‘best of the best’ across the world. There’s already a shortage, for example, of visual effects and software engineers. Imposing the system currently applied to migrants from outside of the EU would be a bitter blow to the sector. \nAn immigration system that reflects all these realities would do much to maintain the position of the UK’s creative sector. \nSarah Glendinning is regional director of the CBI Like us on Facebook", "external_links": [], "published": "2017-03-28T01:00:00.000+03:00", "crawled": "2017-03-27T20:21:24.106+03:00", "highlightTitle": ""}