{"organizations": [], "uuid": "daaefb97d5f5cd7e4ddbb5eb79443be7ca30d1e3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12809025.ece/ALTERNATES/s1200/Article-50-Official-Date-To-Trigger-Brexit-Process-Confirmed.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/brexit-d-day-how-historic-12808342", "country": "GB", "domain_rank": 21960, "title": "Brexit D-Day - how the historic political event will unfold in Parliament", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Brexit D-Day - how the historic political event will unfold in Parliament", "spam_score": 0.0, "site_type": "news", "published": "2017-03-28T23:00:00.000+03:00", "replies_count": 0, "uuid": "daaefb97d5f5cd7e4ddbb5eb79443be7ca30d1e3"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/brexit-d-day-how-historic-12808342", "ord_in_thread": 0, "title": "Brexit D-Day - how the historic political event will unfold in Parliament", "locations": [], "entities": {"persons": [{"name": "david davis", "sentiment": "none"}, {"name": "tusk", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "tim barrow", "sentiment": "none"}, {"name": "donald tusk", "sentiment": "none"}, {"name": "michel barnier", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "downing street", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}], "organizations": [{"name": "parliament", "sentiment": "negative"}, {"name": "european union", "sentiment": "none"}, {"name": "getty images europe", "sentiment": "none"}, {"name": "houses of parliament", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "world trade organisation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily   Thank you for subscribing!   \nSo Wednesday will be a landmark day in British political history when Article 50 is triggered and the process to leave the EU begins . \nWe’ve had the referendum result, the political fall outs and the Lords revolt, but the date has been set for Article 50 to be triggered and Britain to finally begin its departure from the EU. \nMuch has been said about the mysterious article but little is known about it - or what will happen next. \nAt what time should we get the popcorn out and settle in front of the TV for the announcement? \nTo be honest, we’re not sure... \nHaven’t you spoken to the House of Commons to find out where it fits into the Parliamentary timetable ? \nWe did, they didn’t know, and referred us to the Downing Street press office. \nSurely No 10 must know when Article 50 is triggered, that landmark event in British political history...? \nWe get the picture. Apparently not. A very nice man apologised for being “obtuse” and said Prime Minister Theresa May will make a statement ‘sometime’, maybe after Prime Ministers Questions. Will it even be debated? Prime Minister Theresa May (Photo: PA) \nCan’t even tell you that although at a guess probably not. Expect lots of TV shots of MPs looking sombre or nodding sagely when the announcement comes. And what time does PMQs start? \nIt starts at 12pm and is supposed to last until 12.30pm although it has a habit of over running. It will be interesting to see if it overruns on Wednesday because of Brexit related questions or whether it will just peter out in anticipation of Mrs May’s announcement. Whenever it comes. Do we know what happens once it has been announced? British Prime Minister Theresa May (L) and President of the European Council Donald Tusk (Photo: Getty Images Europe) \nWe’re on firmer ground here. A letter from the British government announcing the UK’s intention to trigger Article 50 will sent be sent to the EU. In case they try pull the ‘lost in the post’ trick, Sir Tim Barrow, the UK’s permanent representative in Brussels, is to personally hand it over to the European council president, Donald Tusk. And after that? \nMr Tusk has already said he would distribute his draft response to the letter among the leaders of the EU27 by Friday. However sources have reportedly made clear that it would take “four to six weeks” for the other 27 countries in the EU to reach consensus and start the more formal process. Read More Who is doing the negotiating? Brexit Secretary David Davis (Photo: PA) \nThe European Commission - the EU’s civil service - has created a task force headed by Michel Barnier. On the UK side, the overall responsibility is with the Prime Minister, supported by the Department for Exiting the European Union led by David Davis. How long will the talks last? \nThe time-frame allowed in Article 50 is two years - and this can only be extended by unanimous agreement from all EU countries. What if no agreement is reached? EU flags outside the Houses of Parliament (Photo: Getty Images Europe) \nIf no agreement is reached in two years, and no extension is agreed, the UK automatically leaves the EU and all existing agreements - including access to the single market - would cease to apply to the UK. Read More More pay, higher car tax, more free child care - how laws coming in in 2017 could affect you Would that leave the UK in some sort of economic limbo? \nIn this case, it is assumed UK trade relations with the EU would be governed by World Trade Organisation rules. Read More", "external_links": [], "published": "2017-03-28T23:00:00.000+03:00", "crawled": "2017-03-28T18:25:18.798+03:00", "highlightTitle": ""}