{"organizations": [], "uuid": "25cd7a73328ee3f668ab687a2b8834b9c7e64e5f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30233807/15928893.jpg", "site_section": "http://www.westernmorningnews.co.uk/all-content.rss", "section_title": "Devon Live All Content Feed", "url": "http://www.devonlive.com/paignton-volunteers-in-the-spotlight-on-bbc-television-show/story-30233807-detail/story.html", "country": "GB", "title": "Zoe_Stevens published Paignton volunteers in the spotlight on BBC television show", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "Zoe_Stevens published Paignton volunteers in the spotlight on BBC television show", "spam_score": 0.0, "site_type": "news", "published": "2017-03-28T23:39:00.000+03:00", "replies_count": 0, "uuid": "25cd7a73328ee3f668ab687a2b8834b9c7e64e5f"}, "author": "Zoe_Stevens", "url": "http://www.devonlive.com/paignton-volunteers-in-the-spotlight-on-bbc-television-show/story-30233807-detail/story.html", "ord_in_thread": 0, "title": "Zoe_Stevens published Paignton volunteers in the spotlight on BBC television show", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Paignton volunteers in the spotlight on BBC television show By Zoe_Stevens   Andy Uglow From left, Brian Stanley, Maggie Hawes, Beverley Gilson, Suzanne Hopkins, Angela Rippon and Martyn Rogers, of Age UK Exeter Paignton volunteers in the spotlight on BBC television show   Pictures: Andy Uglow From left, Brian Stanley, Maggie Hawes, Beverley Gilson, Suzanne Hopkins, Angela Rippon and Martyn Rogers, of Age UK... Comments (0) \nVolunteers in Paignton were the subject of a BBC television programme which aired last night. Television presenter Angela Rippon visited Paignton in January to film a new show focussed on elderly volunteers who live locally. \nAngela visited Age UK in Torbay Road to speak with volunteers and pensioners who have been helped by the charity. The new show, Holding Back The Years, was broadcasted on BBC 1 last night. \nAge UK Torbay provides a range of care and support services to promote the wellbeing of older people. Suzanne Hopkins, assistant manager at Age UK Paignton , said: \"It was a lovely day and everyone had a fabulous time. Angela talked to volunteers to find out why they work for Age UK and the sort of help they provide. \nRead next: High profile Torquay tourist shelter boarded up after becoming home to rough sleepers \n\"One volunteer said they just wanted to give something back to the charity after all the help they had received. She also spoke with customers who struggle with their pensions and then went out for a walk around Paignton.\" \nMs Rippon, 72, was born in Devon and presented radio and television news programmes in the South West before moving to BBC One's Nine O'Clock News, becoming a regular presenter in 1975. She was the first woman journalist to permanently present the BBC national television news. TV programmes she presented over the years include Cash in the Attic, Bargain Hunt and How to Stay Young. \nThe shop's manager, Beverley Gillson, said: \"We have enjoyed a really successful year since opening last May and always welcome new customers. The more people there are who can support the charity then the more people we can help. \n\"We are looking forward to seeing anyone who visits us.\" READ NEXT: \nExeter mother bullied starving son and made him eat dog biscuits \nA cruel mother has been found guilty of subjecting her young son to a decade of daily beatings and humiliations. Christine Copley picked on her third son Andrew as he was growing up in the 1980s and early 1990s and imposed a regime of painful and needless punishments. She succeeded in hiding what she was doing from teachers and social workers by moving Andrew from her home in Exeter to her parents in Chagford if he had visible bruises. \nBrexit could spell disaster for Devon wildlife \nEnvironment and wildlife campaigners in Devon are gearing up for the fight of a lifetime as Theresa May triggers Article 50. The county's wildlife chief has warned that Brexit could spell disaster for the county's unique environment if the Government fails to show ambition and a \"sense of vision\". Harry Barton, chief executive of Devon Wildlife Trust, says he is optimistic that leaving the EU need not be a \"nightmare scenario\" for the natural world. It could offer a unique opportunity for lawmakers to create a system of environmental protection that would be the envy of the world. \nWoman used as human shield in terrifying machete attack \nThis shocking video footage shows an innocent woman being used as a human shield in a fight between two men armed with a machete in a Devon car park this morning, Tuesday March 28. It happened in the car park of the PDSA animal hospital in William Prance Road, Derriford, which is being used as an illegal camp site. Travellers set up camp there at the weekend - and there have since been reports of fighting, illegal fires and men chopping up cars with chainsaws. \nTributes to Exeter dad of three who died suddenly aged 28 \nA fundraising appeal in memory of an Exeter man who died aged just 28 has topped £2,000. Father of three Luke Stone died on Monday after suffering from a heart problem. His nephew Joey Nockolds launched the fundraising page to give Luke 'the best send off possible' and to create a trust fund for his children. At 3pm on Tuesday the Go Fund Me page had raised £2,015 with donations from almost 100 people. \"Luke has been taken too soon,\" said Joey. \"He was the kindest and softest person I knew and would never leave my side - so I want to make sure I do that same.", "external_links": [], "published": "2017-03-28T23:39:00.000+03:00", "crawled": "2017-03-28T19:13:34.610+03:00", "highlightTitle": ""}