{"organizations": [], "uuid": "1d775a8d191015e7de9dbe16c1cac482cd7f990e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30171522/15882519.jpg", "site_section": "http://www.topix.com/rss/wire/law", "section_title": "", "url": "http://www.devonlive.com/labour-leader-jeremy-corbyn-to-set-out-eu-business-vision/story-30171522-detail/story.html", "country": "US", "title": "Article Image", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "Article Image", "spam_score": 0.0, "site_type": "news", "published": "2017-03-01T19:04:00.000+02:00", "replies_count": 0, "uuid": "1d775a8d191015e7de9dbe16c1cac482cd7f990e"}, "author": "", "url": "http://www.devonlive.com/labour-leader-jeremy-corbyn-to-set-out-eu-business-vision/story-30171522-detail/story.html", "ord_in_thread": 0, "title": "Article Image", "locations": [], "entities": {"persons": [{"name": "jeremy corbyn", "sentiment": "none"}, {"name": "hon greg clark", "sentiment": "none"}, {"name": "greg clark", "sentiment": "none"}, {"name": "hon jeremy corbyn", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "frances o'grady", "sentiment": "none"}], "locations": [{"name": "devon", "sentiment": "none"}, {"name": "torquay", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "riviera international conference centre", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "none"}, {"name": "tuc", "sentiment": "none"}, {"name": "fsb", "sentiment": "none"}, {"name": "national business show", "sentiment": "none"}, {"name": "energy", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Comments (0) \nLabour party leader Jeremy Corbyn is coming to Devon. He will be one of the headline speakers at the National Business Show & Conference 2017 held later this month at the Riviera International Conference Centre in Torquay. \nJoining Mr Corbyn on stage will be Greg Clark MP, the Secretary of State for Business, Energy, and the pair will set out their rival visions on the importance of small businesses to the economy, as the UK prepares to leave the EU. \nRt Hon Jeremy Corbyn MP, Leader of HM Opposition and the Labour Party, said: “I'm delighted to be coming to the National Business Show in Torquay. Labour backs small businesses and the self-employed right across the nations and regions of the UK. \n“They have been let down by this Government, which stands by as small businesses face rising costs, a late payment crisis, and poor infrastructure and broadband. In particular, we want a tax and benefit system that reflects the new world of work, and supports self-employment.\" \nRt Hon Greg Clark MP, Secretary of State for Business, Energy and the Industrial Strategy said: “As the new Business Secretary, I'm looking forward to speaking at FSB's National Business Show in Torquay. We have worked closely with FSB over Corporate Governance reforms to boost the supply chain, action to tackle poor payments and better public procurement. Now I want to talk to the UK small business community as we consult on the Industrial Strategy, and so the conference could not come at a better time. \n“This Government backs the UK's entrepreneurs, and we are making a success of Brexit. This is going to be crucial as we expand our trade to the rest of world.\" \nThere will also be a keynote speech to members of the UK's biggest business organisation from the leader of the biggest workers' organisation, the TUC General Secretary Frances O'Grady. \nThe Federation of Small Businesses will hear from the country's leading political figures at its National Business Show & Conference 2017 from March 23 to March 25, with Greg Clark, Jeremy Corbyn and Frances O'Grady all appearing on the afternoon of Thursday, March 23. \nOver the three days attendees can find out about the latest practical support for businesses – everything from pensions advice to how to tackle cyber-crime - as well as the political policy background to the business environment and the work of FSB. READ MORE", "external_links": [], "published": "2017-03-01T19:04:00.000+02:00", "crawled": "2017-03-01T14:25:06.518+02:00", "highlightTitle": ""}