{"organizations": [], "uuid": "8c9a7c4aef939b8b6566743425b946f7719684ee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30184009/15893106.jpg", "site_section": "", "section_title": "", "url": "http://www.devonlive.com/chef-michael-caines-highlights-importance-of-express-echo-business-awards/story-30184009-detail/story.html", "country": "US", "title": "Chef Michael Caines highlights importance of Express & Echo Business Awards | Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "Chef Michael Caines highlights importance of Express & Echo Business Awards | Devon Live", "spam_score": 0.326, "site_type": "news", "published": "2017-03-07T03:22:00.000+02:00", "replies_count": 0, "uuid": "8c9a7c4aef939b8b6566743425b946f7719684ee"}, "author": "", "url": "http://www.devonlive.com/chef-michael-caines-highlights-importance-of-express-echo-business-awards/story-30184009-detail/story.html", "ord_in_thread": 0, "title": "Chef Michael Caines highlights importance of Express & Echo Business Awards | Devon Live", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Chef Michael Caines highlights importance of Express & Echo Business Awards By EdOldfield | Posted: March 06, 2017 0 COMMENTS SHARES Michael Caines at the awards launch Chef Michael Caines highlights importance of Express & Echo Business Awards X \nCopy link to paste in your message / Comments (0) \nA-LIST chef Michael Caines spoke passionately about the benefits of living in the Westcountry and his desire to support the local economy at the launch of the 2017 Express & Echo Business Awards . \nThe Exeter-born businessman, who has been awarded the Freedom of the City and an MBE for his achievements, was the keynote speaker at the event in the Exeter Guildhall. \nMr Caines gave an update on his latest business, the £8.5million creation of Lympstone Manor, which he called a \"massive adventure\". \nThe project, set alongside the River Exe on the former Courtlands Estate, will have 21 bedrooms and a 60-seat restaurant. Mr Caines has planned a two-week soft opening from March 20 with the official launch scheduled for April 3 when 400 guests are expected. \nHe said the aim was to make it the best country house hotel in the country. \nMr Caines also spoke about how important it was to promote the Devon economy, and the important part that the business awards played in that by recognising excellence and promoting local enterprises. \nThe chef, whose Lympstone Manor is sponsoring the Tourism and Hospitality category of the awards, told the audience that he went to Exeter College before his career took him to London and then France. \nHe said: \"It's great to feel that I've been able to be successful in the business community of Exeter and the South West. \n\"It's a great honour to get behind an award which also showcases my industry.\" \nMichael Caines at the business awards launch \nHe added: \"I believe the South West offers an incredible experience to come and enjoy. \n\"We choose to work here in this community because of our lifestyle choices we want to make, the connections with the region in terms of its natural beauty, the coastline, the moors – it is a phenomenal place to be. \n\"And of course exporting that to the rest of the UK and Europe is an important part of what it's all about,\" he continued. \n\"Tourism plays an important part in terms of drawing people to the region, for them to disperse their income within the wider region and community of businesses.\" \nMr Caines, who told the audience that he was first mentioned in the Express & Echo for his swimming when he played water polo, also spoke of the importance of job opportunities, especially for young people, and said he was proud of the Michael Caines Academy at Exeter College. \n\"The awards are important to celebrate our successes,\" he said. \"They also highlight some of the excellent businesses that are here in this community.\" \nHe added: \"I chose to stay in the South West because I didn't want to leave it. I was born here, I wanted to make sure my future was secure here.\" \nOn the opportunities for tourism, he said inbound numbers from Europe were increasing, with the largest proportion from France. The drop in value of the pound after the Brexit vote meant the UK was more attractive, especially to US visitors, he claimed. \nMr Caines urged local authorities to work to further improve transport links so that when people came to the South West they discovered it was not just a holiday destination but a great place to live. \nRead more: Chef Michael Caines is hoping Samuel L Jackson will join him for hotel opening \nHe said: \"I say that life in the country may be slow but it gives us a little bit more time to enjoy it.\" \nHe pointed out that the £5.5million spent on refurbishment of Lympstone Manor was distributed among local businesses. And he was keen to work with local food producers to supply the hotel and restaurant. \nHe also paid tribute to the work of the Express & Echo: \"Their work within the community is fantastic, the coverage that they do, not just through traditional print, but online is great too.\" \nThe business awards are now open to entries, with a deadline of March 30, and you can enter online . Enter online at Judging day is April 7, and the awards ceremony takes place at Sandy Park on May 12. \nThere are still opportunities to sponsor the Corporate Social Responsibility, Digital and City Centre categories. For details, contact the Echo's business development manager, Alice Bryan, on 01392 346729 or email alice.bryan@expressandecho.co.uk. \nAnyone who wants help with their entry can sign up for a free advice seminar, offered by Chalk & Ward at the Echo's city centre office. To find out more and book a place for the morning sessions on March 13 and 14, call Jenny Beesley on 01392 346727 or email jenny.beesley@localworld.co.uk. \nHeadline sponsor is SW Comms and there are 12 categories for the 2017 Express & Echo Business Awards: Business of the Year (sponsored by SW Comms); City Centre; Apprenticeships (Devon County Council); Corporate Social Responsibility; Employer (Exeter College); Entrepreneur (Kitsons); Innovation (Reserved); Small Business of the Year (Pavey Group); Tourism and Hospitality (Lympstone Manor); Excellence in Manufacturing (Vanguard); Digital Business; Excellence in Customer Service (Walter C Parson). Walter H Squires is sponsoring the drinks reception. ", "external_links": [], "published": "2017-03-07T03:22:00.000+02:00", "crawled": "2017-03-07T18:35:32.791+02:00", "highlightTitle": ""}