{"organizations": [], "uuid": "0fadbaac17f8cbb5b07c7804ff3633d4077c665a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12802576.ece/ALTERNATES/s1200/Food-poisoning-risk.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/newcastle-revealed-most-likely-area-12802368", "country": "GB", "domain_rank": 21960, "title": "Newcastle revealed as most likely area in North East to pick up food poisoning", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Newcastle revealed as most likely area in North East to pick up food poisoning", "spam_score": 0.0, "site_type": "news", "published": "2017-03-27T20:00:00.000+03:00", "replies_count": 0, "uuid": "0fadbaac17f8cbb5b07c7804ff3633d4077c665a"}, "author": "Ian Robson", "url": "http://www.chroniclelive.co.uk/news/north-east-news/newcastle-revealed-most-likely-area-12802368", "ord_in_thread": 0, "title": "Newcastle revealed as most likely area in North East to pick up food poisoning", "locations": [], "entities": {"persons": [{"name": "tyne", "sentiment": "none"}, {"name": "alex neill", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "grey street", "sentiment": "none"}, {"name": "invalid email  newcastle", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "food standards agency", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "di marco", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Newcastle revealed as most likely area in North East to pick up food poisoning Which? has revealed the areas in the North East where you are most, and least, likely to pick up food poisoning Share A burger on a barbecue (Photo: John Stillwell/PA Wire) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nNewcastle is the area in the North East where you’re at the biggest risk of picking up food poisoning – a consumer watchdog has warned. \nInvestigators for Which? said the city was ranked 242nd out of 386 council areas by for food hygiene enforcement and the rating made it the worst place in the north of our region to risk food poisoning. \nMeanwhile Sunderland was fifth in the league table of how well food laws were enforced. \nIn December it was revealed how some Newcastle restaurants, including Di Marco’s in Grey Street, scored one out of a possible five in ratings from the Food Standards Agency. \nWhich? Complied its ranking as it was revealed that there are 500,000 cases of food poisoning every year. \nThey say the research has uncovered a huge variation in food hygiene standards across the country with one in five high or medium risk food establishments failing to meet requirements. \nAlex Neill, Which? managing director of home services, said it was important that something similar to European Union rules on food safety were kept after Brexit. \nHe said: “People expect their food to be safe, but there is clearly still work to be done. \n“As we prepare to leave the EU, the Government and regulators need to ensure that there is a robust, independent system of enforcement in place ​​to give people ​confidence that ​the food they’re eating is hygienic.” Newcastle upon Tyne (Photo: Newcastle Chronicle) \nWhich? based its rankings on the proportion of medium and high risk premises meeting hygiene requirements. \nThey also looked at the proportion of total premises rated for risk and the proportion of planned interventions such as inspections or follow-up actions by local councils. \nThe research reflected whether or not local authorities are fulfilling their role of ensuring food businesses are able to comply with hygiene law. \nAll the data was put together to form its league table. \nSunderland , as well as being fifth overall, was the most improved metropolitan area since a similar survey two years ago. \nResearchers said 95% of the number of food establishments most of risk - termed A B and C - were “broadly complaint” with food regulations while 95.5% of planned interventions were carried out. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now", "external_links": [], "published": "2017-03-27T20:00:00.000+03:00", "crawled": "2017-03-27T15:27:32.990+03:00", "highlightTitle": ""}