{"organizations": [], "uuid": "d6ffd0b9df07a9dcf4d40d5774ada87899baab00", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/30230284/15926097.jpg", "site_section": "http://www.thisisleicestershire.co.uk/specialolympics/rss.html?chid=181121", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/jones-bootmaker-closes-25-stores-with-the-loss-of-262-jobs/story-30230284-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "TomPegden published 262 jobs lost as Jones Bootmaker closes 25 stores", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "TomPegden published 262 jobs lost as Jones Bootmaker closes 25 stores", "spam_score": 0.0, "site_type": "news", "published": "2017-03-27T16:28:00.000+03:00", "replies_count": 0, "uuid": "d6ffd0b9df07a9dcf4d40d5774ada87899baab00"}, "author": "TomPegden", "url": "http://www.leicestermercury.co.uk/jones-bootmaker-closes-25-stores-with-the-loss-of-262-jobs/story-30230284-detail/story.html", "ord_in_thread": 0, "title": "TomPegden published 262 jobs lost as Jones Bootmaker closes 25 stores", "locations": [], "entities": {"persons": [{"name": "jones bootmaker", "sentiment": "negative"}, {"name": "tompegden", "sentiment": "negative"}, {"name": "jones", "sentiment": "none"}, {"name": "hinckley", "sentiment": "none"}, {"name": "glenfield", "sentiment": "none"}, {"name": "will wright", "sentiment": "none"}, {"name": "steve absolom", "sentiment": "none"}, {"name": "barrell", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "hinckley", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}, {"name": "beaumont leys", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "coalville", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "oakham", "sentiment": "none"}], "organizations": [{"name": "brantano", "sentiment": "none"}, {"name": "tony barrell", "sentiment": "none"}, {"name": "redundancy payments office", "sentiment": "none"}, {"name": "brantano retail", "sentiment": "none"}, {"name": "endless llp", "sentiment": "none"}, {"name": "kpmg", "sentiment": "none"}, {"name": "alteri investors", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Comments (0) \nHigh street shoe chain Jones Bootmaker has closed 25 of its stores, with the loss of 262 jobs. \nThe shops have gone as the retailer - which has its headquarters in Leicestershire - was sold to a private equity company called Endless LLP. \nJones, which has a store in Leicester's Highcross and its head office in Hinckley, is one of the oldest brands on the high street. \nThe Highcross store is not affected by the closures. \nThe deal has seen Endless acquire 72 stores, securing about 840 jobs in the UK. \nThe 25 underperforming stores and six concessions which were not part of the sale have closed immediately. \nThe company's previous owners, Alteri Investors, had brought in advisers at KPMG who completed the agreement to sell the majority of the business and assets to Endless. \nWill Wright, partner at KPMG and joint administrator, said: \"We are delighted we have been able to rescue such an iconic UK footwear brand as Jones Bootmaker, including a high proportion of stores and preserving a large number of jobs. \n\"This deal recognises the value of Jones as a strong and popular high street brand with a loyal customer base.\" \nSteve Absolom, joint administrator at KPMG, said: \"Whilst it is always pleasing to preserve a significant number of jobs, sadly a number of redundancies are to be made at the closed stores. \nRead more: Jones Bootmaker put up for sale two years after it was sold to US firm \n\"Over the coming days, our priority is to ensure all employees who have been affected by redundancy receive the information and guidance they need in order to claim monies owed from the Redundancy Payments Office.\" \nOnly last week discount shoe retailer Brantano - which was previously a sister company to Jones and shares the same head office address - went into administration for the second time in a year. \nSome 1,086 jobs were put at risk after the business was hit by factors including the drop in the value of sterling following the Brexit vote. \nA weaker pound means the cost of imports has gone up. \nBrantano operates 73 stores and 64 concessions across the UK. \nIt has 18 stores and 14 concessions within the Midlands employing 244 people. \nCloser to home it employs 33 people in stores and concessions in Leicestershire, including in Beaumont Leys, Coalville, Glenfield and Oakham. \nThe Wheatfield Way head office in Hinckley has an additional 71 staff. \nThe shops continue to operate but job losses are said to be \"inevitable\". \nBrantano Retail was acquired by a Mayfair-based Alteri Investors in February 2016, but has experienced difficult trading conditions, despite \"sustained efforts and streamlining to make it more commercially viable\". \nPwC, which is acting administrator for the business, said: \"A sale of the company was explored and whilst it generated interest, unfortunately it has not been possible to achieve. \"This has resulted in the company being placed into administration.\" \nRead more: Shoe firm made a loss of £4.6m \nTony Barrell, lead administrator at PwC, said: \"Despite significant improvements in the business and reductions in the cost base, trading has continued to suffer in a depressed and competitive footwear market. \n\"Like many other retailers, Brantano has also been hit hard by the sharp decline in sterling, the ongoing shift in consumer shopping habits and the evolution of the UK retail environment. \n\"The administrators are continuing to trade the business as normal whilst assessing the trading strategy and any interest in parts of the business over the coming days and weeks. \n\"However, regrettably, it is inevitable that there will be redundancies. \n\"Staff will be paid their arrears of wages and salaries, and will continue to be paid for their work while the business is in administration.\" \nMr Barrell was previously brought in to run Brantano in January last year when changing consumer habits first took their toll – as shoppers moved away from traditional 'bricks and mortar' stores. \nFollowing the 2016 administration a company controlled by retail restructuring business Alteri Investors – which was also the previous owner – bought a total of 140 stores and concessions. \nLast summer Brantano relocated from headquarters in Coalville to its new offices in Hinckley.", "external_links": [], "published": "2017-03-27T16:28:00.000+03:00", "crawled": "2017-03-27T12:13:57.080+03:00", "highlightTitle": ""}