{"organizations": [], "uuid": "9277ebe791c47ff9530a004b27d12301d0aa0e6f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30205774/15908155.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "Devon Live Editor's Choices RSS feed", "url": "http://www.devonlive.com/summer-looking-sunny-for-english-riviera-s-tourism-industry/story-30205774-detail/story.html", "country": "GB", "title": "Summer looking sunny for English Riviera's tourism industry", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "Summer looking sunny for English Riviera's tourism industry", "spam_score": 0.0, "site_type": "news", "published": "2017-03-15T20:05:00.000+02:00", "replies_count": 0, "uuid": "9277ebe791c47ff9530a004b27d12301d0aa0e6f"}, "author": "TinaCrowson", "url": "http://www.devonlive.com/summer-looking-sunny-for-english-riviera-s-tourism-industry/story-30205774-detail/story.html", "ord_in_thread": 0, "title": "Summer looking sunny for English Riviera's tourism industry", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Summer looking sunny for English Riviera's tourism industry By TinaCrowson   Colourful characters Gary from Stagecoach and Storm from Torquay Museum at the exhibition Summer looking sunny for English Riviera's tourism industry   Comments (0) \nSummer bookings for Devon's biggest resort are looking strong for 2017, a special tourism conference in Torquay heard on Wednesday. Some 300 delegates attended the first conference and exhibition organised by the new English Riviera Business Improvement District Company at the Riviera International Conference Centre. \nThere were some 65 businesses with stands at the exhibition including attractions, events, professional businesses and charities, and one or two colourful characters. \nCompany chairman Torquay hotelier Laurence Murrell said:\" It's really exciting. It's the first event for the new BID company and it's a fantastic display of support for the new company.\" \nThe new business improvement district has only been operating for two months but Mr Murrell said they felt they had set up a strong company. \nREAD MORE: Pedestrian fighting for life after serious crash on Paignton - Live \n\"The prospects for 2017 are very encouraging. The way the pound has dropped since the Brexit referendum has made it much more expensive to go overseas and cheaper for overseas visitors to come to the UK. We have already seen advanced sales for this summer up and we have the new marketing and advertising campaign in place for the BID company.\" \nCarolyn Custerson, chief executive of the BID company said: \"We have had more than 300 delegates register in advance for today with a lot of new businesses coming along for the first time which is great to see. \n\"A lot of businesses are being very positive about the summer season, their is the weakness of the pound and a genuine wish to holiday at home. Businesses are telling us that the summer strong but what we have got to focus on the shoulder months. \nLaurence Murrell \n\"The term time holiday restrictions means family holidays are being restricted to the peak weeks and that just isn't enough for a business. We are remaining a seasonal destination and we need to be year round. \n\"The BID business plan will be focusing on increasing visitor numbers during the quieter months.\" \nREAD NEXT: Public urged to stay away from Devon's whales \nAmong the exhibitors were members of the BMAD charity promoting Paignton Bike Festival, one of the biggest events of the years which attracts tens of thousands of visitors between April 28 and 30. \nKelvin Halloran, left, executive director, said the exhibition had been a useful opportunity to network with other businesses. As the fund-raising festival costs £45,000 each year to stage they need to attract as many people as possible to see the 1,000s of bike and trade stands as well as line up of bands. This year the festival has a new beach bar with different bands playing to those in the main marquee.", "external_links": [], "published": "2017-03-15T20:05:00.000+02:00", "crawled": "2017-03-16T00:14:04.339+02:00", "highlightTitle": ""}