{"organizations": [], "uuid": "fb748e3341e78fadec37d5394ee50f98c524d8a8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12777140.ece/ALTERNATES/s1200/Peter-Scotter-court-case.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/i-dont-want-him-go-12777099", "country": "GB", "domain_rank": 21960, "title": "'I don't want him to go to prison' Muslim mum who had niqab ripped off pleads for attacker's mercy", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "'I don't want him to go to prison' Muslim mum who had niqab ripped off pleads for attacker's mercy", "spam_score": 0.0, "site_type": "news", "published": "2017-03-22T05:01:00.000+02:00", "replies_count": 0, "uuid": "fb748e3341e78fadec37d5394ee50f98c524d8a8"}, "author": "Lucy Thornton", "url": "http://www.chroniclelive.co.uk/news/north-east-news/i-dont-want-him-go-12777099", "ord_in_thread": 0, "title": "'I don't want him to go to prison' Muslim mum who had niqab ripped off pleads for attacker's mercy", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "News 'I don't want him to go to prison' Muslim mum who had niqab ripped off pleads for attacker's mercy The woman attacked by Peter Scotter, 55, of Beach Street, Roker, Sunderland, who ripped off her niqab has asked a judge not to jail him Share Peter Scotter, who will be sentenced after he pulled a niqab off a woman in a shopping centre and yelled \"you are in our country now, you stupid f Muslim\" (Photo: PA) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nA Muslim mum whose niqab veil was ripped off in a hate-filled race attack is pleading for the thug not to go to prison. \nIn a remarkable show of forgiveness towards Peter Scotter, 55, the mother-of-four said she wants him to go free. \nShe also pleaded with post-Brexit Britain to ‘stop the hatred and chill’. \nThe compassionate mum made the decision after hearing her attacker was suffering from a cancerous tumour in his mouth. \nHe is facing a prison sentence but his case was adjourned yesterday (TUE) because of his ill health. \nThe heavy smoker, with 66 previous convictions, has a serious tumour under his tongue which requires urgent surgery. \nThe mum, who is now scared to leave her home, said: “I did not realise that the man had cancer, I don’t want him to go to prison. \n“I would like the judge to bear that in mind when he does sentence him. \n“He did a bad thing in anger, I don’t know why he chose to do what he did to me, it hurt and frightened me but I don’t seek any kind of revenge for that.” \nThe mum, who came to Sunderland from Bangladesh 30 years ago, said she has been scared to leave her home since the ordeal. A woman wearing a niqab - this is not Scotter's victim (Photo: Getty Images) \nBut the 39-year-old said: “I don’t want him to suffer, I would like him to be free to live the rest of his life in peace and tolerance, not in anger and bitterness. \n“Perhaps that is something everyone who shows anger and resentment towards Muslim people in Britain could learn to do - maybe everyone could stop the hatred and chill.” \nScotter attacked her in July last year, 10 days after the Brexit vote. \nHe is now due to be sentenced at Newcastle Crown Court on May 2. \nShe was waiting with her nine-year-old son for her husband outside a store in Sunderland’s Bridges shopping centre when he ‘purposefully’ walked towards her and grabbed her niqab. \nThe force he used almost threw her to the ground, and the niqab came away from her face, exposing her and causing her pain to the neck. \nA witness heard Scotter shout: “Here, take that f***er off, you are in our country now, you stupid f***ing Muslim.” Peter Scotter leaves Newcastle Crown Court (Photo: Nigel Roddis/PA Wire) \nScotter was also heard to say: “Our Britain, you live by our f****ing rules” before coming out with more racist abuse. \nHe has admitted racially aggravated assault and has 66 previous convictions for 157 offences, including actual bodily harm, breaching a Football Banning Order and racially aggravated criminal damage. \nThe mum said the incident happened shortly after the EU vote but she did not know if that had an effect on his behaviour. \nBut she added: “I don’t feel safe any more when I go out. Sometimes I ask my husband to walk ahead of me because I’m so worried that it will happen again and I feel I need him to protect me. Read More Thug who ripped woman's niqab off in racist attack has sentencing delayed \n“I don’t go into town as often as I did but I have been racially abused since the incident, more than once” \nSince the attack she has been sworn at by a woman in a shop and an older man. \n“I get stared at a lot and I can feel people’s hostility. I find that it tends to be the older generation who say things, the younger ones are perhaps more accepting. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now", "external_links": [], "published": "2017-03-22T05:01:00.000+02:00", "crawled": "2017-03-22T00:23:35.435+02:00", "highlightTitle": ""}