{"organizations": [], "uuid": "671eac69323c9e80b955ffe14a7f20f216ba3003", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30185321/15892446.jpg", "site_section": "", "section_title": "", "url": "http://www.devonlive.com/ben-bradshaw-on-next-week-s-budget/story-30185321-detail/story.html", "country": "US", "title": "Ben Bradshaw: I'll be looking for two things as priorities in next week's Budget | Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "Ben Bradshaw: I'll be looking for two things as priorities in next week's Budget | Devon Live", "spam_score": 0.151, "site_type": "news", "published": "2017-03-07T18:23:00.000+02:00", "replies_count": 0, "uuid": "671eac69323c9e80b955ffe14a7f20f216ba3003"}, "author": "Devon Live", "url": "http://www.devonlive.com/ben-bradshaw-on-next-week-s-budget/story-30185321-detail/story.html", "ord_in_thread": 0, "title": "Ben Bradshaw: I'll be looking for two things as priorities in next week's Budget | Devon Live", "locations": [], "entities": {"persons": [{"name": "ben bradshaw", "sentiment": "none"}, {"name": "paul", "sentiment": "none"}, {"name": "paul bull", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "justine greening", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}], "locations": [{"name": "st thomas", "sentiment": "none"}], "organizations": [{"name": "exeter maths school", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "commons health committee", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Comments (1) \nI'll be looking for two things as priorities in next week's Budget. An urgent injection of cash for social care and relief for hard pressed local businesses facing exorbitant increases in their business rates. \nThe Commons Health Committee, which I sit on, warned the Prime Minister last autumn that the funding crisis in health and social care was unsustainable. We appealed for help in the Autumn Statement. None came. Since then, things have got even worse. The Government is allowing local councils to put up council tax by 5% from next month to raise extra money for social care and Conservative-run Devon intends doing this. \nBut, although the increase is more than twice the rate of inflation, it won't make up for the 40% cut we've seen in social care funding since 2010 and demand is increasing all the time. This is putting intolerable pressure on the NHS with hundreds of mainly elderly people stuck in local hospitals because there aren't the care packages in place that would allow them to go home. \nIn my view and the view of MPs from all parties who have looked at this closely, this is the last chance the Government has to inject some much needed extra cash into the system before it collapses completely. But we also need a long term solution to funding health and social care. It would be nice to hear the Chancellor acknowledge that next week. \nRead next: Education Secretary Justine Greening says Exeter Maths School should \"lead the way\" \nMeanwhile, some businesses face astronomical increases in their rates from April because of the Government's failure to do a revaluation for more than seven years. This, at a time when inflation caused by the big devaluation in the pound is beginning to dampen consumer spending. \nOur high streets are also facing increasing competition from on-line retailers. So they're being hit from all sides. Some sort of relief and an assurance that revaluations will happen more regularly in future to avoid these dramatic changes would help. But the messages from the Government have been mixed so far. \nMore widely, the Chancellor has little room for manoeuvre. He has already demanded 6% more cuts in every \"unprotected\" area of Government in this Parliament. Our schools are facing their biggest real-terms cuts in funding since the 1970s. We've already suffered seven years of austerity under the coalition and now Conservative Governments. \nTheir failure to reduce the deficit and the uncertainty caused by Brexit look like prolonging this misery. Any half competent opposition should be making mincemeat of the Government in these circumstances. But that's another story, for another day. \nThe tributes paid from across the political spectrum and from all parts of our community to Paul Bull, friend and Labour councillor, who died last month, are testimony to how loved and appreciated he was. He was out door to door in St Thomas and doing the rest of his council work courageously and selflessly to the end. A true public servant. Paul will be sorely missed. \nRead more: ", "external_links": [], "published": "2017-03-07T18:23:00.000+02:00", "crawled": "2017-03-07T16:03:57.462+02:00", "highlightTitle": ""}