{"organizations": [], "uuid": "b026838c7494396914ea419c025be2109c6f3196", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article10546031.ece/ALTERNATES/s1200/JS77967291.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/nissan-car-firms-need-full-12749620", "country": "GB", "domain_rank": 21960, "title": "Nissan and other car firms need full access to European single market, Labour says", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Nissan and other car firms need full access to European single market, Labour says", "spam_score": 0.0, "site_type": "news", "published": "2017-03-16T17:41:00.000+02:00", "replies_count": 0, "uuid": "b026838c7494396914ea419c025be2109c6f3196"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/nissan-car-firms-need-full-12749620", "ord_in_thread": 0, "title": "Nissan and other car firms need full access to European single market, Labour says", "locations": [], "entities": {"persons": [{"name": "jeremy c", "sentiment": "negative"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "colin lawther", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "stephen martin", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "invalid email  britain", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east  labour", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}], "organizations": [{"name": "nissan", "sentiment": "negative"}, {"name": "labour", "sentiment": "negative"}, {"name": "european customs union", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Nissan and other car firms need full access to European single market, Labour says Jeremy Corbyn accuses the Government of 'holding back the industry' that is a key employer in the North East Share Stephen Martin was asked about special Brexit assurances given to manufacturer Nissan (Photo: Owen Humphreys/PA Wire) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nBritain’s carmakers must be granted full, barrier-free access to the European single market after Brexit, Labour has demanded after talks with unions and workers in the industry. \nJeremy Corbyn accused ministers of “holding back the industry” - a key employer in the North East - and of being reluctant to intervene to support the automotive sector. \nThe industry faces a challenge from Brexit, with many manufacturers having complex supply chains which involve components travelling back and forth across EU frontiers. \nAs well as full single market access, Labour’s plan for the industry’s future involves bringing supply chains back to the UK, giving workers a voice in any new takeovers and improving employment rights. \nThe Opposition also urged the Government to adopt an approach of buying British to help firms based in the country. Read More More high-skilled jobs needed to transform lives in the North East \nLabour leader Mr Corbyn said: “We called this meeting because there is a real risk that this Government is going to let squeamishness about state intervention get in the way of giving the automotive industry and auto workers the support and protection they deserve. \n“The Government is holding back the industry, adding to uncertainty for thousands of families. \n“Labour is committed to doing everything we can to support the automotive sector and those who work in and rely on it, as part of our plan to rebuild and transform Britain.” \nCar maker Nissan announced in October that it was investing in the production of new Qashqai and X-Trail models at Sunderland after receiving Government assurances that EU withdrawal would not affect the plant’s competitiveness. Read More Nissan shows faith in North East with £37m investment in new press \nBut in a sign of concerns in the industry the car giant’s senior vice-president Colin Lawther told MPs in February it would be a “complete disaster” if the delivery of parts to its giant Sunderland plant was disrupted by customs checks as a result of the UK leaving the European Customs Union (CU). Like us on Facebook", "external_links": [], "published": "2017-03-16T17:41:00.000+02:00", "crawled": "2017-03-16T13:27:31.278+02:00", "highlightTitle": ""}