{"organizations": [], "uuid": "01b25d8dcb2179caaf9c7dfa6a77dc464178f2ce", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30236945/15931450.jpg", "site_section": "http://www.middevongazette.co.uk/all-content.rss", "section_title": "Devon Live All Content Feed", "url": "http://www.devonlive.com/david-wheeler-column-exeter-city-winger-on-yeovil-town-comeback-mansfield-game-and-brexit-day/story-30236945-detail/story.html", "country": "GB", "title": "David_Byrom published David Wheeler column: Exeter City winger on Yeovil Town comeback,...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "David_Byrom published David Wheeler column: Exeter City winger on Yeovil Town comeback,...", "spam_score": 0.0, "site_type": "news", "published": "2017-03-29T23:26:00.000+03:00", "replies_count": 0, "uuid": "01b25d8dcb2179caaf9c7dfa6a77dc464178f2ce"}, "author": "David_Byrom", "url": "http://www.devonlive.com/david-wheeler-column-exeter-city-winger-on-yeovil-town-comeback-mansfield-game-and-brexit-day/story-30236945-detail/story.html", "ord_in_thread": 0, "title": "David_Byrom published David Wheeler column: Exeter City winger on Yeovil Town comeback,...", "locations": [], "entities": {"persons": [{"name": "david wheeler", "sentiment": "none"}, {"name": "ollie", "sentiment": "none"}, {"name": "nathaniel clyne", "sentiment": "none"}, {"name": "getty", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "ollie watkins", "sentiment": "none"}, {"name": "gareth bale", "sentiment": "none"}, {"name": "nicola sturgeon", "sentiment": "none"}, {"name": "mansfield", "sentiment": "none"}, {"name": "reuben reid", "sentiment": "none"}, {"name": "jake", "sentiment": "none"}, {"name": "steve evans", "sentiment": "none"}, {"name": "dele alli", "sentiment": "none"}, {"name": "jake taylor", "sentiment": "none"}, {"name": "troy brown", "sentiment": "none"}], "locations": [{"name": "yeovil town", "sentiment": "none"}, {"name": "yeovil", "sentiment": "none"}, {"name": "exeter city", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "newport", "sentiment": "none"}, {"name": "field mill", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}], "organizations": [{"name": "efl", "sentiment": "none"}, {"name": "lloyd james", "sentiment": "none"}, {"name": "leeds", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "scots", "sentiment": "none"}, {"name": "mansfield town", "sentiment": "none"}, {"name": "barnet", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Comments (0) \nWhile we went into Saturday's match against Yeovil desperate to get back to winning ways, having trailed 3-0 going into stoppage time we ended it mightily relieved to escape with a point. \nClearly it's two less than we were hoping for but, at the same time, it was enough to keep us in a play-off place and, what's more, psychologically it could prove invaluable – had we succumbed to a demoralising home defeat and dropped out of the play-off positions for the first time since mid-January then who knows what effect it might have had on the remainder of our season? \nAs it is, having snatched a draw from the jaws of defeat in such spectacular fashion, I think it's fair to say everyone is buzzing and we can't wait to carry on where we left off when we travel to Mansfield at the weekend. \nIn truth, the first half was a bit of a non-event aside from an injury to Jake Taylor, which saw me enter the fray just before half-time. Having had a couple of niggly injuries during the week, I hadn't really trained and we'd decided on Friday I'd start on the bench. While Jake's injury meant I got rather more game time than anticipated, I'm pleased to report I seem to have come through it unscathed and should, fingers crossed, be in contention for a return to the starting line-up at Field Mill. \nRead more: Steve Evans confirms Mansfield Town tried to sign an Exeter City player Picture: Pinnacle \nI thought we began the second half of Saturday's game brightly and had we been a little more clinical in front of goal could have been ahead long before the visitors took the lead just after the hour mark. \nGalling as it was to find ourselves a goal behind, things went from bad to worse over the course of the next 20-odd minutes as we somehow contrived to concede two further goals; pretty much every effort they had seemed to fly into the back of the net leaving us shellshocked. \nIndeed, trailing 3-0 and with just a minute or two of normal time left on the referee's watch, we weren't so much staring defeat in the face as resigning ourselves to the inevitable. Don't get me wrong, we hadn't given up – far from it – but when you find yourselves three goals down at 10 to five on a Saturday afternoon there's normally only one outcome. \nSo much so, I have to admit that when I pulled a goal back in the 89th minute, it didn't occur to me that we might go on to snatch a draw; I was simply pleased to have reduced the damage the Glovers were threatening to do to our goal difference, which, with things being so tight, could prove critical come the end of the season. However, when Troy Brown headed home from a Lloyd James corner little more than a minute later, I think everyone suddenly thought we might, just might, salvage something from the game. Picture: Pinnacle \nAnd that's exactly what happened when Reuben Reid rifled home our third goal in as many minutes to turn what had threatened to be an afternoon to forget into one which will linger long in the memory. \nI was delighted to learn that Ollie Watkins has been shortlisted for the EFL Young Player of the Season award. You won't need me to tell you Ollie has been inspirational this season and it would be fantastic were he to follow in the footsteps of such luminaries as Gareth Bale, Nathaniel Clyne and Dele Alli. \nWhat is more, it would be something that Ollie really deserves – he's a big reason why we're challenging for a play-off place and, take it from me, no-one works harder on the training ground at the Cat & Fiddle. \nRead more: Mansfield Town boss Steve Evans promises his side will be right in Exeter City's face Picture: Getty \nAs regular readers of this column might have anticipated, I wasn't overjoyed with the news that Prime Minister Theresa May has pulled the Article 50 trigger, thereby unleashing a period of great uncertainty for us all and particularly those in Scotland and Northern Ireland, where the majority voted in favour of remaining in the EU. \nIn the circumstances, it's no great surprise that Scotland's first minister, Nicola Sturgeon, is demanding a second independence referendum. For what it's worth, I'd like to see Scotland remain part of the UK, but it's not hard to comprehend why so many of those living north of the border feel differently. \nFor more than a decade the majority of Scots have not voted for the party which has governed over them from Westminster and now, to compound their misery, they face a Brexit they did not support. \nWhile the Scots rejected independence in 2014, I think it's entirely conceivable, if not likely, the result will go the other way if a second referendum is forthcoming. Picture: Pinnacle \nAs I've said more than once over recent weeks, each of our games between now and the end of the season is potentially huge and Saturday's visit to Mansfield, who are a point and two places behind us in ninth, is no exception. \nOur 2-0 victory over the Stags back in December was our first home victory of the season and contributed to the 12-match unbeaten run which saw us climb from the foot of the table into a play-off place. Steve Evans' side have been in pretty good form themselves since the turn of the year – winning nine, drawing four and losing just three of their 16 League Two fixtures – and now the former Leeds boss, who was only appointed in mid November, has had more of an opportunity to impose his philosophy on the side I'm expecting an entirely different test at the weekend. \nThat said, as we've demonstrated this season, we're more than capable of winning anywhere in League Two and, if we perform to the best of our ability, there's no reason why we can't record a 12th away victory of the season at Field Mill on Saturday. If we can do so then that will set us up very nicely indeed for a double-header of home games, against Newport next Saturday (April 8) and Barnet on Good Friday. Here's hoping!", "external_links": [], "published": "2017-03-29T23:26:00.000+03:00", "crawled": "2017-03-29T19:21:47.362+03:00", "highlightTitle": ""}