{"organizations": [], "uuid": "d512eae3ad88aa4b9a310ae8e85fe174f32c88f1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12748953.ece/ALTERNATES/s1200/Brexit.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/liberal-democrat-leader-tim-farron-12748941", "country": "GB", "domain_rank": 21960, "title": "Liberal Democrat leader Tim Farron: Only we can defeat the Conservatives", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Liberal Democrat leader Tim Farron: Only we can defeat the Conservatives", "spam_score": 0.0, "site_type": "news", "published": "2017-03-16T15:17:00.000+02:00", "replies_count": 0, "uuid": "d512eae3ad88aa4b9a310ae8e85fe174f32c88f1"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/liberal-democrat-leader-tim-farron-12748941", "ord_in_thread": 0, "title": "Liberal Democrat leader Tim Farron: Only we can defeat the Conservatives", "locations": [], "entities": {"persons": [{"name": "tim farron", "sentiment": "negative"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "philip hammond", "sentiment": "none"}, {"name": "farron", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "jess phillips", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "stephen hawking", "sentiment": "none"}, {"name": "yvette cooper", "sentiment": "none"}, {"name": "cooper", "sentiment": "none"}, {"name": "ms phillips", "sentiment": "none"}, {"name": "tom blenkinsop", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "liberal party of canada", "sentiment": "none"}, {"name": "national insurance", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "budget", "sentiment": "none"}, {"name": "liberal party", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "tories", "sentiment": "none"}, {"name": "middlesbrough south", "sentiment": "none"}, {"name": "east cleveland mp labour", "sentiment": "none"}, {"name": "snp", "sentiment": "none"}, {"name": "birmingham yardley labour", "sentiment": "none"}, {"name": "tory party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nLiberal Democrat leader Tim Farron says only his party can stop the Conservatives staying in power for the next 25 years. \nLabour is “beyond fixable” because it has been taken over by people who want to be a “hard-left protest group” rather than a potential government, he said. \nAnd it means “he only path to the Tories losing a majority is through the Liberal Democrats”, he said. \nIn an interview with ChronicleLive, Mr Farron said Labour could suffer collapse similar to the rapid decline of the Liberal Party after the first world war, when it was replaced by Labour as the leading party to the left of the Conservatives. \nAnd he said his Liberal Democrats, the successor to the old Liberals, could emulate the success of the Liberal Party of Canada - which came third in elections in 2011 but won a majority in 2015 elections and is currently in power. \nMr Farron said: “In our system, there needs to be a strong alternative counter to the Conservatives, It once was the Liberals, then it was Labour, now it’s nobody. So who’s to say it can’t be the liberals again?” \nHe was speaking on Wednesday afternoon after Labour leader Jeremy Corbyn came under fire for failing to capitalise on the Conservative Government’s dramatic u-turn over National Insurance increases for the self-employed. \nChancellor Philip Hammond announced that the measure, revealed in his Budget less than a week previously, would be scrapped. Jeremy Corbyn (Photo: PA) \nBut critics claimed Mr Corbyn failed to land blows on the Government during his weekly question and answer session with the Prime Minister on Wednesday lunchtime. \nMiddlesbrough South and East Cleveland MP Labour MP Tom Blenkinsop tweeted a video of a footballer missing an open goal. And he said on Twitter: “Serious questions about holding the Govt to account need to be asked.” \nOther Labour MPs compared Mr Corbyn’s performance unfavourably to former leadership contender Yvette Cooper, who mocked the Tories when she had the chance to ask her own question to the Prime Minister. \nBirmingham Yardley Labour MP Jess Phillips Tweeted: “Boom! That’s a question”. Ms Phillips, who previously backed Ms Cooper in the Labour leadership contest, added: “I don’t like to say I told you so, but ” \nMr Farron said that the Government’s decision to announce the u-turn just before Prime Minister’s Questions showed that they did not take Mr Corbyn seriously. \n“The Government thinks they can do a u-turn with impunity,” he said. Read More Lib Dems claim Brexit threatens £60 million EU funding for North East jobs \nOnly the Liberal Democrats could stop the Tories winning a majority at elections to come, he said. \n“If we make small progress then we are left with a Tory government for the next 25 years. \nIf our recovery is, confident, good but slowish then the Tories are in power for 25 years. \n“It needs to be rapid, because the only path to the Tories losing a majority is through the Liberal Democrats now. \n“They can’t lose seats to the SNP, they’ve only got one let. \n“Nobody, not even in the Labour Party, think they [Labour] are going to make any gains off the Tories. \n“Which means the only route to the Tories losing in 2020 or whenever it is through the Liberal Democrat path. \n“We need to come back big if the Tories are to lose.” Read More \nLabour critics might point out that Mr Farron’s Liberal Democrats were part of a Conservative-led Government between 2010 and 2015. \nBut he said the Liberal Democrat’s long-term goal was to lead a government of their own. \n“We are of the view we want to replace the Tory Party,” he said. \n“We need to move into Labour’s space so there can be a decent progressive opposition party. Then we want to beat the Tories.” \nThis may appear a remote possibility, as the Lib Dems have only nine MPs out of 650 in the Commons. \nBut he said: “I am not so un-self awareness that I don’t know that with only nine MPs we are stretching things a bit to say that. \n“But the other UK wide opposition party, with 200 plus MPs, is now beyond fixable. Is now in the hands of an organisation that wants it to be a hard left protest group. \n“That’s fine if that’s what they want to do, but we discovered, shortly after the first world war, what happens when you miss your vocation as a party, you stop standing up for the people you should stand up for. You get replaced by somebody else.” \nLiberal Democrats are calling for a fresh referendum on EU membership, giving the public a choice between accepting a deal agreed between the UK Government and the EU or simply staying in, and Mr Farron said the position had won the party respect even from people who backed Brexit. \n“The policy is that the deal Theresa May comes back with should be put to the British people in good time . . . there should be a referendum on the terms of the deal versus ‘thanks but no thanks. we’ll stay put’.” Read More Stephen Hawking joke backfires on Philip Hammond who seems black hole bound \nHe said the Liberal Democrats had benefitted from taking a clear position while Labour suffered because voters were confused about their stance on Brexit. \n“People who are for us obviously are delighted that someone is fighting their corner on the issue of Brexit. \n“But those who are against us tend to just respect the fact that we are very clear what we think. \n“Labour’s fatal problem is that they are neither fish nor fowl on the biggest issue today.” Like us on Facebook", "external_links": [], "published": "2017-03-16T15:17:00.000+02:00", "crawled": "2017-03-16T11:00:04.498+02:00", "highlightTitle": ""}