{"organizations": [], "uuid": "61bd94e28904a86f96b0c4f30b5b54349a6c0725", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12712380.ece/ALTERNATES/s1200/hammond.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/budget-2017-broken-manifesto-promises-12711789", "country": "GB", "domain_rank": 21960, "title": "Budget 2017 - 'broken' manifesto promises and no Brexit mention - social media response", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Budget 2017 - 'broken' manifesto promises and no Brexit mention - social media response", "spam_score": 0.0, "site_type": "news", "published": "2017-03-08T23:15:00.000+02:00", "replies_count": 0, "uuid": "61bd94e28904a86f96b0c4f30b5b54349a6c0725"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/budget-2017-broken-manifesto-promises-12711789", "ord_in_thread": 0, "title": "Budget 2017 - 'broken' manifesto promises and no Brexit mention - social media response", "locations": [], "entities": {"persons": [{"name": "robert peston", "sentiment": "none"}, {"name": "philip hammond", "sentiment": "none"}, {"name": "berwick anne-marie trevelyan", "sentiment": "none"}, {"name": "anne-marie trevelyan", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "helen goodman", "sentiment": "none"}, {"name": "ross smith", "sentiment": "none"}, {"name": "david schneider", "sentiment": "none"}, {"name": "guy opperman", "sentiment": "none"}, {"name": "catherine mckinnell", "sentiment": "none"}, {"name": "tom blenkinsop", "sentiment": "none"}, {"name": "stu loveland-cooper", "sentiment": "none"}, {"name": "tim montgomerie", "sentiment": "none"}, {"name": "chi onwurah", "sentiment": "none"}, {"name": "david cameron", "sentiment": "none"}, {"name": "anna turley", "sentiment": "none"}, {"name": "hammond", "sentiment": "none"}, {"name": "grahame morris", "sentiment": "none"}, {"name": "sharp", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "national insurance", "sentiment": "none"}, {"name": "itv", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "north east england chamber of commerce", "sentiment": "none"}, {"name": "hexham", "sentiment": "none"}, {"name": "berwick", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "middlesbrough south", "sentiment": "none"}, {"name": "newcastle north", "sentiment": "none"}, {"name": "newcastle central", "sentiment": "none"}, {"name": "northern powerhouse", "sentiment": "none"}, {"name": "east cleveland", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "redcar", "sentiment": "none"}, {"name": "whitehall", "sentiment": "none"}, {"name": "bishop auckland", "sentiment": "none"}, {"name": "easington grahame morris  easington", "sentiment": "none"}, {"name": "apd", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily   Thank you for subscribing!   \nIt was a Budget that left people both on the left and right distinctly underwhelmed on the whole. \nMuch of what Chancellor Philip Hammond had to say had been previewed either in the press or by Prime Minister Theresa May just minutes before his speech in PMQs. \nAnd there were no ‘rabbits’ pulled out of the hat. \nWell known right wing political commentator Tim Montgomerie tweeted this: “No tax simplification. No big infrastructure boost. No Whitehall reform. No Universal Credit relief. No imagination”. \nWhat also struck many observers was the fact that a particular word which has so much bearing on government plans over the next few years was not uttered. Catherine McKinnell \nAs Newcastle North MP Catherine McKinnell put in her tweet: “This budget may be remembered for what was missing, rather than for what it contained. I don’t think he even mentioned Brexit.” \nConfirmation came from Labour’s Bishop Auckland MP Helen Goodman. “Not one word on #Brexit in #Budget !!! Amazing!” \nJust to be on the safe side, here’s Newcastle Central MP Chi Onwurah, also on twitter. “This was the Brexit budget which didn’t mention Brexit. Hammond said he’d put ‘fuel in the tank’, clearly he has no idea where were going...” \nWhile the word Brexit did not pass the Chancellor’s lips, the words North East did. And we’re not talking about its usual mention, lumped in with the Northern Powerhouse. Ross Smith, North East England Chamber of Commerce director of policy \nSharp eared Ross Smith of the North East England Chamber of Commerce heard it. “Productivity has grown fastest in the North East, confirms the Chancellor. Credit to @NEEChamber members who’ve delivered this.” \nBut what about the rest of the Budget? \nWell for the last few days we’ve reminding the Government of previous PM David Cameron’s pledge over Air Passenger Duty. \nWith talk of the Scottish parliament abolishing it, he spoke of not allowing such an unfair advantage to occur. \nNow the Scots are seriously talking about getting rid of a tax which can up the cost between £75 and £450 a passenger, Newcastle airport bosses are a bit perturbed. \nWould the Chancellor allay their fears today? No, was the short answer. \nCatherine McKinnell summed it up in her tweet: “Hugely disappointed by Govt’s failure to support @NCLairport in face of APD devolution: a vital part of any Northern Powerhouse.” Labour MP for Easington Grahame Morris \nEasington MP Grahame Morris was not impressed with the substance of the speech. \n“The Tories are choosing to hit the most vulnerable in our society, while those at the top get tax breaks.” \nMr Hammond made much about putting up £2bn to deal with the country’s social care crisis. \nPeople weren’t as impressed as perhaps he thought they might be. \nFirst, as Middlesbrough South and East Cleveland MP Tom Blenkinsop tweeted: “The extra funding for social care implicitly carries an admission that there is a social care crisis, caused by 7 yrs of Tories.” Tom Blenkinsop \nAnd as social care funding has reportedly been cut by £4.6bn since 2010, others did the maths. \nIncluding well known writer and actor David Schneider who tweeted: “Hammond: “We will give £2bn over the next 3 years for social care making a grand total of minus £2.5bn since we took power”. \nAnother contentious issue was Mr Hammond saying that National Insurance for the self employed is to go up to 11% by 2019. Read More \nFirst, as - presumably - self employed Stu Loveland-Cooper tweeted: “If the Tory party won’t look after the self employed who will? No holiday pay. No paternity and now higher taxes. Lost my vote.” \nEven the Conservative MP for Berwick, Anne-Marie Trevelyan was concerned. Conservative MP for Berwick Anne-Marie Trevelyan \n“Worried about raising NI on self-employed. They are the risk-takers, starting next gen business leaders, no stat sick leave or holiday pay.” \nA more serious suggestion was made by a number of people including ITV’s political editor Robert Peston who tweeted: “Increase in Class 4 National Insurance to 11% for self-employed by 2019 raises £645m a year: looks clear breach of Tory manifesto pledge.” \nChi Onwurah was not happy about Mr Hammond offering free transport to disadvantaged pupils who go to grammar schools Read More Budget 2017 LIVE: Updates, analysis and North East reaction to Philip Hammond's announcements \n“So if you go to your local comprehensive your parents pay your bus fares, if you go to a grammar school Govt pays them for you,” she tweeted. \nWas anybody happy? Guy Opperman, Tory MP for Hexham, was struck by one claim made by Mr Hammond. \nHe tweeted: “Changes since 2010 - top 1% now pay highest tax ever - 27% of all tax raised #Budget2017 - higher than ever before #fairness.” \nHowever Anna Turley, Labour MP for Redcar concluded: “Is that it?! A paper thin budget that sees the debt up £100bn does nothing to tackle economic inequality & which hits self-employed. Poor.” Like us on Facebook", "external_links": [], "published": "2017-03-08T23:15:00.000+02:00", "crawled": "2017-03-08T18:43:17.363+02:00", "highlightTitle": ""}