{"organizations": [], "uuid": "b02e84c21663f624cc2e866ff96be4e9e7fb678f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30218398/15917616.jpg", "site_section": "http://www.middevongazette.co.uk/all-content.rss", "section_title": "Devon Live All Content Feed", "url": "http://www.devonlive.com/fsb-makes-connectivity-plea-as-corbyn-hits-town/story-30218398-detail/story.html", "country": "GB", "title": "HannahFinch published FSB makes connectivity plea as Corbyn hits town", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "HannahFinch published FSB makes connectivity plea as Corbyn hits town", "spam_score": 0.0, "site_type": "news", "published": "2017-03-21T20:33:00.000+02:00", "replies_count": 0, "uuid": "b02e84c21663f624cc2e866ff96be4e9e7fb678f"}, "author": "HannahFinch", "url": "http://www.devonlive.com/fsb-makes-connectivity-plea-as-corbyn-hits-town/story-30218398-detail/story.html", "ord_in_thread": 0, "title": "HannahFinch published FSB makes connectivity plea as Corbyn hits town", "locations": [], "entities": {"persons": [{"name": "corbyn", "sentiment": "none"}, {"name": "peter rigby", "sentiment": "none"}, {"name": "mike cherry", "sentiment": "none"}, {"name": "frances o' grady", "sentiment": "none"}, {"name": "rt hon greg clark", "sentiment": "none"}, {"name": "mrs wilkinson", "sentiment": "none"}, {"name": "ann vandermeulen", "sentiment": "none"}, {"name": "dawlish  mrs wilkinson", "sentiment": "none"}, {"name": "dawlish", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "susan wilkinson", "sentiment": "none"}, {"name": "matt roach", "sentiment": "none"}, {"name": "clark", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "blackdown hills", "sentiment": "none"}, {"name": "somerset", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "exeter airport", "sentiment": "none"}, {"name": "plymouth airport", "sentiment": "none"}, {"name": "torquay", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "north devon", "sentiment": "none"}, {"name": "dawlish", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "cowley bridge", "sentiment": "none"}], "organizations": [{"name": "fsb", "sentiment": "none"}, {"name": "fsb conference", "sentiment": "none"}, {"name": "federation of small businesses", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "tuc", "sentiment": "none"}, {"name": "fsb devon", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "cornwall fsb", "sentiment": "none"}, {"name": "peninsular rail task force", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "FSB makes connectivity plea as Corbyn hits town By HannahFinch | Posted: March 21, 2017 0 COMMENTS SHARES Labour leader Jeremy Corbyn will be at the FSB Conference in Torquay on Thursday FSB makes connectivity plea as Corbyn hits town X \nCopy link to paste in your message / Comments (0) \nBusiness leaders across the South West have issued a 'spades in the ground' plea to end gridlock and digital not-spots. They want to see action on rail and road connectivity and real progress on superfast broadband across the region. \nIt comes as Labour leader Jeremy Corbyn and Rt Hon Greg Clark MP, Secretary of State for Business, Energy and the Industrial Strategy address the FSB Conference to be held in Torquay on Thursday. \nThey are expected to set out their rival visions on the importance of small businesses to the economy, as the UK prepares to leave the EU. The national conference will play host to small businesses from right across the UK. \nSusan Wilkinson, development manager at FSB Devon, said it is an ideal time to put forward the case for the South West. She said: \"We are delighted that such high profile figures are coming to Torbay and how important it is for our businesses to see them both here. \n\"For the Devon region, we are looking forward to hearing how they can support South West businesses and infrastructure continues to be the main priority.\" \nThe 20-year plan to secure the rail network, compiled by the Peninsular Rail Task Force, is currently being considered by the Government.But with high tides forcing the cancellation of services again this winter, the need to improve the line at vulnerable areas like Dawlish and Cowley Bridge near Exeter, need to be addressed as a matter or urgency. \nWatch what it's like being inside the driver's cab as gigantic wave batters train at Dawlish \nMrs Wilkinson said: \"We need to see that work actually started to ensure that 2014 never happens again. For businesses in Devon it will only be real when digging starts.\" \nRead next: Dawlish rail line collapse - three years on \nAnd improvement works for the A303 will be a real boost for the region's economy, she said. \"For many years the M5 has been the main road into the area, so widening the A303 would also be key to show the Devon businesses they are finally being supported, although again it's not words we really want but spades in the ground.\" \nAnd she has called for the resurrection of plans to link Exeter Airport with heliports in both Plymouth and Barnstaple. Currently, the future of Plymouth Airport is in doubt, with Exeter Airport boss Matt Roach saying there is 'no prospect' of it re-opening. But perhaps plans to create a heliport at Plymouth - first mooted by Exeter airport owner, Sir Peter Rigby, in 2013 , could be revisited, she said. \"It could be just the solution we need to bring back an air route to Plymouth and North Devon\". \nThe phase II of the Connecting Devon and Somerset broadband deal is now under way with the region's first fibre to premises service being rolled up in some of the remotest villages in the Blackdown Hills. But longer term, \"We want nothing short of 100% coverage for our businesses,\" insisted Mrs Wilkinson. \nThe visit by Mr Clark comes as the government consults on the Industrial Strategy , a long term plan to prepare the UK post-Brexit. New research by the Federation of Small Businesses shows that small businesses across the South West believe the UK must strike a comprehensive free trade deal with the EU as part of Brexit proceedings. \nThe Keep Trade Easy report also reveals the threat that the introduction of new tariffs following Brexit poses to the South West. Cornwall FSB Development Manager, Ann Vandermeulen, said: \"This important report shows our members want the security of knowing that it will be just as easy in the future to trade successfully and cheaply with our EU colleagues and they are not saddled by tariffs and extra red tape.\"Here in the South West we find we are already behind other parts of the country in terms of the amount we export and we don't want the current uncertainty to deter even more businesses from taking the plunge into the export market.\" \nRead next: Our #backthesouthwest campaign is back \nThe FSB National Business Show and Conference is being held at the English Riviera Conference Centre from March 23 - 25 and will also include advice and support for businesses owners and those thinking of setting up their own business.There will be round table discussions with economic leaders and an address by TUC General Secretary, Frances O' Grady. \nFSB National Chairman, Mike Cherry, said:\"\"Although Brexit is clearly the backdrop to the business agenda, there are also a number of domestic issues and challenges for smaller businesses and the self-employed. In particular there are the challenges of the increased costs of doing business for small firms. I look forward to hearing the ideas of our guests on how to develop further a pro-business environment, in which firms can thrive and grow.\" News", "external_links": [], "published": "2017-03-21T20:33:00.000+02:00", "crawled": "2017-03-21T17:18:39.269+02:00", "highlightTitle": ""}