{"organizations": [], "uuid": "0e529b65bdc4c9b4a6a33b69a4b8fa80528823df", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12822644.ece/ALTERNATES/s1200/SSR_NEC_300317pspo.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/sunderland-city-centre-set-anti-12822055", "country": "GB", "domain_rank": 21960, "title": "Sunderland city centre set for anti-social behaviour crackdown", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Sunderland city centre set for anti-social behaviour crackdown", "spam_score": 0.0, "site_type": "news", "published": "2017-03-31T15:00:00.000+03:00", "replies_count": 0, "uuid": "0e529b65bdc4c9b4a6a33b69a4b8fa80528823df"}, "author": "Sean Seddon", "url": "http://www.chroniclelive.co.uk/news/north-east-news/sunderland-city-centre-set-anti-12822055", "ord_in_thread": 0, "title": "Sunderland city centre set for anti-social behaviour crackdown", "locations": [], "entities": {"persons": [{"name": "jamie southwell", "sentiment": "negative"}, {"name": "harry trueman", "sentiment": "negative"}], "locations": [{"name": "sunderland", "sentiment": "none"}, {"name": "chester road", "sentiment": "none"}, {"name": "sunderland city centre", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "mowbray park", "sentiment": "none"}], "organizations": [{"name": "northumbria police", "sentiment": "negative"}, {"name": "sunderland city council", "sentiment": "none"}, {"name": "© north news & pictures ltd", "sentiment": "none"}, {"name": "university of sunderland", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "safer sunderland partnership", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Councillor Harry Trueman and Northumbria Police’s Neighbourhood Inspector Jamie Southwell with one of the signs (Photo: © North News & Pictures ltd) Share Get     \nA scheme to reduce anti-social behaviour in Sunderland will go live next Monday. \nThe city centre will be covered by a ‘public space protection order’ (PSPO), which is designed to reduce nuisance activities. \nEnforced by Northumbria Police, the order will crack down on drinking alcohol in public, “chugging” and begging. \nThe order allows enforcement through advice, warnings to stop and desist and issuing £75 Fixed Penalty Notices. \nPSPOs, which have already been introduced in cities and towns across the country, were introduced under the Anti-Social Behaviour, Crime and Policing Act 2014. \nSunderland City Council’s cabinet approved the introduction of the policy in February after a consultation which found broad support for the idea. Mowbray Park in Sunderland City Centre (Photo: Newcastle Chronicle) \nCouncillor Harry Trueman, deputy leader of Sunderland City Council and chair of the Safer Sunderland Partnership, said: “This order is about replacing current controls on the drinking of alcohol in public places and matters such as dog fouling and the keeping of dogs on leads. \n“The order is a deterrent to anti-social behaviour and also about controlling and restricting the sort of behaviour that a minority of people engage in and that the majority of people find unacceptable. \n“It is all about allowing people to enjoy open public spaces free from nuisance and anti-social behaviour and ensuring central Sunderland is a pleasant place to work in, to live in, and to visit.” Read More Everything you need to know about new Sunderland council boss \nThese are the main sorts of anti-social behaviour the police will now have greater power to try and prevent: Alcohol control: police and authorised officers have the power to confiscate alcohol in a public space excluding licensed premises where they believe it is causing or is likely to cause anti-social behaviour Begging: restricts any person engaging in anti-social/nuisance behaviour while begging. Begging includes any passive and active methods, including but not limited to, non-verbal signs, hand held out, written notice, or verbal attempts to exhort, press, pressure, urge the giving of material help, assistance, food or money Bin raking: restricts any person engaging in bin raking. Bin raking is the searching and taking of any items whatsoever from rubbish bins, bags or items clearly left to be disposed of or belonging to another Street trading and peddling: restricts any person engaging in anti-social/nuisance behaviour while street trading Dog control: prohibits dog fouling, exclusion of dogs to play areas and dogs on lead by direction Skateboard and cycles: prevents the anti-social use of skateboards, cycles and stunt cycles causing damage to property, or nuisance or annoyance to one or more persons Psychoactive substances: restricts any person eating, drinking, inhaling, injecting, smoking or otherwise taking any psychoactive substance in a public place. \nNorthumbria Police’s neighbourhood inspector Jamie Southwell, who covers Sunderland city centre, said: “We welcome the introduction of this Public Space Protection Order and see it as a huge milestone in our efforts to make the city centre even safer. \n“For far too long people living, working and visiting the city centre have had to put up with the anti-social behaviour of a small minority and on occasions this behaviour has been aggressive and intimidating. Read More Sunderland - a city still divided over Brexit as the UK enters the unknown \n“We carry out regular patrols throughout the city centre and if we see anyone breaching the order we will take action.” \nThe three year order includes the city centre, Mowbray Park, Sunniside, and the University of Sunderland site on Chester Road. \nIt could be rolled out to other areas in the future. Like us on Facebook", "external_links": [], "published": "2017-03-31T15:00:00.000+03:00", "crawled": "2017-03-31T10:17:32.594+03:00", "highlightTitle": ""}