{"organizations": [], "uuid": "d842cb2d8d11bbbe5fd58f03d53804f29d217c7f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12806223.ece/ALTERNATES/s1200/March-for-Europe.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/nick-clegg-voters-turn-against-12805835", "country": "GB", "domain_rank": 21960, "title": "Nick Clegg: Voters will turn against Brexit when they realise they've been lied to", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Nick Clegg: Voters will turn against Brexit when they realise they've been lied to", "spam_score": 0.0, "site_type": "news", "published": "2017-03-28T23:00:00.000+03:00", "replies_count": 0, "uuid": "d842cb2d8d11bbbe5fd58f03d53804f29d217c7f"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/nick-clegg-voters-turn-against-12805835", "ord_in_thread": 0, "title": "Nick Clegg: Voters will turn against Brexit when they realise they've been lied to", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "negative"}, {"name": "nick clegg", "sentiment": "negative"}, {"name": "johnson", "sentiment": "none"}, {"name": "michael gove", "sentiment": "none"}, {"name": "clegg", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "nigel farage", "sentiment": "none"}, {"name": "boris johnson", "sentiment": "none"}, {"name": "nick cleg", "sentiment": "none"}, {"name": "gove", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}], "organizations": [{"name": "brexit", "sentiment": "negative"}, {"name": "european union", "sentiment": "none"}, {"name": "pa wire", "sentiment": "none"}, {"name": "liberal democrats", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily   Thank you for subscribing!   \nLeave voters could turn against Brexit when it becomes clear they have been “lied” to, according to former Deputy Prime Minister Nick Cleg g. \nHe said Brexit could still be stopped, by offering the public a second referendum when it becomes clear what sort of deal Prime Minister Theresa May has negotiated with the rest of the EU. \nMr Clegg, a former leader of the Liberal Democrats and now the party’s Brexit spokesman , said some of those who voted to leave would be angry when it became clear quitting the EU wasn’t going mean an end to immigration or provide huge sums of money for the health service. \nHe also insisted it was wrong that older voters had robbed young people of “their right to travel and study and work across Europe”. Nick Clegg (Photo: PA) \nIn an interview with ChronicleLive, he said: “You could, and I’m only saying this tongue in cheek, you could make a case that when a country takes a massive decision by way of a referendum about its future, the votes of those who have that future should be weighted more heavily than those who bluntly aren’t going to be around for very long. \n“Particularly when the discrepancy is so great. It wasn’t as if young people stayed at home. \n“It was a 62% turnout for 18 to 24-year-olds. And of those, 70% [voted to stay in]. That was a massive, massive vote.” \nMr Clegg suggested younger people, aged 16 and 17, should have a vote in any second referendum. Under-18s were barred from voting in last year’s referendum. \nHe said he was “angry” at politicians like Boris Johnson and Michael Gove, leading Conservative ‘Leave’ campaigners, and former UKIP leader Nigel Farage. Placards and flags are held by pro-EU protesters (Photo: PA) \n“I have a huge problem with the leaders who wilfully lied to voters, knowing that they would not be held to account,” said Mr Clegg. \nThe former Deputy Prime Minister knows what it’s like to come under fire, after being heavily criticised for increasing student tuition fees when in Government despite promising to oppose them during the 2010 general election. \nHe said: “Heaven knows I’ve been held to account pretty brutally for the things I have done or failed to do. That’s what happens in a democracy. \n“Johnson, Gove, Farage and all these people knew that they could make stuff up and the truth would never catch up with them because they’re not going to give the British people another chance to look at this. \n“That angers me, but I also I think a lot of people will feel ‘hang on, I was sold this under a false prospectus’.” \nMrs May triggering Article 50 on Wednesday would mark “a very important turning point” in the debate over Brexit because the UK would have to confront “the cold reality of negotiating with 27 other Governments and parliaments”, he said. Boris Johnson (Photo: PA Wire) \nAnd it would become clear that promises made during the EU referendum campaign were just not true - including the claim on the official Leave campaign bus that Brexit could provide an extra £350m a week for the NHS. \nMr Clegg said: “The gap between what people have been led to believe is going to happen and what will actually be delivered is so great. \n“Not just that great lie emblazoned on the bus. But cutting VAT. Immigration would evaporate as a problem. A cornucopia of new trade deals would be signed, even before we left the European Union. All would be well, we’d still be able to work effectively against criminals on a cross broader basis. \n“These things, some or all of them, are not going to be remotely delivered upon. \n“That and a sense that the Government is completely and utterly obsesses by Brexit, whilst the care homes and the schools and hospitals in local communities are suffering ... I think that could actually have an effect on public opinion.” Read More Brexit warning for North East as Theresa May prepares to trigger Article 50 \nLiberal Democrats will be calling for a second referendum when the details of Brexit become clear. \nAnd while the party insists it has an open mind, it appears set to call for voters to be offered the option of staying in the EU after all. \n“If at that point the British people say that is not what you told us we’d get, then all options are on the table including staying in.” \nBut Mr Clegg said he also believed that disillusionment with Brexit could spark a dangerous backlash, with some voters embracing “ever more extreme” politics. \n“Where will their anger go then? \n“The worry in the next few years a lot of people who voted Brexit in the belief that this was going to be the solution to a lot of complex problems, from housing to immigration ... when they feel those raised expectations have not been met, my worry is they will turn to people with ever more extreme solutions.” \nFor the Lib Dems, coming out as the party which firmly opposes Brexit is paying dividends. \nThe party points to a series of local council by-election wins as evidence that support is growing. \nMr Clegg said he still would much prefer Brexit wasn’t happening, but added: “I thought this was going to happen anyway, but it’s now a racing certainty that we are going to do much better in the general election than people may have anticipated even a short while ago.” Read More", "external_links": [], "published": "2017-03-28T23:00:00.000+03:00", "crawled": "2017-03-28T18:25:15.294+03:00", "highlightTitle": ""}