{"organizations": [], "uuid": "0844e3c5242983cd6f4a749f47b622e069509dc2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12714018.ece/ALTERNATES/s1200/Donald-Trump.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/news-opinion/how-can-resist-slippery-slope-12714027", "country": "GB", "domain_rank": 21960, "title": "How can we resist the slippery slope to tyranny in this post-truth world?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "How can we resist the slippery slope to tyranny in this post-truth world?", "spam_score": 0.0, "site_type": "news", "published": "2017-03-09T04:00:00.000+02:00", "replies_count": 0, "uuid": "0844e3c5242983cd6f4a749f47b622e069509dc2"}, "author": "Kate Thick", "url": "http://www.chroniclelive.co.uk/news/news-opinion/how-can-resist-slippery-slope-12714027", "ord_in_thread": 0, "title": "How can we resist the slippery slope to tyranny in this post-truth world?", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "negative"}, {"name": "trump", "sentiment": "none"}, {"name": "rupert murdoch", "sentiment": "none"}, {"name": "timothy snyder", "sentiment": "none"}], "locations": [{"name": "usa", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "turkey", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "planet trump", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "metropolitan police", "sentiment": "none"}, {"name": "fox news", "sentiment": "none"}, {"name": "yale university professor of history", "sentiment": "none"}, {"name": "getty images north america", "sentiment": "none"}, {"name": "houses of parliament", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "sky tv", "sentiment": "none"}, {"name": "pa", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "President Donald Trump disembarks Air Force One (Photo: AP Photo/Alex Brandon) Share Get daily   Thank you for subscribing!   \nIf you are not completely baffled then you don’t understand, I thought, wrapped in my sleeping bag, gazing at the stars from the roof of my van parked in the middle of nowhere. \nThe Oxford English Dictionary named “post-truth” as 2016’s word of the year: “Relating to or denoting circumstances in which objective facts are less influential in shaping public opinion than appeals to emotion and personal belief.” \nAccepting untruth requires a blatant abandonment of reason. \nA trusted friend confided over lunch recently that he too felt powerless to effect change; sometimes that’s all it takes to help you regain your bearings and jump off the van roof onto Planet Trump’s terra infirma. \nHow to resist the slippery slope to tyranny in a post-truth world, that is the question I directed at the stars. \nMy fear is that post-truth is pre-fascism. A shift toward publicly-backed authoritarianism is preceded by the decay of democracy, human rights and the rule of law. European history – where a leader or a party claimed to give voice to the people and promised to protect them from existential threats - shows societies can break, ethics collapse and ordinary people can find themselves in unimaginable circumstances. Your vote can get you more than you bargained for. U.S. President Donald Trump (Photo: Getty Images North America) \nMaybe the current brand of populist politics – imbued with nationalism and protectionism – is an attempt to pull up the drawbridge in the face of possible meltdown from climate change, the proliferation of weapons, failed states and mass migration. But withdrawal has fostered aggression. \nIt is astonishing how easy it is for simplistic, distorted, demonising and manipulative rhetoric to stoke fear and the darker aspects of human nature. \nMetropolitan Police statistics reveal a steep increase in almost all forms of hate-related crime. How do you retain even a shred of conscience and morality in a society that has so effectively “normalized” violence? \nJingoistic propaganda legitimises the perpetration of violence against the Other. We are told there are ‘barbarians at the gate’; strategies from the war on terror have already been transplanted into domestic law enforcement. \nElements of the press are becoming an extension of the consumer society. Trump and his ilk are skilful marketers, wielding their ruthless opportunism through the media to ‘advertise’ their fictitious selves and slogans. Many in the news industry wonder how to overcome the partisanship that is taking hold in both print and online media. \nIn his book entitled On Tyranny, the Yale University Professor of History, Timothy Snyder, wrote, “Believe in truth. To abandon facts is to abandon freedom. If nothing is true, then no one can criticise power, because there is no basis upon which to do so. The biggest wallet pays for the most blinding lights.” Sky HD TV remote control (Photo: PA) \nRupert Murdoch has just submitted a takeover bid for Sky TV ; will UK broadcasting regulation ‎continue to insist that Sky News - under whatever ownership - remains fair and impartial unlike Fox News in a deregulated USA? Fake news is not yet prevalent here, but it could become so. \nWhat is ‘truth’ in a hardened, market-led world? Facts alone cannot trump (pun intended) disinformation, paranoia and self-interest. Reportage about ordinary people resisting oppression and tyranny, and narratives on the humanity of the demonised is needed more than ever … right on the front page. Read More Beware the patriotism peddled by scoundrels at home and abroad \nA return to a pre-Brexit, pre-Trump world would not resolve the fundamental discontent with neo-liberal policies despite the latter’s success in lifting millions from poverty, nor would it curtail the rise of nationalist populism. The gilded age ended with a bank crash, opening the cracks to an avaricious elite, austerity, the disenfranchised. European workers including nurses, social workers and teaching assistants protest outside the Houses of Parliament in London before lobbying MPs over their right to remain in the UK (Photo: PA) \nFree speech has not levelled hierarchies or reduced xenophobia. Tyrants and narcissists are wrecking the potential of social media as a democratising power, but if the human mind can adjust and accommodate itself to injustice and violence, it can be reasoned away from them too. \nBetter rhetoric and argument must up the ante. We can expose the fraudulence and lies of ultra-rightwing opportunists. Unlike Russia, Turkey, China and parts of Europe, we are unlikely to be shot or imprisoned for it. \nThe problem is not those that abuse and accumulate wealth and power but, from Sunderland to Singapore, how selfish and easily cowed the rest of us can be. \nMore than 1,000 human rights defenders were killed, detained, or subjected to smear campaigns and other violations in 2016. Most of the 74 journalists killed in 2016 were victims of “deliberate, targeted violence,” according to Reporters Without Borders. \nA set of post-capitalist principles around a fairer, greener, demilitarised world is up for grabs; advocates exist but their voices are drowned out. \nNever perhaps has independent journalism mattered more. It is one of the few tools we have to hold power to account. \nUndaunted by sniper fire, a street artist in Syria painted “Hope”, a mural, on a slab of roof hanging precariously over streets laid waste by years of bombing. Motivated by a belief in democratic governance, his murals crop up randomly like wildflowers, adorning the ruins of what once were homes, schools and hospitals - acts of defiance, stars shining into the pain of the present. Like us on Facebook", "external_links": [], "published": "2017-03-09T04:00:00.000+02:00", "crawled": "2017-03-08T23:53:48.194+02:00", "highlightTitle": ""}