{"organizations": [], "uuid": "5f392ec1f75d098a7973502ba66ec73c812d8e76", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12764840.ece/ALTERNATES/s1200/easyJet-profits.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/cost-travelling-europe-goes-up-12773087", "country": "GB", "domain_rank": 21960, "title": "As the cost of travelling to Europe goes up - here's how to beat Brexit when it comes to holidays", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "As the cost of travelling to Europe goes up - here's how to beat Brexit when it comes to holidays", "spam_score": 0.0, "site_type": "news", "published": "2017-03-21T20:00:00.000+02:00", "replies_count": 0, "uuid": "5f392ec1f75d098a7973502ba66ec73c812d8e76"}, "author": "Michael Muncaster", "url": "http://www.chroniclelive.co.uk/news/north-east-news/cost-travelling-europe-goes-up-12773087", "ord_in_thread": 0, "title": "As the cost of travelling to Europe goes up - here's how to beat Brexit when it comes to holidays", "locations": [], "entities": {"persons": [{"name": "emma coulthurst", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "krakow", "sentiment": "none"}, {"name": "east asia", "sentiment": "none"}, {"name": "greece", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}, {"name": "bucharest", "sentiment": "none"}, {"name": "indonesia", "sentiment": "none"}, {"name": "vilnius", "sentiment": "none"}, {"name": "turkey", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "cancun", "sentiment": "none"}, {"name": "riga", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "mediterranean", "sentiment": "none"}, {"name": "tallinn", "sentiment": "none"}, {"name": "budapest", "sentiment": "none"}, {"name": "bratislava", "sentiment": "none"}, {"name": "prague", "sentiment": "none"}, {"name": "tenerife", "sentiment": "none"}], "organizations": [{"name": "homeexchange.com", "sentiment": "none"}, {"name": "legoland", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "newcastle airport", "sentiment": "none"}, {"name": "civil aviation authority", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "fco", "sentiment": "none"}, {"name": "travelsupermarket.com", "sentiment": "none"}, {"name": "atol", "sentiment": "none"}, {"name": "homesforexchange.com", "sentiment": "none"}, {"name": "travelsupermarket", "sentiment": "none"}, {"name": "playa de los cristianos", "sentiment": "none"}, {"name": "butlins", "sentiment": "none"}, {"name": "travelex", "sentiment": "none"}, {"name": "air travel organisers", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nSince the EU referendum last June, travelling to Europe has become a lot more expensive. \nFigures from Travelex show the average family holiday cost £2,333 in 2016 but has risen to £2,851 this year - an 18.2% increase. \nBut experts say holiday markers can beat the surge by booking smart and planning ahead. \nBelow is all you need to know about travelling abroad and how to get the best for your pound. 1. Beat exchange rate worries and go all inclusive A plane leaving Newcastle Airport (Photo: Owen Humphreys/PA Wire) \n“Go all inclusive to ensure that you lock in a good price, avoid poor exchange rates and not have to worry about spending a lot extra”, says TravelSupermarket’s Emma Coulthurst. \n“Use a comparison website to compare prices across the package holiday market. \n“TravelSupermarket search data shows that 3 or 4* all inclusive short haul are the most popular searches for both couples and families this summer, even more popular than last year.” \nIf you’re booking half board or know you’ll be shopping abroad, opt for a fee free credit or prepaid card. When in store, beware of the double exchange rate dupe. \nIf you let the seller in a shop or restaurant covert the price back into pounds, they will choose their own exchange rate and you’re more likely to be on the less favourable end of the deal. 2. Follow the strong pound \nChoose locations where the exchange rate against GBP is good and the cost of living is low such as East Asia, Mexico, Indonesia. \nMexico’s peso is the only currency weaker against the Pound than a year ago, making it ideal if looking for a long-haul bargain. \nThe best time to go to Cancun is November through to the end of April. So, book that winter sun treat in early. 3. Off to Spain? You might want to reconsider Playa de los Cristianos in Tenerife, Spain (Photo: PA) \nThere has been talk of prices of hotels in Spain going up this year due to exchange rates and huge demand. \nLast year, Spain, the most popular destination to compare prices for on TravelSupermarket.com , saw a 38% year on year surge in search. \nThis year, the eastern Mediterranean is hitting back with great-priced package holidays and low resort costs. \nHolidays in Turkey and Greece are 22% to 64% cheaper to visit than Spain this year as Brits continue to flock to the south. But, branch out, and you’ll be quids in. 4. Avoid the euro An easyJet plane (Photo: PA) \nConsider non-euro cities like Prague, Krakow, Vilnius, Budapest, Riga, Tallinn, Bratislava and Bucharest, where you don’t have to worry about the euro . \nThe best times to visit these cities are autumn and spring when package prices tend to be at their best. \nPrague is the city of a hundred spires, which skimps on cost but not on culture. What’s more, the improving exchange rate makes it a savvy choice. \nIf you’re heading to Prague, always pay in the local koruna – some restaurants and attractions allow payment in euros but the exchange rate is poor and you’ll get change in crowns anyway. \nA meal out is about £10 each, a pint of local beer little more than £1. \nBudapest, the Hungarian capital, is also a value-for-money break, where you won’t be short-changed on things to see and do. 5. Stay ATOL protected A British passport (Photo: PA) \nThe Civil Aviation Authority has financial protection for flight package holidays – the Air Travel Organisers’ Licensing scheme (ATOL). \nBe aware that hotel-only or car hire-only bookings made through tour operators are not ATOL protected, nor are holidays without air travel - so get your travel insurance in early. Read More Are you scared of flying? Can turbulence make a plane crash? A pilot answers all your plane fears \nATOL protection means if your travel company goes out of business before you go or the FCO advises against all but essential travel to your destination you receive a full refund. \nWhen you’re browsing for your trip, always make sure it’s ATOL protected as this can save you money and misery should things go wrong. 6. Holiday in Britain \nIf you’re after a cheap escape you might want to consider a UK break. \nHotel firms such as Travelodge regularly host deals over popular times of the year - with rooms from £30. \nThere’s also firms like Butlins and Legoland which offer great value British breaks on a nice and friendly budget. 7. Home Swap \nIf you’re in need of a holiday, but haven’t got much cash to spend beyond your airfares, how about swapping your house? Read More \nGood swapping sites include lovehomeswap.com , Homeexchange.com , Homesforexchange.com , homelink.org.uk and homebase-hols.com . \nIf you choose to pursue this route, take lots of photographs, including at least one of every bedroom, and the garden, if you have one. \nBe clear about what you need, and when. Don’t forget to also let your home insurance company know that you are arranging a swap. Like us on Facebook", "external_links": [], "published": "2017-03-21T20:00:00.000+02:00", "crawled": "2017-03-21T15:27:14.106+02:00", "highlightTitle": ""}