{"organizations": [], "uuid": "137844c7b64cc3fb1c873a7ec4cf53515b1d5910", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12809025.ece/ALTERNATES/s1200/Article-50-Official-Date-To-Trigger-Brexit-Process-Confirmed.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/were-rollercoaster-now-can-sit-12817838", "country": "GB", "domain_rank": 21960, "title": "We're on a rollercoaster now - all we can do is sit tight and hope for the best from Brexit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "We're on a rollercoaster now - all we can do is sit tight and hope for the best from Brexit", "spam_score": 0.0, "site_type": "news", "published": "2017-03-30T15:00:00.000+03:00", "replies_count": 0, "uuid": "137844c7b64cc3fb1c873a7ec4cf53515b1d5910"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/were-rollercoaster-now-can-sit-12817838", "ord_in_thread": 0, "title": "We're on a rollercoaster now - all we can do is sit tight and hope for the best from Brexit", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "negative"}, {"name": "bill", "sentiment": "none"}, {"name": "bill cash", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "chuka umunna", "sentiment": "none"}, {"name": "tim barrow", "sentiment": "none"}, {"name": "donald tusk", "sentiment": "none"}, {"name": "boris johnson", "sentiment": "none"}, {"name": "tim farron", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "belgium", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}], "organizations": [{"name": "house of commons", "sentiment": "neutral"}, {"name": "labour", "sentiment": "none"}, {"name": "european council", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "eu council", "sentiment": "none"}, {"name": "house", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "I guess it’s time to accept that Brexit really is happening . \nAnnouncing in the House of Commons that she had finally sent our EU partners a letter saying we want to leave, Theresa May said: “This is an historic moment from which there can be no turning back.” \nIt’s not clear if that is, technically, a sure thing. We’ve now triggered Article 50 of the Treaty on European Union, which states “a Member State which decides to withdraw shall notify the European Council of its intention”, but it’s still possible the EU would let us stay if we changed our minds. \nAfter all, we haven’t actually left yet. The Treaty says that we can talk about it for up to two years, or longer if both sides agree to extend the negotiations. British Prime Minister Theresa May (L) and President of the European Council Donald Tusk (Photo: Getty Images Europe) \nIn practice, however, the Prime Minister is right. \nIf you ever held out hope that the nation would come to its senses, or MPs would demand a second referendum, or maybe the judges would somehow prevent Brexit happening, then now is the time to give it up. \nOf course, some people reading this will be scratching their heads and asking themselves why anyone would want to overturn the results of last year’s referendum. \nMP Sir Bill Cash will have spoken for many Brexiteers in his response to Theresa May’s Commons statement on Wednesday. \nHe told MPs: “Today is an historic day indeed. Can my right honourable Friend [Theresa May] reaffirm that at the very heart of this letter lies the democratic decision of the referendum of UK voters given to them by a sovereign Act of Parliament by six to one in this House, enabling the British people to regain their birthright to govern themselves for which people fought and died over generations? \n“The referendum was followed by a massive majority of 372 in this House of Commons on the Third Reading of the withdrawal Bill itself. \n“Trade and co-operation, yes; European government, no.” Prime Minister Theresa May in the cabinet signing the Article 50 letter (Photo: PA) \nI urge Sir Bill and his ilk to be generous to us downcast remainers. Show magnanimity in victory. \nSome accepted reality long ago. But for some of us, it’s only just sunk in. \nMaybe Brexit will hurt the economy and maybe it won’t, but it’s a massive risk, and for what? Mainly the ability to limit EU immigration, but the fact is that we’re going to continue having immigration into this country for as long as there are jobs here for people to do, EU or not. \nAh, but there I go again, rehashing the arguments. It’s over. It’s pointless. We lost. Read More How Brexit will affect house prices, pensions, and even playing the EuroMillions \nThe Prime Minister’s appeal to the nation now is to put aside our differences and stop arguing about Brexit. Instead, we should unite to make it work, says Theresa May. \nIn her Commons statement, she said: “We are one great union of people and nations with a proud history and a bright future. \n“And now that the decision to leave has been made – and the process is underway – it is time to come together.” \nNot everybody feels the same way. \nA group called Vote Leave Watch is still angry. This is chaired by Labour MP Chuka Umunna and is determined to hold leaders of the ‘Leave’ campaign in last year’s referendum, and the Government, to account. Britain's permanent representative to the European Union Tim Barrow, left, hand delivers British Prime Minister Theresa May's Brexit letter in notice of the UK's intention to leave the bloc under Article 50 of the EU's Lisbon Treaty to EU Council President Donald Tusk, in Brussels, Belgium, Wednesday, March 29, 2017 (Photo: REUTERS POOL) \nSo after Mrs May spoke, they sent out a statement complaining that she was breaking a Conservative general election manifesto promise to keep the UK in the single market. \nThis is true but it’s also a pointless complaint, because the election took place before the referendum - and we can’t stay in the single market without continuing to accept freedom of movement (the right of any EU citizen to come and work in the UK), which is clearly now impossible. \nIn a similar vein, complaints that the leave campaign promised £350 million a week for the NHS, which is never going to happen, are futile. Read More Tim Farron: The North East will be hit hardest by Brexit - so you must have the final say \nI mean, it’s fair to attack leave campaigners such as Boris Johnson over this, but nobody should imagine that voters are going suddenly to realise they were duped and demand that we call the whole thing off. \nThe nation isn’t going to wake up and smell the roses. We’ve smelt them already and decided to throw them out of the window, to be replaced by who knows what. \nWe’re on the rollercoaster now. All we can do is hold on tight and hope. Like us on Facebook", "external_links": [], "published": "2017-03-30T15:00:00.000+03:00", "crawled": "2017-03-30T12:02:01.935+03:00", "highlightTitle": ""}