{"organizations": [], "uuid": "574c27f9d53affcd4db56a14e4363ec1f5e9c95a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12767190.ece/ALTERNATES/s1200/TMP_NEC_010317FentimansRobson02JPG.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/fentimans-considering-opening-european-factory-12767053", "country": "GB", "domain_rank": 21960, "title": "Fentimans considering opening European factory if tariffs rise after Brexit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Fentimans considering opening European factory if tariffs rise after Brexit", "spam_score": 0.0, "site_type": "news", "published": "2017-03-20T17:47:00.000+02:00", "replies_count": 0, "uuid": "574c27f9d53affcd4db56a14e4363ec1f5e9c95a"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/fentimans-considering-opening-european-factory-12767053", "ord_in_thread": 0, "title": "Fentimans considering opening European factory if tariffs rise after Brexit", "locations": [], "entities": {"persons": [{"name": "brexit fentimans", "sentiment": "neutral"}, {"name": "robson", "sentiment": "none"}, {"name": "eldon robson", "sentiment": "none"}, {"name": "eldon", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "thomas fentiman", "sentiment": "none"}], "locations": [{"name": "northumberland", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "usa", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "pennsylvania", "sentiment": "none"}], "organizations": [{"name": "european union", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Fentimans considering opening European factory if tariffs rise after Brexit The Northumberland fizzy drinks manufacturer has said it could open a plant on mainland Europe Share Eldon Robson CEO of Fentimans (Photo: Newcastle Chronicle) Share Get business   Thank you for subscribing!   \nNorthumberland fizzy drinks brand Fentimans could launch a factory in mainland Europe if trade tariffs rise after Brexit. \nEldon Robson, the firm’s Brexit-backing owner, said he would explore setting up an operation on the continent if exporting became more expensive after Britain’s divorce from the European Union. \nHe said: “If it did come to the point where tariffs are introduced, then we would set up some kind of manufacturing in Europe and that is how we would service the European marketplace. \n“We are used to outsourcing our manufacturing. We set up an operation in Pennsylvania, USA, where we sent our flavour recipes and they source the core ingredients and labels.” \nMr Robson added that sterling’s slump was beginning to bump up costs, but he did not believe Brexit would choke off overseas demand. \nOn Brexit, he said: “With business you always have challenges. You might as well tackle [Brexit] with a positive frame of mind. I wish the negativity would give way because there are opportunities as well.” \nThe botanical soft drink maker, was originally founded in 1905 by Mr Robson’s great grandfather Thomas Fentiman. The business closed in the mid 1960s but was revived again by Mr Eldon, who recovered the original ginger beer recipe from a 55 year old scrap of paper. \nThe Hexham-based business now turns over £24m and employs 50 people. It exports its drinks to 65 countries and its eyeing 15 new markets by 2022. \nFentimans is known for its iconic glass bottles but the business is now delving into the canned drinks market for the first time. \nThe firm is offering its curiosity cola and rose lemonade in 250ml slimline cans in an attempt to rake in sales from convenience stores, coffee bars and airlines. Read More From a secret family recipe to a multi-million pound business: the Fentimans story \nThe foray into canned drinks is part of a plan to triple turnover to £72m within five years. \nIt includes a move to bolster its range of upmarket mixers for alcoholic drinks as it looks to close the gap on industry-rival Fever-Tree. \nAsked whether he was priming the business for a sale, Mr Robson added: “We are approached by people. \n“We are in a very strong financial position and we don’t owe the bank any money. I own the business 100% and the future of the business is in very good hands at the moment. There is a very solid future for us.” Like us on Facebook", "external_links": [], "published": "2017-03-20T17:47:00.000+02:00", "crawled": "2017-03-20T13:52:18.045+02:00", "highlightTitle": ""}