{"organizations": [], "uuid": "58de5b53c645146b2ca31fccdbec862d93c0cb6d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30233823/15928894.jpg", "site_section": "http://www.middevongazette.co.uk/news.rss", "section_title": "Devon Live news RSS feed", "url": "http://www.devonlive.com/devon-man-speaks-of-anger-and-heartbreak-as-thieving-son-jailed/story-30233823-detail/story.html", "country": "GB", "title": "Devon man speaks of 'anger and heartbreak' as thieving son jailed", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "Devon man speaks of 'anger and heartbreak' as thieving son jailed", "spam_score": 0.0, "site_type": "news", "published": "2017-03-28T23:40:00.000+03:00", "replies_count": 0, "uuid": "58de5b53c645146b2ca31fccdbec862d93c0cb6d"}, "author": "C_Abbott", "url": "http://www.devonlive.com/devon-man-speaks-of-anger-and-heartbreak-as-thieving-son-jailed/story-30233823-detail/story.html", "ord_in_thread": 0, "title": "Devon man speaks of 'anger and heartbreak' as thieving son jailed", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "1 \nA Devon father has spoken about his heartbreak after his son broke into his home and stole £5,500 worth of property, including family war medals, while he was in hospital for heart surgery. Benjamin Davies, from Exeter, has been jailed following the break-in at Phillip Davies' house in Torquay and a string of other thefts. \nBen, 32, of Howell Road, Exeter, stole car keys from the empty house and took his father's mobility car, which he wrecked during a police chase in Exmouth three days later. He also stole his father's collection of commemorative medals and plates which he sold to an antique dealer for just £70, and some cash and jewellery. He also stole three televisions, including a 50-inch TV which was just two months old. \nPhillip, of Torridge Avenue, Torquay , told DevonLive that he was angry with Ben but he still loved him. The 59-year-old retired soldier said it had all added to the stress, including that caused by his stay in hospital. He uses a walking aid and cannot manage to use steps as 20 years ago he broke his back falling down a flight of steps, and his wife subsequently left him. He said he lives in a four-bedroom house which could be used by a family but social services could not afford to install a ramp and consequently he does not go out. \n\"I went to hospital for a triple bypass in September last year,\" he said. \"I was told I would be home in 11 days but I died twice and had to be resuscitated. Then I got pneumonia followed by a stroke and septicaemia. I didn't come out of hospital until a few days before Christmas – so it was nearly four months. I spent time in both Derriford Hospital in Plymouth and Torbay Hospital in Torquay. \n\"The theft happened in October so I had been in hospital for about a month. The police told one of my two daughters and she told me. I was on so many drugs I couldn't take it in properly at the time. I knew deep down it was Ben. He had a drug addiction and took heroin and I don't know what else. I'm not convinced he will get the help he needs to come off drugs in prison. He has been to prison before and it didn't change him. \n\"He has a lovely girlfriend and a son who's about three years old, but he would come and live with me when he was in trouble and depressed and we would put him on the straight and narrow again. I had last seen him the day after Boxing Day 2015 and had no contact by phone but it was nothing out of the ordinary. We had always been close but would go for long periods without contact. \n\"He had stolen before but never broken in and this was more personal – he waited until I had gone into hospital, that was the worst part. He took lots of things including some Army medals from the First World War belonging to my grandfather. They had sentimental value. He told the judge I had died and he needed time out to sort my funeral out – that was horrendous to hear. \n\"I was totally devastated – absolutely heartbroken. I'm angry with him but I still love him. He is my son and my daughters' brother and we're family. I wasn't going to testify but I couldn't cope anymore and I thought it was time he was punished. I'm still finding things missing even now. We need to leave it a few years before I can face him again. But we are still there for him.\" \nThe break-in last October was the culmination of crime spree in which he also stole £4,605 worth of equipment from the Talk of the Town café in Teighnmouth , where he had worked, and stole £13,000 of property and caused £6,500 of damage at the Fishermen's Mission café in Brixham . Ben was jailed for a total of four years and six months last week. \nAlison Godfrey, director of business development at the Fishermen's Mission, said the charity no longer has the property where the incident occurred over a year ago. She said: \"The items taken included some some ship models, large ship wheels and paintings. It was very sad. We had built up the memorabilia over the years and some had been donated to us. But we're really proud of the work we do in Brixham and the relationships we have with fishermen and their families. The work we do continues to go forward.\" DEVON NEWS \nAnnual Devon Festival of Remembrance has been cancelled \nThe annual Devon Festival of Remembrance, traditionally held at either Exeter Cathedral or the University of Exeter, has been cancelled because of financial restraints. The organisers have been forced to postpone the Royal British Legion's annual event, held every November for more than a quarter of a century. \nExeter mother bullied starving son and made him eat dog biscuits \nA cruel mother has been found guilty of subjecting her young son to a decade of daily beatings and humiliations. Christine Copley picked on her third son Andrew as he was growing up in the 1980s and early 1990s and imposed a regime of painful and needless punishments. \nBrexit could spell disaster for Devon wildlife \nEnvironment and wildlife campaigners in Devon are gearing up for the fight of a lifetime as Theresa May triggers Article 50. The county's wildlife chief has warned that Brexit could spell disaster for the county's unique environment if the Government fails to show ambition and a \"sense of vision\".", "external_links": [], "published": "2017-03-28T23:40:00.000+03:00", "crawled": "2017-03-28T19:12:31.190+03:00", "highlightTitle": ""}