{"organizations": [], "uuid": "57b817d2ec80aea2bfba2d417a6d39deb243f9d7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30236166/15930689.jpg", "site_section": "http://www.middevongazette.co.uk/news.rss", "section_title": "Devon Live news RSS feed", "url": "http://www.devonlive.com/bangers-to-brexit-says-devon-sausage-maker-supplying-the-world/story-30236166-detail/story.html", "country": "GB", "title": "Bangers to Brexit, says Devon sausage maker supplying the world", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "Bangers to Brexit, says Devon sausage maker supplying the world", "spam_score": 0.0, "site_type": "news", "published": "2017-03-29T20:39:00.000+03:00", "replies_count": 0, "uuid": "57b817d2ec80aea2bfba2d417a6d39deb243f9d7"}, "author": "HannahFinch", "url": "http://www.devonlive.com/bangers-to-brexit-says-devon-sausage-maker-supplying-the-world/story-30236166-detail/story.html", "ord_in_thread": 0, "title": "Bangers to Brexit, says Devon sausage maker supplying the world", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Bangers to Brexit, says Devon sausage maker supplying the world By HannahFinch   0 COMMENTS SHARES Charles Baughan says he will keep calm and sell sausages Bangers to Brexit, says Devon sausage maker supplying the world X \nCopy link to paste in your message / Comments (0) \nBrexit could open up a wealth of opportunities, according to one of the South West's biggest sausage makers.Westaways Sausages, based in Kingsteignton, makes more than half-a-million bangers every day selling them across the world from Barbados to Japan. \nManaging director Charles Baughan said that seven per cent of his sales are made overseas and Brexit will open up more opportunities for the UK, helped by the weak pound. He said: \"We have got to be light on our feet, flexible and reactive of the opportunities that will come our way. \n\"We need to be proud of what we stand for which is great animal welfare and well respected brands that are able to punch above their weight. \n\"But export is a long game and it takes commitment.\" \nRead more: The Exeter care home that has opened a pub for residents \nMr Baughan already supplies to 15 countries including India, South Korea, Thailand and Barbados. His comments come as the letter informing the European Council of Britain's intention to leave the European Union was handed over to EC president Donald Tusk in Brussels. \nThe historic declaration, signed by Theresa May, sets in train a two-year process of negotiation under Article 50 of the EU treaties leading to Britain's expected withdrawal after 46 years of membership in 2019.It was personally hand-delivered to Mr Tusk by the UK's permanent representative to the EU, Sir Tim Barrow. \nBut the group that represents manufacturers across the region are worried a so-called \"hard Brexit\" will cripple an industry that relies on exports.The EEF warn that a loss of access to the single market and customs union would condemn the manufacturing sector to a painful and costly Brexit leading to a \"lose-lose\" scenario for the UK and EU. \nJim Davison, EEF's South West region director, said: \"The EU is our sector's single biggest trading partner in a complex, tightly interwoven trading environment. \n\"Undermining the building blocks of this relationship – the single market and customs union – without any other supportive structure in place would undoubtedly hurt our industry and condemn us to a painful and costly Brexit. \n\"The idea of being able to walk away empty-handed might be a negotiating tactic, but it would in reality deliver a risky and expensive blow. \nRead more: Illegal Buckfast Abbey Wine Easter eggs destroyed by trading standards \n\"Close consultation between government and industry is now vital if we are to successfully deliver a deal that supports trade and minimises costs and uncertainty. \n\"Brexit will be the most complex unravelling any UK government is likely to have to undertake and government will need the help of industry to identify, understand and mitigate implications.\" \nThe stark warning is made in a briefing paper – UK Trade with the EU: a new trading order for the manufacturing industry – in which EEF urges the Government to clarify its position on the customs union and customs arrangements. \nIt said that unlike a typical free trade-type negotiation where walking away means the continuation of the status quo, this is not the case between the EU and the UK. Should the UK walk away with no preferential access to the EU or international markets in place, on day one of Brexit it would find itself at a loss, with the UK's manufacturing sector bearing much of the brunt, EEF warns. \nThe sector would be particularly vulnerable because the UK is currently the ninth largest industrial nation in the world, but its strength is underpinned by its trading relationship with the EU, where 52 per cent of all manufactured exports by value went in the 12 months to April 2016. \nStuart Rogers, Tax Partner at South West firm PKF Francis Clark, said that businesses owners may be 'bored of Brexit' but the triggering of Article 50 has fired the starting gun. He said: \"It is important that the challenges that are coming are recognised and that businesses begin to develop their own plan for Brexit and engage with the developing stories which will affect their own businesses the most.\" Read next:", "external_links": [], "published": "2017-03-29T20:39:00.000+03:00", "crawled": "2017-03-29T16:51:29.639+03:00", "highlightTitle": ""}