{"organizations": [], "uuid": "a2bb83850159f26d914542374a78d0bea0295551", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30235627/15930205.jpg", "site_section": "http://www.westernmorningnews.co.uk/all-content.rss", "section_title": "Devon Live All Content Feed", "url": "http://www.devonlive.com/indie-band-noisettes-to-headline-totnes-party-in-the-town-next-month/story-30235627-detail/story.html", "country": "GB", "title": "RomPEllis published Indie band Noisettes to headline Totnes' Party in the Town next...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "RomPEllis published Indie band Noisettes to headline Totnes' Party in the Town next...", "spam_score": 0.0, "site_type": "news", "published": "2017-03-29T19:04:00.000+03:00", "replies_count": 0, "uuid": "a2bb83850159f26d914542374a78d0bea0295551"}, "author": "RomPEllis", "url": "http://www.devonlive.com/indie-band-noisettes-to-headline-totnes-party-in-the-town-next-month/story-30235627-detail/story.html", "ord_in_thread": 0, "title": "RomPEllis published Indie band Noisettes to headline Totnes' Party in the Town next...", "locations": [], "entities": {"persons": [{"name": "alice oswald", "sentiment": "none"}, {"name": "adriano adewale", "sentiment": "none"}, {"name": "shingai shoniwa", "sentiment": "none"}, {"name": "dartington hall trust", "sentiment": "none"}, {"name": "amy bere", "sentiment": "none"}, {"name": "dartington", "sentiment": "none"}, {"name": "ben bradshaw", "sentiment": "none"}], "locations": [{"name": "exeter", "sentiment": "none"}, {"name": "totnes", "sentiment": "none"}, {"name": "civic hall", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "devon harp centre", "sentiment": "none"}], "organizations": [{"name": "totnes' party", "sentiment": "none"}, {"name": "noisettes", "sentiment": "none"}, {"name": "drift records", "sentiment": "none"}, {"name": "dartington hall trust", "sentiment": "none"}, {"name": "st mary's church", "sentiment": "none"}, {"name": "barrel house", "sentiment": "none"}, {"name": "party", "sentiment": "none"}, {"name": "dartington international summer school", "sentiment": "none"}, {"name": "town", "sentiment": "none"}, {"name": "dartington college of arts", "sentiment": "none"}, {"name": "royal seven stars", "sentiment": "none"}, {"name": "dartington international summer school foundation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Indie band Noisettes to headline Totnes' Party in the Town next month By RomPEllis | Posted: March 29, 2017 0 COMMENTS SHARES Noisettes perform at Party in the Town on April 28 Indie band Noisettes to headline Totnes' Party in the Town next month X \nCopy link to paste in your message / Comments (0) \nIndie rock band Noisettes will headline this year's Totnes music festival Party in the Town following the success of last year's free party which saw 2,000 revellers take to the streets. \nThe London-based band are set to play at the Civic Hall on April 28 with their electro-rock and funk sound led by soulful lead singer Shingai Shoniwa as they celebrate 10 years together. Following a huge response from local performers to Dartington's call out to artists Noisettes are supported by local duo Long for the Coast. \nThey're one of 50 local acts including more young performers than before in venues such as the Bay Horse, The Bull Inn, Devon Harp Centre, Barrel House, St Mary's Church and the Royal Seven Stars – with unexpected performance and moments on the High Street. \nRead more: A Brexit Day letter from Ben Bradshaw \nThe Party in the Town kicks off with a performance by local school children who have been working with Brazilian percussionist and composer Adriano Adewale to create a series of choral songs on the theme of revolution in the lead up to the event. \nDartington Hall Trust, who have created the festival, says it is particularly thrilled to host the return of former Dartington College of Arts students including Lux Harmonium and The Evil Usses in the next episode of its After Dark series. \nThe trust's current poet-in-residence Alice Oswald, who recently won the Costa Book Award, is to lead a poet parade of 22 local people and the Drift Records team behind local festival Sea Change are to take charge of The Barrel House to radiate a sound of what's to come this summer. \nExtra fun comes in the shape of a special festival beer created and brewed for the occasion by The New Lion Brewery in Totnes, as well as Dartington's Craft Revolution including Butter Aerobics: Feel the Churn, mixing exercise, techno music and conceptual art to produce a take-home dairy spread. Party in the Town is produced by the arts team behind the Dartington International Summer School and Festival. \nThe Dartington Hall Trust arts manager Amy Bere said: \"Party in the Town is an annual celebration for the community of Totnes to come together and participate in an evening of music, food, fun, and family. Local musicians and artists inhabit streets, empty shops, restaurants, community centres and the library, churches and public spaces. \nRead more: Gas leak causes delays on major Exeter road \n\"While the party is about a day of celebration, the effect it creates is far larger, building a lasting sense of partnership between Dartington and Totnes. We are grateful to the Arts Council England and the Dartington International Summer School Foundation for their support of Party in the Town.\" \nAccess to all performances is free except for the headline act. Age restrictions may apply to some venues later in the evening. Tickets for the Noisettes are on sale now.", "external_links": [], "published": "2017-03-29T19:04:00.000+03:00", "crawled": "2017-03-29T15:47:03.744+03:00", "highlightTitle": ""}