{"organizations": [], "uuid": "ca116136e29482330e37273acbd05a980469499b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.liverpoolecho.co.uk/incoming/article12731697.ece/ALTERNATES/s1200/JS114026750.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/theresa-trigger-article-50-end-12736718", "country": "GB", "domain_rank": 21960, "title": "Theresa May to trigger Article 50 by end of March after victories in Parliament", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Theresa May to trigger Article 50 by end of March after victories in Parliament", "spam_score": 0.0, "site_type": "news", "published": "2017-03-14T03:58:00.000+02:00", "replies_count": 0, "uuid": "ca116136e29482330e37273acbd05a980469499b"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/theresa-trigger-article-50-end-12736718", "ord_in_thread": 0, "title": "Theresa May to trigger Article 50 by end of March after victories in Parliament", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "theresa", "sentiment": "none"}, {"name": "david davis", "sentiment": "none"}, {"name": "helen goodman", "sentiment": "none"}, {"name": "mrs goodman", "sentiment": "none"}, {"name": "angela smith", "sentiment": "none"}, {"name": "phil wilson", "sentiment": "none"}], "locations": [{"name": "sedgefield", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "world trade organisation", "sentiment": "none"}, {"name": "first minister nicola sturgeon", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "bishop auckland", "sentiment": "none"}, {"name": "house of lords", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Theresa May to trigger Article 50 by end of March after victories in Parliament Negotiations for a post Brexit new trade deal with the EU could begin in April Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nA triumphant Theresa May is to trigger Article 50 and begin the process of Brexit towards the end of March. \nDowning Street put an end to speculation that the official process of leaving the EU could begin this week, with sources revealing it’s likely to wait until the week beginning March 27. \nBut the Prime Minister is now fully in control of the process after the House of Commons voted to give her the power to trigger Article 50 without any conditions or restrictions. \nIt means negotiations about a new trade deal with the EU, which may last two years, can begin by April. \nThe House of Lords had attempted to amend the European Union (Notification of Withdrawal) Bill, which allows Brexit to go ahead. \nOne amendment required the Government to give Parliament a “meaningful vote” on a Brexit deal once it is finally agreed by the UK government and the rest of the EU, while a second amendment requiring the Government to confirm that citizens of other EU countries who are currently in the UK legally will be allowed to stay. MPs return their result after voting to reject Lord's amendment on EU nationals rights in the House of Commons (Photo: PA) \nBut the House of Commons rejected the Lords proposals, after Ministers said that tying the Government’s hands would make it harder to get a good deal out of the EU. \nBrexit Secretary David Davis told the Commons that the Government would give Parliament a vote on the final Brexit deal before it is concluded, but said putting this in legislation would make it harder for the Government to “walk away” from a deal that seeks to “punish” the UK. \nAnd he dismissed concerns that EU nationals could be deported if no deal is struck. \nHe said: “Nothing, nothing will change for any EU citizen in the UK without Parliament’s explicit approval beforehand.” \nProposals to protect the rights of EU citizens were rejected by 335 votes to 287 in the House of Commons, a majority for the government of 48. There were two Conservative rebels who voted to add guarantees to the legislation - but they were outnumbered by six Labour rebels who defied orders from their own leadership and voted with the Government. \nAnd proposals to give Parliament a legal right to veto any Brexit deal were rejected by 331 votes to 286, a majority for the government of 45. Again, there were six Labour rebels, while no Conservative MP voted against the Government. British Prime Minister Theresa May \nIn principle, the Lords had the power to re-insert the amendments. \nBut it became clear there was no chance of this happening when Labour said it was ending the fight. Without the support of Labour peers, there was no chance of the Government being defeated in the House of Lords. \nAngela Smith, Labour’s leader in the House of Lords, said Labour would not send the legislation back to the Commons as there was no chance MPs would change their minds. \nOnce the Bill receives Royal Assent it becomes an Act of Parliament and the Prime Minister has all the authority she needs to trigger Article 50 at the time of her choosing. Read More Scotland's First Minister Nicola Sturgeon plans second independence referendum \nSpeaking during the Commons debate, Helen Goodman, Labour MP for Bishop Auckland, said that she was concerned about the possibility of the UK leaving the EU without a trade deal. \nThis could mean falling back on trade rules drawn up by the World Trade Organisation, which would mean paying tariffs on many goods made in the UK and exported to EU countries. Read More Theresa May swerves media at Europe summit amid Budget fallout \nBut Mrs Goodman said she believed the result could be an “even worse” deal for the UK. \nSedgefield MP Phil Wilson echoed warnings that Brexit without a trade deal “would put UK in worst trading position of rich nations”. Like us on Facebook", "external_links": [], "published": "2017-03-14T03:58:00.000+02:00", "crawled": "2017-03-13T23:30:12.840+02:00", "highlightTitle": ""}