{"organizations": [], "uuid": "30156975ba1e29cf4b5d0c51705694c1f7da5adc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bostonstandard.co.uk", "main_image": "http://res.cloudinary.com/jpress/image/fetch/w_300,f_auto,ar_3:2,c_fill/http://www.horncastlenews.co.uk/webimage/1.7839156.1488543562!/image/image.jpg", "site_section": "http://www.horncastlenews.co.uk/rss/cmlink/1.5463062", "section_title": "Horncastle News MHNP.whatson.feed", "url": "http://www.bostonstandard.co.uk/whats-on/arts/tv-column-prime-suspect-1973-meet-the-lords-the-nightly-show-1-7849232", "country": "GB", "title": "TV COLUMN: Prime Suspect 1973, Meet The Lords, The Nightly Show", "performance_score": 0, "site": "bostonstandard.co.uk", "participants_count": 0, "title_full": "TV COLUMN: Prime Suspect 1973, Meet The Lords, The Nightly Show", "spam_score": 0.0, "site_type": "news", "published": "2017-03-05T01:00:00.000+02:00", "replies_count": 0, "uuid": "30156975ba1e29cf4b5d0c51705694c1f7da5adc"}, "author": "", "url": "http://www.bostonstandard.co.uk/whats-on/arts/tv-column-prime-suspect-1973-meet-the-lords-the-nightly-show-1-7849232", "ord_in_thread": 0, "title": "TV COLUMN: Prime Suspect 1973, Meet The Lords, The Nightly Show", "locations": [], "entities": {"persons": [{"name": "james waller-davies", "sentiment": "none"}, {"name": "graham norton", "sentiment": "none"}, {"name": "jane tennison", "sentiment": "none"}, {"name": "david walliams", "sentiment": "none"}, {"name": "michael parkinson", "sentiment": "none"}, {"name": "david frost", "sentiment": "none"}, {"name": "brexit bill", "sentiment": "none"}, {"name": "walliams", "sentiment": "none"}, {"name": "martini", "sentiment": "none"}, {"name": "morse", "sentiment": "none"}, {"name": "stefanie martini", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}], "organizations": [{"name": "bbc", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}, {"name": "house of lords", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Have your say \nColumnist James Waller-Davies gives his view of some of the recent events on television... \nThe much anticipated Prime Suspect 1973 (ITV) has some pretty big shoes to fill. Prequels are under a far greater pressure than sequels to satisfy audience expectations. \nWhere the Morse prequel, Endeavour, got it right, Prime Suspect 1973, flawed on so many levels, got it so badly wrong. \nThe production values were retro-recreation gone too far. The 1973 aesthetic was realised in faultless technical detail, from static two-camera shots, clichéd though the door shots, three-foot high camera angles and studio sound suppression. The world it created was too stilted, too drab and too quiet. \nIf you ever wondered what happened to the team that made Crossroads, well they’re back making Prime Suspect with the same kit they had 40 years ago. \nThere’s a reason we don’t make television like that anymore, and it’s because we don’t have to. The 1970s didn’t look like Prime Suspect, 1970s’ television did – and there’s a critical difference in that. \nThe shining star in the mottled beige was Stefanie Martini, who played the young Jane Tennison. Martini was the only cast member to get anything remotely naturalistic out of the script, though her too-perfect looks and detached grace presented a somewhat surreal effect, akin to an Alice wandering bemused within the grotesque of Wonderland. We’re going to see a lot more of Stefanie Martini for sure, just perhaps not in a second series of this. \nEqually out of time but still drawing breath were the peers in Meet The Lords (BBC2). The follow-up to last year’s focus on the House of Commons, Meet The Lords was a fascinating insight into the workings and personalities of the legislative second chamber. \nIn a week when the Lords has put its collective head above the parapet in amending the Brexit Bill, it was a timely – if not ultimately ill-timed – reveal of the roll of the peers in national government. \nMeet The Lords confirmed what many have suspected for a long time: the House of Lords is an anachronistic den of buffoonery in fancy dress. \nIts very conception is one that could only have emerged from the vagaries of British history. The sheer ludicrousness of it defies belief and the only way it can possibly hide is in the plain sight it inhabits. \nMeet The Lords was an ‘Emperor’s new clothes’ programme, rather whipping the towel away from the dubious democratic credibility the Lords has. For it to have been shown in Brexit Bill week might have exposed the Lords a little too much at just the wrong time. \nITV are desperate to solve their 10pm slot problem and The Nightly Show (ITV) is not the solution. The broadcaster is hand-tied by licence to have an evening news programme and it is stymying their late night schedule. Good as it is, News At Ten gets a tiny audience after we’re all newsed-out by either Channel 4 at 7pm or 8pm, or BBC at 9pm. \nThe Nightly Show is an attempt to copy the very successful The Late Show, which has been a staple of US late evening TV for years. Media gossip suggests ITV have thrown the kitchen sink at The Nightly Show –alas what the show is left with are all those bits you scrap out of the bottom of the sink after a particularly grim washing-up session. \nThe writing is awful. This week’s presenter, David Walliams, has struggled with balancing the demands of dreadful auto-cue content and live ad lib. \nLive TV is a talent that few can master well. For every David Frost, Michael Parkinson or Graham Norton, there are hundreds of vacant looking presenters, desperately looking for a camera or a cue to their next line. Walliams floundered at times this week. He must have been counting his blessings the show is only half an hour. Trending", "external_links": [], "published": "2017-03-05T01:00:00.000+02:00", "crawled": "2017-03-04T21:30:21.668+02:00", "highlightTitle": ""}