{"organizations": [], "uuid": "27446919471b19df5bc4e14144240aca0ede7b57", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12154394.ece/ALTERNATES/s1200/Nissan-Sunderland-Plant.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/what-going-uk-car-industry-12707559", "country": "GB", "domain_rank": 21960, "title": "What is going on with the UK car industry - and what does it mean for Nissan?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "What is going on with the UK car industry - and what does it mean for Nissan?", "spam_score": 0.0, "site_type": "news", "published": "2017-03-08T15:00:00.000+02:00", "replies_count": 0, "uuid": "27446919471b19df5bc4e14144240aca0ede7b57"}, "author": "Sean Seddon", "url": "http://www.chroniclelive.co.uk/news/north-east-news/what-going-uk-car-industry-12707559", "ord_in_thread": 0, "title": "What is going on with the UK car industry - and what does it mean for Nissan?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nThe UK’s car industry has been big news over the last few months. \nSince the EU referendum , there has been a lot of focus on how the sector will cope, especially since the UK looks set to leave the single market. \nNissan was the first one to make the headlines and now the news is full of talk about Vauxhall. \nWe’ve taken a look at what is going on with the UK car industry and what it could mean for the giant Sunderland plant. What’s going on with Vauxhall? \nFrench car giant PSA Group is to buy the European operations of General Motors, including Vauxhall in the UK, for £1.9 billion. \nThe deal makes PSA, which owns Peugeot and Citroen, the second-largest car company in the world. \nBut there are concerns about the long-term future of the plants given the uncertainty surrounding the structure of a post-EU economy. \nAnd that’s worrying news for the 4,500 people currently employed at Vauxhall factories. A sign and banner are displayed outside a Vauxhall dealership (Photo: Getty Images Europe) What does it mean for Nissan? \nThe Vauxhall takeover doesn’t affect Nissan directly but it feeds in to a much wider picture about the industry as a whole in the wake of the Brexit vote. \nBack in November, Nissan made the headlines when it announced it would continue production in Sunderland despite previously warning against the prospects of the UK being able to compete outside of the single market. \nThe deal, which secured 7,000 jobs directly and thousands more in the supply chain, was met with jubilation. \nBut immediately there were questions: what exactly had the government told Nissan that they hadn’t told us? \nUnderstandably, people linked with Vauxhall want PSA to be offered the same sort of hush-hush, wink-wink reassurances that convinced Nissan to stay. Read More Nissan's 7,000-job Sunderland plant is under threat if there's no EU trade deal \nGavin Shuker MP, whose Luton constituency includes the plant, said: “The government needs to signal its intent to make a single continuous market for automotive across Europe in its negotiations, and secondly, de-risk the deal in the same way they did over Nissan, by giving assurances that if there’s a bad outcome in Brexit talks, they’ll pick up the tab.” \nThe Nissan deal might be good news for the North East but for those who depend on other at-risk car plants around the UK, it might seem a bit like an unfair advantage. Why are some people attacking the Nissan deal? Carlos Ghosn, Nissan Motor Corporation Chairman and CEO (Photo: Getty Images North America) \nThe deal with Nissan has left the government open to criticism that it has adopted a “piecemeal approach”. \nThis week, the new boss of the Institute of Directors, Stephen Martin, claimed that handing out special treatment to specific companies or industries was a strategy that is doomed to fail. \nAsked about Nissan, Mr Martin said: “It’s difficult to do a ‘pick winners’ strategy, the Government isn’t renowned for success in that, and you get bad outcomes from what we’ve seen in the past when there’s interference. \n“Any arrangement should be across the board, and we’d encourage them to do something for the whole country and protect all industries.” \nMr. Martin, who voted to leave, has urged the government to ensure British companies are not forced to trade on World Trade Organisation rules, the default set of regulations and tariffs that the UK will revert to if a trade deal is not struck with the EU. Will the UK get a deal? Theresa May (Photo: PA) \nTheresa May made herself very clear in a landmark speech in January, saying “no deal is better than a bad deal”. \nThat sentence will have left some in the UK car industry reeling. \nAs a member of the single market, cars produced in the UK can be bought and sold freely across Europe. \nBut European leaders have consistently signalled that membership of the single market will not be possible unless the UK accepts freedom of movement. Read More hedgehog lab launches with new office in Denmark before Brexit bites \nPolitically speaking, that would be extremely tricky for the government and ministers have pretty much ruled out that course. \nA deal which retains the elements of the single market that the car industry need to thrive is possible but its going to be tough. \nThe UK is about to embark on at least two years of complex, acrimonious negotiations which will take in everything from trade to immigration, defence to finance. \nIt is simply impossible to say with any degree of certainty whether the UK will be able to strike the sort of deal that will keep the car industry happy. So, will Nissan stay? Nissan (Photo: Andrew Matthews/PA Wire) \nNobody knows - probably not even Nissan. \nWhen the firm announced it would be staying in Sunderland, that was, in practice, a short-term commitment. \nAnd Nissan bosses have hardly been shy about that. \nSpeaking in January, Nissan CEO Carlos Ghosn said: “Obviously when the package comes, you are going to have to re-evaluate the situation, and say, ‘Okay, is the competitiveness of your plant preserved or not?’ \n“We are going to have to make decisions on investment within the next two to three years, so obviously the faster the Brexit results come, the better it is.” \nAnd there were further signs last week that Nissan’s future could lie away from the North East. \nSpeaking to a House of Commons committee, Colin Lawther, a Nissan senior vice president, said the firm would review the competitiveness of the Sunderland plant “as circumstances change”. \nHe added: “We won’t wait until the end of the process - we will continually review the circumstance based on anything that materially changes, Video Loading Click to play Tap to play The video will start in 8 Cancel Play now Watch this video again Video will play in Official launch of a new state of the art press at Nissan's car plant in Sunderland Share this video Watch Next \n“At the moment we have got a set of circumstances that we are quite happy with and we will honour that decision going forward but if anything materially changes we will review.” \nAsked what might prompt a review of operations in the UK, he said “free trade agreements - that’s the big ticket item”. \nSpeaking about the prospect of trading without a free trade agreement, he said: “That would mean our business would be of that magnitude less profitable. \n“Now, we are fortunate that our actions over the years have driven us to be a brand which is quite sustainable and quite profitable” \n“Maybe, maybe we could survive with that. Maybe. \n“Some of our other competitors I feel would not be able to survive with that level of anti-competitiveness from a cost point of view. \n“So it’s quite dangerous actually from an automotive sector point of view.” Like us on Facebook", "external_links": [], "published": "2017-03-08T15:00:00.000+02:00", "crawled": "2017-03-08T10:27:20.446+02:00", "highlightTitle": ""}