{"organizations": [], "uuid": "9ce43e17834a0213ad0076ba0658a1a34979b6b0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12727196.ece/ALTERNATES/s1200/GWR_-NJL_130317visit_01.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/newcastle-welcomes-arab-business-delegation-12725620", "country": "GB", "domain_rank": 21960, "title": "Newcastle welcomes Arab business delegation to forge trade links", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Newcastle welcomes Arab business delegation to forge trade links", "spam_score": 0.0, "site_type": "news", "published": "2017-03-12T20:00:00.000+02:00", "replies_count": 0, "uuid": "9ce43e17834a0213ad0076ba0658a1a34979b6b0"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/newcastle-welcomes-arab-business-delegation-12725620", "ord_in_thread": 0, "title": "Newcastle welcomes Arab business delegation to forge trade links", "locations": [], "entities": {"persons": [{"name": "sean bullick", "sentiment": "none"}, {"name": "bruce shepherd", "sentiment": "none"}, {"name": "el-idrissi", "sentiment": "none"}, {"name": "abdeslam el-idrissi", "sentiment": "none"}, {"name": "afnan al shuaiby", "sentiment": "none"}, {"name": "lyle armstrong", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "eastern mediterranean", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "gulf", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "wallsend", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "shepherd offshore", "sentiment": "none"}, {"name": "international centre for life", "sentiment": "none"}, {"name": "newcastle university", "sentiment": "none"}, {"name": "institute for genetic medicine", "sentiment": "none"}, {"name": "chamber of commerce", "sentiment": "none"}, {"name": "armstrong works", "sentiment": "none"}, {"name": "abcc", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "institute of genetic medicine", "sentiment": "none"}, {"name": "pearson engineering", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Newcastle welcomes Arab business delegation to forge trade links Visit organised by business improvement group NE1 aimed to help firms in the city build links in the Middle East Share Members of the Arab-British Chamber of Commerce visit Newcastle (Photo: Recognition PR)   \nA delegation of businessmen from the Middle East has been welcomed to Newcastle as the city tries to forge global links in the run-up to Brexit. \nNewcastle NE1, the city’s Business Improvement District, organised a visit from the Arab-British Chamber of Commerce (ABCC), which represents businesses in a number of Arab states. \nLed by ABCC secretary general and chief executive Dr Afnan Al Shuaiby plus director of trade service Abdeslam El-Idrissi, the delegates visited a number of Newcastle companies and institutions, focussing on sectors including subsea engineering and renewable energy, science and healthcare, and education. \nThe visit was organised to highlight opportunities for business, investment, trade, knowledge transfer and learning, and to strengthen links between Arab-speaking countries and Newcastle . \nNE1 chief executive Sean Bullick said: “The result of the EU referendum brought an element of risk to the North East’s position as an exporter and while we are sure the Government will do its best maintain our trade links in Europe and build more in the wider world, we are taking the initiative and are proactively building links that will sustain and grow Newcastle’s economy, regardless of the result of the Brexit negotiations. \n“We are honoured to have welcomed the delegates from the Arab-British Chamber of commerce to Newcastle. This is an excellent opportunity to showcase what Newcastle city region’s world class businesses have to offer countries in the Arabic world. We have world leaders in sectors such as offshore and renewables, science, health, science and education, all of which are areas of interest to our visitors.” \nThe Arab delegation visited Pearson Engineering at the city’s historic Armstrong Works, Shepherd Offshore in Wallsend, the Institute for Genetic Medicine at the International Centre for Life and Newcastle University. \nMr El-Idrissi said: “We are delighted to have visited Newcastle and would like to thank our hosts Newcastle NE1 Limited for helping to organise our trip. There are a number of areas where the interests and expertise of Newcastle and the Arab nations complement one another and we are keen to explore them. \n“This visit has allowed us to further friendship, co-operation and engagement with the people and companies of the North East. It is clear that there is much commercial potential in Arab-British collaboration which we hope to unlock.” \nShepherd Offshore managing director Bruce Shepherd said: “The visit was extremely informative, we will be having a further meeting to discuss future projects in the Eastern Mediterranean and Gulf.” \nProf Lyle Armstrong, professor of cellular reprogramming at the Institute of Genetic Medicine, said: “What we do with our STEM work in Newcastle affects everyone in the world. We want to role this out as a treatment for any disease, for anyone in any part of the world. \n“International trade links are of enormous importance to us not only for finding new markets that we can adapt our cures to, but also for attracting inward investment that helps our university and our corporate operations to prosper.” Like us on Facebook", "external_links": [], "published": "2017-03-12T20:00:00.000+02:00", "crawled": "2017-03-12T15:51:45.201+02:00", "highlightTitle": ""}