{"organizations": [], "uuid": "6c1625bfe9c243f32525177a9288ed3154e14777", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12743711.ece/ALTERNATES/s1200/WA1140576.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12800885", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: North East jobs go as region's Jones Bootmaker stores shut", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast LIVE: North East jobs go as region's Jones Bootmaker stores shut", "spam_score": 0.0, "site_type": "news", "published": "2017-03-27T15:05:00.000+03:00", "replies_count": 0, "uuid": "6c1625bfe9c243f32525177a9288ed3154e14777"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12800885", "ord_in_thread": 0, "title": "Business Breakfast LIVE: North East jobs go as region's Jones Bootmaker stores shut", "locations": [], "entities": {"persons": [{"name": "eugene shestopal", "sentiment": "none"}, {"name": "jones", "sentiment": "none"}, {"name": "richard hilton", "sentiment": "none"}, {"name": "nelson", "sentiment": "none"}, {"name": "will wright", "sentiment": "none"}, {"name": "gow", "sentiment": "none"}, {"name": "george osborne", "sentiment": "none"}, {"name": "liz mayes", "sentiment": "none"}, {"name": "tim farron", "sentiment": "none"}, {"name": "shestopal", "sentiment": "none"}, {"name": "coreena ford brexit", "sentiment": "none"}, {"name": "dyson", "sentiment": "none"}, {"name": "gymbox", "sentiment": "none"}, {"name": "stephan shakespeare", "sentiment": "none"}, {"name": "gaucho rasmussen", "sentiment": "none"}, {"name": "whitburn", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "yougov", "sentiment": "none"}, {"name": "hilton", "sentiment": "none"}, {"name": "coreena ford", "sentiment": "none"}, {"name": "terry gregson", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}, {"name": "wagtail", "sentiment": "none"}, {"name": "james", "sentiment": "none"}, {"name": "philip hammond", "sentiment": "none"}, {"name": "tom", "sentiment": "none"}, {"name": "kevin gow", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "steve absolom", "sentiment": "none"}, {"name": "james dyson", "sentiment": "none"}, {"name": "lucy hick", "sentiment": "none"}, {"name": "neil thomas", "sentiment": "none"}, {"name": "richard charnley", "sentiment": "none"}, {"name": "jonathan brady/pa wire", "sentiment": "none"}, {"name": "coreena ford gymbox", "sentiment": "none"}, {"name": "openreach", "sentiment": "none"}, {"name": "clive selley", "sentiment": "none"}, {"name": "james o'reilly", "sentiment": "none"}, {"name": "ignat tkhorovskiy", "sentiment": "none"}, {"name": "phillip hammond", "sentiment": "none"}, {"name": "jones bootmaker", "sentiment": "none"}, {"name": "john nelson", "sentiment": "none"}, {"name": "blair nimmo", "sentiment": "none"}, {"name": "hammond", "sentiment": "none"}, {"name": "ignat thorovsky", "sentiment": "none"}, {"name": "hick", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "ukraine", "sentiment": "none"}, {"name": "brighton", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "bedlington", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "luxembourg", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "india", "sentiment": "none"}, {"name": "wiltshire", "sentiment": "none"}, {"name": "whitburn", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "castlemead", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "victoria", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "pennine pale", "sentiment": "none"}, {"name": "burgham park", "sentiment": "none"}, {"name": "wales", "sentiment": "none"}, {"name": "malmesbury", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "north pennines", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "burgham", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "sweden", "sentiment": "none"}], "organizations": [{"name": "society of motor manufacturers and traders", "sentiment": "none"}, {"name": "coreena ford northumberland", "sentiment": "none"}, {"name": "press association", "sentiment": "none"}, {"name": "northstar ventures", "sentiment": "none"}, {"name": "coreena ford us", "sentiment": "none"}, {"name": "vodafone", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "bt", "sentiment": "none"}, {"name": "coreena ford chancellor", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "tesco", "sentiment": "none"}, {"name": "lloyd's of london", "sentiment": "none"}, {"name": "lloyd", "sentiment": "none"}, {"name": "redundancy payments office", "sentiment": "none"}, {"name": "cbs news", "sentiment": "none"}, {"name": "gymbox", "sentiment": "none"}, {"name": "welsh assembly", "sentiment": "none"}, {"name": "eef", "sentiment": "none"}, {"name": "allendale brewery", "sentiment": "none"}, {"name": "cabinet", "sentiment": "none"}, {"name": "tory", "sentiment": "none"}, {"name": "whitburn golf course", "sentiment": "none"}, {"name": "valuation office agency", "sentiment": "none"}, {"name": "kpmg llp", "sentiment": "none"}, {"name": "leeds", "sentiment": "none"}, {"name": "jones & sons limited", "sentiment": "none"}, {"name": "endless llp", "sentiment": "none"}, {"name": "burgham park golf & leisure club limited", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "wrexham borough council", "sentiment": "none"}, {"name": "kpmg", "sentiment": "none"}, {"name": "ofcom", "sentiment": "none"}, {"name": "cocken lodge golf", "sentiment": "none"}, {"name": "voa", "sentiment": "none"}, {"name": "coreena ford dyson", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}, {"name": "dyson institute of engineering and technology", "sentiment": "none"}, {"name": "poptop", "sentiment": "none"}, {"name": "lloyd’s of london", "sentiment": "none"}, {"name": "cvs", "sentiment": "none"}, {"name": "finance for business north east proof of concept fund", "sentiment": "none"}, {"name": "aig", "sentiment": "none"}, {"name": "coreena ford digital", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "A championship golf course in Northumberland is poised to reopen after entering administration last November. \nBurgham Park golf course was forced to close its clubhouse for the winter after Burgham Park Golf & Leisure Club Limited called in the administrators at the end of 2016. \nThe clubhouse, which has 300 members, is now set to be re-opened in early April after being taken over by local professional golfer Kevin Gow. \nMr Gow’s professional golfing careers started when he was just 17, after he became an assistant golf professional at Bedlington golf club in 1981. \nSince then he has worked as a professional golfer at Morpeth golf club and has taught the sport to others in Sweden. \nBurgham Park is not the first golf club that Mr Gow has run in the North East. In 2011 he ran Cocken Lodge Golf course, near Durham, for five years before moving on for a short period to manage Whitburn Golf Course. \nMr Gow said: “This opportunity at Burgham park was far too good a position that I could not say no, otherwise I could have seen myself staying at Whitburn for many years. \n“Whitburn is a very friendly club. They have a very proactive committee whose interest is only in what’s good for the club. \n“In these hard times for private golf clubs, I am confident that this committee, with the help from its members, will have a very long and successful future.” Burgham Park golf club, Northumberland 8.52 Coreena Ford Northumberland brewery celebrates after winning Tesco contract \nA family-run brewery in rural Northumberland has secured a deal that will see its products stocked by the country’s largest supermarket chain. \nAllendale Brewery, which is run by husband-and-wife team Tom and Lucy Hick and head brewer Neil Thomas, has signed a deal with Tesco to get three of its beers stocked in the retail giant’s stores in the North East. \nThe brewery names its beers after local landmarks and wildlife in the North Pennines, with Golden Plover, Wagtail and Pennine Pale being ordered by Tesco. \nThe brewery was founded in 2006 in a historical lead mill that has been transformed into a state-of-the-art craft brewery. \nMr Hick won the National Young Rural Entrepreneur Competition in 2008 and has gone on to win a whole host of national and international awards for his beers including two Gold Stars at the Great Taste Awards for Pennine Pale and one star for Wagtail. \nHe said: “It’s a real milestone for us and an incredible moment that Tesco is recognising the importance of stocking good quality local craft beers. We’re especially pleased that they’ve selected three of our signature beers to add to their shelves.” The Allendale Brewery team pictured in front of fermentation tanks at the brewery 8.45 KEY EVENT BT fined record £42m over 'serious breach of Ofcom rules \nBT has been hit with a record £42 million fine by the telecoms watchdog and is facing compensation costs to rivals of £300 million over delayed high-speed cable installations. \nOfcom said BT’s Openreach infrastructure arm committed a “serious breach” of its rules for reducing payments owed to other providers such as Vodafone. The telecoms giant was supposed to pay compensation after failing to deliver high-speed lines to the rival companies in adequate time. \nThe communications regulator has rules to curb BT’s “significant market power” to ensure competitiveness, including an obligation to provide the so-called Ethernet cables within 30 days. \nThe huge sum is the largest fine issued against a telecoms provider by Ofcom and almost 10 times larger than the previous record, a £4.6 million penalty against Vodafone last year. \nOpenreach said it “apologised wholeheartedly” over the incident. \nGaucho Rasmussen, Ofcom’s investigations director, said: “These high-speed lines are a vital part of this country’s digital backbone. Millions of people rely on BT’s network for the phone and broadband services they use every day. \n“We found BT broke our rules by failing to pay other telecoms companies proper compensation when these services were not provided on time. \n“The size of our fine reflects how important these rules are to protect competition and, ultimately, consumers and businesses. \n“Our message is clear - we will not tolerate this sort of behaviour.” \nCompensation will now have to be paid to affected providers within 12 months, Ofcom said. \nBT said it estimated the total cost of the compensation payments would be around £300 million. \nOpenreach CEO Clive Selley said: “We apologise wholeheartedly for the mistakes Openreach made in the past when processing orders for a number of high-speed business connections. \n“This shouldn’t have happened and we fully accept Ofcom’s findings.” \nEarlier this month, BT reached an agreement with Ofcom to legally separate its infrastructure arm Openreach. It followed growing calls from rivals to hive off Openreach and in November the communications regulator ordered a legal separation of the firm. 8.40 Coreena Ford Gymbox looks to expand into the regions \nLondon-based fitness chain Gymbox is exploring options to expand outside the capital and internationally for the first time. \nRichard Hilton, the group’s founder, said the firm is initially looking at Leeds, Manchester and Brighton in the UK as demand for the group’s quirky fitness classes soars. \n“Business is going very well, we had a terrific last year and our new clubs are trading well, so we’re looking at international expansion and expansion outside of London. \n“In the UK, Leeds, Manchester and Brighton are looking likely. Internationally, we think it could work in Europe and Asia but nothing has been identified yet, we’re analysing all the options,” he said. \nGymbox, founded in 2003, has nine clubs across London and boasts 26,000 members. \nThree more will open in the capital in 2017, including in Victoria and the City. The fast-growing firm has cashed in on the popularity of its unorthodox fitness classes, which include yoga raves, pole dancing and a workout that aims to make you taller. \nLast year the firm saw sales grow from £13 million to £17 million, booking pre-tax profits of £2.4 million. \nGymbox has attracted the interest of several private equity firms, but Mr Hilton said that a deal to sell the firm collapsed following the EU referendum last year. \n“We had six private equity firms interested, picked one, had June 24 as the completion date, but then Brexit happened. \n“They tried to change the price, understandably I guess, as the country was in turmoil and the PM had just quit.” \nBut the group bounced back, securing further investment from the British Growth Fund, valuing the firm at £60 million. \nMr Hilton and the firm’s management hold 20% each, with the BGF holding the remaining 60%. \nMr Hilton was speaking as part of his role as ambassador for the Plusnet Pioneers campaign, a programme aimed at helping start-up business owners realise their ambitions. Gymbox is looking to expand, taking its unusual classes - including Flatline, which is described as the hardest and deadliest gym class in the world - to the regions and possibly abroad. 8.35 Coreena Ford Chancellor's firm gets business rates cut \nChancellor Philip Hammond’s property firm has been handed a business rates cut of more than £12,000 over the next five years, as the Government hits thousands of other companies with crippling hikes. \nCastlemead - the housebuilder and care homes developer set up by Mr Hammond - will pay 10.9% or £2,472 a year on average less under next month’s controversial revaluation according to figures compiled for the Press Association. \nSelf-made millionaire Mr Hammond still owns a controlling interest in Wrexham-based Castlemead, which will see its annual head office rates bill drop by £12,361 over the next five years, data from business rent and rates specialists CVS reveals. \nIt piles yet more pressure on the Government over its April 1 changes to business rates - the commercial equivalent of council tax - after a raft of revelations in recent days, reinforcing calls for a reform of the system that has been slammed as unfair and illogical. \nIt was revealed that former Chancellor George Osborne’s family wallpaper firm is to enjoy a business rates cut of more than £3,400 a year for its showroom in London’s swanky King’s Road, while shops, pubs and restaurants on the same street are facing eye-watering increases. \nIt has also since emerged that the Government department responsible for the England revaluation - the Department for Communities and Local Government (DCLG) - will see rates on its Westminster headquarters fall by more than £265,000 this year. \nMr Hammond’s Castlemead firm is based in Wales, where the rateable value of property is calculated by the Valuation Office Agency (VOA) while the pence in the pound paid by firms in rates is set by the Welsh Assembly. \nWhile Mr Hammond’s firm is set to see a double-digit fall, businesses on average across Wrexham Borough Council will see a 0.2% increase. \nLiberal Democrat leader Tim Farron accused the Government of “looking the other way”. \nHe said: “Another day and another senior Tory sees their business rate bill fall while many other businesses see theirs rocket. \n“This could cripple businesses and the Government are just looking the other way. \n“We have a system which is no longer fit for purpose, it needs total reform.” \nMr Hammond set up Castlemead in 1984 with business partner Terry Gregson. \nSince becoming a government minister, his stake has been controlled by an onshore discretionary trust. \nWhile the business is not run on a day-to-day basis by Mr Hammond, he is still the main beneficiary. \nA spokesman for the VOA said: “Rateable values are set independently of ministers by the VOA and reflect the open market rental value on a fixed date - for this revaluation it’s April 1 2015. \n“If those open market values have changed, then rateable values will change with them.” Chancellor Phillip Hammond (Photo: Getty Images Europe) 8.30 Coreena Ford Brexit challenges 'walk in the park' says Lloyd's of London boss \nLloyd’s of London chairman John Nelson says insurance market veterans view the challenges thrown up by Brexit as a “walk in the park” compared to the difficulties that nearly obliterated the business just decades ago. \nHis comments come days before the marketplace reveals its preferred location for an EU subsidiary, tipped to be Luxembourg, in a move that will ensure access to the bloc’s single market after Brexit. \nMr Nelson said that Britain’s pending divorce from the EU is undoubtedly serious, but that Lloyd’s is in a much stronger position to shoulder any related stress. “If you go back in history and talk to some of the people who’ve been working here - I’ve only been working here at Lloyd’s for six years - but for 40 years, they’d regard this as probably a bit of a walk in the park compared to a few years ago when Lloyd’s very nearly went bust, when it was almost out of business for reputational reasons.” \nLloyd’s struggled as asbestos compensation demands grew throughout the 1980s and 1990s, which had a major impact on “Names” - private investors who provided capital in hopes of returns on their investment under terms of unlimited liability. \nMany suffered losses, even bankruptcy, and claimed they were knowingly dumped with extra risk. “These are serious challenges but at least we’re in a strong position,” Mr Nelson said. \nIt is understood that Luxembourg - which has already clinched subsidiary commitments from insurance giant AIG - is the frontrunner in its search for Lloyd’s’ new EU hub, and could result in more than 100 jobs at being shifted from London. \nBut Mr Nelson said Lloyd’s has yet to make a firm decision, and that “there’s still more than one country in the frame”. Lloyd's of London (Photo: Jonathan Brady/PA Wire) 8.25 Coreena Ford US poll predictions help YouGov profits rise \nPollster YouGov said its US presidential election predictions had outperformed its rivals as it cheered rising revenues and profits. \nThe firm said group revenues lifted by 24% to £51.4 million in the six months to the end of January, while adjusted pre-tax profits rose 27% to £6.3 million. \nThe jump was underpinned by its data products and services division, with revenues climbing 39% to £22 million over the period. \nThe Aim-listed firm said its national poll for the US presidential election had a 1.4% margin of error, which was within the expected standard and more accurate than other pollsters. \nIt said awareness of the company across America had “increased significantly” after delivering US election polling for CBS News. \nChief executive Stephan Shakespeare said the firm’s growth rate had outperformed the rest of the global research market. \n“This performance has been driven by the continued strong growth in our subscription-based data products and our fast turnaround data services,” he added. “This progress has been complemented by steady margin improvements in the more traditional custom research services. \n“Trading during the second half of our financial year has started positively and is in line with our expectations. \n“We have built a strong base and continue to see significant opportunity to further grow revenues from data products and data services and deliver on our long-term objectives.” 8.20 Coreena Ford Digital event planning business receives £120k to grow in Newcastle \nA digital ‘concierge’ service that lets customers book musicians, DJs, caterers, and marquees has set up in the North East after deciding the region was the place to grow its business. \nEvent planning company Poptop allows customers to hire a range of products and services through its online database. \nThe business was founded by experienced event lpanner Eugene Shestopal and developer Ignat Tkhorovskiy, who met in their native Ukraine before moving to Newcastle in 2015. \nNow the firm has received £120,000 to expand in the region. \nMr Shestopal, CEO of Poptop, said: “Despite being an international team, we are proud to call ourselves a North East business. \n“The tech community in the region is one of the strongest we’ve come across, with well-networked hubs like Campus North providing a great surrounding for growing our company. \n“We’ve found experienced mentors here, who we work with regularly. There’s also a strong digital infrastructure in the North East and we’ve been able to build better relationships with our investors as a result. \n“Newcastle itself is also a city filled with students – it makes recruiting talented graduates much easier.” \nPoptop received £100,000 of the investment from the Finance for Business North East Proof of Concept Fund, which is managed by Northstar Ventures. The remaining £20,000 was provided by a separate angel investor. \nThe tech business is planning on using the funds to grow its development team and customer service department over the coming months. Eugene Shestopal, Poptop, Richard Charnley, Northstar Ventures, Ignat Thorovsky and James O'Reilly, Poptop (Photo: Northstar Ventures) 8.15 Coreena Ford 'No deal' on Europe would be disaster for North East manufacturing, industry group says \nPrime Minister Theresa May has been urged to tone down her rhetoric on Brexit or risk massive damage to the North East’s manufacturing industry. \nEEF, which represents the manufacturing sector, has described Mrs May’s stance that ‘no deal is better than a bad deal’ as “simply unacceptable to an industry that accounts for 45% of all UK exports”. \nThe call from EEF to concentrate on negotiating a good deal for the industry adds to pressure on Ministers to secure agreement on access to the European market for a number of key North East employers. \nThis weekend the trade union Unite and the Society of Motor Manufacturers and Traders joined forces to warn that failure to secure a trade deal for the automotive industry - one of the largest North East employers and a key growth sector for the region - would be catastrophic. \nAnd senior figures from Nissan, which employs 7,000 people at its Sunderland plant with thousands more in the regional supply chain, have also warned that adding tariffs to cars produced in the UK could affect future decisions on where the company produces its new models. \nLiz Mayes, North East Region Director at EEF, said: \nThe EU is our sector’s single biggest trading partner in a complex, tightly interwoven trading environment. Undermining the building blocks of this relationship – the single market and the customs union – without any other supportive structure in place would undoubtedly hurt our industry and condemn us to a painful and costly Brexit. \n“The idea of being able to walk away empty-handed might be a negotiating tactic, but it would in reality deliver a risky and expensive blow. The rhetoric from the UK Government needs to focus instead on achieving a deal that will work for the UK and the EU. \n“Close consultation between Government and industry is now vital if we are to successfully deliver a deal that supports trade and minimises costs and uncertainty. Brexit will be the most complex unravelling that any UK Government is ever likely to have to undertake and Government will need the help of industry to identify, understand and mitigate the implications. Liz Mayes, new boss of the EEF 8.12 Coreena Ford Dyson urges foreign student exemption from immigration targets \nSir James Dyson is ramping up the pressure on Prime Minister Theresa May to usher in more international talent post-Brexit by eliminating overseas students from the official immigration figures. \nThe technology tycoon wants the Government to welcome foreign students specialising in maths, engineering and science by making them exempt from Government efforts to cut immigration once Article 50 is triggered on Wednesday. \nSir James said: “I wouldn’t want the Government to target that area. We should make maths, science and engineering students that come to stay in this country welcome here. “I am very much against targeting them. I think they should be excluded from the immigration targets.” \nThe Brexit-backing billionaire, who is pumping millions of pounds into a new university in Wiltshire, said the UK should embrace an approach akin to the Australian regime where it uses a points-based system to allow the brightest students to stay in the country after studying. \nSir James announced plans to launch the Dyson Institute of Engineering and Technology in September - a new university based at its Malmesbury headquarters in Wiltshire. \nHe said the current UK system is flawed because we are educating foreign students at some of the best universities in the world - and then sending their skills back home. \nIn Australia, students are served points based on their academic achievements, which strengthen their case to stay in the country. \nHowever, under the current UK rules, EU students have find a job within six months of graduating, while non-EU students have to secure work within four months of their studies finishing. \nThe Prime Minister is facing growing public and Cabinet pressure to remove international students from the target to get net immigration down to the tens of thousands. \nSir James’ comments came as Dyson announced a jump in revenues and profits for 2016 on surging sales of its Supersonic hair dryer and digital slim vacuum cleaner. \nThe firm, which employs 3,500 people globally, said annual profits lifted 41% to £631 million as reaped the rewards of strong demand for new technology in Japan and South Korea. \nTurnover also lifted 45% to £2.5 billion, with China expanding 244% thanks to a growing appetite for its cordless vacuum cleaners. \nThe company is now looking to open 20 Dyson demo stores across India - and may launch a manufacturing operation in the country - as it looks to add more than £146 million to the Indian economy over the next five years. Industrial designer and engineer Sir James Dyson 8.08 Coreena Ford FTSE an pound latest \nThe pound at 8am was 1.2545 dollars compared to 1.2493 dollars at the previous close. The euro at 8am was 0.8660 pounds compared to 0.8650 pounds at the previous close. \nThe FTSE-100 index opened at 7336.82. 8.00 KEY EVENT Job losses as Jones Bootmaker closes Newcastle and Durham stores \nMore than 260 jobs have been axed, including a number in the North East, after 25 Jones Bootmaker closed across the UK. \nThe footwear retailer, which has more than 100 branches, has been sold to Endless LLP, a private equity firm. \nAs part of the sales process, Will Wright, Steve Absolom and Blair Nimmo of KPMG LLP were appointed joint administrators of A Jones & Sons Limited on March 24 and following their appointment, the joint administrators completed an agreement to sell the majority of the business and assets to Endless. \nThe deal sees Endless acquire 72 stores, securing around 840 jobs in the UK. \nHowever, there are 25 underperforming stores and six concessions which are not part of the sale and will close immediately, including its stores in Newcastle and Durham, which employed 21 people between them. \nThe closures in total result in approximately 262 job losses. \nWill Wright, partner at KPMG and joint administrator, said: “We are delighted that we have been able to rescue such an iconic UK footwear brand as Jones Bootmaker, including a high proportion of stores and preserving a large number of jobs, especially given the current economic pressures faced by retailers across the UK. \n“This deal recognises the value of Jones as a strong and popular high street brand with a loyal customer base.” \nSteve Absolom, joint administrator at KPMG, added: “Whilst it is always pleasing to preserve a significant number of jobs, sadly a number of redundancies are to be made at the closed stores. \n“Over the coming days, our priority is to ensure all employees who have been affected by redundancy receive the information and guidance they need in order to claim monies owed from the Redundancy Payments Office.” Share", "external_links": [], "published": "2017-03-27T15:05:00.000+03:00", "crawled": "2017-03-27T11:16:46.342+03:00", "highlightTitle": ""}