{"organizations": [], "uuid": "6e250e2cbe6eb7690be770c34edaa880b476f6a3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12795824.ece/ALTERNATES/s1200/jazz-festival.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/whats-on/arts-culture-news/feast-jazz-coming-sage-gateshead-12795738", "country": "GB", "domain_rank": 21960, "title": "A feast of jazz is coming to Sage Gateshead with sounds to excite young and old", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "A feast of jazz is coming to Sage Gateshead with sounds to excite young and old", "spam_score": 0.0, "site_type": "news", "published": "2017-03-25T19:00:00.000+03:00", "replies_count": 0, "uuid": "6e250e2cbe6eb7690be770c34edaa880b476f6a3"}, "author": "David Whetstone", "url": "http://www.chroniclelive.co.uk/whats-on/arts-culture-news/feast-jazz-coming-sage-gateshead-12795738", "ord_in_thread": 0, "title": "A feast of jazz is coming to Sage Gateshead with sounds to excite young and old", "locations": [], "entities": {"persons": [{"name": "sage gateshead", "sentiment": "none"}, {"name": "trish clowes", "sentiment": "none"}, {"name": "shabaka hutchings", "sentiment": "none"}, {"name": "shabaka", "sentiment": "none"}, {"name": "daniel herskedal", "sentiment": "none"}, {"name": "misha mengelberg", "sentiment": "none"}, {"name": "bach", "sentiment": "none"}, {"name": "lena horne", "sentiment": "none"}, {"name": "garibaldi pop", "sentiment": "none"}, {"name": "jambone", "sentiment": "none"}, {"name": "ronnie scott", "sentiment": "none"}, {"name": "chris illingworth", "sentiment": "none"}, {"name": "strobe nazard", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "clare teal", "sentiment": "none"}, {"name": "ros rigby", "sentiment": "none"}, {"name": "squarepusher", "sentiment": "none"}, {"name": "shabaka hutchins", "sentiment": "none"}, {"name": "daniel hersedal", "sentiment": "none"}, {"name": "laura jurd", "sentiment": "none"}, {"name": "tomasz stanko quartet", "sentiment": "none"}, {"name": "richard bona", "sentiment": "none"}, {"name": "ella fitzgerald", "sentiment": "none"}, {"name": "gogo penguin", "sentiment": "none"}, {"name": "rob turner", "sentiment": "none"}, {"name": "han bennink", "sentiment": "none"}, {"name": "alfredo rogriguez trio", "sentiment": "none"}, {"name": "ros", "sentiment": "none"}, {"name": "nick blacka", "sentiment": "none"}], "locations": [{"name": "sage gateshead", "sentiment": "none"}, {"name": "cuba", "sentiment": "none"}, {"name": "arg nution", "sentiment": "none"}, {"name": "hollywood orchestra", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "holland", "sentiment": "none"}, {"name": "johannesburg", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "usa", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "cameroon", "sentiment": "none"}, {"name": "norway", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}], "organizations": [{"name": "instant composers pool orchestra", "sentiment": "none"}, {"name": "national youth jazz orchestra", "sentiment": "none"}, {"name": "royal northern sinfonia", "sentiment": "none"}, {"name": "newcastle bach choir", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "What's On A feast of jazz is coming to Sage Gateshead with sounds to excite young and old The 13th Gateshead International Jazz Festival will see music from Cuba, Holland, Norway and the North East uniting under one roof Share Trish Clowes, the Tomasz Stanko Quartet, The Ronnie Scott's All Stars and Garibaldi Pop are among some of the artists performing at this year's Gateshead International Jazz Festival Share Get what's on   Thank you for subscribing!   \nThe 13th Gateshead International Jazz Festival takes place next weekend and hopefully, says Ros Rigby, that’s not unlucky. \n“It was the first festival we put on at the Sage back in March 2005,” says Ros, who stepped down last year as programme performance director at the venue but is still closely involved in the jazz festival. \n“The reason was that local jazz enthusiasts and promoters really missed there being a major jazz festival on Tyneside. \n“There used to be one connected to the Newcastle Festival in the old days but that stopped and they felt there wasn’t anywhere bringing major names. \n“There was quite a demand for the Sage to rectify that. \n“With three performance spaces and the concourse we can do an awful lot – and it seems to work very well because people come from outside the area. \n“In fact, 20-30% of visitors are from outside the area. They know they can come up, book into a hotel and see a lot in just a few days.” \nRos says there are other jazz festivals around the country, notably London’s which spans 10 days in November, but Gateshead’s has been referred to as a “gem”. \n“I think the thing that makes it stand out is the relationship with young people. Jambone (Photo: Sage Gateshead) \n“Not only do we offer Jambone, our own youth ensemble, but also this year we’re bringing the finest youth jazz bands from across Europe.” \nShe says with so much talk about Brexit, it was thought important to emphasise connections that don’t recognise national borders. \nSo one concert next Saturday, called Three Nations Under One Groove, will see the National Youth Jazz Orchestra line up with its counterparts from Germany (in the shape of BuJazzO) and Holland (National Jeugd Jazz Orkest – or NJJO). \nRos says: “Rather then performing one after the other they’ll be all mixed up which makes a really good statement about these European connections.” \nAs well as supporting musicians, Ros says the Sage has also been keen to grow a younger audience for jazz. \n“People have a stereotypical image, as they used to have in folk, of beard-stroking men. \n“There’s an element of that still but the image is changing with new bands like GoGo Penguin and Shobaleader One, the new project from Squarepusher who’s a famous DJ.” GoGo Penguin (Photo: Sage Gateshead) \nGoGo Penguin are a Manchester band (Chris Illingworth on piano, Nick Blacka on bass and Rob Turner on drums) whose second album V2.0 was nominated for the Mercury Prize. \nThey share billing at another April 1 concert with Squarepusher’s live band with himself on bass, Strobe Nazard on keys, Arg Nution on guitar and Company Laser on drums. \nIt would be hard to think of a less beard-stroking line-up than that, although of course these days it tends to be the young guys wearing the beards. \nYouth will also have a chance to shine on Friday, says Ros, when two “really, really talented young musician composers” share a stage. Laura Jurd's Dinosaur with Daniel Hersedal (Photo: Sage Gateshead) \nThese are Laura Jurd, who is from this country, with her band Dinosaur and, from Norway, Daniel Herskedal who apparently causes all who hear him to redefine what they imagine to be possible on the tuba. Daniel Herskedal (Photo: Sage Gateshead) \nAs well as their own bands, they will be joined by string players from Royal Northern Sinfonia to perform specially aranged material. \nRos also picks out a splendid-looking Africa/Cuba triple bill on April 2 featuring bassist Richard Bona (originally from Cameroon but now based in the USA), the Alfredo Rogriguez Trio, led by the talented young Cuban pianist, and Shabaka Hutchings and The Ancestors. Read More \nShabaka, a London-born saxophonist, band leader and composer, will perform pieces from new album Wisdom of Elders which was recorded in Johannesburg. Shabaka Hutchins and The Ancestors (Photo: Sage Gateshead) \nIt’s not all about youngsters. Clare Teal and her Hollywood Orchestra will celebrate the genius of Lena Horne, Ella Fitzgerald and others in The First Ladies of Swing on Friday. \nAnd Ros is especially excited by the concert by Instant Composers Pool Orchestra, a renowned group of Dutch composers and improvisers. \nIt’s the first time the whole ensemble has visited the region and it is currently celebrating its 50th anniversary and the 75th birthday of co-founder Han Bennink. Read More Top soloists join Newcastle Bach Choir for a performance of Bach's St Matthew Passion \nThe group performs next Saturday and hosts a masterclass on April 2. \nThere will also be an exhibition of photos of jazz legend Misha Mengelberg, another co-founder of the group, who died recently. \nFor details of all festival dates and tickets visit www.sagegateshead.com or tel. 0191 4434661. Like us on Facebook", "external_links": [], "published": "2017-03-25T19:00:00.000+03:00", "crawled": "2017-03-25T14:28:16.562+03:00", "highlightTitle": ""}