{"organizations": [], "uuid": "617ddb56f3b84a0f551aa8c982fe726293c87f76", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12753770.ece/ALTERNATES/s1200/INDY-REF-2.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/populist-council-north-needed-new-12753792", "country": "GB", "domain_rank": 21960, "title": "A populist Council of the North is needed as new Scottish referendum looms says report", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "A populist Council of the North is needed as new Scottish referendum looms says report", "spam_score": 0.0, "site_type": "news", "published": "2017-03-17T12:00:00.000+02:00", "replies_count": 0, "uuid": "617ddb56f3b84a0f551aa8c982fe726293c87f76"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/populist-council-north-needed-new-12753792", "ord_in_thread": 0, "title": "A populist Council of the North is needed as new Scottish referendum looms says report", "locations": [], "entities": {"persons": [{"name": "council of the north", "sentiment": "negative"}, {"name": "ippr north", "sentiment": "none"}, {"name": "matt jukes", "sentiment": "none"}, {"name": "prescott", "sentiment": "none"}, {"name": "hull", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "cox", "sentiment": "none"}, {"name": "ed cox", "sentiment": "none"}, {"name": "rosie millard", "sentiment": "none"}, {"name": "nicola sturgeon", "sentiment": "none"}], "locations": [{"name": "scotland", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "wales", "sentiment": "none"}, {"name": "north", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "welsh assemblies", "sentiment": "none"}, {"name": "greater london authority", "sentiment": "none"}, {"name": "northern citizens assembly", "sentiment": "none"}, {"name": "ippr north", "sentiment": "none"}, {"name": "northern powerhouse", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "ippr", "sentiment": "none"}, {"name": "assembly", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "whitehall", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "A populist Council of the North is needed as new Scottish referendum looms says report Report says the region needs to act as it is the poor relation to London and Scotland Share First Minister Nicola Sturgeon (Photo: Handout) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nWith a new Scottish referendum back on the political agenda, a ‘Council of the North’ is needed now more than ever, it is claimed. \nA report out today says the urgent need for it is to help the region punch its £300bn economic weight in a UK economy heavily biased towards London and Scotland. \nWritten by Ed Cox, director of the IPPR North think tank, it says post-Brexit , the North needs a voice and powers to match those in the capital and north of the border. \nThis includes a new platform for ordinary people, rather than politicians, to ‘take back control’. \nHe wrote of poor infrastructure, a below average research & development spend and a lower skilled workforce which are “symptoms” of this region’s economic under-performance rather than its cause. Director of IPPR North, Ed Cox (Photo: Handout) \nMr Cox said: “As we leave the EU, city and county leaders will find themselves very small fish in a big global pond if they opt to go it alone. But working together, the North’s £300bn economy carries real clout. \n“Informal working together under the Northern Powerhouse brand has been welcome – but clear evidence shows this is no substitute for proper government and the huge progress made in the capital and Scotland since devolution.” \nThe IPPR North report, called Taking Back Control in the North, draws on what it describes as the latest and most thorough regional academic evidence. The major points outlined are: \n* London and Scotland have benefited enormously from devolution to the extent that they are now effectively ‘decoupled’ from the rest of the UK economy while the North has missed out; \n* Productivity is poorer in the North because it lacks strategic government \n* Previous strategies have targeted the symptoms of regional imbalance such as a lower skills base and worse transport rather than their main cause - weak regional institutions without powers to make big decisions \n* The Northern economy as a whole lacks the co-ordination to work together. \nThe report highlights how Transport for London, the Greater London Authority and other pan-London bodies helped fuel the capital’s growth over recent years, while the North lacks similar organisations. \nNicola Sturgeon this week called for a second referendum, while London is set to write its own industrial strategy. First Minister Nicola Sturgeon (Photo: PA) \nMr Cox said the North of England lacks such strategic leadership, though it has nearly three times the population of Scotland and its £300bn economy, is larger than Wales, Northern Ireland and Scotland combined. \nYet, he said that while Prime Minister Theresa May snubbed an invite to discuss Brexit and the North with the region’s council leaders and took six months to make the decision, the devolved authorities had meetings secured within days. \nThe report says progressives must engage with the populist forces sweeping the world, by giving ordinary people more power over their lives and engaging with strong local identities outside the metropolitan areas. \nIt proposes a Council of the North – made up of the North’s 19 combined authorities and counties – to help the North speak with a single voice, to give it more powers to invest in schemes like HS3 and to compete together on the global stage. \nIn contrast to the London or Welsh Assemblies, to feed the popular appetite to ‘take back control’, rather than creating a Parliament or Assembly with new politicians, the Council of the North would be overseen by a Northern Citizens Assembly of ordinary northerners chosen by lot, as with jury service. Read More Rail chaos at Easter - how will North East passengers be affected \nMr Cox said: “A progressive renewal won’t come from Westminster, but from fresh thinking to address the global desire for people to have more control over the economy, with a distinctive northern approach to the economy that joins together our collective strengths. \n“The Prime Minister herself recognised this mood when she promised voters to ‘do everything we can to give you more control over your lives’ and develop a new industrial strategy. \n“But you can’t do industrial strategy from Whitehall. This is as true today as it was in the 1970s, as the latest research shows that we need something like a Scottish government or GLA to develop plans at real scale. \n“A Council of the North would help boost growth and lead to better public services, while northerners – and not politicians – could find their voice through a Northern Citizens Assembly.” \nThe report will be launched today in Hull, with speakers including broadcaster and chair of Hull city of culture 2017 Rosie Millard; former deputy PM Lord Prescott, and Hull city council chief executive Matt Jukes. Like us on Facebook", "external_links": [], "published": "2017-03-17T12:00:00.000+02:00", "crawled": "2017-03-17T07:07:02.331+02:00", "highlightTitle": ""}