{"organizations": [], "uuid": "f4389941853fcf7ac0939f586ef29f1c52bda107", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12342008.ece/ALTERNATES/s1200/Hitachi-Launches-Its-First-British-built-Intercity-Train.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/nissan-hitachi-warnings-spark-plea-12704910", "country": "GB", "domain_rank": 21960, "title": "Nissan and Hitachi warnings spark plea for assurances to protect North East jobs", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Nissan and Hitachi warnings spark plea for assurances to protect North East jobs", "spam_score": 0.0, "site_type": "news", "published": "2017-03-08T04:00:00.000+02:00", "replies_count": 0, "uuid": "f4389941853fcf7ac0939f586ef29f1c52bda107"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/nissan-hitachi-warnings-spark-plea-12704910", "ord_in_thread": 0, "title": "Nissan and Hitachi warnings spark plea for assurances to protect North East jobs", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "News Nissan and Hitachi warnings spark plea for assurances to protect North East jobs Concern about the impact of Brexit on Nissan and Hitachi was on the agenda at Westminster meeting with Business Secretary Greg Clark Share Click to play Tap to play The video will start in 8 Cancel Play now Watch this video again Video will play in Official launch of a new state of the art press at Nissan's car plant in Sunderland Share this video Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nBusiness Secretary Greg Clark has met representatives of employers and trade unions to discuss concerns about the future of the North East economy following warnings from major manufacturers Nissan and Hitachi. \nJames Ramsbotham, Chief Executive of North East England Chamber of Commerce , Beth Farhat, Regional Secretary of Northern TUC, and Phil Wilson MP, Member of Parliament for Sedgefield in County Durham, met Mr Clark in his office in the House of Parliament on the eve of the Government’s Budget statement. \nThey discussed prospects for the North East economy during the process of leaving the European Union, and once Brexit is complete , including the region’s role as a departure-point for exports to Continental Europe and the importance of overseas students to Durham University. Business secretary Greg Clark (Photo: Joe Giddens/PA Wire) \nTopics covered included warnings from Nissan , the Japanese-owned car-maker, which employs more than 7,000 at its Sunderland plant and warned MPs last month that the future of the factory might be uncertain if the UK left the EU without a trade deal which allowed it to export vehicles, and to import parts from suppliers in EU countries. \nThe private meeting on Tuesday evening also discussed a warning from Hitachi chairman Hiroaki Nakanishi that the future of Hitachi’s £82m manufacturing plant in County Durham might be “troublesome” after 2019. \nIt was seen as a warning that the right Brexit deal is essential to protect the plant. \nSpeaking in advance of the meeting, Mr Ramsbotham said: “We wanted to make sure the Secretary of State is aware of the specific impact as it pertains to the North East of England. \n“From a Westminster perspective, they don’t always see our part of the world and we have very specific interests. \n“We are on the east coast of England with seven ports facing direct to Europe, so it’s not surprising that nearly 60% of our trade goes there. Official launch of a new state of the art press at Nissan's car plant in Sunderland (Photo: Newcastle Chronicle) \n“One in every 10 jobs in the North East depends pretty directly on trade with Europe, and many more will be impacted indirectly if we get it wrong. \n“It’s not about trying to reverse any decision, it’s about saying that if we are going down this route then we need to protect the great industries that we have here.” \nThe futures of Nissan and Hitachi were a major concern, he said. \n“A hell of a lot of not just jobs but the economy as a whole hangs on Nissan, so we need to really put pressure on the Government to make sure they do everything they can to support Nissan. Read More Nissan's 7,000-job Sunderland plant is under threat if there's no EU trade deal \n“Other international investors, who do not have the resources to do the sort of in-depth studies that Hitachi and Nissan do, look to them to give them confidence. Work is carried out on the new Intercity Express trains at the Hitachi Rail Europe site in Newton Aycliffe (Photo: Getty Images Europe) \n“If they hear noises lacking in confidence, which is what the mood music is at the moment, then they are delaying their own investment decision. \n“The North East has been so successful over the years in attracting inward investors. To put that at risk is a significant threat for the region.” \nA paper drawn up by the three North East representatives called on the Government to ensure the UK retains “unimpeded, tariff-free access to the Single Market”, allowing exports to the EU to continue . \nThis would mean not just ensuring there are no tariffs for UK exporters but also ensuring there is no new bureaucracy causing delays in the export process. \nThe Department for Business, Energy & Industrial Strategy said Mr Clark welcomed the opportunity to meet representatives from the region. Read More", "external_links": [], "published": "2017-03-08T04:00:00.000+02:00", "crawled": "2017-03-07T23:28:02.285+02:00", "highlightTitle": ""}