{"organizations": [], "uuid": "5d2de7c8b38a18cc34c529ce0e9f5a42f80e3654", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12743711.ece/ALTERNATES/s1200/WA1140576.jpg", "site_section": "", "section_title": "", "url": "http://www.chroniclelive.co.uk/business/business-news/more-1000-jobs-jeopardy-jones-12743656", "country": "IE", "domain_rank": 21960, "title": "More than 1,000 jobs in jeopardy as Jones Bootmaker calls in advisers - Chronicle Live", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 0, "title_full": "More than 1,000 jobs in jeopardy as Jones Bootmaker calls in advisers - Chronicle Live", "spam_score": 0.214, "site_type": "news", "published": "2017-03-15T16:57:00.000+02:00", "replies_count": 0, "uuid": "5d2de7c8b38a18cc34c529ce0e9f5a42f80e3654"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/more-1000-jobs-jeopardy-jones-12743656", "ord_in_thread": 0, "title": "More than 1,000 jobs in jeopardy as Jones Bootmaker calls in advisers - Chronicle Live", "locations": [], "entities": {"persons": [{"name": "jones bootmaker", "sentiment": "negative"}, {"name": "jones", "sentiment": "none"}, {"name": "david riddiford", "sentiment": "none"}, {"name": "emma", "sentiment": "none"}, {"name": "alteri", "sentiment": "none"}, {"name": "alfred jones", "sentiment": "none"}], "locations": [{"name": "northumberland", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "bayswater", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "brantano", "sentiment": "none"}, {"name": "daily mirror", "sentiment": "none"}, {"name": "more gym group", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "kpmg", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business More than 1,000 jobs in jeopardy as Jones Bootmaker calls in advisers The retailer's owner has filed a notice to appoint administrators for the 160-year-old retailer, which will give it breathing space from creditors Share Jones the Bootmakers (Photo: Daily Mirror) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nMore than 1,000 jobs are at risk at high street chain Jones Bootmaker as its owner scrambles to secure a deal to save it from administration. \nPrivate equity owner Alteri has filed a notice to appoint administrators for the 160-year-old retailer, which will give it breathing space from creditors seeking to recover debts while it seeks a buyer. \nAlteri and advisers KPMG are said to be in negotiations with potential buyers for Jones Bootmaker, which has stores in Newcastle and Durham , and there are understood to be “credible” offers on the table. \nIt is thought Jones could be sold as a going concern or through a so-called pre-pack administration, where the firm is placed in administration but the assets are sold immediately to a new owner. \nPre-pack deals are controversial as they often see buyers ditch unprofitable stores and avoid taking on much of the debt. Read More Northumberland community devastated as factory to close with 450 job losses \nJones Bootmaker employs around 1,145 staff and has 103 stores and concessions across the UK . \nAlteri bought Jones Bootmaker in October 2015 in a £12 million deal, which also included shoe retailer Brantano. \nIt has since sought to turn it around, overhauling ranges and its website, and drafting in former Links of London boss David Riddiford as executive chairman last autumn. \nBut it is believed the chain has continued to struggle amid difficult trading conditions on the high street and rising costs, following last year’s introduction of the national living wage and as the pound’s plunge since the Brexit vote has pushed up buying costs. Read More Gym Group plans more openings after posting first full-year profit \nRetailers are also bracing for a surge in business rates after next month’s revaluation. \nJones Bootmaker dates back to 1857, when Alfred Jones and his wife Emma opened a store in London’s Bayswater. \nThey ran the store from 8am to 8pm and to midnight on Saturdays, while looking after their 11 sons and three daughters. Like us on Facebook ", "external_links": [], "published": "2017-03-15T16:57:00.000+02:00", "crawled": "2017-03-15T22:38:24.350+02:00", "highlightTitle": ""}