{"organizations": [], "uuid": "a6a102e3fdb614a15ad7f9fa95d08e61255f1b07", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12440957.ece/ALTERNATES/s1200/JS108948235.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12803965", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast RECAP: Tesco fined £129m over accounting scandal", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast RECAP: Tesco fined £129m over accounting scandal", "spam_score": 0.0, "site_type": "news", "published": "2017-03-28T15:00:00.000+03:00", "replies_count": 0, "uuid": "a6a102e3fdb614a15ad7f9fa95d08e61255f1b07"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12803965", "ord_in_thread": 0, "title": "Business Breakfast RECAP: Tesco fined £129m over accounting scandal", "locations": [], "entities": {"persons": [{"name": "ruediger grube", "sentiment": "none"}, {"name": "transline", "sentiment": "none"}, {"name": "iain wright", "sentiment": "none"}, {"name": "bulkhaul", "sentiment": "none"}, {"name": "dave lewis", "sentiment": "none"}, {"name": "stephen gibson", "sentiment": "none"}, {"name": "gilbert johnston", "sentiment": "none"}, {"name": "jamie hurst", "sentiment": "none"}, {"name": "tim roache", "sentiment": "none"}, {"name": "preston", "sentiment": "none"}, {"name": "matt goodman", "sentiment": "none"}, {"name": "jennifer hardy", "sentiment": "none"}, {"name": "kennelly", "sentiment": "none"}, {"name": "peter southern", "sentiment": "none"}, {"name": "boro", "sentiment": "none"}, {"name": "gibson o’neill", "sentiment": "none"}, {"name": "iain dey", "sentiment": "none"}, {"name": "paul bryce", "sentiment": "none"}, {"name": "graham parker", "sentiment": "none"}, {"name": "manfred rudhart", "sentiment": "none"}, {"name": "kontainers", "sentiment": "none"}, {"name": "galliford try", "sentiment": "none"}, {"name": "chris kennelly", "sentiment": "none"}, {"name": "andrew bailey", "sentiment": "none"}, {"name": "goodman", "sentiment": "none"}, {"name": "steve gibson", "sentiment": "none"}, {"name": "jimjam", "sentiment": "none"}, {"name": "fever-tree", "sentiment": "none"}, {"name": "steve turner", "sentiment": "none"}, {"name": "omar ali", "sentiment": "none"}, {"name": "charles lee", "sentiment": "none"}, {"name": "mike ashley", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "rockliffe", "sentiment": "none"}, {"name": "sheffield", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "barnsley", "sentiment": "none"}, {"name": "rockliffe hall", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "bradford", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "north tyneside", "sentiment": "none"}, {"name": "nottingham", "sentiment": "none"}, {"name": "derbyshire", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "riverside stadium", "sentiment": "none"}, {"name": "york", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "blackpool", "sentiment": "none"}, {"name": "glasgow", "sentiment": "none"}, {"name": "gateshead international business centre", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}, {"name": "teesside", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}], "organizations": [{"name": "arriva", "sentiment": "negative"}, {"name": "tesco", "sentiment": "negative"}, {"name": "bovis  housebuilder redrow", "sentiment": "none"}, {"name": "transline", "sentiment": "none"}, {"name": "tesco group", "sentiment": "none"}, {"name": "bovis homes", "sentiment": "none"}, {"name": "canary wharf", "sentiment": "none"}, {"name": "bulkhaul limited", "sentiment": "none"}, {"name": "sunday times", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "sfo", "sentiment": "none"}, {"name": "coreena ford redrow", "sentiment": "none"}, {"name": "coreena ford three newcastle", "sentiment": "none"}, {"name": "middlesbrough fc", "sentiment": "none"}, {"name": "premier league", "sentiment": "none"}, {"name": "gibson o’neill company limited", "sentiment": "none"}, {"name": "business committee", "sentiment": "none"}, {"name": "gibson o'neill", "sentiment": "none"}, {"name": "asos", "sentiment": "none"}, {"name": "natwest", "sentiment": "none"}, {"name": "fca", "sentiment": "none"}, {"name": "serious fraud office", "sentiment": "none"}, {"name": "coreena ford", "sentiment": "none"}, {"name": "redrow", "sentiment": "none"}, {"name": "deutsche bahn", "sentiment": "none"}, {"name": "gmb", "sentiment": "none"}, {"name": "boro", "sentiment": "none"}, {"name": "jimjam physiotherapy", "sentiment": "none"}, {"name": "financial conduct authority", "sentiment": "none"}, {"name": "leeds", "sentiment": "none"}, {"name": "maserati", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "coreena ford financial", "sentiment": "none"}, {"name": "kpmg", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "kontainers", "sentiment": "none"}, {"name": "bovis", "sentiment": "none"}, {"name": "tesco stores", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "coreena ford middlesbrough fc", "sentiment": "none"}, {"name": "ey item club", "sentiment": "none"}, {"name": "futsal partnership", "sentiment": "none"}, {"name": "coreena ford recruitment", "sentiment": "none"}, {"name": "arrival rail north", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "One pound coin on fluctuating graph 8.45 Coreena Ford North East transport giant Arriva boost sales to £4.32bn after launch of new rail franchise \nWearside transport giant Arriva boosted sales to more than £4.32bn after a successful year saw it take over the Northern rail franchise. \nSunderland-based Arriva, which forms part of German group Deutsche Bahn, has published annual results for 2016 showing revenues increasing 5.2% to €5.093bn, which has triggered investment of more than €359m (£309m) in its UK and European businesses, 30% more than the previous year. \nChief executive Manfred Rudhart said Arriva increased its UK spending power to €133m (£114.8m) in 2016, which it used to investment on improving customer experience, including new and improved buses and trains, station improvements and innovations such as mobile ticketing apps and the roll-out of contactless payments on buses. \nPlans to float a 45% share in the business were abandoned after the Brexit vote, with Deutsche Bahn chief executive Ruediger Grube saying a sale “would be throwing money out of the window, and acting that way would be foolish.” \nA key highlight for the firm was the launch of the Northern rail franchise, which it will operate until at least 2025. \nAs part of the deal, which sees Arriva run routes connecting Leeds, Sheffield, Nottingham, York, Manchester, Bradford, Preston and Blackpool, the Arrival Rail North director pledged a whole package of improvements for travellers, including free WiFi by 2019 and more frequent services. \nSince taking over the contract Arriva has begun investing in an extensive modernisation programme to enhance services for the 90m passengers who use the network every year, having pledged to spend spend £1bn across the north, with £400m of that on new trains. Arriva chief executive Manfred Rudhart 8.40 Coreena Ford Three Newcastle firms make list of UK's top 100 'disruptor' businesses \nThree Newcastle companies have taken their place among some of the country’s best known firms in a list of the UK’s top disruptors. \nIndoor football group The Futsal Partnership, shipping container business Kontainers, and coffee company Clockwork Espresso have been included in the Maserati 100 index, which is billed as the “definitive list of 100 game-changing British business disruptors”. \nThe list has been put together by luxury car maker Maserati and The Sunday Times, and includes the likes of craft brewery Brewdog, Candy Crush developer King Digital, Hotel Chocolat, and Just Eat. \nSunday Times business editor Iain Dey said: “Business disruption has allowed start-up entrepreneurs to turn the tables on big business through innovation. With this year’s Maserati 100, we are paying tribute to some of the many business disruptors in the United Kingdom – from successes like Fever-Tree to start-ups like About the Funeral.” \nThe Futsal Partnership was founded in Newcastle four years ago by Matt Goodman. The company uses the latest coaching theories to teach children how to play football. \nFutsal has grown to offer classes in Durham, Northumberland, Glasgow, Sunderland and Teesside. Mr Goodman plans to franchise the business and is currently working on opening a Futsal Partnership in North Tyneside. \nKontainers was launched three years ago by Charles Lee and Graham Parker. The business has been described as the ‘Expedia of shipping’ and allows users to book shipping containers online. \nThe duo are in the process of expanding the business after receiving $1.3m in seed funding in 2015. \nThe business was launched by 27-year-old entrepreneur Peter Southern, who is now selling his product in more than 35 countries. \nLast year Clockwork Espresso won a share of a £10,000 cash prize to help kick-start the business. The business won the money during its time working with the Entrepreneurial Spark programme, run by Natwest. \nOver half of the firms named in the list are based in London, but the three Newcastle companies were part of the 25% founded in Northern cities. 8.35 KEY EVENT Tesco compensation bill to top £85m \nTesco has said the compensation bill for investors was expected to reach around £85m and will be overseen by accountancy giant KPMG. \nIt said each net buyer of shares over the period will be entitled to 24.5p per share purchased, alongside interest of 1.25% per year if the buyer is an institutional investor and 4% per year if the buyer is a retail investor. \nThe interest period runs from September 19 2014 to around four months after the scheme opened. \nThe penalty, compensation scheme and costs will lead to an exceptional charge of £235m which will be booked in its annual results on April 12. \nDespite the compensation agreement, Tesco said the FCA had “expressly stated” that it was not suggesting the Tesco board of directors “knew, or could reasonably be expected to have known” that information in the trading statement was false or misleading. \nFCA chief executive Andrew Bailey said: “Dissemination of information that gives a false or misleading impression as to traded securities harms the integrity of our markets. \n“The FCA is committed to UK markets being fair, transparent and thus competitive. \n“Tesco and its board are doing the right thing here, taking appropriate responsibility and agreeing to rectify the consequences of the misconduct. \n“They have co-operated fully with us and this sets a good example for the market and so is a good outcome for Tesco and investors.” 8.30 Coreena Ford Middlesbrough FC promotion leads to big fall in profits at parent company Gibson O'Neill \nThe parent company of Middlesbrough FC saw a big dip in profits last year as a result of the team’s promotion push. \nGibson O’Neill Company Limited, which is the parent company of three businesses including the Premiership team, saw its operating profit fall from £27.3m in 2015 to £9.2m last year, with the drop profitability was attributed to “the costs incurred by MFC in achieving promotion”. \nThe company’s two other businesses, transport firm Bulkhaul Limited and the Rockliffe Hall hotel, both had strong financial results during the year. \nIn Gibson O’Neill’s results, director and Boro chairman Stephen Gibson said: “As reflected in their respective financial statements, Bulkhaul has continued to perform strongly in the year covered by these financial statements, committing to its long term confident outlook by continuing to take delivery of newly built tanks to increase its already considerable fleet of owned tank containers. \n“Rockliffe has continued to perform well with year on year growth in revenue streams and continued capital developments, notable the extended spa facility with further growth forecast. \nGibson O’Neill’s total turnover increased by 3.2% to £201.5m for the year ending June 30 2016. \nBulkhaul, which specialises in the transportation of container tanks, saw its turnover increase by 2.8% from £164.7m to £169.3m. \nMeanwhile Rockliffe Hall added nearly £700,000 to its top line, bringing its revenue to £10.7m. The Darlington-based hotel houses a spa and golf course. \nAlthough Middlesbrough FC also saw its turnover grow by £1.1m to £21.5m, the increased costs of the club being promoted to the Premier League were blamed for the overall loss. Boro fans and players at the Riverside Stadium and (inset) Steve Gibson 8.25 Coreena Ford Recruitment agency acting for Sport Direct to be quizzed by MPs \nThe recruitment agency which supplies staff to retail giant Sports Direct faces a grilling by MPs later today as part of an inquiry into workers’ rights. \nTransline is being brought before the Business Committee for a second time to be quizzed about the benefits of agency work and restrictions to their terms and conditions. \nThe committee has previously complained workers at the sportswear retailer’s warehouse in Derbyshire were treated without dignity or respect. \nTransline was accused of misleading MPs, a charge it denied, prompting committee chairman Iain Wright to call on Sports Direct’s founder, Mike Ashley, to axe the firm last year. \nTransline’s finance director Jennifer Hardy, who was questioned by MPs during last year’s inquiry, will appear again today. \nSince working practices at Sports Direct came under attack, Transline has also come under fire over working conditions at Asos’s warehouse in Barnsley. \nThe employment agency’s deal with Amazon was axed by the online giant earlier this month. \nMPs will also hear from Steve Turner, assistant general secretary of Unite, which has led the campaign to improve workers’ rights at Sports Direct, and Tim Roache, leader of the GMB, which has been highlighting working conditions at Asos. Mike Ashley inside the Sports Direct warehouse 8.20 Coreena Ford Financial services will recover, says report \nBritain’s financial services will experience slower growth over the next two years owing to Brexit pressures but will start to recover by 2020, a new report shows. \nEconomic challenges - including higher inflation on the back of the pound’s collapse - are expected to dent real income and knock consumer and business lending growth, according to the EY ITEM Club outlook for financial services. \nHowever, the sector is expected to see lending and asset total rise in the long-term. \nMortgage lending growth is set to slow to 1.4% this year before dipping to 0.1% in 2018 but will “pick up” from 2019, with total mortgages set to rise from £1.1 billion in 2018 to £1.2 billion in 2020. \nMeanwhile, banking assets - which totalled £7 billion in 2016 - are on track to increase by 1.5% in 2017 but “shrink slightly” in 2018 before growing to £7.3 billion in 2020. \nThe report notes that banks are in a “good position to weather challenging market developments” thanks to higher quality assets and investment in long-term business models. \nEY UK’s financial services managing partner Omar Ali said: “Brexit and wider geopolitics have injected a level of uncertainty and volatility we have not seen for some years but the fundamentals of the UK financial services industry remain strong. \n“Lending is predicted to increase, perhaps not as much as we had hoped, but it is still growing. \n“This is good news for the UK as a whole as it means financial services can continue to play an important role in supporting the growth of the wider economy.” The report comes ahead of the official trigger of Article 50 tomorrow, which will launch Britain into Brexit negotiations with the EU. The skyline of Canary Wharf as a report suggests the financial services industry will bounce back from a Brexit blip 8.15 Coreena Ford JimJam brings physiotherapy to the 21st century \nA Gateshead start-up is cutting physiotherapy waiting times and costs for patients by arranging video call appointments online. \nJimJam Physiotherapy is using technology to improve medical appointments by connecting patients with professionals using a “Skype-style consultations”. \nBased in the Gateshead International Business Centre, JimJam was founded by entrepreneurs Jamie Hurst, Paul Bryce, and Chris Kennelly. \nSpeaking about the new venture Mr Kennelly said: “A lot of my friends are physiotherapists so the idea of combining physiotherapy delivery with technology had been kicking around in the back of my head for some time. \n“Telephone consultations have been around for quite a while and whilst they are clinically very effective, patient feedback is often not fantastic. The thought was ‘how can we make this better?’ \n“And the answer was if we can combine the telephone model, which is tried and tested, with the physios being able to see the patient. That is the first step in improving the clinical model and patient satisfaction.” \nJimJam appointments cost £19.99 and can be available to users within an hour using a laptop. The service is available using internet browsers but a mobile app is set to be launched next month. \nAfter the virtual meeting patients are provided with a rehabilitation programme from their physiotherapist. The patient can also replay the consultation as well as view videos explaining how to carry out their exercises. \nThe start-up has already been approached by companies looking to use JimJam as an occupational health provider. It is hoped that the use of the system will lower absenteeism and promote wellbeing in the workplace. Chris Kennelly (Photo: Gilbert Johnston) 8.10 Coreena Ford Redrow pulls out of pursuit of housebuilder Bovis \nHousebuilder Redrow has pulled out of the takeover tussle for under-pressure rival Bovis Homes, saying it would not return with a higher offer. \nRedrow said it was giving up its pursuit because it had decided it was “not in its shareholders’ best interests to increase its proposal” after its initial approach was rebuffed by Bovis just over two weeks ago. \nFlintshire-based Redrow had been competing against rival suitor Galliford Try, who are still in talks with Bovis despite seeing its initial all-share proposal \nRedrow said that, following its move to withdraw from the bidding battle, it would focus instead on its “highly successful” growth strategy. \nIt added: “Redrow’s strong land bank and disciplined approach to its operations means it is well-placed to both continue to grow its profits and progressively increase dividend payout.” \nKent-based Bovis saw its chief executive quit in January after warning over profits following its failure to build enough homes on time. \nIt was rocked by customer complaints over the poor quality of its homes, which were sold unfinished and were plagued by electrical and plumbing faults. \nThe firm announced in February that annual pre-tax profits were down 3% to £154.7m, as it set aside £7m to cover remedial work and compensation for affected customers and revealed a raft of measures to improve the service. \nIts share price has also tumbled since Britain voted to leave the European Union, making it vulnerable to a takeover tilt from a competitor. \nIf talks with Galliford Try are successful, a takeover would create one Britain’s biggest housebuilders capable of producing of 7,000 homes a year, with a combined market capitalisation of £2.4bn. A Bovis Homes development Coreena Ford FTSE and pound latest \nThe pound at 8am was 1.2559 dollars compared to 1.2582 dollars at the previous close. The euro at 8am was 0.8643 pounds compared to 0.8649 pounds at the previous close. \nThe FTSE-100 index at 7:44am was unchanged at 7293.50. 8.00 KEY EVENT Tesco fined £129m over accounting scandal \nTesco has been hit with a £129 million fine from the Serious Fraud Office (SFO), but has escaped prosecution over its accounting scandal. \nThe supermarket giant said its subsidiary - Tesco Stores - has reached a Deferred Prosecution Agreement with the SFO following a two-year investigation into false accounting at the firm. \nThe move means Britain’s biggest supermarket will escape prosecution as long as it “fulfils certain requirements”, including paying a hefty penalty. \nThe announcement came as the financial watchdog found that Tesco had committed market abuse when it inflated profits by £263 million - later revised up to £326 million - in a trading update on August 29 2014. \nIn an unprecedented move, the Financial Conduct Authority said it had forced the supermarket to compensate investors who had bought shares and bonds on - or after - August 29 and had held the securities when the statement was later corrected on September 22 2014. \nTesco chief executive Dave Lewis said: “Over the last two-and-a-half years, we have fully co-operated with this investigation into historic accounting practices, while at the same time fundamentally transforming our business. \n“We sincerely regret the issues which occurred in 2014 and we are committed to doing everything we can to continue to restore trust in our business and brand.” Tesco Group Chief Executive Dave Lewis (Photo: Tesco/PA Wire) Share", "external_links": [], "published": "2017-03-28T15:00:00.000+03:00", "crawled": "2017-03-28T12:23:06.310+03:00", "highlightTitle": ""}