{"organizations": [], "uuid": "b0ae80f4b6765b430d312e2fa539ec3383aba23b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12713214.ece/ALTERNATES/s1200/BPP_MDG_080317budget_700JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/budget-2017-what-people-streets-12713084", "country": "GB", "domain_rank": 21960, "title": "Budget 2017: What do people on the streets of Newcastle think of the Chancellor's plans?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Budget 2017: What do people on the streets of Newcastle think of the Chancellor's plans?", "spam_score": 0.0, "site_type": "news", "published": "2017-03-09T00:31:00.000+02:00", "replies_count": 0, "uuid": "b0ae80f4b6765b430d312e2fa539ec3383aba23b"}, "author": "Hannah Graham", "url": "http://www.chroniclelive.co.uk/news/north-east-news/budget-2017-what-people-streets-12713084", "ord_in_thread": 0, "title": "Budget 2017: What do people on the streets of Newcastle think of the Chancellor's plans?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily   \nThe politicians have had their say - but we wanted to know what the people of Newcastle thought of how their public money is set to be used. \nThe general response to Wednesday’s Budget was underwhelming. \nIan Clarkin, of Mmm...and Glug food and drink shop in the Grainger Market , said: “It’s a bit of a nothing Budget really, there didn’t seem to be much to it.” Ian Clarkin, Co Owner at Mmm.. and Glug (Photo: Newcastle Chronicle) \nHe felt there could have been more support for businesses, with the relief funding for firms coming out of small business rate relief not going far enough. \nPensioner Raymond Watson, 66, said: “Essentially it’s a cautious budget, not spending too much, a little bit here a little bit there, trying to keep the money back for any changes or any problems we have with Brexit.” Raymond Watson, Pensioner (Photo: Newcastle Chronicle) \nMr Watson said in general he agreed with this caution, although he would have welcomed more money for social care. Read More Budget 2017 - 'broken' manifesto promises and no Brexit mention - social media response \nThe Government has been under pressure from cash-strapped councils to increase social care budgets, and Mr Hammond today announced £2bn in funding over the next three years. \nHowever, some have said this doesn’t go far enough — according to the BBC, a Liberal Democrat spokesperson said the announcement “gives sticking plasters a bad name”. \nIn Newcastle, many welcomed the announcement of increased funding for technical education, including student loan-style funding for technical qualifications and new ‘T-levels’ on a par with A Levels. Read More \nGrandfather Nigel Swindells, a cobbler, said he agreed vocational teaching was in need of a boost. Nigel Swindells, Grandfather (Photo: Newcastle Chronicle) \nHe said: “That’s got to help the grandkids.” Read More Budget 2017: What have we learned from the Chancellor's big statement? \nWhile many were surprised to hear little mention of Brexit in the Chancellor’s speech, student Scarlett Eddie, 19, said she wasn’t shocked not to be offered more clarity on how last year’s biggest political even might affect this year’s Government finances. Scarlett Eddie, Student (Photo: Newcastle Chronicle) \n“It doesn’t surprise me,” she said. “It does annoy me though.” Katie Deacon, Co Owner at Pet Lamb Patisserie (Photo: Newcastle Chronicle) \nSome commentators have condemned the Government’s announcement of National Insurance increases for the self-employed as manifesto-breaking, however Katie Deacon, co-owner of Pet Lamb Patisserie in the Grainger Market, who counts as self-employed, said she thought the move was a fair way to raise extra funds for important services. Like us on Facebook", "external_links": [], "published": "2017-03-09T00:31:00.000+02:00", "crawled": "2017-03-08T20:10:23.149+02:00", "highlightTitle": ""}