{"organizations": [], "uuid": "c107aa1c5f7a0e5ded3ffc1181b9221b2655e006", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30197647/15901743.jpg", "site_section": "", "section_title": "", "url": "http://www.devonlive.com/motion-made-to-protect-devon-s-nature-after-brexit/story-30197647-detail/story.html", "country": "US", "title": "Motion made to protect Devon's nature after Brexit | Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "Motion made to protect Devon's nature after Brexit | Devon Live", "spam_score": 0.178, "site_type": "news", "published": "2017-03-12T18:04:00.000+02:00", "replies_count": 0, "uuid": "c107aa1c5f7a0e5ded3ffc1181b9221b2655e006"}, "author": "", "url": "http://www.devonlive.com/motion-made-to-protect-devon-s-nature-after-brexit/story-30197647-detail/story.html", "ord_in_thread": 0, "title": "Motion made to protect Devon's nature after Brexit | Devon Live", "locations": [], "entities": {"persons": [{"name": "devon", "sentiment": "none"}, {"name": "tamar estuaries", "sentiment": "none"}, {"name": "claire wright", "sentiment": "none"}, {"name": "braunton burrows", "sentiment": "none"}, {"name": "dawlish warren", "sentiment": "none"}], "locations": [{"name": "lundy island", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "aylesbeare", "sentiment": "none"}, {"name": "devon county", "sentiment": "none"}, {"name": "east devon", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}], "organizations": [{"name": "commen", "sentiment": "none"}, {"name": "devon county council", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "the exe estuary", "sentiment": "none"}, {"name": "environmental audit committee", "sentiment": "none"}, {"name": "woodbury commons", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "ottery st mary", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Motion made to protect Devon's nature after Brexit By anitamerritt | Posted: March 12, 2017 0 COMMENTS SHARES Motion made to protect Devon's nature after Brexit X \nCopy link to paste in your message / Comments (0) \nA motion calling to protect Devon's nature from the risks of leaving the European Union has been endorsed by Devon County Council's cabinet. \nIt has been recommended to full council next month that councillors support a coalition of green charities and a government environmental committee, asking the government to apply at least the same level of protection in UK law as exists under EU law. \nThere are currently 22 sites across the county, covering 115,000 hectares, that are protected under EU legislation - the Habitats and Birds Directives. \nThese include The Exe Estuary, Dawlish Warren, the Pebblebed Heaths, such as at Aylesbeare and Woodbury Commons, Braunton Burrows and large parts of Dartmoor, Exmoor and sections of Devon's coast and coastal waters. \nAll are also designated Sites of Special Scientific interest and receive some protection under UK legislation. \nA number of species which are found in Devon such as the dormouse, otter and bats are given extra protection under EU legislation. These directives will no longer apply in their current form in UK law, even if the UK remains in the single market. Read next: Devon police officer suffers broken leg after being called to \"out of hand\" party \nAt the same time as all of these sites are set to lose this high level of protection under EU law, the latest State of Nature report outlined catastrophic news of our wildlife, finding that 15 per cent of those studied are threatened with extinction. 97 per cent of all wildflower meadows have been lost since the 1930s. \nThe Environmental Audit Committee has also outlined the dangers of not applying the same protections and urged the government to take action. \nThe motion has been called for by Devon county councillor Claire Wright who represents Ottery St Mary rural ward. \nShe said: \"It's brilliant that the cabinet has supported my motion. Devon is home to many scarce and threatened habitats such our ancient woodlands, rivers and wetlands, upland blanket bogs, lowland heaths, Culm grasslands and our stunning coast and marine environments. \n\"These support a myriad of species with internationally important populations of marsh fritillary butterflies, greater horseshoe bats, otters, overwintering waders and marine creatures including whales, dolphins and basking shark. \n\"European Union Habitats Regulations protection of land and seascapes such as the pebblebed heaths in East Devon, large swathes of Dartmoor and Exmoor, the Exe and Tamar Estuaries and Lundy Island have meant that wildlife has flourished over the years and has ensured that these places remain crucial international strongholds. \n\"The latest State of Nature report published last October found that the UK has experienced huge losses of habitat and wildlife, and 15 per cent of those studied are threatened with extinction. \n\"Leaving the European Union puts at risk all of these protections, and the government has not yet promised to retain the same level of protections that currently exist under EU legislation. \n\"This council recognises the huge importance of these rich landscapes for people and wildlife in Devon, and calls upon the secretary of state for the environment to support the Environmental Audit Committee, as well as the coalition of wildlife and nature organisations, asking for retention of at least the same level of protection for our wildlife and environment, as takes place currently under EU law.\" \nThe motion will be debated at full council on Thursday, April 27. ", "external_links": [], "published": "2017-03-12T18:04:00.000+02:00", "crawled": "2017-03-12T13:55:51.249+02:00", "highlightTitle": ""}