{"organizations": [], "uuid": "46e47ba1012fbcd9e0f2ce80df3182a7972ed1f0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30215330/15915068.jpg", "site_section": "http://www.topix.com/rss/wire/business/insurance", "section_title": "", "url": "http://www.devonlive.com/back-the-south-west-campaign-enters-new-phase/story-30215330-detail/story.html", "country": "US", "title": "Prosperity tops Back The South West campaign", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "Prosperity tops Back The South West campaign", "spam_score": 0.0, "site_type": "news", "published": "2017-03-20T17:38:00.000+02:00", "replies_count": 0, "uuid": "46e47ba1012fbcd9e0f2ce80df3182a7972ed1f0"}, "author": "", "url": "http://www.devonlive.com/back-the-south-west-campaign-enters-new-phase/story-30215330-detail/story.html", "ord_in_thread": 0, "title": "Prosperity tops Back The South West campaign", "locations": [], "entities": {"persons": [{"name": "chris loughlin", "sentiment": "none"}, {"name": "steve hindley", "sentiment": "none"}, {"name": "stephens scown", "sentiment": "none"}, {"name": "ben", "sentiment": "none"}, {"name": "kim conchie", "sentiment": "none"}, {"name": "foot anstey", "sentiment": "none"}, {"name": "ben bradshaw", "sentiment": "none"}, {"name": "derek phillips", "sentiment": "none"}], "locations": [{"name": "south west", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "exeter chamber", "sentiment": "none"}, {"name": "scilly", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "south west lep", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "pennon", "sentiment": "none"}, {"name": "cornwall", "sentiment": "none"}], "organizations": [{"name": "exeter", "sentiment": "none"}, {"name": "exeter chamber", "sentiment": "none"}, {"name": "cornwall chamber of commerce", "sentiment": "none"}, {"name": "local enterprise partnerships for cornwall", "sentiment": "none"}, {"name": "local enterprise partnerships", "sentiment": "none"}, {"name": "falmouth university", "sentiment": "none"}, {"name": "pennon group", "sentiment": "none"}, {"name": "mole valley farmers", "sentiment": "none"}, {"name": "cornwall business council", "sentiment": "none"}, {"name": "university of exeter", "sentiment": "none"}, {"name": "national insurance", "sentiment": "none"}, {"name": "south west investment group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Prosperity tops Back The South West campaign By HannahFinch | Posted: March 20, 2017 0 COMMENTS SHARES Prosperity tops Back The South West campaign X \nCopy link to paste in your message / \nRead next: We are ready to lead industrial transformation \nPennon Group which was a key force behind the campaign last year, has returned to build on the success that saw the South West Growth Charter delivered right to the heart of Government. \nPennon Group chief executive Chris Loughlin said: \"As one of the region's largest businesses and employers, we at Pennon are committed to playing our part in delivering sustainable growth for the South West.\"We're delighted to be joining forces with the Western Morning News to support the second phase of the #BacktheSouthWest campaign.\"The campaign has already achieved so much but it's important we keep up the momentum and continue to work together as a business community, alongside the Local Enterprise Partnerships, the region's MPs, government and academics to pursue regional growth and secure a great future for the South West.\" \nRead next: Virtual reality will lead growth for tech firms in Devon \nThe campaign was launched last year by the Western Morning News with the Pennon Group and supported by the Local Enterprise Partnerships for Cornwall and the Isles of Scilly and the Heart of the South West. \nIt culminated in the South West Growth Charter, a plan that outlines commitments from the business community and requests of government to help build economic prosperity for the region. The charter calls for a new government partnership for the region, similar to the \"Midlands Engine\". \nThe University of Exeter, Falmouth University, Foot Anstey, Mole Valley Farmers, Stephens Scown and South West Investment Group have pledged support to the campaign. It demonstrates a unified voice from some of the biggest employers in the region.The rural geography of Cornwall and Devon means it is even more vital that businesses, economic leaders and academics pull together for the good of the region. \nCornwall Chamber of Commerce chief executive Kim Conchie said the Government's U-turn on National Insurance was an exemplar of the power of a unified voice from the business community. He said: \"It showed what can be achieved when we work together.\"If the South West can speak as one voice on issues that truly matter to us, then imagine what can be achieved.\" \nThe plan for 2017 is to build on the foundations laid in the first months of the campaign which culminated in the South West Growth Charter being delivered to Downing Street in November.It builds on the work taking place right throughout the region to grow the regional economy. \nThis month, Exeter Chamber members met with Exeter MP Ben Bradshaw to highlight business rate revaluation, Brexit, immigrant workers and the skills agenda. \nRead next: Well-paid Exeter workers are the most productive in the West \nDerek Phillips, vice-president of Exeter Chamber, said: \"The potential difficulties should the city be unable to recruit European workers was discussed and is a major concern for many employers.\"Lack of progress on the devolution agenda for this area was another concern. The apparently unfair revaluation of business rates and, equally importantly, the almost impossible obstacles to registering an appeal were raised. Ben agreed to pursue these concerns on behalf of the Exeter business community.\" \nLast week, Steve Hindley, Chairman of the Heart of the South West LEP, told the Devon and Cornwall Business Council that devolution was effectively off the agenda at the moment.He said that meeting demands set out in the Government's Industrial Strategy was the best way to unlock funding to grow the region's science and innovation sectors, improving infrastructure and encouraging inward investment. News", "external_links": [], "published": "2017-03-20T17:38:00.000+02:00", "crawled": "2017-03-20T12:57:15.256+02:00", "highlightTitle": ""}