{"organizations": [], "uuid": "66738b9f1a34d9848031c3799636c8de1c45bc54", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12077008.ece/ALTERNATES/s1200/JS103248462.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/john-lewis-boss-warns-job-12820877", "country": "GB", "domain_rank": 21960, "title": "John Lewis boss warns of job losses and price rises as firm faces 'challenging time'", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "John Lewis boss warns of job losses and price rises as firm faces 'challenging time'", "spam_score": 0.0, "site_type": "news", "published": "2017-03-30T21:50:00.000+03:00", "replies_count": 0, "uuid": "66738b9f1a34d9848031c3799636c8de1c45bc54"}, "author": "Agency Staff", "url": "http://www.chroniclelive.co.uk/business/business-news/john-lewis-boss-warns-job-12820877", "ord_in_thread": 0, "title": "John Lewis boss warns of job losses and price rises as firm faces 'challenging time'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Business John Lewis boss warns of job losses and price rises as firm faces 'challenging time' Paula Nickolds wants to expand John Lewis' personal shopper offering and bring in other changes to the popular retail firm Share Paula Nickolds, managing director of John Lewis (Photo: Greg Funnell/PA Wire) Share Get business   \nThe new boss at department store chain John Lewis has laid bare the difficulties she faces as she warned over a “turbulent and challenging” high street amid cost pressures from the pound and a dramatic shift in consumer spending. \nPaula Nickolds - who in January became the first female managing director in the chain’s 152-year history - said the group was facing “significant” input cost hikes from the Brexit-hit pound , with around 70% of its products imported, but said it “remained to be seen” how much of this would be passed on to the consumer. \nShe cautioned this was compounding already difficult trading conditions, as consumers are switching spending away from clothes towards eating out and holidays. \nShe said: “I’m taking over at a turbulent and challenging time. \n“This is a tough environment and there will be casualties - we can’t be under any illusion on that.” \nShe confirmed there would be more job losses across the group this year, following from the announcement last month that nearly 400 jobs were being axed, but declined to give numbers. \nSir Charlie Mayfield, chairman of the John Lewis Partnership, had already warned at the group’s results earlier this month that there would be a “continual gradual decline” of jobs. Department store chain John Lewis (Photo: PA) \nMs Nickolds outlined changes to modernise stores and help the group ride out tougher trading, with a new target to increase exclusive brand partnerships and include more “experiences” to lure shoppers back into shops. \nJohn Lewis said around 38% of its one million products are exclusive partnership products, such as Loaf sofas and Leon cookware, or own-brands - but it wants to expand this to 50% across the department store chain. \n“Customers are telling us they want this - they want things they can only buy from us,” said Ms Nickolds. \nDespite only being 12 weeks into her tenure, Ms Nickolds has already made some fundamental changes, such as slashing the firm’s 90-day returns policy to 35 days. Read More \nAnd she said more changes are on the way. \n“We’re on a mission,” she said, flagging up announcements due in the coming weeks and months. \nThis will include more “experiential” launches, following on from the success of its rooftop pop-up restaurant The Gardening Society, on top of their Oxford Street store. \nThe group also wants to expand its so-called bookable partner offering, where customers can set up appointments with personal shoppers and department experts. \nMs Nickolds is the latest retail boss to flag up gloomy trading conditions, after Next chief executive Lord Wolfson last week unveiled the group’s first fall in annual profits for eight years and warned 2017 is set to be “another tough year”. \nThe John Lewis Partnership recently announced it was slashing its staff bonus to 6% of annual salary - the lowest since the 1950s - despite posting a 21.2% increase in annual underlying pre-tax profits to £370.4m. Read More Take a look at Newcastle restaurant Blackfriars' new dining areas \nMs Nickolds - a self-confessed shopping “junkie” - said her plan to offset difficult conditions is to go back to basics and be “utterly, relentlessly focused on the customer”. \nShe said it was an “honour and a privilege” to take on the top job - one of the most powerful and coveted jobs in British retail. \nShe took over from long-serving boss Andy Street, who stepped down after joining the West Midlands mayoral race. \nMs Nickolds was promoted from commercial director, having joined the partnership in 1994 as a graduate trainee. Like us on Facebook", "external_links": [], "published": "2017-03-30T21:50:00.000+03:00", "crawled": "2017-03-30T17:09:57.052+03:00", "highlightTitle": ""}