{"organizations": [], "uuid": "6bca0c3d8ac67de89c2c03ee51ccff32ff499b7f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30174860/15885050.jpg", "site_section": "http://www.middevongazette.co.uk/news.rss", "section_title": "Devon Live news RSS feed", "url": "http://www.devonlive.com/pasties-could-soon-go-up-in-price-thanks-to-brexit/story-30174860-detail/story.html", "country": "GB", "title": "Pasties could soon go up in price thanks to Brexit", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "Pasties could soon go up in price thanks to Brexit", "spam_score": 0.0, "site_type": "news", "published": "2017-03-02T20:32:00.000+02:00", "replies_count": 0, "uuid": "6bca0c3d8ac67de89c2c03ee51ccff32ff499b7f"}, "author": "AbbieBray", "url": "http://www.devonlive.com/pasties-could-soon-go-up-in-price-thanks-to-brexit/story-30174860-detail/story.html", "ord_in_thread": 0, "title": "Pasties could soon go up in price thanks to Brexit", "locations": [], "entities": {"persons": [{"name": "morrison", "sentiment": "none"}, {"name": "mysupermarket", "sentiment": "none"}, {"name": "cornish", "sentiment": "none"}, {"name": "teresa wickham", "sentiment": "none"}], "locations": [{"name": "brexit pasties", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "cornwall", "sentiment": "none"}], "organizations": [{"name": "asda", "sentiment": "none"}, {"name": "sainsbury", "sentiment": "none"}, {"name": "tripadvisor", "sentiment": "none"}, {"name": "morrisons", "sentiment": "none"}, {"name": "cornish pasty association", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "tesco", "sentiment": "none"}, {"name": "brexit   comments", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Pasties could soon go up in price thanks to Brexit By AbbieBray | Posted: March 02, 2017 0 COMMENTS SHARES The price of pasties are set to go up in price Pasties could soon go up in price thanks to Brexit   Comments (0) \nThe price of certain foods, including pasties , are set to go up in price and it is being blamed on the UK's decision to leave the EU. \nWith nearly half of all food consumed in Britain is imported, the slump in the pound following the EU referendum has forced the price of food up from wheat to butter , cheese, meat and vegetables. Which means that our beloved pasties could end up costing more. \nA survey by MySupermarket of 175,000 products, commissioned by Channel 4 Dispatches, compared average prices of food categories form June 23, 2016, and January 31, 2017. \nInvestigators found price rises of more than 5% across a range of essential food categories in our leading supermarkets, including Morrisons, Tesco, Sainsbury's and Asda. \nIn Tesco, the price of flour rose by 6.1%, while in Sainsbury's, bags of frozen vegetables rose by 5.5%. \nAsda's prices for bottles of chilled juice increased by 6.6% and Morrison's, tubs of ice cream soared by 8.2%. \nRead more: We spend a night at the hotel rated the worst in Devon by TripAdvisor users \nFood expert Teresa Wickham said: \"There is fierce competition on within the industry with huge volumes and low margins. \n\"Over the past two decades those margins are forever being squeezed and now the Brexit vote, leading to the devalued pound is a massive hurdle. \n\"However, those shoppers who are clever about their purchases and weekly shop can still keep their costs down by studying prices of fruit and vegetables and knowing where to look for deals.\" \nAccording to the Cornish Pasty Association, the pasty is worth over £65million to Cornwall's economy. \nCurrently the Cornish pasty is protected by a Protected Geographical Indication (PGI) status, which was granted by the EU. \nThe status ensures that only those producing genuine products are able to call them Cornish pasties . \nRead more: Are these the top 50 restaurants in Devon? \nThe news comes days after Britons were left fighting over rocket salad, carrots and courgettes as shops ran out when a bad winter and poor harvest in Spain reduced vegetable production to virtually nothing. \nAs food prices go up and supermarkets are hit in the wallet, they could be tempted not to push prices up but could resort to shrinkflation instead. \nThe phenomenon of so called \"shrinkflation\" is when companies and supermarkets reduce the size of products but the price remains the same. \nIf shrinkflation becomes more widespread we could see pasties shrink in size with prices staying staying the same or rising.", "external_links": [], "published": "2017-03-02T20:32:00.000+02:00", "crawled": "2017-03-02T16:52:22.451+02:00", "highlightTitle": ""}