{"organizations": [], "uuid": "c44c4228c4d1597fce95993eae880951b333c953", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30230948/15926750.jpg", "site_section": "http://www.westernmorningnews.co.uk/all-content.rss", "section_title": "Devon Live All Content Feed", "url": "http://www.devonlive.com/sky-s-the-limit-for-ukip-s-will-jones-after-becoming-one-of-devon-s-youngest-town-councillors/story-30230948-detail/story.html", "country": "GB", "title": "Lewis_Clarke published Meet the 18-year-old UKIP councillor hoping to bridge the gap...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "Lewis_Clarke published Meet the 18-year-old UKIP councillor hoping to bridge the gap...", "spam_score": 0.0, "site_type": "news", "published": "2017-03-27T23:07:00.000+03:00", "replies_count": 0, "uuid": "c44c4228c4d1597fce95993eae880951b333c953"}, "author": "Lewis_Clarke", "url": "http://www.devonlive.com/sky-s-the-limit-for-ukip-s-will-jones-after-becoming-one-of-devon-s-youngest-town-councillors/story-30230948-detail/story.html", "ord_in_thread": 0, "title": "Lewis_Clarke published Meet the 18-year-old UKIP councillor hoping to bridge the gap...", "locations": [], "entities": {"persons": [{"name": "lewis_clarke", "sentiment": "none"}, {"name": "bradninch", "sentiment": "none"}, {"name": "tony mcintyre", "sentiment": "none"}, {"name": "jones", "sentiment": "none"}, {"name": "william jones", "sentiment": "none"}, {"name": "will jones", "sentiment": "none"}, {"name": "mark", "sentiment": "none"}, {"name": "cllr jones", "sentiment": "none"}, {"name": "chaim ebanks", "sentiment": "none"}, {"name": "will", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "daniel barnes", "sentiment": "none"}], "locations": [{"name": "petroc tiverton", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "cullompton south ward", "sentiment": "none"}, {"name": "devon county council", "sentiment": "none"}, {"name": "weymouth", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "cullompton town hall", "sentiment": "none"}, {"name": "cullompton meet", "sentiment": "none"}, {"name": "devon county", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "garden village", "sentiment": "none"}, {"name": "cullompton", "sentiment": "none"}, {"name": "cullompton high street", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}], "organizations": [{"name": "ukip", "sentiment": "none"}, {"name": "ukip south west", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "tiverton & honiton", "sentiment": "none"}, {"name": "cullompton town council", "sentiment": "none"}, {"name": "tiverton high school", "sentiment": "none"}, {"name": "national insurance", "sentiment": "none"}, {"name": "cca", "sentiment": "none"}, {"name": "mid devon district council", "sentiment": "none"}, {"name": "bcr associates", "sentiment": "none"}, {"name": "cullompton & bradninch ward", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Meet the 18-year-old UKIP councillor hoping to bridge the gap between young and old By Lewis_Clarke | Posted: March 27, 2017 0 COMMENTS SHARES Councillor Will Jones at home in Cullompton Meet the 18-year-old UKIP councillor hoping to bridge the gap between young and... X \nCopy link to paste in your message / Comments (0) \nAn 18-year old from Cullompton has become the youngest serving member on the town council in history after being co-opted last week. \nCouncillor William Jones, 18, was co-opted to the council at the full meeting held at Cullompton Town Hall on Thursday, March 23. He will sit as a UKIP representative on the Cullompton South Ward vacated by Chaim Ebanks. \nWill, who studied media studies, history, business and communications, and gained technical qualifications at Tiverton High School, went on to Petroc Tiverton to do Building Studies before working as an apprentice at Mid Devon District Council as a junior surveyor and in Exeter with BCR Associates. \nHe said: \"In our age group these days, with the younger demographic there are just not enough young people getting into politics, especially on a local government level. \n\"If you look at Cullompton Town Council at the moment, they've only got one other young town councillor, Daniel Barnes, who is 21. At the end of the day, there are 15 town councillors and to only have one young person, I don't think is enough to represent the town of Cullompton. \n\"I am hoping to bring the youth's voice and hoping to bridge the gap between young people and the older demographic. \n\"I enjoy the fact that there is such a wide demographic now, we've got a whole mix of ages in there. You get the backgrounds from everyone instead of having all one similar group. It's a nice mix so everyone gets heard.\" \nTwo people put their names forward for co-option to the town council. Cllr Jones says he was able to stand out after attending town council meetings since January as well as going to meetings with the CCA Fields, Cullompton Swimming Pool Campaign and by attending a meeting to discuss the Garden Village proposals last Wednesday. \nHe added that the main issues facing Cullompton is the garden village and traffic. \nHe said: \"Of course it doesn't just affect Cullompton, it affects Bradninch as well as if they wanted to get to the motorway they have to get to Cullompton High Street which has been gridlocked.\" \nCouncillor Jones first garnered an interest in politics in the run up to the 2015 General Election. He looked at the different manifestos and was encouraged into politics by his teachers at Tiverton High School. \n\"In the end I took a liking to UKIP,\" he said. \"I saw their manifesto and I liked what they were saying about apprenticeships. I have been on a few apprenticeships already and I find them to be a great alternative instead of going to university. \n\"So far people have reacted to me standing for UKIP quite well. They ask why, and I tell them that through UKIP I help support my local community better than if I stood for the Conservatives or Labour.\" \nWill, who would have voted for Leave if he was old enough to vote at the time of the EU Referendum called for unity within the country. \nHe said: \"At the end of the day we've got a 52 per cent majority for Brexit so Theresa May is going to trigger Article 50. Remainers and leavers need to come together to get the best result for Britain. \n\"I think at the moment things are also going quite well for UKIP to be honest. We got the referendum result that we wanted and it's our job now to keep pressing the Conservatives and Theresa May so that she does evoke Article 50 and goes through with it. \n\"At the age of 17 I couldn't have voted for Brexit but I would have done if I could. I think the voting age should be lower. As soon as you can pay National Insurance then I think that's when you should be allowed to vote. At the end of the day, you're putting money into the Government so why shouldn't we be able to have a say in it?\" \nWill's father Mark added: \"I'm 45 and have lived in Cullompton all my life and my father and his father before him, so our history is here. The town is rapidly growing and we feel proud of our area and where we're from and it's great that one of our families is now representing the community.\" \nAlready, Cllr Jones is being scouted by UKIP South West representatives and will be standing in the Devon County Council election for the Cullompton & Bradninch Ward, with others within the party suggesting he could stand as an MP. \nTony McIntyre, UKIP chairman for Tiverton & Honiton and the South West said: \"He will be standing for Devon County, how he'll get on, we'll have to wait and see. \n\"We have been screaming as a party for youth. Youth is going to have an impact and here he is, he's walked into our door and he's very interested. He came down to our conference, met the people there in Weymouth and everybody is very impressed. \n\"The sky is the limit with what he could achieve. He's 18, so let's see if he continues with his enthusiasm. Certainly at the next general election I will be pressing for him to find out what it's like to stand as an MP. \n\"You've got to have a go and find out what this game is all about. It's going out, it's meeting people, it's having the confidence to knock on the doors, introduce yourself and listen to their woes.\" \nWill says he is happy to see where politics takes him. \n\"I hope to find in the future employment around Cullompton so that I can be close and local to the ward I represent. Going on ahead I'll see what happens,\" he added. Read More", "external_links": [], "published": "2017-03-27T23:07:00.000+03:00", "crawled": "2017-03-27T19:08:07.914+03:00", "highlightTitle": ""}