{"organizations": [], "uuid": "3dedd75ac7938d9b06d52a400cf3c39ed1fafbd7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12797292.ece/ALTERNATES/s1200/TKR_NJL_050515JohnWaterworthParkdean.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/caravan-holidays-northumberland-1bn-holiday-12794026", "country": "GB", "domain_rank": 21960, "title": "From caravan holidays in Northumberland to a £1bn holiday firm: meet the boss at Parkdean Resorts", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "From caravan holidays in Northumberland to a £1bn holiday firm: meet the boss at Parkdean Resorts", "spam_score": 0.0, "site_type": "news", "published": "2017-03-26T20:00:00.000+03:00", "replies_count": 0, "uuid": "3dedd75ac7938d9b06d52a400cf3c39ed1fafbd7"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/caravan-holidays-northumberland-1bn-holiday-12794026", "ord_in_thread": 0, "title": "From caravan holidays in Northumberland to a £1bn holiday firm: meet the boss at Parkdean Resorts", "locations": [], "entities": {"persons": [{"name": "john waterworth", "sentiment": "negative"}, {"name": "trecco", "sentiment": "none"}, {"name": "walt disney", "sentiment": "none"}, {"name": "turrell", "sentiment": "none"}, {"name": "earl grey tea", "sentiment": "none"}, {"name": "graham", "sentiment": "none"}, {"name": "lal qila", "sentiment": "none"}, {"name": "graham wilson", "sentiment": "none"}, {"name": "bernard cornwell", "sentiment": "none"}, {"name": "parkdean", "sentiment": "none"}, {"name": "susan", "sentiment": "none"}, {"name": "john", "sentiment": "none"}, {"name": "barbour", "sentiment": "none"}], "locations": [{"name": "northumberland", "sentiment": "none"}, {"name": "hemel hempstead", "sentiment": "none"}, {"name": "yorkshire", "sentiment": "none"}, {"name": "alnwick", "sentiment": "none"}, {"name": "lowestoft", "sentiment": "none"}, {"name": "barluga", "sentiment": "none"}, {"name": "morpeth", "sentiment": "none"}, {"name": "kessingland beach", "sentiment": "none"}, {"name": "gosforth", "sentiment": "none"}, {"name": "skegness", "sentiment": "none"}, {"name": "sheffield polytechnic", "sentiment": "none"}, {"name": "north yorkshire", "sentiment": "none"}, {"name": "filey", "sentiment": "none"}, {"name": "cornwall", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "blyth", "sentiment": "none"}, {"name": "trecco bay holiday park", "sentiment": "none"}, {"name": "tummel valley", "sentiment": "none"}, {"name": "parkdean resort  vauxhall holiday park", "sentiment": "none"}, {"name": "parkdean holidays", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "wales", "sentiment": "none"}, {"name": "trecco", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "cramlington", "sentiment": "none"}, {"name": "parkdean", "sentiment": "none"}, {"name": "great yarmouth", "sentiment": "none"}, {"name": "parkdean resorts", "sentiment": "none"}, {"name": "butlins", "sentiment": "none"}, {"name": "sandy bay", "sentiment": "none"}, {"name": "hepscott", "sentiment": "none"}], "organizations": [{"name": "onex", "sentiment": "none"}, {"name": "yorkshire pudding", "sentiment": "none"}, {"name": "entrepreneurs’ forum", "sentiment": "none"}, {"name": "kpi", "sentiment": "none"}, {"name": "ford", "sentiment": "none"}, {"name": "parkdean leisure", "sentiment": "none"}, {"name": "bmw", "sentiment": "none"}, {"name": "times", "sentiment": "none"}, {"name": "sunday times", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "alchemy partners", "sentiment": "none"}, {"name": "granada entertainments", "sentiment": "none"}, {"name": "beazer", "sentiment": "none"}, {"name": "leech leisure", "sentiment": "none"}, {"name": "parkdean resorts", "sentiment": "none"}, {"name": "pa", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "John Waterworth, CEO of Parkdean Resorts Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nWhen Newcastle’s Parkdean Resorts was sold at the end of last year for a cool £1.35bn, it was confirmation (if it was needed) that holiday parks are big business. \nThe deal followed a merger in 2015 that created the UK’s largest holiday park operator, but becoming a big business has not stopped chief executive John Waterworth from having a caravan break once or twice a year. \n“Holiday parks are in my blood, I grew up with caravans from a very young age,” he said. \n“When I was just six or seven years old we used to all pile into a Ford Zephyr and head down to Cornwall. My family had caravans at the back of their pub near Alnwick and at Blyth and my grandparents had a caravan at Sandy Bay where my mum and dad did their courting – we own that park now.” \nCaravan holidays have changed a lot since their mid-century heyday and John now likens them to a “Docklands flat on wheels”. \nHe also feels that post-Brexit Britain will be a great place to own a domestic tourism business and recently announced his firm will invest a record £50m on accommodation, retail and leisure facilities across its UK parks in time for the 2017 season. \n“I remember having to collect the water and only having gas lights, but I never remember it raining; I always had happy memories of our holidays as a kid. Today all our new accommodation has double glazing and central heating to make staying really comfortable, so we are seeing fantastic returns by being able to open our parks as early as February and right up to November,” said John. \nParkdean Resorts formed in November 2015 following the merger of Parkdean Holidays and Park Resorts. As a result, the company is the largest holiday park operator in the UK with a combined total of 73 holiday parks stretching across the country. A Parkdean Resort \nVauxhall Holiday Park in Great Yarmouth was its first major acquisition since the company merged and certainly not the last as John continues to follow his well-proven buy and build strategy for growth. The group sells over 500,000 holidays each year; accommodating over 2m customers and sells over 5,000 holiday homes, generating EBITDA of over £100m. \nAs well as its static caravans, Parkdean Resorts also offers luxury four-bedroom lodges, touring and camping pitches and, more recently, has expanded its glamping accommodation to harness the new trend taking the UK by storm. There is also a growing community of 23,000 holiday home owners across 68 of its parks, mostly choosing to holiday at home less than two hours’ drive away. \nJohn has been the chief executive of Parkdean since its creation in 1999, which started with the acquisition of Trecco Bay Holiday Park, the UK’s largest caravan park, followed by the acquisition of a further 23 parks over the years. \nHe led the business for flotation on AIM (Alternative Investment Market) in 2002 and in 2006, steering a management buyout, Parkdean was taken private by Alchemy Partners in a deal worth £230m. December 2016 saw Parkdean Resorts announce that Onex, a Canadian private equity firm, had agreed to acquire the business for £1.35bn. \n“Our customer base is almost entirely UK family holidaymakers, and it’s growing,” says John, “Our organic growth opportunities are very clear, that’s why we are investing in improving our estate to ensure we can provide great holidays almost all-year-round. \n“People’s holiday time is precious, it’s family memories we are creating. It’s an opportunity to spend time together, to eat meals together – at the same time believe it or not! Families holiday with grandparents or aunts and uncles, so it’s important that they really enjoy the time they get together, which is why customer service is our biggest priority.” \nJohn grew up in a hard-working entrepreneurial family, his parents ran a taxi firm in Cramlington for over 30 years. \n“I got my work ethos from them, long days with early starts and late nights. By sixth form I’d gone from washing the cars to running the taxi office on a Friday and Saturday night. \n“But I quite fancied going into hospitality and catering,” says John, “because I thought it would be a chance to travel the world!” \nJohn had his first taste of the holiday park world that summer as a kitchen porter at Butlins in Filey, North Yorkshire. \n“I really enjoyed it, and I didn’t know at the time I’d actually go on to run a Butlins park in Skegness. After studying catering management at Sheffield Polytechnic, soon I became a grill chef on my first placement, where I was catering for 250 covers a night. \n“Then I did a summer season in 1985 working for what was Leech Leisure, behind the bar at Tummel Valley; another park we now own. That’s where I first met Graham Wilson, the managing director who was to become my mentor and future chairman. \n“He drove a Ford Scorpio and I asked, how do you get a car like that? I was always asking questions, he always used to say that shy bairns get nowt. I still operate that principle today at Parkdean Resorts and we encourage people to grow with the business.” \nJohn became a graduate trainee at Leech Leisure which then became Beazer and went to work at a park called Kessingland Beach near Lowestoft, another one of Parkdean Resorts portfolio nowadays. It was here he met his wife Susan and where he would later hold his wedding reception. \nAfter a short spell away at Granada Entertainments, he rejoined Graham Wilson at what was then Parkdean Leisure in 1992, initially as a general manager and then as operations director, only to be made redundant when the company was sold to Rank in 1997. Read More Newcastle's Parkdean Resorts to invest £50m in holiday parks - including upgrade in Northumberland \n“I went to Butlins and about 18 months later I got a call from Graham, asking if I wanted to go and visit a park in Wales. That was how the new Parkdean started and I became managing director. Trecco was our first acquisition and there we began to build the business bit by bit. \n“In 2001 we had just seven people here in the North East, now we have 250 in our Gosforth office alongside our other central support office in Hemel Hempstead employing a further 130 people. \n“People ask me why do you base the business in the North East? We are very passionate about our North East roots. \n“The last few years have seen some organisations view the North East as an add-on to the operation they have got. Investment houses and some of the banks have moved their regional offices away from the North East, so we can get treated as an add-on to Yorkshire or Scotland. There’s been a lot of good work done by the Entrepreneurs’ Forum to change perceptions and ensure we build businesses and have the right environment for start-ups in this region.” \nParkdean Resorts now employs 7,000 people at peak season across the UK and Trecco remains its biggest park. \n“Many of the people that were with us in the early days are still with us now. A lot of them started quite young and we gave them opportunities to manage holiday parks or join the leadership team. \n“We believe a lot in internal promotion, and we need to do more to encourage young people into the industry. We have great jobs in IT, software, marketing, finance, as well as hospitality and customer service. I’ve only been asked once to speak at a local university; but young people need to hear stories like ours.” \nDespite his resorts having fantastic restaurants, entertainment and often an indoor leisure pool, John is acutely aware of their role in the local economy and sees his parks as part of a much wider community. \nAn entrepreneur through and through - he was named North East Entrepreneur of the Year in 2016 - he knows the pressures businesses can face, and is passionate that small domestic tourism businesses need better support. \n“We recognise that it’s as important for the local businesses outside of our parks to be doing well; the pubs and the restaurants and visitor attractions. They’re all part of that product that people visit for the week. \n“UK inbound tourism is often city breaks and hotel led, and they tend not to come and visit the UK coast in big numbers. There is a big opportunity to grow our coastal and rural tourism around the UK and it’s a crying shame it’s not being invested in more by Government. We see the local tourist offices closing and attractions shut for the winter months. \n“When I first worked in holiday parks the start of the season was Easter if you were lucky, but mainly it was the May bank holiday until September. But now our parks are operating between 34-46 weeks of the year with really good occupancy early and late. We have a lot more going on for people to enjoy and the holidays are really affordable.” \nSo what next for Parkdean Resorts, and the man who still enjoys a caravan holiday every year? Read More Parkdean Resorts sold for £1.35bn to Canadian investment giant \n“I really admire Barbour,” he said. “It’s an internationally recognised business but it still has family roots and installs that ethos in their team. That’s what we are trying to do; we are building a business that will be still around in 25-30 years’ time, but is recognised for giving people a good time on the holiday they’ve worked hard for all year. \n“We need to be much more ambitious about what we can achieve here in the North East business community – after all, shy bairns get nowt.” What car do you drive? \nBMW X5, although I’m often on a train, plane or a hire car these days when travelling round the parks. What’s your favourite restaurant? \nLal Qila in Cramlington, favourite Friday night haunt or Barluga in Morpeth. Who or what makes you laugh? \nMy wife Susan makes me laugh – although she doesn’t always intend to! I think it’s a Suffolk thing. What’s your favourite book? \nNo single favourite – anything by Bernard Cornwell. What was the last album you bought? \nCrown Pasada – Smoove and Turrell. What’s your ideal job, other than the one you’ve got? \nTour guide, Northumberland castles. What’s your greatest fear? \nHeights! What’s the best piece of business advice you have ever received? \nYou’re only as good as the people around you – we have a fabulous group of talented and engaged people working in Parkdean Resorts across the UK. And the worst? \nToo numerous to list – learnt more about how not to do things in some larger companies. What’s your poison? \nEarl Grey Tea or a Pint of Real Ale, clearly depending on time of day. What newspapers do you read, other than The Journal? \nThe Times, Sunday Times and generally the local paper where ever I am visiting. How do you keep fit? \nA good question - I don’t do enough, bit of golf and some walking, so a clear focus for 2017! What’s your most irritating habit? \nI’m a terrible listener, not a great trait. Apparently I’m also always right which is irritating. (Moral of this is to never ask your fabulous PA or wife to answer a question for you). How much was your first pay packet? \n£32 at Butlins a week in 1982, plus a single bed in a shared one room chalet (no bathroom) and food! What’s your biggest extravagance? \nDon’t think I really have one – been known to have more than a pint or two, or an extra Yorkshire Pudding on a Sunday. What historical or fictional character do you most identify with or admire? \nI most admire Walt Disney – that’s someone who really created fabulous experiences for people. Focus is everything. How would you like to be remembered? \nThat I created opportunities for the people around me to succeed in life and that we created amazing memories for our customers. Which people would you most like to dine with? \nActually dining with my wife and kids during the week would be an achievement! \nParkdean Resorts has 73 holiday parks mainly in coastal locations around the UK, two central offices in Gosforth and Hemel Hempstead and a regional support office in Exeter. \nI live in Hepscott near Morpeth and it’s fair to say that I don’t have a typical working day, especially when I’m out and about. \nTypically, I’m an early riser and often travelling in the morning and evenings; I tend to top and tail the week in the Gosforth office, but it’s not unusual to find me in the business at weekends too, especially Sundays. A typical Monday can go like this: \n6.30am: Rise, mug of tea and light breakfast before heading into office. \n8am: Check emails, update my to do list for the day and week ahead and ensure I’m ready to brief my PA on any key changes. \n9am–1pm: Normally pretty structured with one-on-one calls with my executive team to update me on progress and typically it’s their agenda not mine. We tend to do a team call on a Thursday, we use this ideally to discuss progress on strategic matters with a formal monthly executive board. \nMonday is a key day for us – we do a lot of our business at the weekend, when we have most customers on the parks and KPI’s become available for the prior week. \nAfter lunch (often taken at my desk) and a catch up with my PA, I’m then usually off travelling. Monday afternoon is a good opportunity to review things if I’m on a train and I’ll do external calls whilst travelling. \nIn the evening I’ll normally have a meeting over dinner with a colleague or business partner, but I’m not a late night person. \nIf I’m on parks, the day can be quite long – it’s not untypical for me to visits four or five parks in one day and to travel late in the evening, I prefer to be where I want to start the next day when my head hits the pillow rather than begin with a lot of travelling. We stay on park a lot too – so we get to experience our product regularly. Like us on Facebook", "external_links": [], "published": "2017-03-26T20:00:00.000+03:00", "crawled": "2017-03-26T15:39:21.035+03:00", "highlightTitle": ""}