{"organizations": [], "uuid": "185deb1c1a307acb7fbff4a9e6ac84226e27f282", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12712716.ece/ALTERNATES/s1200/Budget-2017.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/budget-2017-you-winner-loser-12712590", "country": "GB", "domain_rank": 21960, "title": "The Budget 2017: Are you a winner or a loser? Find out for yourself", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "The Budget 2017: Are you a winner or a loser? Find out for yourself", "spam_score": 0.0, "site_type": "news", "published": "2017-03-08T23:45:00.000+02:00", "replies_count": 0, "uuid": "185deb1c1a307acb7fbff4a9e6ac84226e27f282"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/budget-2017-you-winner-loser-12712590", "ord_in_thread": 0, "title": "The Budget 2017: Are you a winner or a loser? Find out for yourself", "locations": [], "entities": {"persons": [{"name": "hammond", "sentiment": "negative"}, {"name": "philip hammond", "sentiment": "none"}], "locations": [{"name": "england", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "a&e", "sentiment": "none"}, {"name": "green", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "budget", "sentiment": "none"}, {"name": "rpi", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Hammond reveals minimum wage will not rise as much as predicted Share this video Watch Next \nThe minimum wage for over-25s is rising to £7.50 an hour. This in line with previous promises however there are concerns it is not going up quickly enough to get to the £9 an hour rate previously promised to be reached by 2020. \n3 - Savings go up, a little at least \nIf you have spare cash - that’s a big if - the maximum amount you can pay into an ISA and not pay tax on is to go up to £20,000 a year from April. \nMeanwhile a new NS&I bond that pays 2.2% interest will be introduced too, but it’s limited to £3,000 each. \n4 - Working parents get money for childcare \nThe Chancellor confirmed that tax-free childcare will begin next month. So for every 80p you pay in child care, the government will add another 20p - up to £10,000 of spending. The scheme is available for children up to the age of 12, and the tax relief is doubled for children with disabilities. \n5 - Price of booze and cigarettes to go up Cigarettes \nFor some a few people thought when Mr Hammond said there would be ‘no changes to previously planned upratings of duties on alcohol and tobacco’ it was somehow good news for smokers and those who like a tipple. \nHowever it had previously been decided that Alcohol Duty will rise by RPI, which is around 2.5% at present. While the tax on cigarettes will increase by 2% above RPI. \nThere was a second blow for smokers in the form of a Minimum Excise Duty on cigs, which effectively means a pack can’t cost less than £7.35. Read More Budget 2017 - 'broken' manifesto promises and no Brexit mention - social media response \n6 - Social Care cash boost - but is it really? \nMr Hammond announced a £2bn cash injection for social care funding over the next three years for England. Meanwhile a Green paper on the long term strategy for social care funding is to be published later this year. In his autumn statement he had insisted there was no need for such a bail out of the social care system. Critics say this not only means he has accepted there’s social care funding crisis, the £2bn he is putting in is £2.6bn less than has been taken out of social care- ie £4.6bn - since 2010. Chancellor of the Exchequer Philip Hammond making his Budget statement (Photo: UK Parliament/Mark Duffy/PA Wire) \n7 - For the NHS , there will be £325m of capital for the first of the new sustainability and transformation plans (STPs), intended to improve healthcare. A £100m fund is to be made available for 100 onsite GP treatment centres in A&Es in England. \n8 - In education , there is the introduction of T-levels – technical qualifications, an alternative to A-levels – for 16 to 19-year-olds and £40m for pilots on lifelong learning projects. \n9 - Funding of £320m for 110 new free schools to take the total to 500. Free school transport extended to children receiving free school meals at selective schools. \n10 - Meanwhile £216m will be invested in school maintenance. \n11 - Vehicle excise duty for hauliers and HGVs is frozen. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now", "external_links": [], "published": "2017-03-08T23:45:00.000+02:00", "crawled": "2017-03-08T19:25:55.098+02:00", "highlightTitle": ""}