{"organizations": [], "uuid": "8075aa9eb48a845161f45de22290acf22480b845", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12803823.ece/ALTERNATES/s1200/rriva.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-transport-giant-arriva-12803737", "country": "GB", "domain_rank": 21960, "title": "North East transport giant Arriva boost sales to £4.32bn after launch of new rail franchise", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "North East transport giant Arriva boost sales to £4.32bn after launch of new rail franchise", "spam_score": 0.0, "site_type": "news", "published": "2017-03-27T21:59:00.000+03:00", "replies_count": 0, "uuid": "8075aa9eb48a845161f45de22290acf22480b845"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-transport-giant-arriva-12803737", "ord_in_thread": 0, "title": "North East transport giant Arriva boost sales to £4.32bn after launch of new rail franchise", "locations": [], "entities": {"persons": [{"name": "liam fox", "sentiment": "none"}, {"name": "ruediger grube", "sentiment": "none"}, {"name": "manfred rudhart", "sentiment": "none"}, {"name": "preston", "sentiment": "none"}, {"name": "gibson o'neill", "sentiment": "none"}, {"name": "jones bootmaker", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "warsaw", "sentiment": "none"}, {"name": "sheffield", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}, {"name": "bradford", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "czech republic", "sentiment": "none"}, {"name": "nottingham", "sentiment": "none"}, {"name": "york", "sentiment": "none"}, {"name": "blackpool", "sentiment": "none"}, {"name": "netherlands", "sentiment": "none"}, {"name": "prague", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}], "organizations": [{"name": "arriva", "sentiment": "negative"}, {"name": "arriva express", "sentiment": "none"}, {"name": "deutsche bahn", "sentiment": "none"}, {"name": "leeds", "sentiment": "none"}, {"name": "arrival rail north", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "arriva rail london ltd", "sentiment": "none"}, {"name": "middlesbrough fc", "sentiment": "none"}, {"name": "northern", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "North East transport giant Arriva boost sales to £4.32bn after launch of new rail franchise The Sunderland firm started the Northern rail franchise last April and also invested heavily in bus improvements Share Arriva chief executive Manfred Rudhart Share Get business   \nWearside transport giant Arriva boosted sales to more than £4.32bn after a successful year saw it take over the Northern rail franchise. \nSunderland-based Arriva, which forms part of German group Deutsche Bahn, has published annual results for 2016 showing revenues increasing 5.2% to €5.093bn, which has triggered investment of more than €359m (£309m) in its UK and European businesses, 30% more than the previous year. \nChief executive Manfred Rudhart said Arriva increased its UK spending power to €133m (£114.8m) in 2016, which it used to investment on improving customer experience, including new and improved buses and trains, station improvements and innovations such as mobile ticketing apps and the roll-out of contactless payments on buses. \nPlans to float a 45% share in the business were abandoned after the Brexit vote, with Deutsche Bahn chief executive Ruediger Grube saying a sale “would be throwing money out of the window, and acting that way would be foolish.” \nA key highlight for the firm was the launch of the Northern rail franchise, which it will operate until at least 2025. \nAs part of the deal, which sees Arriva run routes connecting Leeds, Sheffield, Nottingham, York, Manchester, Bradford, Preston and Blackpool, the Arrival Rail North director pledged a whole package of improvements for travellers, including free WiFi by 2019 and more frequent services. Read More Middlesbrough FC promotion leads to big fall in profits at parent company Gibson O'Neill \nSince taking over the contract Arriva has begun investing in an extensive modernisation programme to enhance services for the 90m passengers who use the network every year, having pledged to spend spend £1bn across the north, with £400m of that on new trains. \nLast year also saw Arriva Rail London Ltd begin operating the London Overground concession, in November, following a competitive bidding process and after nine years of Arriva operating it as a joint venture. \nThe UK remains Arriva’s biggest bus market with 5,250 vehicles and, despite a challenging market with increasing congestion, the firm said it has invested significantly in technology and made changes to networks to improve bus journeys, including the launch of an app, Wi-Fi on new buses and improved ticketing and payment choices. Read More Liam Fox criticised for 'too lazy and too fat' comments on UK businesses \nIn mainland Europe, Arriva started to operate a number of new contracts, including a 15-year bus and rail contract in the Netherlands, as well as new train services in Prague, new bus services in Warsaw, and continued investing in key markets such as Italy and the Czech Republic. \nLong distance Arriva Express bus lines were also launched across Europe. \nManfred Rudhart, chief executive of Arriva said: “2016 was a year of continued market growth as a result of significant contract wins and acquisitions. We also increased our overall capex investment by 30%, from €276m in 2015 to €359m. Read More North East jobs lost as Jones Bootmaker closes 25 'underperforming' stores \n“The Northern franchise consolidated our position as a major operator in UK rail, while new franchises and acquisitions boosted our presence in Spain, the Netherlands, Italy and Czech Republic. \n“Arriva continued its significant investment in customer service improvements, new technology and our people. We have rolled out contactless payment schemes across our markets, making bus and train travel more convenient; introduced more environmentally-friendly vehicles and continued to invest in our graduate and apprenticeship schemes.” Like us on Facebook", "external_links": [], "published": "2017-03-27T21:59:00.000+03:00", "crawled": "2017-03-27T17:29:57.863+03:00", "highlightTitle": ""}