{"organizations": [], "uuid": "ef3dd36fe7dad6c9c677e580a6c8d3656cd7daa7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12739662.ece/ALTERNATES/s1200/Girl-eating-her-packed-lunch-at-school-from-a-sandwich-box.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/children-go-hungry-over-holidays-12739338", "country": "GB", "domain_rank": 21960, "title": "Why some children go hungry over the holidays and how Northumbria academics hope to change that", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Why some children go hungry over the holidays and how Northumbria academics hope to change that", "spam_score": 0.0, "site_type": "news", "published": "2017-03-15T01:00:00.000+02:00", "replies_count": 0, "uuid": "ef3dd36fe7dad6c9c677e580a6c8d3656cd7daa7"}, "author": "Hannah Graham", "url": "http://www.chroniclelive.co.uk/news/north-east-news/children-go-hungry-over-holidays-12739338", "ord_in_thread": 0, "title": "Why some children go hungry over the holidays and how Northumbria academics hope to change that", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Why some children go hungry over the holidays and how Northumbria academics hope to change that A team from Northumbria University has addressed MPs on the solution to the problem of 'holiday hunger' Share Click to play Tap to play The video will start in 8 Cancel Play now Experts talk about the enquiry into holiday hunger Share this video Get   Thank you for subscribing!   \nSome of the North East’s most disadvantaged children are going hungry over the school holidays - but experts at Northumbria University hope to help change that. \nAccording to research by the university’s Healthy Living Lab, thousands of children who rely on free school meals for a least one meal a day are suffering during breaks from school. \nThey say some parents are skipping meals , pooling food with friends and relying on cheap, processed foods to ensure their children have enough to eat in the holidays. \nThe research group, which is led by Professor Greta Defeyter, on Monday presented their findings to All Party Parliamentary Group on Hunger, in the hope that the Government will be able to use their work to tackle the problem. \nSpeaking to MPs including South Tyneside MP Emma Lewell-Buck, Dr Pamela L Graham, a Vice-Chancellor’s research fellow and Emily Mann, PhD researcher, presented the team’s findings, arguing that children and families who need them should be offered holiday clubs to provide vital childcare and meals over the breaks. Dr Pamela Graham (right), Research Fellow, with Professor Greta Defeyter (left), Associate Pro-Vice Chancellor they have carried out extensive research with Northumbria University which shows that holiday hunger is a real issue (Photo: © North News & Pictures ltd) \nProfessor Defeyter said: “Holiday hunger is a very real issue and it’s shocking that in this day and age some parents are struggling to feed their children. \n“The holidays can be a stressful time for many parents, but holidays can be particularly so for families on low incomes, many of whom qualify for free school meals during term time.” Read More North East foodbanks: Things you might not know you could donate \nShe explained that for a family of four, the extra meals needed in holiday time can add £30-40 to weekly expenses, leading many desperate parents to opt for unhealthy processed foods which are seen as better value than fresh, healthier options. \nAccording to the professor, this not only leaves children feeling hungry and eating less healthily, it can have a huge impact on their school performance and future life chances. Read More Brexit blamed for pushing up the cost of food and forcing families to go hungry \nShe added: “There’s a clear link between food and academic attainment – particularly in areas of poverty and among primary-age children. \n“Not only does holiday hunger affect children’s lives now but it may also have significant detrimental effects on their health and life chances in the future. There is a real need for accessible food and activity provision during the school holidays for children and young people in the UK. This is something that needs addressing as a matter of urgency.” Like us on Facebook", "external_links": [], "published": "2017-03-15T01:00:00.000+02:00", "crawled": "2017-03-14T20:42:10.620+02:00", "highlightTitle": ""}