{"organizations": [], "uuid": "6c27aaad7c945d5c72de360f6baff4cadf1d2147", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12739006.ece/ALTERNATES/s1200/EUJPG.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/pro-europe-brexit-quayside-updates-12737586", "country": "GB", "domain_rank": 21960, "title": "Brexit bill protest on Quayside LIVE: Updates as pro-Europe campaign gathers in Gateshead", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Brexit bill protest on Quayside LIVE: Updates as pro-Europe campaign gathers in Gateshead", "spam_score": 0.0, "site_type": "news", "published": "2017-03-14T18:30:00.000+02:00", "replies_count": 0, "uuid": "6c27aaad7c945d5c72de360f6baff4cadf1d2147"}, "author": "Kathryn Riddell", "url": "http://www.chroniclelive.co.uk/news/north-east-news/pro-europe-brexit-quayside-updates-12737586", "ord_in_thread": 0, "title": "Brexit bill protest on Quayside LIVE: Updates as pro-Europe campaign gathers in Gateshead", "locations": [], "entities": {"persons": [{"name": "bridget gubbins", "sentiment": "neutral"}, {"name": "kathryn riddell", "sentiment": "none"}, {"name": "bill", "sentiment": "none"}, {"name": "chris knight", "sentiment": "none"}, {"name": "kathryn riddell bill", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "brexit bill", "sentiment": "none"}, {"name": "kathryn riddell brexit", "sentiment": "none"}, {"name": "nicola sturgeon", "sentiment": "none"}], "locations": [{"name": "gateshead", "sentiment": "none"}, {"name": "gateshead quayside", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "morpeth", "sentiment": "none"}, {"name": "millennium bridge", "sentiment": "none"}, {"name": "westminster", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "european union", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "house of lords", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Protesters show support for EU \nMore demonstrators are now arriving. \nBridget Gubbins has travelled down from Morpeth for today’s protest. Bridget Gubbins at the North East for Europe protest (Photo: Chris Knight) 11:58 Kathryn Riddell Protest getting under way on Quayside \nReporter Chris Knight has arrived at Gateshead Quayside where the protest is due to be held. \nAn EU flag has already been unfurled. 11:41 KEY EVENT When will Brexit negotiations begin? \nThe Prime Minister looks set to wait another fortnight before kicking off the two-year process of negotiating departure under Article 50 of the EU treaties, with formal notification expected to take place in the last week of March. Theresa May (Photo: PA) \nMrs May’s official spokesman played down suggestions that the PM had delayed notification due to Scottish First Minister Nicola Sturgeon’s announcement that she plans to stage a second independence referendum in the run-up to the expected date of Brexit in spring 2019. \nThere was widespread speculation in Westminster that she could do so as early as today, when she is scheduled to make a statement on Europe to the Commons. 11:36 Kathryn Riddell Brexit to go ahead \nOnce the Bill receives Royal Assent it becomes an Act of Parliament and the Prime Minister has all the authority she needs to trigger Article 50 at the time of her choosing. 11:25 KEY EVENT Prime Minister set to trigger Article 50 \nThe Prime Minister is now fully in control of the process after the House of Commons voted to give her the power to trigger Article 50 without any conditions or restrictions. Theresa May, who was given a fresh warning about the difficulties she will face in Brexit negotiations with Europe as peers prepared for battle with ministers over the Article 50 Bill (Photo: PA) \nIt means negotiations about a new trade deal with the EU, which may last two years, can begin by April. \nThe House of Lords had attempted to amend the European Union (Notification of Withdrawal) Bill, which allows Brexit to go ahead. \nOne amendment required the Government to give Parliament a “meaningful vote” on a Brexit deal once it is finally agreed by the UK government and the rest of the EU, while a second amendment requiring the Government to confirm that citizens of other EU countries who are currently in the UK legally will be allowed to stay. \nBut the House of Commons rejected the Lords proposals, after Ministers said that tying the Government’s hands would make it harder to get a good deal out of the EU. 11:13 Kathryn Riddell Bill amendments rejected \nAfter weeks of bitter wrangling in both Houses, the Government comfortably fought off two Liberal Democrat bids to again amend the Brexit Bill in the Lords. \nIn a day of drama, the Commons voted to reject two changes made by peers to the European Union (Notification of Withdrawal) Bill, which gives the Prime Minister the power to trigger the two-year Brexit talks. \nMPs voted against a proposal to unilaterally guarantee the rights of EU nationals living in the UK within three months, by 335 votes to 287, majority 48. 11:05 Kathryn Riddell Brexit bill protest on the Quayside \nA pro-Europe group will hold a demonstration at Gateshead Quayside after the Brexit bill took a step closer to being passed. \nThe North East for Europe campaign will meet at the Millennium Bridge on Tuesday afternoon displaying EU flags and placards. \nThey say the event is intended to “demonstrate opposition to Parliament’s passing of the Brexit Bill and its the failure to ensure a meaningful vote on the EU exit deal”. \nThe group go on to say that they are concerned about the Government’s failure to safeguard the position of EU citizens living and working in the North East. \nWe’ll have live updates from the protest this afternoon from our reporter Chris Knight. Share", "external_links": [], "published": "2017-03-14T18:30:00.000+02:00", "crawled": "2017-03-14T14:26:11.950+02:00", "highlightTitle": ""}