{"organizations": [], "uuid": "549f7c307da742f85c2c300d24bbf02716a6335f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/30185388/15892459.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/ibstock-brick-builds-sales-and-profits/story-30185388-detail/story.html", "country": "US", "domain_rank": 48128, "title": "Ibstock brick builds sales and profits | Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "Ibstock brick builds sales and profits | Leicester Mercury", "spam_score": 0.93, "site_type": "news", "published": "2017-03-07T18:35:00.000+02:00", "replies_count": 0, "uuid": "549f7c307da742f85c2c300d24bbf02716a6335f"}, "author": "", "url": "http://www.leicestermercury.co.uk/ibstock-brick-builds-sales-and-profits/story-30185388-detail/story.html", "ord_in_thread": 0, "title": "Ibstock brick builds sales and profits | Leicester Mercury", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ibstock brick builds sales and profits By Lauren_Mills | Posted: March 07, 2017 0 COMMENTS SHARES Ibstock brick builds sales and profits X \nCopy link to paste in your message / Comments (0) \nStrong demand for new housing helped a county brick maker report another year of healthy growth. \nIbstock, which has its headquarters in the North West Leicestershire village of the same name, said group sales grew 5 per cent to £435 million last year, up from £413 million in 2015. \nProfits before interest and tax and other costs came in at £111.6 million, up from £107 million a year earlier. \nThe company, which listed on the London Stock Exchange in October 2015, said its US division Glen-Gery delivered strong profit growth for the year in line with expectations. \nIbstock is the leading manufacturer by volume of clay bricks sold in the UK, and with 19 manufacturing plants it has the largest brick production capacity in the country. It operates a network of 23 quarries, mostly located close to its brick making plants. \nThe company has the capacity to make 780 million bricks a year. This will increase by 100 million in the second half of 2017 – enough to build 15,000 detached homes and garages – when the company's new £54 million factory just outside Ibstock goes into production. The move will create 50 jobs. \nRead more: Ibstock chief is building for the long term \nIbstock chief executive Wayne Sheppard said the company had already started recruiting. \nHe said: \"We are looking to fill technical roles in engineering and electronics and for production operatives to run the plant. \n\"While applicants don't need to have a skill, they need to be bright and we'll train them. These are skilled roles, not a labourer's job.\" \nIncreased capacity could also help Ibstock grow its 40 per cent share of the UK brick making market. \nAs well as making clay bricks, Ibstock also manufactures brick components, concrete roof tiles, concrete substitutes for stone masonry and concrete fencing. \nCommenting on the results, Mr Sheppard said: \"Ibstock delivered a robust full year performance for 2016, with the group result ahead of the prior year despite the uncertainty arising from events such as the EU referendum in the UK and the US Presidential election. \n\"At the same time we have continued to invest in the future of the business with our new tile line at Forticrete now in operation, construction of the new Leicestershire brick plant on schedule and a further capacity expansion project underway at Lodge Lane in Staffordshire. The main earnings benefits from these investments will flow through in future years. \n\"We have made an encouraging start to the new financial year, against softer comparatives from 2016 when our UK clay business was affected by distributor destocking. \n\"With continued strength in the new home developer market, normalised demand from the merchant sector in the UK, and a positive economic backdrop in the US, our businesses have traded ahead of the prior year in the early weeks of 2017. \n\"While we remain mindful of the uncertainties surrounding Brexit we maintain our expectations for another year of progress.\" \nShares in Ibstock were changing hands for more than 207p on Tuesday morning, their highest level since plunging to 126p the day after the Brexit vote. ", "external_links": [], "published": "2017-03-07T18:35:00.000+02:00", "crawled": "2017-03-07T15:59:47.424+02:00", "highlightTitle": ""}