{"organizations": [], "uuid": "9c867db78474b4fb8273833df822167cee7252df", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bostonstandard.co.uk", "main_image": "http://res.cloudinary.com/jpress/image/fetch/w_300,f_auto,ar_3:2,c_fill/http://www.bostonstandard.co.uk/webimage/1.7889204.1490778545!/image/image.jpg", "site_section": "http://www.bostonstandard.co.uk/rss/cmlink/1.335257", "section_title": "Boston Standard MBSP.news.feed", "url": "http://www.bostonstandard.co.uk/news/vive-la-blue-revolution-new-party-aims-to-make-radical-changes-to-democracy-1-7889205", "country": "GB", "title": "Vive la (Blue) Revolution? New party aims to make radical changes to democracy", "performance_score": 0, "site": "bostonstandard.co.uk", "participants_count": 0, "title_full": "Vive la (Blue) Revolution? New party aims to make radical changes to democracy", "spam_score": 0.0, "site_type": "news", "published": "2017-03-29T16:55:00.000+03:00", "replies_count": 0, "uuid": "9c867db78474b4fb8273833df822167cee7252df"}, "author": "", "url": "http://www.bostonstandard.co.uk/news/vive-la-blue-revolution-new-party-aims-to-make-radical-changes-to-democracy-1-7889205", "ord_in_thread": 0, "title": "Vive la (Blue) Revolution? New party aims to make radical changes to democracy", "locations": [], "entities": {"persons": [{"name": "gilbert", "sentiment": "none"}, {"name": "tom", "sentiment": "none"}, {"name": "mike gilbert", "sentiment": "none"}, {"name": "darron abbott", "sentiment": "none"}], "locations": [{"name": "norfolk", "sentiment": "none"}, {"name": "boston", "sentiment": "none"}], "organizations": [{"name": "the standard", "sentiment": "none"}, {"name": "electoral commission", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Have your say \nA new party has been launched which aims to make radical changes to the way democracy and Government work. \nBlue Revolution, was launched by former Conservative Boston borough councillor Mike Gilbert who is the group’s nominating officer. The purpose of Blue Revolution is to force people to think outside the box and imagine there are different ways of delivering the services in a way that can be significantly cheaper than what it is at the moment. Mike Gilbert, Blue Revolution nominating officer \nHis dad Tom, from Norfolk, is listed as the leader of what they are describing as a new ‘franchise’. \nBlue Revolution was accepted as a party by the Electoral Commission last week. \nMr Gilbert says the party aims to ‘bring democracy back to the people’, and get people thinking ‘outside the box’ to cut costs while maintaining high quality services such as education, health and the judicial system. \nHe said: “National politics isn’t working for the vast majority of people, and regardless of which party people support, they feel there’s something that’s not been said or acknowledged and, to some extent, that was revealed through the Brexit vote. \n“What we’re trying to do is get to the bottom of what those issues are that people feel make the system somehow not fully representative of them - and one solution to that is to get more ordinary working people involved, without them having to go through the complicated party machine.” \nHe said the current economic model was ‘unsustainable’ and said: “The purpose of Blue Revolution is to force people to think outside the box and imagine there are different ways of delivering the services in a way that can be significantly cheaper than what it is at the moment.” \nMr Gilbert criticised recent changes to electoral boundaries, saying: “They talk about extending democracies while reducing the number of MPs and talking about unitary authorities. That’s taking democracy in the wrong direction!” \nHe also said the party wanted to get people thinking about a ‘radical’ shake-up over how services are maintained including cutting from the top, rather than frontline services. \nAlthough Blue Revolution has a base manifesto, Mr Gilbert told The Standard it can accept members from all walks of life and across the political spectrum – as long as they want to make a contribution to the democratic debate. \n“As long as you’re able to demonstrate a commitment to the fundamentals of freedom of democracy and the fair treatment of everybody then you can sit on a Blue Revolution ticket,” said Mr Gilbert. \nThe electoral commission lists the party’s treasurer as Darron Abbott and gives a party description as meaning ‘Change through Challenge’. \nMore updates about Blue Revolution are set to come in the near future. \nl Information: www.Abluerevolution.org", "external_links": [], "published": "2017-03-29T16:55:00.000+03:00", "crawled": "2017-03-29T12:40:45.396+03:00", "highlightTitle": ""}