{"organizations": [], "uuid": "1f79aefb2b51f5e00aba912a7dbed5890b863cae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/30223470/15921399.jpg", "site_section": "http://www.thisisleicestershire.co.uk/generalelection2010/rss.html?chid=182803", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/ops-cancelled-as-norovirus-hits-busy-hospital-wards/story-30223470-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "CathyBuss published Operations cancelled as norovirus strikes at Leicester Royal...", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "CathyBuss published Operations cancelled as norovirus strikes at Leicester Royal...", "spam_score": 0.0, "site_type": "news", "published": "2017-03-23T18:00:00.000+02:00", "replies_count": 0, "uuid": "1f79aefb2b51f5e00aba912a7dbed5890b863cae"}, "author": "CathyBuss", "url": "http://www.leicestermercury.co.uk/ops-cancelled-as-norovirus-hits-busy-hospital-wards/story-30223470-detail/story.html", "ord_in_thread": 0, "title": "CathyBuss published Operations cancelled as norovirus strikes at Leicester Royal...", "locations": [], "entities": {"persons": [{"name": "david jenkins", "sentiment": "none"}, {"name": "marcy fisher", "sentiment": "none"}, {"name": "andrew furlong", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "jenkins", "sentiment": "none"}], "locations": [{"name": "leicester", "sentiment": "none"}, {"name": "glenfield hospital", "sentiment": "none"}, {"name": "leicester royal infirmary", "sentiment": "none"}, {"name": "glenfield", "sentiment": "none"}, {"name": "mountsorrel", "sentiment": "none"}, {"name": "glenf", "sentiment": "none"}], "organizations": [{"name": "cathybuss", "sentiment": "negative"}, {"name": "operations", "sentiment": "negative"}, {"name": "a&e", "sentiment": "none"}, {"name": "glenfield hospital operations", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Operations cancelled as norovirus strikes at Leicester Royal Infirmary and Glenfield Hospital By CathyBuss | Posted: March 23, 2017 0 COMMENTS SHARES Wards have been shut and hospitals have been cancelled at Leicester Royal Infirmary and Glenfield Hospital Operations cancelled as norovirus strikes at Leicester Royal Infirmary and Glenf... X \nCopy link to paste in your message / Comments (0) \nHospital bosses have been forced to cancel a number of operations after a surge in emergency admissions along with an outbreak of norovirus . \nSix wards at Leicester Royal Infirmary and Glenfield Hospital have been hit by the highly infectious winter vomiting bug. \nVisiting has been restricted and extra infection prevention precautions have been taken. \nMarcy Fisher, from Mountsorrel, has been waiting 18 months for surgery and was told on Tuesday that the operation would be not be going ahead. \nRead more: Wait goes on for Leicester GP accused of providing poor care to eight patients \nThe 44-year-old suffers from a skin condition which causes masses of often very painful cysts. This is combined with lymphoedema which causes swelling. \nShe said: \"I got a message from the hospital on Tuesday (March 21) telling me that 50 operations had been cancelled this week and next because of norovirus. \n\"I have been waiting 18 months for this operation and now it seems it could be the end of May before it is re-scheduled. \n\"I had arranged for my mum and dad to come and look after me when I came out of hospital and my daughter had booked a week off work.\" \nRead more: Leicester's hospitals 'will suffer staffing crisis because of Brexit' \nAndrew Furlong, medical director for Leicester's hospitals, said that this month has seen high patient admissions and attendances in A&E. \nHe added: \"Our position has been made more challenging by several cases of norovirus at the infirmary and Glenfield, which has resulted in restricted access on a number of wards over the last two weeks.\" \n\"We made the difficult decision on Tuesday to restrict elective operations for the coming week, a necessity to improve capacity to treat emergency and cancer patients across all three of our hospitals. \n\"We recognise this will impact on many patients and staff and we are very sorry for this.\" \nDr David Jenkins, consultant medical microbiologist and lead infection control doctor for Leicester's hospitals said the norovirus infection is common at this time of year. \nHe added: \"When patients are identified as having the symptoms of norovirus they are either isolated in single bedded rooms or bay restrictions are applied. \n\"Wards are restricted in terms of patient, visitor and staff movement and increased infection prevention precautions are undertaken.\" \nThese include patients with symptoms being nursed by separate staff where possible and increased frequency of ward cleaning. \nDr Jenkins said: \"As a consequence of these interventions, most of the wards recently affected by norovirus are already back into full use and it is anticipated the remaining two affected wards will be fully operational within the next few days.\" What is norovirus? Norovirus is also known as the winter vomiting bug because it is more commonly seen in the winter, although it can be caught at any time of the year. It causes diarrhoea and vomiting. The incubation period is around two days from the time of infection to symptoms appearing. Symptoms include suddenly feeling sick, projectile vomiting and watery diarrhoea. Sufferers may also have a slight fever, headaches, painful stomach cramps and aching limbs. The symptoms usually appear a day or two after infection and last for between two and four days. There is no cure and those with the infection should drink plenty of fluids and special rehydration drinks are available in sachets from pharmacies. Paracetamol should be taken for fever, aches and pains. Babies and the elderly are at greater risk of dehydration. Medical attention is not usually needed unless your baby or child passes six or more watery stools in 24 hours or vomited three times or more in 24 hours or is less responsive, feverish or has pale skin. Norovirus is very infectious. To stop it spreading hands should be washed regularly and those affected should stay off work or school for at least 48 hours after symptoms have cleared.", "external_links": [], "published": "2017-03-23T18:00:00.000+02:00", "crawled": "2017-03-23T15:14:02.735+02:00", "highlightTitle": ""}