{"organizations": [], "uuid": "d3cfc141e5fd55ab06cdfb505d863e9ec56e4d4e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30239402/15933497.jpg", "site_section": "http://www.middevongazette.co.uk/all-content.rss", "section_title": "Devon Live All Content Feed", "url": "http://www.devonlive.com/three-top-torbay-hotels-sold-for-a-total-of-12-5m-to-foreign-buyer/story-30239402-detail/story.html", "country": "GB", "title": "TinaCrowson published Three top Torbay hotels sold for a total of £12.5m to...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "TinaCrowson published Three top Torbay hotels sold for a total of £12.5m to...", "spam_score": 0.0, "site_type": "news", "published": "2017-03-30T23:29:00.000+03:00", "replies_count": 0, "uuid": "d3cfc141e5fd55ab06cdfb505d863e9ec56e4d4e"}, "author": "TinaCrowson", "url": "http://www.devonlive.com/three-top-torbay-hotels-sold-for-a-total-of-12-5m-to-foreign-buyer/story-30239402-detail/story.html", "ord_in_thread": 0, "title": "TinaCrowson published Three top Torbay hotels sold for a total of £12.5m to...", "locations": [], "entities": {"persons": [{"name": "steve furness", "sentiment": "none"}, {"name": "romanoff", "sentiment": "none"}, {"name": "mark jenkins", "sentiment": "none"}, {"name": "martin rogers", "sentiment": "none"}, {"name": "rogers", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "kim", "sentiment": "none"}, {"name": "furness", "sentiment": "none"}], "locations": [{"name": "hong kong", "sentiment": "none"}, {"name": "belgrave road", "sentiment": "none"}, {"name": "shanghai", "sentiment": "none"}, {"name": "fowey", "sentiment": "none"}, {"name": "fairtree capital", "sentiment": "none"}, {"name": "belgrave sands hotel", "sentiment": "none"}, {"name": "headland hotel", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "babbacombe road", "sentiment": "none"}, {"name": "bay", "sentiment": "none"}, {"name": "paignton", "sentiment": "none"}, {"name": "queens road", "sentiment": "none"}, {"name": "torquay", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "south africa", "sentiment": "none"}, {"name": "daddyhole plain", "sentiment": "none"}, {"name": "cornwall", "sentiment": "none"}], "organizations": [{"name": "savills", "sentiment": "none"}, {"name": "harbour hotels", "sentiment": "none"}, {"name": "queens hotel", "sentiment": "none"}, {"name": "fairtree capital", "sentiment": "none"}, {"name": "brownsword hotel group", "sentiment": "none"}, {"name": "imperial hotel", "sentiment": "none"}, {"name": "duchy hotel group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Comments (0) \nA trio of top Torbay hotels has been sold to international investors for a total of £12.5million. And the sale of the Duchy Hotel Group comes as another major Torquay hotel, the four star Palace Hotel, in Babbacombe Road is under contract. \nThe sale also comes less than a year after the purchase of the town’s Imperial Hotel by the Brownsword Hotel Group also for £12.5m and is being hailed as a positive sign for the area’s tourism industry. \nThe Duchy Hotel Group, represented by international real estate advisor Savills, has sold three three star hotels in Torbay to Fairtree Capital from South Africa – The Headland Hotel in Torquay, The Palace Hotel and The Queens Hotel, both in Paignton. \nIn total the three hotels offer more than 200 bedrooms and a range of bars, restaurants and spa facilities. Well regarded in the local area, the three hotels are used by locals and visitors alike for their dining and wedding packages and health and fitness facilities. \nOwner Steve Furness confirmed that all 150 jobs are secure. “It was important to me that all 150 jobs are safe, and customers who use the hotels wont notice any difference.” \nMr Furness said he had been approached by the investors. “It was an offer which was too good to refuse,” he said. \nHe and his daughter Kim will continue to run the new Belgrave Sands Hotel in Belgrave Road, previously run by Mark Jenkins when it was the Hotel Kistor. They have spent some £3m on a radical refurbishment. \nRead more: Police say crime czar election expenses investigation nearing completion \nBut Mr Furness said they had plans for further investment in the area. \nMartin Rogers, head of UK hotel transactions ay Savills, comments: “The Duchy Hotels are three well established businesses. We are pleased to have secured the sale of these hotels for our client following a competitive but confidential marketing process. This represents yet another regional hotel purchase by an international investor, part of a growing number of global enquiries for regional assets procured through Savills global hotels team. ” \nMr Rogers said Fairtree Capital already have other hotels in the UK including one in Fowey, Cornwall. \n“It’s a pure investment for them. They have a company which runs their hotels in the UK. \n“Five years ago if you had said we could sell hotels in Torquay to international investors I wouldn’t have believed it. But there are more and more overseas purchasers coming into the UK and buying hotels regionally. \nRead more : Torbay's obesity hospital admissions are more than twice national average \n“The market is coming back big time,” said Mr Rogers who runs the hotels team for Savills for the whole of Europe. \n“I will be spending ten days in Beijing, Shanghai, Hong Kong, Singapore with a roadshow of hotels for sale to show investors. I wouldn’t be going if I didn’t think they would sell. \n“It is primarily Far Eastern, South African and Indian buyers who are interested.\" \n“My primary target for the past 12 months has been the Torbay market. The Palace Hotel in Torquay is under contract with a serious buyer who is an overseas investor.” \nHe added: “I think it will be a good year for tourism. I think Brexit is working in our favour, hotels are 20 per cent cheaper for foreign investors than they were last June, and with more Europeans coming to the UK it is looking good.” \nMr Furness first bought the Queens Hotel on Queens Road, Paignton after having spent time, unpaid, working as a waiter and barman at the the Overmead at Daddyhole Plain, Torquay. At that time the Queens Hotel had 39 rooms but over the years it was refurbished and expanded into neighbouring hotels and now has 76 rooms. \nHe said when he bought the Overmead at Daddyhole Plain, which was originally called the Villa Syracusa, a private home built for the Russian Romanoff family, he said it was ‘on its knees’. The Palace Hotel was losing £6,000 a week. The fortunes of both have been transformed by investment in quality. \nMr Furness said: “I have been coming to the Bay since I was a small child and it means a lot to me. I think Torbay is one of the best places on the south coast to buy hotels going forward. I think the Harbour Hotels plans for the Pavilion site are great for the Bay. You don’t go to only one shoe shop if you are trying to buy a pair of shoes, you want a nice choice.”", "external_links": [], "published": "2017-03-30T23:29:00.000+03:00", "crawled": "2017-03-30T22:52:57.290+03:00", "highlightTitle": ""}