{"organizations": [], "uuid": "0930faa0ba2c68e9c4e08e1af58203a628a1bf3c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30182392/15890309.jpg", "site_section": "", "section_title": "", "url": "http://www.devonlive.com/exeter-bus-station-redevelopment-in-deep-water-as-tories-hit-out-at-council-passion-project/story-30182392-detail/story.html", "country": "US", "title": "Exeter bus station redevelopment in deep water as Tories hit out at council \"passion project\" | Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "Exeter bus station redevelopment in deep water as Tories hit out at council \"passion project\" | Devon Live", "spam_score": 0.558, "site_type": "news", "published": "2017-03-06T17:47:00.000+02:00", "replies_count": 0, "uuid": "0930faa0ba2c68e9c4e08e1af58203a628a1bf3c"}, "author": "", "url": "http://www.devonlive.com/exeter-bus-station-redevelopment-in-deep-water-as-tories-hit-out-at-council-passion-project/story-30182392-detail/story.html", "ord_in_thread": 0, "title": "Exeter bus station redevelopment in deep water as Tories hit out at council \"passion project\" | Devon Live", "locations": [], "entities": {"persons": [{"name": "chris grayling", "sentiment": "none"}, {"name": "kevin mitchell", "sentiment": "none"}, {"name": "cllr percy prowse", "sentiment": "none"}, {"name": "cllr pete edwards", "sentiment": "none"}, {"name": "cllr phil bialyk", "sentiment": "none"}, {"name": "cllr andrew leadbetter", "sentiment": "none"}, {"name": "cllr rob newby", "sentiment": "none"}, {"name": "cllr yolanda henson", "sentiment": "none"}, {"name": "cllr chris musgrave", "sentiment": "none"}, {"name": "cllr david henson", "sentiment": "none"}, {"name": "drury", "sentiment": "none"}], "locations": [{"name": "exeter", "sentiment": "none"}, {"name": "devon live exeter", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "green party", "sentiment": "none"}, {"name": "st sidwell", "sentiment": "none"}, {"name": "council", "sentiment": "none"}, {"name": "exeter's travel shop", "sentiment": "none"}, {"name": "leisure complex board", "sentiment": "none"}, {"name": "exeter city swimming club", "sentiment": "none"}, {"name": "exeter bus station", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "pspo", "sentiment": "none"}, {"name": "exeter's labour", "sentiment": "none"}, {"name": "ecc", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}, {"name": "exeter tory", "sentiment": "none"}, {"name": "devon contract waste", "sentiment": "none"}, {"name": "labour council", "sentiment": "none"}, {"name": "bus station", "sentiment": "none"}, {"name": "exeter city council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Exeter bus station redevelopment in deep water as Tories hit out at council \"passion project\" By Alex_Richards | Posted: March 06, 2017 1 COMMENTS SHARES Comments (1) \nThe future of Exeter City Council's multi-million pound bus station redevelopment is in deep water, with political opposition in the city now demanding clear answers. \nExeter's Conservative Party has called a rare emergency meeting to bring the Labour council to task over the current debacle. \nIt was announced recently that the project had been put on hold because they had not appointed a contractor, despite it burning through its almost £40million combined pot for St Sidwell's Point and the bus station. \nExeter Tory leader Cllr Andrew Leadbetter has blasted the city council for \"biting off more than it can chew\" with their unrealistic \"passion project.\" \nRead more: Fire service say cause of Devon Contract Waste blaze is undetermined - Latest \nIn his 20 years on the council he claims he has never seen \"such disarray\" on a development. \nHe said: \"The whole thing so far has been shrouded in secrecy. And we want a proper explanation about what is happening. \n\"For instance, is it a long-term delay? Is it a cancellation? How much has been spent so far? What is the secrecy and why can't all members be told? \n\"If the Labour council is getting this so wrong, what else can they get wrong? \n\"We want to talk to the people about what cheaper option they would want there. We are certainly not adverse to the idea of a theatre or a hotel and conference centre.\" \nHe added: \"I also have strong concerns about the Crown Estate's Princesshay Leisure part of the scheme. They do not need much to walk away from this, and we'll be left with a bomb site.\" \nThe Conservative Party had been strongly critical of the plans in their election campaign in May 2016.There appears to be unrest within the Labour council itself regarding the development. \nCllr Chris Musgrave, who last week defected to the Green Party after being a Labour member for 10 years, partly blamed the handling of the bus and coach station redevelopment for the shock move. \nRead more: Exeter's Travel Shop will remain open as Bus Station plans are put on hold \nChris Grayling (Leader of the House of Commons and the Lord President of the Council) visits Conservative representatives at Exeter Bus Station. \nHe claims the views of 'backbench' councillors were not heard during the decision process – with major decisions \"made behind closed doors by a small clique.\" \nLiberal Democrat Kevin Mitchell added: \"When this project was initially mooted I raised questions at the time as to if measures had been put in place to protect the city council financially and I was assured this was the case. Now it appears the costs may well rise further.\" \nThe last major city council-led development (RAMM) ended up having a massive overspend due to decisions taken at the early planning stage and delays during its implementation. I had hoped the city council had learned from that experience and very much hope history is not repeating itself.\"It isn't just the political opposition who are demanding answers. \nExeter City Swimming Club will also attend the emergency meeting, which will be open to members of the public. \nChair Dean Drury said: \"Every other town in the UK could build three leisure centres with the £28million budget that this council has secured and ECC are fully aware of this, yet choose to brush it under the rug. \n\"ECC have never made it their goal to give the citizens of Exeter the 'best deal' from the outset of this project. \n\"You only have to look on the map at the number of city centre student blocks now cropping up to realise that this whole project exists solely to create a mini-campus to cater for the vast numbers of students that will now be living in the immediate area surrounding St Sidwell's Point.\" \nRead more: Exeter's Labour council, the PSPO and bus station scheme SLAMMED by defector \nCllr Phil Bialyk, chair of the Bus Station and Leisure Complex Board, said: \"There is no doubt the Brexit and the current state of the economy has had its impact, more than we expected. \n\"Not everything is marvellous in the country, despite what the Brexiteers tell you. There are a number of projects not going ahead, or not going ahead as quickly.\"But we are incredibly nervous about getting this right. We want this to work and that's our plan.\" \nThe requisition letter from the Conservative Party to council leader Cllr Pete Edwards reads as follows: \"In accordance with Standing Order One please accept this requisition, duly signed by five members of the council, requesting you call an extraordinary meeting of the council. \n\"The reason is to ask you as leader to make a full statement in respect of and explaining what is happening regarding the new swimming pool and redevelopment of the bus station site, including the closure of Paris Street (although not restricted to this) and all items pertaining to the project and its environs and its reported delay and escalating costs.\"Also, to allow the opposition parties and others to question you.\" \nThe letter has been signed by Cllr Andrew Leadbetter, Cllr David Henson, Cllr Percy Prowse, Cllr Yolanda Henson and Cllr Rob Newby. \nThe date and venue of the emergency meeting will be revealed by the city council in due course. ", "external_links": [], "published": "2017-03-06T17:47:00.000+02:00", "crawled": "2017-03-06T13:29:35.782+02:00", "highlightTitle": ""}