{"organizations": [], "uuid": "39b0ab6bb5de95cbf0e347aaa92f030e6bb19c18", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12720412.ece/ALTERNATES/s1200/JS114051769.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/wetherspoon-boss-slams-chancellor-dinner-12721454", "country": "GB", "domain_rank": 21960, "title": "Wetherspoon boss slams Chancellor for 'dinner party' budget as profit soar 43%", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Wetherspoon boss slams Chancellor for 'dinner party' budget as profit soar 43%", "spam_score": 0.0, "site_type": "news", "published": "2017-03-10T20:06:00.000+02:00", "replies_count": 0, "uuid": "39b0ab6bb5de95cbf0e347aaa92f030e6bb19c18"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/wetherspoon-boss-slams-chancellor-dinner-12721454", "ord_in_thread": 0, "title": "Wetherspoon boss slams Chancellor for 'dinner party' budget as profit soar 43%", "locations": [], "entities": {"persons": [{"name": "wetherspoon", "sentiment": "negative"}, {"name": "tim martin", "sentiment": "negative"}, {"name": "martin", "sentiment": "none"}, {"name": "philip hammond", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "george osborne", "sentiment": "none"}, {"name": "hammond", "sentiment": "none"}], "locations": [{"name": "belgravia", "sentiment": "none"}, {"name": "notting hill", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}], "organizations": [{"name": "national insurance", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Wetherspoon boss slams Chancellor for 'dinner party' budget as profit soar 43% Tim Martin says JD Wetherspoon will have to pay £30m in extra charges due as a result of tax hikes Share JD Wetherspoon chairman Tim Martin (Photo: JD Wetherspoon/PA Wire) Share Get business   Thank you for subscribing!   \nThe chairman of JD Wetherspoon has ripped into Chancellor Philip Hammond, accusing him of delivering a “budget for dinner parties” rather than pub goers. \nTim Martin used a first-half trading statement to highlight nearly £30m of extra charges Wetherspoon will have to pay as a result of tax hikes, and derided Mr Hammond for threatening the pub sector’s survival. \nHe said: “We understand the need for the Government to raise taxes, but there needs to be tax equality between pubs and supermarkets. \n“I want a reduction in business rates for pubs and an increase for supermarkets, and I want VAT for food in pubs reduced too. \n“It doesn’t make sense if you have a dinner party in Notting Hill with food from Waitrose there is less VAT charged on the food than if you go to a pub in Newcastle. \n“Government policy is favouring places like Belgravia over less affluent parts of the country where pubs are closing down.” \nMr Martin totted up a business rates bill of £7m, a £2m Apprenticeship Levy charge and a £4m hit from the sugar tax that will contribute to £29m in extra charges the group will face over the next few years. \nHe also poured scorn on Mr Hammond’s £1,000 business rates discount for pubs with a rateable value of less than £100,000, saying “that sum is dwarfed by tax and regulatory increases” and that Wetherspoon is not eligible for it in any case. \nThe outspoken New Zealander described Mr Hammond as having been “less than frank” in the budget, and also had a pop at George Osborne. \n“The Chancellor was less than frank in his budget speech, since he did not spell out the duty increases (on alcohol and tobacco), giving the impression to many that there would be no increase. \n“In effect, this was a budget for dinner parties, no doubt the preference of the Chancellor and his predecessor - dinner parties will suffer far less from the taxes outlined above, whereas many people prefer to go to pubs, given the choice,” he said. Read More \nBrexit-backing Mr Martin dismissed as “absurd” the suggestion Tory tax hikes, including a controversial increase in National Insurance payments for small businesses and the self-employed, were linked to preparing the country for Brexit. \n“The way you prepare is by having an efficient economy with fair taxes,” he said. \nOn Brexit, Mr Martin added: “We need immigration, and we should have a preferential system for EU workers, like we had with Ireland.” \nAsked if he had any regrets about backing the Leave campaign in light of the seemingly “hard Brexit” Theresa May has favoured, he said: “I don’t have any regrets, I’m breakdancing in the car park.” \nThe pubs boss made the comments alongside half-year results, which saw pre-tax profits climb 43% to £51.4m in the 26 weeks to January 22. \nLike-for-like sales rose 3.3% while revenue nudged up 1.4% to £801.4m. \nTrading in the second half has got off to a mixed start, with like-for-like sales rising by 2.7% and total sales falling by 0.2% in the six weeks to March 5. Like us on Facebook", "external_links": [], "published": "2017-03-10T20:06:00.000+02:00", "crawled": "2017-03-10T16:14:11.748+02:00", "highlightTitle": ""}