{"organizations": [], "uuid": "a14a4ecf49ccc62d5bbd0a3fee55a999cac8f812", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12739554.ece/ALTERNATES/s1200/TKR_NJL_231214PetardseyeTrain.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12806479", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Gateshead tech firm's £4.3m contract win, plus latest news", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast LIVE: Gateshead tech firm's £4.3m contract win, plus latest news", "spam_score": 0.0, "site_type": "news", "published": "2017-03-29T15:10:00.000+03:00", "replies_count": 0, "uuid": "a14a4ecf49ccc62d5bbd0a3fee55a999cac8f812"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12806479", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Gateshead tech firm's £4.3m contract win, plus latest news", "locations": [], "entities": {"persons": [{"name": "judith doyle", "sentiment": "negative"}, {"name": "gateshead colle", "sentiment": "negative"}, {"name": "doyle", "sentiment": "none"}, {"name": "terry scuoler", "sentiment": "none"}, {"name": "uwe combuechen", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "raschid abdullah", "sentiment": "none"}, {"name": "tui  thomson", "sentiment": "none"}, {"name": "petards", "sentiment": "none"}, {"name": "combuechen", "sentiment": "none"}, {"name": "friedrich joussen", "sentiment": "none"}, {"name": "julian david", "sentiment": "none"}, {"name": "david davis", "sentiment": "none"}, {"name": "stadler", "sentiment": "none"}, {"name": "boris johnson", "sentiment": "none"}, {"name": "coreena ford", "sentiment": "none"}, {"name": "robert halfon", "sentiment": "none"}], "locations": [{"name": "gateshead", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "north africa", "sentiment": "none"}, {"name": "tokyo", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}, {"name": "sharm el-sheikh", "sentiment": "none"}, {"name": "caribbean", "sentiment": "none"}, {"name": "turkey", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "glasgow subway", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}, {"name": "egypt", "sentiment": "none"}, {"name": "east anglia", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "canary islands", "sentiment": "none"}, {"name": "mediterranean", "sentiment": "none"}, {"name": "cape verde", "sentiment": "none"}, {"name": "bussnang", "sentiment": "none"}], "organizations": [{"name": "coreena ford gateshead college", "sentiment": "negative"}, {"name": "lep", "sentiment": "negative"}, {"name": "stadler bussnang ag", "sentiment": "none"}, {"name": "cbi", "sentiment": "none"}, {"name": "tuc", "sentiment": "none"}, {"name": "gateshead college", "sentiment": "none"}, {"name": "state for education", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "nintendo", "sentiment": "none"}, {"name": "nintendo switch", "sentiment": "none"}, {"name": "nintendo switch  retailer game digital", "sentiment": "none"}, {"name": "queen elizabeth nhs", "sentiment": "none"}, {"name": "cctv", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "larsencollinge international", "sentiment": "none"}, {"name": "wto", "sentiment": "none"}, {"name": "asdo", "sentiment": "none"}, {"name": "newcastle gateshead initiative", "sentiment": "none"}, {"name": "eef", "sentiment": "none"}, {"name": "whitehall", "sentiment": "none"}, {"name": "world trade organisation", "sentiment": "none"}, {"name": "growth board", "sentiment": "none"}, {"name": "uk mainline rolling", "sentiment": "none"}, {"name": "tui group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford Gateshead College chief Judith Doyle appointed to North East LEP board \nGateshead College principal and chief executive Judith Doyle has been appointed to a new role at the North East LEP. \nMs Doyle will now work to represent the further education (FE) sector on the LEP’s business growth board. \nShe took over running Gateshead College four years ago, turning the college from one described by Ofsted as “requiring improvement” to one rated as “outstanding”. \nGateshead College is now being championed as a blueprint for the sector by Minister of State for Education and Skills Robert Halfon. \nMs Doyle said: “I am delighted to join the Growth Board and welcome the opportunity to work with such a great team of people who all share a passion and drive to help businesses grow and thrive in our region. \n“A strong infrastructure of education, training and skills aligned to the needs of industry is crucial if we are to achieve our collective ambitions.” \nMs Doyle is also a board member of the Newcastle Gateshead Initiative, the Queen Elizabeth NHS trust and is a member of the CBI’s regional council. Judith Doyle KEY EVENT Brexit deal failure would damage industry greatly, warns EEF \nManufacturers from across Europe have issued a warning that failure to achieve a deal on the UK’s departure from the European Union will be “highly damaging” for industry in both Britain and the rest of the continent. \nThe warning, on the day that Prime Minister Theresa May triggers withdrawal talks under Article 50, came from the Ceemet group of organisations representing more than 200,000 manufacturers. \nBritain’s EEF - which forms part of the group - said failure to reach a deal would risk the “lifeblood” of Britain’s economic success. \nMeanwhile, the UK’s digital industry trade body said it was vital for tech companies to avoid a “chaotic” Brexit which sees the UK crash out of the EU on World Trade Organisation terms. \nAnd the TUC urged Mrs May - who has insisted an exit agreement and trade deal can be completed within 18 months - to take her time over negotiations in order to ensure that British workers’ rights keep pace with the remaining 27 EU states. \nSpeculation over a “hard Brexit” on WTO terms has mounted since Mrs May declared that “no deal is better than a bad deal”. \nForeign Secretary Boris Johnson said exit without a deal would be “perfectly OK”, and Brexit Secretary David Davis said on Monday that Whitehall had done a great deal of planning for that outcome. \nBut Ceemet director-general Uwe Combuechen called on Britain and the EU to deliver “a stable and orderly exit, preserving as much as possible the often complex and delicate trading relationships that are in place”. \nCalling for “pragmatism on all sides”, Mr Combuechen said: “If we are to avoid a ‘lose-lose’ outcome for European manufacturing, it is essential that all parties work towards a reasonable deal for industry, while ensuring the integrity of the single market. Simply put, a negotiation which produces no deal would be highly damaging for industry in the EU as well as the UK.” \nEEF chief executive Terry Scuoler said: “It is imperative that the Government is focused on securing a deal that will enable both British and European businesses to flourish, investment and innovation to continue and trade to flow. \n“This will be the lifeblood that is key to the UK’s future economic success - we cannot afford to see it disrupted or turned off in mid flow. \n“Forget all notion of crashing out of the EU without a deal and leaving business to pick up the pieces - focus instead on an orderly and smooth transition, the continuation of barrier-free trade, minimisation of costs and ongoing access to required talent and skills. \n“Nothing less will do.” \nTechUK chief executive Julian David said that a smooth conclusion to the negotiations was “vital” for the UK’s digital sector, which employs three million and accounts for 24% of Britain’s exports. \n“A chaotic Brexit that results in the UK falling back on WTO rules will benefit no one,” he warned. \n“The tech industry wants to see a trade agreement that ensure the industry continues to grow, including continued market access, frictionless movement of talent and a robust legal process for cross-border data flows. A new relationship must be forged that not only works for today’s economy, but for tomorrow’s digitally enabled world.” 8.15 FTSE and pound latest \nThe FTSE-100 index opened at 7343.42. \nThe pound at 8am was 1.2401 dollars compared to 1.2502 dollars at the previous close. The euro at 8am was 0.8713 pounds compared to 0.8678 pounds at the previous close. 8.10 Coreena Ford Long-haul holidays on the up, says Tui \nThomson owner Tui Group said British sun-seekers were snapping up more long-haul holidays and cruises as concern over terrorist attacks and political turmoil continue to blight markets in Turkey and North Africa. \nThe travel giant’s northern region, which includes the UK market, recorded an 11% and 10% jump in revenues for the winter and summer periods respectively. The rise was underpinned by a healthy rise in bookings by British holidaymakers, with revenues climbing by a fifth for the winter of 2016/17 and by 11% for the summer of 2017. Chief executive Friedrich Joussen said winter trading had been helped by a “good performance” from its hotels and resorts arm, while summer bookings were in line with forecasts. \nHe added: “Whilst the impact of macroeconomic and geopolitical challenges is evident in certain source markets and destinations, our balanced portfolio of markets and destinations, our focus on growth in own hotel and cruise brands and our strong balance sheet put us in a robust position.” \nThe group said winter revenues had been boosted by a growing appetite for long-haul and cruise holidays from the UK, coupled with a stronger demand for trips to the Canary Islands, Spain and Cape Verde. \nSummer holiday bookings were being driven by rising demand for holidays to the western Mediterranean and the Caribbean, the firm added. \nHowever, bookings to Turkey and Egypt suffered, as holidaymakers remain cautious about the destinations following the bombing of a plane from the Egyptian resort of Sharm el-Sheikh and a violent attempted coup by the Turkish army, which has been followed by a string of terrorist attacks in the country. St.Lucia in the Caribbean - more people are taking long haul holidays, according to Tui (Photo: LarsenCollinge International) 8.05 Coreena Ford Game Digital cheers launch of Nintendo Switch \nRetailer Game Digital has cheered the launch of the new Nintendo Switch console for helping rescue flagging sales after a tough first half. \nThe chain said UK sales have jumped by 7% since the end of January amid surging demand for the Nintendo games console, which launched earlier this month. It comes as a welcome boost after a difficult first half, with Game posting a 26.7% tumble in pre-tax profits to £16.5 million for the six months to January 28. Sales, by gross transaction value, slumped 18.1% in the UK over the first half. \nGame said sales across both the UK and its better performing Spanish business were 20% higher in the first seven weeks of its second half thanks to the Nintendo Switch launch. \nBut it warned: “Going forwards this positive momentum will be highly dependent on stock availability.” \nThe console launch has breathed new life into the market, which Game said had been “challenging”, with a weaker line-up of game launches in the first half impacting already tough trading. \nIts first half profits plunge follows an annual crash in earnings of more than 80% for the year to July 30. \nSales of games consoles continued to be hit hardest in the most recent six months, plunging by 34.2% across the group’s 311 UK stores. \nGame said its turnaround plan helped cut costs by more than £5 million in the first half and said it would be reviewing its store estate further, with over 200 shop leases due to come up for renegotiation. \nIt is also pushing into new areas, such as virtual reality e-sports and live gaming events to offset tougher retail sales. \nThe group has launched “gaming arenas” in seven stores, with plans for at least another 20 by the end of the year. \nIts store review is also set to see it shift to larger shops in some areas to allow it to “accommodate its full social, experiential and competitive gaming proposition”, according to the group. A model puts the controller on to the Nintendo Switch during a presentation event of the new Nintendo Switch in Tokyo 8.00 KEY EVENT Petards secures £4.3 \nGateshead security and surveillance system developer Petards has announced it has been awarded a £4.3m contract with a Swiss train manufacturer. \nThe deal will see Petards supply Stadler Bussnang AG with its eyeTrain CCTV and Automatic Selective Door Opening (ASDO) systems, which will then be integrated into Stadler’s FLIRTUK trains - their first in the UK. \nEngineering activities start straight away and the first deliveries start in June, with the whole contract expected to be completed during Q2 2019. \nThe firm said the equipment will provide the trains and the driver with enhanced capability in the areas of security and surveillance through CCTV coverage, while the ASDO system delivers improved passenger operations at stations where the platforms are shorter than the trains. \nPetards chairman Raschid Abdullah said: “We are delighted that Petards eyeTrain CCTV and ASDO systems have been selected by Stadler for their first UK Mainline Rolling stock contract. \n“This new contract provides Petards with another exciting rail project with a new customer, which significantly enhances its position as a leading provider of security and surveillance systems to the UK Rail industry and considerably adding to the group’s present order book for delivery over the next three years. \n“We welcome Stadler as a new customer of Petards with the integration onto their FLIRT platform. \n“We are all thrilled about the potential of this new partnership with Stadler, a long established world leading train builder.” \nStadler is headquartered in Bussnang, Switzerland and operates in 18 countries, providing everything from high speed trains, intercity, regional and commuter trains, trams, tram-trains and underground trains. \nIn the UK, Stadler’s Variobahn trams operate on the London Tramlink. Its Class 68 diesel locomotive is the most powerful to run in the UK, and the Class 88 dual mode locomotives are used on freight and passenger services. It has recently been awarded a contract to build electric and bi-mode multiple units for the new East Anglia franchise, part of the largest ever rolling stock procurement in the history of the UK, and is providing the vehicles for the Sheffield tram-train, the first of its kind in the UK. \nIt is also part of the consortium supplying a new fleet of trains for the Glasgow Subway. Share", "external_links": [], "published": "2017-03-29T15:10:00.000+03:00", "crawled": "2017-03-29T10:33:50.424+03:00", "highlightTitle": ""}