{"organizations": [], "uuid": "8bc73798ac034c66fbb1c8b92f169930cf8b916e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12692200.ece/ALTERNATES/s1200/SGP_NEC_040317MARCH07JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/hundreds-gather-pro-europe-march-12692166", "country": "GB", "domain_rank": 21960, "title": "Hundreds gather for pro-Europe march in Newcastle city centre", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Hundreds gather for pro-Europe march in Newcastle city centre", "spam_score": 0.0, "site_type": "news", "published": "2017-03-04T22:21:00.000+02:00", "replies_count": 0, "uuid": "8bc73798ac034c66fbb1c8b92f169930cf8b916e"}, "author": "Lisa Hutchinson", "url": "http://www.chroniclelive.co.uk/news/north-east-news/hundreds-gather-pro-europe-march-12692166", "ord_in_thread": 0, "title": "Hundreds gather for pro-Europe march in Newcastle city centre", "locations": [], "entities": {"persons": [{"name": "christina", "sentiment": "none"}, {"name": "kat auld", "sentiment": "none"}, {"name": "louise brown", "sentiment": "none"}, {"name": "joyce quinn", "sentiment": "none"}, {"name": "brexit  dougald", "sentiment": "none"}, {"name": "ac grayling", "sentiment": "none"}, {"name": "claire prospert", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "geordie", "sentiment": "none"}, {"name": "dougald mueller-stewart", "sentiment": "none"}], "locations": [{"name": "newcastle", "sentiment": "none"}, {"name": "heaton", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "north east for europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "hexham", "sentiment": "none"}], "organizations": [{"name": "european union", "sentiment": "none"}, {"name": "newcastle university", "sentiment": "none"}, {"name": "ec", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}, {"name": "newcastle city pool", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "north east for europe", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "geordies", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "house of lords", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nHundreds joined a pro Europe march in Newcastle city centre to show Geordie solidarity. \nSupporters from across the country and those from the political divide gathered for the event on Saturday, March 4. \nIt was organised by the North East For Europe group who say they want to show solidarity with fellow EC citizens living in the region who are concerned about their right to live and work here. \nThe march started at the Newcastle City Pool and snaked its way to the Monument where speeches from a string of high profile people took place; including world renowned philosopher and author Professor AC Grayling and former North East Labour MEP and Minister for Europe, Joyce Quinn. \nThe march follows the defeat of the government’s Brexit bill in the House of Lords last week which said ministers should guarantee EU nationals’ right to stay in the UK after Brexit. \nAnd adopted Geordies turned out in force to voice their views. Hundreds March for Europe from the city pool to Newcastle's Greys monument (Photo: Newcastle Chronicle) \nAnnoyed Dougald Mueller-Stewart, 50, from Heaton, Newcastle, held a sign saying “hands off my German wife”, while his wife Christina’s sign said: “foreigner” and their daughter’s read: “50% Geordie, 50% German, 100% European.” \nChristina, 46, said: “I have lived in Newcastle for 28 years. I teach at Newcastle University, I also graduated there. I came here to study and after all these years I don’t feel welcome any more. I have a British husband and two kids who are British and German. Since Brexit I feel the mood has really changed, we don’t feel welcome anymore and that was never an issue for EU citizens before. \n“Newcastle is my home for me. It is the uncertainty now.” Read More Tourism, inflation and race hate crime: The good, the bad and the ugly of Brexit \nDougald said: “I am concerned about the future and my main concern is about the NHS. If 10% of NHS workers leave then it would be destroyed.” \nSwede Kat Auld, 34, who lives in Hexham , said: “This is my home now. I came here in 2004 and I met my husband in the UK when I was studying and working. I am an EU citizen and it is the uncertainty about what is going to happen. I have multiple sclerosis and I am worried about the health care I need to receive.” Hundreds March for Europe from the city pool to Newcastle's Greys monument (Photo: Newcastle Chronicle) \nFrench Claire Prospert, 46, lives in Newcastle. She said: “I have been in England for 20 years and I am really concerned what the Government is saying and not guaranteeing the right of EU citizens. I am worried about my rights, I am now uncertain.” \nA spokesman for North East For Europe said: “We are Europeans and we value our friendships and partnerships with our neighbours. \n“We defend the legacy of investment, development, protection of workers’ rights and environmental improvements brought to our region by the European Union. \n“We want a future of hope and openness rather than fear and close mindedness. \n“We defend the rights of our European friends living amongst us, and those of our compatriots living in the continent.” \nAn organiser of the march Louise Brown said: “The turn out has been great. The march is to remind central government that Newcastle voted to remain and we haven’t changed our minds.” Like us on Facebook", "external_links": [], "published": "2017-03-04T22:21:00.000+02:00", "crawled": "2017-03-04T17:40:41.220+02:00", "highlightTitle": ""}