{"organizations": [], "uuid": "bf681e5c174cd468b511eadd4de4b7e9eb3279b6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.liverpoolecho.co.uk/incoming/article12754434.ece/ALTERNATES/s1200/JS114511529.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/small-businesses-reveal-brexit-wish-12769745", "country": "GB", "domain_rank": 21960, "title": "Small businesses reveal Brexit wish list as Government moves to trigger Article 50", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Small businesses reveal Brexit wish list as Government moves to trigger Article 50", "spam_score": 0.0, "site_type": "news", "published": "2017-03-21T07:01:00.000+02:00", "replies_count": 0, "uuid": "bf681e5c174cd468b511eadd4de4b7e9eb3279b6"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/small-businesses-reveal-brexit-wish-12769745", "ord_in_thread": 0, "title": "Small businesses reveal Brexit wish list as Government moves to trigger Article 50", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "negative"}, {"name": "cherry", "sentiment": "none"}, {"name": "jack", "sentiment": "none"}, {"name": "mike cherry", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "federation for small businesses", "sentiment": "none"}, {"name": "federation of small businesses  a", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "fsb", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Small businesses reveal Brexit wish list as Government moves to trigger Article 50 The FSB wants the Government to introduce exporting vouchers, tax credits and include small businesses in all trade deals Share A road traffic sign in front of the Union Jack and the European Union flag Share Get business   \nSmall businesses should be given tax incentives and exporting vouchers that can be redeemed for translation services or overseas trade missions after Brexit , according to the Federation for Small Businesses (FSB). \nThe demands - which come as Prime Minister Theresa May has indicated she will trigger Article 50 to start the UK’s process of leaving the EU on March 29 - were made as part of a FSB “wish list” outlined in its latest report, Keep Trade Easy: what small firms want from Brexit. \nThe report also calls for the Government to “secure the easiest and least costly” access to the EU single market, after research found nine out of 10 importing and exporting small businesses in the UK trade with the EU single market. \nMike Cherry, FSB national chairman, said: “FSB calls on the Government to secure the easiest and least costly access to the EU single market in the Brexit negotiations. \n“This includes a new customs arrangement with the EU that allows for frictionless cross-border trade. And we call for greater support for small businesses to gain full benefits from future trade deals with non-EU markets. \n“A small business chapter to cater to our member’s specific needs in all future trade deals is crucial.” Mike Cherry, chair of the Federation of Small Businesses \nA survey found that the top priority market for small businesses to trade with was still the EU single market, which was named by 63% of participates. Other important markets included the US (49%), Australia (29%), China (28%), and Canada (23%). \nImproving trade with countries such as the US, Australia, and Canada, should also be a major priority, the FSB said, as these markets will be the easiest for UK firms to trade after Brexit because of the shared language and similarities in culture. \nThe FSB has also claimed that giving small businesses tax credits to incentivise exporting would help the economy and lessen the trade defecit. \nOn average small firms receive 33% of their turnover from exporting but the trade body says more work should be done to help businesses grow this figure. \nMr Cherry added: “The entire trading journey and each cog of the supply chain needs to be taken into consideration when negotiating any new trade agreement. \n“Trade support needs to be tailored to what small firms really need, from the type of priority markets that would have the greatest traction with small firms to specific support measures such as small business trade missions. \n“FSB is also keen to explore with Government the role financial incentives such as export vouchers or export tax credits could have on small business exports.” Like us on Facebook", "external_links": [], "published": "2017-03-21T07:01:00.000+02:00", "crawled": "2017-03-21T03:21:34.873+02:00", "highlightTitle": ""}