{"organizations": [], "uuid": "24f7d6e090ee7555da9fe8f450c39199ec02034e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30171932/15882891.jpg", "site_section": "http://www.middevongazette.co.uk/farming.rss", "section_title": "Devon Live Farming RSS feed", "url": "http://www.devonlive.com/falling-pound-gives-income-boost-to-farmers-figures-reveal/story-30171932-detail/story.html", "country": "GB", "title": "Falling pound gives income boost to farmers, figures reveal", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "Falling pound gives income boost to farmers, figures reveal", "spam_score": 0.0, "site_type": "news", "published": "2017-03-01T19:55:00.000+02:00", "replies_count": 0, "uuid": "24f7d6e090ee7555da9fe8f450c39199ec02034e"}, "author": "AthwennaIrons", "url": "http://www.devonlive.com/falling-pound-gives-income-boost-to-farmers-figures-reveal/story-30171932-detail/story.html", "ord_in_thread": 0, "title": "Falling pound gives income boost to farmers, figures reveal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Falling pound gives income boost to farmers, figures reveal   Farmers are still feeling the impact of an unpredictable and volatile marketplace, despite improved commodity prices, industry leaders are warning Falling pound gives income boost to farmers, figures reveal   Comments (0) \nFortunes for Westcountry farmers look set to improve in the coming year, despite the uncertainty caused by Brexit, new figures have revealed. \nThe Farm Business Income for 2016-17, published by the Department for Environment, Food and Rural Affairs (Defra), show an improvement in financial prospects for farmers working in many of the industry's main sectors. \nThe falling value of the pound, escalated by Britain's decision to leave the European Union, has been identified as a key driver for increasing profit, says the forecast. \nFirmer pig meat prices, driven by weaker sterling and tighter supplies, have put pig producers in a strong position and their incomes look set to rise from £21,600 in 2015-16 to £57,000 in 2016-17 - a staggering increase of 163%. \nGeneral cropping farms are expected to see their incomes increase by 24% to £77,500, with cereal farms set to rise by around 7% to £38,000. Firmer prices should more than offset the lower 2016 harvest yields, the report suggests. \nFor grazing livestock in the less favoured area (LFA) and grazing livestock (lowland), rises of £24,500 (29%) and £19,000 (58%) are predicted. \nRead next: Watch how Stags' Chris Clapham is going back to his roots \nMixed farms also look set to benefit from improved output and an increase to the 2016 Basic Payment Scheme (BPS) handouts, with a forecasted profit rise of £29,000 (58%). \nBut while the majority of sectors are seeing improved commodity prices, industry leaders have warned that farmers are still feeling the impact of an unpredictable and volatile marketplace. \nDairy and poultry are the only two sectors expected to see a fall in their incomes, with profitability dropping by £22,500 (49%) and £74,000 (31%) respectively. Reduced milk output, falling egg prices and higher feed costs are being blamed for this decline. \nSharp rises in farm inputs such as for feed, fertilisers and machinery are causing the wider industry to suffer, said Meurig Raymond, President of the National Farmers' Union (NFU). \"It is good news that many sectors are currently seeing improved commodity prices,\" he commented. \nRead also: Free range eggs to lose status in latest bird flu measures \n\"However, for all sectors these figures can quickly change and steep reductions in the dairy and poultry sectors only go to emphasise that farmers are in an extremely volatile sector.\" \nHe added: \"Looking ahead, this uncertainty shows no sign of abating and there will be many challenges ahead as Brexit negotiations begin. With that in mind, I am calling on the government to ensure it can introduce a domestic agricultural policy which helps build a more profitable farming industry, by focusing on productivity, volatility mitigation and environmental measures, as highlighted at our conference last week. \n\"Our industry now needs certainty and firm commitments from government if the country is to feel the benefits of a thriving food and farming industry. NFU members want to deliver on a vision shared with Government for an increasingly profitable, competitive and sustainable food and farming sector. \n\"We have been clear on what we believe is needed to achieve this. Firstly unrestricted access to the European market, secondly continued access to a competent and reliable workforce both pre and post farm-gate and thirdly a new agricultural policy which assists in the development of an increasingly productive, progressive and above all profitable farming sector.\"", "external_links": [], "published": "2017-03-01T19:55:00.000+02:00", "crawled": "2017-03-01T17:38:32.399+02:00", "highlightTitle": ""}