{"organizations": [], "uuid": "d10c1bfbcf8a0b46ddb222f8951af59ad53b515a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12695385.ece/ALTERNATES/s1200/YEMEN_Raid_163273.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/yemen-beautiful-rugged-impoverished-country-12695388", "country": "GB", "domain_rank": 21960, "title": "Yemen: A beautiful, rugged, impoverished country that is being destroyed by conflict", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Yemen: A beautiful, rugged, impoverished country that is being destroyed by conflict", "spam_score": 0.0, "site_type": "news", "published": "2017-03-06T01:00:00.000+02:00", "replies_count": 0, "uuid": "d10c1bfbcf8a0b46ddb222f8951af59ad53b515a"}, "author": "Kate Thick", "url": "http://www.chroniclelive.co.uk/news/north-east-news/yemen-beautiful-rugged-impoverished-country-12695388", "ord_in_thread": 0, "title": "Yemen: A beautiful, rugged, impoverished country that is being destroyed by conflict", "locations": [], "entities": {"persons": [{"name": "antonio guterres", "sentiment": "none"}, {"name": "yemini", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "afrah nasser", "sentiment": "none"}, {"name": "guterres", "sentiment": "none"}, {"name": "hadi", "sentiment": "none"}, {"name": "saleh", "sentiment": "none"}], "locations": [{"name": "yemen", "sentiment": "none"}, {"name": "aden", "sentiment": "none"}, {"name": "saudi arabia", "sentiment": "none"}, {"name": "nigeria", "sentiment": "none"}, {"name": "yemen", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "iraq", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "riyadh", "sentiment": "none"}, {"name": "sanaa", "sentiment": "none"}, {"name": "south sudan", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}, {"name": "somalia", "sentiment": "none"}], "organizations": [{"name": "houthi", "sentiment": "none"}, {"name": "oxfam", "sentiment": "none"}, {"name": "un", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "gulf cooperation council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Opinion People inspect the rubble of a house destroyed by a Saudi-led airstrike in the outskirts of Sanaa, Yemen (Photo: PA Wire) Share Get daily updates   Thank you for subscribing!   \nAden, a port city in Yemen, has long been on the ‘must visit’ list as my parents met and married there in the 1940s. But little of its rich culture remains. \nThis beautiful, rugged, impoverished country is being destroyed. Conflict is rapidly pushing Yemen – with a median age of only 19 - towards social, economic and institutional collapse. \nA civil war over territory, power and resources has become a regional conflagration, another Syria. \nAs ever with the Middle East, it is a complicated story in which the British do not come out well, although we should and could. \nYemenis are unlucky; their northern neighbour, Saudi Arabia, a regional pariah, is a country the UK courts. The UK’s defence industry makes about 20% of arms exported globally; in 2015, 83% of UK arms exports, worth £900m, went to Saudi Arabia. \nA brutal Saudi-led intervention is creating a wasteland where militant extremists fleeing Iraq and Syria are flourishing, further exacerbating instability. Last month Trump approved a covert counter-terrorism operation on al-Qaeda in Yemen without sufficient intelligence or preparation, killing many civilians. \nAden is beset by lawlessness. Yemenis are trapped, goods cannot enter. Yemen imported 90% of its food. Smuggling is booming but food and water are now completely unaffordable to most civilians. \nThe Saudi-led collation forces use UK-manufactured weapons in violation of international humanitarian law during their ongoing bombardment of Iranian-backed Houthi forces loyal to the country’s former president, Saleh, ousted in the Arab Spring (through a then vibrant Yemini civil society). The Saudi-led coalition is supporting Hadi, the internationally recognised president, driven out by Houthi rebels. Read More In the African country of South Sudan, magical moments really do last a lifetime \nNeither Hadi nor Saleh have much claim to legitimacy. Saleh, a truly dreadful president, ruled for 33 years. The jury is still out on Hadi who has little support on the ground. Yemeni activists and civilians express disdain for both sides of the conflict. \nAfrah Nasser, a Yemini journalist, tweeted; “Yemenis are too exhausted to cry out.” \nA recent letter in this fine newspaper gave a tragic statistic: 80% of the population is in need of humanitarian assistance; 19 million Yemenis face death from bombs, starvation, and a lack of water, sanitation and health services. Houses, schools, hospitals, bridges, airports, factories, archeological sites and markets have been deliberately bombed. The humanitarian crisis could put Yemen’s development back decades; a whole generation with life opportunities curtailed. \nThe UN Secretary-General Antonio Guterres said $4.4 billion is needed by the end of this month “to avert a catastrophe”; the first famine recorded worldwide in six years blights Nigeria, Somalia, South Sudan as well as Yemen. So far $90 million had been received. Guterres pleaded, “There is no excuse for inaction in a world of plenty.” \nThe British public has responded generously since the launch of an appeal for Yemen. Many more lives could have been saved by earlier action. The warning signs were there. The UN needs a much larger pool of data and resources for preventing and fighting emergencies but a populist world is unlikely to vote for that. Read More No ifs, no buts - just life: The extraordinary story of a Newcastle charity's 'unseen' work \nAden was a British Crown colony from 1937 to 1963 but it wasn’t until 1967 that the British Empire entirely withdrew. Many Yemenis think we should be using our knowledge of the country and its history to help broker a ceasefire under UN auspices. \nThere are no good guys in this war. The UK should not be supplying weapons. An arms embargo won’t help as there are too many suppliers but the UK should be a mediator, not supporting one side of the conflict. We are sending food, medicine … and bombs. The British government’s position, with Brexit colouring its judgement, is internally inconsistent. London has a speedy post-Brexit trade deal with the Gulf Cooperation Council in mind so antagonising Riyadh is not on the cards. \nThe British are viewed with respect in Yemen but this is being shredded daily. A moral, effective intervention would be to establish a water supply and food marketing system, and help bring about a long term negotiated peace settlement under a citizen-led regime. \nOxfam is raising funds for the 1.5 million children facing starvation; donate £5 by texting YEMEN to 70101. Like us on Facebook", "external_links": [], "published": "2017-03-06T01:00:00.000+02:00", "crawled": "2017-03-05T20:13:42.916+02:00", "highlightTitle": ""}