{"organizations": [], "uuid": "15aa46cd021c6d6a2c55bb1d5dab78db50310c3c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article9216376.ece/ALTERNATES/s1200/JS62995426.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/north-east-conservative-who-led-12748518", "country": "GB", "domain_rank": 21960, "title": "North East Conservative who led opposition to National Insurance increases welcomes u-turn", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "North East Conservative who led opposition to National Insurance increases welcomes u-turn", "spam_score": 0.0, "site_type": "news", "published": "2017-03-16T12:00:00.000+02:00", "replies_count": 0, "uuid": "15aa46cd021c6d6a2c55bb1d5dab78db50310c3c"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/north-east-conservative-who-led-12748518", "ord_in_thread": 0, "title": "North East Conservative who led opposition to National Insurance increases welcomes u-turn", "locations": [], "entities": {"persons": [{"name": "ronnie rosenthal", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "mike cherry", "sentiment": "none"}, {"name": "philip hammond", "sentiment": "none"}, {"name": "adam marshall", "sentiment": "none"}, {"name": "anne-marie trevelyan", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "rory stewart", "sentiment": "none"}, {"name": "john mcdonnell", "sentiment": "none"}, {"name": "stephen herring", "sentiment": "none"}, {"name": "tom blenkinsop", "sentiment": "none"}], "locations": [], "organizations": [{"name": "national insurance", "sentiment": "negative"}, {"name": "north east conservative", "sentiment": "negative"}, {"name": "institute of directors", "sentiment": "none"}, {"name": "federation of small businesses", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "british chambers of commerce", "sentiment": "none"}, {"name": "middlesbrough south", "sentiment": "none"}, {"name": "bbc2’s daily politics", "sentiment": "none"}, {"name": "nics", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}, {"name": "liverpool", "sentiment": "none"}, {"name": "east cleveland", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "budget", "sentiment": "none"}, {"name": "getty images europe)  labour", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "  Thank you for subscribing!   \nThe North East Conservative MP who led opposition to the Government’s planned increase to National Insurance has welcomed a spectacular u-turn. \nChancellor Philip Hammond revealed he was axing plans to increase National Insurance (NI) contributions for the self-employed, less than a week after announcing them in his Spring Budget statement. \nIt came after he was widely criticised by his own MPs for breaking a general election manifesto promise not to increase NI, and for putting up taxes on so-called “white man van” entrepreneurs. \nBerwick-upon-Tweed MP Anne-Marie Trevelyan, one of the most vocal Conservatives opposing the tax hike, welcomed the re-think as she told the House of Commons: “I would like to thank the Chancellor for listening to the voices of colleagues and decided to reverse the proposals.” \nShe urged the Chancellor to introduce a new and simpler system of taxation for the self-employed, “that will support risk takers and wealth creators”. \nThe re-think was announced in a letter to Conservative MPs 20 minutes before the weekly session of questions to the Prime Minister in the House of Commons. \nIt caught some colleagues by surprise. International development minister Rory Stewart was on BBC2’s Daily Politics show defending the policy - as news of the impending U-turn began to filter through. Labour Leader Jeremy Corbyn (Photo: Getty Images Europe) \nLabour leader Jeremy Corbyn said the climbdown on a measure intended to raise £2 billion over the coming years, had left “a black hole in the Budget” and said Prime Minister Theresa May should apologise to the country, telling the House of Commons: “It seems to me like a Government in a bit of chaos.” \nBut Mr Corbyn came under fire himself, after what some Labour MPs considered to be a poor performance in the House of Commons. Read More Philip Hammond heckled in Commons over National Insurance U-turn \nHe went on to highlight the issue of people “who are forced into bogus self-employment by unscrupulous companies”, and then to ask about school funding. \nMiddlesbrough South and East Cleveland MP Tom Blenkinsop tweeted a video of Liverpool footballer Ronnie Rosenthal famously failing to score when presented with an open goal in a 1982 game, with the comment: “Can’t imagine why I recalled this Ronnie Rosenthal miss.” Shadow Chancellor John McDonnell (Photo: PA) \nBut a Shadow Chancellor John McDonnell said Labour had forced the Government to make a u-turn. He said: “This is a humiliating reversal for the Chancellor forced upon him by Labour’s opposition. His authority is now shredded after just one Budget, and he tore up a manifesto commitment to do it.” \nThe Budget fiasco comes as the Government prepares to trigger Article 50 and begin Brexit negotiations before the end of the month. \nBusiness groups which had opposed the NI increase welcomed U-turn. Read More Tory rebel hopes to force Commons vote on National Insurance increase \nMike Cherry, Federation of Small Businesses chairman, said: “We are delighted for our members and all the nation’s self-employed that the Chancellor has recognised the strong opposition to this measure, admitting it was against the spirit of the Tory manifesto on which his party stood, and has now decided to scrap it for the duration of this parliament.” \nStephen Herring, head of taxation at the Institute of Directors, said: “The whole National Insurance saga can only be described as chaotic.” \nAdam Marshall, director general of the British Chambers of Commerce, said: “The NICs rise, together with the cut to dividend tax-free allowances, was not viewed favourably by entrepreneurs - so this move and pause for thought are welcome. \n“It would be far better to look at business and employment taxation in the round, to ensure that our tax system is competitive and equitable.” Like us on Facebook", "external_links": [], "published": "2017-03-16T12:00:00.000+02:00", "crawled": "2017-03-16T07:34:20.245+02:00", "highlightTitle": ""}