{"organizations": [], "uuid": "755d2cff678a80f950374b331a33293369526716", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article9876519.ece/ALTERNATES/s1200/JS69914501.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-job-market-suffering-12735966", "country": "GB", "domain_rank": 21960, "title": "North East job market suffering fall in confidence as Brexit approaches", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "North East job market suffering fall in confidence as Brexit approaches", "spam_score": 0.0, "site_type": "news", "published": "2017-03-14T07:01:00.000+02:00", "replies_count": 0, "uuid": "755d2cff678a80f950374b331a33293369526716"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-job-market-suffering-12735966", "ord_in_thread": 0, "title": "North East job market suffering fall in confidence as Brexit approaches", "locations": [], "entities": {"persons": [{"name": "amanda white", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "brexit", "sentiment": "negative"}, {"name": "manpower", "sentiment": "negative"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "North East job market suffering fall in confidence as Brexit approaches Study by Manpower is based on survey of more than 2,000 companies around the UK Share A Jobcentre Plus (Photo: Philip Toscano/PA Wire)   \nThe jobs market is being hit by Brexit , with hiring confidence falling in the North East, according to a new study. \nThe study by employment group Manpower on whether firms are looking to take on new workers found confidence in the North East had fallen by 1%, matching the national average. \nLarger falls were seen in London and Scotland, however, with the capital said to be the least optimistic region in England for the first time in three years. Amanda White, operations manager at Manpower (Photo: Publicity Pic) \nManpower said that small companies are being hit by a raft of measures including pension changes, the living wage and business costs. \nThe group also reported continued concerns about a shortage of skilled workers, which it warned could hit flagship construction projects. \nAmanda White, head of specialist markets for Manpower, said: “Employment in the region has held fairly steady as we approach the triggering of Article 50. The region’s employers have recorded a slight fall in optimism, but we have seen much bigger falls elsewhere in the country. Interested in North East jobs? Find job vacancy listings across a range of sectors here . \n“Despite the slight fall in optimism, the region has some real bright spots so job-seekers should be optimistic. Investment in infrastructure and new building projects in Newcastle and elsewhere in the region is fueling job creation in the construction sector, but skills shortages remain a huge problem. \n“Bricklayers are in such high demand that they can earn more than £50K a year in the Tyne and Wear. Employers are reacting to the twin challenges of a skills shortage and an ageing workforce by providing more funding for apprenticeships. \n“We’re seeing lots of new opportunities in the region’s call centres and employers are continuing to compete to find candidates for more technical roles. Jobseekers are increasingly reluctant to commute long distances, so employers are having to dig deep into local talent pools to find the people they need. Some employers are becoming more open to taking on staff with less relevant experience and offering on-the-job training.” Read More \nNationally, private sector hiring has dropped to its weakest level since the start of 2014. \nEmployers in six of the nine sectors of the economy surveyed reported a falling outlook. \nThe overall net employment outlook, which includes both public and private sector employers, has dropped two points to +5%. Like us on Facebook", "external_links": [], "published": "2017-03-14T07:01:00.000+02:00", "crawled": "2017-03-14T02:38:01.895+02:00", "highlightTitle": ""}