{"organizations": [], "uuid": "766cdb979813d2702fdf57e4be6c34aac11fbf3d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30235652/15930097.jpg", "site_section": "", "section_title": "", "url": "http://www.devonlive.com/a-brexit-day-letter-from-ben-bradshaw/story-30235652-detail/story.html", "country": "US", "title": "A Brexit Day letter from Ben Bradshaw | Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "A Brexit Day letter from Ben Bradshaw | Devon Live", "spam_score": 0.197, "site_type": "news", "published": "2017-03-29T19:35:00.000+03:00", "replies_count": 0, "uuid": "766cdb979813d2702fdf57e4be6c34aac11fbf3d"}, "author": "Devon Live", "url": "http://www.devonlive.com/a-brexit-day-letter-from-ben-bradshaw/story-30235652-detail/story.html", "ord_in_thread": 0, "title": "A Brexit Day letter from Ben Bradshaw | Devon Live", "locations": [], "entities": {"persons": [{"name": "arti", "sentiment": "none"}, {"name": "ben bradshaw", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}, {"name": "david davis", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "angela merkel", "sentiment": "none"}], "locations": [{"name": "european union", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "european union", "sentiment": "none"}, {"name": "european court of justice", "sentiment": "none"}, {"name": "customs union", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "A Brexit Day letter from Ben Bradshaw X \nCopy link to paste in your message / Comments (0) \nSo, Article 50 has been triggered and the Government now begins the task of trying to extract us from the European Union. \nInvoking Article 50 was the easy bit. Ministers now face the most difficult and complicated negotiations ever undertaken by a country in modern peacetime. And it's us against 27. \nIn her letter to the rest of the EU, Mrs May adopted a more emollient tone than that struck recently by some of her Brextremist colleagues and their cheerleaders in the anti-European press. This includes a recognition that we face liabilities, which we will have to honour before leaving, an acknowledgement that the jurisdiction of the European Court of Justice may have to continue in some form, as least for a transitional period, if trade is not going to be severely affected and the ditching of the threat to remove rights from EU nationals arriving here from now on. \nFor their part, the other EU Governments in their reply are likely to insist that the issue of UK liabilities, the rights of EU nationals living here and British nationals living on the Continent and that of borders – particularly the border between Northern Ireland and the rest of Ireland are settled, before talks on our future relationship, including trade, begin. \nRead next: Council to charge for theatre car park in bid to fund venue \nThis is also a period of danger. Up until now, Brexit has been a British domestic issue and Mrs May has dominated. But now she loses control of the process and the agenda. If she compromises, which she will have to do, in the national interest, she will face accusations of \"betrayal\" from her hard right MPs and the Brextremist press. These modern wreckers have been quite open about their enthusiasm for walking away without a deal, which would be disastrous for jobs, living standards and security for years to come. \nAs the implications of such a dirty, chaotic Brexit or even the hard Brexit being pursued by Mrs May – outside the Single Market and Customs Union – begin to dawn, reality will bite. Businesses and sectors that face losing most from tariffs and non-tariff barriers and have so far remained quiet in the hope that the Government will negotiate them a special deal. But they will break their silence once they realise no special sectoral deals are on offer. As the German Chancellor, Angela Merkel, has made clear to her own car makers and other manufacturers, maintaining the unity of the EU is more important to her and the other 26 than carving out and special deals for particular sectors. \nThose of us who oppose a destructive hard Brexit will be working flat out to hold the Government to account. Brexit Secretary David Davis promised in January we will enjoy the \"exact same benefits\" when we leave the European Union as we do now. I'll be holding him to that. \nThere is a lot of water to flow under the Brexit bridge in the next 18 months and circumstances, including UK public opinion, could look very different then than they do now. ", "external_links": [], "published": "2017-03-29T19:35:00.000+03:00", "crawled": "2017-03-29T13:44:22.019+03:00", "highlightTitle": ""}