{"organizations": [], "uuid": "d7779c6892cc4758938d1289c93220d20622ef9f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30189334/15895952.jpg", "site_section": "", "section_title": "", "url": "http://www.devonlive.com/exmoor-s-natural-capital-will-be-explored-at-spring-conference/story-30189334-detail/story.html", "country": "US", "title": "Exmoor's Natural Capital will be explored at spring conference | Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "Exmoor's Natural Capital will be explored at spring conference | Devon Live", "spam_score": 0.617, "site_type": "news", "published": "2017-03-08T21:01:00.000+02:00", "replies_count": 0, "uuid": "d7779c6892cc4758938d1289c93220d20622ef9f"}, "author": "Mid Devon Gazette", "url": "http://www.devonlive.com/exmoor-s-natural-capital-will-be-explored-at-spring-conference/story-30189334-detail/story.html", "ord_in_thread": 0, "title": "Exmoor's Natural Capital will be explored at spring conference | Devon Live", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Mid Devon Gazette | Posted: March 08, 2017 0 COMMENTS SHARES The Exmoor Spring Conference is on Friday, April 7 at Dulverton Town Hall Exmoor's Natural Capital will be explored at spring conference X \nCopy link to paste in your message / Comments (0) \nLEARN about the future Exmoor's Natural Capital at the Exmoor Society's Spring Conference next month. \nDefra has an objective to improve the quality of the natural environment and see a net gain in its value over the next 25 years. To achieve this, it has set up a Natural Capital Committee. \nThe 13 th spring conference will aim to answer questions including, What is natural capital? What are the building blocks required for its value to be increased? Can there be an enhanced role for the National Parks, rich in natural assets and recognised by their special designation, funding and administrative arrangements? \nThe English National Parks, mainly in the uplands, were created for their scenery, wild, wide-open spaces, abundance of wildlife and bio-diversity, rich farming heritage, a rural culture stretching back to pre-historic times and their suitability for outdoor recreation. \nToday they face many challenges, not least from Brexit and the passing of the Common Agricultural Policy. Various organisations are setting out their preferred replacement schemes. All these different proposals will impact upland farmers whose livelihood, mainly from extensive livestock production and land management, is now at greater risk. \nAnother key point that will be raised at the conference will be whether a new approach such as Natural Capital can be successful in bringing together natural assets, including natural beauty and the historic environment, and retain traditional farming practices and a deeply rural culture still found in geographical places such as Exmoor. \nThe Exmoor Society, in partnership with the Exmoor National Park Authority, has invited two leading figures from the Natural Capital Committee who will be keynote speakers at the conference. \nThey are Professor Dieter Helm (Chairman) and Professor Ian Bateman (Member). A workshop for delegates will be led by Professor Brett Day and colleagues from the Land, Environment, Economics and Policy Institute, Exeter University. \nDelegates will discuss Exmoor's natural assets, how they have changed, the pressures they face and a future agri-environmental scheme that emphasises public payment for public goods. \nOther speakers will include Rob Wilson-North, Conservation Manager, ENPA and Dr Helen Blackman, Outreach Archivist, Exmoor Society, with Dr Nigel Stone giving some reflections on his 17 years as Chief Executive of ENPA and thoughts about Exmoor's future. \nPlaces can be booked online at www.exmoorsociety.com or by contacting The Exmoor Society on 01398 323335. \nThe event takes place at 10am on Friday, April 7 at Dulverton Town Hall. Read More ", "external_links": [], "published": "2017-03-08T21:01:00.000+02:00", "crawled": "2017-03-08T17:43:07.810+02:00", "highlightTitle": ""}