{"organizations": [], "uuid": "4e31183362a9aef481e73d6a51c81ea63d452ff3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/30205230/15907652.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/company-car-man-there-s-still-a-lack-of-planning-for-brexit/story-30205230-detail/story.html", "country": "US", "domain_rank": 48128, "title": "'There's still a lack of planning for Brexit' - our company car man tackles the big issues | Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "'There's still a lack of planning for Brexit' - our company car man tackles the big issues | Leicester Mercury", "spam_score": 0.37, "site_type": "news", "published": "2017-03-15T18:41:00.000+02:00", "replies_count": 0, "uuid": "4e31183362a9aef481e73d6a51c81ea63d452ff3"}, "author": "", "url": "http://www.leicestermercury.co.uk/company-car-man-there-s-still-a-lack-of-planning-for-brexit/story-30205230-detail/story.html", "ord_in_thread": 0, "title": "'There's still a lack of planning for Brexit' - our company car man tackles the big issues | Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "lauren", "sentiment": "negative"}, {"name": "torr waterfield", "sentiment": "none"}, {"name": "sean dyche", "sentiment": "none"}, {"name": "peter morris.", "sentiment": "none"}, {"name": "philip hammond", "sentiment": "none"}, {"name": "craig shakespeare", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "eddie howe", "sentiment": "none"}], "locations": [{"name": "leicester audi", "sentiment": "none"}, {"name": "belgrave gate", "sentiment": "none"}, {"name": "leicester city", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "bradgate park", "sentiment": "none"}, {"name": "humberstone gate", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "space park", "sentiment": "none"}], "organizations": [{"name": "ni", "sentiment": "none"}, {"name": "bank holiday", "sentiment": "none"}, {"name": "bank holidays", "sentiment": "none"}, {"name": "charnwood borough council", "sentiment": "none"}, {"name": "premier league", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "'There's still a lack of planning for Brexit' - our company car man tackles the big issues By Lauren_Mills | Posted: March 15, 2017 0 COMMENTS SHARES Peter Morris., director at Torr Waterfield, Leicester 'There's still a lack of planning for Brexit' - our company car man tackles the... X \nCopy link to paste in your message / Comments (0) \nQ What car do you drive and please can you tell us the reasons why? \nA I drive an Audi A4 S Line 2.0 TDI Quattro. I drive about 18,000 miles a year, and my car is comfortable and reliable and I enjoy driving it. I guess the main reason I have this particular car is that my daughter did a really good sales job on behalf of Leicester Audi. \nQ Raising national insurance contributions for the self-employed and boosting support for young trainees were among the details laid out in the Budget. What did you think of the Chancellor's statement and the fact he did not make any reference to Brexit? \nA I was surprised at the increase in Class 4 NI contributions as the additional revenue being raised is insignificant compared to the amount of criticism Philip Hammond has received. There has been little publicity about the reduction in dividend allowance that will affect many of my clients who are owner managers of their own limited companies and will be paying more income tax on profit distributions that have already been subject to corporation tax. Additional support for trainee and apprenticeship schemes is welcome and should be encouraged. University opportunities for all is great, but for some, vocational training opportunities are far more valuable. Dealing appropriately with Brexit is the greatest challenge our country faces over the next few years, so it is surprising that no reference at all was made to Brexit in the Budget speech . There were only two possible outcomes to the Referendum vote and nearly nine months later, there remains a lack of planning and preparation for the outcome voted for by the majority. \nQ The city and county are to get a £26 million boost for projects, including £14 million to develop a Space Park. Do you think this goes far enough to boost growth here? \nA The £14 million is a good start to get the £75 million project under way, so yes it is good news for the area, and should lead to a number of new technical jobs. I just hope that there is also investment to ensure that the infrastructure surrounding the location is adequate. Presumably, visitors to the Space Park will be encouraged to also visit the city centre via Belgrave Gate and Humberstone Gate, areas of the city that are in desperate need of investment and improvement. \nQ The clash between dog walkers and deer conservationists fired up again after two deer calves were found dead in Bradgate Park. Do you think dog owners should be forced to keep their pets on leads in the park? \nA Yes, as a dog owner myself, I can't see a problem with that. The deer should be able to roam free in their natural environment without this potential danger. It is similar to worrying livestock in the countryside –owners should be quite happy to keep their dogs under control on leads. \nQ Charnwood Borough Council has decided to renumber sheltered housing flats because superstitious residents are reluctant to move into number 13. How do you feel about superstitions? Are you superstitious yourself ? \nA I suppose they are illogical and can be obsessive for some. When I played football and cricket I would follow certain routines in putting my kit on – usually with little or no benefit! I do always try to avoid walking under ladders and my wife had a 13 registered car which was involved in three accidents in a year (none of them were her fault, of course!), so we were happy to get rid of that. \nQ An MP has called for an extra bank holiday in 2017 to mark the Queen's Sapphire Jubilee. Do you think this is a good idea or do we already have too many Bank Holidays in England? \nA I am all for an extra Bank Holiday or two. I do think we should celebrate our national day with a Bank Holiday, as other countries do. Locally, we could replace May Day with a Ranieri Day holiday every May 2! \nQ Craig Shakespeare has been appointed as Leicester City manager until the end of the season. Do you think he's the best man for the job? Who would you like to see in the role? \nA I think his appointment is sensible and gives the club some short-term stability. The longer term appointment will depend on which division we are in. If we stay up, I would like to see us appoint an ambitious, relatively young, English manager with Premier League experience. Eddie Howe, Sean Dyche or even Craig Shakespeare himself would maybe fit the bill. ", "external_links": [], "published": "2017-03-15T18:41:00.000+02:00", "crawled": "2017-03-15T18:59:30.025+02:00", "highlightTitle": ""}