{"organizations": [], "uuid": "009f499aad6c556c06e0253aa665f138f490958d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30177225/15886834.jpg", "site_section": "", "section_title": "", "url": "http://www.devonlive.com/our-pictures-of-the-dasls-legal-awards-2017/story-30177225-detail/story.html", "country": "US", "title": "Our PICTURES of the DASLS Legal Awards 2017 | Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "Our PICTURES of the DASLS Legal Awards 2017 | Devon Live", "spam_score": 0.284, "site_type": "news", "published": "2017-03-03T19:24:00.000+02:00", "replies_count": 0, "uuid": "009f499aad6c556c06e0253aa665f138f490958d"}, "author": "", "url": "http://www.devonlive.com/our-pictures-of-the-dasls-legal-awards-2017/story-30177225-detail/story.html", "ord_in_thread": 0, "title": "Our PICTURES of the DASLS Legal Awards 2017 | Devon Live", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Our PICTURES of the DASLS Legal Awards 2017 By HannahFinch | Posted: March 03, 2017 0 COMMENTS SHARES Pyramid Photography The Solicitor of the Year Award was won by Grace Bradley, of The Family Law Company Our PICTURES of the DASLS Legal Awards 2017 X \nCopy link to paste in your message / Pictures: Pyramid Photography Comments (0) \nThe very best of the legal profession has been celebrated at the DASLS Legal Awards 2017. \nMore than 350 members of Devon and Somerset's thriving legal profession attended the black-tie glittering gala dinner at Sandy Park, Exeter on Thursday night. \nThe Military Wives Choir performed for guests and the evening was hosted by the BBC's legal expert and journalist Joshua Rozenberg. \nMark Roome, President of the Devon and Somerset Law Society, said that the legal profession had a vital role to play in the uncertain post-Brexit landscape.He said: \"Brexit will, I am sure, create an unprecedented and complex range of legal issues. It's inevitable, I would think, that the solicitor profession will be at the forefront of the transition into a post-EU era, and we need able and sensible legal professionals to offer the best legal advice possible, and provide a quality of service second-to-none. \n\"There are many who will rise to the challenges ahead and it's those firms and those individuals that the Legal Awards look to celebrate.\" \nHe said that the profession was blighted by a public apathy but lawyers throughout the region had much to be proud of. He said: \"Without public engagement or support, it is difficult to gain positive media attention and revitalise the issues in hand.As part of being proud, we should continue to publicise all the wonderful things we do and counter the general apathy that seems to prevail.\" \nThe Legal Awards are organised by the Devon and Somerset Law Society in partnership with DC Media and title sponsored by legal software development company Solicitors Own Software. It is an opportunity for the legal profession to recognise the contribution solicitors and law firms make to their local communities and the region's economy. \nRobert Bourns, the national President of The Law Society gave a passionate speech against 'political interference' and the challenges faced by the profession including court closures and the fixed recoverable cost review. \nTwelve awards in total were handed out to individuals and law firms that have gone the extra mile. \nJudge Erik Salomonsen, judging panel chairman said that the standard this year was very high as urged more firms 'to be in it to win it.' He said: \"We have received many powerful and thoughtful submissions. \n\"It has been a privilege for us to judge the entries.\" \nTim Hook from Toller Beattie LLP in Barnstaple was named Legal Hero of the Year.His 40 year career has mainly been spent representing clients at Barnstaple Magistrates' Court, often the most vulnerable in society. He is a passionate campaigner against legal aid cuts and the closure of local magistrates' courts. \nThe Lifetime Achievement Award was received by Michael Cosgrave of Wollen Michelmore. \nMr Cosgrave has a law career spanning 40 years and specialises in commercial property, developments and site acquisitions.He is a past president of the Devon and Exeter Law Society and of the Federation of European Bars. \nThe DASLS Challenge Cup was won by Michelmores. The winners: ", "external_links": [], "published": "2017-03-03T19:24:00.000+02:00", "crawled": "2017-03-03T17:59:52.400+02:00", "highlightTitle": ""}