{"organizations": [], "uuid": "3f16e3c8f63c3280d091752bdaaadee8d27aaecc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12432639.ece/ALTERNATES/s1200/Brexit.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/university-bosses-gather-discuss-impact-12704882", "country": "GB", "domain_rank": 21960, "title": "University bosses gather to discuss impact of Brexit on attracting international talent", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "University bosses gather to discuss impact of Brexit on attracting international talent", "spam_score": 0.0, "site_type": "news", "published": "2017-03-07T23:00:00.000+02:00", "replies_count": 0, "uuid": "3f16e3c8f63c3280d091752bdaaadee8d27aaecc"}, "author": "Hannah Graham", "url": "http://www.chroniclelive.co.uk/news/north-east-news/university-bosses-gather-discuss-impact-12704882", "ord_in_thread": 0, "title": "University bosses gather to discuss impact of Brexit on attracting international talent", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "News University bosses gather to discuss impact of Brexit on attracting international talent Speaking to the Education Select Committee, university officials spoke about the need for continued investment and to attract international students Share EU and Union flags (Photo: PA) Share   Thank you for subscribing!   \nThe North East could lose valuable talent if Britain doesn’t make itself more open to the rest of the world, while the UK Government must commit to supporting the region if it loses out on EU funds. \nThose are some of the messages from the region’s university leaders to Government as it attempts to manage the transition out of the European Union. \nA special meeting of the Education Select Committee held at Northumbria University on Tuesday sought the views of some of the region’s most influential figures in higher education about the impact of leaving the European Union on universities in the North of England and in Scotland. \nWhile a panel made up of the leaders of Newcastle , Northumbria and Sunderland universities,broadly agreed that the move could be managed without forcing the closure of particular courses or whole institutions, there were fears about the ability of the region’s universities to attract the best international talent, and about the impact on their budgets. Shirley Atkinson, Vice Chancellor at the University of Sunderland (Photo: Publicity Pic) \nShirley Atkinson, Vice Chancellor of Sunderland University, said: “There is a wider issue about the reputation of British universities in the world now as a result of the Brexit vote. \n“Unfortunately, it is being played back in some quarters as Britain not being open and prepared to share and not interested in having mobility in students or staff.” \nThe panel agreed that any potential loss of international students could have a dramatic impact on the North East in particular. \nPeter Simpson, director of the N8 partnership of the most research-intensive universities in the North, which includes Durham and Newcastle, said: “The broader impact on is not just on the universities but on the regional economies. Some parts of the UK have more resilient economic bases and are going to be affected less. The Northumbria University Campus at Manors, Newcastle (Photo: Newcastle Journal) \n“It is worth pointing out that international students contribute off-campus spend that supports thousands of jobs in the North, so it’s not just the impact on the universities it’s the knock-on impact both on research that drives economic growth but also on the local spend across a diverse range of businesses. \n“If the students aren’t there, they’re not spending the money, and the jobs aren’t there as a consequence.” \nHe suggested any potential loss of revenue could be felt less keenly by institutions in London and the South East which benefit from “a degree of financial security which is not present in the rest of UK higher education”. \nConcerns were raised that unless national rhetoric and policy around immigration underwent a change, it might not just be EU students who are lost after Brexit but international students more broadly — a group which Andrew Wathey, Vice Chancellor at Northumbria University, claimed bring cash in the region of half a billion pounds a year to the North East. Prof Andrew Wathey, vice chancellor of Northumbria University \nHe suggested Brexit could offer an opportunity to make UK universities more attractive to foreign students by removing “unnecessary barriers” to academic immigration, citing unnecessarily complicated bureaucracy and citizenship tests as something which can put staff and students off UK universities. \nProf Tony Stephenson, deputy vice chancellor of Newcastle University, added: “If you look at the immigration policy and the mood and perception in markets out there that are receiving all of that, they don’t see Britain as a welcoming place.” \nAlastair Sim, director of Universities Scotland, said: “It’s essentially that the UK gets the message out much more clearly that we’re open and welcoming and want talent from outside the UK.” Read More EU referendum: How will Brexit affect North East universities? \nWith parts of the North and Scotland set to lose significant amount of cash as EU regional development funding is removed, the committee was urged to ensure that the UK government supports infrastructure spending in the region. Mr Simpson said there would be much more chance of attracting and keeping students from places like China in the North East, if there were better transport links from major airports like Manchester. \nThroughout the meeting, one of the speakers’ main pleas was for clarity on what a post-Brexit UK will look like. Newcastle University \nThey asked for reassurances on the immigration and fees status of EU students and staff, as well as of the Erasmus study exchange programme. \nProfessor Stephenson insisted the Government needed to stop using EU citizens living in the UK, including academic workers, as a “bargaining chip” for the status of UK citizens living in the EU, urging Theresa May instead to offer reassurance about the immigration status of EU academics and their families in the UK. \nThe panel also urged the Government to do what it could to keep the UK within the Horizon 2020 research funding scheme. While other UK-led options were discussed, it was widely agreed that staying within the billion-pound funding scheme would be beneficial, and that the Government should aim to maintain as much influence as possible within that scheme after Brexit. Like us on Facebook", "external_links": [], "published": "2017-03-07T23:00:00.000+02:00", "crawled": "2017-03-07T18:40:41.796+02:00", "highlightTitle": ""}