{"organizations": [], "uuid": "d113f5add85219e30c1df47970b33c2efe08bdaa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12642466.ece/ALTERNATES/s1200/Brexit.jpg", "site_section": "", "section_title": "", "url": "http://www.chroniclelive.co.uk/news/north-east-news/tourism-inflation-race-hate-crime-12689617", "country": "IE", "domain_rank": 21960, "title": "Tourism, inflation and race hate crime: The good, the bad and the ugly of Brexit - Chronicle Live", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 0, "title_full": "Tourism, inflation and race hate crime: The good, the bad and the ugly of Brexit - Chronicle Live", "spam_score": 0.359, "site_type": "news", "published": "2017-03-04T12:00:00.000+02:00", "replies_count": 0, "uuid": "d113f5add85219e30c1df47970b33c2efe08bdaa"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/tourism-inflation-race-hate-crime-12689617", "ord_in_thread": 0, "title": "Tourism, inflation and race hate crime: The good, the bad and the ugly of Brexit - Chronicle Live", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "European workers including nurses, social workers and teaching assistants protest outside the Houses of Parliament in London before lobbying MPs over their right to remain in the UK (Photo: PA) Share Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nIt seems like a lifetime has elapsed since the EU referendum. \nBut it took place just nine months ago, so how long before the first child called ‘Brex’ or ‘Brexina’ pops into the world? \nIn the meantime, here are examples of the good, the bad and the ugly that has resulted from that historic vote. THE GOOD Economic growth \nMany economists prior to the referendum had been predicting an immediate and significant impact on the UK economy and consumer confidence should the country vote to leave the EU . But so far these predictions have not come to pass. \nOfficial figures showed GDP rose by 0.7% in the final three months of 2016 – revised up from an original estimate of 0.6%. Tourism \nThe falling pound has been good for UK tourism. It makes it expensive to travel abroad, so more people are enjoying a ‘staycation’ while foreign tourists are coming to our shores as they got more currency for their cash. Stock market hit record levels Screen displaying the FTSE 100 at the London Stock Exchange (Photo: Yui Mok/PA Wire) \nThe FTSE 100 - it stands for Financial Times Stock Exchange - has hit the upward escalator with a vengeance reaching record levels since June 23. \nAfter a brief nose-dive to below 6,000 points just after the referendum, it now stands at over 7,300. \nThis is not just good news for people who own shares. Many pensions are based on the FTSE 100 companies so when the index goes up, pension pots increase. \nThat said, 70% of earnings on the FTSE 100 are dollar-related, so its success is not the strictest judge of the strength of the UK economy. THE BAD NHS cash promise dropped A 'Vote LEAVE' battle bus (Photo: 2016 Getty Images) \nProminent Leave campaigners said the UK paid £350m more a week into the EU than it got out of it. If we went for Brexit that cash would be spent on the NHS, they said. \nBoris Johnson was even pictured in front of the Leave bus proclaiming the eye catching promise. Yet, now Foreign Secretary, Johnson and many of his fellow Leave campaigners voted against an amendment to the Brexit bill which would have seen that promise be honoured. Inflation \nUK consumer prices rose in January at the fastest annual rate in two-and-a-half years, highlighting how the pound’s fall since June’s Brexit vote is increasingly weighing on the cost of everyday living. \nBritain’s Office for National Statistics (ONS) said recently that annual inflation in the UK had gone up to 1.8% in January from 1.6% in December, marking the fastest rate of growth in prices since mid-2014. \nThe ONS said a rise in fuel prices was the biggest contributor to the jump although it had been partly offset by aggressive discounting by high street clothes and shoe shops. The retail prices index, which includes the impact of mortgage costs, rose to 2.6% in January, up from 2.5% in December. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now ", "external_links": [], "published": "2017-03-04T12:00:00.000+02:00", "crawled": "2017-03-04T08:44:54.463+02:00", "highlightTitle": ""}