{"organizations": [], "uuid": "2735248aa3f0dac470716538cea588f75c1a700a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12784005.ece/ALTERNATES/s1200/JS115107864.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12777915", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Next profits fall for first time in eight years", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast LIVE: Next profits fall for first time in eight years", "spam_score": 0.0, "site_type": "news", "published": "2017-03-23T15:20:00.000+02:00", "replies_count": 0, "uuid": "2735248aa3f0dac470716538cea588f75c1a700a"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12777915", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Next profits fall for first time in eight years", "locations": [], "entities": {"persons": [{"name": "jonathon manning next", "sentiment": "negative"}, {"name": "wolfson", "sentiment": "none"}, {"name": "aspley guise", "sentiment": "none"}], "locations": [{"name": "silverlink point shopping park", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning Next's drop in sales down to missing \"best-selling\" ranges \nNext saw overall sales fall 0.3% over the year, dragged lower by a 4.6% slump in full-price shop sales. Total retail sales dropped 2.9% to £2.3bn. \nThe firm said it was “extremely cautious about the outlook for the year ahead”, with sales in its first quarter likely to be around the “bottom end” of forecasts for a drop of up to 3.5%. \nThe group reiterated warnings made in January that full-year profits could fall by as much as 14% as it is braced for the impact of its price rises and an ongoing shift in spending away from clothing as well as pressure on wages from Brexit-fuelled inflation. \nLord Wolfson admitted last year’s sales woes were partly down to its product range, with its lines missing the wardrobe staples Next is renowned for, such as easy-to-wear work blouses in a number of colours. \nHe said: \nIn focusing so much energy on changing our buying culture, processes and adopting exciting new trends, we have omitted some of our best-selling, heartland product from our ranges. \nThe group said it took action in late January to start overhauling its ranges to include more of these items, but the full impact of changes will not be seen until September. \nIt is also revamping its Next Directory offering, including rolling out a Next Unlimited offer allowing UK customers to pay £20 for a year’s unlimited next-day delivery. \nLord Wolfson said sales will remain under pressure but show some improvements in the second quarter before starting to see a “sea-change” in the final six months. But he added: \nIt’s going to be a really tough year. The Next store at Silverlink Point Shopping Park 8:28 KEY EVENT Next sees profits fall for first time in eight years \nHigh street giant Next has revealed its first fall in annual profits for eight years as it was hit by sliding sales and warned that 2017 is set to be “another tough year”. \nThe retailer posted a 3.8% fall in underlying pre-tax profits to £790.2m for the year to January - the first fall in profits since 2008/09 at the height of the financial crisis. \nNext confirmed it had hiked prices by 4% on average for the first half of the year and warned prices would remain under pressure in the second half from rising buying costs caused by the Brexit-hit pound. \nChief executive Lord Wolfson said: \nThe year ahead looks set to be another tough year for Next. \nWe remain clear on our priorities going forward. We will continue to focus on improving the company’s product, marketing, services, stores and cost control. Lord Wolfson of Aspley Guise, Chief Executive of Next Share", "external_links": [], "published": "2017-03-23T15:20:00.000+02:00", "crawled": "2017-03-23T10:36:11.826+02:00", "highlightTitle": ""}