{"organizations": [], "uuid": "6237642a1e3b8ed9b727593a534a2a11a61a006f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30197660/15901781.jpg", "site_section": "", "section_title": "", "url": "http://www.devonlive.com/excitement-as-south-devon-s-humpback-whale-spotted-off-brixham/story-30197660-detail/story.html", "country": "US", "title": "South Devon's humpback whale sighted off Brixham's Berry Head | Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "South Devon's humpback whale sighted off Brixham's Berry Head | Devon Live", "spam_score": 0.192, "site_type": "news", "published": "2017-03-12T18:31:00.000+02:00", "replies_count": 0, "uuid": "6237642a1e3b8ed9b727593a534a2a11a61a006f"}, "author": "", "url": "http://www.devonlive.com/excitement-as-south-devon-s-humpback-whale-spotted-off-brixham/story-30197660-detail/story.html", "ord_in_thread": 0, "title": "South Devon's humpback whale sighted off Brixham's Berry Head | Devon Live", "locations": [], "entities": {"persons": [{"name": "brixham", "sentiment": "none"}, {"name": "bovey tracey", "sentiment": "none"}, {"name": "laura ward", "sentiment": "none"}, {"name": "berry", "sentiment": "none"}, {"name": "robert jones", "sentiment": "none"}, {"name": "ward", "sentiment": "none"}, {"name": "alex foley", "sentiment": "none"}, {"name": "aiden platt", "sentiment": "none"}, {"name": "lucy", "sentiment": "none"}, {"name": "torcross", "sentiment": "none"}, {"name": "darren shaun charles breen", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "alex", "sentiment": "none"}], "locations": [{"name": "brixham", "sentiment": "none"}, {"name": "south devon", "sentiment": "none"}, {"name": "ashburton", "sentiment": "none"}, {"name": "hartland quay", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "berry head", "sentiment": "none"}, {"name": "torcross", "sentiment": "none"}, {"name": "slapton", "sentiment": "none"}, {"name": "north devon", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "totnes civic hall", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "paignton", "sentiment": "none"}, {"name": "south devon coast", "sentiment": "none"}, {"name": "barnstaple", "sentiment": "none"}, {"name": "start bay", "sentiment": "none"}], "organizations": [{"name": "berry head", "sentiment": "none"}, {"name": "north devon journal", "sentiment": "none"}, {"name": "devon county council", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "torbay clinical commissioning group", "sentiment": "none"}, {"name": "nfa", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "guardhouse cafe", "sentiment": "none"}, {"name": "dartmouth", "sentiment": "none"}, {"name": "medway magistrates court", "sentiment": "none"}, {"name": "save our hospital services", "sentiment": "none"}, {"name": "ccg", "sentiment": "none"}, {"name": "cornwall police", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Comments (0) \nWalkers enjoying Brixham's nature reserve at Berry Head got a big surprise on Sunday morning when they spotted a humpback whale offshore. The whale which has been ranging up and down the shore off Slapton and Torcross for the past three weeks to the delight of nature lovers had obviously gone off for a bit of a stroll further along the South Devon coast. \nAlex Foley who runs the Guardhouse Cafe at Berry Head national nature reserve said the whale had been spotted next to a fishing boat at about 9.30am. Whale spotted from Berry Head this morning!! pic.twitter.com/pdacjsSVby — The Guardhouse Cafe (@Guardhousecafe) March 12, 2017 \nAlex said the photograph had been taken by a customer who was happy for it to be used on the cafe's social media. \"I haven't seen it myself but some customers saw it come out of the water and going back in again with a massive splash. They got a picture of it as it submerged,\" he said. \n\"It was apparently there for about half an hour. Some people seem to be coming up here to look for it. Lucy and I have been here three years and it's the first time that we have heard of a whale.\" The first sighting was reported at 8.30am. @Guardhousecafe whale off Berry head now, tail flukes and blow observed by @birdygirl46 \nThe whale has been creating much excitement down at Slapton and Torcross where it has been regularly sighted in recent days. On Thursday two fishermen had the experience of a lifetime when the whale emerged near their boat \nRobert Jones captured this video of the whale. He said: \"My friend and I got a shock whilst out fishing on the Skerries banks in Start Bay when a Humpback whale swam past!\" \nSadly, at the same time, the body of what is believed to be a baleen whale has washed up in North Devon near Hartland Quay. It was first spotted on Thursday. \nMORE VIDEO: A drone captured the sad sight of the beached whale slumped across rocks in the stunning North Devon rocks. \nPolice have warned sightseers to stay away from the decaying remains after someone is believed to have tried to extract its teeth. \nDevon and Cornwall Police have asked members of the public not to go near the whale as decomposing whales can be dangerous to health. The whale is on rocks in an area can be dangerous to the public. \nWhales are protected under the Conservation of Habitats and Species Regulations 2010. It is an offence to be in possession of any part of the whale whether alive or dead. Devon and Cornwall Police have said they will actively be looking to prosecute any persons attempting to remove any parts of the whale. \nREAD MORE: \nMotion made to protect Devon's nature after Brexit \nA motion calling to protect Devon's nature from the risks of leaving the European Union has been endorsed by Devon County Council's cabinet. It has been recommended to full council next month that councillors support a coalition of green charities and a government environmental committee, asking the government to apply at least the same level of protection in UK law as exists under EU law. \nDevon bikers 'ride-out' to protest the sentence for killer of of Aiden Platt: VIDEO \nHundreds of bikers took part in a 'ride-out' in Barnstaple yesterday to protest against the sentence of a drug-driver who crashed into and killed Barnstaple biker Aiden Platt. In January the North Devon Journal revealed that driver Laura Ward was spared jail because she became pregnant and has had a baby during the 18 months since the crash in Barnstaple in August, 2015. Ward was under the influence of cannabis and diazepam and had traces of amphetamine in her system when her car sideswiped 20-year-old Aiden Platt. \nAround the courts: who has been before the magistrates in South Devon. \nDarren Shaun Charles BREEN, NFA. Age: 24. On 12/02/2017 at Exeter without lawful excuse, damaged silver VW Golf to the value of £100 belonging to a male, intending to destroy or damage such property or being reckless as to whether such property would be destroyed or damaged. Plea: Guilty. Commission of a further offence during the operational period of a suspended sentence order made by Medway Magistrates Court on 13/10/2016 for an offence of burglary. \nFight continues to save hospital services in Devon \nThe fight to save hospital services in Devon continues with plans announced for a \"real\" consultation. Campaigners opposing plans to close community hospitals in South Devon have organised a public consultation outside Totnes Civic Hall next Tuesday, March 14, at 6.30pm. The Save Our Hospital Services South Devon –The 'Real' Review is being held in an attempt to get South Devon and Torbay Clinical Commissioning Group (CCG) to reconsider plans to close Paignton, Dartmouth, Bovey Tracey and Ashburton and Buckfastleigh community hospitals. ", "external_links": [], "published": "2017-03-12T18:31:00.000+02:00", "crawled": "2017-03-12T14:32:24.167+02:00", "highlightTitle": ""}