{"organizations": [], "uuid": "4c43c435b9be8a882514c47af8e97a4d8071b7fd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12753913.ece/ALTERNATES/s1200/Prime-Ministers-Questions.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/theresa-launches-fight-save-united-12753911", "country": "GB", "domain_rank": 21960, "title": "Theresa May launches fight to save the United Kingdom in face of Scottish independence threat", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Theresa May launches fight to save the United Kingdom in face of Scottish independence threat", "spam_score": 0.0, "site_type": "news", "published": "2017-03-17T05:30:00.000+02:00", "replies_count": 0, "uuid": "4c43c435b9be8a882514c47af8e97a4d8071b7fd"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/theresa-launches-fight-save-united-12753911", "ord_in_thread": 0, "title": "Theresa May launches fight to save the United Kingdom in face of Scottish independence threat", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "mrs may", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "tim farron", "sentiment": "none"}, {"name": "nicola sturgeon", "sentiment": "none"}], "locations": [{"name": "united kingdom", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "wales", "sentiment": "none"}, {"name": "cardiff", "sentiment": "none"}], "organizations": [{"name": "unionist party", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "union", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Theresa May launches fight to save the United Kingdom in face of Scottish independence threat The Prime Minister will launch her 'Plan for Britain' with a passionate defence of the United Kingdom Share Prime Minister Theresa May speaks during Prime Minister's Questions (Photo: PA) Share   Thank you for subscribing!   \nPrime Minister Theresa May will vow to fight to keep the United Kingdom together as Brexit takes place, when she launches her “Plan for Britain” \nSpeaking in Cardiff during the first of a series of visits across the country, Mrs May will say that “all of our efforts and energies as a country” must be focused on getting the right deal from the EU . \nAnd she will say: “We need to do so united, as one United Kingdom, all pulling together to get the best outcome.” \nMrs May is now free to trigger Article 50, which begins the process of leaving the European Union, after the Government’s Brexit Act was approved by Parliament and received Royal Assent from the Queen. \nTalks about the terms of the UK’s exit, including a new trade deal and whether or not the UK will have to pay billions of pounds to the EU, are likely to take two years. \nBut Mrs May also has to deal with demands from Nicola Sturgeon, the First Minister of Scotland, for a second referendum on Scottish independence. Scots chose to stay in the UK in a previous poll in 2014. \nThe Prime Minister has said there can be no immediate referendum, and appears to be ruling out an independence vote until after Brexit takes place. \nSpeaking in Cardiff, she will stress that her Government is committed to delivering for every part of the country - and to preserve the union between England, Scotland, Wales and Northern Ireland. Read More \nMrs May will say the UK Government’s talks with the EU will be “vital for everyone in the United Kingdom”. \nAnd she will insist: “We are four nations, but at heart we are one people. \n“And I will always ensure the voices and interests of England, Scotland, Wales and Northern Ireland are represented as we negotiate to leave the EU. \n“And I will always fight to strengthen and sustain this precious, precious Union.” \nThe Prime Minister will use her address to highlight the Conservative Party’s traditional support for the union, which is reflected in its full title of Conservative and Unionist Party. \nShe will say: “That union is more than just a constitutional artefact. \n“It is a union between all of our citizens, whoever we are and wherever we’re from. \n“So our Plan for Britain will put strengthening and sustaining that Union at its heart. \n“It means taking the big decisions when they’re the right ones for Britain in the long-term. Read More Liberal Democrat leader Tim Farron: Only we can defeat the Conservatives \n“Putting the national interest above any other consideration. \n“And it means ensuring that we act in the interests of the whole country – creating jobs and supporting cities, towns and communities right across our United Kingdom. \nMrs May will also argue that the Brexit vote showed there is demand for changes to the way the UK is governed, and highlight say the Government is committed to introducing “economic and social reforms we need to make Britain work for working people.”. \nShe will say: “That means building a stronger economy and investing in the things that will deliver for Britain in the long-term, tackling the problem of low productivity and helping to secure the high-paid, high-skilled jobs of the future. \n“It means creating a fairer society, as we break down the barriers of privilege and spread opportunity and prosperity around the country.” Like us on Facebook", "external_links": [], "published": "2017-03-17T05:30:00.000+02:00", "crawled": "2017-03-17T01:22:39.295+02:00", "highlightTitle": ""}