{"organizations": [], "uuid": "28a6f49216d9741551e9c1ded95487cf436238c4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12214864.ece/ALTERNATES/s1200/Chancellor-of-the-Exchequers-Autumn-Statement.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/business-leaders-call-chancellor-unleash-12689242", "country": "GB", "domain_rank": 21960, "title": "Business leaders call on Chancellor to unleash the North East's potential", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business leaders call on Chancellor to unleash the North East's potential", "spam_score": 0.0, "site_type": "news", "published": "2017-03-06T07:01:00.000+02:00", "replies_count": 0, "uuid": "28a6f49216d9741551e9c1ded95487cf436238c4"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/business-leaders-call-chancellor-unleash-12689242", "ord_in_thread": 0, "title": "Business leaders call on Chancellor to unleash the North East's potential", "locations": [], "entities": {"persons": [{"name": "philip hammond", "sentiment": "none"}, {"name": "walker", "sentiment": "none"}, {"name": "jonathan walker", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "north east englan", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "north east england", "sentiment": "none"}], "organizations": [{"name": "business business", "sentiment": "negative"}, {"name": "chamber of commerce", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "north east england chamber of commerce", "sentiment": "none"}, {"name": "budget", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Business leaders call on Chancellor to unleash the North East's potential North East England Chamber of Commerce has set out the policy announcements and changes its members want to see Share Chancellor of the Exchequer Philip Hammond (Photo: Stefan Rousseau/PA Wire) Share Get business   Thank you for subscribing!   \nThe region’s largest business membership organisation has laid down its wishlist ahead of this week’s Budget, calling on the Chancellor to unleash the North East’s economic potential. \nThe North East England Chamber of Commerce has set out the policy announcements and changes its members want to see delivered in the Budget in a letter to Chancellor Philip Hammond, highlighting recent economic successes within the region. \nIn the letter, Chamber head of policy and campaigns Jonathan Walker says: “North East England is a highly successful yet undr-utilised part of the UK economy. Since 2009 our region has seen the highest levels of growth in labour productivity of anywhere in the country. \n“We continue to be a strong exporting region built on globally recognised expertise. In many cases, North East England is an exemplar of how national economic aspirations can be achieved. Jonathan Walker, of the North East England Chamber of Commerce \n“Credit for our economic performance must go to the businesses who continually strive to improve and grow. Just think what our region could achieve if the North East was given the right tools and support.” \nThe Chamber letter also sets out the need to minimise the harm and maximise opportunities created as a result of Brexit. \nOn the ground support tailored to regional needs and an increase in the number and scale of overseas trade missions is also a must, the letter says. \nMr Walker said: “The Government must commit significantly more resources to both supporting exporters to break into new markets and encouraging non-exporters to take their first steps into international trade.” \nNorth East business also want to see improvement in other areas including rapid delivery of road improvement schemes and major investment in the region’s rail infrastructure, coherent and fair reform of business rates and clarity on the operation of the Apprenticeship Levy. \nMr Walker also expresses the region’s dismay over the Government delaying action to support regional airports and calls upon the Chancellor to take action over Air Passenger Duty “as a matter of urgency”, saying any further delays harms the competitveness of regionals airports in the North and will ultimately call into question the viability of routes at time when the UK needs greater connectivity. \nMr Walker said the growing problem of skills shortages was also a priority. \nHe added: “We have to get Government skills funding that is truly responsive to local business needs. In return, we will support far stronger collaboration between employers and funding providers, to ensure money is spent in a way that provides the right skills for the local labour market.” Like us on Facebook", "external_links": [], "published": "2017-03-06T07:01:00.000+02:00", "crawled": "2017-03-06T02:40:05.023+02:00", "highlightTitle": ""}