{"organizations": [], "uuid": "9a85c1a84567bf8bb26c8b2eeaeacc936774c3ce", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12815088.ece/ALTERNATES/s1200/General-Election-2015-campaign-April-21st.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/brexit-should-mean-re-open-12815012", "country": "GB", "domain_rank": 21960, "title": "Brexit should mean we re-open our coal mines says ex miners' leader Arthur Scargill", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Brexit should mean we re-open our coal mines says ex miners' leader Arthur Scargill", "spam_score": 0.0, "site_type": "news", "published": "2017-03-29T21:25:00.000+03:00", "replies_count": 0, "uuid": "9a85c1a84567bf8bb26c8b2eeaeacc936774c3ce"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/brexit-should-mean-re-open-12815012", "ord_in_thread": 0, "title": "Brexit should mean we re-open our coal mines says ex miners' leader Arthur Scargill", "locations": [], "entities": {"persons": [{"name": "arthur scargill", "sentiment": "negative"}, {"name": "margaret thatcher", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "scargill", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "lisbon", "sentiment": "none"}, {"name": "orgreave", "sentiment": "none"}, {"name": "sheffield", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "rotherham", "sentiment": "none"}, {"name": "cardiff", "sentiment": "none"}], "organizations": [{"name": "tories", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "socialist labour party", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "num", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily   Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe right wing Tories who want a ‘hard’ Brexit have got an unlikely supporter - former miners’ leader Arthur Scargill. \nHe even claimed the year-long pit strike might have ended differently if the UK hadn’t been in the European Union . \nMr Scargill, the ex-President of the NUM who led the 1984-85 strike against Margaret Thatcher’s government sees leaving the EU as an opportunity to re-open the mines and the cotton mills. \nSpeaking at an event for his Socialist Labour Party , he said the UK should leave the EU without a prolonged negotiation – and set about rebuilding British manufacturing. \nHe said: “Leaving means the EU would no longer be able to block subsidies to industries.” \nMr Scargill said that before joining the EU up to 80% of Britain’s economy was based in manufacturing. \n“We need to re-open the cotton mills, re-open the steel plants and invest in new mining facilities with carbon capture – creating jobs and protecting the environment,” he told the event in Cardiff. Striking miners pour into Sheffield hours before the NUM executive, led by Arthur Scargill, arrived for their crucial talks on the despite over pit closure. 10th April 1984 (Photo: Manchester Evening News Archive) \nMr Scargill explained how he thought the miners strike might have ended differently if the UK had not been in the EU at the time. \nHe said: “We were not allowed to subsidise pits under EU rules unless we were closing them – that’s the kind of policies that were being dictated to us by the European Union.” Read More More pay, higher car tax, more free child care - how laws coming in in 2017 could affect you \nBut Mr Scargill said the benefits of Brexit are being put at risk by triggering the two year negotiations with the EU. \n“There are enormous risks to Theresa May’s strategy, you hand to the EU the power to determine the terms on which we leave,” he said. \n“We should just invoke the first clause of Article 50 – and that means we could leave the EU tomorrow, no problem at all. \n“No negotiations, just send them a letter saying good bye and we can get on with it.” Arthur Scargill assisted by riot police after he was injured outside the Orgreave coking plant near Rotherham, during violent clashes between police and picketers in 1984 \nMr Scargill also warned that Brexit should be seen as a chance to end the inflow of economic migrants, who he claims are responsible for large parts of Britain’s economic woes. \n“I’m totally opposed to the free movement of labour, all that does is add to the social, political and economic problems we are facing in Britain today,” he says. \n“Until we had the Lisbon treaty, we didn’t have the flow of people from the European Union that we have now. \n“It is since then that we’ve seen the population of the UK rise – it tells you that it is the flow of migrant labour, not immigrants or Asylum seekers, that is the problem. \n“But let me be clear, all the people living in this country at the moment should be guaranteed the right to stay.” Like us on Facebook", "external_links": [], "published": "2017-03-29T21:25:00.000+03:00", "crawled": "2017-03-29T16:35:38.619+03:00", "highlightTitle": ""}