{"organizations": [], "uuid": "b34aec3cd39a7e97998757b2763f5004c9b70a73", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30224157/15922023.jpg", "site_section": "http://www.westernmorningnews.co.uk/farming.rss", "section_title": "Devon Live Farming RSS feed", "url": "http://www.devonlive.com/south-west-young-farmers-q-a-five-minutes-with-tom-lock/story-30224157-detail/story.html", "country": "GB", "title": "South West Young Farmers Q&A: Five minutes with Tom Lock", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "South West Young Farmers Q&A: Five minutes with Tom Lock", "spam_score": 0.0, "site_type": "news", "published": "2017-03-23T22:26:00.000+02:00", "replies_count": 0, "uuid": "b34aec3cd39a7e97998757b2763f5004c9b70a73"}, "author": "AthwennaIrons", "url": "http://www.devonlive.com/south-west-young-farmers-q-a-five-minutes-with-tom-lock/story-30224157-detail/story.html", "ord_in_thread": 0, "title": "South West Young Farmers Q&A: Five minutes with Tom Lock", "locations": [], "entities": {"persons": [{"name": "tom", "sentiment": "none"}, {"name": "ben cavill", "sentiment": "none"}, {"name": "tom lock", "sentiment": "none"}], "locations": [{"name": "somerset", "sentiment": "none"}, {"name": "royal bath & west showground", "sentiment": "none"}], "organizations": [{"name": "south west young farmers q&a", "sentiment": "none"}, {"name": "westcountry farmer magazine", "sentiment": "none"}, {"name": "somerset federation of young farmers' clubs", "sentiment": "none"}, {"name": "young farmers' club", "sentiment": "none"}, {"name": "somerset young farmers' club", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "young farmers", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "In a new series for the Western Morning News' monthly Westcountry Farmer magazine, we get to know a little bit more about Somerset Young Farmers' Club (YFC) chairman, Tom Lock. \nQ: Tell us a bit about yourself – what is your background / interests? \nA: I grew up on Exmoor and very much enjoy life in the countryside. I went to school and college locally. Following college I joined my family's building business. I try to spend as much time outdoors. I also enjoy photography and I love to travel whenever I can. \nQ: How did you get involved with Young Farmers? \nA: Both my parents were in YFC and have been involved with Exmoor young farmers ever since. My sister and I joined were we were about 13. I really found YFC to be a team effort whether it's organising a fun raising event for Charity or competing on Stage together in a Performing Arts Competition. Life friends were made from joining YFC, including finding my future wife! \nREAD MORE: South West Young Farmers Q&A: Five minutes with Ben Cavill \nQ: Tell us a bit about your day to day work – what does your job entail? \nA: I currently run my own business renovating property. It is very much a family affair and many of the skills I use on a day to day business have been learnt from working for my dad previously. I really enjoy transforming and modernising run down property's into family homes. \nQ: What would you say is your biggest achievement to date? \nA: I never thought I would have the honour of being County Chairman for Somerset Federation of Young Farmers' Clubs. I am proud to represent the YFC members of Somerset at various meetings and high profile events such as The Dairy Show at the Royal Bath & West Showground. \nQ: What do you think is the biggest challenge currently facing young people in the industry with Brexit around the corner? \nA: There are many challenges that young people face in today's society, including the lack of affordability for young people to stay living in the countryside and finding jobs in rural areas. We are losing so many bright youngsters to the cities, especially after university. I really hope that leaving the EU is the right decision for the future generations, but only time will tell. \nREAD NEXT: Record bookings for NSA Sheep South West event \nQ: If not already, why should people get involved with their local Young Farmers' Club? \nA: The YFC movement teaches you life skills that are so relevant for young people day to day. YFC also ensures a full social life. Certainly through being involved in my YFC club I have not felt isolated from a community and I have grown in confidence. If you know of that person that sits at the back of the class and lacks confidence, introduce them to YFC and watch them develop. READ NEXT:", "external_links": [], "published": "2017-03-23T22:26:00.000+02:00", "crawled": "2017-03-23T19:50:38.114+02:00", "highlightTitle": ""}