{"organizations": [], "uuid": "60b805966f8aea44f190960113f1852b7672dbba", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12760520.ece/ALTERNATES/s1200/TMP_NEC_010317FentimansRobson07JPG.jpg", "site_section": "http://www.thejournal.co.uk/business/?service=rss", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12766325", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Brexit fears could see Fentimans open plant in Europe", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast LIVE: Brexit fears could see Fentimans open plant in Europe", "spam_score": 0.0, "site_type": "news", "published": "2017-03-20T15:20:00.000+02:00", "replies_count": 0, "uuid": "60b805966f8aea44f190960113f1852b7672dbba"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12766325", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Brexit fears could see Fentimans open plant in Europe", "locations": [], "entities": {"persons": [{"name": "robson", "sentiment": "none"}, {"name": "eldon robson", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "thomas fentiman", "sentiment": "none"}, {"name": "vittorio colao", "sentiment": "none"}, {"name": "brexit  fentimans", "sentiment": "none"}, {"name": "kumar mangalam birla", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "usa", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "pennsylvania", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "vodafone", "sentiment": "negative"}, {"name": "european union", "sentiment": "none"}, {"name": "press association", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}, {"name": "reliance jio", "sentiment": "none"}, {"name": "aditya birla", "sentiment": "none"}, {"name": "aditya birla group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KEY EVENT Vodafone announces merger of Indian operation with Idea Cellular \nVodafone is to merge its Indian operation with Idea Cellular in a deal that will create the Asian country’s biggest telecoms firm. \nThe British-based giant said it has struck an agreement with Idea’s owner, the Indian conglomerate Aditya Birla Group, which will see it hold a 45% stake in the new entity. \nAditya Birla Group will own 26%, with the option to acquire more shares from Vodafone. Vodafone said there would be “substantial” cost savings to be made off the back of the deal, estimated to be around $10bn (£8bn). The new firm will cater to almost 400 million people. \nVodafone chief executive Vittorio Colao said: \nThe combined company will have the scale required to ensure sustainable consumer choice in a competitive market and to expand new technologies - such as mobile money services - that have the potential to transform daily life for every Indian. \nVodafone cautioned in February that it will meet the lower end of its full-year earnings outlook as it faces mounting competition in the UK and India. The South Asian country’s mobile market has become increasingly competitive in recent years, and experts believe the Idea merger is one way of seeing off competition from a new operator, Reliance Jio. \nAditya Birla group chairman Kumar Mangalam Birla said: \nFor Idea shareholders and lenders who have supported us thus far, this transaction is highly accretive, and Idea and Vodafone will together create a very valuable company given our complementary strengths. \nVodafone also recently announced it was helping to create 600 customer service jobs in Newcastle. Vodafone is set to merge with Idea Cellular in India 8:25 KEY EVENT Fentimans considers opening in Europe if trade tariffs rise after Brexit \nFentimans, the Northumberland soft drinks brand, is considering launching a manufacturing operation in Europe if trade tariffs rise after Brexit. \nEldon Robson, the firm’s Brexit-backing owner, said he would explore setting up an operation on the continent if exporting became more expensive after Britain’s divorce from the European Union. \nHe said: \nIf it did come to the point where tariffs are introduced, then we would set up some kind of manufacturing in Europe and that is how we would service the European marketplace,” he told the Press Association. \nWe are used to outsourcing our manufacturing. We set up an operation in Pennsylvania, USA, where we sent our flavour recipes and they source the core ingredients and labels. \nMr Robson added that sterling’s slump was beginning to bump up costs, but he did not believe Brexit would choke off overseas demand. \nOn Brexit, he said: \nWith business you always have challenges. You might as well tackle (Brexit) with a positive frame of mind. I wish the negativity would give way because there are opportunities as well. \nThe botanical soft drinks maker, founded in 1905 by Mr Robson’s great grandfather Thomas Fentiman, is also delving into the canned drinks market for the first time. \nFentimans, which has historically bottled its beverages, is offering its curiosity cola and rose lemonade in 250ml slimline cans in an attempt to rake in sales from convenience stores, coffee bars and airlines. \nThe firm’s foray into canned drinks is part of a plan to triple turnover to £72m within five years. It includes a move to bolster its range of upmarket mixers for alcoholic drinks as it looks to close the gap on industry-rival Fever-Tree. \nThe Hexham-based company currently exports to 65 countries and is eyeing 15 new markets by 2022. It employs around 50 staff in the UK. \nAsked whether he was priming the business for a sale, Mr Robson added: \nWe are approached by people. \nWe are in a very strong financial position and we don’t owe the bank any money. I own the business 100% and the future of the business is in very good hands at the moment. There is a very solid future for us. \nThe brand, with its artisan bottles and Alsatian-themed labels inspired by Thomas Fentiman’s prized pet Fearless, was revived by Mr Robson in 1988. He prides his product in only using herbs, natural flavours and slow fermentation. Eldon Robson CEO of Fentimans (Photo: Newcastle Chronicle) Share", "external_links": [], "published": "2017-03-20T15:20:00.000+02:00", "crawled": "2017-03-20T10:36:32.494+02:00", "highlightTitle": ""}