{"organizations": [], "uuid": "a93ddfa8f85485a28d923ef495c27ca345005700", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article11926199.ece/ALTERNATES/s1200/Sports-Direct-agency-worker-conditions.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12697272", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Mike Ashley's Sports Direct issues warning over currency turbulence", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast LIVE: Mike Ashley's Sports Direct issues warning over currency turbulence", "spam_score": 0.0, "site_type": "news", "published": "2017-03-07T15:00:00.000+02:00", "replies_count": 0, "uuid": "a93ddfa8f85485a28d923ef495c27ca345005700"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12697272", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Mike Ashley's Sports Direct issues warning over currency turbulence", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford Siemens plans to move historic Newcastle training site \nGlobal engineering giant Siemens is planning to close its training department at the historic Parsons works in Newcastle , putting 29 jobs at risk. \nA proposal to move the centre to Hull was sparked after Siemens agreed a joint venture to merge its wind business with Spanish energy heavyweight Gamesa. \nA spokesman at Siemens said: “Once that decision was made and the joint venture was agreed by the Spanish shareholders of Gamesa, we entered into a round of looking at consolidations and feasibility studies. \n“One of the things was to move the training centre from Newcastle to Hull, and that was a seven-week investigation and feasibility study. No decision has been made. That hasn’t happened yet.” \nThe proposal to move the training centre to Hull was being presented to Siemens’s board of directors yesterday. \nSiemens’s site on Shields Road, Heaton , has been at the forefront of engineering technology for over 125 years. The site was formerly home to the Parsons Factory, which developed steam turbine generators during the Victorian era. \nStaff at the site have been left “waiting in anticipation” for further news about whether their jobs will remain in Newcastle. \nIf the proposal is approved, Siemens has said that it will look to “relocate” and “redeploy” its staff members. Those who are not willing to relocate will face redundancy. Siemens on Shields Road, Heaton (Photo: Newcastle Journal) 8.45 Coreena Ford Cafe bar The Social Market planned for Newcastle city centre railway arch \nPlans have emerged to create a new cafe bar within a growing community of businesses i n Newcastle city centre . \nThe Social Market could soon open in Arch 6 on Westgate Road in the site of the former Sausage Emporium eaterie which closed a year ago. \nThe cafe bar is the brainchild of experienced hospitality businessman Cedric Boc-Ho, who plans to serve up a unique bar, restaurant and shop within the two-floor converted railway arch if his license application is given the go-ahead by Newcastle city council. \nThe application details how the the business is planned to be a cafe bar, operating over the ground floor and mezzanine level, with a retail offering. \nThe application says: “The premises shall primarily operate as a cafe bar providing food and drink for consumption both on and off the premises. A food offering will be available until at least one hour before the cessation of sale of alcohol. \n“Waiter/waitress service will be available throughout the hours that the premises are open.” \nMr Boc-ho wants to run The Social Market seven days a week, opening for breakfast, lunch and dinner serving continental platters, wines and beers. \nThe arches on Westgate Road and Forth Street are already home to businesses including PR firm Ramarketing, the city’s original micropub the Split Chimp, newcomer The Box Social, popular pizza restaurant Herb Garden and the Chili Pepper Sandwich shop. The railway arch which could be turned into the Social Market cafe bar 8.40 Coreena Ford Newcastle's Shared Interest Society gets £35m to invest in fair trade growers \nAn investment company that lends money to fair trade producers in developing countries has received £35m to help spearhead its global growth. \nNewcastle-headquartered Shared Interest Society offers affordable lending to fair trade growers who are often unable to borrow money. \nThe company helps people invest in the developing world by asking individual investors to invest between £100 and £100,000 in its funds. In 2016 it made £62m in payments to 397 organisations. \nNow it has received a £35m facility from Santander Corporate & Commercial to boost its foreign currency lending and spearhead global growth. \nShared Interest lends money to organisations in nearly 60 countries and has offices in Peru, Ghana, Costa Rica and Kenya. Due to its international nature, foreign exchange trading and costs can impact Shared Interest’s business. \nThe new facility from Santander has been designed to work across different currencies and minimising the impact on Shared Interest from foreign exchange trading. Reducing the costs of currency fluctuations will help Shared Interest reach more overseas organisations in need of finance. \nPatricia Alexander, managing director at Shared Interest, said: “We have ambitious plans to build on over 20 years of successful lending and are delighted to be partnering with Santander as we look to increase our impact with the support of our investors and volunteers. \n“This facility will directly enable us to transfer funds efficiently across different time zones, which is vital when supporting businesses on a global level.” Patricia Alexander, Shared Interest KEY EVENT More than 800 jobs to go as Budgens stores close \nMore than 800 jobs have been lost after the owner of 34 Budgens stores collapsed into administration. \nFood Retailer Group, an arm of business restructuring specialists Hilco Capital, appointed PwC as administrator last month but the accountancy firm has failed to find a buyer for the group. \nA total of 815 staff have begun the redundancy process. \nMike Denny, joint administrator at PwC, said: \nUnfortunately, we have been unable to find a buyer and it is not commercially viable to continue trading the stores. \nWe are working closely with the Co-op, Usdaw and the relevant government agencies to ensure that all employees receive the maximum levels of practical and financial support through the redundancy process. \nFood Retailer Group bought the stores from the Co-operative Group in July. \nAt the time the firm said “there are no planned redundancies” and stores will continue “trading as usual”. More than 800 jobs have been lost after the owner of 34 Budgens stores collapsed into administration 8.30 Coreena Ford Christmas sales in bubbly leave Treasury full of fizz... \nApologies for mentioning Christmas in March, but figures are just in relating to sales of the sparkly stuff we have over the festive season. \nA record-breaking volume of sparkling wine was sold in UK shops and supermarkets at Christmas with over 40 million bottles flying off the shelves. \nThe end-of-year sparkling wine sales show stores made £270m in the three-month run-up to Christmas, up 10% on the same period in 2015, according to the latest market report from the Wine And Spirit Trade Association (WSTA). \nA further five million bottles were sold in pubs, bars and restaurants during the 12 weeks to December 31 2016, worth £127m, up 37% on last year. The combined on and off trade sales of sparkling wine was over 45 million bottles, up 54% in five years, when during the same period in 2012 sales reached short of 21 million bottles, the WSTA said. \nIn total, sparkling wine (not including champagne) sold 995,000 hectolitres, the equivalent of 132 million bottles, in shops, bars and restaurants during 2016, worth over £1.2bn. \nThe sales of sparkling wine means the Chancellor received a tax windfall of around £468m last year, the WSTA said. \nIf duty paid on champagne is added, this takes the amount paid into the Treasury to over half a billion at £550m. A table full of Champagne 8.25 Coreena Ford Weak non-food sales reveal a cautious spending trend \nRetailers have endured their first quarterly fall in non-food sales for more than five years as rising inflation eats into consumer spending, industry figures have shown. \nData from the British Retail Consortium (BRC) and KPMG showed like-for-like non-food sales declined by 0.4% in the three months to February - its first drop since November 2011. \nThe BRC said like-for-like sales were also down 0.4% last month compared with February last year. \nBut like-for-like food sales lifted by 0.6% in the three months to February, while total food sales grew by 2% over the period. \nBRC chief executive Helen Dickinson said “persistent” weak sales across non-food categories pointed to an “undeniable trend” of cautious spending on non-essential products. \n“There was some negative distortion created by the later timing of Mother’s Day this year, which meant that some categories, notably women’s accessories and health and beauty, didn’t benefit from the build-up of gift purchases as they did last year,” she said. \nOnline sales of non-food products recorded its lowest three-month average since the survey began, growing 7.7% in February. \nIt comes as official figures showed an unexpected fall in retail sales by 0.3% in January, suggesting household spending was being squeezed by Brexit-induced inflation. \nPaul Martin, UK head of retail at KPMG, said food sales had continued to “buck the trend”, but inflation was hitting retail performance and consumer confidence was showing signs of deteriorating. \nSeparate figures for Barclaycard showed consumer spending grew by 4% year-on-year in February thanks to the highest-ever increase in essential item expenditure. 8.20 FTSE and pound latest \nThe FTSE-100 index opened at 7350.12. \nThe pound at 8am was 1.2224 dollars compared to 1.2242 dollars at the previous close. The euro at 8am was 0.8665 pounds compared to 0.8646 pounds at the previous close. (Photo: Joe Giddens/PA Wire) KEY EVENT Kromek unveils $990,000 US contract win \nCounty Durham tech firm Kromek has announced a new contract worth $990,000 (£809,000) with a US firm. \nThe Sedgefield radiation detection technology company has been been awarded the deal by an existing customer, a global leader in aerospace and defence technologies, for the upgrade of the company’s advanced security screening detectors that it’s had since 2009. \nUnder the terms of a 12-month contract Kromek will develop and provide the first annual supply of the upgraded detectors. The contract also guarantees that Kromek will continue to be the exclusive supplier for these upgraded detectors for the next 10 years. \nDr Arnab Basu, chief executive officer of Kromek, said: “We are delighted to receive this new security screening contract from an existing customer that is a major aerospace and defence company. \n“This contract provides further validation of the strength of our advanced radiation detection solutions and adds to the visibility of revenues and strengthens our confidence in the continuing growth of the business.” Arnab Basu, chief executive of Kromek 8.10 Coreena Ford Direct Line announces 30% profits slump \nInsurance giant Direct Line has posted a 30% slump in annual profits after taking a hit of more than £217 million following Government changes to the way personal injury claims are calculated. \nThe firm reported pre-tax profits of £353 million for 2016, down sharply on the £507.5 million seen a year earlier after a cut to the so-called Ogden discount rate calculation. \nThe insurance sector was sent reeling last week after Lord Chancellor Liz Truss put forward changes to the discount rate calculation, which is expected to increase payments given to victims of life-changing injuries through medical negligence, car crashes and other incidents. \nMs Truss said, from March 20, the rate would be cut from 2.5% to minus 0.75%, reflecting the changes in gilt yields. \nBut boss Paul Geddes insisted Direct Line had a successful year in a market “disrupted” by the change. Direct Line added it does not expect any “material” further impact in 2017 from the Ogden rate. \nThe change to the Ogden rate is now being consulted on and Direct Line said it hoped this would lead to a”better and fairer framework for claimants and defendants”. Direct Line Logo KEY EVENT Sports Direct warns of impact of currency woes \nThe retail empire owned by Newcastle United owner Mike Ashley is heading for more currency woes after the firm issued a statement warning it will take a hit from the devaluation of the euro against the US dollar. \nThe retailer said its euro/dollar hedging position is due to expire at the end of April and the firm has no hedge in place for the following financial year. \nSports Direct said in a Stock Market statement: “In response to certain inquiries received by the company in relation to currency, we continue to believe the devaluation of the euro against the dollar will impact on gross margin. \n“Our euro/dollar exchange rate is currently hedged at 1.46, which is due to expire at the end of full year 2017 and we currently have no euro/dollar hedging in place for full year 2018.” \nThe euro is currently trading at around $1.06. \nThe news comes after the firm warned on a profits hit linked to the fall in sterling following the EU referendum, which resulted in half year profits tumbling in December. \nAside from the UK, Sports Direct has a presence in Europe through stores in Austria and the Baltic states. \nA fall in the euro against the dollar is expected to see an increase in import costs as the firm buys its goods in US currency. \nSports Direct also sought to clarify its position regarding the acquisition of lingerie firm Agent Provocateur out of administration last week. \nWe reported how Mr Ashley bought the retail chain from private equity firm 3i through his investment vehicle Four Holdings. \nThe billionaire Sports Direct owner picked up the firm, which has 10 stores in the UK and employs around 600 people, via a pre-pack administration. \nSports Direct clarified this, by adding: “A number of recent press reports have incorrectly stated that Sports Direct has acquired Agent Provocateur. \n“In fact, Agent Provocateur has been acquired by Four (Holdings) Limited, a company in which Sports Direct has a shareholding of 25%. \n“Some reports have also stated that Sports Direct paid £35 million two years ago for a stake in Four Marketing. In fact, the amount paid for the shareholding in Four (Holdings) Limited was £8.75m.” Sports Direct founder Mike Ashley (Photo: Joe Giddens/PA Wire) Share", "external_links": [], "published": "2017-03-07T15:00:00.000+02:00", "crawled": "2017-03-07T11:31:45.039+02:00", "highlightTitle": ""}