{"organizations": [], "uuid": "b9fcbe58c63024fbfbe5ddb65145370cfcf8f506", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bostonstandard.co.uk", "main_image": "http://res.cloudinary.com/jpress/image/fetch/w_300,f_auto,ar_3:2,c_fill/http://www.bostonstandard.co.uk/webimage/1.7889682.1490784403!/image/image.jpg", "site_section": "http://www.bostonstandard.co.uk/rss/cmlink/1.335257", "section_title": "Boston Standard MBSP.news.feed", "url": "http://www.bostonstandard.co.uk/news/how-standard-reported-on-voting-to-stay-in-the-eu-in-1975-1-7889683", "country": "GB", "title": "How Standard reported on voting to stay in the EU in 1975", "performance_score": 0, "site": "bostonstandard.co.uk", "participants_count": 0, "title_full": "How Standard reported on voting to stay in the EU in 1975", "spam_score": 0.0, "site_type": "news", "published": "2017-03-29T18:46:00.000+03:00", "replies_count": 0, "uuid": "b9fcbe58c63024fbfbe5ddb65145370cfcf8f506"}, "author": "", "url": "http://www.bostonstandard.co.uk/news/how-standard-reported-on-voting-to-stay-in-the-eu-in-1975-1-7889683", "ord_in_thread": 0, "title": "How Standard reported on voting to stay in the EU in 1975", "locations": [], "entities": {"persons": [{"name": "body", "sentiment": "none"}, {"name": "richard body", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "george osborne", "sentiment": "none"}, {"name": "david seymour", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "lincolnshire", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "boston", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "south holland", "sentiment": "none"}], "organizations": [{"name": "standard", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "commission", "sentiment": "none"}, {"name": "european parliament", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "derbyshire", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "sensors and systems", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}, {"name": "socialists", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "council of ministers", "sentiment": "none"}, {"name": "marsh lane", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "How Standard reported on voting to stay in the EU in 1975 The front page of The Standard, June 13, 1975. By David Seymour 11:46 Wednesday 29 March 2017 County claims fourth highest Yes vote MP’s concern over decision, but says Europe must now be ‘as open as possible’ in terms of trade Business submits factory plans for Boston on back of result Have your say \nAs the UK Government moves to trigger Article 50, we look back on how The Standard covered the result of the 1975 referendum which saw the nation vote to stay in the European Union. \nLincolnshire’s pro-Common Market vote on June 5 was the fourth highest in the country – 74.7 per cent. Fast forward to 2016 and parts of the county (Boston, first, South Holland, second) are finishing top in the country for the highest proportion of Leave voters. This result will have little effect for a couple of years, but we are now in a major dilemma. For a growing number of our laws will be made by the Commission and the Council of Ministers and no one can prevent it. \nOut of a total of 242,097 votes cast in 1975 – a 62.37 per cent per cent poll – 180,603 in Lincolnshire were in favour of staying in Europe with 61,011 against. \nTaking little joy in the decision at the time was Richard Body, MP for Boston and South Holland and vice chairman of the Get Britain Out campaign. \n“One accepts the verdict of the people – I suppose the British people are willing to surrender,” he told The Standard. “It seems that the people have expressed a decisive wish for the House of Commons to lose a lot of its power and legislation to the European parliament.” \nLooking to the future, he said: “This result will have little effect for a couple of years, but we are now in a major dilemma. For a growing number of our laws will be made by the Commission and the Council of Ministers and no one can prevent it.” \nHe continued: “The dilemma for the Conservatives is that the European Parliament will never be Conservative: once the Labour Party take their seats the Socialists will be the largest party and if they form a coalition with the Communists it will result in a very formidable team. \n“The European Parliament will be strengthened at the expense of the British House of Commons and that will become a much lesser thing.” \nMr Body then made reference to the term protectionism, the act of defending domestic industries from foreign competition. \nIt is a term used in December by the former Chancellor of the Exchequer George Osborne as he urged the Government to maintain a close relationship with Europe, saying Brexit was the ‘greatest act of protectionism’ in Britain’s history. \nMr Body said: “We must now try to make it as open a Europe as possible in terms of trade - at the moment it’s protectionist - and in the sense also of enabling other countries to come into it.” \nThe front page also featured some good news arising from the 1975’s equivalent of a Remain vote win. \nLess than a week after the vote, the Derbyshire electronics business of Sensors and Systems had announced it was going ahead with detailed planning for its proposed Marsh Lane factory. \nThe company had made a Yes decision a condition for its Boston expansion or it would set up a plant in Europe. Sign in", "external_links": [], "published": "2017-03-29T18:46:00.000+03:00", "crawled": "2017-03-29T14:34:43.888+03:00", "highlightTitle": ""}