{"organizations": [], "uuid": "11ee3878f40c56ef157e8fd0a26362b4dd69e3e2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30215795/15915591.jpg", "site_section": "http://www.middevongazette.co.uk/all-content.rss", "section_title": "Devon Live All Content Feed", "url": "http://www.devonlive.com/success-breeds-success-as-exeter-and-its-university-reap-rewards/story-30215795-detail/story.html", "country": "GB", "title": "Devon Live published Success breeds success as Exeter and its university reap rewards", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "Devon Live published Success breeds success as Exeter and its university reap rewards", "spam_score": 0.0, "site_type": "news", "published": "2017-03-20T20:29:00.000+02:00", "replies_count": 0, "uuid": "11ee3878f40c56ef157e8fd0a26362b4dd69e3e2"}, "author": "Devon Live", "url": "http://www.devonlive.com/success-breeds-success-as-exeter-and-its-university-reap-rewards/story-30215795-detail/story.html", "ord_in_thread": 0, "title": "Devon Live published Success breeds success as Exeter and its university reap rewards", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Exeter University chief Steve Smith on house prices, drinking culture and landing your perfect job By Devon Live | Posted: March 20, 2017 By Keith Rossiter Sir Steve Smith, the Vice Chancellor or Exeter University Exeter University chief Steve Smith on house prices, drinking culture and landin... X \nCopy link to paste in your message / Comments (0) The growth of Exeter and its university have gone hand in hand, according to its Vice Chancellor, Sir Steve Smith. When Sir Steve went house-hunting for a retirement home in Exeter, the estate agent told him: \"It's your fault prices are so high.\" The city has \"reached take-off\" the Vice Chancellor of the University of Exeter says – though he's humble enough not to take the estate agent's joke entirely at face value. Many other factors, not least the Met Office's move to Exeter, have played their part in the city's success. \nAfter 14 years at the helm (and with three more to go), Sir Steve says: \"This is the place for me.\"According to the Centre for Cities, Exeter is the fastest growing in the country and has the lowest proportion of residents with no formal qualifications in the country. \n\"We've reached take-off as a city and we need to make sure we get the right investment to support the city and the area around it,\" Sir Steve says. Wages are growing across Exeter's expanding travel to work area, with more jobs being added within the \"knowledge economy\". \nIn 2014 the university put about £640 million into the South West economy, of which about £420 million went into Exeter. By contrast, the cost of the John Lewis development in Exeter was £19 million. \n\"We have been growing at a rate of about nine per cent since then, and we are also driving a lot of cultural diversity – shops, restaurants, delis,\" he says. \"Around the UK the higher knowledge-intensive jobs you've got, the more growth and the higher the earnings.\" \nRead more: The interactive Peppa Pig movie is coming to Devon - here's where \nExeter powered through the recession with almost no unemployment. \"Two months ago there were 68 unemployed, 4,800 jobs,\" Sir Steve says. \"We are trying to provide a skills escalator so people where ever they're born can have a good salary and a good life.\" \nExeter, in spite of being in the local enterprise partnership that is third worst in the country on GVA per person, is highest in England on GVA person.\" \nNot everyone loves students, whose drinking and clubbing habits may be at odds sometimes with the daily lives or ordinary working people. Sir Steve acknowledges that success for the university brings its share of problems, particularly pressure on housing and parking, and noise. \n\"We grew, and lots of people let their houses out for nice incomes,\" Sir Steve says. \"The council came to us and said, look, this really isn't good. If you're a young couple trying to buy a house in Exeter, you're frozen out.\"The university is now partly addressing that by building 1,200 rooms in the East Park development on campus. \nSome benefits are more tangible than others. The university hosts events such as Chinese New Year, which attracted 3,000 visitors. The leafy campus with its sculpture trail and 11,000 trees is an important weekend draw for Exeter residents. Sir Steve raised £1 million to save Exeter's troubled Northcott Theatre from going to the wall, and the university alone has contributed £100,000 a year for the theatre. \n\"It was a difficult one for me. If someone said to me, 'You can have £1 million for the university or £1 million for the theatre….\" \nFor all their bad habits, young people have become much more socially responsible. Exeter's students put in enough volunteering work to equate to 80.5 full-time social workers. \n\"That's not down to me – that's the community of the university. If the university left the city, a lot more than the economy would suffer,\" Sir Steve says. \nThe students are also more demanding in terms of what they get for 'their money' – \"and rightly so. They're taking on a debt and we need to make sure they're educated to the highest standard,\" he says. \nThe thorniest issue he has faced has been religious fundamentalism – but fundamentalist Christianity, not Islam.The university had a court case a decade ago about Evangelical Christians' right to be offended by homosexuality. \nRead more: Still time to enter the Express & Echo Business Awards \n\"When ministers ask, 'Do you have a problem with fundamental religion', we say, Yes – Christians.\" \nMost recently, Israel Apartheid Week and the election of a Palestinian student, Malaka Shwaikh, to a position in the students' union have caused controversy. Other recent incidents given prominence in the media include a story about racist and anti-Semitic slogans scrawled on students' T-shirts at a Freshers' Week social last year. \nSir Steve said the complaints tended to come from outside the university. In a statement, he condemned all forms of racism. \n\"Social media are an echo chamber. What I read on social media bore no relation to the university I work at.\"Sir Steve takes seriously his obligations to freedom of speech.In October 2015 the university hosted a conference on Settler Colonialism in Palestine.\"A lot of people asked us to ban the event. We couldn't. But we did invite people who work on Israel to come to the conference, and we guaranteed that they could speak.\" \nA follow-up conference in January last year included representatives of both sides. \"It was difficult, to put it mildly,\" Sir Steve says. \"But if we can't have those discussions, however difficult they might be, then you drive them underground. \n\"We have to take seriously allowing people to speak freely within the law, subject to other issues such as safety. \n\"It's not an easy position, and my postbag has a lot of letters accusing me of being pro-Palestinian, or pro-Israeli.\" He is an avid social media watcher, and says sites such as Facebook and Twitter give a false impression of how upset his students might be. \n\"Our Jewish chaplain says he has never had a single report in seven years of anti-Semitism, and our Jewish and Muslim societies play football together.\" \nSir Steve is confident that he will be able to continue to recruit top staff from Europe, in spite of Brexit.\"We are able to recruit staff from any country in the world, so why should it be any different from Europe?\" But he recognises the uncertainty they face, and the university has offered workshops and help with legal fees. \nSince the referendum last June, the university has appointed 101 staff from the EU. He said there was a small outbreak of \"nastiness\" after the referendum – ironically mostly targeting non-EU migrants – \"but thankfully that has gone away\". \nThe university does not particularly target EU students, who pay the same fees as UK students, while those from the rest of the world pay nearly twice as much. As a result, only 6% are from the EU. \nThe biggest worry is what will happen to the research networks built up in Europe.UK institutions get about £800 million a year for research from the EU, and the University of Exeter regularly gets about £15 million of that – a number which is increasing. \nSir Steve said the Government had talked to the university about making up that money.However, he added: \"It's not about the money, it's about the networks.\" \nWithout organisations like, for example, the European Research Council, the complexity of setting up research consortiums in an age when most research involves academics from several countries would increase dramatically. Sir Steve's top tips to land your perfect job \nHis advice to young people is: Aim as high as you can; be ambitious; do your research to work out what's right for you. Most importantly, study something you love. \"Don't go in thinking you need to do x in order to get that job, because that job might not exist in 10 years. What people need now are people who have the skills for life.\" \nThe Westcountry has a problem in retaining talent because there are not enough well paid jobs to attract the best students. Sir Steve said that was improving, and new opportunities were opening up for Exeter graduates. One of the big growth areas is for those with maths degrees, particularly in fields such as data analysis. \nMany young people are forced to work for nothing in unpaid internships in an attempt to improve their CV. The university does not offer unpaid internships, and Sir Steve says they \"have become the new built-in advantage of the middle classes\". \n\"We spend £12.4 million a year on support for students to come and study, but is switching a large chunk of that to help students get work placements or internships. When we look at our students and their employment opportunities, the ones who have easy access to placements are either the ones who have got mummy and daddy, or the ones that have the money to work unpaid in London for six weeks.\" \nThe university plays a role in helping to turn out graduates with the skills that will be needed by industry. \"What we're saying to students is, if you're going to university we have to make sure our programmes are tailored for the world after study.\" Click here to search over 1,000 jobs in Exeter and the surrounding area or return to homepage .", "external_links": [], "published": "2017-03-20T20:29:00.000+02:00", "crawled": "2017-03-20T16:51:15.084+02:00", "highlightTitle": ""}