{"organizations": [], "uuid": "d7b264e592990042d4af1c2dc4be64044a0637d4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article11844682.ece/ALTERNATES/s1200/Sainsburys-management-training.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12747693", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Sainsbury's sales fall amid competitive trading, plus latest news", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast LIVE: Sainsbury's sales fall amid competitive trading, plus latest news", "spam_score": 0.0, "site_type": "news", "published": "2017-03-16T15:00:00.000+02:00", "replies_count": 0, "uuid": "d7b264e592990042d4af1c2dc4be64044a0637d4"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12747693", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Sainsbury's sales fall amid competitive trading, plus latest news", "locations": [], "entities": {"persons": [{"name": "day  wetherspoon", "sentiment": "none"}, {"name": "andrew hodgson", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "charlotte hogg", "sentiment": "none"}, {"name": "quinn", "sentiment": "none"}, {"name": "mike coupe", "sentiment": "none"}, {"name": "kate nicholls", "sentiment": "none"}, {"name": "coreena ford balfour beatty", "sentiment": "none"}, {"name": "martin", "sentiment": "none"}, {"name": "tim martin", "sentiment": "none"}, {"name": "argos", "sentiment": "none"}, {"name": "charles rendell", "sentiment": "none"}, {"name": "jd wetherspoon", "sentiment": "none"}, {"name": "carlos neves", "sentiment": "none"}, {"name": "martin lawlor", "sentiment": "none"}, {"name": "neves", "sentiment": "none"}, {"name": "blyth", "sentiment": "none"}, {"name": "brigid simmonds", "sentiment": "none"}, {"name": "ruby wax", "sentiment": "none"}, {"name": "balfour beatty", "sentiment": "none"}, {"name": "ruby", "sentiment": "none"}, {"name": "jon gluyas", "sentiment": "none"}, {"name": "coupe", "sentiment": "none"}, {"name": "leo quinn", "sentiment": "none"}, {"name": "wetherspoon", "sentiment": "none"}, {"name": "adwen", "sentiment": "none"}, {"name": "hodgson", "sentiment": "none"}, {"name": "sacha berendji", "sentiment": "none"}, {"name": "balfour", "sentiment": "none"}, {"name": "steve ullathorne", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "port of blyth", "sentiment": "none"}, {"name": "sage gateshead", "sentiment": "none"}, {"name": "brighton", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "coreena ford uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "san francisco", "sentiment": "none"}, {"name": "spencer", "sentiment": "none"}, {"name": "nottingham", "sentiment": "none"}, {"name": "norwich", "sentiment": "none"}, {"name": "san jose", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "cambridge", "sentiment": "none"}, {"name": "tu", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "atlantic", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "north east of england", "sentiment": "none"}, {"name": "blyth", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "wetherspoon", "sentiment": "none"}, {"name": "north sea", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "north east china", "sentiment": "none"}], "organizations": [{"name": "lep", "sentiment": "negative"}, {"name": "coreena ford north east", "sentiment": "negative"}, {"name": "sainsbury", "sentiment": "negative"}, {"name": "marks & spencer", "sentiment": "none"}, {"name": "northumbria university", "sentiment": "none"}, {"name": "argos digital", "sentiment": "none"}, {"name": "team valley trading estate", "sentiment": "none"}, {"name": "eaton aerospace", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "bank of england", "sentiment": "none"}, {"name": "group", "sentiment": "none"}, {"name": "canterbury", "sentiment": "none"}, {"name": "london stock exchange", "sentiment": "none"}, {"name": "association of licensed multiple operators", "sentiment": "none"}, {"name": "turbo power", "sentiment": "none"}, {"name": "home retail group", "sentiment": "none"}, {"name": "chinese embassy", "sentiment": "none"}, {"name": "barclays", "sentiment": "none"}, {"name": "argos", "sentiment": "none"}, {"name": "coreena ford bank of england", "sentiment": "none"}, {"name": "pub association", "sentiment": "none"}, {"name": "nof energy", "sentiment": "none"}, {"name": "soil machine dynamics", "sentiment": "none"}, {"name": "bank", "sentiment": "none"}, {"name": "leeds", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "bombardier transportation", "sentiment": "none"}, {"name": "rystad energy", "sentiment": "none"}, {"name": "argos digital stores", "sentiment": "none"}, {"name": "monetary policy committee", "sentiment": "none"}, {"name": "great energy debate", "sentiment": "none"}, {"name": "federal reserve", "sentiment": "none"}, {"name": "mpc", "sentiment": "none"}, {"name": "turbo power systems", "sentiment": "none"}, {"name": "durham university", "sentiment": "none"}, {"name": "newcastle city council", "sentiment": "none"}, {"name": "british beer & pub association", "sentiment": "none"}, {"name": "m&s", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford North East offers Chinese businesses great opportunities, North East LEP leader says \nThe North East could be a major front for Chinese businesses looking to export into Europe, according to the chair of the North East LEP. \nAndrew Hodgson told Chinese delegates that the North East had a great deal to offer China, including easy access to Europe for exports. \nHis comments were made at the 2017 North East China Business Forum, which was attended by representatives from the Chinese Embassy, Newcastle City Council, Northumbria University, and business leaders from both the North East and China. \nMr Hodgson, who is also CEO of Wallsend-based offshore engineering company Soil Machine Dynamics, said: “We have great linkage to Europe. Whatever way you look at the North East, we are the greatest trading region with Europe from the UK. \n“Interestingly, for those of you who have been following the politics, one thing that I know is that if Scotland decides to devolve then the North East of England will actually be Scotland’s largest trading partner because Scotland has to ship most of its products through the North East of England as well.” \nMr Hodgson also told attendees that the region offered expertise in areas such as the automotive sector, health and life sciences, offshore energy, and technology. \nThe forum was also used to explore how targeting the Chinese market could be good for UK businesses. Andrew Hodgson, Chair of the North East LEP and CEO of SMD (Photo: Newcastle Chronicle) 8.45 Coreena Ford Gateshead manufacturer Turbo Power Systems continues hunt for a buyer \nGateshead manufacturer Turbo Power Systems said its search for a buyer continues after bosses heralded last year’s performance as confirmation of a “turnaround”, despite reporting a loss of £765,000. \nThe firm, based on the Team Valley Trading Estate, announced last year it was undergoing a strategic review that could include the sale of the company. \nNow Turbo Power Systems, which designs high-speed motors, generators, and power electronics, said it had received “expressions of interest” from parties looking to buy the business. \nIn a stock market note, the firm said all offers to acquire Turbo Power have been made on a “debt-free, cash free basis” and have been priced at a “substantial discount” to the firm’s share price. \nTurbo Power Systems (TPS) made a loss of £765,000 last year, but the figure was a slight improvement on the £848,000 loss made during 2015, and chief executive Carlos Neves said the company’s results showed it was achieving a “turnaround”. \nThe firm, whose customers include blue chip companies such as Bombardier Transportation, Daikin Applied and Eaton Aerospace, increased its revenue by 4%, from £13.39m to £13.92m and adjusted operating profit was also up. \nIn the company’s full year results for 2016 and the fourth quarter of 2016, Mr Neves said: “I am extremely proud of the whole TPS team for the results achieved in 2016. The improved performance versus the previous year in revenues, gross margin and investments in R&D confirms the turnaround being achieved by the business.” Charles Rendell, chief finance officer for Turbo Power Systems (on left) 8.40 KEY EVENT Wetherspoon boss Tim Martin calls for pubs to get behind Tax Equality Day \nWetherspoon chairman Tim Martin is urging pub and restaurant operators to show their support for a Tax Equality Day later this year. \nEach of Wetherspoon’s 900-plus pubs in the UK will be cutting the price of all food and drink by 7.5% on the day, Wednesday September 20. \nThe Tax Equality day is aimed at highlighting the benefit of a VAT reduction in the hospitality industry. \nPrices at Wetherspoon pubs will be reduced for one day only, in order to show the benefits of a VAT cut. \nMr Martin has the backing of both the Association of Licensed Multiple Operators (ALMR) and the British Beer and Pub Association (BBPA) who are calling on their members to join in too. \nPrices at Wetherspoon pubs will be reduced for one day only, in order to show the benefits of a VAT cut. \nAt present all food in pubs is subject to 20 per cent VAT, compared to supermarkets which benefit from a zero VAT rate on the vast majority of food products. \nMr Martin said: \nPubs suffer a huge disadvantage paying about 16 pence in business rates per pint versus about two pence for supermarkets. \nIn addition there is a huge VAT inequality and unfairness. \nA reduction in the level of VAT on a long-term basis will create a level playing field and generate growth and jobs in an important and vital industry – especially in beleaguered high streets. \nWe’re aiming to make it the busiest day of the entire year in our pubs and would urge other pub and restaurant operators to participate too. \nBritish Beer & Pub Association chief executive, Brigid Simmonds, said: “Tax Equality Day is a great opportunity to shine a light on how unfair VAT is for both pubs and the wider hospitality sector. \n“If you buy a meal in a supermarket you pay no VAT, but in the pub you pay 20%. \n“Even a small drop in the VAT rate for eating out, to 15 per cent, would create 78,000 jobs and would be a big boost for the economy. \n“I hope pubs will get behind the campaign.” \nAssociation of Licensed Multiple Operators (ALMR) chief executive, Kate Nicholls, added: “ This is a great opportunity not only to highlight the disproportionate burden of tax borne by pubs and restaurants, but also the difference in tax levels between going out and eating and drinking at home. \n“Pubs and restaurants are paying around a third of their turnover in tax compared to a fifth for big supermarkets and a cut in the rate of VAT would help address this unfairness and allow pubs and restaurants to invest in their businesses, their teams and their communities.” JD Wetherspoon chairman Tim Martin 8.35 Coreena Ford Ruby Wax enlisted by Marks & Spencer to lead mental health campaign in store cafes \nMarks & Spencer in Newcastle is among the high street chain’s stores which will host fortnightly mental health chat sessions as part of a project fronted by comedian and campaigner Ruby Wax. \nThe Frazzled Cafe meetings will allow people to meet to talk and share personal stories “in a safe, anonymous and non-judgemental environment”, the retailer announced. \nThe stores will include Newcastle, three in London, Brighton, Newcastle-under-Lyme, Cambridge, Nottingham, Leeds, Canterbury and Norwich, with more locations to be added throughout the year. \nThe sessions will take place in M&S cafes after hours and will be led by trained volunteer facilitators. \nFrazzled Cafe was successfully trialled in M&S offices and stores last year as part of the company’s Plan A eco and ethical initiative. \nMrs Wax, who announced the launch today at London Book Fair, said: “We live in a time where to have a life crammed to the hilt is considered a success story. But with all this pressure, so many of us have nowhere to go to meet and talk about it. \n“Frazzled Cafe is about people coming together to share their stories, calmly sitting together, stating their case and feeling validated as a result. Feeling heard, to me, has always been half the cure. \n“It’s special to get a company like M&S on board. I’m grateful for the set-up support they’ve given us and access to their cafe network is a huge boost.” \nSacha Berendji, retail director at M&S, said: “Ruby’s Frazzled Cafe is a simple, pressure-free way of tackling what can be a taboo subject - feeling stressed. “We hope that by providing free and calm venues after the cafe has closed, we can help any members of the community who simply need to talk about things and what’s happening in their lives.” Ruby Wax (Photo: Steve Ullathorne) 8.30 Coreena Ford Bank of England set to keep interest rates on hold \nThe Bank of England is set to keep interest rates on hold today as Britain prepares to kick off formal divorce proceedings with the EU. \nIn what will be the last Monetary Policy Committee (MPC) meeting before Article 50 is triggered later this month, policymakers are expected to leave rates at 0.25% in the face of potential economic upset from Brexit negotiations. \nThis is despite a growing number of MPC members becoming uncomfortable with soaring inflation. \nThe meeting will also see outgoing deputy governor Charlotte Hogg vote on the MPC for the first - and most likely last - time following her resignation after failing to declare that her brother worked for Barclays. \nHer resignation was confirmed yesterday - less than a fortnight into the role - after she came under heavy fire for breaking the Bank’s code of conduct by not declaring the conflict of interest. \nShe will remain at the Bank for up to three months for “transition purposes”, according to the Bank. \nThe Bank’s US counterpart, the Federal Reserve, raised its benchmark rate for the third time in a decade on Wednesday by 0.25%, citing a strengthening jobs market. \nBut the Bank of England will want to keep a steady monetary path on this side of the Atlantic until the impact of Brexit becomes clearer. The Bank of England is set to keep interest rates on hold (Photo: Getty Images/iStockphoto) 8.25 Coreena Ford Colossal wind turbine blade arrives safely in North East \nOne of the world’s largest wind turbine blades has been safely delivered to the North East to undergo testing. \nThe 88-metre component was shipped to the Port of Blyth to be collected by ORE Catapult. \nThe company is set to carry out a number of tests on the blade before it is installed on a new 8MW offshore wind turbine. \nPort of Blyth chief executive Martin Lawlor, said: “We’re delighted to have played our part in delivering this huge blade successfully to ORE Catapult. It’s great to prove that the Port of Blyth can safely handle such large components, which will soon be considered standard size in the coming years.” \nOnce the testing is completed on the blade, which was built by turbine manufacturer Adwen, it will be sent to Germany to be used on a prototype turbine. The XL-blade was shipped to Port of Blyth where it will be collected for testing (Photo: Port of Blyth) 8.20 Coreena Ford UK energy sector facing crisis as natural resources diminish, North East experts say \nDurham University’s Prof Jon Gluyas, an expert in geo-thermal power and fossil fuels, chaired the Great Energy Debate and highlighted how the UK fortunately has ‘abundant natural energy reserves’. \nBut he quickly shifted tack to point out how these resources are diminishing and, as a result the UK is now facing an energy crisis. \nHe said: “We have the resources but they are in decline for a number of reasons. Coal production has declined significantly, our light oil reserves are in decline, we are at a pinch point for gas and we are not capable of storing renewables. \n“This makes us extremely vulnerable for the first time in generations, and, along with this, the green agenda is failing. We have lots of initiatives but we are not making much impact on emissions to the atmosphere. \n“For the first time the UK is facing a pinch on energy security - the future looks promising, but over the next few years energy security will be a real challenge.” \nThe Great Energy Debate was the highlight of the programme at the seventh annual NOF Energy National Conference and Exhibition, Energy: A Balanced Future. \nDurham-based NOF Energy, which now works across most energy sectors, has its roots in the North Sea oil and gas industry from which it grew over a quarter of a century ago. \nConsequently, many of the 400 delegates at the conference at the Sage Gateshead were cheered by a presentation from one of the world’s leading oil and gas consultancies Rystad Energy. The panel at The Great Energy Debate (Photo: The Great Energy Debate) 8.12 Coreena Ford Balfour Beatty back in the black \nBalfour Beatty has swung back into profit as the construction firm’s turnaround under boss Leo Quinn continues to pick up pace. \nPre-tax profit came in at £8m in the twelve months to December 31, compared with a £199m loss last year after the firm was held back by construction contracts that delivered poor returns. \nUnderlying revenue rose 4% to £8.5bn as Balfour’s order book was boosted 15% to £12.7bn. \nMr Quinn, who has been cutting costs under his Build To Last programme, said: \nThe transformation of Balfour Beatty is well under way. We have returned the group to profit and significantly exceeded our Build to Last phase one targets. All this positions us for future profitable growth \nThe group was also boosted by its biggest US contract win to date last year, inking a £524m deal to electrify 52 miles (84km) of California’s railway. The company will lay the infrastructure for new high-speed trains along the Caltrain rail corridor which runs across 17 cities between San Francisco and San Jose. The deal is being hailed for opening the door to the US market as US President Donald Trump makes infrastructure spending one of his main priorities. \nBalfour added: \nThe trading environment in the Group’s core UK and US markets remains positive. \nIn the UK, government policy is helping to drive a strong pipeline of major infrastructure projects in transport and energy. \nIn the US, the new administration has made infrastructure one of its key priorities. \nThis positive market backdrop supports the group’s commitment to be more selective, targeting contracts with improved profitability and cash flow dynamics. A Balfour Beatty site - the firm's new contract will show trains the way to San Jose 8.07 Pound and FTSE latest \nThe FTSE-100 index opened at 7368.64. \nThe pound at 8am was 1.2272 dollars compared to 1.2222 dollars at the previous close. The euro at 8am was 0.8739 pounds compared to 0.8709 pounds at the previous close. Screen displaying the FTSE 100 at the London Stock Exchange (Photo: Yui Mok/PA Wire) 8.00 KEY EVENT Sales fall 0.5% at supermarket giant Sainsbury's amid tough trading \nSupermarket giant Sainsbury’s said trading remains “very competitive” and warned of continuing price pressures from the weak pound as it saw supermarket sales slip back into reverse. \nThe group posted a 0.5% fall in like-for-like supermarket sales, excluding fuel, in its fourth quarter to March 11, down from a rise of 0.1% in the previous three months. \nHowever, its recent acquisition of Argos boosted overall trading after the chain notched up a 4.3% rise in like-for-like sales over the nine weeks. \nIt snapped up catalogue retailer Argos as part of a £1.4 billion takeover of Home Retail Group in 2016 and has since been overhauling its big supermarkets, adding 41 Argos Digital stores within these stores, including several in the North East. \nThe Argos sales hike helped lift group-wide comparable sales into positive territory, up 0.3% in the fourth quarter. \nGroup chief executive Mike Coupe said he was “pleased” with the company’s performance but added: “The market remains very competitive and the impact of cost price pressures remains uncertain.” \nSainsbury’s blamed its fourth-quarter sales slip on the later Mother’s Day and Easter this year, adding that, after adjusting for this, like-for-like sales would have been 0.1% higher. \nIt said the timing of Easter and Mother’s Day particularly affected its general merchandise sales, which fell 4%. This offset a 5% rise in sales of its Tu clothing range, while online groceries rose 7% and total convenience store sales were nearly 7% higher. The chain’s fourth-quarter sales fall left its annual comparable sales 0.6% lower after what has been an eventful year for the group. \nThe group said 11 of the Argos Digital Stores were opened in the fourth quarter alone, while it also now has eight Mini Habitat stores in its supermarkets. \nMr Coupe said customers were “responding well” to its new Argos ranges, with recent website and app improvements helping online sales grow. Sainsbury's was boosted by its acquisition of Argos - it is rolling out digital stores within a number of supermarkets Share", "external_links": [], "published": "2017-03-16T15:00:00.000+02:00", "crawled": "2017-03-16T11:00:05.955+02:00", "highlightTitle": ""}