{"organizations": [], "uuid": "33dea891b3840ee6842e2a4e4a4a01cb3154ed5b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30220834/15919294.jpg", "site_section": "http://www.middevongazette.co.uk/farming.rss", "section_title": "Devon Live Farming RSS feed", "url": "http://www.devonlive.com/home-bird-pam-is-beating-heart-of-holsworthy-s-rural-community/story-30220834-detail/story.html", "country": "GB", "title": "Home bird Pam is beating heart of Holsworthy's rural community", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "Home bird Pam is beating heart of Holsworthy's rural community", "spam_score": 0.0, "site_type": "news", "published": "2017-03-22T18:39:00.000+02:00", "replies_count": 0, "uuid": "33dea891b3840ee6842e2a4e4a4a01cb3154ed5b"}, "author": "AthwennaIrons", "url": "http://www.devonlive.com/home-bird-pam-is-beating-heart-of-holsworthy-s-rural-community/story-30220834-detail/story.html", "ord_in_thread": 0, "title": "Home bird Pam is beating heart of Holsworthy's rural community", "locations": [], "entities": {"persons": [{"name": "holsworthy", "sentiment": "none"}, {"name": "pam", "sentiment": "none"}, {"name": "kate bayley", "sentiment": "none"}, {"name": "sons", "sentiment": "none"}, {"name": "bradley", "sentiment": "none"}, {"name": "robyn", "sentiment": "none"}, {"name": "coodes", "sentiment": "none"}, {"name": "toby", "sentiment": "none"}, {"name": "peter peter", "sentiment": "none"}, {"name": "wright", "sentiment": "none"}, {"name": "pam johns", "sentiment": "none"}, {"name": "mark bailey", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}], "locations": [{"name": "bodmin street", "sentiment": "none"}, {"name": "holsworthy livestock market", "sentiment": "none"}, {"name": "penzance", "sentiment": "none"}, {"name": "bonsey", "sentiment": "none"}, {"name": "coodes", "sentiment": "none"}, {"name": "west devon", "sentiment": "none"}, {"name": "launceston", "sentiment": "none"}, {"name": "university of the west", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}, {"name": "cornwall", "sentiment": "none"}], "organizations": [{"name": "head of rural services", "sentiment": "none"}, {"name": "holsworthy livestock market", "sentiment": "none"}, {"name": "women's royal navy service", "sentiment": "none"}, {"name": "national community land trust network", "sentiment": "none"}, {"name": "head of rural services for coodes solicitors", "sentiment": "none"}, {"name": "agricultural law association", "sentiment": "none"}, {"name": "coodes solicitors", "sentiment": "none"}, {"name": "coodes' rural services", "sentiment": "none"}, {"name": "rural services", "sentiment": "none"}, {"name": "holsworthy community property trust", "sentiment": "none"}, {"name": "wrns", "sentiment": "none"}, {"name": "community land trust", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Home bird Pam is beating heart of Holsworthy's rural community By AthwennaIrons | Posted: March 22, 2017 0 COMMENTS SHARES Pam Johns, Head of Rural Services at Coodes Solicitors, can be found chatting to farmers at Holsworthy Livestock Market most weeks Home bird Pam is beating heart of Holsworthy's rural community X \nCopy link to paste in your message / Pam Johns, Head of Rural Services at Coodes Solicitors, can be found chatting to farmers at Holsworthy Livestock Market... Comments (0) \nWhen Holsworthy was being hit by foot and mouth disease in 2001, Pam Johns recalls decorating Coodes Solicitors' new Bodmin Street office in the town. \nDescribing a rally that was taking place in the town square while she painted, she remembers \"very dark days\" with a fire-pit on the edge of town. A \"Holsworthy girl, born and bred\", Pam is still saddened by the devastating effect foot and mouth had on the West Devon town she calls home. \nFor Pam, now Partner and Head of Rural Services for Coodes Solicitors, the beginning of the new millennium was also an exciting time. She recognised the potential for the expanding South West law firm to succeed in a town that has a thriving livestock market, four clearing house banks and serves a large rural community. \nBecoming a lawyer hadn't been Pam's original plan. The sporty daughter of a housewife and lorry driver for a local egg packing station originally had ambitions to join the WRNS – the Women's Royal Navy Service. After Pam reached the final interview stage, her father, who she was very close to, died suddenly. Pam did not feel able to leave her mother and eight-year-old brother so instead, in September 1980, took a job with Holsworthy law firm Peter Peter and Sons (now Peter Peter & Wright) as a trainee Legal Executive. \"I thought it would be stuffy old lawyers and stuffy old books,\" she says. \"But what struck me very early on was the people contact. You're helping someone get from A to B – to where they want to be. It just suited me.\" \nWhile studying for her legal examinations, as well as marrying and having her daughter, Robyn, Pam moved to Launceston firm Bradley and Bonsey where she worked in the property team. When Pam was starting to qualify as a Solicitor, the firm \"dropped a bombshell\" by telling her they had sold the business to Coodes. \nREAD NEXT: Devon family farm with 90-year history is offered for sale \nCoodes agreed to Pam completing her studies, including a year's sabbatical at the University of the West of England (UWE). Pam, who now also had her son, Toby, persuaded the firm to buy a legal practice from a retiring sole practitioner and open a new branch in her home town. Pam is clearly very proud of how the Holsworthy office has grown from those beginnings in 1998. Starting with just Pam and a Secretary, the office now has eight staff, all from local families. Two of her colleagues, Kate Bayley and Mark Bailey have, like Pam, been able to complete their qualifications as Solicitors whilst working for Coodes. \nAlongside leading the firm's growing Holsworthy office, Pam now heads Coodes' Rural Services team, which boasts five members of the Agricultural Law Association and experts in agricultural property, succession planning and partnership agreements. As well as advising clients from North and West Devon and throughout Cornwall right down to Penzance, Pam can be found at Holsworthy Livestock Market most Wednesday mornings. This keeps her in regular contact with the local agricultural community. It's an environment in which Pam clearly feels at home, having grown up among farming families and being married to a farmer for nearly 30 years. \nRemembering her rural childhood, she says \"Some things I miss, like the whole family and friends getting together and pitching the bales by hand and then going to supper when they were safely stacked in the hay shed. I mean it was blooming hard work but that sense of \"family\" and \"community\" has remained with me throughout my life.\" \nSpeaking of the issues facing local farmers today, she says: \"You see time and time again how resilient the farming community is. There was a very strong Brexit vote here. I think most farmers want more control of their own destiny and less dictate from on high. Yes, the basic payment entitlements will go from 2020 but everybody's got that in their minds and can work their business model accordingly. \nREAD MORE: Pig farmers welcome 'ground breaking' welfare report \n\"I think the agricultural community is getting better at organising itself and asking for what they want – like the dairy farmers campaigning for fairer milk prices. But they are going to have to be more engaged regionally and nationally to continue to get across the message that they are the right people to look after the countryside.\" \nThe foot and mouth outbreak also triggered Pam's longstanding commitment to and passion for the Community Land Trust movement. After being invited to join a group to address the need for local housing that was affordable for local people as part of the town's regeneration, Pam became a founding Trustee and Company Secretary for the Holsworthy Community Property Trust (HCPT). The Trust currently has 15 properties and aims to have 50 by 2020. Pam is also on the board of the National Community Land Trust Network, which has been instrumental in lobbying government for the new £60 million Community Fund. \nFor someone who had harboured ambitions of being paid to play hockey and travel the world with the WRNS, Pam is clearly committed to Holsworthy. \"There is some real deprivation here and the town is not without its problems but there is still a real community here,\" she says. \"If there is any adversity – and sadly we've experienced some in my own family with the sudden death of my father – people do come together.\" \nReflecting on the many advances in law and farming over the course of her 37 year career, Pam jokes: \"It could be a hologram of me sitting here in a few years' time.\" It seems unlikely that Pam could be so easily replaced. READ NEXT:", "external_links": [], "published": "2017-03-22T18:39:00.000+02:00", "crawled": "2017-03-23T04:23:53.013+02:00", "highlightTitle": ""}