{"organizations": ["Labour", "European Union", "EU", "Newcastle"], "uuid": "821bdaae4f425e9885042b9cea144d0f0aa5f9cd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article11446992.ece/ALTERNATES/s1200/JS92072924.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/gordon-brown-sage-gateshead-makes-11447074", "country": "GB", "title": "Gordon Brown at the Sage Gateshead makes the case for a positive, constructive Britain in Europe", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Gordon Brown at the Sage Gateshead makes the case for a positive, constructive Britain in Europe", "spam_score": 0.0, "site_type": "news", "published": "2016-06-08T23:55:00.000+03:00", "replies_count": 0, "uuid": "821bdaae4f425e9885042b9cea144d0f0aa5f9cd"}, "author": "Hannah Graham", "url": "http://www.chroniclelive.co.uk/news/north-east-news/gordon-brown-sage-gateshead-makes-11447074", "ord_in_thread": 0, "title": "Gordon Brown at the Sage Gateshead makes the case for a positive, constructive Britain in Europe", "locations": ["Britain", "North East", "Sage Gateshead", "Brexit", "Gateshead", "EU", "Europe", "Europe Gordon Brown", "Middle East"], "entities": {"persons": [{"name": "uniona", "sentiment": "none"}, {"name": "gordon brown", "sentiment": "none"}, {"name": "mr brown", "sentiment": "none"}, {"name": "hannah graham", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "albert einstein", "sentiment": "none"}, {"name": "brown", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "sage gateshead", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "europe gordon brown", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["Uniona", "Gordon Brown", "Mr Brown", "Hannah Graham", "Brexit", "Albert Einstein", "Brown"], "text": "Gordon Brown at the Sage Gateshead makes the case for a positive, constructive Britain in Europe 21:55, 8 Jun 2016 21:56, 8 Jun 2016 By Hannah Graham The former Prime Minister told an audience of Labour supporters the EU would protect jobs, workers rights, and security Shares The video will start in 8 s Cancel Click to play Tap to play The Live Event you are trying to watch is either unavailable or has not started Please refresh this page in your browser to reload this live event video \nFormer Prime Minister leader Gordon Brown took centre stage again this time in a European Union referendum event at a packed Sage Gateshead tonight. \nHe told an audience of Labour supporters how the EU had helped the North East recover from the “devastation” he said was inflicted by Tory Governments in the 1970s and 80s, and that the union would continue to “defend” the region into the future. \nOpening on a whimsical note with an anecdote about Albert Einstein, who he said had once travelled around Britain speaking about Europe giving the same speech everywhere he went, Mr Brown said he would be taking a different tactic, focusing on the issues the question of Brexit raised in the North East specifically. \n“I have always been grateful for the friendships I’ve had in this region,” he added. \nHe said that European cash had helped the North East to regenerate in the 1970s, 80s and 90s, while a Tory Government “chose not to see” the “despair and devastation” present in the region. \nHe said: “What stood between us and even worse devastation in the 1980s was European money, and it allowed some councils...like Newcastle...to do some restoration and some renovation.” \nSpeaking from a building which, he reminded his audience, had benefitted from EU funding, he said that future jobs for this region and for the whole country would come from being part of the European single market. \nVIEW GALLERY \nHe said: “If you’re thinking, where are the jobs going to come from in the next 10 years, I think they are going to come from the European Uniona and being part of the European single market.” \nMr Brown said that he believed the country could see a further 500,000 jobs being created over the next ten years if Britain stayed in Europe, in the digital economy and in renewable energy. \nHowever, he also focused on far more than the economic case against Brexit. \nAnd he insisted that the EU which had historically helped to introduce protection for workers was vital to continue to promote workers’ rights in the future. \nHe claimed that a Britain within Europe ought to be fighting to tackle the problem of zero-hours contracts, which he said could not be done without international cooperation. \nAnd he said that, without Europe, Conservative governments would have refused to offer workers the protections they currently enjoy. \n“Some members of the Tory party say they are defending the people of Britain from Europe, but sometime Europe is defending the British people from the Tory party,” he said. \nFormer Prime Minister Gordon Brown at the Sage in Gateshead to speak at a Labour in for Britain Rally \nThe former Labour leader said he wanted to set out a “positive” case for staying in the EU. \nHe said that Britain should aim to be “positive, constructive and leading in Europe”, and he claimed that staying in the union was the best way to achieve international cooperation and address pressing global issues. \nHe said that, as members of the EU, Britain would be better placed to tackle international terrorism and instability in the Middle East, and to address the problems caused by illegal immigration. \nAddressing the question of immigration, a major issue for Leave campaigners, he claimed that EU membership would actually help tackle excessive immigration, as it puts Britain in a better position to address the international conflicts and problems which drive high immigration. \nHe added that he felt Britain could play a more active role in the EU and push for action on international issues like the use of tax havens. \nWhile he said he wanted to change many current EU policies, particularly German austerity policies \nConcluding the event, organised by the Labour In For Britain, he said that Brexit supporters saw Britain as “inward-looking”, but, that instead he wanted to push for an “internationally-minded” Britain which was active on a global stage. \nHe said: “What message would we send to the rest of the world, we who aim to be internationally-minded, if we were to break away, even from our closest neighbours?” The European Union debate", "external_links": [], "published": "2016-06-08T23:55:00.000+03:00", "crawled": "2016-06-09T00:18:01.281+03:00", "highlightTitle": ""}