{"organizations": ["Leicestershire", "Labour", "European Union", "Parliament", "Leicester Lib Dem", "Brexit", "EU", "Leicestershire County Council", "UKIP"], "uuid": "bcef11851f9ba739acb6a2aa31b8b80d2ab70728", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/29440463/14671126.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/assessing-the-aftermath-leicestershire-s-politicians-on-brexit/story-29440463-detail/story.html", "country": "US", "domain_rank": 48128, "title": "The aftermath - Leicestershire's politicians on momentous Brexit vote | Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "The aftermath - Leicestershire's politicians on momentous Brexit vote | Leicester Mercury", "spam_score": 0.001, "site_type": "news", "published": "2016-06-24T17:41:00.000+03:00", "replies_count": 0, "uuid": "bcef11851f9ba739acb6a2aa31b8b80d2ab70728"}, "author": "", "url": "http://www.leicestermercury.co.uk/assessing-the-aftermath-leicestershire-s-politicians-on-brexit/story-29440463-detail/story.html", "ord_in_thread": 0, "title": "The aftermath - Leicestershire's politicians on momentous Brexit vote | Leicester Mercury", "locations": ["Britain", "Leicester East", "East Midlands", "Rutland", "Leicestershire", "Brexit", "Leicester", "Brexit - LIVE  Leicester South", "UK", "Europe"], "entities": {"persons": [{"name": "keith vaz", "sentiment": "none"}, {"name": "david cameron", "sentiment": "none"}, {"name": "jon ashworth", "sentiment": "none"}, {"name": "andrew bridgen", "sentiment": "none"}, {"name": "zuffar haq", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "nick rushton", "sentiment": "none"}, {"name": "david sprason", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "leicester east", "sentiment": "none"}, {"name": "east midlands", "sentiment": "none"}, {"name": "rutland", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "brexit - live  leicester south", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}], "organizations": [{"name": "leicestershire", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "leicester lib dem", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "leicestershire county council", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["Keith Vaz", "David Cameron", "Jon Ashworth", "Andrew Bridgen", "Zuffar Haq", "Brexit", "Nick Rushton", "David Sprason"], "text": "The aftermath - Leicestershire's politicians on momentous Brexit vote By danjmartin | Posted: June 24, 2016 0 COMMENTS SHARES The aftermath - Leicestershire's politicians on momentous Brexit vote X \nCopy link to paste in your message / \nPoliticians across Leicestershire have been assessing the aftermath of Britain's historic decision to split from the European Union. \nEight of nine voting areas locally declared for Leave with just Leicester city itself narrowly backing Remain. \nIn total some 300,500 voters in the city, county and Rutland chose Brexit with 251,275 backing Remain. \nNorth West Leicestershire Tory Andrew Bridgen, the lead Vote Leave MP for the East Midlands, said: \"The fact that people were not cowed by Project Fear is very pleasing. \n\"I am very proud of voters. \n\"This shows that while there is plenty of affection for Europe, there is little love for the EU.\" \n\"The process of achieving Brexit will be slow protracted and deliberate so it can be done carefully. \n\"The financial turmoil we have seen will settle down in a few days. \n\"It has been triggered by traders backing the wrong side but you can guarantee someone is making a lot of money from this.\" \nRead more: UK votes to leave European Union with Leicestershire overwhelmingly backing Brexit - LIVE \nLeicester South MP Jon Ashworth said he felt 'absolutely devastated' as the results began to indicate a Leave victory. \nHe said: \"That's because I spoke to people in Leicester who were worried about the period of uncertainty we are now facing with their jobs. \n\"And we have seen billions wiped off the financial markets. \n\"What we need to do now is unite as a city. \n\"I am pleased that there appears to have been a good turn-our for Remain in my own constituency. \n\"That is the sense I got on the doorstep and even though I did not like the overall result I am a democrat and accept it. \n\"I will do my utmost to help unify the city which is clearly divided. \nThe shadow cabinet said he could foresee a General election within the next five months in the aftermath of the Brexit vote. \nRead more: Prime minister David Cameron announces he will quit in wake of Brexit defeat \nLeicester East MP Keith Vaz was visibly shocked that at the Brexit victory and concerned the city voted Remain by just two per cent. \nHe said: \"Frankly, in a thousand years I would never have believed that the British people would have voted this way. \n\"And they have done so and I think that they voted emotionally rather than looking at the facts. \n\"It'll be catastrophic for our country, for the rest of Europe and indeed the world.\" \nHe added: \"The issues of immigration are extremely important, if you look at the campaign I think that there needed to be a much stronger campaign to stay in. \n\"The Leave campaigners were prepared to indulge in hand-to-hand combat, in local constituencies. \n\"They (voters) rejected the advice of all the experts, they rejected the arguments that had been put forward by almost everyone in Parliament. \n\"I mean those who are going to vote against this were in the minority, and the country has accepted it - they have rejected everything that's been put before them, it's very upsetting and very crushing.\" \nLeicester Lib Dem activist Zuffar Haq blamed Labour locally and nationally for the poor Remain vote. \nHe said: \"Remain won in Leicester by only 3,000 votes. \n\"It should have been tens of thousands. Labour left this city with no leadership. People didn't know what the Labour party was fighting for. \n\"They are responsible.\" \nPro-Remain Tory Conservative Leicestershire County Council leader Nick Rushton said: \"We need to respect the referendum result. \n\"It is important that everyone pulls together, whether they are politicians or in the community. \n\"I will do all I can to make sure that constitutional and other changes reflect the interests of the people of Leicestershire. \n\"I have had the pleasure of meeting the Prime Minister and think he has done a good job for the country, not least in giving people the chance to vote in the referendum. \n\"I think he has done the honourable thing in making clear his position now.\" \nUKIP county councillor David Sprason said: \"This is a fantastic result. \n\"The British public were offered an opportunity and the took it. \n\"This is just the start for UKIP. \n\"We have to make sure Brexit is delivered and that the future of Britain is safeguarded.\" ", "external_links": [], "published": "2016-06-24T17:41:00.000+03:00", "crawled": "2016-06-24T17:37:38.277+03:00", "highlightTitle": ""}