{"organizations": [], "uuid": "57cfe23f6b0b9bc86809cf426fb2c5feae49ae18", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article11524070.ece/ALTERNATES/s1200/JS93392259.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/news-opinion/take-back-control-fear-lost-11524072", "country": "GB", "domain_rank": 21960, "title": "Take back control? I fear we lost control of our senses", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Take back control? I fear we lost control of our senses", "spam_score": 0.0, "site_type": "news", "published": "2016-06-24T23:53:00.000+03:00", "replies_count": 0, "uuid": "57cfe23f6b0b9bc86809cf426fb2c5feae49ae18"}, "author": "Kate Thick", "url": "http://www.chroniclelive.co.uk/news/news-opinion/take-back-control-fear-lost-11524072", "ord_in_thread": 0, "title": "Take back control? I fear we lost control of our senses", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Take back control? I fear we lost control of our senses 21:53, 24 Jun 2016 Kate Thick on how the Brexit vote may have delighted Donald Trump and Vladimir Putin - but it is a nightmare for us Shares Get daily news by email Stefan Rousseau/PA Wire Exchange rates displayed at a currency exchange in London after Britain voted to leave the European Union in an historic referendum which has thrown Westminster politics into disarray and sent the pound tumbling on the world markets \nThe pound has plunged to a 30-year low and so have my spirits. \nIt will be a long, messy divorce. Whatever legal and financial deals are negotiated, it will tie up resources for years to come. \nWe face economic and political mayhem at a time when the number of working poor is growing due to high house prices (well at least they might fall now), low productivity, austerity and a shortage of full-time jobs. \nI am no fan of Tory fiscal policies but the prospect of the likes of Farage, Johnson and Gove taking the helm is terrifying; they will need the advice of the experts they so scorn. \nVoters felt the economy did not work for them. The government can only blame itself; you cannot foster alienation without consequences. Westminster was the target as much as Brussels. \nThe Leave vote was strongest in places like the North East, once heavily industrialised, whose denizens concluded the gamble was worth taking. Well, wave goodbye to the £2.5bn from the EU Social Fund financing charities and community centres, and the £2.9bn funding from the EU Regional Development Fund for starting businesses. \nUnless economic growth returns quickly after Brexit, there will be many calls on the £8bn saving from our annual EU contribution which might not prove enough to prevent further deterioration in health and social care. \nWe have splintered the world’s largest political union and trading bloc, an $18 trillion economy. It will make less sense now for, say, a Japanese car-maker to locate a factory - one eyeing to sell into Europe - in the North East if you could be in Germany. Why come to post-Brexit Britain where there could soon be the hassle of visas and tariffs? \nThere will be a shift in how we are seen by the rest of the world. The EU’s flaws do not justify its destruction which is what we may have just triggered. The UK is the world’s fifth-largest economy and has remained one of its most powerful nations, because of EU membership. We risk becoming an offshore oddball. \nWho do we entrust with the arduous negotiations over what aspects of the vast edifice of UK entanglement with European law, finance, criminal justice cooperation, trade and diplomacy we unravel, not to mention the constitutional wrangling implicit in Scotland’s endorsement of EU membership? \nThe question is whether these negotiators will produce something better than Britain had in the EU. \nThe priority for the rest of the EU will be to ensure no other country follows Britain’s example which could preclude giving Britain a good deal. The EU cannot allow Britain full access to the single market without its obligations lest others ask for similar treatment. And Germany cannot offer Britain anything on its own, however strongly its carmakers push for it; any deal must be approved by all 27 countries, several of which do little trade with Britain. Although both sides have a lot to lose, it will be one against 27. \nThe other option for Britain is to revert to trading with the EU as America, China and India do, under normal World Trade Organisation rules but most economists say this may make the economic damage from Brexit worse. It would bring back mutual tariffs on cars, pharmaceuticals, food and fish. \nIt would reinstate many non-tariff barriers and exclude most services, including financial services. \nI can understand giving an adolescent two fingers to the establishment but what we have achieved is cutting our nose off to spite our face; we could be poorer and weaker for this week’s dismal decision. \nThe Leave slogan said Britain should “take back control”; I fear we lost control of our senses. \nTrump, Putin and Europe’s far-right parties are delighted. Austria has just dodged a bullet in its presidential election but leaders like Hungary’s Orban and Poland’s Kaczynski speak openly of building “illiberal” democracy, one without essential checks and balances on executive power, including protection for human rights. \nWill Brexit ignite a rethink and a reorganisation of society from the bottom-up rather than the top-down? Do you think Gove, Johnson and Farage will agree to that, or that they really care about us up North? More on the EU Referendum", "external_links": [], "published": "2016-06-24T23:53:00.000+03:00", "crawled": "2016-06-25T00:29:31.146+03:00", "highlightTitle": ""}