{"organizations": ["Labour", "Royal Shakespeare Company", "Tories", "ISIS", "EU"], "uuid": "c5f911042e95e474bad8209b5831cc9647145b12", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article11427490.ece/ALTERNATES/s1200/JS91602340.jpg", "site_section": "", "section_title": "", "url": "http://www.chroniclelive.co.uk/news/north-east-news/david-cameron-missed-tories-no-11427487", "country": "IE", "domain_rank": 21960, "title": "Why David Cameron will be missed by the Tories if he is no longer leader - Mike Kelly - Chronicle Live", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 0, "title_full": "Why David Cameron will be missed by the Tories if he is no longer leader - Mike Kelly - Chronicle Live", "spam_score": 0.0, "site_type": "news", "published": "2016-06-05T11:30:00.000+03:00", "replies_count": 0, "uuid": "c5f911042e95e474bad8209b5831cc9647145b12"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/david-cameron-missed-tories-no-11427487", "ord_in_thread": 0, "title": "Why David Cameron will be missed by the Tories if he is no longer leader - Mike Kelly - Chronicle Live", "locations": ["EU"], "entities": {"persons": [{"name": "kate garraway", "sentiment": "none"}, {"name": "david cameron", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "mike kelly", "sentiment": "none"}, {"name": "faisal islam", "sentiment": "none"}, {"name": "cameron", "sentiment": "none"}, {"name": "david cameron  any", "sentiment": "none"}, {"name": "daniel", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "none"}, {"name": "royal shakespeare company", "sentiment": "none"}, {"name": "tories", "sentiment": "none"}, {"name": "isis", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["Kate Garraway", "David Cameron", "Brexit", "Mike Kelly", "Faisal Islam", "Cameron", "David Cameron  Any", "Daniel"], "text": "Why David Cameron will be missed by the Tories if he is no longer leader 08:30, 5 Jun 2016 Tory leader is on the ropes due to the EU referendum campaign but if he is forced out it will be a loss to his party Shares Get daily news by email Daniel Leal-Olivas/PA Wire Prime Minister David Cameron \nAny more EU referendum grief and David Cameron’s head will explode, judging by his recent TV appearances. \nFirst, he got shirty on the Sky TV debate with the audience as well as the presenter Faisal Islam. \nThen the day after on Good Morning Britain he got snippy with presenter Kate Garraway. \nIf I was being a contrarian, at this point I should be expressing an iota of sympathy for his discomfiture to prove what an all round good guy I am. Not a chance. \nIt being a bust up over the EU, the German phrase schadenfreude leaps quickly to mind. \nAt last, his chickens are coming to roost as the protection of his previous media minders has been stripped away as they are for the Brexit campaign and we are now seeing him in all his political glory. It is not an edifying sight. \nCameron has no real political heart and no set of values he sticks to for more than a few months. He acts purely on instinct, an instinct to win at any cost. It’s why his ‘journey’ as PM has seen him play more characters than a lifelong member of the Royal Shakespeare Company. \nThis instinct saw him promise before the last general election the Tories would offer an EU referendum if they won. \nIt was done to steal the thunder of UKIP as at the time he figured a second coalition was on the way and the EU referendum promise was one policy the Tories could ditch post election at the negotiating table. \nHis dilemma today reveals the problem with acting instinctively is you don’t have time to weigh up the consequences. \nNor did he weigh up the consequences when for the EU campaign he went back to the Tory election campaign play book, replacing Labour with Brexit, and saying such a choice would bring the economy to its knees, lose jobs, hit us in the pocket and have us overrun by ISIS. \nThis time his message crashed and burned because his messengers in the media had a very different one of their own to promote. \nWhichever way the referendum goes Cameron could well be on his bike, barring a surprisingly large Remain victory. But I would say to his party, be careful what you wish for. \nFor while I feel nothing but contempt for his policies and what he has come to stand for, I’m not so stupid as to ignore his political qualities of keeping a fractious Tory party together and being a better frontman than those now jostling for position in the leadership race. Without him, they’ll struggle. ", "external_links": [], "published": "2016-06-05T11:30:00.000+03:00", "crawled": "2016-06-05T11:55:28.577+03:00", "highlightTitle": ""}