{"organizations": ["Labour", "EU", "Labour Party", "NHS"], "uuid": "67758a818ec3232964c8efa2a53dd3cf79741da5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.liverpoolecho.co.uk/incoming/article11528636.ece/ALTERNATES/s1200/12422762-1.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/challenge-jeremy-corbyn-brewing-before-11530563", "country": "GB", "domain_rank": 21960, "title": "The challenge of Jeremy Corbyn was brewing before he was even elected - the writing was on the wall", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "The challenge of Jeremy Corbyn was brewing before he was even elected - the writing was on the wall", "spam_score": 0.0, "site_type": "news", "published": "2016-06-27T14:20:00.000+03:00", "replies_count": 0, "uuid": "67758a818ec3232964c8efa2a53dd3cf79741da5"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/challenge-jeremy-corbyn-brewing-before-11530563", "ord_in_thread": 0, "title": "The challenge of Jeremy Corbyn was brewing before he was even elected - the writing was on the wall", "locations": ["Britain", "Syria", "Brexit", "UK", "EU", "London"], "entities": {"persons": [{"name": "jeremy corbyn", "sentiment": "none"}, {"name": "benn", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "ian murray", "sentiment": "none"}, {"name": "kerry mccarthy", "sentiment": "none"}, {"name": "lucy powell", "sentiment": "none"}, {"name": "jamie reed", "sentiment": "none"}, {"name": "lilian greenwood", "sentiment": "none"}, {"name": "copeland", "sentiment": "none"}, {"name": "seema malhotra", "sentiment": "none"}, {"name": "vernon coaker", "sentiment": "none"}, {"name": "karl turner", "sentiment": "none"}, {"name": "heidi alexander", "sentiment": "none"}, {"name": "gloria de piero", "sentiment": "none"}, {"name": "hilary benn", "sentiment": "none"}, {"name": "falconer", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["Jeremy Corbyn", "Benn", "Corbyn", "Ian Murray", "Kerry McCarthy", "Lucy Powell", "Jamie Reed", "Lilian Greenwood", "Copeland", "Seema Malhotra", "Vernon Coaker", "Karl Turner", "Heidi Alexander", "Gloria De Piero", "Hilary Benn", "Falconer"], "text": "The video will start in 8 s Cancel Click to play Tap to play The Live Event you are trying to watch is either unavailable or has not started Please refresh this page in your browser to reload this live event video \nThe only people who believe the Jeremy Corbyn leadership challenge stemmed from his poor performance on the EU campaign trail are those who also believe there will be an NHS cash windfall post Brexit from freed up European cash. \nNaive people who on the one side also think immigration will drop once we officially leave the EU and on the other think the UK will not survive Brexit. It has survived much worse. \nThe challenge of Corbyn has been brewing since even before he was elected last September when crowds flocked to hear him speak, party membership rocketed and the expected runners and riders for the top job saw it slipping through their fingers. \nIt was actually Copeland MP Jamie Reed who started the present leadership challenge eight months ago when he tweeted his resignation from the Shadow Cabinet as Corbyn made his victory speech. \nSeldom has a week gone by since then without rumblings of fresh discontent about Corbyn’s performance at PMQs, his dress sense and not singing the national anthem, to name but a few gripes. \nThen last December the ‘Corbyn out’ campaign shifted gears when Hilary Benn delivered a memorable speech in the Commons calling for more military action in Syria after his leader delivered a less memorable one calling for the opposite. Labour Party leader Jeremy Corbyn leaves his home in north London \nBenn was quickly labelled the next Labour leader in waiting and it was the sacking of Benn from his post as Shadow Foreign Secretary over the weekend which set the ball rolling. \nBy Monday morning there were a series of ‘heavy hearted’ resignation letters of a similar ilk describing Corbyn as a decent man who wasn’t up to the job of winning the next election. \nThose submitting their resignations claim to be doing it for the greater good of the party, the question must be asked which party? The party whose membership voted overwhelmingly for Corbyn - or another ill defined one? \nCorbyn was elected by a huge majority, gathering 59.5% of the entire vote while more than 200,000 people joined the Labour party during his campaign. \nNot the right kind of people, those who opposed to him seem to say. But Corbyn must either stand down or be voted out by the party members who chose him in the first place. Members of Jeremy Corbyn's shadow cabinet who have resigned (top row, left to right) Ian Murray, Gloria De Piero, Kerry McCarthy, Heidi Alexander and Lord Falconer. (bottom row, left to right) Lucy Powell, Lilian Greenwood, Seema Malhotra, Vernon Coaker and Karl Turner \nIf he is ousted in a ‘no confidence’ vote by his parliamentary colleagues despite the party members maintaining their confidence in him, it can have serious consequences. \nThere are already uncomfortable parallels between the Labour leadership challenge and the reaction to the recent EU referendum. \nDespite 52% of the country voted for Leave there is much talk of finding ways of overturning that result despite it being the will of the majority of the people who voted. \nIf there is any serious attempt to change the result would lead us into much more dangerous territories than Brexit itself. \nIt could be saying the voice of the people of Britain is nothing to that of a narrow, self seeking Westminster elite. More on the EU Referendum", "external_links": [], "published": "2016-06-27T14:20:00.000+03:00", "crawled": "2016-06-27T14:50:25.722+03:00", "highlightTitle": ""}