{"organizations": ["Cabinet", "Labour", "Berwick", "European Union", "Parliament", "Foreign Office", "Sunderland", "Labour Party", "EU", "Newcastle", "NHS"], "uuid": "33270c28f9cb4281f7264ee14d191b816f383939", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article11509470.ece/ALTERNATES/s1200/JS93201954.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/what-happens-leave-eu-following-11518277", "country": "GB", "domain_rank": 21960, "title": "What happens if we leave the EU following the referendum?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "What happens if we leave the EU following the referendum?", "spam_score": 0.0, "site_type": "news", "published": "2016-06-24T04:33:00.000+03:00", "replies_count": 0, "uuid": "33270c28f9cb4281f7264ee14d191b816f383939"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/what-happens-leave-eu-following-11518277", "ord_in_thread": 0, "title": "What happens if we leave the EU following the referendum?", "locations": ["EU", "Lab West Bromwich East", "Britain", "Northumberland", "England", "Europe", "UK", "Germany", "North East England"], "entities": {"persons": [{"name": "geoff", "sentiment": "none"}, {"name": "anne-marie trevelyan", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "gisela stuart", "sentiment": "none"}, {"name": "george osborne", "sentiment": "none"}, {"name": "cameron", "sentiment": "none"}, {"name": "tom watson", "sentiment": "none"}, {"name": "johnson", "sentiment": "none"}, {"name": "david cameron", "sentiment": "none"}, {"name": "david cameron david cameron", "sentiment": "none"}, {"name": "watson", "sentiment": "none"}, {"name": "boris johnson", "sentiment": "none"}, {"name": "osborne", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "lab west bromwich east", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "north east england", "sentiment": "none"}], "organizations": [{"name": "cabinet", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "berwick", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "foreign office", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["Geoff", "Anne-Marie Trevelyan", "Theresa May", "Gisela Stuart", "George Osborne", "Cameron", "Tom Watson", "Johnson", "David Cameron", "David Cameron David Cameron", "Watson", "Boris Johnson", "Osborne"], "text": "What happens if we leave the EU following the referendum? 02:33, 24 Jun 2016 What would actually happen if we vote for Brexit Shares The video will start in 8 s Cancel Click to play Tap to play The Live Event you are trying to watch is either unavailable or has not started Please refresh this page in your browser to reload this live event video \nOn Thursday the nation went to the polls to decide the UK’s future in the European Union . \nThe poll was described as a once in a lifetime vote which could change the course of Britain’s future. But what will happen if we vote to leave the EU? \nIt won’t happen immediately. \nJust because we vote to leave the EU doesn’t mean we’re out of it. The referendum is an instruction (or strictly speaking, just advice) to the Government, which would need to start the complex legal process of getting us out. This could take at least two years. \nIt would mean invoking Article 50 of the Lisbon Treaty, the clause that allows nations to leave the EU . The actual terms of that exit would take several years to negotiate. \nThe government - and Parliament - would need to determine what it wants to do once we have left and what kind of trading agreements we want with the EU and other places. EU Referendum LIVE: Newcastle and Sunderland declare results - is UK heading for Brexit? But the economy might suffer straight away \nAlthough Leave campaigners insist there will be no economic shock to Britain, the vast majority of economists, including the Bank of England, predict that there will be - both immediately and in the longer term. \nEven as the votes were being counted, we saw the value of the pound fall. \nIf the stock exchange falls, that reduces the value of pension funds. \nBut George Osborne, the Chancellor, could decide to close the stock markets for a few days until things calm down. \nIn the long term, a weaker pound would push up the price of imported goods, but it would actually make UK goods cheaper for foreign buyers. In other words, it could make it easier for UK firms to export goods. Geoff Caddick/PA Wire Prime Minister David Cameron David Cameron may have to resign \nDavid Cameron personally led the Remain campaign and made a number of visits across the country. \nIf we vote to leave, Mr Cameron may be forced to resign. \nMPs who backed the Remain campaign published a letter as the votes were being counted, insisting the Prime Minister had a “duty” to stay in office however the country voted. \nThey included Anne-Marie Trevelyan, Conservative MP for Berwick in Northumberland . \nBut Tory “leave” campaigners were also said to be angry about what Mr Cameron’s tactics during the campaign - particularly what they saw as his decision to authorise a series of personal attacks on Boris Johnson. \nThere was even more anger towards George Osborne, the Chancellor, who threatened to introduce a “punishment budget” putting up taxes if the country votes to leave. \nMr Osborne could move to a different department, possibly the Foreign Office, in a Cabinet reshuffle. Also read: How long would it take to leave the EU if we vote for a Brexit? A leave vote would also be a problem for Labour \nThe result also led to concern within the Labour Party, after many voters in Labour heartlands such as the towns and cities of North East England voted to Leave in EU. \nTom Watson (Lab West Bromwich East), Labour’s Deputy Leader, urged Prime Minister David Cameron to heal the “divisions” revealed by the referendum campaign. \n“At some points we’ve been slipping into intolerance,” he said. \nAnd Mr Watson said many people felt they had not shared in the benefits of the economic growth which the UK has enjoyed over the past 30 years. Stefan Rousseau/PA Wire Boris Johnson Who could replace David Cameron? \nBoris Johnson is clearly angling for the job, but other contenders include Theresa May, the Home Secretary. \nIn the longer term, Tory Leave campaigners including Mr Johnson have promised to use our new-found independence to introduce a raft of measures, including cutting VAT on fuel and investing the extra cash we have back from our membership in the NHS and other public services. \nBut if the economy stalls, they probably won’t be able to keep these promises. What would happen to EU immigrants in the EU? \nThere’s been speculation that existing EU migrants in the EU would be forced to leave. \nBut this is unlikely. Quitting the EU would allow a British government to impose controls on immigration from EU countries- but it wouldn’t force us to do that. It would simply give us the choice. \nAnd it certainly wouldn’t force any government to deport people who are already here. \nPeople from EU countries who are living and working in the UK came here legally, under the rules that existed when they arrived. They wouldn’t have to leave. \nNo Government is going to tell British businesses who currently have staff from other parts of the Europe that they have to lose their staff. \nMP Gisela Stuart, chair of the Leave campaign and herself a migrant from Germany, points out that the Leave campaign has never talked about deporting people. More on the EU Referendum", "external_links": [], "published": "2016-06-24T04:33:00.000+03:00", "crawled": "2016-06-24T05:22:12.219+03:00", "highlightTitle": ""}