{"organizations": [], "uuid": "616e88741575a674c31685db291b880103113868", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article11522031.ece/ALTERNATES/s1200/JS93395447.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/brexit-everything-you-need-know-11521619", "country": "GB", "domain_rank": 21960, "title": "Brexit: Everything you need to know about Britain's EU exit and what happens now", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Brexit: Everything you need to know about Britain's EU exit and what happens now", "spam_score": 0.0, "site_type": "news", "published": "2016-06-24T16:55:00.000+03:00", "replies_count": 0, "uuid": "616e88741575a674c31685db291b880103113868"}, "author": "Craig Thompson", "url": "http://www.chroniclelive.co.uk/news/north-east-news/brexit-everything-you-need-know-11521619", "ord_in_thread": 0, "title": "Brexit: Everything you need to know about Britain's EU exit and what happens now", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sick of Brexit talk already? Here's our easy to follow guide to everything that's happened so far - and what might still happen Shares Get daily news by email Christopher Furlong/Getty Images A European Union flag, with a hole cut in the middle, flies at half-mast outside a home in Knutsford Cheshire after today's historic referendum on June 24, 2016 in Knutsford, United Kingdom \nWe are out - but what has actually happened - and what will happen now? \nThis is our easy-to-follow guide to Britain’s EU exit. What has just happened? \nOn Thursday we voted in a referendum to decide whether the UK should leave or remain in the European Union. \nLeave won by 52% to 48%. \nThe referendum turnout was 71.8%, with more than 30 million people voting. It was the highest turnout in a UK-wide vote since the 1992 general election. That means 28% of people opted, or couldn’t vote, for one reason or another. What exactly is the EU then? \nWell, it’s supposed to be a coming together of 28 different European countries to help make trade and cooperation easier. \nOver time, this grew into the so-called “single market” which basically allowed the free movement of goods - and people. Who voted to remain and who voted to leave? \nBasically, England voted strongly for Brexit, by 53.4% to 46.6%, as did Wales, with Leave getting 52.5% of the vote and Remain 47.5%. \nOn the other hand, Scotland and Northern Ireland both backed staying in the EU. Scotland backed Remain by 62% to 38%, while 55.8% in Northern Ireland voted Remain and 44.2% Leave. What’s going to happen now we’ve left. Stefan Rousseau/PA Wire UKIP Leader Nigel Farage \nGood question. And hard to answer. \nEU law still stands across the UK until it ceases being a member and this could take some time. \nThere are then two routes to leaving - one is through negotiation between the UK and the EU, and the other is that there is no agreement and the UK ceases to be a member two years from notifying the EU it intends to leave. \nDuring that time Britain will not take part in any decision-making, as it negotiates a withdrawal agreement and the terms of its relationship with its European neighbours. What is all this talk about a referendum in Scotland? \nOn the whole, Scotland voted to stay in the EU on Thursday. \nScottish First Minister Nicola Sturgeon says the country faces being taken out of the EU when it voted to Remain. \nA second independence referendum for Scotland is now “highly likely”, she has said. And the Northern Ireland issue? \nAgain Northern Ireland backed the EU on Thursday. \nDeputy First Minister Martin McGuinness said the impact in Northern Ireland would be “very profound” and that the whole island of Ireland should now be able to vote on reunification. \nBut First Minister Arlene Foster said this would not happen. Can we re-join if everything goes pear-shaped? Nigel Farage \nCould be tough. \nEvery member state would have to agree to the UK re-joining. And they might not be up for that after Thursday’s snub. \nPlus, new members are required to adopt the Euro as their currency, and we already opted out of that one. Have any other EU members opted to leave? \nNo. We are the first. \nGreenland, one of Denmark’s overseas territories, held a referendum in 1982, after gaining a greater degree of self government, and voted by 52% to 48% to leave, which it did after a period of negotiation. What were their reasons for wanting the UK to leave? \nSome people argued the EU imposed too many rules on business and charged billions of pounds a year in membership fees for little in return. \nConcerns were also raised about free movement over borders and high levels of immigration. \nOne of the main principles of EU membership is “free movement”, which means you don’t need to get a visa to go and live in another EU country. More on the EU Referendum", "external_links": [], "published": "2016-06-24T16:55:00.000+03:00", "crawled": "2016-06-24T17:46:41.137+03:00", "highlightTitle": ""}