{"organizations": ["EU", "Nissan", "Nissan-Renault", "Durham", "Society of Motor Manufacturers", "Durham University Business School"], "uuid": "bfe0b5b4cce8fdf898ef7af0ebb4b774f3f2856e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article11082960.ece/ALTERNATES/s1200/JS85666692.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/nissan-staying-silent-eu-vote-11523240", "country": "GB", "domain_rank": 21960, "title": "Nissan staying silent on EU vote - with impact likely to take years", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Nissan staying silent on EU vote - with impact likely to take years", "spam_score": 0.0, "site_type": "news", "published": "2016-06-24T18:57:00.000+03:00", "replies_count": 0, "uuid": "bfe0b5b4cce8fdf898ef7af0ebb4b774f3f2856e"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/nissan-staying-silent-eu-vote-11523240", "ord_in_thread": 0, "title": "Nissan staying silent on EU vote - with impact likely to take years", "locations": ["Nissan UK", "Sunderland", "Europe", "UK", "EU"], "entities": {"persons": [{"name": "jun", "sentiment": "none"}, {"name": "graeme whitfield", "sentiment": "none"}, {"name": "ghosn", "sentiment": "none"}, {"name": "mike hawes", "sentiment": "none"}, {"name": "christos tsinopoulos", "sentiment": "none"}, {"name": "carlos ghosn", "sentiment": "none"}], "locations": [{"name": "nissan uk", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}, {"name": "nissan-renault", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "society of motor manufacturers", "sentiment": "none"}, {"name": "durham university business school", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["Jun", "Graeme Whitfield", "Ghosn", "Mike Hawes", "Christos Tsinopoulos", "Carlos Ghosn"], "text": "Nissan staying silent on EU vote - with impact likely to take years 16:57, 24 Jun 2016 16:57, 24 Jun 2016 By Graeme Whitfield Nothing is likely to happen at the plant in the short term, but fears have been expressed for future investment Shares Get business news by email Qashqai production at Nissan's Sunderland plant \nCAR giant Nissan was staying silent on the EU referendum result today - and the full impact on its plant in Sunderland is not likely to be known for some time. \nThe Japanese company, which employs around 6,700 on Wearside and supports 30,000 more jobs in its supply chain, had backed the Remain side in February when chairman and CEO Carlos Ghosn released a statement saying that “our preference as a business is, of course, that the UK stays within Europe”. \nAfter that statement, the firm stayed out of the public debate until earlier this week when it said it would take legal action against Vote Leave over the use of its company logo on referendum literature. \nThe silence coming from the plant today signals that there is little likely to change at Sunderland in the near future. The factory is one of the most productive in the world and only received its latest multi-million investment in January. \nBut the impact could be felt next time a decision is being made on the production of a new model, with the Sunderland factory having to compete with plants on the continent that are part of the Nissan-Renault alliance and would offer easier access to the continental market. \nMr Ghosn’s February statement hinted at this, saying: “We obviously want the Nissan UK plant and engineering center to remain as competitive as possible when compared with other global entities, and each future investment opportunity will be taken on a case by case basis, just as it is now.” \nMike Hawes, chief executive of the Society of Motor Manufacturers and Traders, called for the Government to act to reduce any harm to the industry, saying: “The Government must now maintain economic stability and secure a deal with the EU which safeguards UK automotive interests. \n“This includes securing tariff-free access to European and other global markets, ensuring we can recruit talent from the EU and the rest of the world and making the UK the most competitive place in Europe for automotive investment.” \nAnd there have been warnings too that the long-term future of supply chains in areas like the car industry could also been affected. \nChristos Tsinopoulos, senior lecturer in operations and project management at Durham University Business School, said: “Brexit repercussions for the UK manufacturing industry will be questioned by many over the next few weeks and months. What we do know is that the integration across a supply chain is king. \n“Research conducted by Durham and others demonstrates how a closely integrated supply chain, where there is an easy exchange of ideas and information, is likely to perform better. Supply chains know this and over the years there have been several efforts to bring manufacturers closer together. \n“However, the key point here is that to make this happen there needs to be a degree of standardisation in legislation, systems, policies, and even engineering methods. Over the last few years this has largely been facilitated by several European bodies. \n“Many have been guided by the EU whereas others have been industry led. The result has been some highly integrated and efficient supply chains which have benefited many of us. \n“The good news here is that given the high degree of integration of many of them they are relatively difficult to change in the short term. \n“The bad news however is that in the medium and longer term there would be a higher incentive to do so. In a competitive environment where small changes can have significant impact on performance and relationships, switching between supply chains and countries may become an increasingly popular choice.” More on the EU Referendum", "external_links": [], "published": "2016-06-24T18:57:00.000+03:00", "crawled": "2016-06-24T19:18:16.440+03:00", "highlightTitle": ""}