{"organizations": ["Durham University’s Law School", "European Parliament", "European Union", "Parliament", "Durham University", "EU"], "uuid": "a3f0acc03e2656f9065ce1665d3b9ddff5e8972c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article11241933.ece/ALTERNATES/s1200/JS55644151.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/eu-referendum-immigration-could-go-11486205", "country": "GB", "domain_rank": 21960, "title": "EU Referendum: Why immigration could go up if we vote to go it alone", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "EU Referendum: Why immigration could go up if we vote to go it alone", "spam_score": 0.0, "site_type": "news", "published": "2016-06-17T13:30:00.000+03:00", "replies_count": 0, "uuid": "a3f0acc03e2656f9065ce1665d3b9ddff5e8972c"}, "author": "Thom Brooks", "url": "http://www.chroniclelive.co.uk/news/north-east-news/eu-referendum-immigration-could-go-11486205", "ord_in_thread": 0, "title": "EU Referendum: Why immigration could go up if we vote to go it alone", "locations": ["Britain", "America", "Greece", "Dublin", "Australia", "UK", "EU", "Italy"], "entities": {"persons": [{"name": "bill", "sentiment": "none"}, {"name": "thom brooks", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "nigel farage", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "greece", "sentiment": "none"}, {"name": "dublin", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}], "organizations": [{"name": "durham university’s law school", "sentiment": "none"}, {"name": "european parliament", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "durham university", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["Bill", "Thom Brooks", "Brexit", "Nigel Farage"], "text": "Durham University's Thom Brooks takes a close look at what leaving the European Union could really mean for immigration Shares Get daily news by email Thom Brooks \nThe wait is nearly over. A week from today we will know the answer to the big question gripping the country. I do not refer to who might win I’m a Celebrity, Get Me Out of Here, but whether Britain chooses to get out of the European Union . I am sure for many this could not come soon enough. \nImmigration has retaken centre stage as the number one voter concern – and main line of attack for Vote Leave. Their argument is simple: if Britain leaves the EU, we can secure our borders better. End of. \nThe ‘Remain’ campaigners have had to work harder to get across their position because it is less straightforward. \nBut the message must match the reality. Immigration doesn’t work like most people appear to assume – or at least not those campaigning for Brexit. \nVote Leave has been criticised for its lack of details. While its supporters claim Britain should “take back control”, some claim we should know more about what this control would mean. Having control can sound great, but the real question is what is to be done with it. \nIn response, Vote Leave has published a list of new laws it would want Parliament to pass if voters choose to exit the EU. A key element of this list is an Asylum and Immigration Control Bill – and the name says it all about its goal of reducing net migration to new lows. \nNot much detail is provided, but what we know is that the bill has three main aims. The first is that it would end the automatic right of all EU citizens to enter the UK. Anyone who has heard the referendum debate at all will have heard time and time again that there is ‘uncontrolled’ EU migration. \nSome myths are so big that people actually believe them – and EU free movement is one such porkie. Like all freedoms, EU ‘free’ movement is subject to restrictions set out in a list of rules no one calling for Brexit seems to know about. This is especially alarming where there are Members of the European Parliament, MEPs like Nigel Farage, repeating such myths to scare the public into believing something that never happened. EU citizens can normally enter Britain, but this is subject to conditions and EU citizens can be prevented from entering. No benefits can be claimed over the first three months in Britain. After six months, EU citizens without work or genuine prospect of work can be deported. This has been upheld by the European court. \nAs a result, more than 3,000 EU citizens have either been turned back at Britain’s border or deported since 2010. Really. Some might want this to happen more frequently, but the point remains: EU ‘free’ movement of workers is not uncontrolled in theory or practice. If Brexiteers want to control it, they can do that now without the need for a new act of Parliament. \nA second aim of Vote Leave’s new bill is to introduce an Australian-style points based system. \nCampaigners claim this is a better way of cutting migration and point to Australia’s efforts at reducing migration. \nBut maybe they don’t want facts to get in the way of a good story. \nThe system works by saying anyone who wants to come work in Australia must meet certain criteria. You can earn points for salary, qualifications, English language and other categories. Each can be worth a different amount and added together. Anyone who reaches a set number of points can go there to work. Notice the problem? \nThe Australian system isn’t designed to cut migration, but increase it! It sends a clear message that having enough points gets you into the country. \nThose campaigning to follow Australia are on a road to increasing migration, not cutting it. And the biggest secret in British politics is that we’ve had a points-based system for over a decade. I should know – I had to pass it when immigrating from America. While I am now a British citizen, the system has worked for years – and unlike in Australia there is a cap on the numbers permitted. \nSo those wanting a points-based system don’t need a new law for this, either – we already have it, although it might be used for more types of migrants than at present. \nThe third aim of the Asylum and Immigration Control Bill proposed by Vote Leave is to stop European courts having a say in how the UK handles asylum cases. \nThis is also unnecessary in a new bill. Why? The UK already has an opt-out on all EU migration matters. We don’t have to follow any EU migration policies we don’t like. We only do what we choose – we already have taken control. \nOne policy we chose was a common EU rule on asylum. This rule – the Dublin Regulation – says that anyone claiming asylum in Britain who had set foot first in another EU country must be returned to that country. \nThis policy continues to have widespread support across the political spectrum. \nHere’s the shocker. If Britain chooses to leave, we exit this agreement on asylum – so each and every person who wants to claim asylum in Britain can do so without any worry that he or she might be sent away to Greece or Italy. \nLeaving the EU comes with a real risk of attracting more people to put their lives on the line to cross the English Channel than we see already because any successful claim for asylum will now become a right to be in Britain, not somewhere else. Brexit could see more, not fewer, people cross borders. \nI don’t doubt that refugees take such risks in the most extreme of circumstances. I cannot imagine how difficult the situation must be for so many. \nBut I’m not the one talking about slamming shut Britain’s once proudly tolerant door. \nThose who want less migration know little about how migration works – and even less about how to get there. We’ve seen politics by political slogans before, but Vote Leave is taking empty promises to a new level with a bill that may be unnecessary, unworkable and possibly counterproductive. \nIf you’re thinking about voting ‘Leave’ because of immigration, I would urge you to think again. Thom Brooks is professor of law and government at Durham University’s Law School and author of Becoming British @thom_brooks", "external_links": [], "published": "2016-06-17T13:30:00.000+03:00", "crawled": "2016-06-17T14:26:01.683+03:00", "highlightTitle": ""}