{"organizations": ["EU", "Leicester City Football Club", "Caterpillar", "JCB", "Leicestershire Enterprise Partnership"], "uuid": "642bd1be0cec1217c71516c50fff6fbb1f9b53e5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/29426127/14657223.jpg", "site_section": "http://www.thisisleicestershire.co.uk/specialolympics/rss.html?chid=181121", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/eu-referendum-businesses-will-demonstrate-their-great-british-products-will-still-be-in-demand/story-29426127-detail/story.html", "country": "GB", "title": "Leicester Mercury published EU Referendum: 'Businesses will demonstrate their great British...", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "Leicester Mercury published EU Referendum: 'Businesses will demonstrate their great British...", "spam_score": 0.0, "site_type": "news", "published": "2016-06-21T14:11:00.000+03:00", "replies_count": 0, "uuid": "642bd1be0cec1217c71516c50fff6fbb1f9b53e5"}, "author": "Leicester Mercury", "url": "http://www.leicestermercury.co.uk/eu-referendum-businesses-will-demonstrate-their-great-british-products-will-still-be-in-demand/story-29426127-detail/story.html", "ord_in_thread": 0, "title": "Leicester Mercury published EU Referendum: 'Businesses will demonstrate their great British...", "locations": ["Britain", "US", "Americas", "Far East", "EU", "UK", "Europe", "USA", "Brussels", "East Midlands", "Brexit", "Leicester", "Asia Pacific", "Middle East"], "entities": {"persons": [{"name": "bamford", "sentiment": "none"}, {"name": "dyson", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "james dyson", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "americas", "sentiment": "none"}, {"name": "far east", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "usa", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "east midlands", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "asia pacific", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "leicester city football club", "sentiment": "none"}, {"name": "caterpillar", "sentiment": "none"}, {"name": "jcb", "sentiment": "none"}, {"name": "leicestershire enterprise partnership", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["Bamford", "Dyson", "Brexit", "James Dyson"], "text": "In the run-up to the EU referendum, we are experiencing near-incessant debate running across all media channels, with arguments and counter-arguments voiced with increasingly adamant tones for each side. The air is thick with hyperbole.To stay in or get out? That is the big question. \nBut despite the hundreds of hours of expert commentary and political case-making, what seems apparent to most at the moment is that there is still a lack of clear decision-making information and genuine confusion regarding the actual economic and business consequences of either an \"in\" or \"out\" vote. \nFor the first time in decades we have a vote – not about one political party or one personality over another, but about a policy decision with real potential outcomes and impacts. \nIn fact, there seems to be but two questions. \nFirstly, how do I vote? And secondly, does anybody actually know anything when it comes to Brexit? \nWhat we do know is that uncertainty is not good and we have seen sterling at an eight-week low in the run-up to the poll, so it's likely the sooner we put the vote behind us – one way or the other – at least we will have a direction and perhaps the markets will be more settled. \nIn trying to make sense of all this, I bring myself to focus on a few home truths for our local area: Leicester has an excellent and very diverse business community with the wider county area being the largest economy in the East Midlands with an estimated value of £19.4 billion a year, providing 435,000 jobs and hosting 33,000 trading businesses, according to the Leicester and Leicestershire Enterprise Partnership. \nWhilst being home to a number of major international businesses including Next, Triumph, Caterpillar and Walkers, providing a diverse range of products and services (and with two of these businesses being owned by US parents they have their own domestic presidential election to deal with), it's important to note that our local economy is also underpinned by entrepreneurial small and medium-sized businesses. \nFurthermore, we have one of the most culturally diverse cities in the UK and many in our business community have endured difficult and challenging circumstances. \nSome have settled in the UK from overseas, greatly enriching our communities and have succeeded by employing the \"can do\" spirit – and that is surely one of our region's greatest assets. \nMy belief is that the small and medium-sized businesses in Britain, those that make up a large and vital part of our economy, will demonstrate that their great British products and services will continue to be in demand no matter what the outcome.British-made goods exported to the EU in April were 10.3 per cent up on the previous year. \nThe UK is, of course, a trading nation and the fifth largest economy in the world, English is the global language of business and the Americas, the Middle East, Asia Pacific and the Far East also continue to be important overseas markets for British brands and products. \nRetail clients of ours include several global brands with a rich East Midlands heritage. \nThey have grown successfully from entrepreneurial family businesses and now trade not only from an expanding, growing physical high street presence in the UK but through a variety of multi-channel operations in Europe, the USA and world-wide. \nBillionaire entrepreneur Sir James Dyson recently asserted his view that it would be \"absolute cobblers\" for Europe to cease trading with the UK. \nCiting a £9 billion-a-month trade imbalance he suggested that post-Brexit trade tariffs, if imposed on the UK, would be met on a like-for-like basis and could ultimately benefit the UK given we purchase more from Europe than we export to it. \nA further concern to Dyson is the difficulty EU rules cause in preventing his business recruiting skilled engineers from outside of the EU when 60 per cent of engineering undergraduates at British universities come from non-EU countries. \nDyson, not surprisingly, also wishes to see more trade with the rest of the world and our Commonwealth countries. \nMost importantly, he insists that control is \"the most important thing in life and business\". \nThis notion of being in control over the destiny of the UK is echoed also by Lord Bamford, the chairman of JCB, in his recent letter to the firm's 6,500 UK employees. \nIt was a clear message: \"I voted to stay in the Common Market in 1975. I did not vote for a political union. I did not expect us to hand over sovereignty to the EU. I certainly did not expect unaccountable leaders in Brussels to govern over us.\" \nI can relate to these concerns about wanting to be in control – to have self-determination – as I think can anyone who has successfully started a business and grown it through the economically-challenging conditions of the last decade. \nThe bottom line for me – we should not be afraid of what life outside of the EU might hold for us and our businesses. \nLike all good businesses, while we may not be able to influence the wider macro-economic environment, in the event that we do leave the EU, we have to find the best outcomes and opportunities we can. \nAnd I have no doubt that here in the East Midlands we can do just that if we need to. \nThere really is a positive, can-do mood here to my mind – and one that is underscored by our region's entrepreneurial and robust business spirit. \nI do believe that if the vote goes for the Brexit, businesses in our region will step up to the mark. \nNo doubt the success of Leicester City Football Club this season will bring another significant contribution to the local economy. \nIn fact, I hope we can warmly welcome many European visitors next season and encourage them to happily spend their euros with us – irrespective of the result on June 23.", "external_links": [], "published": "2016-06-21T14:11:00.000+03:00", "crawled": "2016-06-21T15:50:51.082+03:00", "highlightTitle": ""}