{"organizations": ["Nissan", "Works Council", "GE", "BMW", "Toyota", "EU", "Jaguar Land Rover", "SMMT", "Airbus", "Unilever"], "uuid": "e7b8f1fe22e1cf9572db3617ee7a44438024bc0d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article11499807.ece/ALTERNATES/s1200/JS31490713.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/nissan-launches-legal-bid-against-11499645", "country": "GB", "domain_rank": 21960, "title": "Nissan launches legal bid against Vote Leave campaign over logo use", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Nissan launches legal bid against Vote Leave campaign over logo use", "spam_score": 0.0, "site_type": "news", "published": "2016-06-20T18:32:00.000+03:00", "replies_count": 0, "uuid": "e7b8f1fe22e1cf9572db3617ee7a44438024bc0d"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/nissan-launches-legal-bid-against-11499645", "ord_in_thread": 0, "title": "Nissan launches legal bid against Vote Leave campaign over logo use", "locations": ["Britain", "Wearside", "Sunderland", "Europe", "UK"], "entities": {"persons": [{"name": "mike hawes", "sentiment": "none"}, {"name": "owen", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "wearside", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "nissan", "sentiment": "negative"}, {"name": "works council", "sentiment": "none"}, {"name": "ge", "sentiment": "none"}, {"name": "bmw", "sentiment": "none"}, {"name": "toyota", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "jaguar land rover", "sentiment": "none"}, {"name": "smmt", "sentiment": "none"}, {"name": "airbus", "sentiment": "none"}, {"name": "unilever", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["Mike Hawes", "Owen"], "text": "Nissan launches legal bid against Vote Leave campaign over logo use 16:32, 20 Jun 2016 Nissan says the Brexit campaigners have used the Nissan logo and trademark on campaign materials despite being asked to stop Shares Get business news by email Owen Humphreys/PA Wire The Nissan logo \nNorth East motor manufacturer Nissan has issued legal proceedings against the Vote Leave campaign for persistently using the firm’s logo and trademark. \nThe Japanese manufacturer is going to the High Court after Vote Leave continued to feature the firm’s trademark in its referendum leaflets , despite being asked to stop. \nNissan said it was “extremely disappointed” the out camp had used its name in its campaign materials that “grossly misrepresents” its position on the June 23 vote. \nThe legal challenge comes after furious company chiefs at Unilever, Airbus and GE also threatened legal action over logo use. \nNissan, which employs more than 6,500 people on Wearside, is now seeking an injunction to stop Vote Leave making “any further false statements” during the final days of the referendum campaign. Owen Humphreys/PA Wire Workers at Nissan's plant in Sunderland on the production line \nIn a statement, the firm said: “We were extremely disappointed to discover that the Vote Leave campaign had been using the Nissan name and logo in their literature and on their website without our permission. We immediately requested that they stop doing so. \n“It has since come to light that the Vote Leave campaign continue to use our logo and trademark despite our repeated requests for them to stop. \n“Permission to use our name and logo was not requested. If it was, it would not have been granted. Furthermore, use of the Nissan name and logo by the Vote Leave campaign in their materials grossly misrepresents our widely circulated and publicly stated position announced on 23rd February 2016. \n“To be clear, Nissan is not supporting any political campaign regarding this most serious of issues. This is a matter for the people of the UK to decide. \n“We vigorously protect the Nissan brand and intellectual property in all markets in which we operate. We have repeatedly asked Vote Leave to stop using our name and logo on their materials and to stop misrepresenting our views – a request that has clearly been denied. \n“As such, we will be issuing legal proceedings today, (June 20th) in the High Court asking for an injunction to stop Vote Leave’s use of Nissan’s name and logo, and to prevent them from making any further false statements and misrepresentations concerning Nissan.” \nThe High Court bid also comes on the day Nissan joins a group of top manufacturers in writing to staff, to say that remaining in Europe is better for the car industry, and the hundreds of thousands of jobs that rely on it. \nManufacturers including Nissan, Jaguar Land Rover and Toyota have told their workers that the car industry is stronger, safer and better off in Europe. \nBMW has previously written to its UK staff to say that “the UK is better as a member of the EU”, while leaving would mean “higher costs and higher prices”. \nIt comes as the chairman of BMW’s Works Council, which represents its employees in countries across Europe, wrote to BMW’s staff in the UK to say that “joining forces and fighting together” as part of the EU will allow British workers to “ensure fair wages and good work”. “National solo attempts”, he said, “have little chance of success.” \nThe automotive industry is one of Britain’s key industrial sectors employing over 700,000 people, a turning over £60bn a year while also accounting for 10% of all UK goods exports. \nPolling by the SMMT, the industry body for UK automotive manufacturers, has found that 77% of automotive firms in Britain want to remain in the EU, while just 9% want to leave. \nMike Hawes, chief executive of the SMMT said: “UK Automotive is globally competitive, securing record levels of investment, creating tens of thousands of jobs annually and exporting to over 100 countries. \n“We want this success to continue rather than jeopardise it by increasing costs, making our trading relationships uncertain and creating new barriers to our single biggest and most important market, Europe. \n“Remaining will allow the UK to retain the influence on which the unique and successful UK automotive sector depends.”", "external_links": [], "published": "2016-06-20T18:32:00.000+03:00", "crawled": "2016-06-20T19:17:59.572+03:00", "highlightTitle": ""}