{"organizations": ["Tory", "Labour", "BBC", "EU", "Labour and Conservative"], "uuid": "a3f78a08f4b59d07b164294ab3ccb0ad7d657c4f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article11446984.ece/ALTERNATES/s1200/JS92073015.jpg", "site_section": "", "section_title": "", "url": "http://www.chroniclelive.co.uk/news/north-east-news/gordon-brown-rally-sage-recap-11444444", "country": "IE", "domain_rank": 21960, "title": "Gordon Brown rally at the Sage RECAP: Updates as former Prime Minister argues to stay in the EU - Chronicle Live", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 0, "title_full": "Gordon Brown rally at the Sage RECAP: Updates as former Prime Minister argues to stay in the EU - Chronicle Live", "spam_score": 0.0, "site_type": "news", "published": "2016-06-09T01:29:00.000+03:00", "replies_count": 0, "uuid": "a3f78a08f4b59d07b164294ab3ccb0ad7d657c4f"}, "author": "Hannah Graham", "url": "http://www.chroniclelive.co.uk/news/north-east-news/gordon-brown-rally-sage-recap-11444444", "ord_in_thread": 0, "title": "Gordon Brown rally at the Sage RECAP: Updates as former Prime Minister argues to stay in the EU - Chronicle Live", "locations": ["Britain", "Brexit", "EU", "UK", "Europe"], "entities": {"persons": [{"name": "tom eden  here", "sentiment": "none"}, {"name": "fergus hewison", "sentiment": "none"}, {"name": "michael gove", "sentiment": "none"}, {"name": "gordon brown", "sentiment": "none"}, {"name": "tory brexit", "sentiment": "none"}, {"name": "tom eden ids", "sentiment": "none"}, {"name": "tom eden", "sentiment": "none"}, {"name": "iain duncan smith", "sentiment": "none"}, {"name": "gove", "sentiment": "none"}, {"name": "tom eden brown", "sentiment": "none"}, {"name": "brown", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}], "organizations": [{"name": "tory", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "bbc", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "labour and conservative", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["Tom Eden  Here", "Fergus Hewison", "Michael Gove", "Gordon Brown", "Tory Brexit", "Tom Eden IDS", "Tom Eden", "Iain Duncan Smith", "Gove", "Tom Eden Brown", "Brown"], "text": "\nGordon Brown appears to be winding up his argument. 20:08 Tom Eden 'Britain helped lead the way after the economic crash' \nSpeaking about the crash in 2009, Brown says that he helped Britain lead the response to the crash, which in turn helped Europe lead the way. 20:07 Tom Eden Brown addresses the issue of soverighnity \nLike workers rights for the Labour party, the issue of sovereignty — the idea of the UK being able to set all it’s own laws, etc. etc. — is a cornerstone of the leave campaign’s argument. \nHere’s Gordon Brown’s take on this subject: 20:04 Tom Eden IDS and Gove want someone to blame for Tory policies \nBrown says that Tory Brexit campaigners Michael Gove and Iain Duncan Smith are blaming the EU for the damage caused by their government policies. 20:01 Tom Eden 'Protect ourselves from terrorism by staying in' \nOn terrorism, he says that the EU needs to work together to protect against terrorism, and this cannot be done on an ad hoc basic from outside the union. 19:57 Tom Eden Fight illegal immigration by working together, says Brown \nReturning to the central theme of co-operation, Gordon Brown says this is how you fight illegal immigration, not by cutting ties with Europe: 19:55 Tom Eden 'Illegal immigration is the biggest problem' \nBrown has now moved onto immigration, a subject that In campaigners have tended to avoid, but that has been an issue those in favour of Brexit have pushed hard. 19:53 Tom Eden 'The EU protects people from the Tories' \nHe says the Tory party aren’t going to protect workers on zero hours contracts today, but the EU might, then adds: \n“Some members of the story party say they are protecting the people of Britain from Europe but sometimes the EU is necessary to protect the people of Britain from the Tory party” 19:48 Defending people against the Tory party \nThe BBC’s reporter Fergus Hewison quotes Brown making that exact point: 19:47 'The EU protects workers rights' \nGordon Brown is now focussing on workers rights. \nThis is a core issue for many Labour voters, who are shown to be worried about employment rights being slashed in the Leave campaign takes the UK out of the EU. (I’ll try to dig out the polling on this after I’ve finished covering the speech/Q&A..) \nIt’s also a clear dividing line between the Labour and Conservative sides of the Remain argument - as you’ll have seen if you watched PMQs earlier. 19:43 Tom Eden 'Make it easier to access the single market' \nHe says that he believes half a million jobs could be created in the UK by making it easier to access the single market: \nBrown suggests these jobs will come from digital, renewable energy and the financial sector, and these will all be from providing services to other EU countries. 19:41 Gordon Brown on jobs \nGordon Brown is now talking about how vital the EU is to jobs. \n“If you’re thinking where are the jobs of the future going to come from in the next 10 years I think they will come from the EU & the European single market.” 19:38 Tom Eden \nHere’s a picture of Gordon Brown speaking before this speech, being interviews for the cameras: 19:38 Tom Eden 'Globalisation makes the EU necessary' \nYou need to cooperate on the big decisions on environment, finance and creating growth, says Gordon Brown 19:34 Tom Eden Brown talks pollution and pandemics \nBrown says that co-operation is vital to deal with the problems that affect people regardless of borders: 19:32 'Co-operation is vital' \nGordon Brown moves on to speak about co-operation between different countries: \n“Within your own country you cannot have a successful economy if you cannot cooperate between nations.” 19:31 'The jobs of the future depend on the EU' \nGordon Brown says: \n“The jobs we depend on & the jobs of the future will not only come from EU funding, it will come from the money that comes from exports” \nHe adds that globalisation has changed everything - if you have a global economy and the majority of trade is going to be between countries not. 19:28 ", "external_links": [], "published": "2016-06-09T01:29:00.000+03:00", "crawled": "2016-06-10T08:01:01.314+03:00", "highlightTitle": ""}