{"organizations": ["EU Regional Development and Social Funds", "Labour", "European Union", "University of Leicester", "East Mids", "Labour Party", "EU", "Leicester Mercury", "European Arrest Warrant", "Leicester Mercury ​Why Labour"], "uuid": "d67d592f7489680927fb2d95147c807c994455cb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/29404258/14584878.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/8203-labour-convinced-britain-stay-eu-jon/story-29404258-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "​Why Labour is convinced Britain should stay in the EU, by Jon Ashworth | Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "​Why Labour is convinced Britain should stay in the EU, by Jon Ashworth | Leicester Mercury", "spam_score": 0.788, "site_type": "news", "published": "2016-06-15T15:55:00.000+03:00", "replies_count": 0, "uuid": "d67d592f7489680927fb2d95147c807c994455cb"}, "author": "Leicester Mercury", "url": "http://www.leicestermercury.co.uk/8203-labour-convinced-britain-stay-eu-jon/story-29404258-detail/story.html", "ord_in_thread": 0, "title": "​Why Labour is convinced Britain should stay in the EU, by Jon Ashworth | Leicester Mercury", "locations": ["Britain", "Leicester South", "European Union", "East Midlands", "Leicestershire", "Leicester", "UK", "Europe", "EU"], "entities": {"persons": [{"name": "jon ashworth", "sentiment": "none"}, {"name": "putin", "sentiment": "none"}, {"name": "jon ashworth ​why labour", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "leicester south", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "east midlands", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}], "organizations": [{"name": "eu regional development and social funds", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "university of leicester", "sentiment": "none"}, {"name": "east mids", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "leicester mercury", "sentiment": "none"}, {"name": "european arrest warrant", "sentiment": "none"}, {"name": "leicester mercury ​why labour", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["Jon Ashworth", "Putin", "Jon Ashworth ​Why Labour"], "text": "​Why Labour is convinced Britain should stay in the EU, by Jon Ashworth By Leicester Mercury | Posted: June 15, 2016 18 COMMENTS SHARES ​Why Labour is convinced we should stay in EU, by Jon Ashworth ​Why Labour is convinced Britain should stay in the EU, by Jon Ashworth X \nCopy link to paste in your message / Comments (18) \nJon Ashworth , MP for Leicester South, has written the following article for the Leicester Mercury on why the Labour party believes Britain should stay in the European Union. \nIn just over a week, the people of Leicester and the rest of Britain will be asked to make the biggest political and economic decision of most of our lifetimes: whether to stay in or leave the EU . For our economy, for workers' rights, for security and solidarity, we in the Labour Party are convinced we should stay. \nThe core principle of the Labour Party is that 'by the strength of our common endeavour we achieve more than we achieve alone.' \nA similar principle lies right at the heart of the European Union . In its founding constitution the EU's purpose is clear: to 'ensure the economic and social progress of their states by common action to eliminate the barriers which divide Europe', to ensure 'the constant improvement of the living and working conditions of their peoples' and to 'pool their resources to strengthen peace and liberty.' \nRead more: 'Voting Brexit? That's what Putin wants you to do' \nThe EU is not perfect but over the last 40 years our membership of this union has brought us more social and economic progress, more rights and liberties, and more peace, that we would ever have achieved outside of it. \nHere in the East Midlands much of our economic progress has been connected to the EU. In Leicestershire alone there are 77,000 jobs dependent on our EU membership , in East Mids as a whole the figure is 200,000 – that's 10% of all jobs in the region dependent on the EU. As well as creating jobs the EU has directly invested in our prosperity. Between 2007 and 2020 the EU Regional Development and Social Funds will have invested over a billion euros in the East Midlands, with €5.4 million going straight into making the University of Leicester even more world class. \nWorkers in Leicester now enjoy a minimum of four weeks paid holiday a year, maternity and paternity leave, protection from discrimination, protection from working more than a 48 hour week, comprehensive health and safety cover. For all this we have the EU to thank, and it is the EU that provides a cast iron guarantee that these rights will not be lost. \nRead more: 'Some EU regulations are sensible but most stifle my business' \nOn peace and liberty no generation has ever had it so good. The EU has strengthened international ties so as to make a repeat of the wars of the early twentieth century unthinkable. The EU's pooled resources and intelligence helps keep us safe. The European Arrest Warrant has helped us remove 7,400 criminals and terrorists from the UK since 2004, and brought 1,100 criminals back to the UK to face British justice. \nFrom economic prosperity, to rights to peace and security the EU has been an asset to Britain and British people. \nThe idea that Britain could go back on 40 years of unity and development with the EU with no economic or social consequences is madness. \nAs a Labour MP I believe in prosperity, security and solidarity for all. That is what the EU has always aimed to give us. If you believe in those values too then vote remain on June 23 rd . ", "external_links": [], "published": "2016-06-15T15:55:00.000+03:00", "crawled": "2016-06-16T07:16:07.899+03:00", "highlightTitle": ""}