{"organizations": ["Labour", "Hitachi Rail", "Newton Aycliffe", "Scotrail", "EU", "Hitachi"], "uuid": "50d8ddc89fdc3a95dc90c51dbf58fdaa2e891bbb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article11449282.ece/ALTERNATES/s1200/JS92114311.jpg", "site_section": "", "section_title": "", "url": "http://www.chroniclelive.co.uk/news/north-east-news/five-things-learned-david-camerons-11449198", "country": "IE", "domain_rank": 21960, "title": "Five things we learned from David Cameron's visit to Hitachi in County Durham - Chronicle Live", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 0, "title_full": "Five things we learned from David Cameron's visit to Hitachi in County Durham - Chronicle Live", "spam_score": 0.0, "site_type": "news", "published": "2016-06-09T16:05:00.000+03:00", "replies_count": 0, "uuid": "50d8ddc89fdc3a95dc90c51dbf58fdaa2e891bbb"}, "author": "Laura Hill", "url": "http://www.chroniclelive.co.uk/news/north-east-news/five-things-learned-david-camerons-11449198", "ord_in_thread": 0, "title": "Five things we learned from David Cameron's visit to Hitachi in County Durham - Chronicle Live", "locations": ["France", "Sedgefield", "Britain", "East Coast", "North East", "Cramlington", "Spain", "Newton Aycliffe", "Europe", "EU", "County Durham"], "entities": {"persons": [{"name": "david cameron", "sentiment": "none"}, {"name": "hiroaki nakanishi", "sentiment": "none"}, {"name": "emma o’leary", "sentiment": "none"}, {"name": "cameron", "sentiment": "none"}, {"name": "phil wilson", "sentiment": "none"}, {"name": "tony blair", "sentiment": "none"}], "locations": [{"name": "france", "sentiment": "none"}, {"name": "sedgefield", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "east coast", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "cramlington", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}, {"name": "newton aycliffe", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "none"}, {"name": "hitachi rail", "sentiment": "none"}, {"name": "newton aycliffe", "sentiment": "none"}, {"name": "scotrail", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "hitachi", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["David Cameron", "Hiroaki Nakanishi", "Emma O’Leary", "Cameron", "Phil Wilson", "Tony Blair"], "text": "Five things we learned from David Cameron's visit to Hitachi in County Durham 13:05, 9 Jun 2016 The Prime Minister visited the Newton Aycliffe factory on the EU referendum campaign trail Shares The video will start in 8 s Cancel Click to play Tap to play The Live Event you are trying to watch is either unavailable or has not started Please refresh this page in your browser to reload this live event video \nDavid Cameron was in the North East on Thursday to hammer home his case for Britain remaining in the EU . \nThe Prime Minister visited the Hitachi Rail factory in Newton Aycliffe, County Durham , for a tour of the £82m site ahead of June 23’s referendum. \nMr Cameron warned a Brexit would mean firms such as the Japanese rail giant wouldn’t invest in the region. \nHere are five things we learnt from the PM’s fleeting visit to the region. 1 - The EU referendum goes beyond party politics. \nThe Hitachi factory sits in the rock solid Labour heartland seat of Sedgefield, Tony Blair’s former constituency of 23 years. It is not an area you would expect a Tory Prime Minister to frequent but despite this Thursday’s visit was Cameron’s second trip up the A1 to the plant which opened last year. \nSedgefield’s Labour MP Phil Wilson joined the PM on his tour. He said “The issue of the EU referendum goes beyond party politics. This is about the livelihood of my constituents.” 2 - Business expansion opportunities...if we stay in the EU \nWorkers busied themselves away on the factory floor while the PM carried out his walkabout. The factory is currently working on the carriages for the Great Western contract, and will soon start working on carriages for the East Coast network and Scotrail after winning those contracts. \nThe factory will be able to produce one train carriage a day when it works at full capacity, and Cameron commented that if Britain stays in the EU, the factory could win contracts to build trains for Spain or France or other European countries. 3 - The PM loves a good metaphor \nBefore the end of his five minute chat with reporters, the Prime Minister appeared to suddenly remember a great line he had been saving for such an occasion. \n“There is an absolute umbilical cord linking the single market and jobs in the North East. My message is don’t cut that cord,” he said. \nPM David Cameron on a visit to Hitachi in Newton Aycliffe 4 - Jobs, jobs, jobs \nFor the sake of your jobs, and future jobs in this factory, you should vote to stay - that was the remain campaign’s key message after Hitachi chairman Hiroaki Nakanishi said a decision to leave would make the case for future investment “very different”. \nThe huge multi-national company is one of the region’s fastest-growing employers and will soon employ more than 700 people at its Newton Aycliffe manufacturing site. \nStaff travel from as far North as Cramlington to reach the site where they work and many staff believe staying in Europe is the best option for their careers. \nProduction line worker Emma O’Leary, 23, said: “He is right, the best choice for the safety of my job is to stay in.” 5 - No one is allowed on the campaign bus without an invite \nNo one. It doesn’t matter how politely you ask, or how many hints you drop, the PM’s people won’t let just anyone on the big blue Vote Remain bus which pulled up in the car park at the Hitachi factory, before whisking Cameron away for a day of campaigning. ", "external_links": [], "published": "2016-06-09T16:05:00.000+03:00", "crawled": "2016-06-09T15:49:09.071+03:00", "highlightTitle": ""}