{"organizations": ["Labour", "European Union", "Institute for Fiscal Studies", "EU", "Hitachi", "NHS", "Nissan"], "uuid": "bff1c0775869fddccb7e00b074298e317a80d111", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article11461568.ece/ALTERNATES/s1200/JS83948653.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/100000-north-east-jobs-would-11461369", "country": "GB", "title": "100,000 North East jobs would be put at risk by a Brexit, Lord Peter Mandelson warns", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "100,000 North East jobs would be put at risk by a Brexit, Lord Peter Mandelson warns", "spam_score": 0.0, "site_type": "news", "published": "2016-06-12T17:45:00.000+03:00", "replies_count": 0, "uuid": "bff1c0775869fddccb7e00b074298e317a80d111"}, "author": "Craig Thompson", "url": "http://www.chroniclelive.co.uk/news/north-east-news/100000-north-east-jobs-would-11461369", "ord_in_thread": 0, "title": "100,000 North East jobs would be put at risk by a Brexit, Lord Peter Mandelson warns", "locations": ["Britain", "North East", "Brexit", "England", "UK", "Europe", "EU", "Great Britain", "London"], "entities": {"persons": [{"name": "david cameron", "sentiment": "none"}, {"name": "peter mandelson", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "mandelson", "sentiment": "none"}, {"name": "cameron", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "great britain", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "institute for fiscal studies", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "hitachi", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["David Cameron", "Peter Mandelson", "Brexit", "Mandelson", "Cameron"], "text": "100,000 North East jobs would be put at risk by a Brexit, Lord Peter Mandelson warns 15:45, 12 Jun 2016 Lord Mandelson talks to ChronicleLive about the cost to the North East of exiting the European Union on June 23 Shares The video will start in 8 s Cancel Click to play Tap to play The Live Event you are trying to watch is either unavailable or has not started Please refresh this page in your browser to reload this live event video \nLeaving the EU would have a devastating impact on 100,000 North East jobs, voters have been told. \nFormer Trade Commissioner Lord Peter Mandelson issued the stark warning over the “black hole” Brexit would open up in the region. \nThe Labour peer claimed losing vital access to the single European market would have a significant impact on the region’s economy - home to giants like Nissan and Hitachi - as well as the scores of European companies that have made the area their home. \nLord Mandelson said: “Around 58% of all goods exported from the North East go to Europe. If we leave and put up barriers to trade, those exports and jobs would come under threat. \n“In the last five years, 90 investments from new businesses and projects from Europe have created and safeguarded around 6,000 North East jobs.” \nWhile many argue Lord Mandelson’s warnings come amid increasingly desperate tactics from the Remain campaign, his views nonetheless carry weight as the man responsible for overseeing all EU trade deals between 2004 and 2008. Ben Pruchnie/Getty Images Lord Mandelson delivers a keynote speech during an event hosted by the Britain Stronger In Europe campaign on March 1, 2016 in London, England \nAlways a pro-European advocate, the peer has warned that losing the EU’s preferential trading benefits in foreign markets could mean new tariffs of 10, 20% or sometimes even more on key UK exports, such as cars \nHe said: “There is not doubt that an exit will change the ground rules for businesses that have invested heavily in the North East. Blocking access to a European market of 500 million will leave these businesses in trouble.” \nLord Mandelson acknowledged that many people have concerns over accountability to the EU and its reach. \n“But leaving it won’t make it any better,” he added. “Prices will go up, exports will go down, the economy will suffer, jobs will be lost and the NHS will suffer. \n“This is the clear reality of what leaving the EU would mean for Great Britain. It people are willing to pay that price and still leave, that’s their decision. \n“But I believe the price we would pay in our economy would be too great.” \nLord Mandelson was speaking as the Remain campaign stepped up warnings surrounding the cost of Brexit to the UK’s economy. \nDavid Cameron has said the Government might not be able to protect spending on pensions, the NHS and defence in the long term if the UK leaves the EU. \nThe Prime Minister said Brexit could cause a “black hole” in the public finances and threaten the “triple lock” guaranteeing state pension increases. \nHe said “our economy would be smaller” if the UK left the single market, leading to “difficult choices”. \nVote Leave said the latest warning was nothing more than “a frantic attempt to rescue a failing campaign”. \nBut Lord Mandelson urged North East voters to go with their gut instincts on June 23. \nHe added: “A lot of people are sick of claims and counter claims. I would say, if they don’t like what the experts are telling them, just do what your gut tells you. \n“The whole country has to make a decision that we have to live with for the rest of our lives.” \nMr Cameron said on Sunday that forecasts from the Institute for Fiscal Studies suggested Brexit could lead to a shortfall in the public finances of between £20bn and £40bn which would need to be “filled” - either by tax rises, borrowing or spending cuts. The European Union debate", "external_links": [], "published": "2016-06-12T17:45:00.000+03:00", "crawled": "2016-06-12T18:35:05.003+03:00", "highlightTitle": ""}