{"organizations": ["EU", "Labour", "Labour Party"], "uuid": "b62bd5533c6a3340b525a20c39765a06945ff390", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/29426299/14657436.jpg", "site_section": "http://www.thisisleicestershire.co.uk/specialolympics/rss.html?chid=181121", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/eu-referendum-my-gut-instinct-is-most-people-are-still-happier-to-stick-with-the-devil-they-know/story-29426299-detail/story.html", "country": "GB", "title": "Leicester Mercury published EU Referendum: 'My gut instinct is most people are still happier...", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "Leicester Mercury published EU Referendum: 'My gut instinct is most people are still happier...", "spam_score": 0.0, "site_type": "news", "published": "2016-06-21T14:25:00.000+03:00", "replies_count": 0, "uuid": "b62bd5533c6a3340b525a20c39765a06945ff390"}, "author": "Leicester Mercury", "url": "http://www.leicestermercury.co.uk/eu-referendum-my-gut-instinct-is-most-people-are-still-happier-to-stick-with-the-devil-they-know/story-29426299-detail/story.html", "ord_in_thread": 0, "title": "Leicester Mercury published EU Referendum: 'My gut instinct is most people are still happier...", "locations": ["US", "UK", "EU", "Europe", "China"], "entities": {"persons": [{"name": "john major", "sentiment": "none"}, {"name": "jeremy", "sentiment": "none"}, {"name": "tony blair", "sentiment": "none"}, {"name": "dave", "sentiment": "none"}, {"name": "david cameron", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "cameron", "sentiment": "none"}, {"name": "boris", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["John Major", "Jeremy", "Tony Blair", "Dave", "David Cameron", "Corbyn", "Brexit", "Cameron", "Boris"], "text": "Comments (1) \nWe are living in interesting times. John Major and Tony Blair sharing a podium, Jeremy Corbyn siding with David Cameron and of course, Boris at the heart of the chaos, a gleeful media lapping it all up. \nBrexit is high drama and it is on the lips of everyone I meet, whether in my professional or personal circles. \nIt remains compelling because it has the perfect blend of tension, major characters and plot twists. \nEven smaller characters' actions, \"defecting\" from one side to another are given huge amounts of screen time. \nIt's somewhere between a soap opera and Game of Thrones and I'm happy to admit that I've been binge watching the whole drama. \nI'm happy to be a part of the debate. It is interesting to see how people are becoming more engaged, slowly but surely in politics. \nPerhaps one of the reasons behind this is because we are seeing the \"big beasts\" squaring up to each other. \nCameron and Boris have always had a troubled public relationship and a past that has more questions than answers. \nWill Boris be the answer for the Tories, even if we do remain in? \nI would say that a year or so ago, he would have been a shoo-in for many, mainly because he is one of the few politicians that the general public actually seems to like. \nHis bumbling, affable character is perfectly set against the slick performances of David Cameron but have his latest antics with leading the \"Leave\" campaign turned people off him? Is the mask slipping? \nIt is also interesting to see how Labour is dealing with the chaos created within the Conservative party. \nCorbyn has his own complicated history with Europe and he is under pressure to do more but despite his often rather dour public performances, I think Jeremy's sense of mischief is serving him well – he's happy for Dave and Boris to keep exchanging punches. \n\"Blue on Blue\", as it has been named, is box office for the press and a gift to the Tories' rivals. \nWill Jeremy be able to leverage the opportunity fully? \nIf not, we may be seeing a new face leading the Labour Party before long. \nSocial media is awash with people passionately giving their side of the story and urging friends and colleagues to join their way of thinking. \nWhatever your opinion, there are still many people sitting on the fence. \nMaybe the \"floating voter\" is not so engaged in the debate just yet, or maybe the messages are still not coming across clearly enough, from either camp. \nWhat is for sure is that there is now a surge of interest in the debate, evidenced by the website crashing after the recent ITV debate and the extension to the voting deadline. \nThis is a time of huge opportunity for anyone keen to leave once and for all and a time of great uncertainty and worry for those who wish to remain. \nWill it happen? \nMy gut instinct tells me that most people are still happier to stick with \"the devil they know\". \nThere was an interesting survey carried out last month by Company Check. The four-question survey canvassed 1,300 users for their thoughts on the Government's performance to date, as well as their views on the business impact, if any, of the EU referendum to date. \nIt found that two-thirds had seen no negative impact on their business caused by the EU referendum. \nI wonder whether those stats will be the same if they ran the survey again – confidence is a fragile thing as we are starting to see in the property market. \nI've certainly seen a number of larger investment deals containing Brexit clauses to hedge against uncertainty, and a change in the market if Brexit happens. \nInvestors are definitely holding off purchases until after Brexit and we are starting to see investors who have agreed deals and instructed solicitors now saying that they want to hold off exchanging contracts until after Brexit. \nIf we do leave, I don't see any specific benefits to the property industry. \nBusinesses and investors want a stable economy and European/global environment in which to trade. \nThey want certainty and don't like volatility. \nProperty is seen as a safe asset class in which to invest not just by people from the UK but in the world, including China and the US, as it offers opportunity for growth. \nAny fluctuations in the market are less significant compared to those in the FTSE. \nIf we \"Bremain\", I believe the economy will be stable and the property industry will continue to flourish and perform well. \nWe are experiencing significant rental growth which has not been experienced over the last 10 years, which is stimulating investment across all market sectors. \nThis rental growth will continue and property will outperform other asset classes which will continue to attract global investment. \nWhilst writing this article, a poll has been published, carried out by The Independent newspaper, which reveals a 10-point lead for the Leave campaign. \nThe survey of 2,000 people by ORB found that 55 per cent believe the UK should leave the EU (up four points since the Indie's last poll in April), while 45 per cent want it to remain (down four points). \nWhat is particularly interesting to note here is that when the same poll was carried out last year, Remain had a lead of 10. \nThe tables are clearly turning. I wonder what is behind this change of thinking. Maybe there is a new boldness, maybe people think that it is time for a change and to try something new – it isn't for me to say which way anyone should vote but I feel the aftermath for all will be almost as interesting as the drama that we are now watching unfold.", "external_links": [], "published": "2016-06-21T14:25:00.000+03:00", "crawled": "2016-06-21T15:50:48.354+03:00", "highlightTitle": ""}