{"organizations": [], "uuid": "80d6ed7d3fdd9b396ad5d46933281b2714baa487", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article11505649.ece/ALTERNATES/s1200/JS76956977.jpg", "site_section": "http://www.thejournal.co.uk/business/?service=rss", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/cbi-boss-highlights-eu-benefits-11505493", "country": "GB", "domain_rank": 21960, "title": "CBI boss highlights EU benefits ahead of visit to the North East", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "CBI boss highlights EU benefits ahead of visit to the North East", "spam_score": 0.0, "site_type": "news", "published": "2016-06-22T02:01:00.000+03:00", "replies_count": 0, "uuid": "80d6ed7d3fdd9b396ad5d46933281b2714baa487"}, "author": "Robert Gibson", "url": "http://www.chroniclelive.co.uk/business/business-news/cbi-boss-highlights-eu-benefits-11505493", "ord_in_thread": 0, "title": "CBI boss highlights EU benefits ahead of visit to the North East", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "CBI boss highlights EU benefits ahead of visit to the North East 00:01, 22 Jun 2016 By Robert Gibson Paul Drechsler says region is 'working', but can only continue to thrive in international trade through the opportunities within the EU Shares Get   Paul Drechsler, National President of the CBI, and former Teesside ICI worker \nAn EU referendum win for the Remain camp would help the North East cement its position as a “significant centre for international trade”, the president of business organisation, the CBI, has said in advance of a visit to the region. \nPaul Drechsler, who spent the first 10 years of his working life at ICI in Teesside, will be giving a keynote speech at the CBI North East Annual Dinner at Newcastle’s Biscuit Factory tomorrow, when he will address around 300 business leaders on the subjects of devolution, skills and membership of the European Union. \nDuring the day, Mr Drechsler will also be touring the region, meeting CBI members. \nIn an interview The Journal, he said he still retained a “soft spot” for the North East, for which the EU presented many opportunities, including the potential for more than 40,000 new jobs over the coming years. \n“When I was here in the North East in the late 1970s, it was already an outward-looking region exporting and trading around the world,” he said. “It has thrived in the international community. \n“The North East has been a significant centre for international trade for a long-time. \n“Exports from Newcastle International Airport, from example, have gone from £20m to £310m in the past 10 years. That’s absolutely fantastic, but international trade needs access to international markets. \n“The EU offers opportunities for economic growth and business investment.” \nIn the UK, the CBI represents around 190,000 businesses of all sizes and sectors. \nAccording to the latest poll from the organisation, around 80% of its members support remaining in Europe, with around 5% favouring a leave vote and 15% being undecided. \nAs far as the North East is concerned, Mr Drechsler said, sectors that could be hit particularly hard in the event of Brexit include manufacturing, aerospace and the chemical industry. \nContrary to common perceptions, he added, SMEs could also find themselves badly affected, either directly or because of the importance of the EU to their customers. \n“This is a very important decision,” Mr Drechsler said. “I am talking to companies every day and what I say is that, first of all, they should understand the impact of remaining and leaving - at least understand it. \n“Secondly, they should make sure their customers, suppliers and employees understand what it might mean for them. \n“And thirdly, whatever they do, they should encourage everybody in the organisation and make it easy for them to vote. It is really important that a decision like this is made by as many people as possible.” \nBorn and raised in Dublin, Mr Drechsler was with ICI on Teesside for a decade before spending 14 years working in Brazil, the USA and the Netherlands. \nHe then went on to become chief executive of construction firm Wates Group and is currently chairman of Bibby Group. \nMr Drechsler, who was awarded a CBE for services to the construction industry in February 2015, also chairs the board of charity Teach First and the National Skills Funding Agency. \nOn the skills gap within the North East, he said there was “no magic solution”, but were a number of steps that could be taken to improve the situation in the longer-term, including the provision of education that reflected future career opportunities, and a drive to keep girls and young women interested in STEM. \nAnd while UK productivity could be improved, there were some shining examples of success. \n“Automotive, manufacturing and technology, for example, demonstrate that we can lead the way when it comes to productivity,” Mr Drechsler said. \n“I would also suggest that the process industry has set the global benchmark for decades.” \nOverall, he added, “the North East as a region is working” - and can work even more effectively through close collaboration among business, the public sector and education. \n“Devolution is an opportunity that needs to be exploited,” he said. “Let’s get on with it.”", "external_links": [], "published": "2016-06-22T02:01:00.000+03:00", "crawled": "2016-06-22T02:11:38.530+03:00", "highlightTitle": ""}