{"organizations": ["Leicester Mercury Comments", "EU", "Lambert Smith Hampton", "Leicestershire", "Market Harborough", "APB", "APB Property Consultants", "Andrew & Ashwell"], "uuid": "27e1dce58872e12ce4e3fa946c93b1496a136aaa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/29425936/14657083.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/global-trading-can-help-county-prosper-outside-the-eu/story-29425936-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "EU Referendum: Property agents waiting to see how it will affect trade | Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "EU Referendum: Property agents waiting to see how it will affect trade | Leicester Mercury", "spam_score": 0.146, "site_type": "news", "published": "2016-06-21T14:23:00.000+03:00", "replies_count": 0, "uuid": "27e1dce58872e12ce4e3fa946c93b1496a136aaa"}, "author": "", "url": "http://www.leicestermercury.co.uk/global-trading-can-help-county-prosper-outside-the-eu/story-29425936-detail/story.html", "ord_in_thread": 0, "title": "EU Referendum: Property agents waiting to see how it will affect trade | Leicester Mercury", "locations": ["France", "Britain", "De Montfort Street", "Hong Kong", "European Union", "Brexit", "Leicester", "Europe", "UK", "Germany", "Enderby", "London"], "entities": {"persons": [{"name": "john palmer", "sentiment": "none"}, {"name": "geoff gibson", "sentiment": "none"}, {"name": "ashwell", "sentiment": "none"}, {"name": "jane taylor", "sentiment": "none"}, {"name": "peter leverett", "sentiment": "none"}, {"name": "shakespeare martineau", "sentiment": "none"}, {"name": "mather jamie", "sentiment": "none"}, {"name": "brendan walsh", "sentiment": "none"}, {"name": "james phillips", "sentiment": "none"}, {"name": "andrew granger", "sentiment": "none"}, {"name": "lambert smith hampton", "sentiment": "none"}, {"name": "walsh", "sentiment": "none"}, {"name": "fisher german", "sentiment": "none"}, {"name": "andrew", "sentiment": "none"}], "locations": [{"name": "france", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "de montfort street", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "enderby", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "leicester mercury comments", "sentiment": "negative"}, {"name": "lambert smith hampton", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}, {"name": "market harborough", "sentiment": "none"}, {"name": "apb", "sentiment": "none"}, {"name": "apb property consultants", "sentiment": "none"}, {"name": "andrew & ashwell", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["John Palmer", "Geoff Gibson", "Ashwell", "Jane Taylor", "Peter Leverett", "Shakespeare Martineau", "Mather Jamie", "Brendan Walsh", "James Phillips", "Andrew Granger", "Lambert Smith Hampton", "Walsh", "Fisher German", "Andrew"], "text": "Comments (1) \nProperty agents from the city and county say clients are waiting with baited breath to see how the EU referendum will affect trade. \nA round-table discussion in Leicester has suggested many feel the pre-referendum jitters have not hit the provinces as badly as London. \nBut they are listening carefully to speculation that European investors could pull out of the UK if we leave the European Union. \nRepresentatives of county agents including Andrew Granger, Lambert Smith Hampton, Andrew & Ashwell, Fisher German, Mather Jamie and APB attended a recent dinner in the city along with Peter Leverett, managing director of retail and leisure property consultancy Space, in Enderby. \nThe EU discussion was hosted by Brendan Walsh, property lawyer and partner at law firm Shakespeare Martineau, who said he was leaning towards a \"leave\" vote. \nMr Walsh said there had been a lot of talk in the property sector about \"Brexit clauses\" allowing investors to pull out of deals if the UK votes to leave on Thursday. \nHe said: \"I've not really seen any on our transactions. \n\"But we are seeing delays from people, and seeing things strung out with responses slowing. \n\"I had one that pulled out of a funding deal on a Scottish property. \n\"They claimed fears of a Brexit – having gone through due diligence, I took that with a pinch of salt. \n\"But we have seen delays on the funding side. \n\"I've a Hong Kong investor who is not in the slightest bit concerned if it's a Brexit – he just wants to know about currency fluctuations and whether he should wait for a possible reduction in sterling.\" \nBrendan Walsh \nMr Walsh said it seemed unlikely European neighbours would pull trade with Britain post-Brexit because of the amount of products we import from across the Channel. \nHe also said the diverse mix of businesses in Leicester and Leicestershire who looked globally for trade partners – rather than just to Europe – also put us in a good position. \nGeoff Gibson, a consultant at commercial agents Andrew and Ashwell, in Leicester, said: \"I've had one person buying a property who wondered if they should hang on until the day after to make sure, but that's the only one. \n\"I've also had an occupier saying that if it's an exit vote it could seriously affect their business, though no-one else has mentioned it.\" \nJames Phillips, partner at APB Property Consultants, in De Montfort Street, said: \"Someone told me investments were down 40 per cent because of Brexit fears, but I have not seen that here.\" \nHe was, however, concerned the EU could go into \"freefall\" if the UK left and others followed. \nHe said: \"Could it be France or Germany next? \n\"Leicester as a whole is more concerned about whether it creates economic uncertainty and whether there is recessionary pressure.\" \nJane Taylor, a director in the office agency at Lambert Smith Hampton, also in De Montfort Street, said: \"Someone in London said their market has dropped off a cliff, but I don't think that's come up at all here. \n\"Although it might be that people are holding back a little bit.\" \nProperty consultant Peter Leverett, who said he was also minded to tick the \"leave\" box, said he had seen no drop in retail work in the capital in the lead-up to the referendum. \nHe said: \"London is still storming ahead for occupier-led demand. Global investors are thinking that if they've got to expand worldwide, they will still go to London.\" \nHe said consumer demand was also still there, reflected in the continuing growth of store chains such as Market Harborough-based Joules, which he has worked with for years. \nHowever, he said the UK's flexible labour market could be hit if restrictions were put on overseas labour. \nMr Walsh also said there could be slight pressure on construction costs if the labour market was hit – with fewer people chasing jobs. \nEstate management specialist John Palmer, a partner at Market Harborough's Fisher German, said farmland prices were \"pretty static\" while profitability from farming was \"practically zero\". \nHe said: \"The Brexiters have not given any indication at all about what they will replace the Basic Payment (the EU safety net for farmers and crofters that supplements their main business income) with.\" ", "external_links": [], "published": "2016-06-21T14:23:00.000+03:00", "crawled": "2016-06-21T13:44:32.707+03:00", "highlightTitle": ""}