{"organizations": ["Newcastle Airport  Travel", "HiFX", "Sainsbury", "Bank", "Post Office", "Thomas Cook Travel", "Travelex", "Post Office Travel Money"], "uuid": "6acaa39c37f4fd82b9ae7c32739a47e9f2acb314", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article8385188.ece/ALTERNATES/s1200/JS53693497.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/should-buy-euros-today-before-11516206", "country": "GB", "domain_rank": 21960, "title": "Should I buy Euros today before the EU referendum result?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Should I buy Euros today before the EU referendum result?", "spam_score": 0.0, "site_type": "news", "published": "2016-06-23T17:35:00.000+03:00", "replies_count": 0, "uuid": "6acaa39c37f4fd82b9ae7c32739a47e9f2acb314"}, "author": "Katie Dickinson", "url": "http://www.chroniclelive.co.uk/news/north-east-news/should-buy-euros-today-before-11516206", "ord_in_thread": 0, "title": "Should I buy Euros today before the EU referendum result?", "locations": ["EU", "Eldon Square", "Brexit", "Northumberland Street", "UK", "Newcastle"], "entities": {"persons": [{"name": "chris towner", "sentiment": "none"}, {"name": "sanderson", "sentiment": "none"}, {"name": "martin lewis", "sentiment": "none"}, {"name": "ridley place", "sentiment": "none"}, {"name": "dawson", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "eldon square", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "northumberland street", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}], "organizations": [{"name": "newcastle airport  travel", "sentiment": "none"}, {"name": "hifx", "sentiment": "none"}, {"name": "sainsbury", "sentiment": "none"}, {"name": "bank", "sentiment": "none"}, {"name": "post office", "sentiment": "none"}, {"name": "thomas cook travel", "sentiment": "none"}, {"name": "travelex", "sentiment": "none"}, {"name": "post office travel money", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["Chris Towner", "Sanderson", "Martin Lewis", "Ridley Place", "Dawson"], "text": "Should I buy Euros today before the EU referendum result? 15:35, 23 Jun 2016 Newcastle travel agents have reported people queuing to get their Euros in case a 'Leave' vote sends the pound crashing Shares Get daily news by email Owen Humphreys/PA Wire A plane leaving Newcastle Airport \nTravel agents in Newcastle have seen a surge in holidaymakers flocking to snap up their travel money ahead of the EU vote . \nSeveral companies reported huge queues over the past few days as people try to grab their holiday money early in case a “Leave” vote sends the pound crashing. \nDawson and Sanderson, on Ridley Place, said the past four days had been “incredibly busy”, but that they still had plenty left in stock. \nThe eurochange centre in Eldon Square also said the weekend had been “very busy” with large volumes of customers. \nAnd a member of staff at Thomas Cook Travel on Northumberland Street said: “We have been much busier than normal this week and had a big rush on this morning. \n“Yesterday was the busiest by far – there was definitely a lot of panic buying going on.” \nThe demand for the single currency was mirrored across the country. \nPost Office Travel Money, which accounts for one in four of all UK foreign exchange transactions, said currency sales overall have surged by 74% year-on-year since the weekend. \nThe value of the pound has see-sawed amid the uncertainty over whether the UK will decide to remain in the EU or vote for a Brexit. \nThere have been warnings that a Brexit vote could trigger further falls in the pound - and some holidaymakers may be hedging their bets by changing their money ahead of the vote. \nThe pound has made some gains in recent days, rebounding from two-month lows against the dollar and the euro a week ago when Brexit concerns sent it plunging. \nBut for people going on holiday this summer, does this surge mean you should buy now, or would you be better off waiting until the result of Thursday’s referendum on whether the UK should stay in the EU or go it alone? \n“If the UK votes to ‘Leave’ the EU on Thursday, the pound will most likely nosedive in the short term, with many warning an ‘out’ result could trigger a 15% to 20% cent fall in the value of the pound,” said Chris Towner, chief economist at currency firm HiFX. \n“However, we also know that if the UK votes to stay in the EU, the pound should recover most – or all – of the losses it’s made in recent months.” \nMoneySavingExpert’s Martin Lewis has found a way to lock in today’s rate (in case of a crash) but still be able to benefit if the pound rises instead. \nThat’s because at least three of the big bureaux de change - Sainsbury’s Bank (collection only), Post Office (collection and delivery) and Travelex (collection only) - let you buy currency at today’s prices to collect in the next 7-60 days. \nThey also let you to cancel the order, sometimes for a full refund, as long as you give 24 hours’ notice, meaning if we do vote “remain” and the pound rises again, you can cancel your purchase and take full advantage of the new, higher rates.", "external_links": [], "published": "2016-06-23T17:35:00.000+03:00", "crawled": "2016-06-23T18:25:06.180+03:00", "highlightTitle": ""}