{"organizations": ["European Union", "European Health Insurance Card", "European Economic Area", "EHIC", "EU", "EEC", "Post Office Travel Money"], "uuid": "9d8c78345040a0cf8b0fa934b5aa3bb48b7c5ae0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article11521046.ece/ALTERNATES/s1200/JS66574798.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/heading-europe-how-brexit-affect-11521023", "country": "GB", "domain_rank": 21960, "title": "Heading to Europe? How will Brexit affect your passport, driving licence and holiday money?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Heading to Europe? How will Brexit affect your passport, driving licence and holiday money?", "spam_score": 0.0, "site_type": "news", "published": "2016-06-24T14:48:00.000+03:00", "replies_count": 0, "uuid": "9d8c78345040a0cf8b0fa934b5aa3bb48b7c5ae0"}, "author": "Craig Thompson", "url": "http://www.chroniclelive.co.uk/news/north-east-news/heading-europe-how-brexit-affect-11521023", "ord_in_thread": 0, "title": "Heading to Europe? How will Brexit affect your passport, driving licence and holiday money?", "locations": ["Europe", "Brexit", "Australia", "EU", "UK", "Iceland", "New Zealand", "Switzerland", "Great Britain"], "entities": {"persons": [{"name": "andrew brown", "sentiment": "none"}, {"name": "david cameron", "sentiment": "none"}, {"name": "will brexit", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "iceland", "sentiment": "none"}, {"name": "new zealand", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}, {"name": "great britain", "sentiment": "none"}], "organizations": [{"name": "european union", "sentiment": "none"}, {"name": "european health insurance card", "sentiment": "none"}, {"name": "european economic area", "sentiment": "none"}, {"name": "ehic", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "eec", "sentiment": "none"}, {"name": "post office travel money", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["Andrew Brown", "David Cameron", "Will Brexit"], "text": "Heading to Europe? How will Brexit affect your passport, driving licence and holiday money? 12:48, 24 Jun 2016 So we're out. But what will that mean for the millions of North Easteners who travel to Europe every year? Shares Get daily news by email Katie Collins/PA Wire A British passport \nHolidays are booked, the hire car is sorted and you’re ready for that break in the sun. Will Brexit affect your plans? \nMillions of North Easterners travel in Europe every year using the EHIC card and our driving licences are EU branded. So what happens now? Passport and driving licence \nThough UK passports and driving licences are “EU-branded”, we will not need to get new ones - yet. \nYou have the European Union to thank for your driving licence’s design. Their format was agreed in order to standardise and replace the 110 different plastic and paper driving licences of the 300 million drivers in the European Economic Area. \nIf you are a British citizen, the first two words on your passport’s front cover are “European Union”. Driving Licence both paper and plastic shown \nBritons used to have a simpler passport with a dark blue cover, but it was replaced by the EU’s preferred burgundy coloured format in late 1988. \nFor the time being new UK driving licences will continue to show the EU symbol and British passports will bear words “European Union” on the cover. \nBut within a few years, when you renew either your passport or driving licence the design will change. Exchange rate Euros and holiday makers \nWill getting Euros cost more? \nObviously the strength of the pound abroad will always fluctuate and there are fears that due to Brexit, it could become far weaker before it becomes stable. \nThe value of the British pound dropped more than six per cent against the Euro as the Brexit vote was confirmed and Prime Minister David Cameron resigned. \nAnyone who bought their Euros on Wednesday and Thursday is in a better position than they would be today. \nIf weak Pound-Euro rates continue, our summer holiday will be more expensive. Andrew Brown of Post Office Travel Money, which accounts for around a quarter of all UK foreign exchange transactions, today urged holidaymakers to “watch currency movements very carefully”. Video loading Click to play Tap to play The Live Event you are trying to watch is either unavailable or has not started Please refresh this page in your browser to reload this live event video European Health Insurance Card (EHIC) \nMillions of us Brits rely on our European Health Insurance Card (EHIC) when travelling on the continent but what will happen to it now as Great Britain chooses to leave the EU? \nAn up to date EHIC means you are entitled to the same level of healthcare as a resident of the European country you are visiting. It’s not a cover-all replacement for travel insurance should something go wrong, but it certainly helps. \nThanks to the EU, British people are entitled to a free EHIC, which replaced the old E111 cards. This gives us the right to access healthcare for free when visiting other European countries. \nRemain campaigners said that following a leave vote, Brits could lose access to this vital service. The only way to get care in Europe would be to take out costly private insurance. \nBut those on the leave side pointed to Switzerland and Iceland as just two examples of countries outside the EU that use the EHIC scheme. \nThey claimed it was scaremongering to claim British holidaymakers would lose access to European healthcare after a Leave vote. \nIt is in the EU’s interest to continue the arrangement as the UK has given £5.8bn more to EU countries for medical costs than we’ve got back, they say. \nBefore joining the EEC, the UK had reciprocal health agreements with many European nations and still maintains bilateral deals with 16 countries, including Australia and New Zealand. \nIt is likely that a similar range of deals would be concluded with some or all EU members. If they are not, then the need for travel insurance will increase - and premiums could rise. More on the EU Referendum", "external_links": [], "published": "2016-06-24T14:48:00.000+03:00", "crawled": "2016-06-24T15:59:45.858+03:00", "highlightTitle": ""}