{"organizations": [], "uuid": "40266bb89cf3a78b1189527c74db2cd684dc4f27", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/29426691/14657967.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/vote-leave-campaign-takes-to-the-skies-above-leicester-as-foxes-declare-for-remain/story-29426691-detail/story.html", "country": "US", "domain_rank": 48128, "title": "Vote Leave campaign takes to the skies above Leicester as Foxes declare for Remain | Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "Vote Leave campaign takes to the skies above Leicester as Foxes declare for Remain | Leicester Mercury", "spam_score": 0.001, "site_type": "news", "published": "2016-06-21T16:28:00.000+03:00", "replies_count": 0, "uuid": "40266bb89cf3a78b1189527c74db2cd684dc4f27"}, "author": "", "url": "http://www.leicestermercury.co.uk/vote-leave-campaign-takes-to-the-skies-above-leicester-as-foxes-declare-for-remain/story-29426691-detail/story.html", "ord_in_thread": 0, "title": "Vote Leave campaign takes to the skies above Leicester as Foxes declare for Remain | Leicester Mercury", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Vote Leave campaign takes to the skies above Leicester as Foxes declare for Remain By danjmartin | Posted: June 21, 2016 0 COMMENTS SHARES The Vote Leave plane over Leicester Vote Leave campaign takes to the skies above Leicester as Foxes declare for... X \nCopy link to paste in your message / Comments (0) \nThe Vote Leave campaign has taken to the skies above Leicester as the European Union referendum approaches. \nA plane circled the city centre at lunch time pulling a large banner urging people to cast a ballot for quitting the EU on Thursday. \nThe turboprop Islander plane was put in the air by aircraft manufacturer Britten-Norman, the UK's only privately owned civil aircraft manufacturer, which supports Brexit. \nIt has been touring the country ahead of the vote. \nThe firm's chief executive William Hynett said: \"The largest single threat to our business comes from EU directives and the other regulations imposed by its various institutions – these burdens are already forcing us to migrate part of our supply chain and some of our jobs outside the EU and we predict that this is a trend that is likely to continue should Britain choose to remain within the EU.\" \nRead more: Safety alert after more brutal robberies in Leicester's West End \nMeanwhile Premier League champions Leicester City have backed remaining in the EU along with the other clubs in England's top flight. \nPremier League executive chairman Richard Scudamore said: \"There is an openness about the Premier League which I think it would be completely incongruous if we were to take the opposite position. \n\"We would just be, I think, respected less around the world for not wanting to be part of something.\" \nFormer Foxes star Neil Lennon also backs the campaign to remain in Europe. \nHe said said: \"We need to continue to invest in talent at the grassroots and, for the thousands of young people starting out in their sport, every last penny is vital. \n\"At the moment, EU funding promotes UK sport at the local level and funding for school sport is essential too, and this is at risk if we decide to leave.\" ", "external_links": [], "published": "2016-06-21T16:28:00.000+03:00", "crawled": "2016-06-21T16:16:59.996+03:00", "highlightTitle": ""}