{"organizations": ["EU", "Labour", "TUC", "European Union", "Brady/PA Wire Jeremy Corbyn  Meanwhile Labour", "Sunderland", "Newcastle", "Sunderland South", "NHS", "UKIP"], "uuid": "6e598d58be2518c882d710e485f1b2ef875a8f3a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article11119619.ece/ALTERNATES/s1200/JS85885470.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/eu-referendum-result-go-wrong-11522341", "country": "GB", "domain_rank": 21960, "title": "EU referendum result: Where did it all go wrong for the Remain campaign in the North East", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "EU referendum result: Where did it all go wrong for the Remain campaign in the North East", "spam_score": 0.0, "site_type": "news", "published": "2016-06-24T17:44:00.000+03:00", "replies_count": 0, "uuid": "6e598d58be2518c882d710e485f1b2ef875a8f3a"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/eu-referendum-result-go-wrong-11522341", "ord_in_thread": 0, "title": "EU referendum result: Where did it all go wrong for the Remain campaign in the North East", "locations": ["North East", "Britain", "West Midlands", "England", "Houghton", "EU", "UK", "Newcastle", "North East England"], "entities": {"persons": [{"name": "jeremy corbyn", "sentiment": "none"}, {"name": "jonathan", "sentiment": "none"}, {"name": "bridget philipson", "sentiment": "none"}, {"name": "david cameron", "sentiment": "none"}, {"name": "vince cable", "sentiment": "none"}, {"name": "vince", "sentiment": "none"}, {"name": "jonathan arnott", "sentiment": "none"}, {"name": "cameron", "sentiment": "none"}, {"name": "george osborne", "sentiment": "none"}, {"name": "nigel farage", "sentiment": "none"}, {"name": "osborne", "sentiment": "none"}, {"name": "daniel leal-olivas", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "west midlands", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "houghton", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "north east england", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "tuc", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "brady/pa wire jeremy corbyn  meanwhile labour", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "sunderland south", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["Jeremy Corbyn", "Jonathan", "Bridget Philipson", "David Cameron", "Vince Cable", "Vince", "Jonathan Arnott", "Cameron", "George Osborne", "Nigel Farage", "Osborne", "Daniel Leal-Olivas"], "text": "The video will start in 8 s Cancel Click to play Tap to play The Live Event you are trying to watch is either unavailable or has not started Please refresh this page in your browser to reload this live event video \nAs a result it could not have been more emphatic - 58% of North East voters were in favour of leaving the European Union, 42% to stay. \nOnly in the West Midlands was there a larger margin of victory for Leave in Britain. \nYet the North East is a Labour stronghold and Labour was for Remain. It has a strong union base and the TUC also came out for Remain. \nSo why did the North East choose to ignore both the Labour party and the unions to vote for Brexit? \nThe region has benefited more than any other in the country from EU funding which specifically targets deprived areas. \nYet as the extent of the Leave vote emerged across the region, former business secretary and Remain campaigner Sir Vince Cable, said: “I think people in the highly-deprived areas of the North East are expressing their frustration in this way.” Former Business Secretary Vince Cable \nAnd immigration, one of the central planks of the Brexit campaign, in theory should not have been issue in the North East. \nOfficial figures show that 59,000 people currently living in the region are immigrants who have arrived in the UK since 2004 and half of these, just over 29,000, come from EU countries. Not a flood and barely a trickle. \nSo why did Nigel Farage, leader of a UKIP party which has put immigration control at the centre of its policy have cause to tweet: “So happy with the results in North East England.” \nIt’s an accepted political fact of life that in times of struggle and austerity, those suffering hardship move to the right, as has been the case in the North East. \nAt recent local elections and the last general election, support for UKIP has soared, mainly at the expense of Labour . One of the region’s three MEPs is Jonathan Arnott of UKIP. \nAnd with its talk of economic migrants taking jobs, claiming benefits and taking advantage of the NHS, no matter how spurious the claims, they struck a chord with the region’s voters. Jonathan Brady/PA Wire Jeremy Corbyn \nMeanwhile Labour leader Jeremy Corbyn has been accused of being conspicuous by his absence from the North East in the run up to the EU vote and conducting a lacklustre campaign. \nBut for years before his September 2015 election as leader, the feeling of being cut off from the rest of England has been palpable with the region always at the sharp end of jobless figures and investment. \nIt has suffered more than any other part of Britain because of austerity policies leading to public sector and benefits cuts imposed by Prime Minister David Cameron’ s Chancellor George Osborne. \nSo with Cameron and Osborne at the forefront of the Remain campaign putting their jobs and credibility on the line, the EU referendum provided an unmissable opportunity to give both a bloody nose. \nAnd there was the fact Remain largely based its campaign on the economic harm leaving the EU would do. \nFor a large swathe of the North East this was irrelevant as their place in the economy was not a great one. This meant they had nothing to lose by voting for a change. Daniel Leal-Olivas - WPA Pool/Getty Images Chancellor George Osborne delivers a speech on the potential economic impact to the UK on leaving the European Union \nAs Bridget Philipson, the Labour MP for Houghton and Sunderland South, said of the result: “It is a reflection on the fact that people in the North East feel that time and time again we’re left behind. \n“When it comes to jobs and investment, support from this government is found to be lacking.” \nRevenge came just after midnight when in quick succession Newcastle and then Sunderland became the first local authorities in England to declare. \nPundits had said Remain should expected a 12 percentage point win in Newcastle to be on track for victory. It turned out to be just 1.4%. \nTo use a boxing analogy, that was the set up jab for the KO blow which was delivered by Sunderland. \nThe same pundits said for Leave to have a chance of winning nationally it had to claim Wearside by at least six percentage points. In the end, it won by 22.6%. \nYet the writing was on the wall in the run up to the vote. While scientific polls continued to say it was too close to call, a simple barometer of work place feeling showed a strongly pro-Leave sentiment. It was also evident among those who attended debates and hustings events. \nIn the end, more than 500,000 North East people voted for change from a system it feels has done them no favours for years. Whether it will be a change for the better remains to be seen.", "external_links": [], "published": "2016-06-24T17:44:00.000+03:00", "crawled": "2016-06-24T18:35:29.946+03:00", "highlightTitle": ""}