{"organizations": ["EU", "European Union", "St Andrews Newcastle"], "uuid": "36ebac78d05f2c5319b5c93767d9f9b8127e484d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article11515945.ece/ALTERNATES/s1200/JS93292592.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-opinion/im-writing-column-day-eu-11517024", "country": "GB", "domain_rank": 21960, "title": "I'm writing this column on the day of the EU referendum knowing it will be read afterwards...", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "I'm writing this column on the day of the EU referendum knowing it will be read afterwards...", "spam_score": 0.0, "site_type": "news", "published": "2016-06-24T02:01:00.000+03:00", "replies_count": 0, "uuid": "36ebac78d05f2c5319b5c93767d9f9b8127e484d"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-opinion/im-writing-column-day-eu-11517024", "ord_in_thread": 0, "title": "I'm writing this column on the day of the EU referendum knowing it will be read afterwards...", "locations": ["Brexit", "UK", "EU"], "entities": {"persons": [{"name": "graeme whitfield", "sentiment": "none"}, {"name": "jo cox", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "nigel farage", "sentiment": "none"}, {"name": "boris", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "st andrews newcastle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["Graeme Whitfield", "Jo Cox", "Trump", "Brexit", "Nigel Farage", "Boris"], "text": "I'm writing this column on the day of the EU referendum knowing it will be read afterwards... 00:01, 24 Jun 2016 Journal business editor Graeme Whitfield plots the tricky path of writing about the EU referendum result before it's happened Shares Get business news by email Simon Greener Polling stations across the region for the EU referendum St Andrews Newcastle \nI am writing this column on the day of the EU referendum knowing that it will be read when we know the result, which makes things a bit tricky. \nGiven another 24 hours, I would be saying either “phew, that’s a relief” or “oh my God, what have you done?”, but deadlines are deadlines. Instead I have to try and make some sense of the last six months without knowing how the vote has gone. \nFinding sense from a singularly depressing bout of political catfighting is going to be tricky too. The public have been given the choice between Project Fear and Project Hate and as a result, many people on both sides have voted with a heavy heart. It’s not been a great advert for democracy. \nI find myself scratching my head too to make sense of the fact that, a day after people held up cards saying “more in common” (in honour of murdered MP Jo Cox), around half the country will vote one way and roughly half the other. \nHow also to explain that, six months after appalling images of a dead Kurdish boy on a Turkish beach sparked waves of compassion to refugees, Nigel Farage could stand in front of a poster that echoed Nazi propaganda? \nI agree wholeheartedly with Jo Cox that we have more in common than what divides us. But on a number of issues there are divisions in the country that right now run very deep. \nThe one thing I can say with certainty is that, whatever happens between me typing this and you reading this, business as usual is not going to be an option. \nIf we stay in the EU , it is clear that the institution needs to be fundamentally reformed. The benefits of a single market have not translated to millions of people in the UK and that needs to addressed. \nIf we leave, well, strap yourselves in and await the chaos. \nI would, however, make a simple plea that, in the event of Brexit, my social media feeds are not filled with laments about how stupid/selfish/racist people are. If we are out of the European Union, we will need more than ever to protect people’s jobs and send the message to the world that we are not an insular nation longing for past glories. \nIt is not impossible that the next few months could bring us Brexit, Prime Minister Boris and President Trump (and that’s not so much Project Fear as Project Absolute Bloody Terror). \nBut the fundamental decencies that have fleetingly been on show of late – around the migrant crisis, following Jo Cox’s awful killing - will remain and we will need to fight for them more than ever. \nGraeme Whitfield is business editor of The Journal More on the EU Referendum", "external_links": [], "published": "2016-06-24T02:01:00.000+03:00", "crawled": "2016-06-24T02:29:51.340+03:00", "highlightTitle": ""}