{"organizations": ["Venerable Bede Church of England Academy", "Chester-le-Street", "East Durham College", "Yorkshire", "Venerable Bede CE Academy", "Durham", "Durham County Cricket Club", "EU", "Newcastle", "House of Lords", "Jun 2016 Rt", "European Union", "Upper Teesdale Agricultural Support Service", "Tunstall Bank", "Sunderland", "Houghall Campus", "Lesotho Royal Lifesaving Society"], "uuid": "61aa88a8f8dc0149ae1be17908cfe1535017151f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article11522713.ece/ALTERNATES/s1200/JS93402609.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/bishop-durham-calls-checkmate-brexit-11522421", "country": "GB", "domain_rank": 21960, "title": "Bishop of Durham calls checkmate on Brexit as he plays host to South African King and Queen", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Bishop of Durham calls checkmate on Brexit as he plays host to South African King and Queen", "spam_score": 0.0, "site_type": "news", "published": "2016-06-24T17:53:00.000+03:00", "replies_count": 0, "uuid": "61aa88a8f8dc0149ae1be17908cfe1535017151f"}, "author": "Lisa Hutchinson", "url": "http://www.chroniclelive.co.uk/news/north-east-news/bishop-durham-calls-checkmate-brexit-11522421", "ord_in_thread": 0, "title": "Bishop of Durham calls checkmate on Brexit as he plays host to South African King and Queen", "locations": ["Durham", "Chester-le-Street", "Britain", "Auckland Castle", "Emirates Riverside Stadium", "EU", "Europe", "Lesotho", "North East", "Sunderland", "Brexit", "Gateshead", "South Africa"], "entities": {"persons": [{"name": "bishop", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "tyne", "sentiment": "none"}, {"name": "david cameron", "sentiment": "none"}, {"name": "rev margaret bianchi", "sentiment": "none"}, {"name": "rev butler", "sentiment": "none"}, {"name": "masenate mohato seeiso", "sentiment": "none"}, {"name": "rt rev butler", "sentiment": "none"}, {"name": "paul butler", "sentiment": "none"}, {"name": "rev paul butler", "sentiment": "none"}, {"name": "ry rev butler", "sentiment": "none"}, {"name": "lieutenancy", "sentiment": "none"}], "locations": [{"name": "durham", "sentiment": "none"}, {"name": "chester-le-street", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "auckland castle", "sentiment": "none"}, {"name": "emirates riverside stadium", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "lesotho", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "south africa", "sentiment": "none"}], "organizations": [{"name": "venerable bede church of england academy", "sentiment": "none"}, {"name": "chester-le-street", "sentiment": "none"}, {"name": "east durham college", "sentiment": "none"}, {"name": "yorkshire", "sentiment": "none"}, {"name": "venerable bede ce academy", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "durham county cricket club", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "house of lords", "sentiment": "none"}, {"name": "jun 2016 rt", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "upper teesdale agricultural support service", "sentiment": "none"}, {"name": "tunstall bank", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "houghall campus", "sentiment": "none"}, {"name": "lesotho royal lifesaving society", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["Bishop", "Brexit", "Tyne", "David Cameron", "Rev Margaret Bianchi", "Rev Butler", "Masenate Mohato Seeiso", "Rt Rev Butler", "Paul Butler", "Rev Paul Butler", "Ry Rev Butler", "Lieutenancy"], "text": "Bishop of Durham calls checkmate on Brexit as he plays host to South African King and Queen 15:53, 24 Jun 2016 Rt Rev Paul Butler said the North East has to work together in the wake of Brexit while playing host to the King and Queen of Lesotho Shares The video will start in 8 s Cancel Click to play Tap to play The Live Event you are trying to watch is either unavailable or has not started Please refresh this page in your browser to reload this live event video \nThe Bishop of Durham called checkmate on the Brexit bombshell as he played host to a South African King and Queen. \nAnd he told of his “surprise” when he woke up to hear Britain had voted to leave the European Union but said the North East had to unite and work with the nation to “further our future”. \nThe Right Reverend Paul Butler made his views public earlier this month when he declared his support for the Remain campaign, speaking at Auckland Castle, the historic seat of the Bishop of Durham. \nHe argued the country will need to do a great deal of “healing” after the referendum, no matter what the outcome of the vote. \nAnd only hours after hearing the news that Prime Minister David Cameron had declared he would stand down in October after 52% of the country voted to leave the EU and 48% wanted to remain, the Rt Rev Butler said: “When I woke up this morning and heard the final result I was, purely inside, I felt sad. But the decision has been made and we have to move forward and build a good nation so we can further our future.” The Bishop of Durham takes questions on the outcome of the EU referendum during the visit of King and Queen of Lesotho to the Venerable Bede CE Academy in Sunderland \nThe voting figures showed how the North East turned its back on the EU, with a whopping 58% voting for a Brexit in the referendum. \nIn all, 1.34 million turned out to vote across the region - with 778,103 siding with leave and 562,595 with remain, meaning a resounding victory. \nEvery North East authority beside Newcastle - which only marginally voted remain - bolted for the exit door. \nRt Rev Butler, the region’s most senior religious figure who sits in the House of Lords, said he was “surprised” with the North East’s decision to leave the EU “particularly with how much Europe has put into the region.” \nRt Rev Butler made his feelings heard during a royal visit to celebrate the 30 years link between the Diocese of Durham and South Africa’s Lesotho. The Bishop of Durham takes questions on the outcome of the EU referendum during the visit of King and Queen of Lesotho to the Venerable Bede CE Academy in Sunderland, the King and Queen arrive \nAnd while he played host to its King and Queen during their visit to Venerable Bede Church of England Academy in Sunderland, he added it was now “important that we seek to work together” and “the North East will go predominantly seeking to be the best as a region and for the best as a nation as a whole.” \nThe Durham-Lesotho LINK was organised after Rt Rev Butler visited Lesotho in 2015 and made a personal invite to King Letsie III and Queen Masenate Mohato Seeiso to mark the occasion. \nThe royal party is visiting a range of locations during three days in the Diocese from Friday, June 24, to Sunday, June 26. Each of the locations visited has been chosen to represent the LINK and other areas of interest to the royals. Throughout the visit, Ry Rev Butler, Lord Lieutenancy of Durham and Lord Lieutenant of Tyne and Wear for the Sunderland and Gateshead elements of the visit and members of the LINK will accompany the royal party. Pupils shelter from the rain \nAmongst the places being visited include: Venerable Bede Church of England Academy in Tunstall Bank, Sunderland - a frequent participant in LINK activities; The National Glass Centre to see Durham craftsmen at work; Durham County Cricket Club, Emirates Riverside Stadium, Chester-le-Street, to watch Durham play Yorkshire in 20:20 Cricket; East Durham College’s Houghall Campus, Durham and the Upper Teesdale Agricultural Support Service - recognising the King’s interest in farming; and a service of celebration of the 30 years of the LINK in Chester-le-Street. \nThe Rev Margaret Bianchi, Executive Director of the Durham-Lesotho LINK, said: “The King has often attended significant LINK events in Lesotho, he is also patron of the Lesotho Royal Lifesaving Society which the LINK set up, so it is fantastic that he is able to be here and for us to show him around the Diocese taking in places and areas of mutual interest. \n“The Link is important because of its long term commitment to Lesotho, particularly working with youth and vulnerable people. It models a realistic style of sustainability and, through the partnership, enables people in Durham to gain an understanding of developing world issues.” More on the EU Referendum", "external_links": [], "published": "2016-06-24T17:53:00.000+03:00", "crawled": "2016-06-24T18:35:27.218+03:00", "highlightTitle": ""}