{"organizations": ["European Union", "European Economic Area", "EU", "Bank of England", "Eurosceptic"], "uuid": "5a727c42979b712d1d090fc603ae9a338d3725cb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article11512801.ece/ALTERNATES/s1200/JS93239831.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/how-long-would-take-leave-11512749", "country": "GB", "domain_rank": 21960, "title": "How long would it take to leave the EU if we vote for a Brexit?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "How long would it take to leave the EU if we vote for a Brexit?", "spam_score": 0.0, "site_type": "news", "published": "2016-06-23T10:14:00.000+03:00", "replies_count": 0, "uuid": "5a727c42979b712d1d090fc603ae9a338d3725cb"}, "author": "nechronicle", "url": "http://www.chroniclelive.co.uk/news/north-east-news/how-long-would-take-leave-11512749", "ord_in_thread": 0, "title": "How long would it take to leave the EU if we vote for a Brexit?", "locations": ["EU", "France", "Britain", "European Union", "North East", "Birmingham", "Leeds", "Brexit", "Europe", "UK", "Germany", "Norway", "the Netherlands"], "entities": {"persons": [{"name": "chris grayling", "sentiment": "none"}, {"name": "geoff", "sentiment": "none"}, {"name": "michael gove", "sentiment": "none"}, {"name": "david cameron", "sentiment": "none"}, {"name": "gordon brown", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "boris johnson", "sentiment": "none"}, {"name": "jasmine watkiss", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}, {"name": "leeds", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "norway", "sentiment": "none"}, {"name": "the netherlands", "sentiment": "none"}], "organizations": [{"name": "european union", "sentiment": "none"}, {"name": "european economic area", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "bank of england", "sentiment": "none"}, {"name": "eurosceptic", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["Chris Grayling", "Geoff", "Michael Gove", "David Cameron", "Gordon Brown", "Theresa May", "Brexit", "Boris Johnson", "Jasmine Watkiss"], "text": "How long would it take to leave the EU if we vote for a Brexit? 08:14, 23 Jun 2016 08:15, 23 Jun 2016 By Jasmine Watkiss As voters head to polling station across the North East on Thursday, we look at the process of leaving the EU if the public chooses to do so Shares The video will start in 8 s Cancel Click to play Tap to play The Live Event you are trying to watch is either unavailable or has not started Please refresh this page in your browser to reload this live event video \nAccording to the latest polls, the opinions of the British public are fairly evenly split with regards to the EU referendum . \nLeaving the EU would certainly represent a significant change in British politics and for society at large, issues discussed at length in the media. But one question has yet to be properly addressed: if Brexit is decided upon, how long would it really take Britain to fully leave the European Union ? \nThe counting of the votes will begin at the 382 stations across the UK soon after the polls close at 10pm, and we will know the outcome of the referendum on Friday, June 24. \nBelow, we’ve taken a look at what happens if the public chooses a Brexit. \nEU Referendum LIVE: Updates as the North East heads to the polls How long would it take to leave? \nMany people are preoccupied with how long it would take to completely withdraw from the EU. According to experts, the minimum time period following a vote to leave would be two years, although it may take considerably longer. \nThroughout this time, the UK would be obliged to obey EU treaties and laws, but would not be able to take part in any decision-making, as a withdrawal agreement would not allow for UK influence in EU policies. This would mean that the earliest that we would be fully politically divorced from the EU would be by the end of June 2018. Vote Remain and Vote Leave signs on a lamp post in Leeds ahead of the EU referendum What would happen first? \nIf the majority of the nation’s votes decide that Britain will leave the EU, it is likely that a domino effect will ensue, both inside the UK and globally, causing several occurrences to happen at once. Some sources suggest it is possible that David Cameron will resign as prime minister in order to make way for another Tory leader in favour of the out vote, who will begin the Brexit process. \nLikely candidates for a replacement PM include Boris Johnson, Theresa May, and Michael Gove. What are the next steps involved in the UK’s leaving process? \nBritish politicians would begin in-depth renegotiations with Europe and would be forced to set up new trade agreements both with Europe and the rest of the world. There is a possibility that EU leaders will complicate this process to deter any other EU member states from following in Britain’s example. Geoff Caddick/PA Wire Former prime minister Gordon Brown takes part in a Britain Stronger In Europe rally in Birmingham ahead of the EU referendum What major changes would occur? \nNobody can say for certain what impacts Brexit would have on the UK, and it may take years for the effects to be keenly felt, as the process would be a gradual one. The economic repercussions of Brexit are likely to be substantial, due to the fact that most financial markets believe that Britain will vote to remain. \nIf the UK leaves the EU, it is probable that the value of the pound would drop even lower than it has in the lead up to the referendum. Share prices will also fall noticeably, particularly banking stocks and multinationals. The Bank of England may increase interest rates in order to stop the sterling plummeting any further, which would affect the general public in the form of higher costs of mortgages and loans. \nThere is mush debate regarding what might happen to British house prices. Although no EU citizens will be asked to leave, some concerns exist that millions of EU citizens will voluntarily quit the UK, creating a flood of vacant housing. Other factors that will effect house prices will be the aforementioned interest rates, and the general state of the newly independent British economy. \nMany British laws and acts will have to be reassessed and potentially rewritten, as many of them coincide with EU legislation. These laws cover a tremendous variety of issues, including employment rights, environmental protection, and migration. However, if Britain chose to adopt Norway’s model and remain in the European Economic Area, most of the EU-derived laws would be maintained. Video loading Click to play Tap to play The Live Event you are trying to watch is either unavailable or has not started Please refresh this page in your browser to reload this live event video What would happen in Europe and the EU? \nOn June 28 and 29, EU leaders will meet to discuss the result, and if Brexit prevails, Britain will cause the EU’s Article 50 to take effect; the law that would set in motion the two-year period of the UK’s political detachment from the EU. \nHowever, Eurosceptic cabinet minister Chris Grayling says that Article 50 should not be triggered immediately, which could set back the final Brexit to 2019. \nAn emergency summit may also be convened in the EU should Vote Leave succeed, alongside an emergency meeting of eurozone finance ministers. A Brexit result would hugely impact the global economy at large. \nCertainly, upon a confirmation of Britain’s out vote, EU leaders will be hard at work defending the integrity of the Union, and its values, as Eurosceptic politicians from across Europe will use a Brexit outcome to promote their own independence from the entity, such as anti-EU populist parties in France, Germany and the Netherlands, which all have crucial elections in 2017. The European Union debate", "external_links": [], "published": "2016-06-23T10:14:00.000+03:00", "crawled": "2016-06-23T11:18:09.966+03:00", "highlightTitle": ""}