{"organizations": ["European Union", "EU", "House of Lords"], "uuid": "8a439868bfe032aba2d66235dc19711df0e3d541", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article11456023.ece/ALTERNATES/s1200/JS92199557.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/why-should-stay-eu-bishop-11455450", "country": "GB", "domain_rank": 21960, "title": "'Why we should stay in the EU' - Bishop of Durham speaks out", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "'Why we should stay in the EU' - Bishop of Durham speaks out", "spam_score": 0.0, "site_type": "news", "published": "2016-06-11T07:30:00.000+03:00", "replies_count": 0, "uuid": "8a439868bfe032aba2d66235dc19711df0e3d541"}, "author": "Laura Hill", "url": "http://www.chroniclelive.co.uk/news/north-east-news/why-should-stay-eu-bishop-11455450", "ord_in_thread": 0, "title": "'Why we should stay in the EU' - Bishop of Durham speaks out", "locations": ["Britain", "Scotland", "North East", "Durham", "Auckland Castle", "England", "Northern Ireland", "UK", "EU", "Wales", "London", "United Kingdom"], "entities": {"persons": [{"name": "revd paul butler", "sentiment": "none"}, {"name": "bishop", "sentiment": "none"}, {"name": "rt rev butler", "sentiment": "none"}, {"name": "paul butler", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "auckland castle", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "wales", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}], "organizations": [{"name": "european union", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "house of lords", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["Revd Paul Butler", "Bishop", "Rt Rev Butler", "Paul Butler", "Brexit"], "text": "The video will start in 8 s Cancel Click to play Tap to play The Live Event you are trying to watch is either unavailable or has not started Please refresh this page in your browser to reload this live event video \nA vote to leave the EU could tear apart the United Kingdom – the Bishop of Durham has warned. \nVoters will go to the polls on June 23 for the once in a generation chance to vote on the UK’s future in the European Union and as the debate on whether to stay or go heats up the Bishop has spoken out. \nThe Right Reverend Paul Butler declared his support for the Remain campaign on Friday, speaking at Auckland Castle, the historic seat of the Bishop of Durham . \nRt Rev Butler argued the country will need to do a great deal of “healing” after the referendum , no matter what the outcome of the vote. \nHe said: “What happens if Northern Ireland, Scotland and Wales vote to stay and England votes to leave? What if London votes to stay and other regions vote to leave? \n“The vote to leave raises serious concerns about the unity of the nation.” \nThe Rt. Revd Paul Butler, Bishop of Durham \nALSO READ: Brexit would cost North East universities £29m claim university bosses \nThe North East’s most senior religious figure added his support to the remain campaign after months of thinking and praying, he said. \nRt Rev Butler said that he believes a vote to remain in the EU is the best thing for the UK as a whole. \nHe said: “At our best Britain is a generous, welcoming, hospitable nation that has a wider role in the world. Being art of the EU is the best way to support and express that.” \nThe Bishop, who sits in the House of Lords said his decision to come out and support one side of the referendum was partly driven by his disappointment at the rhetoric of the campaigns so far. \nHe said: “I have been very deeply concerned that this while debate has been reduced to being about economic and migration. \n“It is about peace, the well-being of ordinary people, how we engage with the world. It is much bigger than simply economics or migration. \n“I think a lot of the tone has been very unfortunate, it’s become too personalised in some instances. It’s become too focused on economics and migration when for me it’s about peace and wellbeing of nations together.” \nThe Bishop refrained from giving voters direction how to vote and said: “People must make up their own minds and then go out and vote on the day.” \nEarlier this week he signed a letter along with over 150 senior business leaders, who say the region could face financial difficulties if the nation voted to leave the EU. \nHe added: “For the North East, being part of the EU has been really important for manufacturing, for farming. We as a region feel the benefits of being in the EU. \n“I believe it is the best thing for the North East, and the nation as a whole.” The European Union debate", "external_links": [], "published": "2016-06-11T07:30:00.000+03:00", "crawled": "2016-06-11T08:25:38.425+03:00", "highlightTitle": ""}