{"organizations": ["EU", "St Andrews Newcastle  Gateshead"], "uuid": "35d9d81b45034f108cc71ada9ec5667bad57f516", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article11515945.ece/ALTERNATES/s1200/JS93292592.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/eu-referendum-gateshead-voter-expresses-11516835", "country": "GB", "domain_rank": 21960, "title": "EU Referendum: Gateshead voter expresses concerns about pencils at polling stations", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "EU Referendum: Gateshead voter expresses concerns about pencils at polling stations", "spam_score": 0.0, "site_type": "news", "published": "2016-06-23T18:59:00.000+03:00", "replies_count": 0, "uuid": "35d9d81b45034f108cc71ada9ec5667bad57f516"}, "author": "Laura Hill", "url": "http://www.chroniclelive.co.uk/news/north-east-news/eu-referendum-gateshead-voter-expresses-11516835", "ord_in_thread": 0, "title": "EU Referendum: Gateshead voter expresses concerns about pencils at polling stations", "locations": ["Gateshead", "Hardwick", "Salters Lane Community Centre", "Felling", "Chichester", "EU", "UK"], "entities": {"persons": [{"name": "stockton lee dyson", "sentiment": "none"}, {"name": "jacqueline jackson", "sentiment": "none"}, {"name": "anthony cummings", "sentiment": "none"}], "locations": [{"name": "gateshead", "sentiment": "none"}, {"name": "hardwick", "sentiment": "none"}, {"name": "salters lane community centre", "sentiment": "none"}, {"name": "felling", "sentiment": "none"}, {"name": "chichester", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "st andrews newcastle  gateshead", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["Stockton Lee Dyson", "Jacqueline Jackson", "Anthony Cummings"], "text": "The video will start in 8 s Cancel Click to play Tap to play The Live Event you are trying to watch is either unavailable or has not started Please refresh this page in your browser to reload this live event video \nThe electoral commission has moved to allay worries over voting with a pencil after conspiracy theories started to appear on social media. \nWorried voters, mainly Leave campaign supporters, have taken to social media to urge people to #UsePens to vote out of the EU , fearing pencil votes on ballot papers could be rubbed out. \nA spokesperson for the electoral commission reiterated that there is no law to say whether voters should use a pen or a pencil in polling stations. \nPencils are provided at polling stations for historic reasons, and because they are less likely to break or run out than a pen. \n“If someone wants to use a pen that is fine,” the spokesperson said. “We would say be careful that the ink has dried before they fold the ballot paper in case it smudges, people just need to make sure their mark is clear and we would ask them to take their pen out of the polling booth with them.” Simon Greener Polling stations across the region for the EU referendum St Andrews Newcastle \nGateshead voter Anthony Cummings said he was shocked to find only pencils at the polling station in Felling, Gateshead . \nHe said: “I refuse to use a pencil, I asked someone and thankfully they were able to lend me a pen so I could cast my vote. \n“I think it would be so easy for them to rub it out, it should be in ink, I am 54 years old and this is the most important vote of my lifetime. I am sure I have used a pen every other election.” \nOver in Stockton Lee Dyson, 36, of Hardwick, has been sitting outside the Salters Lane Community Centre lending pens to those who want to vote. \nHe said: “When I went in, it was just pencils and I thought ‘why? There’s no reason?’ \n“I checked and found out you can use pens, so I decided to make sure other people knew that too by sitting outside today, handing them out. \n“They didn’t like it when I first turned up. They tried to move me on, but then I was allowed to stay. \n“A lot of people have brought their own pens because of what’s been on the internet, but a lot haven’t and were happy to get one to take in.” \nElsewhere in the UK police were called out to one EU referendum polling station today to quiz a woman handing out pens. \nBrexit supporter Jacqueline Jackson even filmed the moment that she was questioned by a police officer in Chichester, claiming police were called by Remain voters who saw her handing out pens. \nSo when you head to the polling stations, use your own pen, use your own pencil or just use the one provided. \nDo whatever you like, just make sure you clearly mark your intention. More on the EU Referendum", "external_links": [], "published": "2016-06-23T18:59:00.000+03:00", "crawled": "2016-06-23T19:49:04.921+03:00", "highlightTitle": ""}