{"organizations": ["Leicester City Council", "European Union", "EU"], "uuid": "970362c08c41b10bce84ba459506d315bb22da39", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/29377811/14502640.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/eu-referendum-voting-deadline-extended-friday/story-29377811-detail/story.html", "country": "US", "domain_rank": 48128, "title": "EU referendum voting deadline 'should be extended until Friday night' | Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "EU referendum voting deadline 'should be extended until Friday night' | Leicester Mercury", "spam_score": 0.009, "site_type": "news", "published": "2016-06-08T20:44:00.000+03:00", "replies_count": 0, "uuid": "970362c08c41b10bce84ba459506d315bb22da39"}, "author": "", "url": "http://www.leicestermercury.co.uk/eu-referendum-voting-deadline-extended-friday/story-29377811-detail/story.html", "ord_in_thread": 0, "title": "EU referendum voting deadline 'should be extended until Friday night' | Leicester Mercury", "locations": ["Leicester", "UK"], "entities": {"persons": [{"name": "rory palmer", "sentiment": "none"}, {"name": "david cameron", "sentiment": "none"}, {"name": "putin", "sentiment": "none"}, {"name": "coun palmer", "sentiment": "none"}], "locations": [{"name": "leicester", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "leicester city council", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["Rory Palmer", "David Cameron", "Putin", "Coun Palmer"], "text": "EU referendum voting deadline 'should be extended until Friday night' By IFrodsham | Posted: June 08, 2016 17 COMMENTS SHARES The European Union and the Union flag EU referendum voting deadline 'should be extended until Friday night' X \nCopy link to paste in your message / Comments (17) \nRegistration for voting in the EU referendum should continue until \"the end of the working week\", a Leicester politician has claimed. \nThe deadline for signing up to take part was originally Tuesday night, but the website crashed, meaning many people were unable to register in time. \nAfter an outcry, the Government decided today to extend the deadline for 48 hours, until midnight on Thursday. \nBut Leicester deputy mayor Councillor Rory Palmer said he thought it would make more sense if registration was extended until Friday night. \nAfter Tuesday's website crash, Coun Palmer wrote to the Prime Minister urging him to give people longer to sign up. \nHe said the action was needed to \"enable people to exercise their democratic right\". \nRead more: 'Voting Brexit? That's what Putin wants you to do' \nMany people who wanted to register on Tuesday went online to find a message which read \"504 Gateway Time-out\" instead of the online registration form. \nCoun Palmer said Leicester City Council received 2,300 in 24 hours on Tuesday, compared to 7,000 in the whole of last week. \nAccording to Government statistics, the number of applications in the UK peaked on Tuesday, when there were 515,000 online applications and 10,000 paper applications. \nIn his letter to David Cameron, Coun Palmer wrote: \"I have checked this morning with the Returning Officer at Leicester City Council and they have confirmed to me that new register applications could be securely and appropriately managed until the end of the working week without causing any significant or notable impact on the formal preparations for the referendum.\" \nRead more: 'Some EU regulations are sensible but most stifle my business' \nHe told the Mercury: \"When it comes to doing things online, we all tend to leave things to the last minute. \n\"For us politicos, we have been talking about this for months, but several voters may have only started thinking seriously about which way they are going to vote this week. \n\"Voters should not be penalised for doing so.\" \nAfter the extension was announced, Coun Palmer said it was a welcome move, but added that 48 hours might not be long enough. \nHe said: \"I think it is a welcome step although I would have preferred longer, ideally until the end of the working week. There is not a great deal of difference midnight tomorrow or midnight on Friday in terms of processing the registrations. \n\"I think the Government could have gone for longer. \n\"The Government also needs to be ready and prepared should the same thing happen at midnight on Thursday. \n\"I hope they have a plan B somewhere.\" ", "external_links": [], "published": "2016-06-08T20:44:00.000+03:00", "crawled": "2016-06-16T04:12:56.240+03:00", "highlightTitle": ""}