{"organizations": [], "uuid": "8414dafaf548168dfa20179538429da109647e5b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/29426664/14658075.jpg", "site_section": "http://www.thisisleicestershire.co.uk/specialolympics/rss.html?chid=181121", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/8203-money-saving-expert-s-martin-lewis-how-you-should-vote-in-eu-referendum/story-29426664-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "Leicester Mercury commented ​Money Saving Expert's Martin Lewis: How you should vote in EU...", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "Leicester Mercury commented ​Money Saving Expert's Martin Lewis: How you should vote in EU...", "spam_score": 0.0, "site_type": "news", "published": "2016-06-21T15:23:00.000+03:00", "replies_count": 0, "uuid": "8414dafaf548168dfa20179538429da109647e5b"}, "author": "Leicester Mercury", "url": "http://www.leicestermercury.co.uk/8203-money-saving-expert-s-martin-lewis-how-you-should-vote-in-eu-referendum/story-29426664-detail/story.html", "ord_in_thread": 0, "title": "Leicester Mercury commented ​Money Saving Expert's Martin Lewis: How you should vote in EU...", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comments (1) \nWe'll never truly know the right answer to this Thursday's EU vote , as we will only ever discover how one outcome turns out. Yet we all need to make a decision. \nThe impact will reverberate through our lifetimes and those of our children and grandchildren. It affects our economy, democracy, foreign policy, immigration policy, security and more. \nIf you've already made up your mind, good. I don't want to change it; I'm not campaigning (my picture and quote being used in campaign leaflets is without my permission). If you're undecided, my aim is to help you ignore the spin and weigh up the right decision for you, your community, our nation and the wider world too. There are no facts \nThe question I'm swamped with is: \"Please just tell us the facts, what'll happen if we leave?\" I'm sorry, but I don't know. There are no facts. We need to embrace the uncertainty. \nAnyone who tells you they KNOW what'll happen if we leave is talking nonsense. Predicting exact numbers for economic or immigration change is risible. What's proposed is unprecedented. All the models and hypotheses are based on assumptions – that's guesstimate and hope. \nRead more: Leicestershire PCC Willy Bach - 'Brexit will make fighting crime harder' \nMany campaigners try to come across as doubt-free. Either all EU elements are good, or all are bad. Yet if it was that black and white how come some \"took a weekend\" to decide. This is a binary vote, but it's not a binary argument. \nConcerns usually centre on democracy, immigration and finance. I cover them all in my full www.moneysavingexpert.com/EU 'How to Vote' guide; here I'll focus on the economy. Do a risk assessment \nLeaving is unquestionably economically riskier than staying. Yet don't automatically read risk as a bad thing. It simply means there's more uncertainty — a greater variance of possible outcomes. \nWe could be left on the sidelines. A shrinking power spurned after a bitter divorce from our neighbours, who offer us hideous trading conditions while the rest of the world sees us as too small to bother with. \nOr we could in the long run become a nimble low-tax, low-regulation, tiger economy with unfettered trading across the globe. The likely truth is somewhere in between. \nMost independent analysis does suggest Brexit will be economically detrimental, and on balance I think a wobble of uncertainty is more likely, at least in the short to medium term. Though again it's about chance not fact – and money isn't the only issue. \nRead more: Brexit would not cost Melton Mowbray Pork Pies protected status says pro-EU expert \nAs for the politically important EU fees. We pay £13 billion annually into the EU after our rebate; some of that is spent here, leaving a cost of £8.5bn. Though contrast those numbers to the predicted economic swing: Remain's worst case figure says leaving could cost £135bn, Leave says the gain could be £70bn. Regardless of who's right, it shows financially, focus on the economy, not the fees. \nSo in summary, with the economic argument, if you're thinking you don't want to risk the economy going bad, vote Remain. If you're thinking things are so poor already you'll risk it getting worse in the hope it could get better, vote Leave. \nWhile not a perfect analogy, it's a bit like choosing between saving, where the returns aren't great, but unless there's a catastrophe you've a decent idea what you'll get; and stock market investing, where you hope for a better outcome, but must be prepared to risk losing money. How to decide \nBase your decision on your political attitude to the EU, your gut instinct, and how risk-averse you are on each issue that matters to you. \nPersonally, having weighed up all the elements, as I'm generally risk-averse, it pushes me just towards an IN vote for safety, maybe 55% to 45%. Yet just as my dream holiday isn't necessarily yours, no more is my choice here a call for you to follow me. Far better is follow the logic and choose for yourself.", "external_links": [], "published": "2016-06-21T15:23:00.000+03:00", "crawled": "2016-06-21T17:53:57.135+03:00", "highlightTitle": ""}