{"organizations": ["CBI", "Nifco UK MD", "EU", "Bank of England", "North East England Chamber of Commerce", "North East Local Enterprise Partnership", "Bellway", "London Stock Exchange"], "uuid": "4b145e73de0ae4d5a12e6c3e036a93e5bc74f5b6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article11519290.ece/ALTERNATES/s1200/JS93375618.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/more-15bn-wiped-value-listed-11523500", "country": "GB", "domain_rank": 21960, "title": "More than £1.5bn wiped off value of listed North East firms following Brexit vote", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "More than £1.5bn wiped off value of listed North East firms following Brexit vote", "spam_score": 0.0, "site_type": "news", "published": "2016-06-24T20:00:00.000+03:00", "replies_count": 0, "uuid": "4b145e73de0ae4d5a12e6c3e036a93e5bc74f5b6"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/more-15bn-wiped-value-listed-11523500", "ord_in_thread": 0, "title": "More than £1.5bn wiped off value of listed North East firms following Brexit vote", "locations": ["Britain", "US", "North East", "Europe", "UK", "EU", "London"], "entities": {"persons": [{"name": "andrew hodgson", "sentiment": "none"}, {"name": "mike matthews", "sentiment": "none"}, {"name": "carolyn fairbairn", "sentiment": "none"}, {"name": "virgin money", "sentiment": "none"}, {"name": "greggs", "sentiment": "none"}, {"name": "james ramsbotham", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "cbi", "sentiment": "none"}, {"name": "nifco uk md", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "bank of england", "sentiment": "none"}, {"name": "north east england chamber of commerce", "sentiment": "none"}, {"name": "north east local enterprise partnership", "sentiment": "none"}, {"name": "bellway", "sentiment": "none"}, {"name": "london stock exchange", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["Andrew Hodgson", "Mike Matthews", "Carolyn Fairbairn", "Virgin Money", "Greggs", "James Ramsbotham"], "text": "More than £1.5bn wiped off value of listed North East firms following Brexit vote 18:00, 24 Jun 2016 Company directors have called for clarity, stability and for firms to rally together to secure the best deal for the North East Shares Get business news by email PA Wire A screen shows the value of shares listed on the FTSE 100 falling when the London Stock Exchange opened after voters backed a referendum campaign to quit the EU. PRESS ASSOCIATION Photo. Picture date: Friday June 24, 2016. See PA story POLITICS EU. Photo credit should read: PA Wire \nMore than £1.5bn has been wiped off the value of listed North East firms despite attempts to encourage calm after the country’s vote to leave the EU. \nThe region has just over 20 firms listed on the London Stock Exchange and the alternative AIM market, including some of the North East’s largest companies like Bellway , Greggs, Go-Ahead and Sage. \nAfter a day in which almost all shares on the markets plunged in value, more than £1.52bn had been wiped from the values of the region’s listed companies. \nWorld markets descended into chaos as uncertainty spread across the globe following Britain’s vote to leave the EU. \nThe US Dow Jones Industrial Average opened 2.8% lower as European markets remained deep in the red. After plunging 7% at one point, London’s FTSE 100 Index recovered slightly after the Bank of England pledged to intervene to help shore up the markets. \nLocally, companies and business organisations moved to calm immediate fears and tried to press a “business as usual” message to customers, employees and investors. \nA spokesman for Newcastle-headquartered Virgin Money said : “As a strong, low risk, UK-only retail bank, we believe that we are well placed to manage any uncertainty arising from the result of the EU Referendum. \n“It is ‘business as usual’ for our customers, and our intention to build a bank that makes Everyone Better Off is unchanged. Mike Matthews MBE \n“We continue in our plans to support our customers, our communities, our corporate partners, and our colleagues and to build an excellent business for all of our stakeholders.” \nMike Matthews, Nifco UK MD and president of the NEECC, said: “I am saddened by the news I woke up. \n“For the UK’s manufacturing industry and many, many other large business this is just another challenge we will have to rise to and overcome – but something we need to recognise now as an opportunity to refocus and ensure we make our businesses and country attractive to both customers and investors. \n“We need to retain focus on developing world-class, highly desirable products, of the highest quality which will help us remain competitive. Superior products, superior quality and superior productivity will ensure that we continue to sell our products, grow our businesses and encourage investors. \nAndrew Hodgson, chair of the North East Local Enterprise Partnership, said: “We are very aware of the many ways in which this region has benefited from being a member of the EU. \n“This has included access to European trade and investment and European funding, which has helped to regenerate our towns and cities, support business growth and investment in science and support many of our rural stakeholders including farmers. Carolyn Fairbairn \n“We will be seeking assurances from the Government that it will help us reduce the impact of leaving the single market in terms of funding, jobs and investment.” \nBusiness groups described Britain’s vote to leave the EU as a significant turning point – but one that companies can adapt to. \nCarolyn Fairbairn, CBI Director-General, said: “The British people’s vote to leave the EU is a momentous turning point in our history. The country has spoken and it’s for us all to listen. \n“Many businesses will be concerned and need time to assess the implications. But they are used to dealing with challenge and change and we should be confident they will adapt. \n“The urgent priority now is to reassure the markets. We need strong and calm leadership from the Government, working with the Bank of England, to shore up confidence and stability in the economy.” \nThe North East England Chamber of Commerce said it was also working to reassure the region’s businesses in the wake of the result. James Ramsbotham \nChief executive James Ramsbotham said: “A significant number of our members are worried about the impact of leaving. The focus for us now is to ensure these business concerns are addressed. It is vital the Government ensures minimal disruption to trade and investment as the process of change begins. \n“We also need to see measures to reassure businesses on issues such as access to overseas talent and the future of regional funding streams. \n“We have an export record which is the strongest in the whole country and this must not be compromised as the decision to leave becomes a reality. The Government must now secure the best possible ongoing relationship with Europe and the rest of the world to enable sustained business growth in our region.”", "external_links": [], "published": "2016-06-24T20:00:00.000+03:00", "crawled": "2016-06-24T22:41:05.036+03:00", "highlightTitle": ""}