{"organizations": ["Labour", "European Union", "Hitachi Newton Aycliffe", "Better in Europe Campaign", "Hitachi", "EU", "Nissan"], "uuid": "e95fbe36a7b04f02b68e0aa2240f4f8c965903ec", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article11450052.ece/ALTERNATES/s1200/JS92116215.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/prime-minister-david-cameron-visits-11449901", "country": "GB", "title": "Prime Minister David Cameron visits North East to warn of risk in leaving EU", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Prime Minister David Cameron visits North East to warn of risk in leaving EU", "spam_score": 0.0, "site_type": "news", "published": "2016-06-09T16:49:00.000+03:00", "replies_count": 0, "uuid": "e95fbe36a7b04f02b68e0aa2240f4f8c965903ec"}, "author": "Robert Gibson", "url": "http://www.chroniclelive.co.uk/business/business-news/prime-minister-david-cameron-visits-11449901", "ord_in_thread": 0, "title": "Prime Minister David Cameron visits North East to warn of risk in leaving EU", "locations": ["Britain", "North East", "Newton Aycliffe", "Brexit", "Europe", "UK", "EU", "County Durham"], "entities": {"persons": [{"name": "john elliott", "sentiment": "none"}, {"name": "david cameron", "sentiment": "none"}, {"name": "darren cumner", "sentiment": "none"}, {"name": "hiroaki nakanishi", "sentiment": "none"}, {"name": "karen boswell", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "robert gibson david cameron", "sentiment": "none"}, {"name": "cameron", "sentiment": "none"}, {"name": "sedgefield phil wilson", "sentiment": "none"}, {"name": "ebac", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "newton aycliffe", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "hitachi newton aycliffe", "sentiment": "none"}, {"name": "better in europe campaign", "sentiment": "none"}, {"name": "hitachi", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["John Elliott", "David Cameron", "Darren Cumner", "Hiroaki Nakanishi", "Karen Boswell", "Brexit", "Robert Gibson David Cameron", "Cameron", "Sedgefield Phil Wilson", "Ebac"], "text": "Prime Minister David Cameron visits North East to warn of risk in leaving EU 14:49, 9 Jun 2016 14:49, 9 Jun 2016 By Robert Gibson David Cameron has reinforced the case for remaining in the EU during a visit to Hitachi in County Durham Shares The video will start in 8 s Cancel Click to play Tap to play The Live Event you are trying to watch is either unavailable or has not started Please refresh this page in your browser to reload this live event video \nPrime Minister David Cameron has warned that the North East would be cutting the “umbilical cord” to one of its main sources of business if Britain left the EU. \nMr Cameron made the comments during a visit to Hitachi’s state-of-the-art Rail Vehicle Manufacturing Facility in Newton Aycliffe, County Durham . \nThe multi-national is one of the fastest growing employers in the region, taking on more than 700 people tasked with making new trains, but it has warned that the case for further investment might have to be reconsidered should Britain choose to leave the EU. \nMr Cameron has been given a tour of the company’s vast manufacturing area, during which he spoke with employees. \nThe trip also included meetings with key personnel such as managing director Karen Boswell and plant manager Darren Cumner. \nDuring an interview with The Journal, the Prime Minister pointed out that around 100,000 North East jobs depended on exports to the EU, to which around 58% of overseas trade from the “exporting powerhouse” was made. \n“That’s higher than the rest of the country,” he said. “There is absolutely an umbilical cord linking the single market to jobs and livelihoods in the North East. \n“My message is: do not cut that cord.” \nDavid Cameron at Hitachi Newton Aycliffe as part of the Better in Europe Campaign ahead of the Referendum \nThe visit came after Hitachi’s’ chairman Hiroaki Nakanishi said a decision to leave the EU would make the case for company investing further in the UK “very different”, since the country currently offered the best base for access the entire European market. \nHitachi, he said, was worried as those advocating Brexit had “no answer” to how the UK could negotiate cost-free access to this from a position outside of it. \n“This is perhaps one of the best examples of this whole argument about Europe,” Mr Cameron said. \n“Hitachi are making fantastic trains and that’s great, but there is a huge opportunity for them to break into the European market, making trains that run on, say, German or Spanish lines. \n“There is a chance of that if we are in the European Union and the single market. \n“No doubt if we are outside of the single market, it makes it far, far more difficult, if not impossible.” \nHe added that the supply chain - a crucial consideration in the North East when it comes to industries such as automotive - would also be hit, affecting many small businesses, the “lifeblood of the economy”. \nDavid Cameron at Hitachi Newton Aycliffe as part of the Better in Europe Campaign ahead of the Referendum \nThe point was echoed by Labour MP for Sedgefield Phil Wilson, who also present on the visit. \n“For me, this goes beyond party politics,” he said. “This is about the livelihoods of my constituents and that comes first.” \nThe Vote Leave camp, however, took a different line on Hitachi’s concerns over Brexit. \nJohn Elliott, the founder and chairman of another Newton Aycliffe-based employer, Ebac, suggested the idea that investment into the North East would be jeopardised by a leave vote was “ludicrous”. \nFollowing Mr Cameron’s visit, he said: “Hitachi came to the North East in order to supply the UK market with trains. That is not going to change if we leave the EU. \n“Hitachi’s biggest client in the UK is the Government, so it’s no surprise they’re dancing to their tune. We’ve heard this all before. \n“Large multinationals such as Nissan said they would leave if we didn’t join the Euro, but they didn’t. Hitachi themselves have said all we need is a free trade deal with the EU, which we will have when we Vote Leave on June 23.”", "external_links": [], "published": "2016-06-09T16:49:00.000+03:00", "crawled": "2016-06-09T18:28:14.077+03:00", "highlightTitle": ""}