{"organizations": ["De Montfort University", "EU", "Leicester Mercury", "European Union", "Leicestershire"], "uuid": "075234b4f0ff88f287c888eb55f8c95c07180cda", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/29445407/14687666.jpg", "site_section": "http://www.thisisleicestershire.co.uk/generalelection2010/rss.html?chid=182803", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/man-who-started-petition-calling-for-fresh-eu-referendum-is-de-montfort-university-student/story-29445407-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "Leicester Mercury commented De Montfort University student who backed Vote Leave started...", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "Leicester Mercury commented De Montfort University student who backed Vote Leave started...", "spam_score": 0.0, "site_type": "news", "published": "2016-06-26T12:56:00.000+03:00", "replies_count": 0, "uuid": "075234b4f0ff88f287c888eb55f8c95c07180cda"}, "author": "Leicester Mercury", "url": "http://www.leicestermercury.co.uk/man-who-started-petition-calling-for-fresh-eu-referendum-is-de-montfort-university-student/story-29445407-detail/story.html", "ord_in_thread": 0, "title": "Leicester Mercury commented De Montfort University student who backed Vote Leave started...", "locations": ["Lisbon", "Rutland", "Leicestershire  Writing", "Leicestershire", "Leicester", "EU"], "entities": {"persons": [{"name": "lei", "sentiment": "none"}, {"name": "healey", "sentiment": "none"}, {"name": "oliver healey", "sentiment": "none"}], "locations": [{"name": "lisbon", "sentiment": "none"}, {"name": "rutland", "sentiment": "none"}, {"name": "leicestershire  writing", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}], "organizations": [{"name": "de montfort university", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "leicester mercury", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["Lei", "Healey", "Oliver Healey"], "text": "De Montfort University student who backed Vote Leave started petition for fresh EU referendum By Leicester Mercury | Posted: June 26, 2016 2 COMMENTS SHARES Petition calling for fresh EU referendum now has 3 million signatures De Montfort University student who backed Vote Leave started petition for fresh... X \nCopy link to paste in your message / Comments (2) \nThe man who started a petition calling for a fresh EU referendum which has attracted more than three million signatures has been revealed as a De Montfort University student. \nBut second year politics student Oliver Healey, an English Democrats supporter who backed the leave campaign, had launched the petition before the election calling for a second referendum if the winning side did not gain 60 per cent of the vote. \nHe says his petition has been hijacked by Remain campaigners bidding to overturn the decision which sent shockwaves through the country. \nRead more: Petition for second EU Referendum signed by more than 13,000 people in Leicestershire \nWriting on his Facebook page Mr Healey said: \"This petition was created at a time (over a month ago) when it was looking unlikely that 'leave' were going to win, with the intention of making it harder for 'remain' to further shackle us to the EU. \"Due to the result, the petition has been hijacked by the remain campaign. \n\"Admittedly, my actions were premature however, my intentions were as stated above. \n\" THERE WAS NO GUARANTEE OF A LEAVE VICTORY AT THAT TIME!!! \n\"Having said that, if it had not been mine, it would have been orchestrated by someone on the remain campaign. However, since I am associated with the petition and before the press further associate me with it I felt the need to better clarify my position on the issue even if it looks bad.\" \nRead more: EU referendum result: How did Leicester, Leicestershire and Rutland vote? \nHe added: \"I am it's creator, nothing more! The logistical probability of getting a turnout to be a minimum of 75 per cent and of that, 60 per cent of the vote must be one or the other (leave or remain) is in my opinion next to impossible without a compulsory element to the voting system. \n\"I have been opposed to the bureaucratic and undemocratic nature of the European Union as an institution privately for many years and for all of my political career. \n\"I have openly and actively lent my support to both Vote Leave and Grassroots Out campaigns - why would I do this if I wanted to remain in the EU? \nRead more: Leave campaign set to win as Leicestershire backs Brexit - LIVE \n\"I am genuinely appalled by the behaviour of some of the remain campaign, how they are conducting themselves post-referendum not just with this petition but generally.\" \nHe added: \"The referendum was fairly funded; democratically endorsed, every vote was weighted equally and I believe this was a true reflection of the mood of the country. \n\"To my fellow leavers, now doubting their decision please keep the faith, we will be fine just stick with it. \n\"I believe what we need to do now for the good of the country; is get behind the will of the British people, unite, issue Article 50 of the Treaty of Lisbon and move forward, with the process of leaving the European Union.\" \nYou can sign the petition here", "external_links": [], "published": "2016-06-26T12:56:00.000+03:00", "crawled": "2016-06-26T13:56:10.026+03:00", "highlightTitle": ""}