{"organizations": ["EU", "Office of National Statistics", "European Union", "Treasury", "EFTA"], "uuid": "825984e9f044327da0ff336645c89c070b472b56", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article11402155.ece/ALTERNATES/s1200/JS91177963.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/local-news/eu-referendum-put-your-questions-11509944", "country": "GB", "domain_rank": 21960, "title": "EU Referendum: We put your questions to David Cameron and Boris Johnson", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "EU Referendum: We put your questions to David Cameron and Boris Johnson", "spam_score": 0.0, "site_type": "news", "published": "2016-06-22T16:30:00.000+03:00", "replies_count": 0, "uuid": "825984e9f044327da0ff336645c89c070b472b56"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/local-news/eu-referendum-put-your-questions-11509944", "ord_in_thread": 0, "title": "EU Referendum: We put your questions to David Cameron and Boris Johnson", "locations": ["UK", "Britain", "Portugal", "North-East", "Calais", "England", "Europe", "EU", "London", "USA", "European Union", "Brussels", "North East", "Germany", "Norway", "China"], "entities": {"persons": [{"name": "david cameron", "sentiment": "none"}, {"name": "daniel milligan", "sentiment": "none"}, {"name": "boris johnson", "sentiment": "none"}, {"name": "harold wilson", "sentiment": "none"}, {"name": "geoff", "sentiment": "none"}, {"name": "daniel milligan  right", "sentiment": "none"}, {"name": "michael gove", "sentiment": "none"}, {"name": "margaret thatcher", "sentiment": "none"}, {"name": "cameron", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "johnson", "sentiment": "none"}, {"name": "step daughter", "sentiment": "none"}, {"name": "boris", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "portugal", "sentiment": "none"}, {"name": "north-east", "sentiment": "none"}, {"name": "calais", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "usa", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "norway", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "office of national statistics", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}, {"name": "efta", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["David Cameron", "Daniel Milligan", "Boris Johnson", "Harold Wilson", "Geoff", "Daniel Milligan  Right", "Michael Gove", "Margaret Thatcher", "Cameron", "Obama", "Johnson", "Step Daughter", "Boris"], "text": "Question 2 Daniel Milligan Why vote remain when we have no power or influence? \nReader: As the UK has absolutely no influence or power in the EU at the moment, why would anyone in their right mind want to vote to remain? I personally do not want to be ruled by Germany. My father and grandfather must be turning in their graves, after the sacrifices they made to keep this country free. \nCameron: Perhaps your father and grandfather also felt they were fighting to achieve peace in Europe, something that they and their generations ultimately achieved. And since then, the EU has played a very important role in helping anchor peace and stability across the continent. \nAs for your suggestion that we have no influence - that’s simply not the case. We have significant power and influence within the EU. We are the EU’s second largest economy and its foremost military power, and we have a strong say and vetoes over the decisions it takes. \nThe deal I negotiated in February gives us the best of both worlds. It allows us to keep access to the Single Market of 500 million people and keep the say we have over the rules of doing business across Europe. \nThe deal also means we will never be part of a single European superstate and we have completely rejected further political union. We’ve also passed a Referendum Act meaning that no further powers can be handed to Brussels without the explicit consent of the British people in a referendum. \nIf Britain was to leave Europe, we wouldn’t have the power to make sure businesses aren’t discriminated against in Europe, or be able to make sure European countries share their border information with us so we know what terrorists and criminals are doing. \nLook at Norway, for example, which is out of the EU but in order to access the EU market has to follow most EU rules, accept free movement of people and pay in to the EU - but with no say over the rules that impact on them. And think about the are other benefits of EU cooperation too. For example, the French have cooperated with us at Calais to tackle illegal attempts to get into Britain. I really don’t believe this crucial part of our border controls could have happened if both our countries hadn’t been members of the EU. Question 1 Daniel Milligan Can you explain PM's support of EU? \nReader: What do you think are the main reasons for eight consecutive Prime Ministers of the UK (every Prime Minister since the UK joined in January 1973, from across all parties) supporting EU Membership? \nCameron: I can’t speak for others but it is absolutely true that Prime Ministers from across the political spectrum – from Harold Wilson to Margaret Thatcher – have believed that the UK’s best interests are served by being part of what we now know as the European Union. \nFor my part, I think the case for staying in a reformed EU is compelling. We’ll be stronger, safer and better off if we remain. We’ll have economic security and global influence – so, a place at the table when key decisions that affect our future are made. The risks around leaving are just too great. In fact exiting the EU would make us all permanently poorer, with households in this country an average of £4,300 worse off, according to a recent study by the Treasury. Geoff Caddick/PA Wire \nThis is a piece of analysis that looked at both the costs to Britain and the benefits of our EU membership and found that our economy will be far stronger if we stay in. Interview starts Daniel Milligan \nRight, off we go. Over to you Mr Cameron. Q+A format Daniel Milligan How this Q+A will work \nFirst up, we’ve got Prime Minister David Cameron under the spotlight to answer your questions about why you should vote to remain in the EU. \nThen, Boris Johnson, who is backing Britain to leave the EU, will have his say. \nBoth will answer eight questions which people in the North East have requested we ask. \nThe questions to David Cameron are: What do you think are the main reasons for eight consecutive Prime Ministers of the UK (every Prime Minister since the UK joined in January 1973, from across all parties) supporting EU Membership? As the UK has absolutely no influence or power in the EU at the moment, why would anyone in their right mind want to vote to remain? I personally do not want to be ruled by Germany. My father and grandfather must be turning in their graves, after the sacrifices they made to keep this country free. If, as the Government would have us believe, exit from the EU would effectively see us ‘falling of the cliff’, in economic terms, why did you say he would recommend exit if we couldn’t get the deal you wanted around relatively minor demands on issues not directly related to the economic prosperity of Britain? Furthermore, why did you ever promise a referendum on the issue, knowing full well the dangers of an exit on our future prosperity - surely a risk not worth taking given the catastrophic consequences of exit that the remain camp is now trying to scare everybody to death with? Why do we send millions of pounds weekly to Brussels when we have record numbers of kids using food banks? You say we will be £4,300 per house worse off if we leave... Does that mean even more kids using food banks....Can these kids be any worse off? Given your experience of negotiating trade deals, do you think that it is realistic that the UK would be able to get trade deals in place with other EU countries and the USA within two years of a Leave vote? On a scale of 1 to 10 how realistic do you think Michael Gove’s claim he could negotiate EFTA membership without the UK being subject to any EU law, any of the fundamental principles set out in the founding treaty of the EU and free from any other market regulation designed to ensure consistency of quality? Rather than both camps arguing about economic details and tit for tat comments on other subjects, don’t you think that the important issue is the right to determine our own laws and legislation through a democratically elected, and, if necessary, deselected parliament...Rather than an unelected “ politburo” of bureaucrats, which will treat us with even more contempt if we vote remain? There may be some difficulties at times if we leave, but they will be ours to solve as an independent and free democratic country. My wife and Step Daughter are Portuguese and have lived in England for 10 years now. What I want to know is that if we leave the EU are my Wife and Step Daughters rights going to be affected? Will they still be able to visit family back in Portugal and return back home to England without problem or restriction? This is a great concern to myself and my family, the referendum is a huge decision and for many people it has different meanings and importance, we are very close to making one of the biggest decisions of our lives yet the vast majority of public do not have the correct information to make such an important vote. \nThen Boris Johnson will answer the following questions: Spending on infrastructure is £5,426 per head in London but only £223 per head in the North-East. Can you promise to correct that imbalance in the event of a Brexit vote? Given the EU ring-fences funding for the North East, why do you think North Eastern people would be better off by removing the EU funding being ring-fenced for their local area? All twelve major trade unions have come out in support the UK staying in the European Union - can you understand why all of them believe ordinary working people are better off voting to stay within the European Union? Given the pound’s already sharp drop over the past few months, due in no small part to uncertainties created by what a post-Brexit environment would be like, how can we be reassured that such uncertainty would not lead to greater capital flight once the UK has chosen to leave? Even if the pound’s fall is a positive and spurs exports, could uncertainty over how long it might take to renegotiate key trade deals (EU, China, USA etc.) not raise the question of what markets those exports can even access swiftly? Why do you think it was not OK for Obama to express his views on Brexit when Boris applauded Obama after he expressed his views on Scottish independence (Obama thought it was a bad idea). Is it because this time Obama said something Boris didn’t want to hear? Do you still believes the £350m weekly cost of the EU, given that the Office of National Statistics have expressly said this is incorrect and misleading. If he does believe in that figure, perhaps he could explain how it is reached given the rebate is removed prior to any sums going to Brussels. Mr Johnson, will you be happy to support David Cameron as leader of the Tory party if the country votes to stay in the EU. Also, do you thing Mr Cameron should stand down as Prime Minister if we vote to get out of the EU? Can you give a definite example of a trade deal that the UK can clinch because we are out of Europe? If on 23 June 2016 the UK voters give the mandate to leave the EU, do you believe the UK should: - (a) immediately exercise its power under Article 50(1) of the Lisbon Treaty to exit the EU: or -(b) should the UK stay in the EU for a few years meeting with the same bureaucrats you rally against and paying money to be part of the EU? Welcome Daniel Milligan Welcome to our EU question and answer blog \nThousands of people across the North East will head to the polls to vote either to remain or leave the European Union on Thursday. \nPolls will be open from 7am to 10pm and, after that, votes will be taken to regional counts in the same way as they are at elections. \nWith less than 24 hours to go until the polling stations open, we put your questions to David Cameron, who is backing the remain vote, and Boris Johnson, who wants people to vote to leave the European Union, to help you make your mind up. \nScroll down for updates as it happened and answers to some of the burning issues which may have you in a dilemma as to which way to vote on Thursday.", "external_links": [], "published": "2016-06-22T16:30:00.000+03:00", "crawled": "2016-06-22T16:37:51.777+03:00", "highlightTitle": ""}