{"organizations": ["University of Leicester", "EU", "Civil Safety and Security Unit", "RAF"], "uuid": "3dbc0979f26f717f4045da53c7507c912562ef6c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/29356054/14452540.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/person-voting-brexit-s-putin-wants/story-29356054-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "First Person: 'Voting Brexit? That's what Putin wants you to do' | Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "First Person: 'Voting Brexit? That's what Putin wants you to do' | Leicester Mercury", "spam_score": 0.152, "site_type": "news", "published": "2016-06-03T15:41:00.000+03:00", "replies_count": 0, "uuid": "3dbc0979f26f717f4045da53c7507c912562ef6c"}, "author": "Leicester Mercury", "url": "http://www.leicestermercury.co.uk/person-voting-brexit-s-putin-wants/story-29356054-detail/story.html", "ord_in_thread": 0, "title": "First Person: 'Voting Brexit? That's what Putin wants you to do' | Leicester Mercury", "locations": ["France", "Britain", "Ukraine", "Boondocks", "EU", "Europe", "Russia", "Germany", "Baltic States"], "entities": {"persons": [{"name": "putin", "sentiment": "none"}, {"name": "simon bennett", "sentiment": "none"}, {"name": "alexander litvinenko", "sentiment": "none"}, {"name": "vladimir putin", "sentiment": "none"}], "locations": [{"name": "france", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "ukraine", "sentiment": "none"}, {"name": "boondocks", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "baltic states", "sentiment": "none"}], "organizations": [{"name": "university of leicester", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "civil safety and security unit", "sentiment": "none"}, {"name": "raf", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["Putin", "Simon Bennett", "Alexander Litvinenko", "Vladimir Putin"], "text": "First Person: 'Voting Brexit? That's what Putin wants you to do' By Leicester Mercury | Posted: June 03, 2016 By Dr Simon Bennett: Director of the Civil Safety and Security Unit at the University of Leicester. 26 COMMENTS SHARES 'Voting Brexit? That's what Putin wants you to do' First Person: 'Voting Brexit? That's what Putin wants you to do' X \nCopy link to paste in your message / Comments (26) \nI have two jobs. I'm an academic. I also moonlight as a freelance journalist, writes Simon Bennett. \nAs a freelance, I keep my finger on the pulse. So, a couple of days ago, I infiltrated the terrace of a swish hotel. To blend in, I purchased a glass of something expensive. \nThe tables adjacent to mine were occupied by two sumptuously attired couples. I struck up a conversation. Inevitably, the chat turned to the EU referendum . \nBoth couples said they were going to vote for Brexit. Why? \"Because the Eurocrats are riding a gravy train,\" said a Daily Mail-reading husband. \nApparently, the European commissioners spend huge amounts of taxpayers' money on banquets, foreign travel, privately chartered trains and planes and other frivolities. \n\"We wouldn't have to put up with that if we were a sovereign nation,\" the husband claimed. \"Really? Who do you think pays for the royal family's banquets, foreign travel, privately chartered trains and planes and other frivolities?\" I retorted. \nAwkward silence. \nNo system of governance is perfect. Yes, the Eurocrats waste money on idiotic schemes and a vanity lifestyle. But so do we Brits. The royal family has been taking liberties for years. \nAnd what about the 2009 expenses scandal? \nHere is why you should vote \"In\" – because Russian president Vladimir Putin desperately wants you to vote Out. \nThe man implicated in the assassination of Alexander Litvinenko would like nothing better than to see Britain exile itself to the Boondocks. Why? \nFirst, because Britain is Europe's moral and military backbone. Most EU member states are pacifist. Most are reluctant to use force, or even the threat of force, to achieve political objectives. \nRemember how Germany and France kowtowed to Putin when his \"little green men\" (Russian Special Forces) invaded eastern Ukraine? A British retreat would energise Putin. \nSecondly, because Britain wants to make Europe less reliant on Russian gas and oil. \nPutin uses Russia's reserves to bully states that resist his will. He has blackmailed Ukraine for years. He knows with Britain out of the picture, he can turn the screw on Europe. \nAlarmist? Observe the Baltic States, where Russian bombers frequently test the skills of RAF pilots. This is a deadly serious contest of wills that, in extremis, could go nuclear. \nYour vote matters. Play the Little Englander if you wish. But remember this – actions have consequences. With Putin in the frame, those consequences could be deadly. \nDr Simon Bennett is director of the Civil Safety and Security Unit at the University of Leicester. ", "external_links": [], "published": "2016-06-03T15:41:00.000+03:00", "crawled": "2016-06-16T10:19:10.362+03:00", "highlightTitle": ""}