{"organizations": ["Leicester Business School", "Holdings", "Caterpillar", "De Montfort University", "Walkers Snack Foods", "Leicestershire", "Beaumont Leys", "Mark Group", "Barratt"], "uuid": "702702835156842913f8c2cd856353fc18de9658", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/29422458/14654706.jpg", "site_section": "http://www.thisisleicestershire.co.uk/specialolympics/rss.html?chid=181121", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/introducing-the-2016-top-200-companies-list/story-29422458-detail/story.html", "country": "GB", "title": "TomPegden published Introducing the 2016 Top 200 Companies list", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "TomPegden published Introducing the 2016 Top 200 Companies list", "spam_score": 0.0, "site_type": "news", "published": "2016-06-21T08:19:00.000+03:00", "replies_count": 0, "uuid": "702702835156842913f8c2cd856353fc18de9658"}, "author": "TomPegden", "url": "http://www.leicestermercury.co.uk/introducing-the-2016-top-200-companies-list/story-29422458-detail/story.html", "ord_in_thread": 0, "title": "TomPegden published Introducing the 2016 Top 200 Companies list", "locations": ["Britain", "EU", "UK"], "entities": {"persons": [{"name": "tompegden", "sentiment": "none"}, {"name": "barratt", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "leicester business school", "sentiment": "none"}, {"name": "holdings", "sentiment": "none"}, {"name": "caterpillar", "sentiment": "none"}, {"name": "de montfort university", "sentiment": "none"}, {"name": "walkers snack foods", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}, {"name": "beaumont leys", "sentiment": "none"}, {"name": "mark group", "sentiment": "none"}, {"name": "barratt", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["TomPegden", "Barratt"], "text": "Introducing the 2016 Top 200 Companies list By TomPegden | Posted: June 21, 2016 0 COMMENTS SHARES Caterpillar (UK) jumps one place to number 5 VIEW GALLERY Introducing the 2016 Top 200 Companies list X \nCopy link to paste in your message / Caterpillar (UK) jumps one place to number 5 Barratt is up a place at number 2 on Top 200 list Next maintains its place at number 1 on the Top 200 Comments (0) \nThere has been a lot of negativity about the economy over the past 12 months. \nNo sooner had we got through the worst downturn in living history than talk started of the slowdown in Chinese growth and global oil multinationals mothballing their expansion plans. \nAnd now, descending on us like an avalanche, is the doom and gloom surrounding the consequences of a Brexit or, conversely, what will happen to us if we stay within the EU. \nBut look at our new list of Leicestershire's Top 200 companies and, hopefully, you will take some reassurance. \nIf their successes are anything to go by, the roof isn't going to collapse on us anytime soon, no matter what the editor's of Britain's tabloids like to tell us. \nThings are looking quite good out there.The combined turnover of the Top 25 businesses on our list this year is more than £21 billion, a mind-boggling figure, and £1 billion up on this time last year. \nBetween them those 25 businesses have a combined workforce – in the county, UK and overseas – of 116,000 people. \nThis year's top 10, as you will see, is the same as last year's although Barratt homes and Caterpillar have both shifted up a place. \nBetween them those 10 represent high street chains, prestige car dealers, house builders, mining companies, motorbike and digger builders, food manufacturers and wholesalers. \nYou couldn't find a broader representation of the types of companies that make our economy what it is. \nAll have grown in the last year. \nAs ever the list has been meticulously put together by a team at De Montfort University's Leicester Business School, based on companies that have their registered offices here. \nA handful have been dropped because they have no real trading operations here. \nOthers have been added by the Leicester Mercury because, although not registered here, they have their main operations within the city and county. \nWalkers Snack Foods, for instance, has been included for the first time because of its huge presence here. \nAn explanation of who we have added and why is on page 56. \nThe comprehensive listing we have put together on pages 8 to 17 includes a wealth on information about everyone on the Top 200. \nThe aim is to not just give a clear picture of who's who, but to provide a reference that business people can turn to in the weeks and months to come to see who they should be doing business with. \nWe are sure you will find it useful. \nPutting this list together has been a painstaking process, with information carefully sourced, checked and double checked. \nYou will see that a lot of the turnover figures relate to financial years which ended up to 18 months ago. \nThese were the latest figures available as the list was being compiled.It has not all been good news for the companies that made it onto last year's list.Cottingham (Holdings) for instance is no more. \nThe company behind Beaumont Leys insulation and solar panel business Mark Group went into administration on October 7. \nOnce a leading installer of energy efficiency measures, with a turnover of £267 million, its demise left 939 people without jobs, 577 of them based at the company's Beaumont Leys headquarters. \nHowever a new company, called BillSaveUK, was formed to buy the Mark Group's new homes division out of administration. \nAnd, as is the nature of business, maybe one day it will find itself riding high in a future Top 200 list.", "external_links": [], "published": "2016-06-21T08:19:00.000+03:00", "crawled": "2016-06-21T10:44:51.487+03:00", "highlightTitle": ""}