{"organizations": ["TUC", "EU", "Northern TUC", "European Union", "Hitachi", "Nissan"], "uuid": "36783fc173323fbc7b6811decd421cda929791dc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article11496674.ece/ALTERNATES/s1200/JS91187198.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-opinion/tuc-urges-voters-avoid-risk-11496679", "country": "GB", "title": "TUC urges voters to 'avoid the risk and vote to remain' in EU referendum", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "TUC urges voters to 'avoid the risk and vote to remain' in EU referendum", "spam_score": 0.0, "site_type": "news", "published": "2016-06-20T13:14:00.000+03:00", "replies_count": 0, "uuid": "36783fc173323fbc7b6811decd421cda929791dc"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-opinion/tuc-urges-voters-avoid-risk-11496679", "ord_in_thread": 0, "title": "TUC urges voters to 'avoid the risk and vote to remain' in EU referendum", "locations": ["EU", "European Union", "North East", "UK"], "entities": {"persons": [{"name": "martin", "sentiment": "none"}, {"name": "martin lewis", "sentiment": "none"}, {"name": "neil foster", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "tuc", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "northern tuc", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "hitachi", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["Martin", "Martin Lewis", "Neil Foster"], "text": "TUC urges voters to 'avoid the risk and vote to remain' in EU referendum 11:14, 20 Jun 2016 The jobs risk to the North East from a Brexit is significant, says Neil Foster, policy and campaigns officer for the Northern TUC Shares Get business news by email Neil Foster \n‘This is all about risk’ wrote Martin Lewis, the Money Saving Expert wrote in his blog about the EU referendum . \nMartin examined a range of different issues, from roaming charges, mortgage directives to the economy, and misunderstandings about human rights. After carefully weighing up the evidence and risks, Martin Lewis has decided to vote to remain in the EU. \nIt is significant Martin picked out stronger EU employment rights as one of the positives. \nGiven the Conservative Government’s recent record of attacking unions and reducing justice at work, workplace rights would be vulnerable. The fact that the leading lights in the Leave campaign are some of the most hostile to employment protection only increases the risks. \nThe EU employment rights provide a level playing field and make a practical difference. Maternity and paternity rights and family-friendly rights for when children fall ill would be less certain. \nEqual treatment for part-time and temporary workers could easily be cut, affecting millions of workers in less secure employment. Health and safety protection would be open to being downgraded by the Government, putting workers in some of the most dangerous workplaces at greater risk of harm. Existing equality rights for women will be up for debate. \nThe jobs risk to the North East from a Brexit is significant. We have more than 150,000 North East jobs in different sectors linked to EU trade – 70,000 of these are in manufacturing and will likely be disadvantaged over time outside the EU. \nIt’s not just firms such as Nissan and Hitachi that are giving warnings but our region’s home-grown independent firms. \nMany other employment sectors risk job losses if the UK leaves the EU. \nThe public sector has already been hit badly by the decisions of the Conservative Government to make them pay for the bankers’ crash in 2008. Already the Chancellor is arguing more public spending cuts would feature in an emergency Budget if we left the EU. \nThis is on top of the thousands of public sector jobs in jeopardy from flawed austerity policies. Given past Conservative ministerial decisions, the likelihood is the North East will face some of the steepest cuts of all to our public services. \nPerhaps the biggest unknown is the impact on retail and hospitality jobs which will be affected by how people respond to the economic turmoil following a Brexit decision. The TUC believes average wages would likely be lower outside the European Union in the future as the economy changes shape. This doesn’t bode well for disposable incomes and consumer spending on our high streets. \nRisk isn’t distributed evenly or fairly. The very wealthiest in society will still be rich if the UK leaves the European Union. \nInstead, it will be ordinary working and middle-class people who go to work, support their family and want to plan a future who will carry a lot of the risks. \nThat is why the TUC is encouraging workers to avoid the risk and vote to remain in the EU on Thursday. \nNeil Foster is policy and campaigns officer for the Northern TUC The European Union debate", "external_links": [], "published": "2016-06-20T13:14:00.000+03:00", "crawled": "2016-06-20T14:00:23.084+03:00", "highlightTitle": ""}