{"organizations": [], "uuid": "2247f9f67d2cf74cf7c174fab74282d1854fa51e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article10242237.ece/ALTERNATES/s1200/JS74268130.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/eu-referendum-what-now-labour-11522030", "country": "GB", "domain_rank": 21960, "title": "EU referendum: What now for Labour in the North East?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "EU referendum: What now for Labour in the North East?", "spam_score": 0.0, "site_type": "news", "published": "2016-06-24T17:09:00.000+03:00", "replies_count": 0, "uuid": "2247f9f67d2cf74cf7c174fab74282d1854fa51e"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/eu-referendum-what-now-labour-11522030", "ord_in_thread": 0, "title": "EU referendum: What now for Labour in the North East?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "What does the EU referendum result tell us about Labour's prospects in the North East? Shares Get daily news by email PA Wire Helen Goodman \nA North East MP is set to vote for a motion of no confidence in Labour leader Jeremy Corbyn on Monday, following the EU referendum result. \nHelen Goodman, Labour MP for Bishop Auckland, has confirmed that she would vote to depose Mr Corbyn - largely because of the EU vote. \nAnd she had two complaints. \nFirst, the lacklustre way in which he made the case for EU membership when so many jobs in the North East depend on exports. \nAnd secondly, his perceived inability to convince voters that he can tackle the problems which have alienated some traditional Labour voters - not just from the party but from politicians in general. \nThe North East is meant to be a Labour heartland. \nAnd Labour was firmly in favour of remaining in the EU. Labour party leader Jeremy Corbyn \nSo it might seem odd that 58 per cent of voters in the region came out against EU membership. \nBut perhaps it shouldn’t. After all, one in six voters in the region backed UKIP in the 2015 general election. \nMany voters seem to have little loyalty to Labour , although that doesn’t mean they are attracted to the Conservatives either. \nSome politicians and commentators have suggested the problem is immigration. The theory is that Labour insists on backing immigration - especially under party leader Jeremy Corbyn - but many working class voters think immigration has gone too far. \nIt’s a culture clash between a middle-class, London-based liberals at the top of the party and the working class people Labour was originally set up to represent, or so it’s claimed. \nBut a number of Labour MPs in the region see it differently. \nThey argue that voters may be concerned about immigration but they are actually more angry and frustrated about low pay, insecure employment and the lack of funding for important public services. \nThe leave campaign appeared to offer a quick fix to these problems. Stefan Rousseau/PA Wire Boris Johnson holds a press conference at Brexit HQ in Westminster \nBut the likes of Boris Johnson don’t have the answers, according to Labour MPs. \nFor Mrs Goodman, the issue is how to convince voters that a Labour government will be able to help. \nShe said: “We need to crack down on these exploitative employers, for example. \n“And I don’t think that is what going to happen when David Cameron leaves Number 10 and we have a right wing government.” \nLabour needed to find middle ground between simply accepting Tory policies and the “dreamworld” approach of Mr Corbyn, she said. \nAnd that could mean a new leader. \nTwo Labour MPs, London MP Margaret Hodge and Stockport MP Ann Coffey, have submitted a motion of no confidence in Mr Corbyn, via a letter to the chairman of the Parliamentary Labour Party. \nIt’s likely to be debated at the next meeting of the Parliamentary Labour Party on Monday. \nThe motion can’t actually be used to remove Mr Corbyn, under Labour’s rules. \nBut it’s always possible that he’d voluntarily stand down if enough people told him to. \nIn any case, a number of other Labour MPs have said they will vote for the motion. Mrs Goodman is one example. More on the EU Referendum", "external_links": [], "published": "2016-06-24T17:09:00.000+03:00", "crawled": "2016-06-24T17:46:19.748+03:00", "highlightTitle": ""}