{"organizations": ["European Union", "EU", "NHS"], "uuid": "93cafc6007b3aeaa4cacad029f1e9d4f7a7200bb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article11524940.ece/ALTERNATES/s1200/JS93447559.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/news-opinion/eu-referendum-how-brexit-vote-11524937", "country": "GB", "domain_rank": 21960, "title": "EU referendum: How the Brexit vote has led to fear and loathing in the UK", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "EU referendum: How the Brexit vote has led to fear and loathing in the UK", "spam_score": 0.0, "site_type": "news", "published": "2016-06-25T16:09:00.000+03:00", "replies_count": 0, "uuid": "93cafc6007b3aeaa4cacad029f1e9d4f7a7200bb"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/news-opinion/eu-referendum-how-brexit-vote-11524937", "ord_in_thread": 0, "title": "EU referendum: How the Brexit vote has led to fear and loathing in the UK", "locations": ["UK", "US", "North East", "Downing Street", "Dublin", "EU", "London"], "entities": {"persons": [{"name": "sha", "sentiment": "none"}, {"name": "hunter s thompson", "sentiment": "none"}, {"name": "johnson", "sentiment": "none"}, {"name": "david cameron", "sentiment": "none"}, {"name": "nigel farage", "sentiment": "none"}, {"name": "cameron", "sentiment": "none"}, {"name": "boris johnson", "sentiment": "none"}, {"name": "george osborne", "sentiment": "none"}, {"name": "osborne", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "downing street", "sentiment": "none"}, {"name": "dublin", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "european union", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["Sha", "Hunter S Thompson", "Johnson", "David Cameron", "Nigel Farage", "Cameron", "Boris Johnson", "George Osborne", "Osborne"], "text": "The European Union debate has revealed a bitterly divided country for which no-one has an answer Shares Get daily news by email Isabel Infantes/PA Wire Young anti-Brexit protesters demonstrate at the gates of Downing Street in central London after the UK voted to leave the European Union \nA few years back there was a film called The Commitments about a bunch of jobless teenagers from Dublin who form a soul band. \nThe strapline on the movie poster which showed the group defiantly flicking Vs at the camera was: ‘They had absolutely nothing. But they were willing to risk it all.’ \nIn essence, that was why the UK voted to get out of the European Union. \nAnd it explains why the Leave campaign got the bulk of its support from areas which have benefitted most from EU funding. \nFor EU funding is earmarked for the most deprived areas of which the North East has many. \nFor six years this region, more than any other in the country, has suffered at the hands of successive governments run under the dead hand of Chancellor George Osborne and his fiscal policy. \nSo, after a three month EU campaign during which Osborne talked about the harm Brexit would do to the economy, topped off by his doomsday budget prediction of a £30bn black hole in finances meaning yet more austerity and misery - and we all know who would have been at the sharp end of that - the people of the North East did their version of the Commitments. \nBasically, to them the EU referendum wasn’t about the EU it was about money; they who had no cash and no prospects against a well off Europhile elite immune to the risk of cheap, mobile EU labour threatening their livelihoods who branded such concerns as racist. \nIronically, the other great non EU battle in the EU campaign was that between Boris Johnson and David Cameron who both have money to burn. \nI really don’t even think Johnson wants the UK to leave the EU, it was just his chance to best Cameron and become Prime Minister. \nI suspect he thought the result would be a reasonably close win for Remain leaving Cameron wounded and forced to step down for the sake of party unity with Johnson stepping into the breach. \nIt was why the Leave campaign made all sorts of spurious promise which are now coming back to haunt them. \nAs a result within hours of victory they were reining back on the promise to slash immigration - can’t be done - and of redirecting £350m a week in previous EU cash to the NHS (a mistake said Nigel Farage). \nDuring the EU campaign it was Project Fear and Project Hate. Now the dust has settled, its seems more like fear and loathing in the UK, to paraphrase the title of a book by US writer Hunter S Thompson, who died, appropriately enough, from a self inflicted wound. More on the EU Referendum", "external_links": [], "published": "2016-06-25T16:09:00.000+03:00", "crawled": "2016-06-25T16:22:38.303+03:00", "highlightTitle": ""}