{"organizations": ["Hitachi Rail", "European Union", "Scotrail", "Newton Aycliffe", "House of Commons", "Toyota", "Hitachi", "EU", "Electoral Commission", "Nissan", "Cabinet Office"], "uuid": "4a0cc31779bd1624c7578f10309fc4a71fdbe18a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.liverpoolecho.co.uk/incoming/article9988178.ece/ALTERNATES/s1200/JS71266697.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/david-cameron-north-east-recap-11447234", "country": "GB", "domain_rank": 21960, "title": "David Cameron in North East RECAP: Updates from Prime Minister's EU visit at Hitachi Rail", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "David Cameron in North East RECAP: Updates from Prime Minister's EU visit at Hitachi Rail", "spam_score": 0.0, "site_type": "news", "published": "2016-06-09T10:30:00.000+03:00", "replies_count": 0, "uuid": "4a0cc31779bd1624c7578f10309fc4a71fdbe18a"}, "author": "Daniel Milligan", "url": "http://www.chroniclelive.co.uk/news/north-east-news/david-cameron-north-east-recap-11447234", "ord_in_thread": 0, "title": "David Cameron in North East RECAP: Updates from Prime Minister's EU visit at Hitachi Rail", "locations": ["Britain", "East Coast", "North East", "Newton Aycliffe", "Brexit", "EU", "UK", "Europe", "Japan", "County Durham", "London"], "entities": {"persons": [{"name": "cameron  hitachi", "sentiment": "none"}, {"name": "daniel milligan deadline", "sentiment": "none"}, {"name": "daniel milligan young", "sentiment": "none"}, {"name": "hiroaki nakanishi", "sentiment": "none"}, {"name": "cameron", "sentiment": "none"}, {"name": "daniel milligan", "sentiment": "none"}, {"name": "laura hill", "sentiment": "none"}, {"name": "nakanishi", "sentiment": "none"}, {"name": "daniel milligan brexit hitachi", "sentiment": "none"}, {"name": "eddie izzard", "sentiment": "none"}, {"name": "david cameron", "sentiment": "none"}, {"name": "izzard", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "matt hancock", "sentiment": "none"}, {"name": "daniel milligan  david cameron", "sentiment": "none"}, {"name": "daniel", "sentiment": "none"}, {"name": "daniel milligan brexit", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "east coast", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "newton aycliffe", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "hitachi rail", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "scotrail", "sentiment": "none"}, {"name": "newton aycliffe", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}, {"name": "toyota", "sentiment": "none"}, {"name": "hitachi", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "electoral commission", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}, {"name": "cabinet office", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["Cameron  Hitachi", "Daniel Milligan Deadline", "Daniel Milligan Young", "Hiroaki Nakanishi", "Cameron", "Daniel Milligan", "Laura Hill", "Nakanishi", "Daniel Milligan Brexit Hitachi", "Eddie Izzard", "David Cameron", "Izzard", "Brexit", "Matt Hancock", "Daniel Milligan  David Cameron", "Daniel", "Daniel Milligan Brexit"], "text": "We’re live at the factory with reporter Laura Hill. 09:51 Daniel Milligan \nThe Prime Minister is touring the factory floor at Hitachi talking to staff. Daniel Leal-Olivas/PA Wire 09:46 Daniel Milligan Prime Minister arrives \nDavid Cameron arrived at Hitachi around 15 minutes ago - here is a short video of the PM. Video loading Click to play Tap to play The Live Event you are trying to watch is either unavailable or has not started Please refresh this page in your browser to reload this live event video 09:38 Daniel Milligan \nPlenty of press at the event at Hitachi this morning. 09:30 Daniel Milligan \nDavid Cameron arrived at Hitachi in a large EU Remain bus. 09:21 Daniel Milligan I’m away from home on polling day — what can I do? \nIf you can’t make it to the polling booth on the day, you can register for a postal vote or a proxy vote. \nVoting by proxy allows you to nominate someone you trust to vote for you. \nYou will need to apply by 5pm on June 15 to vote by proxy, by sending a form to your local electoral registration office. \nTo download a form visit www.gov.uk/apply-vote-proxy \nYou can also vote by post. \nPostal vote application forms can be found here \nOnce you have completed and signed your application form, send it to your local electoral registration office. \nYou will receive your ballot paper by post. Ballot papers can be sent overseas, but if you’re considering voting from abroad, there may no longer be time to receive and send off postal votes before polling day. 09:15 Daniel Milligan Deadline for registering to vote \nThe deadline for registering to vote in the EU referendum has been extended, the government has said. \nCabinet Office minister Matt Hancock said the government would legislate to extend the cut-off until midnight on Thursday. \nIt follows a computer glitch which left some people unable to sign up before the original midnight Tuesday deadline. \nThe Electoral Commission urged people to sign up until the end of Thursday in order to vote on 23 June. 09:09 Daniel Milligan Young people urged to vote \nComedian Eddie Izzard said the joke could be on young people in the North East if they don’t register to vote in the forthcoming European Referendum. \nThe deadline to register in the June 23 ballot is midnight tomorrow . \nAnd Izzard said: “Young people of the North East: you have just one day left to register to vote in the EU Referendum. If you don’t register by midnight on Tuesday June 7, old people will decide your future. Eddie Izzard Stand Up For Europe \n“It is vital you take part in this once-in-a-generation vote because this is your tomorrow, you will be most affected by the outcome. \nAccording to Bite the Ballot, a campaigning group urging young people to get involved in politics, people aged 18-24 are twice as likely not to be signed up to vote than the rest of the public. \nThis is important, campaigners say, because the group has different concerns which should be represented. \nBite the Ballot research suggests that the most important issue for under 30s when discussing Brexit was the impact leaving might have on health, with immigration and housing close second and third. 09:00 Daniel Milligan Worries over Brexit \nEarlier this week, Mr Nakanishi said he was worried about the effect leaving the EU would have on the UK. \nMr Nakanishi said: “I would like to explain how Brexit would affect us at Hitachi, and why we think it’s important for Britain to remain in Europe. \nHe said: “For most global companies like Hitachi, the critical benefit of investing in the UK is that it is the best base for accessing the whole European market of 500m people. \n“There are other reasons like the size of the UK market, availability of local and international talent and the support of our local communities – which is why we take a positive view of the UK inside Europe. \n“Therefore we have our regional headquarters here and moved our global rail headquarters to London. \n“But take away the UK’s membership of the EU, and the future investment case looks very different.” 08:48 Daniel Milligan Brexit lead to jobs lost - Hitachi boss \nThe chairman of Hitachi has issued a stark warning that the “cold economic reality of Brexit” would mean jobs being lost and investment being held bac k. \nThe firm opened its £82m train manufacturing facility in Newton Aycliffe, County Durham, nine months ago as well as basing its global rail HQ in London, and chairman Hiroaki Nakanishi said the UK was attractive as the best base for accessing the European Union’s market of 500m consumers. \nHowever, Mr Nakanishi - in comments that were later picked up by Prime Minister David Cameron - said Brexit represented a “boulder on the line”. \nHe warned of the impact of Brexit on Japanese investors: “In the ‘80s Nissan and Toyota came to the UK on the basis that if they produced here and employed a British workforce they would be treated as European companies. Hiroaki Nakanishi, CEO of Hitachi \n“This was only possible because Britain was inside the EU; and so the UK car industry was revived and became an exporter again. From Japan, this incredible success story looks like a huge gain from the UK’s membership of the EU. \n“We worry because those advocating Brexit have no answer to how the UK could negotiate cost-free access to this huge market from a position outside it. \n“It would take a long time and result in uncertain market conditions; during this renegotiation period, investors would probably be waiting to see the outcomes, hold back on investment, and jobs would be lost. This is the cold economic reality of Brexit.” 08:39 Daniel Milligan Brexit Hitachi warning from Cameron \nHitachi’s warning that quitting the European Union could force it to rethink plans to invest in the North East is “incredibly powerful”, David Cameron has insisted. \nThe Prime Minister echoed the comments in the House of Commons after Hitachi chairman Hiroaki Nakanishi said that a decision to leave the EU on June 23 made the case for future investment “very different”. PA Wire \nThe huge multinational company is one of the region’s fastest-growing employers and will soon employ more than 700 people at its Newton Aycliffe manufacturing site, making new trains for the East Coast, Great Western and Scotrail lines. \nMr Cameron, who is urging voters to support remaining in the EU, told the House of Commons that leaving would be bad for the economy of the North East. \nHe said: “One of the reasons why international companies like Hitachi invest in Britain - of course we have excellent labour relations, the English language, a very hard working workforce, great engineers - but they also invest here because we are members of the single market. \n“And I thought what the head of Hitachi said this week about wanting us to be the European headquarters, to manufacture trains in the North East and sell them all over Europe, and how that might not be possible if we were to leave, was an incredibly powerful statement.” \nHe added: “So in my clear view jobs come first, and if people want to vote for jobs they should vote for remain on June 23.” 08:30 Daniel Milligan Prime Minister at Hitachi Rail \nDavid Cameron will be in the North East on Thursday to push home his case for Britain remaining in the EU. \nThe Prime Minister will visit Hitachi Rail in Newton Aycliffe, County Durham, to deliver a speech to workers ahead of June 23’s referendum. \nSpeaking ahead of his visit, Mr Cameron warned a Brexit would mean firms such as the Japanese rail giant wouldn’t invest in the region. \nHe echoed the comments in the House of Commons after Hitachi chairman Hiroaki Nakanishi said that a decision to leave the EU made the case for future investment “very different”. \nMr Cameron, who is urging voters to support the remain campaign, said that leaving would be bad for the economy of the North East. \nFollow live updates from Mr Cameron’s visit below.", "external_links": [], "published": "2016-06-09T10:30:00.000+03:00", "crawled": "2016-06-09T17:32:11.679+03:00", "highlightTitle": ""}