{"organizations": ["Leicestershire", "Whitehall Accountants", "Miller Partnership", "EU", "Whitehall"], "uuid": "f274ed718a84a240107a6aea32a4b24f05fbb04f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/29439509/14667745.jpg", "site_section": "http://www.thisisleicestershire.co.uk/specialolympics/rss.html?chid=181121", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/brexit-vote-leicestershire-financial-sector-reaction/story-29439509-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "TomPegden published Brexit vote: Leicestershire financial sector gearing up for big...", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "TomPegden published Brexit vote: Leicestershire financial sector gearing up for big...", "spam_score": 0.0, "site_type": "news", "published": "2016-06-24T12:29:00.000+03:00", "replies_count": 0, "uuid": "f274ed718a84a240107a6aea32a4b24f05fbb04f"}, "author": "TomPegden", "url": "http://www.leicestermercury.co.uk/brexit-vote-leicestershire-financial-sector-reaction/story-29439509-detail/story.html", "ord_in_thread": 0, "title": "TomPegden published Brexit vote: Leicestershire financial sector gearing up for big...", "locations": ["Britain", "Castle Donington", "Leicester", "Narborough Wood Park", "EU", "UK", "Midlands", "New Walk", "Enderby"], "entities": {"persons": [{"name": "tompegden", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "dominic payne", "sentiment": "none"}, {"name": "pete miller", "sentiment": "none"}, {"name": "matthew hammond", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "castle donington", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "narborough wood park", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "midlands", "sentiment": "none"}, {"name": "new walk", "sentiment": "none"}, {"name": "enderby", "sentiment": "none"}], "organizations": [{"name": "leicestershire", "sentiment": "none"}, {"name": "whitehall accountants", "sentiment": "none"}, {"name": "miller partnership", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "whitehall", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["TomPegden", "Brexit", "Dominic Payne", "Pete Miller", "Matthew Hammond"], "text": "Comments (0) \nAccountancy firms and tax advisers are weighing up this morning's Brexit vote on the finances of county businesses. \nSome are warning that the uncertainty over the coming months will have a big affect on the economy, but that British business is used to dealing with tough challenges. \nOthers have said they will continue to invest in their own future and that of their clients despite the upheaval. \nMatthew Hammond is regional chairman of PwC in the Midlands, which has a large base at Castle Donington. \nHe said the UK's decision to leave the EU will have \"significant implications\" for businesses and the firm is already working with clients and staff to support them as the implications are understood. \nHe said: \"History has taught us that UK business is adaptable and innovative when confronted with new challenges and opportunities. \n\"There will be significant uncertainty over the coming months as the detailed political and legal issues are worked out, and business confidence may be impacted. \n\"PwC is committed to helping its clients as they adapt to new market conditions and opportunities. \"We are working closely with our clients and people in the Midlands to contemplate the impact of the referendum decision and its impact across the region. \n\"It's important that the local business community shows leadership to drive the Midlands' regional economy through this period of uncertainty, while also demonstrating the confidence to embrace the opportunities that come with change.\" \nDominic Payne, director of Whitehall accountants in Narborough Wood Park, Enderby, expected his small firm to be able to cope with the changes ahead and continue to grow. \nHe said county businesses must remain confident. \nHe said: \"I woke this morning to the news that Britain has decided to leave the EU and the country is in panic regarding the future of our economy. \n\"Whilst listening to the news at the gym, I felt that panic was the main theme being driven home by the reporters. \n\"I run Whitehall Accountants, a firm that was set up 2 months prior to the largest recession the world has faced. \n\"At the end of June we are celebrating our eighth year in business. During this time we have seen overwhelming support from our clients that has led us to achieving 20 per cent growth year upon year in our client base. \n\"We have employed and mentored four apprentices and we have employed a new member of staff every year. \n\"Prior to the referendum we planned to employ two more members of staff to help us support our clients growing needs. Following the result, our plans remain unchanged. \n\"We at Whitehall believe in our clients and their ability to adapt and thrive as they have done over the last eight years. \n\"Now is the time for the leave voters to get behind Leicester and drive us forward. \n\"Whilst those who voted to remain did not see the outcome they desired, we as a city should maintain the approach that has seen us grow over the last eight years. \n\"Support all businesses by continuing to enjoy the products and experiences Leicester has to offer, starting this weekend.\" \nPete Miller, corporate tax consultant with The Miller Partnership, in New Walk, Leicester, said Brexit could provide an opportunity for a \"root and branch\" review of the UK's tax system. \nHe said: \"If Brexit leads to some loss of business confidence in the short term, then taxes may rise, or might not fall, to try and compensate. \n\"But there are practical limits to how much extra tax can be raised by squeezing harder, when the UK's general tax burden is already high. \n\"By making fundamental changes, without having to worry about EU rules, we may be able to spread the tax burden more evenly and reduce rates overall. \n\"But it's unlikely that politicians will tell you that fundamental changes in the tax system are more attractive the further you are from the political process – which is another way of saying that changing it isn't a vote winner! \n\"Most people outside tax probably do not realise how much of our tax system is impacted by EU laws. \n\"For example, the single market requirements of freedom of establishment and free movement of capital have meant the reliefs and exemptions applicable to UK companies have had to extend to other EU companies, too. \n\"The most famous case involved Marks & Spencer claiming tax relief for losses in its EU subsidiaries, which forced changes in the UK rules. \n\"It may be that some of the UK tax rules forced upon us by the EU will be repealed. But it will be a slow process and needs to be done in a way that does not damage the UK's general trading relationships.\"", "external_links": [], "published": "2016-06-24T12:29:00.000+03:00", "crawled": "2016-06-24T13:48:02.112+03:00", "highlightTitle": ""}