{"organizations": ["EU", "European Union", "Yui Mok/PA Wire Union Jack", "European Commission"], "uuid": "06871d13394a9251947f921418fa2b415870524f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article11509471.ece/ALTERNATES/s1200/JS85554535.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/britain-votes-leave-eu-can-11509191", "country": "GB", "domain_rank": 21960, "title": "Britain votes to leave the EU - but can we rejoin at a later date?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Britain votes to leave the EU - but can we rejoin at a later date?", "spam_score": 0.0, "site_type": "news", "published": "2016-06-24T09:20:00.000+03:00", "replies_count": 0, "uuid": "06871d13394a9251947f921418fa2b415870524f"}, "author": "Sonia Sharma", "url": "http://www.chroniclelive.co.uk/news/north-east-news/britain-votes-leave-eu-can-11509191", "ord_in_thread": 0, "title": "Britain votes to leave the EU - but can we rejoin at a later date?", "locations": ["Britain", "EU", "Bristol", "UK"], "entities": {"persons": [{"name": "geoff", "sentiment": "none"}, {"name": "david cameron", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "bristol", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "yui mok/pa wire union jack", "sentiment": "none"}, {"name": "european commission", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["Geoff", "David Cameron"], "text": "We explain the rules of signing up to the EU again after Britain voted for a Brexit in the referendum Shares Get daily news by email Yui Mok/PA Wire Union Jack pictured next to the European Union flag \nThere’s still a lot of uncertainty over what exactly will happen now Britain has pulled out of the EU. \nHow long will it take to actually leave the European Union ? \nAnd what if we have second thoughts and want to join the club again? Can we actually do that and how would that happen? \nHere, we break down the rules for you. How long will it take to sever the ties? \nIt certainly won’t happen overnight. In fact, it would take at least two years. During that time, Britain would continue to abide by EU treaties and laws, but not take part in any decision-making, as the country negotiated a withdrawal agreement and the terms of its relationship with the bloc. \nIn practice it may take longer than two years, depending on how the negotiations go. Issues at stake could include trade tariffs, financial regulations and rights to movement within the EU. Video loading Click to play Tap to play The Live Event you are trying to watch is either unavailable or has not started Please refresh this page in your browser to reload this live event video What if we have a change of heart and want to join up again? \nWe are certainly allowed to do that if we want. But we would have to start from scratch and apply all over again. Britain would be treated no differently to any other state wanting to become an EU member. It would be as if we were applying for the first time - there is no special procedure for rejoining and no special route back for previous members. Prime Minister David Cameron has said there would be no way back. Jonathan Brady/PA Wire EU Referendum voting slip Will that take a long time? \nYes, probably years. It’s a laborious process. There would be a formal application, leading to detailed talks and negotiations with the European Commission on a vast range of subjects. Discussions would focus on around 35 policy fields, such as transport, energy and the environment, as well as how much we are likely to pay into and receive from the EU budget. It has taken around a decade for some new member states to be accepted into the EU. Once all the negotiations are complete, are there are any more hurdles? \nA very big hurdle would await us. After all the talks, we would still need the unanimous agreement of all the member states. Each state has a veto. And let’s face it - it would be awkward. If we asked to go back in, they may not welcome us back with open arms. They would need serious reassurances that we were committed to membership. Geoff Caddick/PA Wire Prime Minister David Cameron on a walkabout after he addressed Vote Remain supporters during a rally in Bristol ahead of the EU referendum Is it true that we would have to adopt the Euro and give up the Pound if we wanted to sign up again? \nThat may indeed be the case. New members are required to adopt the Euro as their currency. If Britain was to re-apply, we would have to commit ourselves to the principle of joining the single currency. We would probably have to sign up to the Schengen Agreement as well, which scrapped border controls within the EU and allows passport-free movement. \nWe could of course try to negotiate to opt out of these elements, and ask the EU to readmit the UK on the same terms as before. But many believe the chances of that happening are slim. There would be no requirement for the EU to honour our previous terms of membership. We would be subject to the same principles and procedures as any other state seeking to join. More on the EU Referendum", "external_links": [], "published": "2016-06-24T09:20:00.000+03:00", "crawled": "2016-06-24T09:54:35.891+03:00", "highlightTitle": ""}