{"organizations": ["European Union", "Essex", "Electoral Commission"], "uuid": "6a87435faf6080394a9cf3287b485bd76d6b4683", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article11292217.ece/ALTERNATES/s1200/JS87824859.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/eu-referendum-2016-result-expected-11509043", "country": "GB", "domain_rank": 21960, "title": "When is the EU referendum 2016 result expected in the North East?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "When is the EU referendum 2016 result expected in the North East?", "spam_score": 0.0, "site_type": "news", "published": "2016-06-22T14:57:00.000+03:00", "replies_count": 0, "uuid": "6a87435faf6080394a9cf3287b485bd76d6b4683"}, "author": "Dan O'Donoghue", "url": "http://www.chroniclelive.co.uk/news/north-east-news/eu-referendum-2016-result-expected-11509043", "ord_in_thread": 0, "title": "When is the EU referendum 2016 result expected in the North East?", "locations": ["North East", "EU", "Wandsworth", "Sunderland", "Brexit", "Northern Ireland", "Manchester Town Hall", "London"], "entities": {"persons": [{"name": "jack", "sentiment": "none"}, {"name": "david cameron", "sentiment": "none"}, {"name": "foyle", "sentiment": "none"}, {"name": "boris", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "wandsworth", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}, {"name": "manchester town hall", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "european union", "sentiment": "none"}, {"name": "essex", "sentiment": "none"}, {"name": "electoral commission", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["Jack", "David Cameron", "Foyle", "Boris"], "text": "When is the EU referendum 2016 result expected in the North East? 12:57, 22 Jun 2016 Everything you need to know about when the North East's results will be declared in the EU referendum Shares Get daily news by email Rui Vieira/PA Wire A voter placing a ballot paper in the ballot box \nIt’s going to be a long, nerve wracking night for Leave and Remain campaigners on June 23 . \nThey’ll be waiting patiently to find out whether the British public have decided to stay in the European Union, or to Brexit and go it alone. \nDavid Cameron has described the decision as bigger than any election. It’ll have consequences for decades, and there’s probably no turning back. \nBut how long will we have to bite our nails for on that Thursday night? How late will we have to stay up, and when will we know for sure? \nHere’s everything you need to know. When is the EU referendum? \nPolls will be open from 7am to 10pm on Thursday June 23. \nAfter that, votes will be taken to regional counts, in the same way as they are at elections. How long will that take? \nQuite a while, but unlike the local elections, all of the counting for the EU referendum will take place overnight. \nIn recent years local elections in some constituencies have been counted the next day. What time will the votes be counted? \nEach region has given an estimation of how long it’s going to take them to count their votes. \nSunderland, for many reasons, have a thing about being the first to report their result in election counts, and the referendum will be no exception. \nThey, along with Foyle in Northern Ireland and Wandsworth in London, are boasting they’re going to be first, somewhere between 11.30pm and 12.30am. \nThe bulk of the results should be in somewhere between 3am and 4am on Friday morning. What happens then? \nThe votes from the 380 council counts will be collated at 12 regional centres across the country. \nOnce the regionals have all reported in, the result will be officially declared from Manchester Town Hall. \nThe Union Jack flag flies besides the flag of the European Union What time will we know the result? \nWe won’t know the full numbers until after 7am. \nBut we’re hoping to make a projection of the result before that. \nIf London swings for Brexit it’ll be a good night for Leave, while if Essex goes Remain it’ll be a very bad night for Boris, for example. \nIt’s also because the number of total votes up for grabs are being declared before the number cast for each side. \nThat means by about 3am or 4am, we should have a rough idea of the ‘magic number’ of votes needed to guarantee more than 50%. \nAs soon as we’ve done our maths, we will be counting down towards that golden figure. Unless the vote’s close it should become clear. Wow, sounds like an all nighter. Will there be exit polls to give us something before we go to bed? \nNope. Those of you who do the smart thing on election night - which is to stay up for the exit polls and then go to bed - are out of luck. \nIf you want to know the result first, you’ll have to stay up all night with the rest of us geeks - and you can follow it all with our up-to-the-minute live coverage. What time will my area declare its result? \nThere are seven counting areas in the North East- with the total overall regional result being announced in Sunderland. \nHere are the estimated declaration times in order for each one provided by the Electoral Commission. \nThese times are subject to change so take them with a pinch of salt. \nSunderland - 12.30am", "external_links": [], "published": "2016-06-22T14:57:00.000+03:00", "crawled": "2016-06-22T15:50:42.338+03:00", "highlightTitle": ""}