{"organizations": ["European Union", "EU", "Daily Telegraph"], "uuid": "6776c9839419f40dba722e112090f7c9e365eed0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article11523550.ece/ALTERNATES/s1200/JS93399455.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/could-eu-referendum-results-overturned-11522925", "country": "GB", "domain_rank": 21960, "title": "Could the EU referendum results be overturned?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Could the EU referendum results be overturned?", "spam_score": 0.0, "site_type": "news", "published": "2016-06-24T19:30:00.000+03:00", "replies_count": 0, "uuid": "6776c9839419f40dba722e112090f7c9e365eed0"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/could-eu-referendum-results-overturned-11522925", "ord_in_thread": 0, "title": "Could the EU referendum results be overturned?", "locations": ["EU", "Britain", "UK"], "entities": {"persons": [{"name": "david cameron", "sentiment": "none"}, {"name": "cameron", "sentiment": "none"}, {"name": "boris johnson", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "european union", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "daily telegraph", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["David Cameron", "Cameron", "Boris Johnson"], "text": "Could the EU referendum results be overturned? 17:30, 24 Jun 2016 There's a glimmer of hope for those wanting the UK to remain in the European Union Shares The video will start in 8 s Cancel Click to play Tap to play The Live Event you are trying to watch is either unavailable or has not started Please refresh this page in your browser to reload this live event video \nIs all lost for those who cling to the dream that the UK remain part of the European Union ? \nFor those looking for straws to clutch at, how about the following. \nThe vote to Leave is not actually legally binding as it is parliament and not the voters who make that decision. \nLegal experts have pointed out the Brexit vote is “advisory,” not “mandatory”. \nAs such MPs can legally disregard the public’s will and decide the path Britain chooses. So what could happen next? \nThe options of course include supporting the result but on the flipside MPs can choose to ignore it. Pro-EU ministers have an overwhelming cross-party support in parliament, with less than 200 of the 650 MPs supporting the Leave campaign. \nA Commons vote could put pressure on the government to keep the UK inside the single market. \nAnother option is to renegotiate a deal with the EU making it more palatable to the British public and then holding another referendum. \nFanciful, you might think. But here’s the thing. In February Boris Johnson, the early favourite to replace David Cameron as Prime Minister, intimated just that. \nIn his Daily Telegraph column he wrote: “EU history shows that they only really listen to a population when it says ‘no’”. Video loading Click to play Tap to play The Live Event you are trying to watch is either unavailable or has not started Please refresh this page in your browser to reload this live event video \nHe has previously suggested that only by voting to Leave would the country “get the change we need”. This was widely interpreted as advocating a second referendum. \nHowever he later back tracked, saying “out was out”. \nThere is another scenario which could, theoretically, see the result overturned. \nThis is if MPs forced a general election and a party campaigned on a promise to keep Britain in the EU, got elected and then claimed that the election mandate topped the referendum one. How likely would that be? \nVery unlikely, say experts. \nMany commentators, argue it would be “political suicide” if the government were to dismiss the result of a democratic vote. \nIt is only when Article 50 is invoked that it all become legally binding, the timing of which is something Mr Cameron has left to his successor. \nSo there’s still some time left. More on the EU Referendum", "external_links": [], "published": "2016-06-24T19:30:00.000+03:00", "crawled": "2016-06-24T19:53:36.599+03:00", "highlightTitle": ""}