{"organizations": [], "uuid": "b6abed8e523e56801a0ae81cc2c9ad4e07f7801e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12223885.ece/ALTERNATES/s1200/Car-production-figures.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12550090", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Job numbers jump up in manufacturing, plus latest news", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast LIVE: Job numbers jump up in manufacturing, plus latest news", "spam_score": 0.0, "site_type": "news", "published": "2017-02-06T15:00:00.000+02:00", "replies_count": 0, "uuid": "b6abed8e523e56801a0ae81cc2c9ad4e07f7801e"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12550090", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Job numbers jump up in manufacturing, plus latest news", "locations": [], "entities": {"persons": [{"name": "gina wilson", "sentiment": "none"}, {"name": "reed", "sentiment": "none"}, {"name": "mark mowbray", "sentiment": "none"}, {"name": "david horne", "sentiment": "none"}, {"name": "greene king", "sentiment": "none"}, {"name": "briggs", "sentiment": "none"}, {"name": "mastioni", "sentiment": "none"}, {"name": "andy briggs", "sentiment": "none"}, {"name": "marcello mastioni", "sentiment": "none"}, {"name": "david coulthard", "sentiment": "none"}, {"name": "prudhoe chare", "sentiment": "none"}, {"name": "matt cave", "sentiment": "none"}, {"name": "wooler", "sentiment": "none"}, {"name": "nick forbes", "sentiment": "none"}, {"name": "claire ansley", "sentiment": "none"}, {"name": "broughshane", "sentiment": "none"}, {"name": "michael o’leary", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "ben powick", "sentiment": "none"}, {"name": "james reed", "sentiment": "none"}, {"name": "homeaway", "sentiment": "none"}, {"name": "michael schumacker", "sentiment": "none"}, {"name": "coreena ford homeaway", "sentiment": "none"}, {"name": "rui vieira/pa wire", "sentiment": "none"}], "locations": [{"name": "yorkshire", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}, {"name": "newbiggin", "sentiment": "none"}, {"name": "virgin money", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "goodwick", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "austin", "sentiment": "none"}, {"name": "gosforth", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "cumbria", "sentiment": "none"}, {"name": "cornwall", "sentiment": "none"}, {"name": "port of tyne", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "wales", "sentiment": "none"}, {"name": "berwick", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "stansted", "sentiment": "none"}, {"name": "airbnb", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}, {"name": "vancouver", "sentiment": "none"}, {"name": "northumberland street", "sentiment": "none"}, {"name": "virgin", "sentiment": "none"}], "organizations": [{"name": "ryanair", "sentiment": "negative"}, {"name": "northumbria university", "sentiment": "none"}, {"name": "coreena ford employers", "sentiment": "none"}, {"name": "cavtec", "sentiment": "none"}, {"name": "business champion for older workers", "sentiment": "none"}, {"name": "coreena ford north shields", "sentiment": "none"}, {"name": "virgin trains", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "northfield communications", "sentiment": "none"}, {"name": "newcastle council", "sentiment": "none"}, {"name": "expedia", "sentiment": "none"}, {"name": "virgin trains east coast", "sentiment": "none"}, {"name": "emea", "sentiment": "none"}, {"name": "bar fleet", "sentiment": "none"}, {"name": "coreena ford", "sentiment": "none"}, {"name": "greene king", "sentiment": "none"}, {"name": "carnegie uk trust", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "north east england chamber of commerce", "sentiment": "none"}, {"name": "cavtec systems ltd", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}, {"name": "berwick", "sentiment": "none"}, {"name": "aviva uk life", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "coreena ford virgin trains", "sentiment": "none"}, {"name": "homeaway", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KEY EVENT Ryanair profits fall amid Brexit vote fallout \nProfits at Ryanair dipped in the third quarter amid a backdrop of tough competition and a challenging outlook. \nThe Irish carrier said profit after tax fell 8% to 95 million euro (£81m) in the three months to the end of December. The firm said average fares fell 17% to 33 euro per passenger as it ramped up competition with rivals, with prices set to go even lower. Ryanair chief executive Michael O’Leary also said the collapse in sterling following the EU referendum “exacerbated” the hit from falling fares. \nHe said: \nAs previously guided, our fares this winter have fallen sharply as Ryanair continues to grow traffic and load factors strongly in many European markets. \nThese falling yields were exacerbated by the sharp decline in sterling following the Brexit vote. \nRyanair responded to this weaker environment by continuing to improve our Always Getting Better customer experience, cutting costs, and stimulating demand through lower fares which has seen load factors jump to record levels. \nTraffic grew 16% to 29 million customers and Ryanair maintained its full year profit guidance of between 1.3 billion euro (£1.12bn) to 1.35 billion euro (£1.16bn), but said this is dependent on the absence of any “unforeseen security events” taking place, adding the outlook for 2017 is “cautious”. \nIn July, the carrier said the decision by Britain to quit the European Union was “a surprise and a disappointment”, and it would “pivot” growth away from UK airports and focus more on growing European airports over the next two years. \nOn Monday, Ryanair reiterated the stance, saying: \nWhile it appears that we are heading for a ‘hard’ Brexit, there is still significant uncertainty in relation to what exactly this will entail. \nThis uncertainty will continue to represent a challenge for our business for the remainder of 2017 and 2018. \nWe expect sterling to remain volatile for some time and we may see a slowdown in economic growth in both the UK and Europe as we move closer to Brexit. While there may be opportunities to expand at certain UK airports (such as the recent extension of our growth deal at Stansted), we expect to grow at a slower pace than previously planned in the UK. \nBritish airlines are waiting with bated breath to discover whether the UK will remain a member of the EU’s Open Skies aviation free market. (Photo: Rui Vieira/PA Wire) Coreena Ford The Purple Bear subterranean smokehouse and cocktail joint reveals Newcastle city centre location \nA subterranean bar and smokehouse is poised to open in Newcastle city centre , creating 20 jobs as part of investment plans. \nThe Purple Bear was originally slated to open in the former Bar Fleet venue in Pudding Chare, but the plans fell through at the last minute, sending the firm’s directors in search of a new home for their bar and restaurant. \nThe search came to an end when the firm’s directors heard how pub company Greene King was on the look out for ambitious entrepreneurs to take over the running of its site pub on Prudhoe Chare, just off Northumberland Street, which currently trades as The Northumberland Arms. \nLast July, Greene King put out a call for bar operators after initially hatching plans for an underground Prohibition-era style bar. \nHowever, the plans were shelved when Greene King was seduced by Purple Bear’s pledge to create a stylish American grill venue, bringing the best of the American South to the North East. \nAnd having spent almost two years working towards a Newcastle opening, the Purple Bear directors are hopeful that they can put their plans into action swiftly, and open in March. \nThe three directors, all of whom have spent their careers within the hospitality industry, are now working with the pub partners division of Greene King on transforming the interior of the underground venue into a smokehouse and cocktail joint, which will aim to provide ample room for diners and drinkers. The Northumberland Arms on Prudhoe Chare is set to be turned into The Purple Bear (Photo: newcastle chronicle) 8.40 Coreena Ford Newcastle-based IT company Cavtec launches vintage computer game parties for children \nA collection of vintage computer games has seen a Newcastle IT company offer children’s parties where ‘lads and dads’ can play together. \nThe retro gaming platform set-up by Cavtec Systems Ltd provides a taste of of nostalgia with the chance to indulge in retro gaming with a collection of pre-internet, late 20th century games. \nCavtec - whose regular business involves the slightly more mundane activities of supplying computer systems to businesses - is moving into the party business to take advantage of its collection of floppy disc-era computer games, as well as some Amiga and Atari consoles. \nThough less hi-tech than modern games, the vintage collection offers the nostalgic thrills of racing Formula 1 cars against Michael Schumacker and David Coulthard, managing football teams from the era before the widespread availability of foreign players or going into space with rudimentary 3D graphics. \nCavtec director Matt Cave said: \nWe are offering the classic gaming experience that can’t be found any more. \nIt can certainly be the birthday party with a difference by getting up to 20 computers connected and the chance to pay fun games with or against your friends. Makes a change from soft play or bowling. \nDads can also go back to their youth and re-live the past with their children with those blocky graphic, crazy soundtracked games. \nIts retro gaming service will be launched at the Nethermined event at Northumbria University this coming weekend, an event dedicated to the Minecraft game. Matt Cave, Cavtec Systems Ltd, with some of the games on offer (Photo: Northfield Communications) 8.35 Coreena Ford Virgin Trains to create 45 new jobs at Newcastle customer centre \nirgin Trains is to expand its customer call centre in Newcastle, creating 45 new jobs just a few months after it opened. \nThe new jobs will be based at the rail company’s customer solutions centre at Gosforth after it brought its web support team in-house as part of its drive to improve customer service. \nAround 85 employees already work at the centre, which is within Virgin Money’s headquarters, handling a range of customer inquiries, including bookings, special assistance, delay repay and customer feedback. \nThe new jobs at the centre, which have been created just four months after its launch, have been described as a vote of confidence in the city. \nClaire Ansley, general manager for Virgin Trains on its east coast route, said: \nWe’re really pleased to expand the centre and bring around 45 more jobs to Newcastle. \nWe’re recruiting now and see this move as very important to further improving our customers’ experience of booking and travelling with us, as well as continuing to support the city and wider regions’ economies. \nBy bringing our web support team in-house, our employees can develop greater knowledge of the company and its digital channels and products. Their knowledge of the route is also very important and Newcastle is a great city in which to work and a key destination for our services. David Horne, managing director of Virgin Trains East Coast and Newcastle Council leader Nick Forbes meet staff at Virgin's customer centre 8.30 Coreena Ford North Shields, Wooler, Berwick and Newbiggin to get UK twin towns \nIt was a project that aimed to foster international fraternity, trade links across nations and trips abroad for eager schoolchildren. \nIn the aftermath of the Second World War, town twinning took hold as a means of bringing together former foes, with towns and cities around the North East forging links with communities in Europe and abroad. \nBut now an attempt has been launched to build bridges slightly closer to home to meet a new set of challenges for the 21st century. \nA series of town twinning partnerships between communities within the UK have been launched in a bid to boost domestic trade as the country gears up for Brexit. \nAnd the North East is at the head of the scheme, with four of the 10 partnerships involving towns from this region. \nThe link-ups being announced today will see Wooler in Northumberland form an alliance with Broughshane, in Northern Ireland, while nearby Berwick has been paired with Fishguard and Goodwick, in Wales. \nGina Wilson, development manager at the Carnegie UK Trust, said: “Twin Towns is aimed at encouraging towns to make a positive impact locally, especially at a time when devolution of power to cities and regions is becoming more prevalent. \n“In fostering new relationships with partners that towns might not have considered before, it will provide a new perspective and hopefully new solutions to real and current issues. Whilst we don’t expect the towns’ concerns to be resolved overnight, we hope that the new partnerships will be the start of something positive.” Wooler in Northumberland will form an alliance with Broughshane, in Northern Ireland (Photo: Newcastle Chronicle) 8.24 Coreena Ford HomeAway prepares for UK boost amid UK staycation increases \nHoliday rental firm HomeAway is preparing for a jump in UK business this year as Brits trade international trips for staycations following the pound’s collapse. HomeAway, a rival to Airbnb that offers short term home lettings, says nearly a fifth of UK travellers are more likely to to opt for a holiday within Britain’s borders than last year as a result, and that London may not be the biggest draw. \nMarcello Mastioni, HomeAway’s vice president and managing director for EMEA, said: “In relation to the weakening of the pound, we’ve actually seen a trend of people spending more of their vacations domestically in the UK,” \nA survey run by the company in the wake of the Brexit vote showed that 70% of Brits have no intention of cutting vacation spending, but most are aware that holidays abroad are more expensive given the pound’s 18% drop against the dollar and near 10% fall against the euro. \nHomeAway found that 20% are more likely to have a staycation this year than in 2016, with that figure rising to 35% for families. \nBut the Austin, Texas headquartered company - which operates in the UK through its own eponymous website as well as OwnersDirect.co.uk - says domestic travellers are likely to shun London. \n“London is more of a destination for maybe extended long weekends. But if you’re thinking about an alternative to an international destination for say, summer holidays, then you would consider other domestic destinations such as Cornwall, Devon, Yorkshire, Cumbria and so on,” Mr Mastioni said. \nThe company, which was snapped up by travel giant Expedia at the end of 2015 in a $3.9bn deal (£3.1bn), reported a 61% jump in year-on-year revenues to $210m in the third quarter (£168m), and adjusted operating profit of $74m (£59m). Despite its growth, it is still lagging behind industry behemoth Airbnb which has 130,000 listings across the UK, compared to HomeAway which has anywhere between 40,000 to 50,000. “Anybody would like to overtake Airbnb,” Mr Mastioni said, but stressed that HomeAway differentiates itself by focusing on full-property vacation rentals rather than single-rooms lettings. \nIt has helped the company dodge some of the criticism hitting rival sites like Airbnb, which have been accused of exacerbating housing crunches in major cities like London, Paris, New York and Vancouver - and in some cases led to a regulatory crackdown on short-term rentals. London now has a 90-day annual limit for short-term lettings, with extensions requiring special permits. Staycations will increase this year on the back of a weak pound 8.18 FTSE and pound latest \nThe FTSE-100 index opened at 7188.30. \nThe pound at 8am was 1.2474 dollars compared to 1.2510 dollars at the previous close. The euro at 8am was 0.8618 pounds compared to 0.8627 pounds at the previous close. 8.15 Coreena Ford Employers urged to curb age bias \nEmployers are being urged to increase the number of older workers by one million over the next five years to combat age bias. \nEvery UK firm should have 12% more people aged 50-69 in their workforce by 2022, according to Andy Briggs, the Government’s Business Champion for Older Workers. \nMr Briggs, chief executive of Aviva UK Life, said older people could be written off by their employers, adding: “We live in an ageing society so it is critical that people are able to work for as long as they need and want to, and there are overwhelming benefits for both employers and employees. \n“Many people aged over 50 want to continue to develop their careers, learn new skills, try new things and also share their broad knowledge and experience. “This is good for everyone, and particularly for employers and their businesses who will benefit from drawing on the talent, creativity and experience of all of their employees, regardless of their age.” \nThe one million target was “ambitious but necessary”, given there are 15 million people aged between 50 and 69, but only nine million in work, said the report. \nThe employment rate for the age group was 59%, but Mr Briggs said this must increase to 66% by 2022 if the UK is to address its skills gap. \nThe Government announced a new strategy last week aimed at increasing the number of older workers. 8.10 KEY EVENT Price increases on the way as weak pound increases costs \nFresh evidence that the weak pound will increase the price of products has emerged in a survey of North East businesses. \nThe new International Trade Survey conducted by the North East England Chamber of Commerce shows that well over half of businesses expected the fall in the value of the sterling to increase their costs in the coming year. As a result, almost half of those companies surveyed expected they will have to increase prices over the next 12 months. \nAnd while firms in the region had seen a positive effect on export sales because of the weak pound, 40% of North East business had seen a negative impact on business within the UK in the past few months. \nBen Powick, policy adviser covering international trade and Brexit at the Chamber, said: \nThe recent fall in the value of sterling has ignited a lot of debate around whether it has had a positive impact on businesses, both domestically and through international trade, on their exporting margins. \nThis research has clearly shown exporters are experiencing both good and bad effects. \nSterling’s value has had a significant impact on import prices, and as a manufacturing region we buy a substantial volume of goods from the EU in particular. Importers that are locked into contracts with suppliers abroad will have limited means to respond to the recent rise. \nIt is a concern for our members that currency rates are expected to be volatile with the transition to Brexit occurring over the next few months. \nThe Government recently outlined a 12-point plan on the direction of the forthcoming Brexit negotiations with significant changes to come for exporters in terms of our trading relationship with the EU. Our businesses need to have the right level of support to ensure there is minimal disruption and cost to their trading activities. Nissan cars awaiting export at Port of Tyne photographed by Mark Mowbray from a helicopter 8.00 KEY EVENT Jobs market buoyant as manufacturing shows strong employment growth \nJobs in manufacturing have increased by almost a quarter in the past year, a report shows. \nConstruction, engineering and retail have also shown strong employment growth, according to a study by Reed. \nJob vacancies have increased in all regions of the UK, said Reed, but has been particularly strong in Northern Ireland and Wales. \nJames Reed, chairman of reed.co.uk, said: \nThere’s a lot of uncertainty in world politics at the moment, but our data shows that in spite of everything, the UK jobs market remains buoyant. Manufacturing is key to prosperity and as such is a vital part of any economy and that is why these figures are so encouraging. \nThis is not a one-off either. The sector has been going in the right direction for some months now, which is reassuring news. Jobs in manufacturing have increased by almost a quarter in the past year Share", "external_links": [], "published": "2017-02-06T15:00:00.000+02:00", "crawled": "2017-02-06T10:52:30.132+02:00", "highlightTitle": ""}