{"organizations": [], "uuid": "3c16612a4f080dc973d69f2a67bc1048f691c61e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12432639.ece/ALTERNATES/s1200/Brexit.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/race-hate-crime-north-east-12610616", "country": "GB", "domain_rank": 21960, "title": "Race hate crime in North East soars to record levels in post Brexit period", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Race hate crime in North East soars to record levels in post Brexit period", "spam_score": 0.0, "site_type": "news", "published": "2017-02-16T00:42:00.000+02:00", "replies_count": 0, "uuid": "3c16612a4f080dc973d69f2a67bc1048f691c61e"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/race-hate-crime-north-east-12610616", "ord_in_thread": 0, "title": "Race hate crime in North East soars to record levels in post Brexit period", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "News Race hate crime in North East soars to record levels in post Brexit period Incidents in Northumbria force area up 48% in three months after EU referendum compared to same period before vote Share EU and Union flags (Photo: PA) Share Get   Thank you for subscribing!   \nRace hate crime in the North East has reached record levels post Brexit, a new report has revealed. \nIn the Northumbria force area there were 398 incidents in the July to September period, up 48% on the three month period in the run up to the EU referendum vote on June 23. \nThe 48% figure represents the highest hate crime increase in the region in a quarterly period since comparable records began in April 2012. \nAnd Northumbria saw the 11th largest rise in the 44 police forces areas in England and Wales covered in the research. \nA human rights organisation has said the country should prepare for the possibility of further spikes in offences once the Brexit process has begun. \nCommenting on the figures, Northumbria Police and Crime Commissioner, Vera Baird QC, said: “These figures reflect the national peak in reported hate crime in the months around Brexit - thankfully in Northumbria this didn’t last and recent figures show a return to levels only a fraction worse than this time last year. Vera Baird \n“That said, hate crime should not be happening at all but unfortunately it does. It’s therefore very important that we make sure those targeted have the confidence to come forward and report it. Our officers proactively encourage this and reach out to minority groups to build relationships and allow for concerns to be raised. \n“Victims can take reassurance from the fact that our force is ranked first nationally for hate crime victim satisfaction. I hope this encourages anyone who is subjected to any form of prejudice or discrimination to speak out. \n“Hate crime will not be tolerated in Northumbria and those responsible will be fiercely prosecuted - that’s the message and we need to make it loud and clear.” \nIn the Durham Constabulary area there were 66 race hates crimes reported, up 16% on the pre Brexit figure. \nA spokesman for Durham Constabulary said: “Compared to 2015/16 we have seen a slight rise in both reported hate incidents and crime but these are still very low and we suspect there are significant levels of under reporting. An unnamed mother of two from Sudan who has experienced racist abuse since moving to the UK (Photo: Daily Mirror) \n“We would actively encourage anyone who feels they have been a victim of hate crime to report it to the police by calling 101 so we can help them. \n“In Durham we have an effective reporting system and are in partnership with various agencies across County Durham & Darlington with the aim of increasing reporting and tackling hate crime. We also encourage anyone who would prefer not to report this type of crime directly to us, to use True Vision which is a third party reporting facility.” \nThe figures, compiled by the Press Association, show that in the three months ending September 2016, 33 out of 44 forces recorded the highest quarterly number of hate crimes since comparable records began in April 2012. In some areas the number of incidents jumped by more than 50% while only four forces reported a decrease on the previous three months. \nThe Equality and Human Rights Commission (EHRC) said the findings suggested a small number of people used the Brexit vote “to legitimise inexcusable racism and prejudice”, while the charity Victim Support said that more needed to be done to encourage victims to come forward. \nProvisional figures on hate crimes published by the Home Office in October 2016 suggested that offences in July 2016 were 41% higher than in July 2015. \nThe Press Association also cross-referenced data on offences with the results of the EU referendum to see if there was any pattern to the level of hate crime. \nIn 36 police force areas, a majority of voters backed Leave in the referendum - and the quarterly hate crime figure rose in all of them except two. \nThe Northumbria force area covers Newcastle, Sunderland, Gateshead, Northumberland and North and South Tyneside. Of these, only Newcastle voted Remain in the EU referendum. Durham also backed Brexit. \nDavid Isaac, chairman of the EHRC, said it “must be sensible to prepare for any possible spikes” in hate crime once Brexit negotiations got under way. \n“The vast majority of people who voted to leave the European Union did so because they believed it was best for Britain and not because they are intolerant of others,” he said. Read More How many race hate crimes have taken place in Tyneside since Brexit vote? \n“It is clear, however, that a small minority of people used the Brexit vote to legitimise inexcusable racism and prejudice. We cannot allow such intolerable acts of hate to be condoned or repeated. \n“The triggering of Article 50 is the next major milestone and we must do all we can to discourage hate attacks and to support people who feel at risk.” \nHowever UKIP leader Paul Nuttall has said that such incidents have been “overblown” in an attempt to “rubbish Brexit”. UKIP leader Paul Nuttall (Photo: PA) \n“A lot of that (rise in hate crimes) is fabricated,” he told The Independent, although he admitted some incidents had taken place. \nHe said: “Of course there will be individual instances and people should never be victims of hate crime at all. \n“I’ve said this in the chamber in the European Parliament, my heart goes out to those people who have been victims, but I think a lot of this has been overblown specifically to try to rubbish Brexit.” \nThe Home Office said Britain had some of the strongest legislation on hate crime anywhere in the world. \n“The Home Secretary has been crystal clear that crime motivated by hostility and prejudice towards any group in society has no place whatsoever in a Britain that works for everyone,” a spokesman said. \n•The Press Association compiled its figures from open data published by every police force in England and Wales. Comparable data is not available for Scotland and Northern Ireland Like us on Facebook", "external_links": [], "published": "2017-02-16T00:42:00.000+02:00", "crawled": "2017-02-15T20:01:29.677+02:00", "highlightTitle": ""}