{"organizations": [], "uuid": "9de02866f302f7660441b8f01dcf10c8a0ce9690", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article10738546.ece/ALTERNATES/s1200/JS80401344.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/law-firm-watson-burton-sees-12597437", "country": "GB", "domain_rank": 21960, "title": "Law firm Watson Burton sees profits rise despite another drop in revenue", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Law firm Watson Burton sees profits rise despite another drop in revenue", "spam_score": 0.0, "site_type": "news", "published": "2017-02-13T20:45:00.000+02:00", "replies_count": 0, "uuid": "9de02866f302f7660441b8f01dcf10c8a0ce9690"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/law-firm-watson-burton-sees-12597437", "ord_in_thread": 0, "title": "Law firm Watson Burton sees profits rise despite another drop in revenue", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Law firm Watson Burton sees profits rise despite another drop in revenue Newcastle law firm Watson Burton achieved the increase in profits despite turnover falling by 6.9% Share Patrick Harwood, CEO, Watson Burton Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nNewcastle law firm Watson Burton saw an increase in profit despite reporting a drop in revenue for the eighth year in a row. \nThe firm’s operating profit for the year ending April 30 2016 rose 17% to £240,774 despite a drop in turnover from £8.8m to £8.2m. The firm’s net profit, which is paid out to its partners, soared from £125,000 in 2015 to £201,000 last year. \nWatson Burton - whose headcount has more than halved since 2008, when its turnover was more than £23m - said it was still “shaking off the effects of the recession” but was better positioned to cope with the “turbulent” market conditions in the legal sector. \nThe year covered by the accounts saw the firm’s headcount drop by 10 but it said it was growing in targeted areas, with technology and education proving areas for growth. \nCEO Patrick Harwood said: “2016 was about continuing to build the solid platform for the future growth and development of Watson Burton with recruitment, continued initiatives to deliver service excellence and the further development of profitable core services driving the agenda. \n“The perpetual goal of achieving greater efficiencies across the business underpins the firm’s commitment to offer clients excellent value for money in the services we provide. \n“We remain committed to shaking off the effects of recession and focusing our efforts on delivering stability and profitable growth. The firm is responding effectively to the turbulent market conditions which have come to define the legal services sector in recent years.” \nWatson Burton’s increase in profitability was largely caused by the firm reducing its costs over the year. \nThe largest drop in costs was across Watson Burton’s staffing bill, which fell by £540,000 to £3.99m. The firm’s total headcount fell by 10 last year, from 122 in 2015 to 112. Read More Newcastle law firm Muckle sees profits soar by £1m but warns of Brexit slow-down \nDespite the reduction in headcount, Watson Burton has embarked on a recruitment drive, which has seen it add 25 new recruits and the appointment of three new partners to the business over the last 12 months. \nMr Harwood added: “The legal services marketplace is evolving at an unprecedented rate. The services that businesses require and the means by which the end consumer now accesses legal advice have been fundamental drivers in how Watson Burton’s development plans are now being implemented. \n“It remains crucial to our strategy that we continue to offer innovative, highly relevant and keenly priced solutions to clients, delivered by personable and energetic sector specialists. These qualities are at the centre of the firm’s long term growth plans.” Like us on Facebook", "external_links": [], "published": "2017-02-13T20:45:00.000+02:00", "crawled": "2017-02-13T16:29:24.308+02:00", "highlightTitle": ""}