{"organizations": [], "uuid": "19c8fbd1561d9239e5c6cc85ec2a9e29279e49fa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30166148/15878734.jpg", "site_section": "http://www.middevongazette.co.uk/all-content.rss", "section_title": "Devon Live All Content Feed", "url": "http://www.devonlive.com/exeter-s-princesshay-leisure-won-t-be-delayed-says-developer-in-a-really-non-committal-way/story-30166148-detail/story.html", "country": "GB", "title": "Alex_Richards commented Exeter's Princesshay Leisure won't be delayed, says developer in...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "Alex_Richards commented Exeter's Princesshay Leisure won't be delayed, says developer in...", "spam_score": 0.0, "site_type": "news", "published": "2017-02-27T22:12:00.000+02:00", "replies_count": 0, "uuid": "19c8fbd1561d9239e5c6cc85ec2a9e29279e49fa"}, "author": "Alex_Richards", "url": "http://www.devonlive.com/exeter-s-princesshay-leisure-won-t-be-delayed-says-developer-in-a-really-non-committal-way/story-30166148-detail/story.html", "ord_in_thread": 0, "title": "Alex_Richards commented Exeter's Princesshay Leisure won't be delayed, says developer in...", "locations": [], "entities": {"persons": [{"name": "alex", "sentiment": "none"}, {"name": "john grinnell", "sentiment": "none"}, {"name": "richards", "sentiment": "none"}, {"name": "cllr andrew leadbetter", "sentiment": "none"}, {"name": "cllr bialyk", "sentiment": "none"}], "locations": [{"name": "exeter", "sentiment": "none"}, {"name": "south street", "sentiment": "none"}, {"name": "fore street", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "exeter", "sentiment": "none"}, {"name": "princesshay leisure", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "st sidwell", "sentiment": "none"}, {"name": "ecc", "sentiment": "none"}, {"name": "labour council", "sentiment": "none"}, {"name": "exeter high street", "sentiment": "none"}, {"name": "exeter bus station", "sentiment": "none"}, {"name": "exeter city council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Exeter's Princesshay Leisure won't be delayed, says developer in a really non-committal way By Alex_Richards | Posted: February 27, 2017 1 COMMENTS SHARES Comments (1) \nFollowing last week's shock announcement we quizzed The Crown Estate on the future of their £75 million section of Exeter's landmark bus & coach station redevelopment. \nLast week Exeter City Council revealed their plans for a £27 million leisure centre and £6.25 million bus station were \"delayed indefinitely.\" \nThe Crown Estate has outline planning permission to build shops, restaurant and a cinema on the remainder of the site under the title Princesshay Leisure. \nBut their response to us was, worryingly, fairly non committal. \nJohn Grinnell from The Crown Estate said: \"Our development programme aspirations for Exeter remain as before and we aren't, at this stage, changing any of the project milestones we're working too, the first of which is the determination of our reserved matters planning application. \n\"Delivering a large city centre masterplan like this is an incredibly complex process and a whole range of factors always come into play. We have to look at all of these on an on-going basis. \n\"Right now we're looking forward to the determination of our reserved matters planning application in due course.\" \nThe council's side of the scheme was thrown into chaos last week, sparking fierce criticism of the city council. \nIt was announced on Thursday that the authority needs more time to conclude the procurement process for a contractor which will build it. \nCllr Bialyk said: \"There is no doubt the Brexit and the current state of the economy has had its impact, more than we expected. \n\"Not everything is marvellous in the country, despite what the Brexiteers tell you. There are a number of projects not going ahead, or not going ahead as quickly. \n\"But we are incredibly nervous about getting this right. We want this to work and that's our plan.\" \nThe council say details of the tenders will remain confidential while the discussions are ongoing, due to their commercial sensitivity. \nExeter's conservative leader Cllr Andrew Leadbetter said: \"I am very, very concerned about the impact this will have on the city centre. It appears the Labour council's flagship policy is unravelling and we urgently need to find answers as to why. \n\"Before embarking on this massive project they should have had all their ducks in a row. It is our job to now hold the Labour party to account. It is unacceptable to not give a time-scale and simply tell us it is delayed. \n\"With their neglect of South Street and the top of Fore Street, with the empty BHS unit, Exeter High Street will be sandwiched between two bomb sites. \n\"And to blame the Brexit is ridiculous. Everyone seems to be trying blame everything on the Brexit. \nECC planned to start construction on the state-of-the-art new leisure complex St Sidwell's Point, and a new Exeter Bus Station, at the end of March. \nIts completion date was set for December 2018. \nNow the development is on hold, it means the current bus station won't need to close, and will continue to operate as normal until further notice. \nAre you worried about the future of the project? Email your thoughts to", "external_links": [], "published": "2017-02-27T22:12:00.000+02:00", "crawled": "2017-02-27T18:54:47.696+02:00", "highlightTitle": ""}