{"organizations": [], "uuid": "26b733b5ae6404835e03f00af688d84a1658f815", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30166624/15878999.jpg", "site_section": "http://www.westernmorningnews.co.uk/all-content.rss", "section_title": "Devon Live All Content Feed", "url": "http://www.devonlive.com/farmers-unite-with-food-hamper-to-show-minister-value-of-uk-farming/story-30166624-detail/story.html", "country": "GB", "title": "AthwennaIrons published Farmers unite with food hamper to show minister value of UK...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "AthwennaIrons published Farmers unite with food hamper to show minister value of UK...", "spam_score": 0.0, "site_type": "news", "published": "2017-02-27T23:41:00.000+02:00", "replies_count": 0, "uuid": "26b733b5ae6404835e03f00af688d84a1658f815"}, "author": "AthwennaIrons", "url": "http://www.devonlive.com/farmers-unite-with-food-hamper-to-show-minister-value-of-uk-farming/story-30166624-detail/story.html", "ord_in_thread": 0, "title": "AthwennaIrons published Farmers unite with food hamper to show minister value of UK...", "locations": [], "entities": {"persons": [{"name": "febru", "sentiment": "none"}, {"name": "liam fox", "sentiment": "none"}, {"name": "meurig raymond", "sentiment": "none"}, {"name": "cornish", "sentiment": "none"}, {"name": "raymond", "sentiment": "none"}, {"name": "simon hadley", "sentiment": "none"}, {"name": "fox", "sentiment": "none"}, {"name": "mike hambly", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "international conference centre", "sentiment": "none"}, {"name": "cardiff", "sentiment": "none"}, {"name": "westminster", "sentiment": "none"}], "organizations": [{"name": "farmers", "sentiment": "none"}, {"name": "national farmers' union", "sentiment": "none"}, {"name": "icc", "sentiment": "none"}, {"name": "department for international trade", "sentiment": "none"}, {"name": "nfu", "sentiment": "none"}, {"name": "international trade", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Farmers unite with food hamper to show minister value of UK farming By AthwennaIrons | Posted: February 27, 2017 0 COMMENTS SHARES Simon Hadley The specially-created hamper is being sent to Liam Fox, International Trade Secretary, to help promote the high standards of British farming and produce Farmers unite with food hamper to show minister value of UK farming X \nCopy link to paste in your message / Pictures: Simon Hadley The specially-created hamper is being sent to Liam Fox, International Trade Secretary, to help promote the high... Comments (0) \nThirteen British farmers took to the National Farmers' Union (NFU) conference stage to add produce to a specially-created hamper to be sent to Liam Fox, International Trade Secretary. \nPresented on the second and final day of the conference, held at the International Conference Centre (ICC) in Birmingham last week (February 21-22), the hamper included a selection of the finest British and Red Tractor-assured food. \nAmong the 13 members who took part was Cornish arable farmer Mike Hambly, who added porridge oats and Weetabix cereal to the hamper. \nMeurig Raymond, NFU President, said the hamper would send a clear message to the Department for International Trade promoting the high standards of British produce and urging policymakers to not undersell British farmers. \nIn what is the last NFU Conference before Article 50 is triggered, Mr Raymond said in his closing speech: \"During our annual conference I have talked a lot about future trade deals, how these must give us opportunities for export and how we mustn't be traded off against other sectors. Above all how our high standards mustn't be undermined. \nREAD ALSO: Opportunities for organic farmers as market tops £2 billion \n\"And I have a special message for Liam Fox, who will be negotiating trade deals for Britain. He must be proud of farming and not undersell it. Dr Fox must ensure that our high standards are maintained and we don't open up our borders to cheap food produced at any cost from around the world. \n\"It's been great to see so many people here at our conference particularly the younger generation. These are challenging times but the atmosphere has been really positive. \n\"This is our first conference since the referendum… It will be our last conference before Article 50 is triggered. We have raised a lot of questions at this conference, we haven't too many answers. We must make sure that by next year we have the clarity that the industry needs. It doesn't matter now how anyone voted in the referendum. Now is the time for us to all unite together.\" \nHe continued: \"We can deal with changes – farming is known for it. We are a resilient industry. We must come out of Brexit stronger. \n\"Farmers – we will only get the right deal if our voices are heard, if we shout proudly about what we give back to Britain and we take every opportunity to tell the country – and the world – of our high standards; of our pride we have in the food we produce and the importance of our industry. What we say really does count in Westminster and Cardiff. \n\"Britain is in a perfect place to produce the finest, healthiest food. We have the expertise, we have the soil, we have the climate. We all have the passion. Farmers – let's all get to work and deliver success.\"", "external_links": [], "published": "2017-02-27T23:41:00.000+02:00", "crawled": "2017-02-27T20:46:03.580+02:00", "highlightTitle": ""}