{"organizations": [], "uuid": "fbe870ac518d13fdccc8883b141f8a2243a5f4dd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12548360.ece/ALTERNATES/s1200/Brexit.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/eu-referendum-what-article-50-11519700", "country": "GB", "domain_rank": 21960, "title": "Confused about Article 50? Read our Q&A on the topic that's the endless talk of Britain", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Confused about Article 50? Read our Q&A on the topic that's the endless talk of Britain", "spam_score": 0.0, "site_type": "news", "published": "2017-02-03T00:02:00.000+02:00", "replies_count": 0, "uuid": "fbe870ac518d13fdccc8883b141f8a2243a5f4dd"}, "author": "Keiran Southern", "url": "http://www.chroniclelive.co.uk/news/north-east-news/eu-referendum-what-article-50-11519700", "ord_in_thread": 0, "title": "Confused about Article 50? Read our Q&A on the topic that's the endless talk of Britain", "locations": [], "entities": {"persons": [{"name": "kier starmer", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "catherine mckinnell", "sentiment": "none"}, {"name": "catherine mckinnell", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}], "organizations": [{"name": "britain news confused", "sentiment": "negative"}, {"name": "european parliament", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "newcastle north labour", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Confused about Article 50? Read our Q&A on the topic that's the endless talk of Britain It's Britain's hottest and it doesn't look like it's going away soon, so what is Article 50 and what does it mean to you and I? Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nFor most people Article 50 remains about as clear as mud. So we have waded through the quagmire of red tape and legal-speak to shed some light on what the hot topic of the day means in plain old English. What’s just happened? \nThe process of Britain leaving the European Union has now moved a baby step closer. How? \nIn November the High Court ruled that the Government could not trigger Article 50 without Parliament’s approval. That’s now been given, with MPs’ backing of Theresa May when they voted in favour of the Prime Minister starting official Brexit negotiations. Did the MPs all agree? \nNo but there was an overwhelming majority of 498 votes to 114. Among those not in agreement was Newcastle North Labour MP Catherine McKinnell. Catherine Mckinnell What does the vote mean? \nTheresa May can trigger Article 50 which starts official talks with the EU about how to go about the process of leaving. She intends to do this by March 29. But what is Article 50? \nFirst, its origins should be explained. It’s a section contained within the Lisbon Treaty. This Treaty was signed in 2007 by the leaders of all countries which are EU members and its idea was to make the EU more democratic, transparent and efficient. It came into force in 2009. What is Article’s 50’s role in it? \nIt gives members the right to leave the EU. Before that, they had no legal way to leave once they’d signed up. “Triggering” it means formally telling the other EU members of our intention to pull out. Shadow Brexit Secretary Sir Kier Starmer (Photo: PA) How does it happen? \nNo-one has left before so there are no in-depth guidelines about how to sever ties. How it’s to be done must be agreed by all member states and each can use a veto if it doesn’t like certain conditions. The European Parliament has to give its agreement too. So what happens after Article 50 is triggered? \nNothing for ages. But the clock has started a two-year countdown on talks to decide the terms of exit and, once started, it can’t be stopped without unanimous consent. And at the end of all that? \nBritain will be out of the EU and we may never have to hear the term Article 50 again (an Article 49 exists for former members wanting to get back in!). Prime Minister Theresa May (Photo: PA) What will the end-result mean for Britain? \nIt will no longer be controlled by EU membership rules and will fully govern itself. Does that mean no “health and safety gone mad” issues or a ban on bendy vegetables? \nEU rules and laws will be scrapped. That means coming up with new legislation or perhaps picking out some EU laws to simply recreate as British statute. All changes could take several years. What about our relationships with the wider world? \nBritain would have to form new agreements with the EU, over trade and movement of people, and would be free to negotiate worldwide trade deals. Like us on Facebook", "external_links": [], "published": "2017-02-03T00:02:00.000+02:00", "crawled": "2017-02-02T19:31:56.519+02:00", "highlightTitle": ""}