{"organizations": [], "uuid": "e13f0b8a18fe03b252f0757908f26e71526567c7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12637158.ece/ALTERNATES/s1200/GWR_-NJL_210217conference_01.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/devolution-north-east-key-success-12637048", "country": "GB", "domain_rank": 21960, "title": "Devolution to North East is key to success of Northern Powerhouse, conference hears", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Devolution to North East is key to success of Northern Powerhouse, conference hears", "spam_score": 0.0, "site_type": "news", "published": "2017-02-22T00:02:00.000+02:00", "replies_count": 0, "uuid": "e13f0b8a18fe03b252f0757908f26e71526567c7"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/devolution-north-east-key-success-12637048", "ord_in_thread": 0, "title": "Devolution to North East is key to success of Northern Powerhouse, conference hears", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Devolution to North East is key to success of Northern Powerhouse, conference hears Conference in Manchester also hears calls for Government to improve transport infrastructure in the North Share Northern Powerhouse conference at Manchester (Photo: Manchester Evening News) Share Get business   Thank you for subscribing!   \nDevolution to areas like the North East is crucial if the region is to fulfill the potential of the Northern Powerhouse, business and political leaders have said. \nSpeakers at the Northern Powerhouse conference in Manchester say the North needs to be fully involved in trade deals that follow Brexit, but also needs to have more control over its own affairs if it is to improve its economy. \nThe two-day conference - which faced criticism for having hardly any female speakers and a number of all-male panels - aims to highlight some of the issues facing the North’s economy, with discussions centred around transport, business investment, productivity and manufacturing. \nThe issue of devolution has also been raised by a number of speakers, among them Newcastle City Council chief executive Pat Ritchie. Pat Ritchie, chief executive of Newcastle City Council \nShe said: “The uncertainty we’ve all talked about today is very apparent and part of the answer to addressing this is being able to make decisions at local levels on local economies. If we can get closer to decisions around investment we can respond more quickly to questions and we can be more agile. \n“The North East is the only region with a positive balance of trade based on exports and 60% of that trade goes to the EU , so there is a big concern for us around the sort of uncertainties that have been described in relation to trade with Europe and beyond. \n“We need to think about our international relationships differently in the light of Brexit and we have to think about inward investment differently. Read More Lending fund launched for Northern businesses as economic uncertainty grows \n“The Northern Powerhouse is a very important brand which encompasses all of the places in the North, bringing together their economic strengths will increase our ability to trade with different parts of the world.” \nThe discussion of devolution comes as Newcastle , North Tyneside and Northumberland try to rescue a self-rule deal after the collapse of the wider North East negotiations. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now", "external_links": [], "published": "2017-02-22T00:02:00.000+02:00", "crawled": "2017-02-21T20:47:45.643+02:00", "highlightTitle": ""}