{"organizations": [], "uuid": "8f2f5d4d529d04f2f511d6b1896e2381ea7ea536", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article11054424.ece/ALTERNATES/s1200/JS73334597.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12644131", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast RECAP: £26m Metrocentre investment pledged by owners Intu Properties", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast RECAP: £26m Metrocentre investment pledged by owners Intu Properties", "spam_score": 0.0, "site_type": "news", "published": "2017-02-23T15:25:00.000+02:00", "replies_count": 0, "uuid": "8f2f5d4d529d04f2f511d6b1896e2381ea7ea536"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12644131", "ord_in_thread": 0, "title": "Business Breakfast RECAP: £26m Metrocentre investment pledged by owners Intu Properties", "locations": [], "entities": {"persons": [{"name": "pennycook", "sentiment": "none"}, {"name": "sheila armstrong", "sentiment": "none"}, {"name": "staley", "sentiment": "none"}, {"name": "philip hammond", "sentiment": "none"}, {"name": "cridland", "sentiment": "none"}, {"name": "fenwick", "sentiment": "none"}, {"name": "mark fenwick", "sentiment": "none"}, {"name": "jes staley", "sentiment": "none"}, {"name": "europe simon talling-smith", "sentiment": "none"}, {"name": "john cridland", "sentiment": "none"}, {"name": "iain conn", "sentiment": "none"}, {"name": "richard pennycook", "sentiment": "none"}, {"name": "armstrong", "sentiment": "none"}, {"name": "john mcfarlane", "sentiment": "none"}, {"name": "sanjeev gupta", "sentiment": "none"}, {"name": "simon kirby", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "mrs armstrong", "sentiment": "none"}, {"name": "david fischel", "sentiment": "none"}, {"name": "karen briggs", "sentiment": "none"}], "locations": [{"name": "cannes", "sentiment": "none"}, {"name": "shiftec", "sentiment": "none"}, {"name": "fenwick", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "luxembourg", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "ibiza", "sentiment": "none"}, {"name": "luton airport", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "nottingham", "sentiment": "none"}, {"name": "broadmarsh", "sentiment": "none"}, {"name": "gosforth", "sentiment": "none"}, {"name": "west avenue", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "north", "sentiment": "none"}, {"name": "blue room cafe", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "zurich", "sentiment": "none"}, {"name": "egypt", "sentiment": "none"}, {"name": "gosforth's townhouse", "sentiment": "none"}], "organizations": [{"name": "intu properties coreena ford", "sentiment": "negative"}, {"name": "townhouse hotel", "sentiment": "none"}, {"name": "uk financial investments", "sentiment": "none"}, {"name": "centrica", "sentiment": "none"}, {"name": "liberty house", "sentiment": "none"}, {"name": "liberty house group", "sentiment": "none"}, {"name": "shoppertrak", "sentiment": "none"}, {"name": "journal", "sentiment": "none"}, {"name": "british gas", "sentiment": "none"}, {"name": "barclays", "sentiment": "none"}, {"name": "intu properties", "sentiment": "none"}, {"name": "barclays uk", "sentiment": "none"}, {"name": "north", "sentiment": "none"}, {"name": "coreena ford", "sentiment": "none"}, {"name": "agm", "sentiment": "none"}, {"name": "cbi", "sentiment": "none"}, {"name": "lloyds banking group", "sentiment": "none"}, {"name": "barclays africa", "sentiment": "none"}, {"name": "leamington spa", "sentiment": "none"}, {"name": "coreena ford barclays", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "lloyds", "sentiment": "none"}, {"name": "kpmg", "sentiment": "none"}, {"name": "nickelodeon", "sentiment": "none"}, {"name": "coreena ford surf air", "sentiment": "none"}, {"name": "northern powerhouse", "sentiment": "none"}, {"name": "barclays international", "sentiment": "none"}, {"name": "coreena ford liberty house", "sentiment": "none"}, {"name": "coreena ford lloyds", "sentiment": "none"}, {"name": "surf air", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford One in three firms look to relocate amid Brexit uncertainty \nOne in three firms are looking to partially relocate some of their business overseas because of uncertainty caused by Brexit, a new study has revealed. Research by finance firm KPMG found that two thirds of companies had no plans to move, while two out of five were undeterred by the referendum vote and do not believe it will make it harder to recruit staff. \nA survey of more than 200 senior staff in manufacturing firms showed that most believed financial support from the Government was needed to help them increase investment in new technology. \nKaren Briggs, head of Brexit at KPMG, said: \nWhen our survey was carried out in January, two thirds of respondents expected uncertainty around Brexit. However Britain’s makers are an especially resolute group. \nAlthough some are concerned about exchange rates, labour pressures and higher indirect taxation, they are also taking a range of practical measures to prepare. \nThese include partial relocation, supply chain management, increased business development, and new sources of financing. \nUK manufacturers realise that Brexit will demand a burst of innovation from both the private and public sectors if the UK is really going to reach new global markets and deliver on its potential. 9.10 Coreena Ford Barclays 'months away' from completing overhaul \nBarclays boss Jes Staley said the bank is “just months away” from completing an overhaul as he unveiled a surge in annual profits. The lender said bottom-line group profits nearly trebled to £3.23 billion from £1.15 billion a year earlier, while it posted a 4% rise in underlying pre-tax profits to £6.4 billion for its core business - Barclays UK and Barclays International. \nMr Staley, who has been selling down and offloading unwanted businesses to focus on US and UK operations, said the group had “accomplished a lot in a year”. He added: “We are now just months away from completing the restructuring of Barclays, and I am more optimistic than ever for our prospects in 2017, and beyond.” \nProfits for the year were helped by a revenue boost from its investment banking operations, which saw income lift 6% to £10.5 billion thanks to buoyant bond trading and foreign exchange rates. \nIt also saw lower costs for payment protection insurance (PPI) compensation, at £1 billion in 2016 against £2.8 billion the previous year. \nThe group said it planned to close its so-called non-core bank on June 30, six months earlier than expected. Mr Staley has been leading a widespread restructuring for the past year, offloading businesses from France to Egypt and moving to sell off its 62% stake in Barclays Africa. Chairman John McFarlane said it was a “pivotal year” for the bank. \nIn its annual report published alongside the results, the bank revealed Mr Staley was awarded a £4.23 billion pay package for 2016. The bank’s total bonus pool edged down to £1.53 billion from £1.54 billion in 2015. Barclays bank Coreena Ford Liberty House to build £10m development centre \nManufacturing group Liberty House is to unveil plans to invest £10 million in its automotive business by building a new development centre. \nThe facility will open in 2018 in Leamington Spa and will house design and manufacturing of braking systems and Liberty’s new range of bicycles. \nThe company also announced it has acquired Daventry-based vehicle control systems business Shiftec. \nSanjeev Gupta, executive chairman of the Liberty House Group, said: “Britain has a vibrant vehicle manufacturing industry that made over 1.7 million cars and 93,000 commercial vehicles last year. \n“That provides a huge opportunity to grow our own domestic supply chain and provide UK auto producers with local alternatives to the flood of imported components currently used in British vehicles. \n“By creating this centre of excellence in our 25th anniversary year we’re signalling our intent to take a lead in the renaissance of the UK auto-components sector. This gives us a platform for growth and future job creation.” 9.05 Coreena Ford New cafe restaurant in Gosforth's Townhouse hotel opens as owner seeks second site \nA boutique Gosforth hotel is supporting the local economy and creating jobs with the opening a new cafe restaurant - and further developments to follow. \nOwner Sheila Armstrong says the creation of the Blue Room is the latest of a series of planned developments for The Townhouse, which include up to five new rooms. \nThe new Victoria-style cafe in the 10-bedroom hotel, in West Avenue, will create a handful of new jobs and has provided a boost to the local economy. \nMrs Armstrong said: “The Blue Room will see three new jobs initially created with a further two in the next 12 months. It has seen a further investment in local firms who undertook the £50,000 refurbishment. \n“I’m passionate about supporting local businesses, we’ve made sure to use small local businesses to undertake the refurbishment and supply produce to the hotel.” \nMs Armstrong took over the sole ownership of The Townhouse at the height of the credit crunch, investing over £300,000. \nShe said: “It was a bit of a gamble but it is now paying off. The initial conversion into a boutique hotel has proven to be a resounding success. \n“The new Blue Room Cafe is a luxurious Victorian style cafe which aims to add value to our existing offering by providing an unrivalled all-day dining experience.” Townhouse Hotel owner Sheila Armstrong in the Blue Room (Photo: Townhouse Hotel) 9.00 Coreena Ford Northern Powerhouse can boost living standards, Transport for the North leader says \nThe Northern Powerhouse can improve living standards for people in the North if the Government invests in the region’s infrastructure, the man tasked with improving transport in the North has said. \nTransport for the North chairman John Cridland, former head of the business group CBI, said people in the North were on average £5,000 worse off than their counterparts in the south. \nBut this could be changed by building on the region’s business strengths, he said, particularly if there was Government investment in road and rail links to better connect cities in the North. \nMr Cridland said the Brexit vote showed that people in the North were “looking for change”, particularly in their living standards. \nHis organisation recently published a report calling for the North to be better connected, by air and sea, with emerging markets around the world. \nBut he said the North’s strong ports and airports were being let down by the road and rail networks. Transport for the North chairman John Cridland (Photo: Dominic Lipinski/PA Wire) 8.55 Coreena Ford All change at Fenwick as chairman steps down to be replaced by former Co-op CEO \nLeading department store chain Fenwick will be driven forward by a non-family member for the first time in its 135-year history, after the current chairman announced he is stepping down. \nMark Fenwick has been executive chairman of Fenwick, which has its flagship store and headquarters in Newcastle, since May 2013 and a director since the 1990s and is the fifth generation of the family firm to lead the organisation. \nMr Fenwick will, however, step down at the firm’s AGM in May, paving the way for a new era at the business when he is replaced by former Co-op chief Richard Pennycook. \nThe Journal has previously told how Mr Pennycook is to join the board of the firm, which currently has 11 stores in its portfolio across the UK, fresh from his role at Co-op where he was heralded for transforming the leading grocer. \nMr Pennycook has now told of his delight at joining Fenwick as non-executive chairman – the first time the role has been filled by someone from outside the Fenwick family. Richard Pennycook is to become non-executive chairman of Fenwick (Photo: PA) 8.50 Coreena Ford Lloyds share sale cuts government holding to less than 4% \nThe Government has reduced its stake in Lloyds Banking Group to less than 4% as the lender moves a step closer to full private ownership. \nUK Financial Investments, which manages the stake in Lloyds, cut its holding by around 1%. \nIt means the taxpayer’s stake in the bank stands at 3.89%, with more than £19 billion being returned to Government coffers since the lender’s £20.3 billion bailout. \nIt is the latest in a series of share sales by the Government, which said in October it hoped to offload its remaining shares in Lloyds within a year. \nThe Government has progressively sold down its original 43% stake and Chancellor Philip Hammond ditched plans for a share sale to the public in October, opting instead to offload the holding to institutional investors. \nEconomic Secretary to the Treasury Simon Kirby said: “Since the decision to sell the Government’s stake in Lloyds we have now recovered over £19 billion for the taxpayer. \n“Lloyds’ strong annual results show that we are in a good position to continue to reduce our shareholding and recover all of the money the taxpayer injected into the bank during the financial crisis.” \nAll proceeds from the sale will be used to reduce the national debt. The Government has reduced its stake in Lloyds Banking Group to less than 4% 8.45 Coreena Ford Surf Air launches all-you-can-fly service \nSurf Air will ride the Brexit wave by launching unlimited flights from London as Britain’s bankers face relocation to rival financial hubs. \nThe US firm has opened its all-you-can-fly subscription service to customers in Britain and Europe for the first time, just months before flights take off from locations like London’s Luton Airport on May 1. \nMembers will pay an initial joining fee followed by £1,750 per month in exchange for unlimited flights between key hubs on eight-seat planes that will run multiple times per day. \nThe first European routes will run between cities including London, Zurich, Luxembourg and Cannes, with trips to Ibiza reserved for the weekends. \nThe launch comes at a sensitive time for airlines which are waiting with bated breath to discover whether the UK will remain a member of the EU’s Open Skies aviation free market after Brexit. \nBut Surf Air’s chief executive for Europe Simon Talling-Smith is optimistic that negotiations will be fruitful and said the company is actually set to benefit from Britain’s divorce from the EU. “We see an upside from Brexit,” he said. \n“I think there will be many people, for example in financial services, whose companies wish to relocate them to European capitals but they’re not ready to relocate their family out of London yet. Surf Air flights take off from locations like London's Luton Airport this year 8.39 Coreena Ford British Gas operating profits rise \nBritish Gas owner Centrica has fuelled further controversy over energy prices after reporting another profit rise at its British supply business. \nIt said operating profits at the energy and services arm covering the UK and Ireland rose by 2% to £906 million last year from £891m a year earlier, helping wider group operating profits at Centrica jump 4% to £1.5 billion. \nThe company is expected to face fresh calls to address tariffs for businesses and domestic consumers. \nThe industry has faced mounting pressure to treat loyal customers fairly and has been criticised for being slow to pass on falls in wholesale gas prices, with consumer groups hitting out at the size and timing of cuts. \nBritish Gas announced it was extending a price freeze on its standard energy tariff until August, “despite increases in external costs”, but customers are expecting prices to soar later this year, following the Brexit-induced collapse of the pound and rising wholesale energy prices. \nCentrica’s British Gas residential energy supply arm, which only covers UK homes, reported an 11% drop in operating profit to £553 million, compared with £623 million in 2015, but said the reduction was due in part to a customer exodus. \nMore than 409,000 UK home customers left the business in the year to December 31, marking a 3% fall to 14.25 million. \nBut the group said it stemmed the outflow in the second half of the year after launching new tariffs and improving customer service. \nGroup chief executive Iain Conn said: \n2016 was a year of robust performance and progress in implementing our customer-focused strategy. \nWe delivered our key objectives including improved customer service and more innovative offerings and solutions - while repositioning the portfolio, building capability and driving significant cost efficiencies. 8.30 KEY EVENT £26m investment to be made at intu Metrocentre \nThe owner of the region’s two premium shopping centres is to plough £26m into the intu Metrocentre complex as part of £262m earmarked for developments over the next three years. \nIntu Properties has said it will spend the the money on mall refurbishment and ‘right-sizing’ of units at the Gateshead centre, which has 316 stores. \nThe announcement is made in full year results for the year ended December 31 2016 for the firm, which owns 14 centres across the UK and Spain, which showed there was no adverse impact from Brexit, with intu shoppers still shopping and retailers still wanting to be in the firm’s prime, high footfall locations. \nThe year saw intu record a footfall rise of 1.3% compared to a fall of 2% in the national ShopperTrak retail average, and retailers opened four shops a week with intu last year, investing nearly £100 million in their units. \nIn all, the firm has a development pipeline of £655m, which includes a raft of activities, with new projects starting in 2017 including the intu Lakeside leisure extension anchored by Nickelodeon and the redevelopment of intu Broadmarsh in Nottingham. \nDavid Fischel, intu Chief Executive, said: “In a year which will be remembered for its political turbulence, intu is pleased to have recorded a strong set of results with six per cent growth in underlying earnings per share, an increased dividend and stable property values, leaving net assets per share (diluted, adjusted) unchanged at 404 pence. \n“We ended the year with £922 million of cash and available facilities, well placed to pursue our pipeline of active management projects, development and acquisition opportunities both in the UK and Spain. The power and recognition of the intu brand is our major differentiator. \n“With our focus on compelling customer experiences and family friendly fun day-out destinations, we are continuing to meet the demands of the changing retail world, recording increased footfall and 96% occupancy. \n“While the environment for business this year is likely to be challenging as the full impact emerges of the UK’s EU referendum vote, we are well positioned as we focus on top quality assets in prime locations with high occupancy and strong footfall.” The Qube at intu Metrocentre Share", "external_links": [], "published": "2017-02-23T15:25:00.000+02:00", "crawled": "2017-02-23T13:52:26.867+02:00", "highlightTitle": ""}