{"organizations": [], "uuid": "19675bc9421dba9d7728f9156b49bd069a07cbfe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12642719.ece/ALTERNATES/s1200/CBI-Annual-Conference.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/northern-powerhouse-can-boost-living-12642693", "country": "GB", "domain_rank": 21960, "title": "Northern Powerhouse can boost living standards, Transport for the North leader says", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Northern Powerhouse can boost living standards, Transport for the North leader says", "spam_score": 0.0, "site_type": "news", "published": "2017-02-22T23:53:00.000+02:00", "replies_count": 0, "uuid": "19675bc9421dba9d7728f9156b49bd069a07cbfe"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/northern-powerhouse-can-boost-living-12642693", "ord_in_thread": 0, "title": "Northern Powerhouse can boost living standards, Transport for the North leader says", "locations": [], "entities": {"persons": [{"name": "john cridland", "sentiment": "negative"}, {"name": "philip hammond", "sentiment": "none"}, {"name": "cridland", "sentiment": "none"}, {"name": "andrew percy", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "north", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "south east", "sentiment": "none"}], "organizations": [{"name": "northern powerhouse", "sentiment": "negative"}, {"name": "cbi", "sentiment": "none"}, {"name": "confederation of british industry", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "north", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Northern Powerhouse can boost living standards, Transport for the North leader says John Cridland, former head of the CBI says building on the region's business strengths can instigate change Share Director General of the CBI John Cridland addresses the annual conference of the CBI (Confederation of British Industry) (Photo: PA) Share Get business   \nThe Northern Powerhouse can improve living standards for people in the North if the Government invests in the region’s infrastructure, the man tasked with improving transport in the North has said. \nTransport for the North chairman John Cridland, former head of the business group CBI, said people in the North were on average £5,000 worse off than their counterparts in the south. \nBut this could be changed by building on the region’s business strengths, he said, particularly if there was Government investment in road and rail links to better connect cities in the North. \nMr Cridland said the Brexit vote showed that people in the North were “looking for change”, particularly in their living standards. \nHis organisation recently published a report calling for the North to be better connected, by air and sea, with emerging markets around the world. \nBut he said the North’s strong ports and airports were being let down by the road and rail networks. \nHe said: “It comes to the question of essential motorway and rail links we need. \n“The Northern Powerhouse is trying to restore to the North the vibrancy and dynamism we had in the 19th century. Read More Northern Powerhouse Minister vents irritation over devolution deal collapse \n“The Tyne did so much coal traffic that it led to the saying about not taking coals to Newcastle. But how many people know that today the Tyne is the biggest car exporter in Britain? There’s no reason why we can’t achieve these things. \n“Transport for the North is about improving connectivity. That will deliver more jobs, more investment and better living standards but it requires investment that starts on the ground.” \nMr Cridland’s comments will increase pressure on Chancellor Philip Hammond to increase transport spending in the North in his budget next month. Read More Devolution to North East is key to success of Northern Powerhouse, conference hears \nFigures published earlier this week showed the North East receiving only a tiny fraction of the amount spent on transport as London and the south east – a disparity Northern Powerhouse minister Andrew Percy admitted “needed to be taken into account in future allocation of funding from central Government.” Like us on Facebook", "external_links": [], "published": "2017-02-22T23:53:00.000+02:00", "crawled": "2017-02-22T19:32:45.621+02:00", "highlightTitle": ""}