{"organizations": [], "uuid": "3063245ac5f31a795470d807181542ed3feda8e9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12418682.ece/ALTERNATES/s1200/Britons-head-abroad-in-summer-getaway.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12539192", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: North East set for huge jobs boost amid Heathrow expansion consultation", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast LIVE: North East set for huge jobs boost amid Heathrow expansion consultation", "spam_score": 0.0, "site_type": "news", "published": "2017-02-02T15:00:00.000+02:00", "replies_count": 0, "uuid": "3063245ac5f31a795470d807181542ed3feda8e9"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12539192", "ord_in_thread": 0, "title": "Business Breakfast LIVE: North East set for huge jobs boost amid Heathrow expansion consultation", "locations": [], "entities": {"persons": [{"name": "mark thompson", "sentiment": "none"}, {"name": "ryan morris", "sentiment": "none"}, {"name": "mr gordon", "sentiment": "none"}, {"name": "matt boyle", "sentiment": "none"}, {"name": "jio", "sentiment": "none"}, {"name": "neil gordon", "sentiment": "none"}, {"name": "colao", "sentiment": "none"}, {"name": "vittorio colao", "sentiment": "none"}, {"name": "morris", "sentiment": "none"}, {"name": "mead johnson", "sentiment": "none"}, {"name": "coreena ford vodafone", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "aberdeen", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "states", "sentiment": "none"}, {"name": "india", "sentiment": "none"}, {"name": "team valley", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "sevon", "sentiment": "none"}, {"name": "subsea uk", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}], "organizations": [{"name": "coreena ford newcastle", "sentiment": "neutral"}, {"name": "ryder architecture", "sentiment": "neutral"}, {"name": "sevcon", "sentiment": "none"}, {"name": "vodafone", "sentiment": "none"}, {"name": "bayer", "sentiment": "none"}, {"name": "journal energy", "sentiment": "none"}, {"name": "coreena ford subsea", "sentiment": "none"}, {"name": "dettol", "sentiment": "none"}, {"name": "meson capital", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "ryder architecture coreena ford gateshead", "sentiment": "none"}, {"name": "reckitt", "sentiment": "none"}, {"name": "reckitt benckiser", "sentiment": "none"}, {"name": "merck", "sentiment": "none"}, {"name": "durex", "sentiment": "none"}, {"name": "liverpool", "sentiment": "none"}, {"name": "cillit bang", "sentiment": "none"}, {"name": "coreena ford durex", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford Newcastle's Ryder Architecture builds for future with 41% leap in profits \nDirectors at Ryder Architecture say they are cautiously confident of future growth despite the uncertainty caused by the Brexit vote . \nThe Newcastle architecture practice hailed another successful year in its latest accounts, which show pre-tax profits rose by 41% to £1.534m in the year ended April 30, 2016. \nTurnover grew by 3% to £11.138m and total costs, excluding consultants, increased by 9%, a figure the firm said was reflected in the turnover leap and its continued investment in its people, business development and international opportunities. \nHeadquartered in the North East, the company works across offices in Newcastle , London, Liverpool and Hong Kong and is commissioned to a range of projects worth anything from £50,000 to £300m in the civic, education, healthcare, manufacturing, office, residential, leisure, science and transport sectors. \nThe firm secured a number of notable contracts within the North East, including its work with online gaming operator tombola to design its new, striking headquarters in Sunderland, which is now under construction. \nManaging partner Mark Thompson said: \n“The directors are delighted with another successful year. \n“Brexit caused a hiatus but following a period of assessment across our diverse portfolio in sectors and geography, we are conservatively confident for sustained growth and development. We are excited by the opportunities for our clients and people as we look forward to 2017.” Mark Thompson, Ryder Architecture Coreena Ford Gateshead tech firm Sevcon battling American hedge fund trying to take control of its board \nA top North East firm has become embroiled in a bizarre battle in America with a hedge fund manager who wants to take control of its board. \nRyan Morris, a 32-year-old who runs a San Francisco-based investment group called Meson Capital, wants to join the board of Gateshead’s Sevcon with three of his colleagues with a view to affecting the company’s strategy. \nSevcon, which is listed on the US Nasdaq stock exchange, is fighting the moves, saying Mr Morris is a “disruptive director” and urging shareholders to back the existing board. \nThe battle will come to a head at a meeting next week, with Sevcon’s chief executive Matt Boyle having to spend the Christmas and New Year period in the States to deal with the takeover threat. \nIn documents lodged with the American authorities, Sevcon describe Mr Morris as a “disruptive and self-interested director” and says he is “making false and exaggerated claims about his contributions to our success”. \nFor his part, Mr Morris says he wants to accelerate the group’s growth and believes Sevon has challenges that it “is incapable of tackling today without improvements to the board”. \nSevcon, which is based on the Team Valley , makes components for low carbon vehicles and has benefited from the recent boom in electric cars. \nIn December the company recorded a £2m increase to its turnover, with sales reaching £27.4m. Last year saw it increasing headcount at Gateshead and its other sites and announcing a number of major contracts with big-name car manufacturers. \nMr Morris, who has a 14% shareholding in the company, was named executive chairman of Sevcon last July, only to be removed by the other board members four months later amid a number of disputes. Sevcon chief executive, Matt Boyle (Photo: handout) 8.50 Coreena Ford Subsea sector looking for brighter future after oil price slump hits industry \nVisitor numbers and exhibitors are down at this year’s Subsea Expo event in Aberdeen following a tough couple of years, which has decimated swathes of the UK offshore industry. \nIn June 2014 the UK subsea industry was riding the crease of a wave with almost 50% of a global market that was set to increase to £80bn by 2020. \nBut the oil price slump has sullied that ambition and industry chief Neil Gordon reckons total revenues from the UK industry have fallen by one-third from £8.9bn to around £6bn in the last two-and-half years. \nThis time last year Mr Gordon, Subsea UK’s chief executive, was predicting tough times ahead, telling Journal Energy 2016 would see ‘more pain’, and the year would be about ‘survival’. \nHowever, this week he is less pessimistic, saying: \nWe have witnessed large reductions in operations and expenditure and the industry has had to readjust. It has been severe and very painful with costs being cut across the board by at least 25% \nPeople are asking where is the bottom? But, I think it’s fair to say that many are now saying the bottom has been reached, and we are expecting to flatline for a while before we see a recovery. \nI think we have seen the bottom and it has been tough. The recovery will not be quick and the industry and supply chain will have to learn to live in this new $55 world. \nMany of the operators are not making cash and have not been making cash for some time and the supply chain still has to ask itself ‘is it still fit for the new norm?” \nThe Subsea Expo is Europe’s largest annual subsea event and is taking place at the Aberdeen Exhibition and Conference Centre. Neil Gordon, chief executive of Subsea UK (Photo: www.newsline-scotland.co.uk) 8.45 Coreena Ford Durex owner in talks to snap up US baby formula maker \nCillit Bang and Dettol firm Reckitt Benckiser has confirmed $16.7bn (£13.2 billion) talks to buy US baby formula maker Mead Johnson. \nThe UK household products giant said it was in advanced talks with Mead Johnson over a potential deal worth $90 a share. \nIt added they were “engaged in a period of due diligence and contract discussion”. \nThe deal would boost Reckitt’s US and Asia business and help it expand its health division. \nThe talks come after Reckitt lost out to rival Bayer in the tussle to snap up Merck’s consumer business in 2014. \nReckitt - whose brands also include Nurofen, Durex condoms and Harpic toilet cleaner - recently revealed a third quarter hit from its South Korean operation after a disinfectant scandal. \nThe group said in October it had started paying compensation from a £300m fund after admitting that a humidifier disinfectant produced by the company had killed 96 people in South Korea and caused illness for a further 400. \nIt said third quarter like-for-like revenues in developing markets rose 7% to £788m, but were pegged back by a sales drop in South Korea after consumers boycotted its products. \nReckitt has been on the hunt for a major acquisition for some time, but it stressed there was “no certainty” of a deal with Mead Johnson, which makes more than 70 nutritional products in over 50 markets worldwide. 8.40 Coreena Ford Vodafone set to hit lower end of earnings outlook \nMobile phone giant Vodafone has cautioned it will meet the lower end of its full-year earnings outlook as it faces mounting competition in the UK and India. The group reported a 3.2% drop in organic UK service revenues over its third quarter to December 31, with chief executive Vittorio Colao blaming “heightened price competition” in its business services division Enterprise. \nOn a reported basis, UK revenues plunged 19% to £1.7bn. \nRevenues also fell 1.9% in India, or 5.5% on a reported basis, as it has been hit by the launch of new rival Jio, which is offering customers free services. \nVodafone revealed on Monday that its Indian unit is in discussions over an all-share merger with Idea Cellular in a deal that would create India’s biggest telecoms firm. \nOverall group revenues were 3.9% lower in the final three months of 2016, with organic service revenues up 1.7% but down 3.2% on a reported basis. \nShares fell more than 2% as Vodafone said it expects to meet the lower end of its underlying earnings growth range of 3% to 6%. \nMr Colao said: \nIn the UK we have made good progress in improving customer service but face heightened price competition in Enterprise. \nWe anticipate intense competitive pressure in India in the fourth quarter and are taking a series of commercial actions, including the extension of 4G services to 17 leading circles. Vodafone (Photo: PA/PA Wire )", "external_links": [], "published": "2017-02-02T15:00:00.000+02:00", "crawled": "2017-02-02T11:01:33.488+02:00", "highlightTitle": ""}