{"organizations": [], "uuid": "89ad013d07f47d92d85ed55bc222766ebee2d833", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12577860.ece/ALTERNATES/s1200/Labour-Party-Conference-Day-One.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/see-wish-list-could-bring-12610298", "country": "GB", "domain_rank": 21960, "title": "See the wish list which could bring almost 8,000 jobs and £400m of investment to the North East", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "See the wish list which could bring almost 8,000 jobs and £400m of investment to the North East", "spam_score": 0.0, "site_type": "news", "published": "2017-02-16T12:00:00.000+02:00", "replies_count": 0, "uuid": "89ad013d07f47d92d85ed55bc222766ebee2d833"}, "author": "Dan O'Donoghue", "url": "http://www.chroniclelive.co.uk/news/north-east-news/see-wish-list-could-bring-12610298", "ord_in_thread": 0, "title": "See the wish list which could bring almost 8,000 jobs and £400m of investment to the North East", "locations": [], "entities": {"persons": [{"name": "nick forbes", "sentiment": "none"}, {"name": "tyne", "sentiment": "none"}, {"name": "chroniclelive", "sentiment": "none"}, {"name": "ross smith", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "north east pape", "sentiment": "none"}, {"name": "blyth estuary", "sentiment": "none"}, {"name": "north tyneside", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "south tyneside", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "tees valley", "sentiment": "none"}, {"name": "north east combined authority", "sentiment": "none"}], "organizations": [{"name": "north of tyne", "sentiment": "none"}, {"name": "getty images europe", "sentiment": "none"}, {"name": "north east chamber of commerce", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "holborn riverside development", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "whitehall", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "local government", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "See the wish list which could bring almost 8,000 jobs and £400m of investment to the North East Papers seen exclusively by ChronicleLive have revealed ambitious plans to bring jobs and investment to the region Share Nick Forbes (Photo: Getty Images Europe) Share   Thank you for subscribing!   \nPlans to bring thousands of jobs and almost half a billion pounds of investment to the North East have been drawn up and submitted to the Government, it can be revealed today. \nA project ‘wish list’, which could see 7,911 jobs created with £433m of investment, has been handed to Whitehall by three North East councils as part of a renewed devolution bid. \nThe list, seen exclusively by us, forms part of the North of Tyne devolution deal - which is currently being hammered out between council officials and the Department for Communities and Local Government. Read More \nIf the deal were to go ahead, then major investment would be poured into the technology, energy, tourism and business sectors across Newcastle, Northumberland and North Tyneside. \nSome of the stand out projects include: The East Pilgrim Street ‘Digital Quarter’ - 844 jobs with £49.1m investment The Holborn Riverside Development – 1,486 construction jobs and £32m investment Energy Central on the Blyth Estuary - 2,810 jobs and £20.84m investment Redevelopment of North Shields - 361 jobs and £58m investment \nNegotiations over a North of Tyne devolution deal have been taking place since late last year when a deal for the wider region fell through. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now Leaders complain about lack of Government funding for region Share this video Watch Next \nDisagreements over funding and the uncertainty caused by the Brexit vote led to the original deal being voted down by Gateshead, Sunderland and South Tyneside, while Durham abstained. \nRoss Smith, director of policy at the North East Chamber of Commerce , welcomed the promise of a new deal with jobs and investment for the region. \nHe said: “Chamber members have backed devolution because we believe it will lead to policies that are more suited to our economic needs and greater influence for the region on the national stage. \n“We would like to see all of the North East Combined Authority area covered by a devolution deal as Tees Valley is, and we will support the North of Tyne authorities in pursuing an ambitious step forward towards that.” Ross Smith, North East Chamber \nHe added: “Any deal will only work if maximum use is made of all relevant expertise, and we are already talking to these authorities to make sure businesses can make a strong, positive contribution to its success.” \nA Department for Communities and Local Government spokesman said: “When four local authorities chose to walk away from the previously agreed North East Devolution Deal last September, we made clear that we stood ready to work with those authorities that were committed to devolution. \n“Three of the councils – Newcastle, North Tyneside and Northumberland – have taken up the opportunity to explore revised proposals with the Government and we look forward to continuing these productive discussions.” \nA spokesperson for the North of Tyne authorities added: “Newcastle, North Tyneside and Northumberland are in ongoing positive discussions with Government about the devolution of powers and funding to the North East. \n“These discussions are focused on achieving accelerated business growth and economic development with more and better jobs for the North East; improving people’s skills and opportunities; and enhancing the vibrant places and strong communities in the region.” Like us on Facebook", "external_links": [], "published": "2017-02-16T12:00:00.000+02:00", "crawled": "2017-02-16T08:09:09.640+02:00", "highlightTitle": ""}