{"organizations": [], "uuid": "beb98b5eaeed98a23989acc2932c9ecb0b37afa6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12633108.ece/ALTERNATES/s1200/MKR_NEC_200217migrant_06.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/one-day-without-event-held-12633052", "country": "GB", "domain_rank": 21960, "title": "One Day Without Us event held at the Monument in Newcastle city centre", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "One Day Without Us event held at the Monument in Newcastle city centre", "spam_score": 0.0, "site_type": "news", "published": "2017-02-21T15:51:00.000+02:00", "replies_count": 0, "uuid": "beb98b5eaeed98a23989acc2932c9ecb0b37afa6"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/one-day-without-event-held-12633052", "ord_in_thread": 0, "title": "One Day Without Us event held at the Monument in Newcastle city centre", "locations": [], "entities": {"persons": [{"name": "ilona buchroth", "sentiment": "none"}, {"name": "newcastle  anke", "sentiment": "none"}, {"name": "mia neibig", "sentiment": "none"}, {"name": "anke neibig", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "heaton", "sentiment": "none"}, {"name": "mia", "sentiment": "none"}, {"name": "jo brossman", "sentiment": "none"}, {"name": "ilona", "sentiment": "none"}, {"name": "anke niebig", "sentiment": "none"}, {"name": "lena denecke", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "east germany", "sentiment": "none"}, {"name": "dresden", "sentiment": "none"}, {"name": "jesmond", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "saxony", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "new economics foundation", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "migration observatory", "sentiment": "none"}, {"name": "newcastle share", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "One Day Without Us event held at the Monument   Celebration of migrants contribution to the UK economy included many Europeans who have lived here for years Share Click to play Tap to play The video will start in 8 Cancel Play now One Day Without Us event held at the Monument in Newcastle Share this video   fears Brexit has caused to many Europeans who have lived and worked in the North East for decades was voiced during a demonstration in Newcastle on Monday . \nAround 60 people gathered at the city’s Monument joining tens of thousands nationwide taking part nationally in the ‘One Day Without Us’ event to celebrate the contribution of migrants to the UK. \nMany of those at the sharp end of the referendum result with the uncertainty over their post-Brexit status looming large voiced their dismay at being seen as a ‘bargain chip’ in negotiations. \nAmongst them were mum Anke Neibig, 53, originally from Germany and now living in Jesmond, and her daughter Mia aged 12. One Day Without Us event in Newcastle \nAnke said: “I’ve lived here over 20 years, I’ve paid my taxes and I think contributed to the wellbeing of the country and I think it’s scandalous my right to stay is being used as a bargaining tool.” \nAnd Mia added: “I’ve lived here all my life and I wouldn’t like it if my mum was kicked out of this country after all she’s done here.” \nThey were joined by friends Lena Denecke, 27, and Ilona Buchroth, 61. \nIlona, also originally from Germany, and now living in Newcastle said: “I’ve lived and worked here since I was 22. \n“I was expecting to retire and spend the rest of my life with my family here. \n“Whatever happens next, the best thing I can hope for is having permission to stay here and not the right. Left to right; Ilona Buchroth; Anke Niebig; Mia Neibig; and Lena Denecke \nHaving permission to stay is essentially different to having the right to stay and that is what upsets me greatly. \n“I will have a right to live in 27 European countries but not the one I actually do live in.” \nThe Monument event which was co-ordinated with those nationwide was the first day of action to highlight the contribution to the UK economy of migrants. \nA report today from the New Economics Foundation estimates that if every migrant withdrew their labour for one day, it would cost the UK £328m – 4% of the country’s GDP. Read More Nine of the best signs from Newcastle's Donald Trump protest \nMigrant workers in the UK make up 10.9% of the total workforce, but according to the Migration Observatory, that number increases dramatically in certain key sectors. Some 31% of cleaning and household staff, 30% of food preparation and hospitality workers, and 26% of health professionals are foreign-born. \nAt one o’clock, those supporting ‘One Day Without Us including those at the Monument linked arms in what organisers called ‘a gesture of solidarity and appreciation of migrants’. Read More Conservative MPs insist Donald Trump should come to the UK as MPs debate petition \nAmong them in Newcastle was Jo Brossman, 52, from Saxony near Dresden in what was then East Germany who has lived and works in Heaton for 19 years. \nShe said: “I’ve already lost one home to Unification (of Germany) and don’t want to lose a second home to the politics of a government that does not represent me.” Like us on Facebook", "external_links": [], "published": "2017-02-21T15:51:00.000+02:00", "crawled": "2017-02-21T11:33:53.473+02:00", "highlightTitle": ""}