{"organizations": [], "uuid": "a7b2f0b3face0d05303d4ee71e4940895f843e55", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12559684.ece/ALTERNATES/s1200/Untitled-design-4.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-shields-wooler-berwick-newbiggin-12558571", "country": "GB", "domain_rank": 21960, "title": "North Shields, Wooler, Berwick and Newbiggin to get UK twin towns", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "North Shields, Wooler, Berwick and Newbiggin to get UK twin towns", "spam_score": 0.0, "site_type": "news", "published": "2017-02-06T07:01:00.000+02:00", "replies_count": 0, "uuid": "a7b2f0b3face0d05303d4ee71e4940895f843e55"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/north-shields-wooler-berwick-newbiggin-12558571", "ord_in_thread": 0, "title": "North Shields, Wooler, Berwick and Newbiggin to get UK twin towns", "locations": [], "entities": {"persons": [{"name": "wooler", "sentiment": "negative"}, {"name": "gina wilson", "sentiment": "none"}, {"name": "broughshane", "sentiment": "none"}, {"name": "frank mansfield", "sentiment": "none"}, {"name": "david bavaird", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "newbiggin", "sentiment": "none"}, {"name": "berwick", "sentiment": "none"}, {"name": "goodwick", "sentiment": "none"}, {"name": "uk share north shields", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "yorkshire", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "newbiggin-by-the-sea", "sentiment": "none"}, {"name": "wales", "sentiment": "none"}, {"name": "withernsea", "sentiment": "none"}], "organizations": [{"name": "berwick", "sentiment": "negative"}, {"name": "wooler twin town", "sentiment": "none"}, {"name": "yorkshire", "sentiment": "none"}, {"name": "carnegie uk trust", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}, {"name": "merthyr tydfil", "sentiment": "none"}, {"name": "north shields chamber of trade & commerce", "sentiment": "none"}, {"name": "glendale gateway trust", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business North Shields, Wooler, Berwick and Newbiggin to get UK twin towns Four North East communities are part of scheme to revive town twinning with links to other parts of the UK Share North Shields has been given a Welsh twin, the Welsh Valleys community of Merthyr Tydfil (Photo: Newcastle Chronicle) Share Get business   Thank you for subscribing!   \nIt was a project that aimed to foster international fraternity, trade links across nations and trips abroad for eager schoolchildren. \nIn the aftermath of the Second World War , town twinning took hold as a means of bringing together former foes, with towns and cities around the North East forging links with communities in Europe and abroad. \nBut now an attempt has been launched to build bridges slightly closer to home to meet a new set of challenges for the 21st century. \nA series of town twinning partnerships between communities within the UK have been launched in a bid to boost domestic trade as the country gears up for Brexit. \nAnd the North East is at the head of the scheme, with four of the 10 partnerships involving towns from this region. \nThe link-ups being announced today will see Wooler in Northumberland form an alliance with Broughshane, in Northern Ireland, while nearby Berwick has been paired with Fishguard and Goodwick, in Wales. Wooler in Northumberland will form an alliance with Broughshane, in Northern Ireland (Photo: Newcastle Chronicle) \nNorth Shields has also been given a Welsh twin, the Welsh Valleys community of Merthyr Tydfil, while Newbiggin-by-the-Sea, in Northumberland, is paired with the seaside resort of Withernsea in the East Riding of Yorkshire. \nThe twinning arrangements follow a search for partnerships launched in October last year by the Carnegie UK Trust, a charity that aims to improve the lives of disadvantaged people throughout the UK. \nThe Carnegie scheme was inspired by the traditional concept of town twinning, which aimed to bring together like-minded people and break down barriers of nationality. \nThe UK link-ups hope to pair towns with similar characteristics or challenge to see how their different approaches to these challenges could make positive change in the future. \nOver the coming 18 months, the towns in the partnerships will build their ties, do research on their economies and receive support to get funds for regeneration projects. Berwick has been paired with Fishguard and Goodwick, in Wales (Photo: Newcastle Chronicle) \nGina Wilson, development manager at the Carnegie UK Trust, said: “Twin Towns is aimed at encouraging towns to make a positive impact locally, especially at a time when devolution of power to cities and regions is becoming more prevalent. \n“In fostering new relationships with partners that towns might not have considered before, it will provide a new perspective and hopefully new solutions to real and current issues. Whilst we don’t expect the towns’ concerns to be resolved overnight, we hope that the new partnerships will be the start of something positive.” \nThe Wooler Twin Town partnership is being led by the Glendale Gateway Trust, whose chair Frank Mansfield said: “If this scheme simply allows us to steal some of Broughshane’s best ideas it will be worth it. \n“But there’s a real possibility it could make a significant difference to our community too. It’s always worth taking the time to look at how other successful organisations do things.” Newbiggin-by-the-Sea is paired with the seaside resort of Withernsea in the East Riding of Yorkshire (Photo: @TarkId=1323116) \nDavid Bavaird, chair of the North Shields Chamber of Trade & Commerce, which is leading its link-up with Merthyr Tydfil, said: “The Chamber is excited to have been selected as a part of the Twin Towns project and we look forward to working with Merthyr Tydfil representatives to develop plans. \n“We hope this will help to stimulate economic activity and make our towns more attractive for business, residents and visitors.” Like us on Facebook", "external_links": [], "published": "2017-02-06T07:01:00.000+02:00", "crawled": "2017-02-06T03:08:51.597+02:00", "highlightTitle": ""}