{"organizations": [], "uuid": "41c72db2a42fd8028528d3194b2fa20dd619ac02", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12601274.ece/ALTERNATES/s1200/Inflation-figures.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/rising-fuel-prices-push-inflation-12601255", "country": "GB", "domain_rank": 21960, "title": "Rising fuel prices push inflation to highest rate since 2014", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Rising fuel prices push inflation to highest rate since 2014", "spam_score": 0.0, "site_type": "news", "published": "2017-02-14T18:09:00.000+02:00", "replies_count": 0, "uuid": "41c72db2a42fd8028528d3194b2fa20dd619ac02"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/rising-fuel-prices-push-inflation-12601255", "ord_in_thread": 0, "title": "Rising fuel prices push inflation to highest rate since 2014", "locations": [], "entities": {"persons": [{"name": "mike prestwood", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "office for national statistics", "sentiment": "none"}, {"name": "ons", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "invalid email  inflation", "sentiment": "none"}, {"name": "ubs", "sentiment": "none"}, {"name": "bank of england", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Rising fuel prices push inflation to highest rate since 2014 Inflation has risen to 1.8% while costs for manufacturers grew by more than 20% because of the weak pound Share A car being filled up at a petrol station (Photo: Yui Mok/PA Wire) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nInflation reached a two-and-a-half-year high in January as rising fuel prices bumped up the cost of living. \nThe Office for National Statistics (ONS) said the Consumer Price Index (CPI) measure of inflation hit 1.8% last month, up from 1.6% in December, marking its highest level since June 2014. \nHowever, the move came in shy of the Bank of England’s 2% target and economists’ expectations of 1.9%. \nSeparate figures for the Producer Price Index (PPI) showed that input prices - the amount paid for materials and fuel by UK manufacturers - saw its highest rate of growth since September 2008, rising 20.5% in January. \nSterling’s slump against the US dollar and the euro since the EU referendum result, coupled with rising oil prices, also caused import prices to leap 20.2% over the period, the ONS said. \nBallooning import prices triggered by the Brexit-hit pound are expected to push up everyday prices as companies pass on their soaring costs to consumers. \nONS head of inflation Mike Prestwood said “The latest rise in CPI was mainly due to rising petrol and diesel prices, along with a significant slowdown in the fall in food prices. Read More UK set for low growth but strong export market could benefit North East, says think tank \n“The costs of raw materials and goods leaving factories both rose significantly, mainly thanks to higher oil prices and the weakened pound.” \nThe main driver behind the jump in CPI came from transport prices, which dropped by less than they did a year ago, falling by 0.6% between December and January, compared with 2.5% a year before. \nFuel prices climbed 3.4% over the period after dropping by 2.6% a year earlier, as the resurgent cost of Brent crude fed its way through to prices at the pumps. \nThe price of petrol rose to 118.6p per litre in January, up from 114.6p per litre the month before, while diesel reached 121.9p per litre last month, up from 118p per litre in December. \nOverall food prices were flat between December and January after falling 0.6% a year ago, as the sharp drop in grocery costs - triggered by the supermarket price war - ground to a halt. Read More Households will be poorer in 2017 but North East businesses may thrive, says UBS \nThe ONS said a rise in the cost of imported foods caused by the Brexit-hit pound may have been a factor in the significant slowdown in the fall of food prices. \n“Following a sustained period of deflation of food prices since mid-2014, during which the 12-month rate was often lower than negative 3%, the rate has increased for four consecutive months, reaching negative 0.4% in January,” the ONS added. \n“This is the highest it’s been since June 2014.” Like us on Facebook", "external_links": [], "published": "2017-02-14T18:09:00.000+02:00", "crawled": "2017-02-14T13:35:15.997+02:00", "highlightTitle": ""}