{"organizations": [], "uuid": "2c5eb543eb63f27ee1fcc9fa550ded03d61f111b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12654894.ece/ALTERNATES/s1200/book-fest.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/whats-on/arts-culture-news/joanna-trollope-frank-gardner-denise-12653367", "country": "GB", "domain_rank": 21960, "title": "Joanna Trollope, Frank Gardner and Denise Welch among Hexham Book Festival attractions", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Joanna Trollope, Frank Gardner and Denise Welch among Hexham Book Festival attractions", "spam_score": 0.0, "site_type": "news", "published": "2017-02-25T00:52:00.000+02:00", "replies_count": 0, "uuid": "2c5eb543eb63f27ee1fcc9fa550ded03d61f111b"}, "author": "David Whetstone", "url": "http://www.chroniclelive.co.uk/whats-on/arts-culture-news/joanna-trollope-frank-gardner-denise-12653367", "ord_in_thread": 0, "title": "Joanna Trollope, Frank Gardner and Denise Welch among Hexham Book Festival attractions", "locations": [], "entities": {"persons": [{"name": "frank gardner", "sentiment": "neutral"}, {"name": "joanna trollope", "sentiment": "neutral"}, {"name": "denise welch", "sentiment": "neutral"}, {"name": "paul morley", "sentiment": "none"}, {"name": "jane austen", "sentiment": "none"}, {"name": "emily watson", "sentiment": "none"}, {"name": "gary younge", "sentiment": "none"}, {"name": "claudette wells", "sentiment": "none"}, {"name": "maggie o’farrell", "sentiment": "none"}, {"name": "susie troup", "sentiment": "none"}, {"name": "neil astley", "sentiment": "none"}, {"name": "bowie", "sentiment": "none"}, {"name": "vaseem khan", "sentiment": "none"}, {"name": "pamela robertson-pearce", "sentiment": "none"}, {"name": "luke carlton", "sentiment": "none"}, {"name": "masterchef", "sentiment": "none"}, {"name": "lemn sissay", "sentiment": "none"}, {"name": "arthur smith", "sentiment": "none"}, {"name": "margaret hodge", "sentiment": "none"}, {"name": "jordan bourke", "sentiment": "none"}, {"name": "polly toynbee", "sentiment": "none"}, {"name": "harper clarke", "sentiment": "none"}, {"name": "tim brooke-taylor", "sentiment": "none"}, {"name": "david walker", "sentiment": "none"}, {"name": "joan ruddock", "sentiment": "none"}, {"name": "louise doughty", "sentiment": "none"}, {"name": "thomasina miers", "sentiment": "none"}, {"name": "david bowie", "sentiment": "none"}], "locations": [{"name": "tyne valley", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "south america", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "indonesia", "sentiment": "none"}, {"name": "hexham", "sentiment": "none"}, {"name": "queen’s hall arts centre", "sentiment": "none"}], "organizations": [{"name": "apple tree yard", "sentiment": "none"}, {"name": "baby ganesh detective agency", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "city of friends", "sentiment": "none"}, {"name": "bbc", "sentiment": "none"}, {"name": "british intelligence", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "bloodaxe books", "sentiment": "none"}, {"name": "hexham", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "What's On Joanna Trollope, Frank Gardner and Denise Welch among Hexham Book Festival attractions The full line-up of festival attractions has been announced with writers of fiction, non-fiction and poetry due at the Queen's Hall Share Joanna Trollope, Frank Gardner and Denise Welch Share Get what's on   Thank you for subscribing!   \nBig names in fiction, non-fiction and poetry will be heading to the Tyne Valley for the annual Hexham Book Festival with novelist Joanna Trollope leading the charge. \nThe author of such titles as The Choir and A Spanish Lover has a new one out, City of Friends, which she will talk about next weekend in a forerunner to the main festival which starts in April. \nThe festival line-up, just announced, embraces comedy and tragedy and all things in between. \nComedians Arthur Smith and Tim Brooke-Taylor will be Hexham-bound , as will music writer Paul Morley, author of The Age of Bowie, who will pay tribute to the late David Bowie. \nFrank Gardner, the BBC’s widely travelled security correspondent, will talk about his debut novel, Crisis, a thriller focusing on Luke Carlton, an ex-Special Boat Service commando now working for British Intelligence in South America. Tim Brooke-Taylor (Photo: liv.chapman@hotmail.com) \nThe festival never fights shy of politics and this year presents two women whose names have long been synonymous with political discourse. \nDame Joan Ruddock, the one-time chair of CND and former Labour MP and minister, will talk about her memoir, Going Nowhere. \nMeanwhile Dame Margaret Hodge, who chaired the House of Commons public accounts committee from 2010-15, will discuss her book, Called To Account. \nGuardian columnists Polly Toynbee and David Walker, who have co-authored books and are also married, will discuss their latest, Dismembered, looking at how our public services might fare in a post-Brexit world. \nAnother celebrated Guardian writer, Gary Younge, will give a talk called Another Day in the Death of America, looking at the country’s gun culture which claims the lives of seven children and teenagers every day. \nA special ticket will buy lunch and entry to events hosted by Thomasina Miers, Masterchef winner in 2005, and healthy eating expert Jordan Bourke. \nThen a special Bollywood night will feature Vaseem Khan, author of the Baby Ganesh Detective Agency novels, and a screening of Bride & Prejudice, a Bollywood spin on Jane Austen. Louise Doughty (Photo: liv.chapman@hotmail.com) \nFollowing Joanna Trollope’s special festival launch appearance on Saturday, March 4, at the Queen’s Hall Arts Centre, Hexham, there will be plenty for fiction-lovers to get their teeth into. \nLouise Doughty, whose thriller Apple Tree Yard has been a recent BBC hit starring Emily Watson, will talk about Black Water, her new psychological thriller set in Indonesia. \nMaggie O’Farrell, who won the Costa novel award in 2010, will discuss This Must Be the Place, introducing Claudette Wells, a reclusive ex-film star living in a remote spot in Ireland. \nA first-time novelist with a big following also takes her place in the line-up, returning to her native North East. \nActress Denise Welch will talk at the Queen’s Hall on April 29 about her debut work of fiction, If They Could See Me Now, telling of outwardly successful but inwardly messed up Harper Clarke. \nHexham-based poetry publisher Bloodaxe Books will be represented by founding editor Neil Astley who will be joined by film-maker Pamela Robertson-Pearce for In Person: World Poets. \nThey will present a film featuring some of the major poets they have filmed reading from their work as part of a growing DVD poetry anthology. \nPopular poet Lemn Sissay, who wrote his first poetry book at the age of 17, will read from his latest collection, Gold from the Stone. \nSusie Troup, founding director of Hexham Book Festival, said: “In these fast-changing and unsteady times, I hope that this year’s festival will provide visitors with a moment to sit back, relax and listen.” \nShe added: “I’m thrilled to be launching our programme with such a legendary novelist as Joanna Trollope and I hope an early celebration will get people in the mood to plan their spring visit to Hexham to take advantage of a feast of literary treats.” \nTickets for the festival, which runs from April 28 to May 7, are on sale now. Details at www.hexhambookfestival.co.uk or tel. 01434 652477. Like us on Facebook", "external_links": [], "published": "2017-02-25T00:52:00.000+02:00", "crawled": "2017-02-24T20:10:28.115+02:00", "highlightTitle": ""}