{"organizations": [], "uuid": "b21a8015d84d2a0d1304e2329fa159a8f154557f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12568157.ece/ALTERNATES/s1200/IRR_NEC_070217veg_01.jpg", "site_section": "", "section_title": "", "url": "http://www.chroniclelive.co.uk/news/north-east-news/big-vegetable-shortage-should-really-12568126", "country": "IE", "domain_rank": 21960, "title": "The big vegetable shortage: Should we really be worried about the lack of veg in our supermarkets? - Chronicle Live", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 0, "title_full": "The big vegetable shortage: Should we really be worried about the lack of veg in our supermarkets? - Chronicle Live", "spam_score": 0.034, "site_type": "news", "published": "2017-02-07T18:56:00.000+02:00", "replies_count": 0, "uuid": "b21a8015d84d2a0d1304e2329fa159a8f154557f"}, "author": "Ian Robson", "url": "http://www.chroniclelive.co.uk/news/north-east-news/big-vegetable-shortage-should-really-12568126", "ord_in_thread": 0, "title": "The big vegetable shortage: Should we really be worried about the lack of veg in our supermarkets? - Chronicle Live", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Bad weather in southern Europe has affected supplies of fresh vegetables Share Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nA shortage of veg is continuing to hit supermarket shelves across the North East . \nPrices are rocketing as families struggle to find produce that was once easily and cheaply available. \nWe look at what’s going on and how long it will go on for. Why are supermarket shelves empty? \nIt’s mostly to do with bad weather in southern Europe where we buy a lot of our fresh produce. \nStorms have wrecked the harvest meaning there is less veg to go around. \nAnd the law of supply and demand says that shortages always result in price hikes. \nShoppers have to find more money to buy less. \nDifficulties began last month with heavy rain and freezing temperatures in Spain hitting courgette and spinach supplies. \nFarmers there, who provide half of Europe’s salad requirements, have lost up to 60% of their crops. What vegetables are affected? \nCourgettes have gone up by 140%, broccoli by 122%, and lettuce by 63%. \nAnd more veg including tomatoes, cucumbers, cauliflower, peppers, rocket and baby spinach will also be hit following heavy snow and floods in growing regions. \nBasically, all veg imported from southern Europe. Supermarkets are starting to introduce rationing of some produce How have supermarkets responded? \nAt least three supermarkets – Asda , Tesco and Morrisons – are rationing fresh produce while looking for alternative suppliers in the US and north Africa. \nMorrisons imposed a limit of two lettuces and three broccoli heads per visit. \nTesco is allowing three icebergs while the Co-op has signs warning of shortages . \nExperts say the crisis is not likely to get sorted out soon with April suggested as the month when things start getting back to normal. \nAnd let’s not forget fast food outfits like McDonald’s. \nThey said: “Extreme and continued weather conditions in the Mediterranean has led to a shortage of certain lettuce varieties. \n“Working closely with our supplier partners, we have managed to minimise the impact to our customers.” Read More When can supermarkets refuse to serve their customers alcohol? Are there any other causes apart from the storms? \nYes. There was a poor harvest in any case and the storms and floods, especially in southern Spain, have not helped. \nAnd, inevitably, some blame Brexit. They claim the exchange rate has worsened what was already a crisis. \nPaul Connolly, of food buying company Beacon, said: “The perfect price storm is likely to last well into 2017 and affect other favourite food and drinks as Brexit starts to bite.” Shoppers are seeing shortages of produce that was once easily available Is there any way I can beat the shortages? \nYou can always buy tinned veg, \nIt still has the same nutritional value and prices are not, yet, affected by the poor harvest. \nSo it’s worth considering even if you’re used to buying fresh. \nIn the longer-term there have been calls for less reliance on imported vegetables. \nListen to what TV garden legend Alan Titchmarsh, 67, has to say about changing our eating habits. \n“It’s imported produce that is the problem,” he said. Read More \n“Instead of having courgettes and out of season veg from overseas at this time of year, support the British growers and go on to root vegetables, sprouts, greens, that kind of thing, stuff that’s British.” Time to dig for victory, then? \nIt’s hardly the same of the vegetable shortages in World War Two, but there have been calls for more grow-your-own. \nWith lettuce, for example, it’s easy enough to plant from seeds in a sunny weed-free part of the garden. \nIt can be fun, and satisfying, but most of us don’t have the patience. \nFor lettuce you can plant in March but the crop will not be ready to eat until June. Like us on Facebook ", "external_links": [], "published": "2017-02-07T18:56:00.000+02:00", "crawled": "2017-02-08T04:25:40.713+02:00", "highlightTitle": ""}