{"organizations": [], "uuid": "d99a212ad7e2157da91897a331aec7ea79a0ae0a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12649455.ece/ALTERNATES/s1200/John-Lewis-results.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/john-lewis-axe-400-jobs-12649327", "country": "GB", "domain_rank": 21960, "title": "John Lewis to axe 400 jobs as it grapples with pressures facing retail sector", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "John Lewis to axe 400 jobs as it grapples with pressures facing retail sector", "spam_score": 0.0, "site_type": "news", "published": "2017-02-24T01:27:00.000+02:00", "replies_count": 0, "uuid": "d99a212ad7e2157da91897a331aec7ea79a0ae0a"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/john-lewis-axe-400-jobs-12649327", "ord_in_thread": 0, "title": "John Lewis to axe 400 jobs as it grapples with pressures facing retail sector", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Business John Lewis to axe 400 jobs as it grapples with pressures facing retail sector Job losses in restaurants and home sittings service will affect staff at a majority of the firm's stores Share John Lewis in Oxford Street, London (Photo: PA) Share Get business   Thank you for subscribing! Could not subscribe, try again later Invalid Email \nJohn Lewis is axing nearly 400 jobs across its restaurants and home fittings service as it grapples with the acute pressures facing the retail sector. \nThe department store chain said 387 jobs would be lost as it shifts home fittings administration roles to a central hub in Manchester and outsources food preparation for its ‘The Place to Eat’ restaurants. \nAround 773 staff have now entered redundancy consultation and been given the opportunity to apply for 386 new roles. \nIt comes after the high street bellwether said last month that it expects its renowned staff bonus to be “significantly lower” than last year in the face of a challenging market outlook. \nDino Rocos, John Lewis operations director, said the move would adapt the business to the changing needs of customers amid “a backdrop of structural changes in the retail industry”. \n“Our Partners are passionate about offering the very best customer service and these proposals will allow us to modernise our business as it adapts to the changing needs of our customers and the role that shops play in their lives,” he said. \n“We understand that for some this will mean a period of change, and we are working with affected partners over the consultation period to give opportunities for redeployment in new roles wherever possible.” \nThe high street bellwether said the changes would impact 32 of its 48 stores across the country, with the consultation on jobs expecting to last a few months. \nThe decision to transfer administration roles to a central office in Didsbury, Manchester, comes as the firm moves to a regional model for its home fittings department. Read More £26m investment at Metrocentre pledged by owners Intu Properties \nHowever, the changes will not impact fitters and estimators, which measure up curtains, blinds, and floor covering for customers. \nOn catering, the company said it was extending a model it was already using in a third of it shops, where customers can choose from a centrally-created menu that needs less preparation within the stores. \nIt said it would allow the firm to change its menu more regularly and be more adept at meeting customers’ dietary requirements. \nThe news comes at a difficult time for retailers as they brace for rising inflation, a dip in consumer confidence and soaring costs linked to the Brexit-hit pound. \nRetail sales unexpectedly fell in January as shoppers were squeezed by a jump in food and fuel prices, according to official figures. \nTo pile on the misery, an expected rise in business rates is also expected to hit the sector hard, although Communities Secretary Sajid Javid has signalled he may soften the blow. \nSir Charlie Mayfield, chairman of the John Lewis Partnership , warned in January that profits are under pressure and that the retailer is bracing for a period of significant change. \nIt follows a warning last year by former John Lewis managing director Andy Street that sterling’s plunge could become a problem for the firm. \nHe said that although the firm is “fully hedged” against currency fluctuations in the short term, but it could be an issue in 2017. Like us on Facebook", "external_links": [], "published": "2017-02-24T01:27:00.000+02:00", "crawled": "2017-02-23T21:00:45.583+02:00", "highlightTitle": ""}