{"organizations": [], "uuid": "9aa623d6bd2af489fa0938589a80c6d285832fa1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/30115233/15841264.jpg", "site_section": "http://www.thisisleicestershire.co.uk/generalelection2010/rss.html?chid=182803", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/leicester-comedy-festival-is-just-one-reason-stand-up-stalwart-stewart-lee-loves-our-city/story-30115233-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "Becky_Jones1 published Leicester Comedy Festival is just one reason stand-up stalwart...", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "Becky_Jones1 published Leicester Comedy Festival is just one reason stand-up stalwart...", "spam_score": 0.0, "site_type": "news", "published": "2017-02-08T19:00:00.000+02:00", "replies_count": 0, "uuid": "9aa623d6bd2af489fa0938589a80c6d285832fa1"}, "author": "Becky_Jones1", "url": "http://www.leicestermercury.co.uk/leicester-comedy-festival-is-just-one-reason-stand-up-stalwart-stewart-lee-loves-our-city/story-30115233-detail/story.html", "ord_in_thread": 0, "title": "Becky_Jones1 published Leicester Comedy Festival is just one reason stand-up stalwart...", "locations": [], "entities": {"persons": [{"name": "stewart lee", "sentiment": "negative"}, {"name": "jerry springer", "sentiment": "none"}, {"name": "bridget christie", "sentiment": "none"}, {"name": "lee", "sentiment": "none"}, {"name": "faber", "sentiment": "none"}, {"name": "daniel lambert", "sentiment": "none"}, {"name": "lenny bruce", "sentiment": "none"}, {"name": "noh", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "leicester mercury", "sentiment": "none"}, {"name": "de montfort hall", "sentiment": "none"}], "organizations": [{"name": "bbc", "sentiment": "none"}, {"name": "edl", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "leicester comedy festival", "sentiment": "none"}, {"name": "times", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Leicester Comedy Festival is just one reason stand-up stalwart Stewart Lee loves our city By Becky_Jones1 | Posted: February 08, 2017 0 COMMENTS SHARES Stewart Lee is bringing his 'Content Provider' show to De Montfort Hall tonight Leicester Comedy Festival is just one reason stand-up stalwart Stewart Lee loves... X \nCopy link to paste in your message / \nIt's rare that anyone should appear in the Leicester Mercury newspaper twice on one day - but Stewart Lee achieved such a feat 11 years ago. \nOn Tuesday, February 14, 2006, the comedian was pictured in two very different articles. \nThe first was a lovey-dovey Valentine's Day piece. Lee was photographed with his girlfriend (now wife) fellow comedian Bridget Christie, who he met at a Leicester Comedy Festival party in 2005. \nThe other was as a \"face of hatred\" as he describes it. Controversial musical Jerry Springer: The Opera, of which Lee was the co-author, was hitting the news at the time. Protestors claimed it was blasphemous, but Lee defended artists' rights to freedom of expression. \nIt's fair to say that he's still a little annoyed at the \"religious bigots\" he encountered, but we're happy to report that the comedian is a big fan of Leicester. \n\"I love the food, I love the pubs, I love the two brothers who run Krautrock specialist mail order service Ultima Thule,\" he enthuses. \n\"I like 80s indie band Yeah Yeah Noh and 70s rockers Family, I love the art gallery, I love the painting of Daniel Lambert, Leicester's legendary fat man. \n\"I like the fact that multiculturalism has worked in Leicester, despite EDL agitating.\" \nIt's no surprise that Lee - who has been doing stand-up for 28 years - also loves the Leicester Comedy Festival. Not least because it led to him meeting his wife. \n\"It's a really great spread of different types of comedy. There's mainstream acts that will attract the crowds whose numbers help to offset the risk of taking chances on more worthwhile, less well know acts. It's a good juggling act,\" says the comedian, who is bringing his latest show, Content Provider, to De Montfort Hall tonight. \nAccording to Lee, the live show is very different to his BBC Two series Comedy Vehicle, which came to an end last year after four multi award-winning series. \n\"Comedy Vehicle was four series of six, 30 minute, self-contained sets. This is one two hour through line, although I've had to keep the ideas and structure a little less rigid than usual to cope with the sudden surges in news events. \n\"There is also an apparently meaningless set which is actually very subtle and cleverly linked to the themes of the show in a way which becomes clear over the evening. It is made entirely from the second hand dvds of other stand-up comedians, none of which I paid more than 10p for. \n\"Other comedians' dvds are currently the cheapest building material in the world.\" \nHe adds that this show is \"less shocking\" than his usual offerings. But why? \n\"I think my core audience is having a bad time at the moment – they are the sort of people who will be depressed about Brexit and Trump – so I feel it's time to cheer them up, not engage in terrifyingly dark black comedy. \n\"The world is bad enough,\" says Lee, who was once referred to by The Times as ' the comedian's comedian' - although it's a title he doesn't agree with. \n\"Most of the younger comedians seem to hate me, I think, and because I'm not really on the club circuit any more, and do my shows in theatres, I'm not part of any community and none of the new ones know or see my stuff anyway which is good I suppose, because if they did they would give up.\" \nSo, thinking more positively, what does the future hold for this stand-up stalwart? \n\"Well I'm touring this Content Provider show until 2018. I'm supposed to be making a folk rock album with the group Trembling Bells at some point. \n\"I wrote a comedy drama about Brexit in September that is currently with a production company trying to find someone who'll pay to make it.\" \n\"I'll write another book for Faber, this one about doing stand-up on TV,\" says Lee, who's certainly got a busy couple of years ahead. He does, however, concede that he needs to slow down a bit. \n\"I have no life and no friends. I don't do enough with the kids. After the tour ends in the Summer of 2018 I'll lie on the sofa for a bit and watch '60s Italian westerns. \n\"They're all I've watched for the last few years really. I've seen nearly 200. I like them because the directors and writers tried to slip weird and interesting and political things into them under cover of the movies being genre. \n\"I suppose that's what I try to do with stand-up. At the end of the day it's still just comedy, but maybe you can make it meet something better half way.\" \nHere's 20 of Stewart Lee's favourite comedians: \nLenny Bruce", "external_links": [], "published": "2017-02-08T19:00:00.000+02:00", "crawled": "2017-02-08T15:18:44.301+02:00", "highlightTitle": ""}