{"organizations": [], "uuid": "057b68180460de94006a43d9c713ef7b6eff3882", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article10969625.ece/ALTERNATES/s1200/JS76349790.jpg", "site_section": "http://www.thejournal.co.uk/business/?service=rss", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12665120", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast RECAP: Greggs serves up 7% full year sales rise, plus Virgin Money and Go-Ahead Group latest", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast RECAP: Greggs serves up 7% full year sales rise, plus Virgin Money and Go-Ahead Group latest", "spam_score": 0.0, "site_type": "news", "published": "2017-02-28T15:00:00.000+02:00", "replies_count": 0, "uuid": "057b68180460de94006a43d9c713ef7b6eff3882"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12665120", "ord_in_thread": 0, "title": "Business Breakfast RECAP: Greggs serves up 7% full year sales rise, plus Virgin Money and Go-Ahead Group latest", "locations": [], "entities": {"persons": [{"name": "greggs", "sentiment": "negative"}, {"name": "hands", "sentiment": "none"}, {"name": "shapiro", "sentiment": "none"}, {"name": "miles celic", "sentiment": "none"}, {"name": "regeneris", "sentiment": "none"}, {"name": "chris day", "sentiment": "none"}, {"name": "gary shapiro", "sentiment": "none"}, {"name": "brown", "sentiment": "none"}, {"name": "chris day coreena ford", "sentiment": "none"}, {"name": "jayne-anne gadhia", "sentiment": "none"}, {"name": "baroness mcgregor-smith", "sentiment": "none"}, {"name": "joe giddens/pa wire", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "peter briggs", "sentiment": "none"}, {"name": "coreena ford", "sentiment": "none"}, {"name": "giles rhys jones", "sentiment": "none"}, {"name": "virgin red", "sentiment": "none"}, {"name": "tao", "sentiment": "none"}, {"name": "roger whiteside", "sentiment": "none"}, {"name": "briggs", "sentiment": "none"}, {"name": "guy bell", "sentiment": "none"}, {"name": "margot james", "sentiment": "none"}, {"name": "david brown", "sentiment": "none"}, {"name": "sharon white", "sentiment": "none"}, {"name": "chris wilkinson", "sentiment": "none"}, {"name": "greg hands", "sentiment": "none"}, {"name": "mrs gadhia", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "bt", "sentiment": "none"}, {"name": "belfast", "sentiment": "none"}, {"name": "coeliac uk", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "barcelona", "sentiment": "none"}, {"name": "luxembourg", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "bournemouth", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "india", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "malaysia", "sentiment": "none"}, {"name": "dublin", "sentiment": "none"}, {"name": "glasgow", "sentiment": "none"}, {"name": "netherlands", "sentiment": "none"}, {"name": "las vegas", "sentiment": "none"}, {"name": "bristol", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "alt brew", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "frankfurt", "sentiment": "none"}, {"name": "malta", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "silicon uk", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}, {"name": "edinburgh", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}], "organizations": [{"name": "virgin money and go-ahead group", "sentiment": "negative"}, {"name": "square mile", "sentiment": "none"}, {"name": "land transport authority", "sentiment": "none"}, {"name": "shell ocean discovery", "sentiment": "none"}, {"name": "newcastle university", "sentiment": "none"}, {"name": "bt", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "barcelona", "sentiment": "none"}, {"name": "virgin money", "sentiment": "none"}, {"name": "coreena ford ofcom", "sentiment": "none"}, {"name": "fira gran via complex", "sentiment": "none"}, {"name": "bt basic", "sentiment": "none"}, {"name": "coreena ford newcastle", "sentiment": "none"}, {"name": "coreena ford record uk", "sentiment": "none"}, {"name": "jp morgan", "sentiment": "none"}, {"name": "sony", "sentiment": "none"}, {"name": "deutsche bank", "sentiment": "none"}, {"name": "bme", "sentiment": "none"}, {"name": "autumn brewing co.", "sentiment": "none"}, {"name": "samsung", "sentiment": "none"}, {"name": "mwc", "sentiment": "none"}, {"name": "govia thameslink railway", "sentiment": "none"}, {"name": "national innovation centres", "sentiment": "none"}, {"name": "soil machine dynamics", "sentiment": "none"}, {"name": "southern railway", "sentiment": "none"}, {"name": "virgin group", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}, {"name": "dit", "sentiment": "none"}, {"name": "hsbc", "sentiment": "none"}, {"name": "morgan stanley", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "coreena ford newcastle university", "sentiment": "none"}, {"name": "department for international trade", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "ofcom", "sentiment": "none"}, {"name": "autumn brewing co", "sentiment": "none"}, {"name": "united kingdom accreditation service", "sentiment": "none"}, {"name": "mobile world congress", "sentiment": "none"}, {"name": "lloyd’s of london", "sentiment": "none"}, {"name": "citibank", "sentiment": "none"}, {"name": "consumer electronics show", "sentiment": "none"}, {"name": "coreena ford county durham", "sentiment": "none"}, {"name": "google", "sentiment": "none"}, {"name": "coeliac uk crossed grain symbol", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KEY EVENT Regional financial services jobs at risk, lobby group warns \nNearly two-thirds of Britain’s financial services roles are currently based outside of London, laying bare the risks to thousands of regional jobs after Brexit. \nA new report by Square Mile group lobby group TheCityUK shows that 1.5 million of 2.2 million industry jobs are located outside the capital, with hubs like Birmingham, Bristol, Edinburgh, Glasgow and Manchester hosting more than 30,000 financial and related professional services workers each. \nTheCityUK chief executive Miles Celic said: “Our report reinforces the value delivered by financial and related services to the whole of the UK economy.” International firms that come to Britain for business usually put down roots in London before expanding their operations across the country, creating a “deeper talent pool” of skilled workers that benefits both local and national businesses, he added. \n“Strong regional financial centres, like Edinburgh, Manchester and Birmingham, boost the attractiveness of London as a global financial centre. Maintaining this ecosystem is critical to ensuring the UK remains a world-leading place to do business.” \nUS bank JP Morgan employs around 5,500 staff outside of London, including 300 in Edinburgh, 1,200 in Glasgow and 4,000 at its global technology and operations centre in Bournemouth. \nGlasgow also hosts 1,200 staff from Morgan Stanley, while Belfast hosts 2,000 Citibank staff, and Birmingham is home to 1,500 Deutsche Bank workers. Overall, more than 21 UK cities have over 10,000 people employed in the sector. \nThe data raises concerns over how Britain’s regions will be impacted by a post-Brexit exodus of banking, insurance, accounting jobs and related positions. However, TheCityUK report said: “The extent to which these and other firms may change their UK-focused business plans in the wake of the UK’s vote to leave the EU will depend on firm-specific business models and so is likely to vary from company to company.” \nRival financial centres like Frankfurt, Dublin and Paris are expected to siphon off some of the City’s businesses, ahead of the expected loss of passporting rights as part of a hard Brexit. \nPassporting rights allow UK-based financial services to trade across the bloc without needing to apply for licences in each member state. \nHSBC has said it is on course to move 1,000 jobs from its London office to France as a result, while around 4,000 of JP Morgan’s 16,000 UK staff could be shifted abroad, though a potential location has yet to be revealed. \nLuxembourg has emerged as the frontrunner on a short list of five sites - including Malta, Dublin, Frankfurt and Paris - for a potential EU subsidiary for Lloyd’s of London. \nThe move could see more than 100 jobs at the insurance market shifted from London to the continent. Government coffers are expected to take a hit from the loss of financial services jobs, which contributed nearly £176 billion of gross value added (GVA) - a measure of economic growth that excludes taxes and subsidies - in 2015, TheCityUK said. HSBC has said it is on course to move 1,000 jobs from its London office to France (Photo: PA) 9.00 Coreena Ford Record UK exhibitors at mobile world congress \nThe UK has a record number of exhibitors at the Mobile World Congress (MWC) technology show because of Government backing, the Department for International Trade (DIT) has said. \nAccording to the DIT, 167 tech firms from Britain are attending the Barcelona event, which it claims was a figure aided by Government support, enabling start-ups to appear alongside giants of the industry including Samsung and Sony. \nInternational trade minister Greg Hands said: “The world continues to see the UK as a leading technology destination of choice, with global tech companies such as Facebook, Apple and Google leading the charge to invest in Silicon UK.” In January, the head of the Consumer Electronics Show (CES) tech event in Las Vegas, Gary Shapiro, criticised the Government over what he claimed was a lack of support preventing more British companies from attending. Mr Shapiro said France and the Netherlands had moved ahead of the UK in terms of show presence and suggested because CES takes place in Las Vegas, attendance was “frowned upon” by the Government. At the time the DIT said it offered start-ups “targeted support and bespoke business matching that better maximises their presence to win vital contracts abroad”. At MWC, the department says it is working with 75 firms to help them showcase their products and meet potential investors. “We have some of the most innovative tech talent and entrepreneurs in the world, and I want to encourage other investors to take notice and take advantage of our expertise and ideas,” Mr Hands said. “Global industry shows, like Mobile World Congress, are a huge opportunity for small businesses, and my department is here helping more UK companies than ever build the connections they need to revolutionise the world and go global.” Start-up What3Words is one of the firms the DIT is working with at the event - the company’s mapping system is used by postal services and aid agencies to help them pinpoint accurate global addresses. The company has been nominated for two Global Mobile Awards at MWC, and director Giles Rhys Jones said support at the event had been vital. “MWC is a fantastic platform to reach potential partners, investors and influencers, and the support we have received from the Department for International Trade to help us get here has been fantastic,” he said. Visitors attend to the Mobile World Congress 2017 on the opening day of the event at the Fira Gran Via Complex in Barcelona 8.55 Coreena Ford Proposals to end ethnic inequality at work could boost economy by up to £24bn \nBritish firms could boost the UK economy by up to £24 billion a year if they enforced new proposals designed to stamp out ethnic inequality in the workplace, according to a Government-backed review. \nThe Baroness McGregor-Smith review wants companies with 50 or more staff to publish a breakdown of their workforce by race and pay to help remove barriers for people from black and minority-ethnic backgrounds (BME). \nIt found that the UK economy is currently missing out on 1.3% of annual growth because BME workers do not achieve the same level of progression as their white colleagues. \nAs part of the measures, companies will have to create five-year targets for diversity and pinpoint a board member in charge of delivering the goals. \nIt comes as the Government launched a new business diversity and inclusion group, which will be spearheaded by business minister Margot James. \nSpeaking about the Government-backed review, Baroness McGregor-Smith said no one should struggle to reach the top of any organisation because of their race. “ \nShe said: “The time for talk on race in the workplace is over, it’s time to act. \n“If businesses and the Government act on my recommendations, it will show everyone from a minority background that Britain’s workplace is for everyone, not just the privileged few. “The consequences of continuing to do nothing will be damaging to the economy and to the aspirations of so many. \n“So from the cabinet table to the board rooms, there is no more time for excuses - just change.” 8.50 Coreena Ford County Durham brewer launches gluten-free beer made from quinoa \nA North East brewery has become the first in the UK to produce only gluten-free beers for drinkers suffering from Coeliac disease. \nEntrepreneur Peter Briggs launched the Autumn Brewing Co after a friend was diagnosed as being coeliac. \nThe Durham firm has now launched its Alt Brew range of drinks that use low gluten grains such as rice, millet and quinoa instead of barley. \nMr Briggs said: “After two years of research, training and many small scale trial brews using different combinations of naturally gluten-free grains, we are proud to have created Alt Brew, our first range of great tasting gluten-free beers. \n“The range is now available to purchase and the feedback we’ve had so far has been great. For those who follow a gluten-free diet, out of necessity or choice, finding high quality, great tasting gluten-free beers brewed from naturally gluten-free ingredients, is a real joy.” \nThe Alt Brew range of beers currently comes in two varieties but Mr Briggs has plans to increase the range in the coming months. The beers currently on offer are Alt Brew No.01 Bavarian Style Pilsner and Alt brew No.02 English Pale Ale. \nCoeliac disease is a lifelong autoimmune disease caused by a reaction to gluten and affects at least one in 100 people. According to Coeliac UK, oldest coeliac charity in the world, only a quarter of sufferers have been clinically diagnosed. \nThose suffering from Coeliac disease are advised to avoid food and drink continaing barley, wheat, or rye as an ingrediant. This includes the majority of beers and lagers. \nAutumn Brewing Co’s beers and lager are certified as gluten-free through the Coeliac UK Crossed Grain Symbol scheme and have been independently tested by a United Kingdom Accreditation Service laboratory. Autumn Brewing Co. founder Peter Briggs (Photo: r//evolution marketing) 8.45 Coreena Ford Newcastle engineers dive into $7m underwater robotics competition \nA team of scientists and engineers from the North East is in the running for a $4m prize to design an underwater robot that can map the ocean floor. \nTeam Tao, which is made up of staff from Tyneside-based Soil Machine Dynamics (SMD) and academics from Newcastle University, has reached the semi-final of the Shell Ocean Discovery XPRIZE, a competition to create tools for unmanned underwater exploration. \nThe UK team is developing an autonomous swarm system that is used for rapid surface and deep o11352324cean exploration. \nChris Wilkinson, chief technology officer at SMD UK , explains: “SMD has a long history of creating subsea technology solutions, our equipment has played a major role in laying over 80% of the world’s physical connections for the internet between continents. Team Tao being the only UK team in the second round of the Shell Ocean Discovery XPRIZE Challenge is a great achievement for them and something we are extremely proud to support. \n“The competition is all about finding faster and cheaper ways to create maps for all our oceans’ sea beds. The current estimated cost and time to do this is $3bn by 2030. The challenge is significant and being part of the competition is very much about taking part in a journey of learning and innovating each step of the way. \n“The technologies which will come out of the XPRIZE will give us the ability to finally discover underwater resources, geological features, new species and safer methods of mapping and exploring the world’s oceans.” Team Tao, the UK semi-finalists in The Shell Ocean Discovery XPRIZE Challenge (Photo: SMD PR) 8.36 Coreena Ford Newcastle University puts more than £1bn into North East economy \nAn assessment of Newcastle University’s contribution to the city has found that it added £1.1bn to the economy. \nThe university - which has more than 27,500 students and 5,780 staff - is the fourth largest employer in the North East and has an annual income of £475m. \nNow economic analysis by Regeneris and Urban Foresight has highlighted how the university’s foreign students put £115m into the local economy each year while research grants of £105 have helped support major investment in two National Innovation Centres in ageing and in data, plus a national research centre for subsea and offshore engineering on the banks of the Tyne. \nThe university’s supply chain spending supports 1,800 jobs, most of them in the North East, while its students spend an estimated £240m in the North East economy. \nOther boosts to the local economy include £17m from visits by students’ friends and family which support 430 jobs in the North East, 290 of them in Newcastle. \nProfessor Chris Day, the university’s vice-chancellor said: “Our original role as a University was to educate the pioneers of the industrial revolution to make advances in engineering, shipbuilding and agriculture. We also led the way in research into public health issues that blighted the local population at that time. \n“Today, even though we have grown in scale and diversity, and are now operating on a truly global stage, with campuses in London, Malaysia and Singapore, we continue to have a profound impact on the city of Newcastle and the North East of England. Professor Chris Day Coreena Ford BT responds to Ofcom proposals \nAfter Ofcom said it was considering proposals which would see £60 a year in household savings, BT has said: \n“We will respond to Ofcom’s consultation fully when we have considered the detail. \n“We take our responsibilities in this area very seriously and, unlike other companies, have many customers on special tariffs for socially excluded or vulnerable customers, including BT Basic, which still costs just £5.10 a month for line rental and calls, and Home Phone Saver. \n“Recently, we have frozen the cost of line rental for all of our customers who take a BT phone line. \n“We have also been improving the service we provide and customers have benefited from our multi-million pound investments in a faster fault repair service, the launch of our free nuisance calls prevention service BT Call Protect and bringing call centre work back from India to the UK.” 8.20 KEY EVENT Virgin Money posts 33% boost in profits \nThe chief executive of Newcastle-headquartered Virgin Money has hailed a strong performance following continued growth in “high-quality lending”. \nUnderlying pre-tax profit at the challenger bank rose by 33% to £213.3 million and customer loan balances increased by 19% against continued strict underwriting principles. \nOverall, its customer base increased by 15% to 3.3 million, at a rate of over 35,000 customers per month, driven predominantly through digital channels. \nJayne-Anne Gadhia, chief executive at Virgin Money, said: “I am delighted to report another very successful year for Virgin Money in 2016. \n“Our customer-focused strategy of growth, quality and returns continues to achieve and maintain outstanding customer approval ratings, excellent asset quality and strong financial performance. \n“We recorded market-beating growth in our core mortgages, savings and credit card businesses to deliver a 33% increase in underlying profit before tax to £213.3m and strengthen our underlying return on tangible equity from 10.9 per cent to 12.4 %. \n“We continue to target high quality lending growth and the combination of strong new mortgage lending and improved customer retention resulted in 17% growth in mortgage balances to £29.7bn, significantly outpacing the market.” \nMrs Gadhia said the firm’s credit card business continues to flourish with 55% growth in prime credit card balances to £2.4bn, putting the firm on target to reach £3bn in credit card balances at the end of 2017. \nShe added: “We are excited about the strategic opportunities ahead of us including the build of our digital bank, which will be transformational for the business, and our partnership with Virgin Red, which will give our customers access to great deals from across the broader Virgin Group of companies. \n“We will continue to put customers at the heart of everything we do and remain on track to sustain a solid double-digit return on equity in 2017.” Virgin Money Chief Executive Jayne-Anne Gadhia 8.12 Coreena Ford Ofcom backing cuts in bills for BT landline customers \nBT could be forced to slash the phone bills of millions of customers with a landline-only contract under proposals being considered by Ofcom, a move that would see £60 a year in household savings. \nThe plans will benefit over two million people that buy only a landline telephone service from BT, who will see bills cut by “at least £5 per month”, Ofcom said. \nThe communications regulator said it found these customers are often elderly or vulnerable, or people who have remained with the same landline provider for decades, and are getting “poor value for money”. \nIt found BT’s market power has allowed it to increase prices without much risk of losing customers, with rivals then following the telecom giant’s pricing lead. Almost 80% of the UK’s 2.9 million landline-only customers are with BT. \nOfcom said: “The cut would return the cost of line rental to 2009 levels in real terms, effectively reversing price hikes for landline-only customers. \n“We are also proposing safeguards to prevent BT from making future increases to line rental and landline call costs by more than inflation.” \nUnder the proposals, BT customers with only a landline, who currently pay £18.99 per month for line rental, would pay no more than £13.99, a reduction of at least 26%. \nThe regulator said customers of “bundled” services, packages including landline, broadband and/or pay TV, benefit from attractive deals, driven by strong competition. \nBut offers for landline-only customers have become “increasingly limited”, with a number of providers withdrawing their telephone-only products altogether. Sharon White, Ofcom chief executive, said: “Line rental has been going up, even as providers’ costs come down. \n“This hurts people who rely on their landline the most, and are less likely to shop around for a better deal. We think that’s unacceptable. “So we plan to cut BT’s charge for customers who take only a landline, to ensure that vulnerable customers get the value they deserve.” \nOfcom is proposing and seeking views on a range of £5-£7 per month for the cut to BT’s landline-only line rental. BT logo (Photo: Nick Ansell/PA Wire) 8.07 FTSE and pound latest \nThe FTSE-100 index opened at 7253.00. \nThe pound at 8am was 1.2429 dollars compared to 1.2473 dollars at the previous close. The euro at 8am was 0.8521 pounds compared to 0.8518 pounds at the previous close. (Photo: Joe Giddens/PA Wire) KEY EVENT Go-Ahead Group issue profit warning \nThe group behind Southern Railway has warned over profits and apologised to passengers after “lengthy and significant” strike action left half-year earnings at its rail arm tumbling by 35%. \nGo-Ahead, which runs the Southern service through its Govia Thameslink Railway (GTR) business, said full-year profits would be lower than expected at its rail and bus divisions after a tough first half, which saw underlying operating profits for its rail arm plunge to £26.9m. \nThe group has been blighted by industrial action at Southern after proposing plans relating to staffing on its trains. \nIn its half-year report for the six months to December 31 2016 the firm said its London bus division, which now included new Singapore bus operations, operating profit was up 8.6% to £21.5m. Excluding Singapore, revenue growth in London bus was 2.8% while mileage was broadly flat. \nRegional bus operating profit was up 6.2% to £25.7m despite revenue growth of 0.8% and a fall in passenger number of 0.7%, slightly outperforming subdued national trends, and it also achieved the highest customer satisfaction score in the regional bus sector of 89% \nDavid Brown, group chief executive, said: “We apologise to our passengers who have faced months of severe disruption and inconvenience. \n“Our primary aim is to improve the service for passengers and we remain in discussions with trade unions with the aim of reaching a full resolution of these ongoing issues so that we can deliver services our customers can rely on.” \nMr Brown said that overall, the financial results are in line with expectations. \nHe said: “Beneath these overall results there is a mixed picture. Both of our bus divisions and two of our three rail businesses performed well, but there are clearly ongoing issues at GTR which we are working hard to resolve. \n“In regional bus, while variations exist between different geographical areas, revenue has continued to grow. Passenger volumes, while subdued, have outperformed national trends. The London bus business performed in line with our expectations. \n“We began operating our first bus contract in Singapore in September 2016 and are pleased with the service we are providing to customers on behalf of the Land Transport Authority. \n“We recently acquired two regional bus businesses which will deliver cost synergies and drive revenue in the long-term through the expertise of our local teams. \n“Despite the near term challenges, our bus and rail businesses remain fundamentally strong and we are committed to protecting our core business and delivering value. The Group is in a good financial position, with strong cash generation and a robust balance sheet allowing flexibility to pursue value-adding opportunities and make returns to shareholders.” David Brown, chief executive of Go-Ahead (Photo: Guy Bell) 8.00 KEY EVENT Greggs boosts dividend after sales rise to £894m \nGreggs’ mission to transform from a traditional bakery into a food-on-the-go market leader gathered apace last year but the consumer outlook is challenging, the retailer’s boss warned. \nThe firm said it delivered another strong performance in the year ended December 31 2016, totting up a sales rise of 7% to £894.2m and operating profit excluding property profits and exceptional items of £78.1m, an increase of 8.6%. \nStrong cash generation means the firm has significant resources for self-funded capital investment to support growth and on the back of the strong results the dividend per share was hiked up 8.4% to 31p. \nThe firm centred its focus on food-on-the-go market back in 2013 and directors said it grew strength in that market last year. \nFurther improvements were made to its product range, including extended choice in hot drinks and hot food, and its healthy Balanced Choice range now accounts for more than 10% of sales. \nRoger Whiteside, chief executive, said: \nIn 2016 we delivered another strong performance as we continued on our journey to transform Greggs from a traditional bakery business into a modern, attractive food-on-the-go retailer. \nOur product offer is evolving to meet the changing needs of our customers and our shop estate and service levels have benefited from significant investment. The UK consumer outlook is more challenging than we have seen in recent years, with industry-wide pressures emerging in commodities as well as labour costs. However we are confident of making further progress as we implement our plan to grow Greggs as a contemporary food-on-the-go brand. A Greggs shop (Photo: Western Mail) Share", "external_links": [], "published": "2017-02-28T15:00:00.000+02:00", "crawled": "2017-02-28T13:07:55.995+02:00", "highlightTitle": ""}