{"organizations": [], "uuid": "0d68c14294e791e1c1c198e11c47b5b62467b5b7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bostonstandard.co.uk", "main_image": "http://res.cloudinary.com/jpress/image/fetch/w_300,f_auto,ar_3:2,c_fill/http://www.skegnessstandard.co.uk/webimage/1.7638016.1484244064!/image/image.jpg", "site_section": "http://www.skegnessstandard.co.uk/rss/cmlink/1.346949", "section_title": "Skegness Standard MSKP.news.feed", "url": "http://www.bostonstandard.co.uk/news/boston-and-skegness-mp-makes-final-vow-to-vote-to-trigger-article-50-ahead-of-brexit-debate-decision-1-7801734", "country": "GB", "title": "Boston and Skegness MP makes final vow to vote to trigger Article 50 ahead of Brexit debate decision", "performance_score": 0, "site": "bostonstandard.co.uk", "participants_count": 0, "title_full": "Boston and Skegness MP makes final vow to vote to trigger Article 50 ahead of Brexit debate decision", "spam_score": 0.0, "site_type": "news", "published": "2017-02-01T22:09:00.000+02:00", "replies_count": 0, "uuid": "0d68c14294e791e1c1c198e11c47b5b62467b5b7"}, "author": "", "url": "http://www.bostonstandard.co.uk/news/boston-and-skegness-mp-makes-final-vow-to-vote-to-trigger-article-50-ahead-of-brexit-debate-decision-1-7801734", "ord_in_thread": 0, "title": "Boston and Skegness MP makes final vow to vote to trigger Article 50 ahead of Brexit debate decision", "locations": [], "entities": {"persons": [{"name": "bill", "sentiment": "none"}, {"name": "david cameron", "sentiment": "none"}, {"name": "matt warman", "sentiment": "none"}, {"name": "warman", "sentiment": "none"}, {"name": "westminster", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "boston", "sentiment": "none"}], "organizations": [{"name": "skegness", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}, {"name": "house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Boston and Skegness MP makes final vow to vote to trigger Article 50 ahead of Brexit debate decision Boston and Skegness MP Matt Warman 15:09 Wednesday 01 February 2017 Have your say \nBoston and Skegness MP Matt Warman has again vowed to vote to trigger Article 50 tonight (Wednesday) claiming that ‘democracy itself is at stake’. \nDuring a debate which began yesterday Mr Warman highlighted that many residents of his constituency, which recorded the highest ‘out’ vote in the country, voted to take back control of our laws, money and borders, and for Parliament to ignore this would be to risk undermining faith in democracy itself. \nHe said: “In my constituency of Boston and Skegness, 76% voted to leave the European Union—more than in any other seat in the country. While that choice on the ​referendum ballot might have been simple, it covered a multitude of issues.” \nHe told the House of Commons: “The central point I want to make is that there has been a sense—not over the last 18 months or over the period of the referendum campaign, but over the last 40 years—that the policies promoted by Westminster have become ever more remote from constituencies such as mine. \n“There has been an increasing sense that there is not consent for the kind of free movement to which my hon. Friend has referred, and that there is not consent for the kind of relationship that we have had with our European neighbours. \n“We all want free trade, but not everyone wants the kind of free movement that we have seen. The social changes that it has wrought on small market towns such as Boston are not something for which the people voted at any point, and that disconnect has fundamentally diminished the reputation of this House, of politics, and of politicians throughout the country. \n“What we have today, and what we will have in the vote tomorrow, is an opportunity to take a small step towards restoring some of the faith in this place. What we have is an opportunity to demonstrate to the British people that after the former Prime Minister, David Cameron, promised that we would deliver a referendum, the House kept that promise, and that now the House will deliver on what the referendum mandated us to do. \n“It is only through politicians keeping their promises that we will do the greater thing, which is to seek and, I believe, to achieve the restoration of some kind of faith in politics as the sole means to make our country better. \n“There are those who say that to vote with one’s conscience is to suggest that one knows better than one’s constituents. I know that there are some issues on which we are asked to make decisions on behalf of our constituents, because there has been no referendum on every Bill, but in this case there has been a very clearly expressed view from each and every one of our constituents, and it appeared to me that that very clearly expressed view was a wish for us to trigger article 50. \n“I accept that there are other views, but when it comes to voting with my conscience, my conscience tells me not only that I should trigger article 50, but that if I do anything else I shall risk undermining not just faith in this party and not just faith in this Parliament but faith in democracy itself. I do not believe that I could vote with my conscience and do that shameful thing, and I am not sure that many others in the House would seek to do it either. \nIn a statement this morning, Mr Warman added: “As I said in the Commons, this Bill gives us the opportunity to take a step towards restoring faith in politics, which has increasingly become disconnected from small market towns such as Boston. I will be voting to trigger Article 50 tonight and I have no doubt that the vast majority of my colleagues will join me in respecting not only the will of the electorate, but democracy itself.” Sign in", "external_links": [], "published": "2017-02-01T22:09:00.000+02:00", "crawled": "2017-02-02T03:46:18.750+02:00", "highlightTitle": ""}