{"organizations": [], "uuid": "400527ea886a8d8641d8c915b57d4e22bf49a058", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12628622.ece/ALTERNATES/s1200/SWR_NJL_100217josie_02.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/whats-on/comedy-news/comedian-josie-long-brings-something-12622043", "country": "GB", "domain_rank": 21960, "title": "Comedian Josie Long brings Something Better to The Stand in Newcastle", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Comedian Josie Long brings Something Better to The Stand in Newcastle", "spam_score": 0.0, "site_type": "news", "published": "2017-02-26T20:00:00.000+02:00", "replies_count": 0, "uuid": "400527ea886a8d8641d8c915b57d4e22bf49a058"}, "author": "Sam Wonfor", "url": "http://www.chroniclelive.co.uk/whats-on/comedy-news/comedian-josie-long-brings-something-12622043", "ord_in_thread": 0, "title": "Comedian Josie Long brings Something Better to The Stand in Newcastle", "locations": [], "entities": {"persons": [{"name": "josie long", "sentiment": "positive"}, {"name": "cara josephine", "sentiment": "none"}, {"name": "ricky gervais", "sentiment": "none"}, {"name": "jo cox", "sentiment": "none"}, {"name": "josie", "sentiment": "none"}, {"name": "john bishop", "sentiment": "none"}, {"name": "brendan healy", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "rebecca solnit", "sentiment": "none"}], "locations": [{"name": "newcastle city hall", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "positive"}, {"name": "bbc", "sentiment": "none"}, {"name": "barnard castle", "sentiment": "none"}, {"name": "oxford", "sentiment": "none"}, {"name": "newcastle  nevertheless", "sentiment": "none"}, {"name": "stand newcastle", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "What's On Comedian Josie Long brings Something Better to The Stand in Newcastle Following the global success of her last show, Cara Josephine, the popular comedian is doing her very best to be optimistic Share Josie Long brings her show, Something Better to The Stand Newcastle in March 2017 (Photo: handout) Share Get what's on updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nIt was May last year when comedian Josie Long set about writing what she hoped would be a “really optimistic show”. What a lovely month that must have been. \n“And then it became a show about dealing with what’s going on since Brexit - trying to cope with the new reality we’ve got and what that means,” says the 34-year-old, who will be bringing the show, Something Better to The Stand Newcastle on March 7 . \n“It’s about trying to get back to optimism, and it kind of manages it I think, but yeah, it kind of got a little bit hijacked by Brexit and all the stuff that’s happened since.” \nWidely known and respected as a comedian who wears her left-wing heart on her sleeve, Josie, who won the BBC New Comedy Award aged just 17, surprised a lot of her fans with the show she did before this one. The much more personal Cara Josephine, which enjoyed international sold-out success, revealed a whole other side to her comedy - and took Josie right out of her comfort zone. \nNow she’s back on the political prowl with Something Better, I wondered whether her relatively newfound willingness and ability to share more personal stories and experiences would still be detectable. Apparently it absolutely will. \n“Once you start opening up, it’s a lot easier to do so,” she says. “So, now I’ve started doing that, I can’t help but put a bit of that in there. There is a bit in the show where I talk about how, on top of Brexit I found myself breaking up with someone and feeling very anxious about where I was in my life. \n“There’s definitely an element of that and I think it interplays with the political stuff as well. \n“A lot of this show is about how I personally tried to deal with Brexit and everything, mainly because I don’t have the authority to speak for other people,” she continues. “I had to just talk about how I felt and how I couldn’t believe it. It was the only way I could get in to something so big.” Read More Ricky Gervais books Newcastle City Hall date for Humanity tour in the summer \nLike many Remain voters, as the EU Referendum approached, Josie, an Oxford graduate and long-time social justice activist, went back and forth as to what she thought the result would be. \n“To begin with I really thought that we definitely wouldn’t leave because obviously it’s really, really self destructive and there’s no benefit from it, and all the people running the campaign were so awful and obviously people are going to see through that,” she says. \n“And then as it got closer, I was thinking ‘oh my god, it’s going to happen’. \n“But then, on the day Jo Cox was murdered, I remember thinking then that no way could this happen. No way would people vote for this to happen now after seeing how toxic and how horrible the whole campaign had been. \n“So when it did happen, it really shocked me.” Read More Win tickets for Brendan Healy tribute concert at the Tyne Theatre in Newcastle \nNevertheless, Josie, who many may also know from her panel show appearances, presenting of Radio Four’s Short Cuts and her much-loved podcast outings, has picked herself up, because she believes despair is a luxury we simply don’t have time for. \n“Basically, I read this book called Hope in the Dark by Rebecca Solnit, which a lot of the show draws on, and in it, she talks about the fact that hope is an active thing. Yeah, things are really difficult, but we have to keep going. \n“I feel like the luckiest person in the world, making a living from doing what I love, so any time or energy that I’ve got, I can spend being useful. I can’t let myself feel pessimistic because I’m not in trouble - I’m not ill, I’m not old, I’m not struggling for my rent. So it’s not right for someone like me to be whinging about how it’s really bad, when I’m in a position to try and be useful.” Read More Comic John Bishop books three nights at Barnard Castle comedy club \nAnd that’s how Josie wants people to feel when they leave her show. \n“I want to make people feel like they’re not alone and like it’s not the end of the world. And that there are plenty of things you can do that would be useful in society and good for everyone. \n“I do want to make this show uplifting and give people a bit of energy. The dream would be to energise people so they go off and do things which are much more important to society than what I do. \n“And at the end of the day, what else are we going to do? You might as well try, and you might as well be on the right side.” \nI’m in. You coming? \nJosie Long: Something Better comes to The Stand Newcastle on March 7. For tickets, call 0191 300 9700 or visit the website at www.thestand.co.uk/whats-on/Newcastle Like us on Facebook", "external_links": [], "published": "2017-02-26T20:00:00.000+02:00", "crawled": "2017-02-26T18:49:12.823+02:00", "highlightTitle": ""}