{"organizations": [], "uuid": "0204324680c34e8c6a1954efb18bb767858bc101", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.exeterexpressandecho.co.uk/images/localworld/ugc-images/276269/Article/images/30158781/15873489.jpg", "site_section": "http://www.westernmorningnews.co.uk/farming.rss", "section_title": "Devon Live Farming RSS feed", "url": "http://www.devonlive.com/pkf-francis-clark-farmers-urged-to-get-brexit-plans-in-place/story-30158781-detail/story.html", "country": "GB", "title": "PKF Francis Clark: Farmers urged to get Brexit plans in place", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "PKF Francis Clark: Farmers urged to get Brexit plans in place", "spam_score": 0.0, "site_type": "news", "published": "2017-02-23T21:47:00.000+02:00", "replies_count": 0, "uuid": "0204324680c34e8c6a1954efb18bb767858bc101"}, "author": "AthwennaIrons", "url": "http://www.devonlive.com/pkf-francis-clark-farmers-urged-to-get-brexit-plans-in-place/story-30158781-detail/story.html", "ord_in_thread": 0, "title": "PKF Francis Clark: Farmers urged to get Brexit plans in place", "locations": [], "entities": {"persons": [{"name": "francis clark", "sentiment": "none"}, {"name": "brian", "sentiment": "none"}, {"name": "david cameron", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "defra", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "leadsom", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "brian harvey", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "south west region", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "truro", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}], "organizations": [{"name": "european union", "sentiment": "none"}, {"name": "farmers", "sentiment": "none"}, {"name": "hm revenue & customs", "sentiment": "none"}, {"name": "pkf", "sentiment": "none"}, {"name": "national health service", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "making tax digital", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "nfu", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Comments (0) \nIn spite of all that is thrown at them, farmers on the front line of food production are an undeniably resilient bunch. Exposed on a daily basis to uncontrollable forces such as the weather, global commodity prices or – over the past year – government decisions on the future of life outside the European Union, British farmers take on with immense pride the privileged responsibility of catering for the masses. \nAmid the feeling of grave uncertainty cast over the whole agricultural industry since the referendum, farmers here in the South West have united with their national counterparts in putting their heads down and getting on with the job in hand. \nDuring our interview last year with specialist agricultural accountants PKF Francis Clark, the prospect of cutting our membership ties with the European Union was being debated in a \"what if\" rather than \"when\" mind set, with the then Prime Minister David Cameron yet to strike his deal over a reform package designed to persuade voters to stay in the union. \nThe Francis Clark team warned us that a British exit in the June referendum would be a \"leap into the unknown\" for agriculture. \"What happens if we vote to leave the EU?\" they questioned. \"Is the British government – possibly a different government to the one we have now – going to favour farming over the health service or education?\" \nHow times change, as the age-old phrase goes. So with the ballot boxes long in and Britain scheduled to leave the EU by the end of March 2019 – providing the Article 50 trigger is pulled next month – Theresa May in the Prime Minister's chair and Donald Trump taking office as the 45th President of the United States for good measure, what's the forecast for farming after this rollercoaster year? \n\"The world turns slowly but politically there have been some major events in the last twelve months that will definitely have implications on the farming sector for 2017 and longer into the future,\" says Brian Harvey, partner at PKF Francis Clark. \nREAD NEXT: NFU Conference: I'll fight for our farmers, says Defra boss Leadsom \n\"We have taken that leap into the unknown and while there is some clarity in terms of funding secured for farmers until 2019 – possibly 2020 depending on how you read the legislation – thereafter who knows? In terms of unknowns I think it is probably as many know as it was on the day after the Brexit vote in terms of where that leaves the sector and what trade deals may or may not be able to be negotiated.\" \nHe continues: \"I think the vast majority of people who voted to leave the EU will have been of the expectation that we will look to negotiate some kind of trade deal with the EU that was pretty much as it was and we might not notice too much difference. But actually, if we end up with a hard Brexit option then that would have a much bigger implication on both our imports and exports and the impact of that will be felt by every rural business.\" \nChatting in the firm's Truro office on a Wednesday morning, with the hustle and bustle of another busy market day happening just a stone's throw away, it seemed the perfect time to ask Brian how he thinks South West farmers are feeling following the decision to leave. \"I think there's quite a lot of optimism,\" he responds. \"Rightly or wrongly, the majority of farmers appear to have voted for Brexit and in the short term there has definitely been a positive bounce because of the weakening of the pound, which is great in terms of Single Farm Payment receipts and opening up export opportunities.\" \nBut while the majority of people are still happy with the way they voted back in June 2016, Brian says as parliamentary negotiations progress, there are an increasing number of questions being asked of those in power. \"There are starting to be more concerns about what our government might be able to do or not do in terms of trade negotiations and whether or not agriculture could be used as a pawn as part of those negotiations,\" he explains. \n\"Through being members of the EU, agriculture across Britain has been heavily supported and has been seen as a significantly important industry for the whole of Europe. When we stand alone, it's whether or not UK agriculture will still attract that level of importance and ultimately support.\" \nBrian notes the example of the horticulture sector, an industry which has very specific needs for labour and requires thousands of seasonal workers to plant, pick and pack fruit and vegetable crops across the country. \"Huge swathes of South West agriculture, tourism and other businesses rely very heavily on permanent or temporary labour from overseas,\" he says. \"If that doesn't come then that creates a significant problem. \nREAD ALSO: OPINION: Rural West needs answers on the vital Brexit questions \n\"It is all very well saying that we can put British people in those jobs, but if they won't do the work for that level of pay either that means it won't be done or you have to push the prices up. In turn that will leave those businesses, particularly in the fruit and vegetable sector, struggling because they are already under price pressure from the supermarkets.\" \nBrian also raises an interesting viewpoint about the close link between farming, food and health, something which he believes the agricultural sector could be doing more in trying to promote. \"If people have a healthier diet and eat more fresh produce, potentially that means there is less demands on the National Health Service (NHS),\" he says. \"There's very much a strong link between farming, food and a healthier Britain and I think this warrants greater emphasis and promotion. \n\"The government does not have a bottomless pit of funds. If it is a competitive process to attract these funds then most people would probably say 'I would rather it goes to the NHS or education'. Given this I think there is a bigger picture that needs considering and farming needs to think outside the box in terms of promoting itself in that way.\" \nSo what should farmers who want to stay in the industry be doing to ensure their businesses are Brexit ready? Considering your options and adopting a 'no stone unturned' policy in order to evaluate every aspect of the business is going to be crucial over the next three years, stresses Brian: \"I have been spending a lot of time and energy trying to get the message across that what this does is present a narrow window of opportunity for farmers and all rural businesses to look at making themselves as Brexit ready as they can be. \n\"Farmers need to think about which areas of their business will be directly impacted by Brexit and what will this mean to them. Consider what your business might look like if there is no Single Farm Payment or funding is administered in a completely different way. Also look at how much of your business would be impacted by broader trade deals. While there may be some that feel a pretty low impact, there will be others where the numbers may not stack up in 2020.\" \nAnd, as Brian urges, farmers really need to be addressing these issues today, rather than resting on their laurels and crossing that bridge when they come to it in 2020. \"Now is the time to ask yourself 'should I be doing something differently, should I be diversifying or even should I be doing this at all,\" he says. \nREAD ALSO: The top nine supermarkets for buying food that comes from Britain \n\"Farmers have got this window of opportunity now, so don't get to 2020 and be surprised that the world looks like a different place and not quite as rosy as it does today. Act now while you still have time to make a proper judgement. \n\"The more progressive businesses do question why they do things, what the benefits are and if they should do things differently, looking to benefit from the marginal gains of doing everything that little bit better. I think that has been the case and that will need to continue to be the case so, regardless of Brexit, farmers question whether there are ways of making their businesses more profitable.\" \nPlus being an accountant, it is only right that Brian gives a heads-up to farmers about the latest tax system changes. He says following an announcement on January 31, the government's Making Tax Digital policy is going to come into force from April 1, 2018 for some smaller businesses. As part of the changes businesses, self-employed people and landlords will be required to report trading information online on a quarterly basis to HM Revenue & Customs. \n\"This will have a major impact on the way people keep their accounting records and what they report to HM Revenue & Customs,\" advises Brian. \"The details are still very much to follow but if you keep manual accounting records then it is likely that these will not suffice. \n\"We will be talking more about it in our Westcountry Farmer column next month but farmers do need to be talking to their accountants and taking advice about how best to proceed.\" \nDuring our conversation, Brian is also quick to raise the point that many farmers in 2016 were successful in adopting good practice when commodity prices in their respective sectors tumbled, particularly in dairy farming. And continuing to implement these methods will be essential in order to maximise any profit generated this year. \"If you let your costs get out of control then you're not going to maximise your benefit from it,\" he explains. \nREAD ALSO: Bigger isn't always better for dairy cows, farmers told \n\"Farmers need to benefit as much as they can while the prices are higher because, as sure as tomorrow follows today, commodity prices will fluctuate. Where those peaks and troughs will be and how high those peaks will be and how low those troughs will be, who knows, but there will be peaks and troughs and if farmers don't make the most of those peaks they might not get through the troughs.\" \nHe adds: \"It's the same principle for all sectors, not just dairy, where you have got fluctuations beyond your control you need to control what is controllable and make the best of what you are presented with.\" \nAnd, as difficult as it may be for some families, in preparing for Brexit the topic of succession is something which Brian believes needs to be taken off the back burner and discussed. \"A lot of farmers have not or will not address succession as an issue and it doesn't get any easier tomorrow, next week or next year,\" he says. \n\"There can be a thousand and one reasons why farmers do not want to address it and I can appreciate that but you need to at least be having those conversations.\" \nFor those who may be finding it difficult to bring the family together and talk succession, Brian advises: \"In terms of capital taxes, the rates and reliefs now are relatively advantageous compared to where they have been in the past,\" he says. \"They could go back to where they have been so therefore now is a good time to at least consider it. And if you have got a year where there are hopefully better commodity prices then this might be the right time.\" \nWhile many farm businesses are still very much a family affair – particularly here in the South West region – Brian believes that in the next few years there could be an increase in the number of broader farming partnerships which bring together like-minded individuals and friends rather than blood relatives. He explains: \"For example, if you've got three dairy farmers with 300 cow herds that are all operating at the margin because of low commodity prices, if they were to pool their resources and create one 900 cow herd would that mean they would all benefit? \nREAD ALSO: Disappointment for farmers as trailer weight increases scrapped \n\"If you look at some of the major 'super dairies' in America, these were often formed when a number of businesses have decided to amalgamate for the common benefit of everyone. In bringing people together you may be able to get the best bits from each person and give yourself that competitive advantage, which might mean that you can continue to trade profitably for the next 20 years rather than perhaps struggling on just to make ends meet.\" \nIn our conversation with Francis Clark at the start of 2016, Brian pointed out that while the industry faced a number of significant challenges, there were also opportunities to be had for the most progressive farmers. So, one year on, how does the ratio between challenges and opportunities currently balance out? \"At this point last year there were certainly more challenges than opportunities,\" he clarifies. \n\"The weakening pound has presented a lifeline for some businesses and there certainly seems to be more optimism in the sector, which has to be a good thing. We are still very much part of a global market, maybe more so going forward than we have ever really considered, and that will present both challenges and opportunities.\" \nHe continues: \"There still seems to be a good number of potential new entrants into the agricultural sector – whether that be farmers' sons and daughters or students – and I think the industry needs to make sure it is able to welcome those entrants, because that remains very difficult in terms of the capital requirements. \n\"I think there is more opportunity there for contract or share farming arrangements which need to be further invested in and developed. While these are more common than there used to be, they are still very much the exception rather than the rule.\" \nBrian concludes: \"Going forward every industry needs to innovate and move forward. Inevitably that requires fresh blood, new ideas and enthusiasm and this applies as much to the agricultural industry as any other, such that any barriers to entry need to be minimised. It's all about identifying and making the most of those opportunities to help farmers of today and tomorrow advances their businesses.\"", "external_links": [], "published": "2017-02-23T21:47:00.000+02:00", "crawled": "2017-02-27T12:44:00.475+02:00", "highlightTitle": ""}