{"organizations": [], "uuid": "55768d5d8454fccfe3ba84e016da472c1a9b6eb9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12346931.ece/ALTERNATES/s1200/Amazon-working-conditions.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12549653", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Amazon reports 22% sales but misses analysts' forecasts", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast LIVE: Amazon reports 22% sales but misses analysts' forecasts", "spam_score": 0.0, "site_type": "news", "published": "2017-02-03T15:00:00.000+02:00", "replies_count": 0, "uuid": "55768d5d8454fccfe3ba84e016da472c1a9b6eb9"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12549653", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Amazon reports 22% sales but misses analysts' forecasts", "locations": [], "entities": {"persons": [{"name": "jeremy clarkson", "sentiment": "none"}, {"name": "richard harpin", "sentiment": "none"}, {"name": "richard hammond", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "james may", "sentiment": "none"}, {"name": "harpin", "sentiment": "none"}, {"name": "jeff bezos", "sentiment": "none"}, {"name": "izzy hatfield", "sentiment": "none"}, {"name": "peter wilding", "sentiment": "none"}, {"name": "adrian yalland", "sentiment": "none"}, {"name": "homeserve", "sentiment": "none"}, {"name": "lloyd jones", "sentiment": "none"}, {"name": "gillian marshall coreena ford homeserve", "sentiment": "none"}, {"name": "mr justice lewis", "sentiment": "none"}, {"name": "coreena ford", "sentiment": "none"}, {"name": "nick ansell/pa wire", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "selsey", "sentiment": "none"}, {"name": "rutherford street", "sentiment": "none"}, {"name": "latin america", "sentiment": "none"}, {"name": "habitissimo", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "north west", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "cambridgeshire", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "checkatrade", "sentiment": "none"}, {"name": "hertfordshire", "sentiment": "none"}, {"name": "st james boulevard", "sentiment": "none"}, {"name": "south east", "sentiment": "none"}, {"name": "mallorca", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}], "organizations": [{"name": "brexit", "sentiment": "negative"}, {"name": "amazon", "sentiment": "negative"}, {"name": "habitissimo  maintenance", "sentiment": "none"}, {"name": "british business bank", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "amazon studios", "sentiment": "none"}, {"name": "enterprise investment scheme", "sentiment": "none"}, {"name": "amazon echo", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "high court", "sentiment": "none"}, {"name": "supreme court", "sentiment": "none"}, {"name": "walsall", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "homeserve", "sentiment": "none"}, {"name": "stonegate developments", "sentiment": "none"}, {"name": "ippr", "sentiment": "none"}, {"name": "newcastle city council", "sentiment": "none"}, {"name": "cabinet member for investment and development and chair of tyne & wear archives & museums", "sentiment": "none"}, {"name": "european economic area", "sentiment": "none"}, {"name": "golden globe", "sentiment": "none"}, {"name": "british influence", "sentiment": "none"}, {"name": "conservative", "sentiment": "none"}, {"name": "coreena ford", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Fresh legal challenge over Brexit goes to High Court \nA fresh legal challenge over Brexit is being heard at the High Court today. \nIt is being brought by a group of campaigners who want a “soft Brexit” and to keep Britain in the European single market. \nThey include Peter Wilding, chairman of the pro-Europe pressure group British Influence, who is credited with coining the word Brexit. \nHe is joined by Conservative lobbyist Adrian Yalland, who voted Leave, and four anonymous applicants referred to as W, L, T and B. In a historic ruling, the Supreme Court declared that Parliament must give its approval to trigger Brexit under Article 50 of the Lisbon Treaty. \nThe new case centres on Article 127 of the “separate treaty” relating to the UK’s membership of the European Economic Area (EEA). \nThe EEA Agreement provides for the free movement of persons, goods, services and capital within the single market. \nThe applicants are asking the High Court in London for permission to seek a ruling that Parliament must separately give permission before the Government can pull out of the EEA. \nThey want a declaration that it would be unlawful for Prime Minister Theresa May to cause the UK to leave the EEA without prior Parliamentary authorisation through an Act of Parliament, and the serving of a withdrawal notice under Article 127. \nThe Department for Exiting the European Union says the case is unarguable and contends: “Once the UK leaves the EU, the EEA Agreement will automatically cease to apply to the UK.” \nA single judge who considered the case in private last December refused permission to apply for judicial review, but the applicants are exercising their right to renew their application in open court in a hearing before Lord Justice Lloyd Jones and Mr Justice Lewis. A person under an umbrella carrying the EU flag outside the High Court in London (Photo: Yui Mok/PA Wire) 8.25 KEY EVENT Newcastle's 26-storey skyscraper plan is approved \nNewcastle is set to get a new landmark after the plans were approved to build 26-storeys of flats in the city council. \nThe plot, in Rutherford Street just off St James Boulevard, houses a derelict warehouse which has been damaged by fire. \nStonegate Developments’ plan is to rip the warehouse down and replace it with an 82m high tower full of 162 private sector rental flats. \nThe apartments will be aimed at young families and professionals, with the applicant saying new city centre flats will encourage graduates to stay in Newcastle and boost its economy. \nNewcastle City Council’s planning committee approved the build during a lengthy meeting on Thursday - and the news has been welcomed by many, including Coun Ged Bell, Cabinet Member for Investment and Development and Chair of Tyne & Wear Archives & Museums, and the architects who worked on the designs and handcrafted a truly impressive 3D model of the building. How the Stonegate Developments 26-storey building in Newcastle will look 8.17 Coreena Ford FTSE and pound latest \nThe pound at 8am was 1.2519 dollars compared to 1.2540 dollars at the previous close. The euro at 8am was 0.8592 pounds compared to 0.8615 pounds at the previous close. \nThe FTSE-100 index opened at 7140.75. 8.13 Coreena Ford Dynamic North East businesses need better support, new report suggests \nA call has been made for better support to the North East’s business community after new figures showed it is one of the most dynamic regions of the UK. \nFigures obtained by the think-tank IPPR show that the North East has the second highest ratio of high-growth enterprises for the number of businesses in the region. \nDespite that appetite for growth in the North East, many forms of business support - including equity, bank lending and Government grants - are disproportionately going to London and the South East. \nIPPR is now calling on the Government to give the British Business Bank a specific objective of supporting businesses outside of London to kickstart the work of small, high growth firms across the country. \nIt also wants a review of the Enterprise Investment Scheme and Seed Enterprise Investment Scheme to make sure high growth businesses outside of London, which find it hardest to get finance, benefit from public support. \nIzzy Hatfield, economic analyst at IPPR, said: “This research challenges the idea that only London is the crucible of our best and most exciting small, high growth businesses. \n“In fact they exist across the UK. Everyone recognises the importance of supporting them to deliver a dynamic post-Brexit economy, but we show that the Government needs to do much more to help those outside of London access the finance they need to grow.” \nThe IPPR report has identified 12,000 high-growth businesses in the UK, 380 of which are in the North East. \nWhile the North East has the second lowest ratio of growing firms in terms of its population, it has the second highest - above London and second only to the North West - in terms of high-growth enterprises per 10,000 businesses. \nThe report also finds that businesses with growth ambitions are more likely to have their applications for bank lending rejected, and are more likely to be discouraged from applying for loans in the first place, due to the extra perceived risk they face. Gillian Marshall Coreena Ford Homeserve snaps up stakes in Checkatrade and Habitissimo \nMaintenance group Homeserve has splashed out £37 million on snapping up stakes in Checkatrade and Habitissimo, marking its entrance into the home improvement market. \nThe Walsall headquartered group picked up a 40% stake in Checkatrade, based in Selsey, with an option to increase its position by a further 35% in two years. Simultaneously, Homeserve has bagged a 70% stake in Habitissimo, with an option to increase its position by a further 30% in either four or five years’ time. Richard Harpin, Homeserve chief executive, said: \nOur investments in Checkatrade and Habitissimo underline Homeserve’s ambition to be at the forefront of the technological revolution as the world’s most trusted provider of home repairs and improvements. \nCheckatrade is an online directory of customer recommended tradespeople, which boasts nearly one million customer visits a month, resulting in 1.3 million jobs per year. \nHabitissimo, based in Mallorca, connects homeowners to local tradespeople and operates across nine countries in Europe and Latin America. \nMr Harpin added: \nBoth of these businesses provide innovative digital platforms, connecting customers to reliable tradespeople. With leading positions in the home repair and improvements market, these businesses will broaden Homeserve’s reach enabling us to meet the needs of younger, non-insurance minded customers who are looking to find immediate help from a wide range of home trades. Homeserve has entered the home improvement market 8.00 KEY EVENT Sales rise 22% at tech giant Amazon - but firm misses expectations \nAmazon reported a 22% hike in sales, despite falling short of analysts’ forecasts, the technology giant’s latest financial results showed. \nThe e-commerce firm reported sales of $43.7bn dollars (£34.9bn) for the final three months of 2016, up 22% on the $35.7bn (£28.5bn) it reported in the same quarter of 2015. \nThis was down on the $44.68bn (£35.6bn) market analysts had predicted. \nBut the firm did report an increase in income, which was up to $749m dollars (£597m) for the quarter, compared to $482m (£384m) a year ago. \nAmazon also used the results report to highlight the growing portfolio of products and services which the firm says are performing well. \nThese include smart home speaker and virtual assistant Amazon Echo, Amazon Studios, its in-house TV studio that picked up 11 Golden Globe nominations, and its Prime membership scheme that includes faster delivery as well as TV and music streaming services. \nThe debut of The Grand Tour - starring former Top Gear presenters Jeremy Clarkson, James May and Richard Hammond - was also noted as a success, with Amazon reporting “millions” streaming the show’s opening episode in November. \nAmazon boss Jeff Bezos said of the latest results: \nOur Prime team’s customer obsession kept them busy in 2016. \nPrime members can now choose from over 50 million items with free two-day shipping - up 73% since 2015. Prime Video is now available in more than 200 countries and territories. \nPrime Now added 18 new cities, which means millions more members now get one and two hour delivery. \nNew benefits were also added to the list, like Prime Reading, Audible Channels for Prime, Twitch Prime and more. \nAnd customers noticed - tens of millions of new paid members joined the program in just this past year. \nAmazon is currently running a trial of deliveries by drone in the UK, and completed its first customer delivery using their prototype Prime Air drones late last year in Cambridgeshire. Inside the Amazon fulfillment centre in Hertfordshire (Photo: Nick Ansell/PA Wire) Share", "external_links": [], "published": "2017-02-03T15:00:00.000+02:00", "crawled": "2017-02-03T10:37:08.408+02:00", "highlightTitle": ""}