{"organizations": [], "uuid": "f7af7fda418832ef4759ae17c4f059580b033341", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12642473.ece/ALTERNATES/s1200/Brexit.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/theresa-under-fire-over-threat-12642369", "country": "GB", "domain_rank": 21960, "title": "Theresa May under fire over threat to leave the EU without a trade deal", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Theresa May under fire over threat to leave the EU without a trade deal", "spam_score": 0.0, "site_type": "news", "published": "2017-02-22T23:23:00.000+02:00", "replies_count": 0, "uuid": "f7af7fda418832ef4759ae17c4f059580b033341"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/theresa-under-fire-over-threat-12642369", "ord_in_thread": 0, "title": "Theresa May under fire over threat to leave the EU without a trade deal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "News Theresa May under fire over threat to leave the EU without a trade deal North East MP challenges Prime Minister over Brexit in the House of Commons after she says we could leave without a deal. Share Theresa May, who was given a fresh warning about the difficulties she will face in Brexit negotiations with Europe as peers prepared for battle with ministers over the Article 50 Bill (Photo: PA) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nPrime Minister Theresa May has come under fire over her threat to quit the EU without a trade deal rather than to agree to a “bad” deal. \nMrs May said in January that “no deal for Britain is better than a bad deal for Britain”. \nBut County Durham MP Phil Wilson contrasted that stand with her apparent determination to agree a trade deal with the US, as he questioned her in the House of Commons. \nAnd the UK’s former ambassador to the EU said a “cliff-edge” Brexit with no exit deal would be “insane” and economically damaging for the European Union and Britain. \nSpeaking during the Prime Minister’s weekly question and answer session, Mr Wilson referred to a speech delivered by Mrs May at Lancaster House, London, in January. \nHe said: “In the Prime Minister’s Lancaster House speech, she said of a future trade agreement with the EU, ‘no deal for Britain is better than a bad deal for Britain’. \n“In the spirit of consistency, will that rule also apply to any future trade negotiations with the United States of America, where President Trump has said that America comes first?” European workers including nurses, social workers and teaching assistants protest outside the Houses of Parliament in London before lobbying MPs over their right to remain in the UK (Photo: PA) \nShe told him: “I have said consistently, we will be ensuring that when we negotiate trade deals with whichever countries around the world, they will be good deals for the UK.” \nMeanwhile, Sir Ivan Rogers, who quit as the UK’s ambassador to the EU in January, said the consequences of the UK falling into a “legal void and relying on World Trade Organisation rules would be “nuts” and both parties need to strike a deal. \nAppearing before the Commons Brexit Select Committee, he pointed out that Bank of England governor Mark Carney has said such a scenario could pose a risk to eurozone stability. Read More The high price Sunderland and Newcastle could pay for Brexit revealed \nSir Ivan said: “There are other consequences in other sectors which would make it an insane thing to do.” \nHe added: “This (the EU) is a very legalistic body that we are dealing with and they will say you have transformed yourselves overnight from having been a member of this body to a third country outside the body and in the absence of a new legal agreement everything falls away. \n“We all know that that’s nuts in the real world, because why would you want to stop UK planes flying into European airports. \n“We know that this is insanity.” Video Loading Click to play Tap to play The video will start in 8 Cancel Play now", "external_links": [], "published": "2017-02-22T23:23:00.000+02:00", "crawled": "2017-02-22T18:41:51.888+02:00", "highlightTitle": ""}