{"organizations": [], "uuid": "c27949e66160461df0968cd5133fd368834defd1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article11776537.ece/ALTERNATES/s1200/JS96605886.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12578338", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Tax changes will 'squeeze rents higher'", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast LIVE: Tax changes will 'squeeze rents higher'", "spam_score": 0.0, "site_type": "news", "published": "2017-02-09T14:55:00.000+02:00", "replies_count": 0, "uuid": "c27949e66160461df0968cd5133fd368834defd1"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12578338", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Tax changes will 'squeeze rents higher'", "locations": [], "entities": {"persons": [{"name": "nick wells", "sentiment": "none"}, {"name": "whistl", "sentiment": "none"}, {"name": "blyth", "sentiment": "none"}, {"name": "dilma rousseff", "sentiment": "none"}, {"name": "reece", "sentiment": "none"}, {"name": "torsten bell", "sentiment": "none"}, {"name": "bolton", "sentiment": "none"}, {"name": "john reece", "sentiment": "none"}, {"name": "tiago raupp", "sentiment": "none"}, {"name": "thomas cook", "sentiment": "none"}, {"name": "peter fankhauser", "sentiment": "none"}, {"name": "fankhauser", "sentiment": "none"}, {"name": "andrew witty", "sentiment": "none"}, {"name": "emma walmsley", "sentiment": "none"}, {"name": "simon rubinsohn", "sentiment": "none"}, {"name": "andrew", "sentiment": "none"}, {"name": "laith khalaf", "sentiment": "none"}, {"name": "peter mccusker", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "portugal", "sentiment": "none"}, {"name": "logistics north", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "blyth power station", "sentiment": "none"}, {"name": "greece", "sentiment": "none"}, {"name": "whistl", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "leeds", "sentiment": "none"}, {"name": "turkey", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "bolton", "sentiment": "none"}, {"name": "advair", "sentiment": "none"}, {"name": "egypt", "sentiment": "none"}, {"name": "teesside park", "sentiment": "none"}, {"name": "canary islands", "sentiment": "none"}, {"name": "majorca", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "brazil", "sentiment": "none"}, {"name": "northumberland county", "sentiment": "none"}, {"name": "cyprus", "sentiment": "none"}, {"name": "croatia", "sentiment": "none"}, {"name": "bulgaria", "sentiment": "none"}, {"name": "north sea", "sentiment": "none"}], "organizations": [{"name": "petrobras", "sentiment": "none"}, {"name": "blyth power station", "sentiment": "none"}, {"name": "nof energy", "sentiment": "none"}, {"name": "glaxosmithkline", "sentiment": "none"}, {"name": "early careers programme", "sentiment": "none"}, {"name": "environment agency", "sentiment": "none"}, {"name": "bolton council", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "gsk", "sentiment": "none"}, {"name": "north east combined authority", "sentiment": "none"}, {"name": "north east local enterprise partnership", "sentiment": "none"}, {"name": "rics", "sentiment": "none"}, {"name": "arch", "sentiment": "none"}, {"name": "dfs", "sentiment": "none"}, {"name": "warrington", "sentiment": "none"}, {"name": "reece group", "sentiment": "none"}, {"name": "armstrong works", "sentiment": "none"}, {"name": "northumberland county council", "sentiment": "none"}, {"name": "royal institute of chartered surveyors", "sentiment": "none"}, {"name": "resolution foundation", "sentiment": "none"}, {"name": "hargreaves lansdown", "sentiment": "none"}, {"name": "east sleekburn enterprise zone", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "9:05 Millennial men 'earning thousands less than previous generation' \nYounger men are suffering from “stunted” progress on pay, earning thousands of pounds less than the previous generation, a study shows. \nResearch by the Resolution Foundation found that men aged 22 to 30 had a pay deficit of £12,500 compared with those born between 1966 and 1980. This has narrowed the gender pay gap, but for the wrong reasons, said the think tank. \nThe analysis revealed a shift towards younger men working in lower-skilled jobs, often part-time, which was given as the main reason for the slower pay growth. \nThe proportion of low-paid work done by young men has increased by 45% since 1993, compared with a fall among young women, said the report. \nThe foundation said that while the overall story of the UK labour market over the two last decades has been a positive shift away from low and mid-skilled jobs into more high-skilled ones, young men have not fully benefited. \nTorsten Bell, executive director at the Resolution Foundation, said: \n“The long-held belief that each generation should do better than the last is under threat. Millennials (those born between 1981 and 2000) today are the first to earn less than their predecessors. \nWhile that in part reflects their misfortune to come of age in the midst of a huge financial crisis, there are wider economic forces that have seen young men in particular slide back. \nMillennial men have earned less than the generation before them in every year of their working lives - a pay deficit that adds up to £12,500 by the time they reach 30. \nThis is in part due to major shifts in the world of work with many more young men moving into lower-skilled jobs in shops and restaurants, and doing many of those jobs part-time. \nThe fact that young women have bucked this trend by moving overwhelmingly into higher-skilled roles is welcome and suggests that the disruptive force of automation has met its match in the forward march of education and feminism. Men are earning less than the previous generation 9:00 Postal firm Whistl to open new depot and create 100 jobs \nPostal operator Whistl is to move into a new depot for its northern operations, creating at least 100 jobs. \nThe company has taken a 10-year lease on a development in Bolton - the seventh deal at the site in the past three years. \nWhistl said it will consolidate existing operations in Leeds and Warrington onto one site that has 33% greater capacity for future expansion of its existing mail, packet and parcel and ecommerce business. \nNick Wells, chief executive of Whistl, said: \nWe are delighted to confirm that we are investing in this grade A facility at Logistics North in Bolton. \nThe new depot will enable us to provide an excellent working environment for our colleagues as well as enable us to continue providing high quality and efficient services to our customers. \nWe look forward to working with Bolton Council on recruiting people to work at Whistl in the coming months. Whistl is looking to create 100 new jobs as it opens depot in Bolton 8:50 Plans to turn Blyth Power Station site into jobs hub take major leap forward \nThe first phase of plans to turn the site of a former North East power station into an employment zone , with the potential to create hundreds of jobs, have been approved. \nNorthumberland development group Arch is leading the drive to re-claim the former Blyth Power Station site and transform it into the East Sleekburn Enterprise Zone, which it hopes will become an employment hub for the marine, energy, oil and gas sectors. \nThe Northumberland County Council-backed organisation acquired the site in May 2016, immediately embarking on a a major regeneration programme. \nWith plans to market the site, Arch needs to prepare it for new investment by removing the last remnants of the power station operation and upgrading a dock on the site. \nNow the first phase of plans have been approved by Northumberland County Council, in collaboration with the Environment Agency and Natural England. \nArch says the strategic site is targeted for significant economic growth and future jobs, being one of a few sites capable of providing a premier UK location for energy and offshore industries, while also complementing the Port of Blyth’s reputation as a hub port on the east coast. \nAs well as its own investment, Arch has secured funding from Northumberland County Council, the North East Local Enterprise Partnership and the North East Combined Authority to carry out the first phase of works to make the site ready for development. \nArch will next procure a contractor to carry out the work, including earthworks operations to reclaim the land to create a 16 hectare development site, which will create significant jobs and investment in the area. The former Blyth power station site, set to be marketed to businesses within the offshore industry 8:42 KEY EVENT Opportunities for North East companies in the Brazilian oil market \nThe Brazilian oil industry has been in turmoil in recent years following the ‘Car Wash’ corruption scandal which resulted in the fall of the country’s President Dilma Rousseff and the freezing of millions of pounds of investment. \nBut Brazilian oil executives who touched down in the North East last week said they are at the dawning of a new era , with state-owned oil company Petrobras set to spend some $74bn between now and 2021. \nThis should provide huge opportunities for the UK and North East offshore supply chain, delegates to an NOF Energy event in Durham heard last week. \nTiago Raupp, a subsea category manager for Petrobras, says the company is currently working on 10 projects which involved some 12,000 contracts and total £26bn. \nHe said the Brazilian market was opening up to new suppliers: \nWe are trying to develop our base of suppliers and are open-minded in dealing with companies across the world. \nThese can help us change our technical specifications and allow for the technologies which have been fundamental to the North Sea to be deployed in Brazil. \nWe expect to see some huge changes over the next few years. \nThe corruption scandal has its origins in one of the largest ever discoveries in what is known as the pre-salt basin off the coast of Brazil. These contain some 80bn barrels of reserves - equivalent to the total recovered and remaining reserve of the North Sea. \nThe pre-salt lies under a two-kilometre-thick layer of salt, which is itself under the ocean, and presents one of the toughest exploration challenges the global industry has faced. \nAt the time of the discovery the ruling Left-wing party opted to make Petrobras the sole-operator, freezing out foreign participation in a move which also led to the imposition of strict local content rules. \nAs a result, costs spiralled and were worsened by politicians, colluding with executives, to syphon off over $100m into Swiss back accounts. The Brazilian oil industry will invest almost $74bn between now and 2021 (Photo: Peter McCusker) 8:35 Thomas Cook: where are people travelling to \nThomas Cook said Greece was now its “stand-out” destination, with 2.5m holidaymakers booked for this summer, which has seen a recovery back to levels of 2014 before the refugee crisis in Kos and wider Greek financial woes of recent years. \nDemand for destinations such as Cyprus, Bulgaria, Portugal and Croatia is also strong, according to the group. This is helping offset the tougher market in Spain, in particular Majorca and the Canary Islands, with hotels increasing prices by 6% to 8% after seeing surging demand last year. \nMr Fankhauser said there was no sign that Britons had been put off foreign holidays by the weak pound, but added that there has been a drop in demand for trips to the United States largely due to the strength of the dollar against the pound. \nSterling has sunk to 31-year lows against the US dollar since the Brexit vote. Bookings overall across the group are 1% higher for the current winter season and 9% higher for summer 2017, with just under a third of holidays sold. \nIn the UK, winter bookings are 5% higher, with prices 1% lower, while it said average selling prices are 9% higher for the summer. \nShares in Thomas Cook fell 6% after the update. Laith Khalaf, senior analyst at Hargreaves Lansdown, said: \nTimes are tough in the European travel industry and Thomas Cook isn’t having the best of it, though the good news is things don’t seem to be getting any worse. A Thomas Cook airline 8:30 Thomas Cook cautious for 2017 despite 'solid' start to the new year \nTravel giant Thomas Cook has cheered a “solid” start to its new year, but said it remains cautious for 2017 and revealed a blow from intense competition to popular Spanish island resorts. \nThe group said underlying operating losses improved by 2% on a like-for-like basis to £49 million in its typically quieter quarter to the end of December. \nIt said it was seeing strong demand for holidays to Greece, with bookings up 40% as it has boosted its offering to the country as part on a switch away from Turkey and Egypt after political instability and terrorist attacks. \nBut UK bookings for this year’s key summer season were largely flat - up 1% overall - as it comes under pressure from rivals in the Spanish island market. \nPeter Fankhauser, chief executive of Thomas Cook, said: \nA combination of hotel price inflation and increased air capacity has intensified competition for the Spanish islands. \nHe added the group would not be drawn into a price war and had “taken a deliberate decision to focus on higher margin, quality holidays”. \nWhile the group had put in a “solid performance” overall in the first quarter, he said Thomas Cook remains “cautious about the rest of the year, given the uncertain political and economic outlook”. A Thomas Cook plane KEY EVENT Reece Group invests in innovative engineering talent of the future \nA leading North East engineering group has launched a new programme as part of its mission to invest in the long-term future of the business. \nNewcastle-based Reece Group has launched its first Early Careers Programme, which sees six new graduate recruits joining five existing employees from across the group’s companies, who are still in the early stages of their careers. \nDuring the two-year programme, the recruits will gain experience in sectors ranging from defence to aerospace and take part in workshops to support their professional development. \nThey will also take part in an Innovation Challenge set by the group’s founder and chairman, John Reece MBE, and must find solutions to specific engineering problems, balancing technical and business considerations. \nMr Reece said: \nAs a business, we need to be thinking about providing innovative solutions for our customers and about future problems they may face. \nWe want innovation to be a driving force within the group and I hope this challenge will help the participants on the programme to think differently and creatively about engineering right from the start of their careers. \nReece Group, based in the Armstrong Works in Newcastle , is a holding company for a number of engineering firms that operate across the globe in an ever-diversifying range of markets. Reece Group Chairman, John Reece, launches his Innovation Challenge (Photo: Reece Group) 8:20 DFS 'well position to face economic headwinds' as sales rise 7% \nSofa chain DFS has said sales continued to rise in the first half of the year and it is well positioned to weather any potential dip in consumer confidence. \nDFS said gross sales in the 26 weeks to January 28 rose by 7%, with an encouraging contribution from its Dwell and Sofa Workshop brands. But in a first-half trading update, it also warned of an “increased risk” of a market slowdown. \nThe company said: \nWe recognise that in 2017 the retailing of furniture in the UK faces an increased risk of a market slowdown given the uncertain outlook for consumer confidence. \nHowever, with its resilient operating model we believe the group remains very well positioned to respond to economic headwinds and cost pressures whilst achieving continued growth in its share of the UK retail furniture market. \nThe Doncaster-based group said it is working to mitigate the impact of the weak pound by negotiating better deals with suppliers. DFS said: \nAs we anticipated at the time of our preliminary results announcement in October, we saw some impact on product margins in the first half from the impact of adverse foreign exchange movements. \nWe continue our work to actively offset this impact through range management and supplier negotiations, while the differentiated DFS sourcing model of vertical integration, UK manufacturing capability and superior scale remains an important competitive advantage. \nThe collapse in the value of the pound following the Brexit vote has ramped up costs for British businesses and started to impact profit margins. The retailer said its expectations for full-year pre-tax profit remain unchanged. DFS store at a Teesside Park shopping centre 8:15 \nThe FTSE-100 index opened at 7188.82. \nThe pound at 8am was 1.2511 dollars compared to 1.2542 dollars at the previous close. \nThe euro at 8am was 0.8534 pounds compared to 0.8539 pounds at the previous close. 8:12 KEY EVENT GlaxoSmithKline reveals earnings boost from Brexit-hit pound \nGlaxoSmithKline (GSK) has revealed a boost to annual earnings from the Brexit-hit pound but warned over a potential hit from looming competition to its blockbuster asthma drug. \nThe FTSE 100 drugs giant, which has a major facility in the North East but makes a significant amount of its earnings overseas, posted a 36% surge in underlying operating profits to £7.8bn for 2016 thanks to the pound’s plunge since the EU referendum. \nIt said it hopes to make “continued progress” in 2017 but cautioned over “uncertainty” if US regulators allow generic competitors to its asthma drug Advair. \nThe group said if generic competition to Advair launched in the US in the summer, it could wipe out earnings growth and even leave earnings per share lower. \nOutgoing chief executive Sir Andrew Witty said: \nClearly, this year we face some uncertainty as to the level of our earnings performance, given the possibility of substitutable generic competition to Advair in the US. \nBut the group is hoping its new asthma medicines will help offset the sales blow, with Sir Andrew adding: \nWhilst there will be an inevitable financial impact to absorb, we fully expect to maintain leadership in this therapy area given our new product portfolio and the innovation we have in our pipeline. \nPresenting his last set of results, Sir Andrew unveiled a 17% surge in annual revenues to £27.8bn and a 21% leap in the fourth quarter. With the benefit of the weak pound on overseas earnings stripped out, full-year revenues were 6% higher, while operating profits lifted 14%. \nThe group said, based on current exchange rates, the weak pound would increase turnover by around 6% this year. \nAdvair lost patent protection in 2010 but generic versions have yet to receive regulatory approval. The drug has already come under pressure from competition, with sales dropping by 13% to £1.8bn in the US over 2016, although GSK said new respiratory products generated sales of £1.05bn. \nThe group said if generic competition is given the all clear to launch mid-year, it could slash annual Advair sales in the US to around £1bn. Shares fell as much as 3% at one stage on warnings over Advair. \nSir Andrew will hand over the reins to the group’s former consumer healthcare boss, Emma Walmsley, in March. GlaxoSmithKline CEO Sir Andrew Witty, who has announced that he is stepping down (Photo: Andrew Milligan/PA Wire) 8:05 KEY EVENT Rents to increase as landlords ditch properties \nNew tax changes enforced by the Government could lead to rents being ‘squeezed’ higher, according to a recent survey. \nThe Royal Institute of Chartered Surveyors (RICS) has predicted that landlords will reduce their property portfolios as renting property becomes less attractive to investors. \nLast April’s changes to Stamp Duty and the scheduled cuts to mortgage interest tax relief are expected to deter landlords from owning properties. \nOver the three months leading to January more people have been demanding to live in rental properties across the country. The imbalance is set to cause rents to rise over the next five years. \nHowever, the RICS has warned that the predictions are based on a survey carried out before the Government released its recent Housing White Paper. \nSimon Rubinsohn, RICS chief economist said: \nThe scale of the challenge Government faces as it announces its new approach to housing is clearly demonstrated in the results from our latest survey. \nNot only are the headline price and rent series pointing to further increases over the course of this year, but more significantly, the medium term view of RICS professionals working up and down the country is that both house prices and rents will over the medium term continue to grow at a faster pace than wages putting even greater pressure on affordability. \nWhether the measures announced can ease this this trend remains to be seen. Rents are expected to soar as landlords dump their properties (Photo: Joe Giddens/PA Wire) Share", "external_links": [], "published": "2017-02-09T14:55:00.000+02:00", "crawled": "2017-02-09T11:23:21.148+02:00", "highlightTitle": ""}