{"organizations": [], "uuid": "a31db68b79cd22e24a3838332366bacaddc2a26f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12548621.ece/ALTERNATES/s1200/JBR_NJL_080715forum.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/dynamic-north-east-businesses-need-12548811", "country": "GB", "domain_rank": 21960, "title": "Dynamic North East businesses need better support, new report suggests", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Dynamic North East businesses need better support, new report suggests", "spam_score": 0.0, "site_type": "news", "published": "2017-02-03T07:01:00.000+02:00", "replies_count": 0, "uuid": "a31db68b79cd22e24a3838332366bacaddc2a26f"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/dynamic-north-east-businesses-need-12548811", "ord_in_thread": 0, "title": "Dynamic North East businesses need better support, new report suggests", "locations": [], "entities": {"persons": [{"name": "izzy hatfield", "sentiment": "none"}, {"name": "gillian marshall", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "south east", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "north west", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "jeremie", "sentiment": "none"}, {"name": "entrepreneurs’ forum", "sentiment": "none"}, {"name": "british business bank", "sentiment": "none"}, {"name": "ippr", "sentiment": "none"}, {"name": "enterprise investment scheme", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Dynamic North East businesses need better support, new report suggests North East has more high growth companies than London based on its number of businesses Share Gillian Marshall (Photo: publicity picture) Share Get business updates   \nA call has been made for better support to the North East’s business community after new figures showed it is one of the most dynamic regions of the UK. \nFigures obtained by the think-tank IPPR show that the North East has the second highest ratio of high-growth enterprises for the number of businesses in the region. \nDespite that appetite for growth in the North East, many forms of business support - including equity, bank lending and Government grants - are disproportionately going to London and the South East. \nIPPR is now calling on the Government to give the British Business Bank a specific objective of supporting businesses outside of London to kickstart the work of small, high growth firms across the country. \nIt also wants a review of the Enterprise Investment Scheme and Seed Enterprise Investment Scheme to make sure high growth businesses outside of London, which find it hardest to get finance, benefit from public support. \nIzzy Hatfield, economic analyst at IPPR, said: “This research challenges the idea that only London is the crucible of our best and most exciting small, high growth businesses. \n“In fact they exist across the UK. Everyone recognises the importance of supporting them to deliver a dynamic post-Brexit economy, but we show that the Government needs to do much more to help those outside of London access the finance they need to grow.” \nThe IPPR report has identified 12,000 high-growth businesses in the UK, 380 of which are in the North East. \nWhile the North East has the second lowest ratio of growing firms in terms of its population, it has the second highest - above London and second only to the North West - in terms of high-growth enterprises per 10,000 businesses. \nThe report also finds that businesses with growth ambitions are more likely to have their applications for bank lending rejected, and are more likely to be discouraged from applying for loans in the first place, due to the extra perceived risk they face. \nGillian Marshall, chief executive of the Entrepreneurs’ Forum, which supports growing businesses in the region, said: “The North East is proving to be an ideal location to deliver impressive business growth and these figures demonstrate how attractive the region is for companies and those considering opportunities for inward investment. \n“However, more needs to be done to redress the balance to encourage more scale-up activity from North East entrepreneurs and make investors look at opportunities in places other than London and the South East. \n“The support of the LEPs and the region’s universities, together with existing finance options, such as the Jeremie funds, are helping to create the right environment for businesses in the region, but imagine what sort of additional contribution the North East could make to the economy if greater finance and support was available to our entrepreneurs.” Like us on Facebook", "external_links": [], "published": "2017-02-03T07:01:00.000+02:00", "crawled": "2017-02-03T02:35:23.710+02:00", "highlightTitle": ""}