{"organizations": [], "uuid": "cdf39f3cf52db7926b33aee4d5cff56a088d2152", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.liverpoolecho.co.uk/incoming/article12040031.ece/ALTERNATES/s1200/JS101136905.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/mps-say-yes-brexit-historic-12578136", "country": "GB", "domain_rank": 21960, "title": "MPs say YES to Brexit in historic Commons vote - but two North East MPs stood against the Bill", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "MPs say YES to Brexit in historic Commons vote - but two North East MPs stood against the Bill", "spam_score": 0.0, "site_type": "news", "published": "2017-02-09T04:30:00.000+02:00", "replies_count": 0, "uuid": "cdf39f3cf52db7926b33aee4d5cff56a088d2152"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/mps-say-yes-brexit-historic-12578136", "ord_in_thread": 0, "title": "MPs say YES to Brexit in historic Commons vote - but two North East MPs stood against the Bill", "locations": [], "entities": {"persons": [{"name": "mrs may", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "bill", "sentiment": "none"}, {"name": "chi onwurah", "sentiment": "none"}, {"name": "lewis", "sentiment": "none"}, {"name": "clive lewis", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "ken clarke", "sentiment": "none"}, {"name": "catherine mckinnell", "sentiment": "none"}, {"name": "westminster", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "norwich", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "bill the houses of parliament", "sentiment": "negative"}, {"name": "labour", "sentiment": "none"}, {"name": "norwich south", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "energy", "sentiment": "none"}, {"name": "newcastle central", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}, {"name": "snp", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "bill - newcastle north", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "house of lords", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The Houses of Parliament in Central London Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nAny prospect of MPs blocking Brexit has now gone, after the Commons voted to approve legislation allowing the process to begin. \nThe Government’s European Union (Notification of Withdrawal) Bill 2016-17 received its third reading in the House of Commons, when MPs voted in favour of the Bill by 494 to 122, a majority of 372 in favour. \nSenior Labour MP Clive Lewis resigned from his role as the party’s Shadow Business Secretary so that he could vote against the Bill - after party leader Jeremy Corbyn ordered his MPs to back it. \nTwo North East MPs voted against the Bill - Newcastle North MP Catherine McKinnell and Newcastle Central MP Chi Onwurah , both Labour MPs. \nIt followed a series of votes on amendments to the legislation, including some which would have forced the Prime Minister to make regular reports to Parliament about the progress of negotiations with the EU, or to hold a second referendum. \nBut the amendments were all defeated. They included an attempt to ensure that EU citizens legally in the UK can stay after Brexit, which was rejected by 332 votes against to 290 in favour. MP Catherine McKinnell \nIn the end, MPs voted for a short and simple Bill which gives the Theresa May the power to trigger Article 50, beginning the process of Brexit, without imposing any restrictions or conditions on her. \nConservative MPs backed the legislation with the one exception of Ken Clarke, the former Chancellor and dedicated supporter of the EU. \nLabour leader Jeremy Corbyn also ordered his MPs to vote for the Bill, and most did. \nLiberal Democrats and the SNP, who had called for a second referendum, both voted against the legislation. \nThe Bill will now go to the House of Lords for further discussion. \nPeers in the House of Lords could add amendments of their own - potentially leading to more debate in the Commons, when MPs discuss whether to accept the Lords amendments. However, by backing the Bill on its third reading, MPs have passed up their chance to stop the Bill in its tracks. Newcastle MP Chi Onwurah \nOnce both Houses of Parliament have completed their debates and votes, the Bill will go to the Queen to be rubber-stamped, and the process of Brexit can begin. \nIn practice, however, Mrs May may be forced to delay detailed talks until after French presidential elections in April - possibly continuing into early May - and German elections in September. \nTraditionally, Europe has been a source of deep division for the Conservative Party. But with a small number of exceptions, Tories who campaigned for “remain” in last June’s EU referendum have accepted the Prime Minister’s argument that Brexit is now inevitable and the Government has a duty to make a success of it. Read More Brexit Britain will leave the single market: North East reaction to Theresa May's speech \nInstead, it is Labour that has suffered deep divisions over Brexit. Labour leader Jeremy Corbyn ordered MPs to back the Government’s Bill, leading to the resignation of Clive Lewis, Labour’s Shadow Business, Energy and Industrial Strategy Secretary. \nMr Lewis quit the Shadow Cabinet, saying: “When I became the MP for Norwich South, I promised my constituents I would be ‘Norwich’s voice in Westminster, not Westminster’s voice in Norwich’. I therefore cannot, in all good conscience, vote for something I believe will ultimately harm the city I have the honour to represent, love and call home. \n“It is therefore with a heavy heart that I have decided to resign from the shadow cabinet.” Video Loading Click to play Tap to play The video will start in 8 Cancel Play now", "external_links": [], "published": "2017-02-09T04:30:00.000+02:00", "crawled": "2017-02-09T00:26:45.766+02:00", "highlightTitle": ""}