{"organizations": [], "uuid": "f71b78cc62033ad181e7070071907256e81d91e5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article10261067.ece/ALTERNATES/s1200/JS39046607.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/free-ports-could-help-bring-12614923", "country": "GB", "domain_rank": 21960, "title": "Free ports could help bring jobs to the North East, think-tank claims", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Free ports could help bring jobs to the North East, think-tank claims", "spam_score": 0.0, "site_type": "news", "published": "2017-02-16T23:00:00.000+02:00", "replies_count": 0, "uuid": "f71b78cc62033ad181e7070071907256e81d91e5"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/free-ports-could-help-bring-12614923", "ord_in_thread": 0, "title": "Free ports could help bring jobs to the North East, think-tank claims", "locations": [], "entities": {"persons": [{"name": "lawlor", "sentiment": "none"}, {"name": "peter bould", "sentiment": "none"}, {"name": "ippr north", "sentiment": "none"}, {"name": "harrison", "sentiment": "none"}, {"name": "hull", "sentiment": "none"}, {"name": "david harrison", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "martin lawlor  martin lawlor", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "tyneside", "sentiment": "none"}, {"name": "liverpool", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "teesside", "sentiment": "none"}], "organizations": [{"name": "blyth chef executive", "sentiment": "none"}, {"name": "port of blyth", "sentiment": "none"}, {"name": "northern powerhouse", "sentiment": "none"}, {"name": "true potential", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "transport for the north", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "A view over the Port of Tyne Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nFree ports should be opened across the North East to help bring new jobs and manufacturers to the region, a leading think-tank has claimed. \nFree ports, or Free Trade Zones as they are sometimes known, are areas where manufacturers can import, process, and export products without facing tariffs. \nEU rules mean that the UK is not currently allowed to have free ports but Newcastle technology entrepreneur David Harrison, who sits on the board of think-tank Policy North, has called on the Government to open free trade zones after Brexit. True Potential CEO David Harrison (Photo: Peter Bould) \nMr Harrison, who is managing partner of financial services firm True Potential, said: “The US has more than 250 free trade zones, employing 420,000 people and handling $750bn of merchandise. \n“How many free ports are there in the UK? The answer is zero. EU competition and state aid rules, in effect, prevent us from having Free Ports, despite Britain’s manufacturing, trading and maritime heritage. \n“ Brexit will set us free .” \nMr Harrison’s intervention is the latest in a number of recent bids to boost the role of ports in developing the North East’s economy. \nLast year a report issued by think-tank IPPR North last year claimed that ports in the North could be a key player in growing the economy if suitable investment was made in east-west road and rail links, while the Transport for the North group has also highlighted the potential of the region’s ports. Port of Blyth Chef Executive Martin Lawlor \nMartin Lawlor, chief executive at Port of Blyth , has welcomed the idea of introducing free ports to the North East and also backed a plan from the British Ports Associations to introduce ‘ports zones’ which fast track the development of infrastructure for shipping sites. \nHe said: “I think they are a very good idea. There are a number of ports that have duty deferment whereby goods can enter the country, sit in port areas and not pay duty until they are released into the country, but it doesn’t allow the full range of stuff that free ports and port zones would do. Read More Ports could provide huge boost to Northern economy, report says \n“You might have manufacturing going, then assembling and exporting. Free ports could really be one of the things that helps to avoid excessive costs that might come out of Brexit. I think it’s a very good thing.” \nMr Lawlor warned, however, that the introduction of free ports could benefit the south and west coasts of the UK more than the North East, as that is where most deep sea container vessels after travelling from places like the US. Read More Brexit will strengthen the Northern Powerhouse, according to a government minister \nLast year port operators on Tyneside and Teesside joined forces with their counterparts in Liverpool and Hull to draw up a Northern Ports Strategy that aims to create new jobs in and around ports, and boost investment in the Northern logistics network. \nThe report called for increased public investment to bring the best out of the region’s port facilities. Like us on Facebook", "external_links": [], "published": "2017-02-16T23:00:00.000+02:00", "crawled": "2017-02-16T18:34:42.842+02:00", "highlightTitle": ""}