{"organizations": [], "uuid": "bab1689ba5969f9978c023913aa6d86aa33a23c2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12466183.ece/ALTERNATES/s1200/PNP_NEC_290415debate_007JPG.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/i-voted-against-brexit-because-12547623", "country": "GB", "domain_rank": 21960, "title": "'I voted against Brexit because it would be bad for the North East'", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "'I voted against Brexit because it would be bad for the North East'", "spam_score": 0.0, "site_type": "news", "published": "2017-02-03T01:00:00.000+02:00", "replies_count": 0, "uuid": "bab1689ba5969f9978c023913aa6d86aa33a23c2"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/i-voted-against-brexit-because-12547623", "ord_in_thread": 0, "title": "'I voted against Brexit because it would be bad for the North East'", "locations": [], "entities": {"persons": [{"name": "catherine mckinnell", "sentiment": "negative"}, {"name": "brexit", "sentiment": "negative"}, {"name": "bill", "sentiment": "none"}, {"name": "jack", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "mckinnell", "sentiment": "none"}, {"name": "brexit bill", "sentiment": "none"}, {"name": "nigel farage", "sentiment": "none"}, {"name": "ken clarke", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}, {"name": "wales", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "committee", "sentiment": "none"}, {"name": "newcastle north", "sentiment": "none"}, {"name": "european union (notification of withdrawal", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "whitehall", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "conservative and labour", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}, {"name": "supreme court", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "'I voted against Brexit because it would be bad for the North East' Newcastle MP Catherine McKinnell was the only MP in the region to vote against Brexit legislation Share Catherine McKinnell (Photo: Newcastle Chronicle) Share Get     \nNewcastle MP Catherine McKinnell has explained why she voted against allowing Brexit to go ahead. \nMs McKinnell, MP for Newcastle North, was the only North East MP to vote against the European Union (Notification of Withdrawal) Bill - the legislation allowing Prime Minister Theresa May to trigger Article 50 and begin the process of quitting the EU. \nShe said MPs were asked to vote for a Bill “which would effectively give the Prime Minister a blank cheque to press ahead with leaving the EU in a way that I believe could be enormously damaging for Newcastle, the wider North East and indeed the country”. \nAnd she insisted: “This was not a vote against triggering Article 50 altogether – just a vote against triggering Article 50 at this stage without what I believe to be much needed clarity and safeguards in place.” \nMPs approved the legislation by 498 votes to 114, a majority in favour of 384, on Wednesday night’s vote. \nIt means the Bill has received its ‘second reading’, and next week there will be further debates allowing MPs to attempt to amend the legislation. \nThe official position of both the Conservative and Labour parties was to support triggering Article 50. But 47 Labour MPs rebelled, along with one Conservative, former Chancellor Ken Clarke. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now Share this video Watch Next \nMs McKinnell said she feared the Government was failing to take the needs of the North East into account as it continued with Brexit, and said she planned to support an amendment next week demanding consultation with local politicians in the English regions. \nShe pointed out that Newcastle actually voted to remain in the EU by a narrow margin, 50.7% to 49.3%, in last year’s referendum. Read More Brexit plan at a glance: What it means for workers' rights, immigration and air travel \nThe MP said: “Despite the fact that seven months have now passed since the referendum result, I remain hugely concerned about the lack of transparency around this monumentally important and historic process; about the Government’s proposed approach to the negotiations – including ruling out, before the negotiations have even begun, remaining within the single market (which will have an enormous impact on the North East’s economy); and about the Government’s continued failure to explain how they will engage with the North East to ensure the issues which will particularly affect our region will be taken into account as part of the negotiations – despite making clear commitments to do so for Scotland, Wales and Northern Ireland.” \nMPs had been asked to vote on the second reading of the Bill before the Government published its White Paper setting out detailed Brexit plans, she said. A Union Jack flag flutters in front of Big Ben (Photo: Getty Images Europe) \n“As the Supreme Court ruled last week that when and whether the Prime Minister should be able to trigger Article 50 is for Parliament to vote on, I had to make a decision on what I felt was right at this stage, in my role as the elected representative of Newcastle North. \n“I therefore took the decision that I should vote against the Government’s Bill enabling Article 50 to be triggered at this stage, before we have a significantly more detailed plan and strategy in place and before we head down a – potentially irreversible – path that could do irreparable damage to our area and the country.” \nMs McKinnell added: “I have now tabled an amendment to the legislation for consideration at Committee stage in the Commons next week (the next part of the Parliamentary process), which calls on the Government to set out how it intends to engage and consult with regions in England – including the North East – throughout the Article 50 process. Read More Brexit Bill: 'People in the street are asking me if they'll be deported from Newcastle', MP says \n“I simply do not think it is acceptable for the Government to pursue these negotiations without consideration of how their strategy will affect different parts of the country, and nor is it good enough that this assessment should be made by civil servants in Whitehall.” \nReaction to her decision was mixed. \nOne comment directed to the MP on Twitter said: “History will prove you did the right thing stood up for your beliefs take a bow canny lass.” \nBut former UKIP leader Nigel Farage called the 114 MPs who voted against Brexit “enemies of democracy who should be made to pay the price at the ballot box”. Like us on Facebook", "external_links": [], "published": "2017-02-03T01:00:00.000+02:00", "crawled": "2017-02-02T20:39:02.369+02:00", "highlightTitle": ""}