{"organizations": [], "uuid": "a65ee8ed1c0ea74991709be2e73de2ece6b686cf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12569853.ece/ALTERNATES/s1200/Birmingham-Pride-2015.jpg", "site_section": "http://www.thejournal.co.uk/culture/?service=rss", "section_title": "nechronicle - What's On", "url": "http://www.chroniclelive.co.uk/whats-on/arts-culture-news/your-brain-need-workout-heres-12569741", "country": "GB", "domain_rank": 21960, "title": "Does your brain need a workout? Here's a list of (mostly) free lectures open to all", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Does your brain need a workout? Here's a list of (mostly) free lectures open to all", "spam_score": 0.0, "site_type": "news", "published": "2017-02-08T01:00:00.000+02:00", "replies_count": 0, "uuid": "a65ee8ed1c0ea74991709be2e73de2ece6b686cf"}, "author": "David Whetstone", "url": "http://www.chroniclelive.co.uk/whats-on/arts-culture-news/your-brain-need-workout-heres-12569741", "ord_in_thread": 0, "title": "Does your brain need a workout? Here's a list of (mostly) free lectures open to all", "locations": [], "entities": {"persons": [{"name": "steve cram", "sentiment": "none"}, {"name": "kannez shaid", "sentiment": "none"}, {"name": "catherine merridale", "sentiment": "none"}, {"name": "tyne", "sentiment": "none"}, {"name": "riall", "sentiment": "none"}, {"name": "peter tatchell", "sentiment": "none"}, {"name": "stephen graham", "sentiment": "none"}, {"name": "emma flint vera", "sentiment": "none"}, {"name": "andrew mcgettigan", "sentiment": "none"}, {"name": "dixon", "sentiment": "none"}, {"name": "jeff brown", "sentiment": "none"}, {"name": "rev jeffrey l brown", "sentiment": "none"}, {"name": "look north", "sentiment": "none"}, {"name": "tom cowie", "sentiment": "none"}, {"name": "vera baird", "sentiment": "none"}, {"name": "leon feinstein", "sentiment": "none"}, {"name": "alan watson", "sentiment": "none"}, {"name": "jonathon riall steve cram", "sentiment": "none"}, {"name": "gail-nina anderson", "sentiment": "none"}, {"name": "jenkins", "sentiment": "none"}, {"name": "emma flint", "sentiment": "none"}, {"name": "becky strachan", "sentiment": "none"}, {"name": "lenin", "sentiment": "none"}, {"name": "nicholas cullinan", "sentiment": "none"}, {"name": "peter wadhams", "sentiment": "none"}, {"name": "david hughes", "sentiment": "none"}, {"name": "jennifer richards", "sentiment": "none"}, {"name": "michael jopling", "sentiment": "none"}, {"name": "bill fraser", "sentiment": "none"}, {"name": "mike brown", "sentiment": "none"}, {"name": "prof gould", "sentiment": "none"}, {"name": "chi onwurah", "sentiment": "none"}, {"name": "alistair mccleery", "sentiment": "none"}, {"name": "jeremiah dixon", "sentiment": "none"}, {"name": "phil", "sentiment": "none"}, {"name": "alister scott", "sentiment": "none"}, {"name": "timothy garton ash", "sentiment": "none"}, {"name": "anthony van dyck", "sentiment": "none"}, {"name": "john william", "sentiment": "none"}, {"name": "ann cleeves", "sentiment": "none"}, {"name": "christopher davidson", "sentiment": "none"}, {"name": "kate gould", "sentiment": "none"}, {"name": "dominic wilcox", "sentiment": "none"}, {"name": "tiffany jenkins", "sentiment": "none"}, {"name": "paul smith", "sentiment": "none"}], "locations": [{"name": "united arab emirates", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "presentation hall", "sentiment": "none"}, {"name": "northumbria", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "durham castle", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "boston", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "antarctic", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}, {"name": "great hall", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "cockfield", "sentiment": "none"}, {"name": "maryland", "sentiment": "none"}, {"name": "arctic", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "herschel building", "sentiment": "none"}, {"name": "earth", "sentiment": "none"}, {"name": "delaware", "sentiment": "none"}, {"name": "rio", "sentiment": "none"}, {"name": "petrograd", "sentiment": "none"}, {"name": "northumbria", "sentiment": "none"}, {"name": "laing art gallery", "sentiment": "none"}, {"name": "turkey", "sentiment": "none"}, {"name": "city campus east", "sentiment": "none"}, {"name": "zurich", "sentiment": "none"}, {"name": "egypt", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "usa", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "argentina", "sentiment": "none"}, {"name": "st peter", "sentiment": "none"}, {"name": "poland", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}, {"name": "pennsylvania", "sentiment": "none"}, {"name": "west yorkshire", "sentiment": "none"}, {"name": "curtis auditorium", "sentiment": "none"}, {"name": "westgate road", "sentiment": "none"}], "organizations": [{"name": "newcastle college", "sentiment": "none"}, {"name": "northumbria university", "sentiment": "none"}, {"name": "trustees of citizens uk", "sentiment": "none"}, {"name": "university of sunderland", "sentiment": "none"}, {"name": "newcastle university", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "russian bolsheviks", "sentiment": "none"}, {"name": "bbc", "sentiment": "none"}, {"name": "pierre auger observatory", "sentiment": "none"}, {"name": "lit & phil", "sentiment": "none"}, {"name": "school of physics and astronomy at university of leeds", "sentiment": "none"}, {"name": "university of durham", "sentiment": "none"}, {"name": "newcastle central", "sentiment": "none"}, {"name": "rw mann lecture", "sentiment": "none"}, {"name": "edinburgh napier university", "sentiment": "none"}, {"name": "university of oxford", "sentiment": "none"}, {"name": "jaffa cakes", "sentiment": "none"}, {"name": "durham castle lecture", "sentiment": "none"}, {"name": "national bee unit", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}, {"name": "zayed university", "sentiment": "none"}, {"name": "bmw", "sentiment": "none"}, {"name": "rebuilding every community around peace", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "tyne hospitals nhs foundation trust", "sentiment": "none"}, {"name": "animal and plant health agency’s national bee unit", "sentiment": "none"}, {"name": "british museum", "sentiment": "none"}, {"name": "national portrait gallery", "sentiment": "none"}, {"name": "philosophical society of newcastle", "sentiment": "none"}, {"name": "prospect building", "sentiment": "none"}, {"name": "university of east anglia", "sentiment": "none"}, {"name": "cambridge university", "sentiment": "none"}, {"name": "durham university", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "elgin marbles", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "  Thank you for subscribing!   \nIf one of your New Year resolutions was to give the old grey matter a work-out, treat the following as a gymnasium for the mind. \nListed here are just some of the lectures – the vast majority free – which are open to the North East public in the coming weeks. \nUniversity lecturers and professors are not, it seems, in the business of saving their expert knowledge exclusively for students. \nThrough these public lecture series we are all welcome to benefit from their great learning and insight. \nBut not all the lectures offered by the following educational establishments – plus the venerable Literary and Philosophical Society of Newcastle upon Tyne (Lit & Phil) – are to be delivered by university academics. \nSpeakers also include gay rights campaigner Peter Tatchell; Mike Brown, head of the National Bee Unit; Dr Nicholas Cullinan, director of the National Portrait Gallery; Steve Cram, the BBC’s chief athletics correspondent; and crime writer Ann Cleeves. UNIVERSITY OF DURHAM... Prof Timothy Garton Ash: Free Speech Under Attack \nWednesday, February 8, 8pm \nProf Ash, of the University of Oxford, is the author of nine books charting the transformation of Europe over the past 30 years. \nIn his lecture he will look at what can be done to defend free speech when “from Turkey to Russia, in Egypt, China, Poland and now in the United States”, it is under attack. \n* This Durham Castle Lecture takes place in the Great Hall, Durham Castle. Doors open at 7.30pm and seats are allocated on a first come, first served basis. No ticket required. For the full list of public lectures at University of Durham go to www.dur.ac.uk/whatson/lectures_seminars/ NEWCASTLE UNIVERSITY... Prof Bill Fraser: Give me sunshine \nWednesday, February 8, 5.30pm \nLast summer Public Health England advised the Government that everyone needed the equivalent of 10 micrograms of Vitamin D daily to protect bone and muscle health. Vitamin D is produced by the skin in response to sunlight. The speaker, professor of medicine at the University of East Anglia, will discuss the role of this important vitamin. Peter Tatchell: 1967 and LGBT liberation \nTuesday, February 14, 5.30pm \nFifty years have passed since Parliament passed the Sexual Offences Act, which offered partial decriminalisation of male homosexuality while leaving anti-LGBT laws on the statute book. The high profile human rights campaigner will highlight the iniquities of the system. Rev Jeffrey L Brown: The Courage to Listen \nTuesday, February 21, 5.30pm \nThe speaker, in this Freedom City 2017 Lecture, is a Baptist minister and president of RECAP (Rebuilding Every Community Around Peace), an organisation he established after bringing communities together to reduce gang violence in his home city of Boston, USA. With a book coming out, he will show how to bring people together in conflicted times. Prof Catherine Merridale: Lenin on the Train \nTuesday, February 28, 5.30pm \nIn April 1917, with the First World War raging, the leader of the Russian Bolsheviks took a train from his place of exile in Zurich to Petrograd, the revolutionary Russian capital. As the centenary approaches, the writer and historian recalls “the most momentous train journey in history”. Prof Stephen Graham: The City from Satellites to Bunkers \nThursday, March 2, 5.30pm \nThe speaker, professor of cities and society at Newcastle, explores today’s geography from a vertical perspective as humans excavate deep into the earth and build ever higher into the sky. What does it all say about power and inequality? Mike Brown: Technologies for bee health \nTuesday, March 7, 5.30pm \nMike Brown is head of the Animal and Plant Health Agency’s National Bee Unit which delivers the Government’s Healthy Bees Plan. He will discuss the unit’s work and its importance. Vera Baird QC and Kannez Shaid: Citizenship and Equality \nThursday, March 9, 5.30pm \nThe Crime and Police Commissioner for Northumbria and the Chair of the Trustees of Citizens UK will have a conversation, providing insights into community alliances aimed at creating a sense of fairness and a platform for empowering marginalised voices. Chi Onwurah MP: Race to the top – productivity, investment and industrial strategy in the post-Brexit world Newcastle Central MP Chi Onwurah \nThursday, March 16, 5.30pm \nThe Newcastle Central MP and shadow minister for industrial strategy, science and innovation will deliver the RW Mann Lecture, looking at industry in the years ahead. Prof Leon Feinstein: What is the relationship between genetics and social mobility? \nTuesday, March 21, 5.30pm \nThe director of evidence, Children’s Commissioner for England, explains why the science of heredity is not in conflict with attempts to address social inequality. Rather, it indicates the remarkable degree to which beliefs and institutions create barriers. Prof Jennifer Richards: Voices and books – a new history of reading \nThursday, March 23, 5.30pm \nThe speaker will explore the importance of the actual voice to reading. She will explain how the recovery of the lost reading voices of the past, as well as the art of listening, can help us to re-imagine the books of the future. \n* All these Newcastle University lectures are part of its Insights programme and free and open to all. They take place in the Curtis Auditorium, Herschel Building, Newcastle University, NE1 7IU. More details at http://www.ncl.ac.uk/events/public-lectures/upcoming/ NORTHUMBRIA UNIVERSITY... Prof Alister Scott: Changing the nature of nature in land use policy and decision making \nTuesday, February 14, 6.30pm \nNature has traditionally been seen as an impediment to growth and development – and it is in rapid decline. The speaker, professor of environmental geography, will argue that to stave off environmental collapse there has to be a change in the way we account for nature. Dr Nicholas Cullinan: A Portrait Gallery for the Nation Dr Nicholas Cullinan, director of the National Portrait Gallery \nMonday, February 27, 6.30pm \nThe director of the National Portrait Gallery, visiting Newcastle as the gallery’s self-portrait by Sir Anthony Van Dyck is on show at the Laing Art Gallery, will talk about the role of portraits and of his own gallery in contemporary British society. Prof Michael Jopling: Is there a North-South divide among schools in England? \nMonday, March 13, 6.30pm \nIn the lecture, Northumbria’s professor of education will challenge prevalent characterisations of ‘successful’ and ‘failing’ schools and suggest we need to find better and more sensitive ways to assess the way schools respond to complex challenges. Prof Becky Strachan: Let’s Educate, Learn and Flourish \nWednesday, April 5, 6.30pm \nNorthumbria’s professor of digital technology and education will explore the current educational landscape and argue that educators need to be more adventurous. She will show how we should reimagine education and use technology in transformational ways \n* All these Northumbria University lectures are free and open to all. They take place in the Presentation Hall, Design Building, City Campus East, NE1 2SW with refreshments available from 6pm. More details at www.northumbria.ac.uk/about-us/news-events/public-lecture/ UNIVERSITY OF SUNDERLAND... Steve Cram and Jonathon Riall Steve Cram, Chancellor of the University of Sunderland \nWednesday, February 8, 6.30pm \nWas 2016 a good or bad year for sport? It saw a huge GB medal haul at the Rio Olympic and Paralympic Games but also allegations of bribery, corruption and doping. \nIn a lecture – perhaps more of a discussion – chaired by Jeff Brown of BBC Look North, the speakers will argue that highs outweighed lows. \nCram is the BBC’s chief athletics commentator and Chancellor of the University of Sunderland. Riall, a Sunderland graduate, is Team GB’s head coach for the paratriathlon team which competed for the first time in Rio. Dominic Wilcox \nWednesday, March 8, 6.30pm \nThe Sunderland-born artist and designer specialises in innovative and thought-provoking projects and has been commissioned by the likes of Paul Smith, Selfridges, BMW Mini and Jaffa Cakes. \nHe has said: “I’ve convinced myself that within everything that surrounds us, there are hundreds of ideas and connections waiting to be found. We just need to look hard enough.” \nIn his lecture he promises a high speed journey through his creative life so far. \n* These free lectures take place at the Sir Tom Cowie Lecture Theatre, Prospect Building, St Peter’s Campus, Sunderland SR6 0DD. Tickets and details at www.sunderland.ac.uk/public-lecture-series/ NEWCASTLE COLLEGE... Dr Tiffany Jenkins: Keeping their Marbles \nThursday, February 9, 6pm \nDr Jenkins is an author, writer and broadcaster. Her book Keeping Their Marbles: How Treasures of the Past Ended Up in Museums and Why They Should Stay There, touching on the long-running controversy of the Elgin Marbles (taken from Greek sites such as the Parthenon in the early 19th Century and installed at the British Museum), came out last year to critical acclaim. Dr Christopher Davidson: Shadow Wars – The Secret Struggles of the Middle East Dr Christopher Davidson \nThursday, March 2, 6pm \nThe Durham University academic is a Middle East expert who was previously an assistant professor at Zayed University in the United Arab Emirates. \nShadow Wars is the latest of his books. Meticulously researched, it looks at the reality behind the brief euphoria of the Arab Spring of 2011. A glimpse at www.goodreads.com will tell you it was well received. Dr Andrew McGettigan: Whatever happened to the Polytechnics? \nThursday, April 6, 6pm \nThe speaker writes about higher education, contributes to a blog called Critical Education and is the author of a book called The Great University Gamble: Money, Markets and the Future of Higher Education. Prof Peter Wadhams: The Arctic and Global Climate Change \nThursday, May 11, 6pm \nThe Cambridge University oceanographer and glaciologist leads a group studying the effects of global warming on sea ice, icebergs and the polar oceans. \nThis involves work in the Arctic and Antarctic from nuclear subs, autonomous underwater vehicles, icebreakers, aircraft and drifting ice camps. \nHis latest book, chillingly, is called A Farewell to Ice. Prof Kate Gould: Antibiotics from Prehistory to the Present Day Prof Kate Gould \nThursday, June 8, 6pm \nProf Gould is lead public health microbiologist for Public Health England and honorary consultant microbiologist at Newcastle upon Tyne Hospitals NHS Foundation Trust. \nHer lecture will focus on the crisis of global antibiotic resistance. \n* These Newcastle College free lectures all take place at partner organisation the Lit & Phil, 23 Westgate Road, Newcastle NE1 1SE. Book at www.litandphil.org.uk LIT & PHIL... Ann Cleeves and Emma Flint Vera author Ann Cleeves (Photo: Newcastle Chronicle) \nThursday, February 9, 7pm \nAnn Cleeves, creator of Vera and author of 30 novels, will discuss her latest, Cold Earth, with Gail-Nina Anderson and the pair will be joined by Emma Flint, who grew up in Newcastle and whose debut novel, Little Deaths, has been creating a buzz. Read More Gail-Nina Anderson: John William Waterhouse \nMonday, February 13, 6pm (£3) \nNewcastle-based cultural historian Gail-Nina Anderson specialises in art and this is one in her series of lectures about artists who died in 1917. \nIn a year when the horrors of the First World War claimed many young lives, this Victorian artist who specialised in a “dream-world of nymphs and damsels” quietly breathed his last. Alistair McCleery: What are Writers Worth? \nMonday, February 20, 6pm (£3) \nThe speaker is director of the Scottish Centre for the Book at Edinburgh Napier University. \nHe will offer an insight into the earnings of authors, the economics of self-publishing and writing as a career in 2017. Read More Prof Alan Watson: Searching for the highest-energy particles in nature \nTuesday, March 7, 6pm \nThe speaker, from the School of Physics and Astronomy at University of Leeds, will outline the history behind the discovery of cosmic rays and explain the importance of high-energy particles. He is an expert on the Pierre Auger Observatory in Argentina, the largest cosmic ray detector ever built which covers an area the size of West Yorkshire. David Hughes: Jeremiah Dixon \nThursday, February 23, 6pm \nDixon is largely remembered for his part in surveying the Mason-Dixon line in the United States, settling an 18th Century boundary dispute between the then British colonies of Maryland, Delaware and Pennsylvania. \nBut Dixon, born in Cockfield, County Durham, was also an astronomer who travelled widely in an effort to determine the scale of the solar system and the size and shape of Earth. \n* These lectures all take place at the Lit & Phil, 23 Westgate Road, Newcastle NE1 1SE. Book at www.litandphil.org.uk Like us on Facebook", "external_links": [], "published": "2017-02-08T01:00:00.000+02:00", "crawled": "2017-02-07T22:52:22.492+02:00", "highlightTitle": ""}