{"organizations": [], "uuid": "35def602739432c44623b401887086458526ab87", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12645330.ece/ALTERNATES/s1200/HSR_NEC_230217Margot_01.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/watch-hollywood-star-margot-robbie-12645128", "country": "GB", "domain_rank": 21960, "title": "Watch Hollywood star Margot Robbie take Nissan's new concept car for a midnight spin", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Watch Hollywood star Margot Robbie take Nissan's new concept car for a midnight spin", "spam_score": 0.0, "site_type": "news", "published": "2017-02-23T18:27:00.000+02:00", "replies_count": 0, "uuid": "35def602739432c44623b401887086458526ab87"}, "author": "Sean Seddon", "url": "http://www.chroniclelive.co.uk/news/north-east-news/watch-hollywood-star-margot-robbie-12645128", "ord_in_thread": 0, "title": "Watch Hollywood star Margot Robbie take Nissan's new concept car for a midnight spin", "locations": [], "entities": {"persons": [{"name": "wolf", "sentiment": "negative"}, {"name": "margot robbie", "sentiment": "negative"}, {"name": "brexit", "sentiment": "none"}, {"name": "gareth dunsmore", "sentiment": "none"}, {"name": "margot", "sentiment": "none"}], "locations": [{"name": "hollywood", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "monaco", "sentiment": "none"}], "organizations": [{"name": "nissan", "sentiment": "negative"}, {"name": "european union", "sentiment": "none"}, {"name": "getty images north america", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "dc comics", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "monaco", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "nissan europe", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Watch Hollywood star Margot Robbie take Nissan's new concept car for a midnight spin The Wolf of Wall Street and Suicide Squad star Margot Robbie is car giant Nissan's new face for their experimental electric super car Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nNissan have announced Hollywood star Margot Robbie as the glamorous new face of their revolutionary electric concept car. \nThe ‘Wolf of Wall Street’ actor is promoting the Nissan BladeGlider, a clean-energy sports car which can do zero to 60mph in around five seconds. \nYou can watch Margot take the unique vehicle for a midnight spin around Monaco’s Grand Prix circuit above. Actress Margot Robbie with Nissan’s all-electric BladeGlider sports car (Photo: PA Images) \nIt’s not the first time she’s been behind the wheel of the BladeGlider - Margot drove it in last year’s DC Comics blockbuster ‘Suicide Squad’. \nCommenting on the campaign, Margot Robbie said: “It’s a really exciting time for electric vehicles. \n“More people are choosing to go electric, leading the way to a more sustainable future and the Nissan BladeGlider hints at the future of smarter performance cars.” The Wolf of Wall Street and Suicide Squad star Margot Robbie (Photo: Getty Images North America) \nNissan has carved out a position as a market leader when it comes to producing electric cars - and the North East plays a big role in that. \nTheir LEAF model, an affordable, energy efficient option, is already the world’s best-selling electric vehicle. \nThe car manufacturer’s giant plant in Sunderland help produce the popular line, which is exported worldwide. Margot Robbie racing around the floodlit streets of Monaco in Nissan’s all-electric BladeGlider sports car (Photo: PA Images) \nGareth Dunsmore, director of electric vehicles for Nissan Europe: “The electric revolution is happening. As the global leader in electric vehicles, and with mass adoption just around the corner, it is more important than ever that we showcase all of the benefits of driving an electric car – from energy efficiency, to sustainability, from handling to performance. Read More Work for Nissan? You're about to be given the Freedom of the City of Sunderland \n“Having Margot on board will support us in spreading news of the personal and societal benefits of electric vehicles to more people than ever before. \n“Nissan’s Electrify the World movement recognises the importance of us all working together to achieve positive change in our communities. Nissan BladeGlider (Photo: Publicity Picture) \n“We want to inspire people to take meaningful steps towards cleaner, safer cities.” \nThere were serious concerns about whether operations would remain in Sunderland following the vote to leave the European Union. Read More The high price Sunderland and Newcastle could pay for Brexit revealed \nNissan dramatically gave a short-term commitment to the region in November, raising hopes that the plant will remain here in the long-term. \nAbout one in three cars built in the UK role off the Sunderland production line with the help of the plant’s 7000 workers. Like us on Facebook", "external_links": [], "published": "2017-02-23T18:27:00.000+02:00", "crawled": "2017-02-23T13:52:19.134+02:00", "highlightTitle": ""}