{"organizations": [], "uuid": "b61110e6d46757cf63e174d8424795cac7fda70c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12479767.ece/ALTERNATES/s1200/PRP_MGA_120117mgaHitachi_30JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/right-brexit-deal-essential-protect-12571961", "country": "GB", "domain_rank": 21960, "title": "Right Brexit deal is essential to protect £82m Hitachi plant, North East MP warns", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Right Brexit deal is essential to protect £82m Hitachi plant, North East MP warns", "spam_score": 0.0, "site_type": "news", "published": "2017-02-08T04:05:00.000+02:00", "replies_count": 0, "uuid": "b61110e6d46757cf63e174d8424795cac7fda70c"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/right-brexit-deal-essential-protect-12571961", "ord_in_thread": 0, "title": "Right Brexit deal is essential to protect £82m Hitachi plant, North East MP warns", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Right Brexit deal is essential to protect £82m Hitachi plant, North East MP warns Free trade with Europe after Brexit is essential to protect Hitachi plant, says Sedgefield MP Phil Wilson Share Trains at the Hitachi Plant, Merchant Park, Newton Aycliffe (Photo: Evening Gazette) Share Get   Thank you for subscribing!   \nGetting the right Brexit deal with the EU is essential to protect Hitachi’s £82 million plant in County Durham, an MP has warned. \nThe future of the Newton Aycliffe factory was in the spotlight as MPs continued debating legislation which allows Prime Minister Theresa May to trigger Article 50 and begin the process of leaving the EU. \nSedgefield MP Phil Wilson said agreeing tariff-free access to EU markets, so that products made in the UK can be exported without paying fees, was essential for ensuring the plant continues to be a success. \nThe Government offered a concession as debate continued on the European Union (Notification of Withdrawal) Bill, with a promise that MPs would have a vote on the final Brexit deal before it goes to the European Parliament to be rubber stamped. \nIt was unclear what will happen if MPs reject the deal. Mrs May has said the UK would simply fall back on World Trade Organisation trading rules, which would mean paying tariffs on many products. \nThe future of the Newton Aycliffe site was raised by Hitachi chairman Hiroaki Nakanishi in an interview with Bloomberg Television, when he said: “The UK rolling-stock factory is already full up to 2019. Afterwards maybe we need to make some sort of products to be exported, and that might be troublesome. \n“But up to 2019 we don’t have any problems about the factory’s operation.” Video Loading Click to play Tap to play The video will start in 8 Cancel Play now Business interview with Darren Cumner from Hitachi Share this video Watch Next \nHitachi also now has the option of building trains in Italy, following the purchase of Italian rail business Finmeccanica, now Leonardo SpA, in 2015. \nMr Wilson said: “Mr Nakanishi’s comments come at a time when there is great uncertainty in many sectors of business over what Brexit will actually look like and how important our trading relationship with the EU will be. \n“Hitachi’s train-building factory in my constituency is an asset to the North East and that is why I want to see a tariff-free, impediment-free trade agreement with the EU so it can grow. Read More Armed 'vigilantes' are targeting seagulls in a Northumberland town, MP warns \n“Hitachi has been successful in securing British contracts and has submitted bids to build the rolling stock for London Underground and HS2. But the Chairman of Hitachi has said the uncertainty around Brexit is ‘troublesome’. \n“And it hasn’t been lost on me that Hitachi is hedging its bets by buying an Italian rail business in 2015. While I wish the Italian factory well, it’s the Hitachi factory in Newton Aycliffe I want to see expand.” \nMPs will finish debating amendments to the Bill and hold a vote on the third reading - a chance to approve or reject the legislation as a whole - on Wednesday. Phil Wilson MP \nJeremy Corbyn has ordered Labour MPs to back the Brexit Bill by imposing a three-line whip on his MPs, a move which risks the resignation of high-profile shadow cabinet ministers like Shadow Business Secretary Clive Lewis. \nMr Lewis has previously said he would find it hard to vote for the Bill if no amendments are accepted. \nThere is also speculation that Shadow Home Secretary Diane Abbott could fail to support the Bill, after she was absent from last week’s second reading vote with a migraine. \nNewcastle East MP Nick Brown, Labour’s Chief Whip, will have the task of enforcing discipline within the party. Earlier this week, he told a meeting of the Labour Parliamentary Party that he expected every MP to obey the whip, in comments taken to be a reference to Ms Abbott. \nHe is reported to have told Labour MPs that members of the Shadow Cabinet should be “bound by collective decisions that they themselves have made” and said that he would not support “favouritism” for anyone. Like us on Facebook", "external_links": [], "published": "2017-02-08T04:05:00.000+02:00", "crawled": "2017-02-07T23:47:28.833+02:00", "highlightTitle": ""}