{"organizations": [], "uuid": "443809627de43009b0b1391e1a8887d651f92f2c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/30137697/15857503.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/8203-a-scheme-hopes-to-create-350-jobs-across-leicester-and-leicestershire/story-30137697-detail/story.html", "country": "US", "domain_rank": 48128, "title": "​Plan to create 350 jobs in Leicester and Leicestershire | Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "​Plan to create 350 jobs in Leicester and Leicestershire | Leicester Mercury", "spam_score": 0.58, "site_type": "news", "published": "2017-02-15T16:45:00.000+02:00", "replies_count": 0, "uuid": "443809627de43009b0b1391e1a8887d651f92f2c"}, "author": "", "url": "http://www.leicestermercury.co.uk/8203-a-scheme-hopes-to-create-350-jobs-across-leicester-and-leicestershire/story-30137697-detail/story.html", "ord_in_thread": 0, "title": "​Plan to create 350 jobs in Leicester and Leicestershire | Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "peter soulsby", "sentiment": "none"}, {"name": "scott knowles", "sentiment": "none"}, {"name": "fay davies", "sentiment": "none"}, {"name": "nick rushton", "sentiment": "none"}], "locations": [{"name": "leicester", "sentiment": "none"}, {"name": "usa", "sentiment": "none"}, {"name": "east midlands", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "leicestershire", "sentiment": "negative"}, {"name": "leicester mercury comments", "sentiment": "negative"}, {"name": "leicester city council", "sentiment": "none"}, {"name": "east midlands food & drink forum", "sentiment": "none"}, {"name": "east midlands chamber of commerce", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "leicestershire enterprise partnership", "sentiment": "none"}, {"name": "food & drink forum", "sentiment": "none"}, {"name": "leicestershire county council", "sentiment": "none"}, {"name": "erdf", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Comments (0) \nA new business service which hopes to create 350 jobs and support hundreds of companies has won millions of pounds of funding. \nLeicester City Council has led a successful bid to the European Regional Development Fund (ERDF) for £3.1 million for what is being called the Collaborate project. \nThe scheme – launching later this month – will give small and medium-sized businesses the chance to apply for grants of £10,000 to £25,000 to meet up to a third of the cost of planned investment. \nTo be eligible, firms must be employing fewer than 250 staff and trading business-to-business. \nThe project will also offer dedicated business support as well as encourage more overseas businesses to relocate here. \nThe business support programme will target firms operating within one of the sectors identified as a priority for growth by Leicester and Leicestershire Enterprise Partnership (LLEP). \nThey include advanced manufacturing, the creative industries, engineering, financial services, food and drink manufacturing, logistics and distribution, low carbon energy or tourism. \nThe scheme is being run in partnership with Leicestershire County Council, East Midlands Chamber of Commerce and the East Midlands Food & Drink Forum. \nIt aims to support the growth of around 290 local firms, create 350 jobs and attract £2.4 million of private sector investment into the area. \nThe scheme also aims to attract inward investment from companies from the USA, China and India that are looking to expand or relocate into Leicester and Leicestershire. \nIn Leicester, Collaborate is part of the next phase of the city council's economic action plan which, the council said, has helped create 5,160 jobs and 800 apprenticeships since 2012. \nIt said more than 1,900 local businesses have been supported, with grants ranging from £1,000 to £1 million. \nCity mayor Sir Peter Soulsby said: \"This award of £3.1 million of EU money to support the Collaborate project is fantastic news. \n\"It will provide a real boost to our economic action plan, which is already having a positive impact on the local jobs market and wider investor confidence in the city.\" \nCounty council leader Nick Rushton said: \"This project provides a unique opportunity to provide support for businesses within some of Leicestershire's key sectors, including food and drink, creative industries and tourism.\" \nRead more: Government backs enterprise zone plan which will see 21,000 jobs created over next 25 years \nFay Davies, general manager of the Food & Drink Forum, said: \"We look forward to starting work on the Collaborate project which will allow us to offer vital support to food and drink manufacturers throughout Leicester and Leicestershire. \n\"The food and drink sector is thriving in the area and we hope that the work we undertake through Collaborate will help businesses continue to grow.\" \nScott Knowles, chief executive at East Midlands Chamber of Commerce, said: \"When it comes to creating jobs and wealth, the East Midlands is one of the strongest regions in the country. \nScott Knowles \n\"There is little doubt, however, that inflationary pressures will be felt this year as a result of the Brexit process and they could threaten the buoyancy of the regional economy, resulting in pressure on employers to identify efficiency savings. \n\"The Collaborate programme will help local companies to deliver hundreds of new jobs and apprenticeships and attract inward investment, all of which will help to ensure that the East Midlands remains a driver of the national economy.\" Leicester City Council will act as the accountable body for the Collaborate fund, subject to formal approval on Tuesday, February 21. \nMore information and details on how businesses can apply for support, will be available on the LLEP Business Gateway website at: ", "external_links": [], "published": "2017-02-15T16:45:00.000+02:00", "crawled": "2017-02-15T12:49:54.776+02:00", "highlightTitle": ""}