{"organizations": [], "uuid": "1f5e67b9c88302ae0b28e262ef99a3a9a6b3e6df", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12325469.ece/ALTERNATES/s1200/mvr_SAH_071016prideprdce_01.jpg", "site_section": "http://www.thejournal.co.uk/culture/?service=rss", "section_title": "nechronicle - What's On", "url": "http://www.chroniclelive.co.uk/whats-on/theatre-news/jane-austens-pride-prejudice-puts-12607560", "country": "GB", "domain_rank": 21960, "title": "Jane Austen's Pride and Prejudice puts modern worries in perspective at the Theatre Royal", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Jane Austen's Pride and Prejudice puts modern worries in perspective at the Theatre Royal", "spam_score": 0.0, "site_type": "news", "published": "2017-02-15T18:58:00.000+02:00", "replies_count": 0, "uuid": "1f5e67b9c88302ae0b28e262ef99a3a9a6b3e6df"}, "author": "David Whetstone", "url": "http://www.chroniclelive.co.uk/whats-on/theatre-news/jane-austens-pride-prejudice-puts-12607560", "ord_in_thread": 0, "title": "Jane Austen's Pride and Prejudice puts modern worries in perspective at the Theatre Royal", "locations": [], "entities": {"persons": [{"name": "jane austen", "sentiment": "negative"}, {"name": "mari izzard", "sentiment": "none"}, {"name": "anna crichlow", "sentiment": "none"}, {"name": "mary", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "francesca bailey", "sentiment": "none"}, {"name": "bingley", "sentiment": "none"}, {"name": "lizzie", "sentiment": "none"}, {"name": "young kitty", "sentiment": "none"}, {"name": "bennet", "sentiment": "none"}, {"name": "felicity montagu", "sentiment": "none"}, {"name": "steven meo", "sentiment": "none"}, {"name": "hollie edwin", "sentiment": "none"}, {"name": "tafline steen", "sentiment": "none"}, {"name": "darcy", "sentiment": "none"}, {"name": "charlotte lucas", "sentiment": "none"}, {"name": "johan persson", "sentiment": "none"}, {"name": "lydia", "sentiment": "none"}, {"name": "jane", "sentiment": "none"}, {"name": "leigh quinn", "sentiment": "none"}, {"name": "jordan mifsúd", "sentiment": "none"}, {"name": "collins", "sentiment": "none"}, {"name": "matthew kelly", "sentiment": "none"}, {"name": "mrs bennet", "sentiment": "none"}, {"name": "deborah bruce", "sentiment": "none"}, {"name": "benjamin dilloway", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "theatre royal newcastle", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "What's On Opinion Jane Austen's Pride and Prejudice puts modern worries in perspective at the Theatre Royal A lively and likeable production of the classic tale comes to Newcastle as it nears the end of a successful UK tour Share Matthew Kelly and Felicity Montagu as Mr and Mrs Bennet (Photo: Publicity Picture) Share   Thank you for subscribing!   \nWith so many worries in the world – Trump, Brexit, global warming etc – it’s nice to see them put in perspective by Jane Austen’s famous tale about the Bennets. \nMrs Bennet alone can fret enough for all of us. She’s an Olympic-standard brow beater and who can blame her? \nShe’s got five daughters – five! – to marry off before disaster strikes (they live in a house which women can’t inherit). \nMr Bennet, whose death would trigger this disaster, seems much less worried. But then, he’d be well out of it. \nPeople who love a novel invariably worry about a stage adaptation but this is an enjoyable production with loads of fizz and sparkle and is at the Theatre Royal Newcastle until Saturday. \nFelicity Montagu plays Mrs Bennet as a woman teetering on the edge, bringing her wealth of experience and comic timing to a peach of a part. Felicity Montagu and Jordan Mifsúd as Mrs Bennet and Mr Bingley in Pride and Prejudice (Photo: Johan Persson) \nIn her desperation to secure the future of her girls – and herself – she pushes propriety to the very edge, resorting every now and again to an unseemly wail or a shriek. \nClearly, getting these girls to the altar is like trying to round up cats. \nLizzie (Tafline Steen) is sharply intelligent and disdainful, Jane (Hollie Edwin) can’t win eligible Mr Bingley when he’s handed to her on a plate and Lydia (Mari Izzard) will chuck herself at any chancer in trousers. \nYoung Kitty (Anna Crichlow), caught up in the mating frenzy, is ripe for the plucking while bookish Mary (Leigh Quinn) is a spinsterly spanner in the domestic grand plan. \nAnd as the women whip themselves up into a lather of excitement, friend Charlotte Lucas (Francesca Bailey) nabs the vicar, Mr Collins (Steven Meo), who may be a bit of a prat but was at least willing and available. \nLizzie had her chance, god dammit! You can almost hear Mrs B’s teeth gnashing. \nAnd then there are the men. Mr Bennet, grimly aware that all are concerned with matters that will not directly affect him, metaphorically battens down the hatches, hiding behind his newspaper and occasionally barking like an old dog. Matthew Kelly as Mr Bennet in Pride and Prejudice (Photo: Johan Persson) \nIt’s a nice performance from Matthew Kelly, tall and white-haired, who exudes exasperated affection for his skittish, over-wrought family. \nThen there’s Mr Darcy, played by Benjamin Dilloway with a fantastically supercilious sneer. Who could possible love such a monster? Well, thereon hangs a tale. \nDeborah Bruce’s lively and likeable production is enhanced by a fantastic revolving set whose impressive railings convey both grand interiors and gilded prison. \nThey also provide something for an increasingly dishevelled Mrs B to vent her frustration against. Like us on Facebook", "external_links": [], "published": "2017-02-15T18:58:00.000+02:00", "crawled": "2017-02-15T14:56:57.539+02:00", "highlightTitle": ""}