{"organizations": [], "uuid": "d36950d47af6402a4b926f3a8310f247a260dddf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article11166818.ece/ALTERNATES/s1200/JS56168026.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/newcastles-ryder-architecture-builds-future-12540797", "country": "GB", "domain_rank": 21960, "title": "Newcastle's Ryder Architecture builds for future with 41% leap in profits", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Newcastle's Ryder Architecture builds for future with 41% leap in profits", "spam_score": 0.0, "site_type": "news", "published": "2017-02-01T22:13:00.000+02:00", "replies_count": 0, "uuid": "d36950d47af6402a4b926f3a8310f247a260dddf"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/newcastles-ryder-architecture-builds-future-12540797", "ord_in_thread": 0, "title": "Newcastle's Ryder Architecture builds for future with 41% leap in profits", "locations": [], "entities": {"persons": [{"name": "mark thompson", "sentiment": "none"}, {"name": "celia thomas prize", "sentiment": "none"}], "locations": [{"name": "hong kong", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "ryder architecture", "sentiment": "negative"}, {"name": "hong kong university", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "adderstone group", "sentiment": "none"}, {"name": "liverpool", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Newcastle's Ryder Architecture builds for future with 41% leap in profits The firm says it is cautiously confident following the vote to leave the European Union Share Get business   \nDirectors at Ryder Architecture say they are cautiously confident of future growth despite the uncertainty caused by the Brexit vote . \nThe Newcastle architecture practice hailed another successful year in its latest accounts, which show pre-tax profits rose by 41% to £1.534m in the year ended April 30, 2016. \nTurnover grew by 3% to £11.138m and total costs, excluding consultants, increased by 9%, a figure the firm said was reflected in the turnover leap and its continued investment in its people, business development and international opportunities. \nHeadquartered in the North East, the company works across offices in Newcastle , London, Liverpool and Hong Kong and is commissioned to a range of projects worth anything from £50,000 to £300m in the civic, education, healthcare, manufacturing, office, residential, leisure, science and transport sectors. \nThe firm secured a number of notable contracts within the North East, including its work with online gaming operator tombola to design its new, striking headquarters in Sunderland , which is now under construction. How the new tombola HQ will look in Sunderland (Photo: Ryder Architecture) \nIt is also working with firms including Newcastle’s Adderstone Group, which plans to create a luxury glass-fronted apartment scheme on the Quayside. \nAfter the end of the financial year, Ryder Architecture also took home a £20,000 cash prize after winning the Celia Thomas Prize for designing the AllGo hotel room concept, which has been packed with features to improve hotel stays for disabled people. \nStaff numbers increased from 127 to 135 during the accounting year. \nFollowing the successful year, dividend payments of £900,949 have been paid out – almost double the £570,692 that was paid the previous period. \nIn the strategic report accompanying the accounts, managing partner Mark Thompson said: “Our people bring the very best in knowledge, creative thinking and capability. Attracting and retaining talented people is a measure of our growth and ongoing success. Read More Newcastle's Ryder Architecture wins top prize for hotel room concept \n“Our culture promotes empowerment, creativity and teamwork, we are one of the highest ranking architects in the 2016 Sunday Times 100 Best Companies to Work For and have been finalists for Building magazine’s Archirectural Practice of the Award once again in 2016. \n“The practice continues to be committed to all its established sectors while pursuing overseas opportunities. \n“We have secured our first major project in Hong Kong where clients now include Hong Kong University, building on our UK expertise in the science and research sector. \n“We have won some significant commissions in the UK offering an integrated and comprehensive service to our clients. \n“The directors are delighted with another successful year. \n“Brexit caused a hiatus but following a period of assessment across our diverse portfolio in sectors and geography, we are conservatively confident for sustained growth and development. We are excited by the opportunities for our clients and people as we look forward to 2017.” Like us on Facebook", "external_links": [], "published": "2017-02-01T22:13:00.000+02:00", "crawled": "2017-02-01T17:30:15.851+02:00", "highlightTitle": ""}