{"organizations": [], "uuid": "92d734065130a2ab8e11a3c01f64e17df16f8cc3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12604527.ece/ALTERNATES/s1200/NW_AC030404WHEREINNO.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/top-labour-politicians-come-ukip-12604546", "country": "GB", "domain_rank": 21960, "title": "Top Labour politicians come to 'UKIP area' Sunderland for Brexit debates and festival", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Top Labour politicians come to 'UKIP area' Sunderland for Brexit debates and festival", "spam_score": 0.0, "site_type": "news", "published": "2017-02-15T12:00:00.000+02:00", "replies_count": 0, "uuid": "92d734065130a2ab8e11a3c01f64e17df16f8cc3"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/top-labour-politicians-come-ukip-12604546", "ord_in_thread": 0, "title": "Top Labour politicians come to 'UKIP area' Sunderland for Brexit debates and festival", "locations": [], "entities": {"persons": [{"name": "sunderlan", "sentiment": "negative"}, {"name": "paul nuttall", "sentiment": "none"}, {"name": "bill", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "clive lewis", "sentiment": "none"}, {"name": "steve hansom", "sentiment": "none"}, {"name": "rachael maskell", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "diane abbott", "sentiment": "none"}, {"name": "michael dugher", "sentiment": "none"}, {"name": "john mcdonnell", "sentiment": "none"}, {"name": "rachel maskell", "sentiment": "none"}], "locations": [{"name": "sunderland", "sentiment": "none"}, {"name": "sunderland bangladesh international centre", "sentiment": "none"}, {"name": "wearmouth bridge", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "norwich", "sentiment": "none"}, {"name": "liverpool", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "barnsley", "sentiment": "none"}, {"name": "bradford", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "dagenham", "sentiment": "none"}], "organizations": [{"name": "top labour", "sentiment": "negative"}, {"name": "news top labour", "sentiment": "negative"}, {"name": "invalid email  top labour", "sentiment": "none"}, {"name": "world transformed", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "sunderland university", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "shadow cabinet", "sentiment": "none"}, {"name": "government’s brexit", "sentiment": "none"}, {"name": "york", "sentiment": "none"}, {"name": "liverpool", "sentiment": "none"}, {"name": "labour council", "sentiment": "none"}, {"name": "ceos", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Top Labour politicians come to 'UKIP area' Sunderland for Brexit debates and festival Sunderland is the first stop on a tour of Brexit-voting areas featuring workshops, talks, food and music and senior allies of Jeremy Corbyn Share River Wear between Wearmouth Bridge and Sunderland University Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nTop Labour politicians are coming to Sunderland in an attempt to convince local voters not to back UKIP. \nShadow Chancellor John McDonnell and Shadow Home Secretary Diane Abbott, both London MPs and close allies of Labour leader Jeremy Corbyn, are visiting towns and cities which voted heavily for Brexit. \nThe tour is called Take Back Control and the first stop is Sunderland , with a day of workshops, talks, food and music at the Sunderland Bangladesh International Centre on April 1st. \nLater events will be held in Barnsley, Bradford, Plymouth and Dagenham. \nAlso taking part are former Shadow Defence Secretary and Norwich MP Clive Lewis, who is seen as an ally of Mr Corbyn but resigned from the Shadow Cabinet after the leader ordered Labour MPs to vote for the Government’s Brexit legislation, and York MP Rachael Maskell, the fotrmer Shadow Environment Secretary, who also resigned over Brexit. Shadow chancellor John McDonnell (Photo: PA) \nDetails of which politicians will be speaking at each event have not been confirmed. \nThe tour has not been organised by the Labour Party. Instead, it has been put together by a group called The World Transformed, which held a four-day “festival of politics, culture, music and art” in Liverpool alongside the official Labour conference last year. The Liverpool event was backed by Momentum, a campaign group which supports Jeremy Corbyn. \nOrganisers say the tour is going to “ UKIP areas ” for a series of events about “Brexit, the establishment and bringing power back to communities”. \nThe aim is to bring together leave and remain voters, make sense of the Brexit negotiations and discuss how voters can “take back control from economic elites and establishment politicians”, organisers said in a statement. \nSteve Hansom, a Take Back Control organiser from Sunderland, said: “Paul Nuttall may wear a flat cap and speak with a scouse accent, but that doesn’t mean he’s got your back. He is no different to Farage who is no different to May - just another politician who directs anger and frustration at the most vulnerable instead of going after those at the top. \n“I desperately want to see a better future for Sunderland, one with jobs, homes and a stronger community. But we’re never going to be able to build this future unless we take back control from the bankers, bosses and CEOS who keep creaming off the top”. Shadow home secretary Diane Abbott (Photo: PA) \nRachel Maskell, the former Shadow Environment Secretary, said: “The overriding cry from the EU Referendum was that people wanted more control over the lives they lead and those who represent them in our political institutions. When you don’t know how many hours you will work on your zero-hour contract, or when your landlord will tell you to pack your bags, it is increasingly impossible to have control over anything. Read More MPs say YES to Brexit in historic Commons vote - but two North East MPs stood against the Bill \n“The Government, in refusing to listen to the needs people have, highlights the need for people across every community to get their voice heard and make their politicians work for them. The debate should not be about the political institutions but the way those who hold office engage and respond and most importantly empower people in their community to have a voice.” Read More Brexit survey revealed: What you would do if given second shot at EU referendum \nBut one Labour MP said the tour would be “counter-productive”. Former Shadow Culture Secretary Michael Dugher told website PoliticsHome: “The way to combat Ukip is to expose them for being more Tory than the Tories, have no answers and want to do things like privatise the NHS. \n“But the party nationally should be backing the party locally who are at the sharp end of this Tory government. That means supporting our Labour council and our local MPs. We also have to be in the right place on immigration, defence and security, economic credibility, jobs and pay. \n“The idea that the way to win is to slate the local political establishment, then get a bunch of thorough-going metropolitans to rock up from London, uninvited, to share platforms with our political opponents at some cringeworthy left-wing jamboree is absolutely crackers and totally counter-productive.” Like us on Facebook", "external_links": [], "published": "2017-02-15T12:00:00.000+02:00", "crawled": "2017-02-15T07:11:13.286+02:00", "highlightTitle": ""}