{"organizations": [], "uuid": "697291967d350c74c2486397c3f7f51315d7ad1d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12547051.ece/ALTERNATES/s1200/Currency-Trading-Fluctuates-After-UKs-EU-Referendum-Result.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/government-sets-out-eu-brexit-12546933", "country": "GB", "domain_rank": 21960, "title": "Government sets out EU Brexit plan as White Paper is published", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Government sets out EU Brexit plan as White Paper is published", "spam_score": 0.0, "site_type": "news", "published": "2017-02-02T22:25:00.000+02:00", "replies_count": 0, "uuid": "697291967d350c74c2486397c3f7f51315d7ad1d"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/government-sets-out-eu-brexit-12546933", "ord_in_thread": 0, "title": "Government sets out EU Brexit plan as White Paper is published", "locations": [], "entities": {"persons": [{"name": "david davis con", "sentiment": "negative"}, {"name": "david davis", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "keir starmer", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "david davis  mr davis", "sentiment": "none"}, {"name": "brexit bill", "sentiment": "none"}, {"name": "tim farron", "sentiment": "none"}], "locations": [{"name": "eu brexit", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "eu brexit", "sentiment": "negative"}, {"name": "labour", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Government sets out EU Brexit plan as White Paper is published Brexit Secretary David Davis confirmed the UK will leave the single market as the plan for leaving the EU was revealed on Thursday Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily   \nTheresa May is to ask EU leaders to give the UK a trade deal like the one we have now - but without freedom of movement. \nThe plan for a new trade deal allowing existing trading arrangements “to continue when we leave the EU” is revealed in the Government’s long-awaited White Paper on Brexit. \nBrexit Secretary David Davis confirmed the UK will leave the single market, which currently ensures there are almost no restrictions on trade with the other 27 member states. \nInstead, he told MPs the UK would negotiate “a bold and ambitious free trade and customs agreement that should ensure the most free and frictionless trade in goods and services that is possible”. \nAnd the White Paper, a 77-page document setting out proposals for quitting the EU, says that Ministers hope the new trade deal will be based on the arrangements that already exist. \nIt states: “The UK already has zero tariffs on goods and a common regulatory framework with the EU Single Market. This position is unprecedented in previous trade negotiations. In this photo illustration, Euro, Dollar and pound sterling notes are seen beside a UK passport (Photo: Matt Cardy/Getty Images) \n“Unlike other trade negotiations, this is not about bringing two divergent systems together. \n“It is about finding the best way for the benefit of the common systems and frameworks, that currently enable UK and EU businesses to trade with and operate in each others’ markets, to continue when we leave the EU through a new comprehensive, bold and ambitious free trade agreement.” \nIt continues: “That agreement may take in elements of current single market arrangements in certain areas as it makes no sense to start again from scratch when the UK and the remaining member states have adhered to the same rules for so many years. \n“Such an arrangement would be on a fully reciprocal basis and in our mutual interests.” Read More \nThe paper also states: “Our new partnership should allow for tariff-free trade in goods that is as frictionless as possible between the UK and the EU member states.” \nHowever, while the White Paper confirms that freedom of movement will end. \nIt states: “In the last decade or so, we have seen record levels of long term net migration in the UK, and that sheer volume has given rise to public concern about pressure on public services, like schools and our infrastructure, especially housing, as well as placing downward pressure on wages for people on the lowest incomes. \n“The public must have confidence in our ability to control immigration. It is simply not possible to control immigration overall when there is unlimited free movement of people to the UK from the EU.” Brexit Secretary David Davis \nMr Davis insisted that Britain entered the negotiations which the Government intends to trigger by the end of March in “a position of strength”. \nAnd the Minister - who campaigned to quit the EU in last year’s referendum, unlike Theresa May - told the House of Commons: “The referendum result was not a vote to turn our back on Europe. \n“It was a vote of confidence in the UK’s ability to succeed in the world and an expression of optimism that our best days are still to come.” \nLabour’s shadow Brexit secretary, Sir Keir Starmer, told the Commons there was “nothing” in the white paper to resolve the position of UK nationals living in other EU countries. Read More MPs overwhelmingly back Brexit Bill in historic House of Commons vote \nLiberal Democrat leader, Tim Farron, criticised Labour for voting for Article 50, which allows the Government to begin the process of leaving the EU, on Thursday. \nHe said: “All we’ve seen on Brexit this week is a white paper from the Tories and a white flag from Labour. \n“Both are now committed to a hard Brexit that will do untold damage to our economy.” Like us on Facebook", "external_links": [], "published": "2017-02-02T22:25:00.000+02:00", "crawled": "2017-02-02T17:56:27.618+02:00", "highlightTitle": ""}