{"organizations": [], "uuid": "6d2ec5b9081b88632a46238c75be720e65585927", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12217771.ece/ALTERNATES/s1200/JS105712130.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12621560", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE:Budget boost for Hammond as report reveals brighter outlook, plus latest news", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast LIVE:Budget boost for Hammond as report reveals brighter outlook, plus latest news", "spam_score": 0.0, "site_type": "news", "published": "2017-02-20T15:25:00.000+02:00", "replies_count": 0, "uuid": "6d2ec5b9081b88632a46238c75be720e65585927"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12621560", "ord_in_thread": 0, "title": "Business Breakfast LIVE:Budget boost for Hammond as report reveals brighter outlook, plus latest news", "locations": [], "entities": {"persons": [{"name": "hammond", "sentiment": "negative"}, {"name": "philip hammond", "sentiment": "none"}, {"name": "martin beck", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "coreena ford pound", "sentiment": "negative"}, {"name": "obr", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "office for budget responsibility", "sentiment": "none"}, {"name": "ey item club", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "budget", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford Pound and FTSE latest \nThe pound at 8am was 1.2431 dollars compared to 1.2427 dollars at the previous close. The euro at 8am was 0.8543 pounds compared to 0.8549 pounds at the previous close. \nThe FTSE-100 index opened at 7299.96. 8.30 KEY EVENT Budget boost for Hammond \nChancellor Philip Hammond is in line for a Budget boost as Britain’s fiscal watchdog unveils a brighter outlook on economic growth and the public finances, according to a report. \nThe Office for Budget Responsibility (OBR) will trim back forecasts for net borrowing by £3bn to £65bn for 2016/2017, while revising up predictions for the UK economy to 1.7% from 1.4% for this year, EY ITEM Club has said. \nThe Government’s fiscal referee will take the unexpected steps after seeing a bigger haul from tax receipts and a stronger performance from UK gross domestic product (GDP) in the fourth quarter of 2016. \nMartin Beck, senior economic adviser to EY ITEM Club, said Mr Hammond would be under little pressure for the March 8 Budget to “use fiscal levers to support activity or fill any fiscal ‘black hole”’. \n“The OBR will paint a marginally better picture of the UK economy and public finances in the short term, but fiscal policy faces major challenges on both the revenue and spending sides in the longer term. \n“One of the most interesting aspects will be how the OBR deals with the latest Brexit developments. \n“We suspect there will be few changes given that lingering questions around the UK’s post-Brexit trade relations with the EU and migration policy are likely to go unanswered for some time yet. \n“And while the OBR will probably assume the Government is successful in negotiating transitional arrangements, it is not yet clear how long these would last. “Likewise, there is still no indication of the size of the UK’s Brexit ‘divorce bill’ although with payments likely to be spread over a long period, it should have minimal impact on the OBR’s forecast horizon.” \nThe OBR had pencilled in a sharp rise in public sector net borrowing during the Autumn Statement, pushing up its predictions to a more gloomy £68.2 billion for 2016/17 from £55.5bn. \nIt also made sweeping changes to its forecasts for UK GDP in anticipation that lower investment and weak consumer demand triggered by the Brexit-hit pound would apply the brakes to the economy. \nThe OBR slashed its outlook for 2017 from 2.2% to 1.4% in November, while also revising its GDP forecasts from 2.1% to 1.7% in 2018. It maintained its outlook of 2.1% growth in 2019 and 2020, before slipping to 2% in 2021. \nHowever, the UK economy has confounded expectations of Brexit-induced slowdown, with GDP growing by 0.6% for the second, third and fourth quarters of 2016. \nEY ITEM Club expects the Government to push up the tax-free personal allowance to £11,800 and raise the threshold of the 40% rate of income tax to £46,500, bringing it closer to its manifesto targets of £12,500 and £50,000 by the end of Parliament. \nIt said Mr Hammond may also impose a temporary cut to fuel duty and defer the standard inflation-driven increase in Air Passenger Duty (APD) for one year to help ease the pressure on consumers in the face of rising inflation. Chancellor Philip Hammond (Photo: PA Wire) Share", "external_links": [], "published": "2017-02-20T15:25:00.000+02:00", "crawled": "2017-02-20T10:45:13.174+02:00", "highlightTitle": ""}