{"organizations": [], "uuid": "0657f17418d89bd27bd6e8ad019765790c5dd193", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12590715.ece/ALTERNATES/s1200/Protest-Groups-Call-For-Jeremy-Hunt-To-Resign.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/comment-how-government-uses-fake-12590710", "country": "GB", "domain_rank": 21960, "title": "Comment - How the government uses fake news to cover up the NHS crisis", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Comment - How the government uses fake news to cover up the NHS crisis", "spam_score": 0.0, "site_type": "news", "published": "2017-02-12T01:00:00.000+02:00", "replies_count": 0, "uuid": "0657f17418d89bd27bd6e8ad019765790c5dd193"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/comment-how-government-uses-fake-12590710", "ord_in_thread": 0, "title": "Comment - How the government uses fake news to cover up the NHS crisis", "locations": [], "entities": {"persons": [{"name": "nick forbes", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "philip hammond", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "jeremy hunt", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "may", "sentiment": "none"}, {"name": "david hodge", "sentiment": "none"}, {"name": "samih kalakeche", "sentiment": "none"}, {"name": "hammond", "sentiment": "none"}], "locations": [{"name": "surrey", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "nhs", "sentiment": "negative"}, {"name": "a&e", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "surrey", "sentiment": "none"}, {"name": "surrey county council", "sentiment": "none"}, {"name": "newcastle city council", "sentiment": "none"}, {"name": "liverpool", "sentiment": "none"}, {"name": "national audit office", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "pa", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nWhile Donald Trump uses the phrase ‘fake news’ to denounce anything remotely critical of him, his chief hand holder in the UK, Theresa May , and her government are actually using fake news to defend themselves from legitimate criticism. \nLast week their fake news topic of choice was ‘health tourism’ - basically people coming to the UK to use the NHS for which taxpayers pick up the bill which accounts for about 0.3% of its funding. \nThe Secretary of State for Health, Jeremy Hunt , came up with a cunning plan for hospitals to charge migrants and foreigners before they are given medical treatment for non-urgent care under the NHS with bedside card readers. Health Secretary Jeremy Hunt (Photo: PA) \nThis was a distraction to cover up the fact that neither he nor the government has a plan to deal with the real NHS problems, namely the growing number of cancelled operations, horrendous A&E waiting times, bed shortages and the national crisis in adult social care. \nIt is affecting everyone, even Tory central in Surrey, where Jeremy Corbyn got wind of what seemed a sweetheart deal between the local council and the government to sort out its social care crisis thanks to texts erroneously sent to Newcastle City Council leader Nick Forbes which found their way to the Labour leader. \nThe texts from the Tory leader of Surrey County Council, David Hodge, were apparently sent on Tuesday - the very day he called off a referendum to authorise a 15% increase in council tax and instead imposed a smaller 4.99% rise which didn’t have to go to a local vote. \nThey indicated that a ‘memorandum of understanding’ making the cuts unnecessary had been agreed with the Department for Communities and Local Government and the chancellor Philip Hammond. \nAs chance would have it, Surrey council area contains the parliamentary constituencies of both Hammond and Hunt which would have made it double humiliating for the government if the referendum had gone ahead. Prime Minister Theresa May speaks during Prime Minister's Questions (Photo: PA) \nWhen May was asked at PMQs about the ‘deal’ and whether it would be offered to other councils, she accused Corbyn of alternative facts and said Labour needed an alternative leader. Needless to say she didn’t answer the question directly. \nThe facts - not alternative or otherwise - are that there has been about a 27% cut in adult social services since 2010. The number of jobs in the sector has fallen by 46,000 – nearly 30% down from five years ago. The National Audit Office recently found that social care’s integration with the NHS had so far entirely failed to deliver the ambitious savings that had been promised. Read More Now Brexit is official it's time to back the North East people who supported it \nSamih Kalakeche, Liverpool’s adult social care director, resigned last week because of the amount of cuts the council has had to impose, saying: “If we don’t do something within the next six months, I believe social services will not exist by 2018-19.” \nYet this government’s only plan is to clamp down on health tourism which apparently costs the NHS as much as its stationery bill. \nIf the Prime Minister thinks that any talk of a social care crisis is ‘an alternative fact’, it is the country and not Labour which really needs an alternative leader. Like us on Facebook", "external_links": [], "published": "2017-02-12T01:00:00.000+02:00", "crawled": "2017-02-11T20:24:46.904+02:00", "highlightTitle": ""}