{"organizations": [], "uuid": "27b5771bc67429136bed688c612194ebb7683b04", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12657689.ece/ALTERNATES/s1200/David-Dimbleby-Question-Time.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/bbcs-question-time-coming-sunderland-12659673", "country": "GB", "domain_rank": 21960, "title": "BBC's Question Time is coming to Sunderland - but what would you ask?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "BBC's Question Time is coming to Sunderland - but what would you ask?", "spam_score": 0.0, "site_type": "news", "published": "2017-02-27T12:00:00.000+02:00", "replies_count": 0, "uuid": "27b5771bc67429136bed688c612194ebb7683b04"}, "author": "Sean Seddon", "url": "http://www.chroniclelive.co.uk/news/north-east-news/bbcs-question-time-coming-sunderland-12659673", "ord_in_thread": 0, "title": "BBC's Question Time is coming to Sunderland - but what would you ask?", "locations": [], "entities": {"persons": [{"name": "george washington", "sentiment": "none"}, {"name": "tyne", "sentiment": "none"}, {"name": "philip hammond", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "david dimbleby", "sentiment": "none"}, {"name": "carlos ghosn", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}, {"name": "washington dc", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "luton", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "ellesmere port", "sentiment": "none"}], "organizations": [{"name": "sunderland", "sentiment": "neutral"}, {"name": "bbc", "sentiment": "neutral"}, {"name": "european union", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}, {"name": "invalid email  question time", "sentiment": "none"}, {"name": "vauxhall", "sentiment": "none"}, {"name": "european union  let", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "peugeot", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nQuestion Time is coming to Sunderland on March 9 and there’s sure to be plenty to debate. \nThe BBC’s flagship politics show, hosted by the ever-present David Dimbleby, will air at around 22:45pm on BBC One. \nIf you were in the audience, what questions would you ask? \nLeave your answers in a comment below and we’ll check them out and possibly publish them in the next week or two. \nIn the mean time, here are some issues we expect to come up during the debate. Brexit and the European Union \nLet’s kick this off with the big one. \nSunderland provided the first Leave vote in the UK on referendum night and has become forever linked with the decision to exit the European Union. \nThe spectre of Brexit is haunting the world of British politics and business. \nNow that parliament has given the government authorisation to trigger Article 50, the UK is about to embark on at least two years of crucial negotiations with Brussels. \nTheresa May has stated that she will begin that process no later than the end of March - there’s a slim chance that it may have already begun by the time the show is recorded. \nIt’s likely to be one of the hottest topics for the foreseeable future. The automotive industry \nThis is linked to the above topic but for places like Sunderland its an issue which has taken on a life of its own. \nWith a workforce of more than 7000, Nissan is arguably the most important private sector employer in the city and one of the most significant in the region. \nPrior to the referendum, Nissan voiced scepticism about operating in a UK which was no longer in the single market. \nBut, to the delight of the region, the Japanese company pledged its short-term future to the North East after “assurances” from the government. \nBut all is not well in the UK’s car industry. \nNissan boss Carlos Ghosn has already signalled the firm’s future may still lie outside of the UK. \nIn January he said: “Obviously when the package comes, you are going to have to re-evaluate the situation, and say, ‘Okay, is the competitiveness of your plant preserved or not?’ \nAnd concern is mounting over two Vauxhall factories which employ more than 3000 people in Luton and Ellesmere Port. \nPeugeot, which is in the running to buy out Vauxhall, has given assurances to unions and the Government that the plants will see out their existing production runs but have also raised the issue of Brexit uncertainty. \nThese are nervous times for people employed in the auto-industry. Read More Question Time is coming to Sunderland: How can I get in the audience? The budget \nThe day before Question Time is filmed Philip Hammond, the Chancellor of the Exchequer, will present his budget to the House of Commons. \nIt will be the last ever spring budget which, for technical reasons, will now be presented in the Autumn - so, weirdly, there will be two budgets this year... \nThe usual round of pre-budget leaks and briefings hasn’t quite begun yet but don’t hold your breath for any government giveaways. \nPhilip Hammond has warned his colleagues that any extra spending this year must be paid for through higher taxes or savings elsewhere. \nThere’ll be plenty to talk about come March 9, especially on business rates reform and social care. \nSpeaking of which... Social care and the NHS \nThe issue which won’t go away. \nSocial care provision in the UK is a ticking time bomb, with experts warning that the under-funded and under-staffed system is facing collapse because of the country’s ageing population. \nAnd the NHS is only just emerging from one of the toughest winters it has had in recent memory. \nThe Chancellor is expected to announce extra funding for social care in the budget but no doubt there will be those who call for more radical action. \nIt would be baffling if this doesn’t get a mention. Trump \nNot strictly a Sunderland issue but, let’s face it, he’ll probably pop up. \nAnd after all, Washington DC is forever linked through a quirk of history to Sunderland - Washington, Tyne and Wear was the home of founding father George Washington’s family. \nFitting, then, that the era of “American carnage” should be discussed close to the ancestral home of the man who started it all. Like us on Facebook", "external_links": [], "published": "2017-02-27T12:00:00.000+02:00", "crawled": "2017-02-27T09:14:13.496+02:00", "highlightTitle": ""}