{"organizations": [], "uuid": "d3bc3320770f364c229ff13ca4bbb3a8eab7e694", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12499749.ece/ALTERNATES/s1200/HSBC-branch-closures.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12627898", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: HSBC sees profits slump 62%, plus latest news", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast LIVE: HSBC sees profits slump 62%, plus latest news", "spam_score": 0.0, "site_type": "news", "published": "2017-02-21T15:25:00.000+02:00", "replies_count": 0, "uuid": "d3bc3320770f364c229ff13ca4bbb3a8eab7e694"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12627898", "ord_in_thread": 0, "title": "Business Breakfast LIVE: HSBC sees profits slump 62%, plus latest news", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "KEY EVENT HSBC profits slump amid \"unexpected world events\" \nBanking giant HSBC has revealed a 62% slump in annual profits amid “volatile” trading caused by the Brexit vote and President Donald Trump’s election. \nThe London-based lender, which is Europe’s largest bank, posted worse-than-expected pre-tax profits of $7.1bn (£5.7bn), down sharply on the $18.9bn (£15.2bn) for 2015. \nIt saw bottom-line losses in the final three months of 2016 quadruple to $3.4bn (£2.7bn). \nHSBC blamed a string of one-off charges, such as the sale of its Brazilian operations, as well as hefty write-downs from a restructuring. \nDouglas Flint, the group’s chairman, insisted the group’s performance was “broadly satisfactory” in the face of “volatile market conditions” caused by Brexit negotiations as well as Mr Trump’s US presidency. \nHe said: \n2016 will be long remembered for its significant and largely unexpected economic and political events. \nThese foreshadowed changes to the established geopolitical and economic relationships that have defined interactions within developed economies and between them and the rest of the world. \nHe also warned over the “threat of populism” for the year ahead. \nMr Flint cautioned over risks from “upcoming European elections, possible protectionist measures from the new US administration impacting global trade, uncertainties facing the UK and the EU as they enter Brexit negotiations, and the impact of a stronger dollar on emerging economies with high debt levels”. \nHe also reiterated 1,000 jobs may have to move from London to Paris over the next two years depending on the outcome of Brexit negotiations. \nOn an underlying basis, HSBC said pre-tax profits fell by 1% to $19.3bn (£15.5bn), stripping out a $3.1bn (£2.5bn) impairment charge in the European arm, the hit from its Brazilian sale and changes to the value of its own debt. \nNet profits fell 82% to $2.5bn (£2bn). \nThe results were branded “disappointing” by banking expert Gary Greenwood at Shore Capital. An HSBC branch (Photo: PA) Share", "external_links": [], "published": "2017-02-21T15:25:00.000+02:00", "crawled": "2017-02-21T10:39:08.050+02:00", "highlightTitle": ""}