{"organizations": [], "uuid": "b8e1914a3fa74da277ea1e2cc4e540aa4419a59d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12620042.ece/ALTERNATES/s1200/Morrisons-Launches-Search-For-The-Nations-Local-Foodmakers.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/supermarket-chain-morrisons-launches-search-12620017", "country": "GB", "domain_rank": 21960, "title": "Supermarket chain Morrisons launches search for best North East food producers", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Supermarket chain Morrisons launches search for best North East food producers", "spam_score": 0.0, "site_type": "news", "published": "2017-02-17T21:37:00.000+02:00", "replies_count": 0, "uuid": "b8e1914a3fa74da277ea1e2cc4e540aa4419a59d"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/supermarket-chain-morrisons-launches-search-12620017", "ord_in_thread": 0, "title": "Supermarket chain Morrisons launches search for best North East food producers", "locations": [], "entities": {"persons": [{"name": "tim dearing", "sentiment": "none"}, {"name": "benton", "sentiment": "none"}, {"name": "tim benton", "sentiment": "none"}, {"name": "andy higginson", "sentiment": "none"}], "locations": [{"name": "scotland", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "wales", "sentiment": "none"}], "organizations": [{"name": "business supermarket", "sentiment": "negative"}, {"name": "morrisons", "sentiment": "negative"}, {"name": "leeds university", "sentiment": "none"}, {"name": "mikael buck / morrisons", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "national farmers’ union", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Supermarket chain Morrisons launches search for best North East food producers Supermarket chains wants to stock more local produce after report warns of dangers of over-reliance on foreign food Share Morrisons is today starting a search for the best local food producers who can help to feed the nation (Photo: Mikael Buck / Morrisons) Share Get business   Thank you for subscribing!   \nSupermarket chain Morrisons has launched a campaign to hire the North East’s best local food producers amid food shortages and warnings over rising prices post Brexit. \nThe food giant has vowed to hire 200 more ‘local’ suppliers from across England, Scotland and Wales in an attempt to “be more self-sufficient in food production”, saying that only 52% of what we eat in the UK comes from British farmers. \nThe company is holding an event in Durham later this year where it will offer food producers in the North East the chance to get their goods stocked in the company’s 491 supermarkets. \nMorrisons will also be working with members of the Women’s Institutes around the region, using their local knowledge and expertise to source and select the best suppliers in their area. \nThe supermarket’s search for regional produce came after the publication of a report by Professor Tim Benton, an expert on food supplies, which says that it makes sense for the UK to be more self-sufficient in food production and build up a stronger local food sector in the face of global uncertainties. A tractor outside a Morrisons store (Photo: Mikael Buck / Morrisons) \nThe company’s chairman Andy Higginson said: “Our customers tell us they want to see more food that is made just down the road from their own communities and that’s why we are looking for the next generation of British and local foodmakers to serve our 12m customers. \n“We want small UK food suppliers to become bigger ones – the Innocent Smoothies of tomorrow – and we also want to give our customers the option of more food that meets their local food tastes. \n“Morrisons is already British farming’s biggest single customer and the publication of the report today from Professor Benton makes us more determined to produce more of our food and source more from local British suppliers.” \nIn his report on the state of British food production Prof Benton, of Leeds University, highlights the dangers of relying on too much foreign food at a time of climate change and potential trade wars. He also points to a decline in the range of crops grown in the UK. Read More Waitrose to close a number of stores - but North East escapes the axe \nHe says that UK customers trust British food and buying more of it will have knock-on benefits for the rural economy. \nMorrisons’ drive to increase sales of local produce comes after a number of initiatives in recent years to back British farming. \nBut the company was involved in a row with the National Farmers’ Union earlier this week over claims that it had slipped from its commitment to have 100% British lamb products. \nTim Dearing, Morrisons regional manager for the North East says: “Our customers tell us they want to see even more food that is made in the North East and that’s why we’re asking the best suppliers to get in touch.” \nFinal details of the event in Durham are being finalised but it will take place in the week commencing May 1. Anyone wanting to apply for consideration by the firm should apply before March 31 at www.morrisons.com/local . Like us on Facebook", "external_links": [], "published": "2017-02-17T21:37:00.000+02:00", "crawled": "2017-02-17T17:17:23.530+02:00", "highlightTitle": ""}