{"organizations": [], "uuid": "9e299d819b55f63c3142db8cefbb62fa6e03851e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12540420.ece/ALTERNATES/s1200/China-Trump.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/news-opinion/donald-trump-not-just-dangerous-12540478", "country": "GB", "domain_rank": 21960, "title": "Donald Trump is not just a dangerous nutter; he's a fast-moving dangerous nutter", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Donald Trump is not just a dangerous nutter; he's a fast-moving dangerous nutter", "spam_score": 0.0, "site_type": "news", "published": "2017-02-02T01:00:00.000+02:00", "replies_count": 0, "uuid": "9e299d819b55f63c3142db8cefbb62fa6e03851e"}, "author": "Bernard Trafford", "url": "http://www.chroniclelive.co.uk/news/news-opinion/donald-trump-not-just-dangerous-12540478", "ord_in_thread": 0, "title": "Donald Trump is not just a dangerous nutter; he's a fast-moving dangerous nutter", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "negative"}, {"name": "donald tr", "sentiment": "negative"}, {"name": "trump", "sentiment": "none"}, {"name": "tourette", "sentiment": "none"}, {"name": "nellie", "sentiment": "none"}, {"name": "bernard trafford", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "senate", "sentiment": "none"}, {"name": "u.s. consulate", "sentiment": "none"}, {"name": "royal grammar school", "sentiment": "none"}, {"name": "getty images north america)  trump", "sentiment": "none"}, {"name": "invalid email  trump", "sentiment": "none"}, {"name": "muslim", "sentiment": "none"}, {"name": "congress", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "cia", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}, {"name": "supreme court", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Opinion Activists chant slogans with placards during a protest against U.S. President Donald Trump's selective country travel ban outside of the U.S. Consulate in Hong Kong (Photo: AP) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nTrump. He’s dominating newspapers, TV, radio, social media: everywhere you look, it’s Trump. It’s as if Nellie the Elephant’s taken over the world. \nRemember her? She famously packed her trunk and said goodbye to the circus. “Off she went with a trumpety-trump, trump, trump, trump!” We now know where she went: Washington (OK, with a bit of gender-reassignment too. This metaphor won’t stand up to scrutiny). \nMany commentators have mentioned the fact that, in childish language, trumping is synonymous with farting. Somehow even that infantile pleasure has now worn off: he’s just not funny any more. \nI write a lot. Most is educational, reflecting my day job: but Trump creeps in even there. It’s just Trump, Trump, Trump, as if a whole new strain of Tourette’s Syndrome has broken out on a global scale. \nYou could say it has. The reach of the US President (POTUS as the office is now generally termed on social media) is truly global: by any standard he’s the most powerful leader in the world, even before he “makes America great again!” A man waves a flag outside the Supreme Court in London \nMy complaint is that he’s having an adverse effect on my writing. I’ve been conscious of my prevailing gloomy tone since the Brexit vote. An unashamed Remoaner, yet a democrat who has to accept even a lousy decision taken by the electorate, I’ve been coming to terms with it, marginally cheered that the doom prophesied by some has not come to pass – not yet, at any rate. \nBut if, for a while, I’d convinced myself that we weren’t all heading for hell in a handcart, I was soon corrected when the US voted Trump in. \nIt’s not just his propensity for outrageousness – including unacceptable racist, sexist and otherwise abhorrent views and policies. He’s also a nightmare for those of us who like to comment in the media because he moves so damned fast. \nHe only took office on 20th January. How he’s managed already to sign so many executive orders without any check or balance from Senate or Congress I’ve no idea, but he has. With blinding speed. Read More New Donald Trump petition backs UK state visit - how many people from your area have signed it? \nLast Friday I penned a blog castigating Trump’s approval of waterboarding, if not more serious forms of torture. Yet, by the time I’d used that almost instant method of publishing, he’d moved on: my topic was forgotten and the civilised world was howling in protest at his order banning all refugees and citizens from seven predominantly Muslim countries. He’s not just a dangerous nutter: he’s a fast-moving dangerous nutter! \nThere! I’ve said it: I’ve dared to print what so many are thinking. As a result, maybe the CIA is already monitoring my huge daily influx of unbelievably tedious emails: it’s welcome to them! U.S. President Donald Trump (Photo: Getty Images North America) \nTrump’s rule is not illegitimate. He’s odious and, in many ways, absurd: but, before we organise mass expressions of outrage, we should recall that he’s democratically elected to lead his nation. His mandate may not be massive, and on this side of the Pond we may be puzzled by the mismatch between the popular vote and the electoral colleges: but that’s their system. \nNotwithstanding everything above, perhaps the most unforgivable effect of his whirlwind first days in office lies in the following sad tale. \nNowadays I send my Dad, 96, a weekly selection of my latest blogs and columns. On Sunday he commented with uncomfortable candour that my recent pieces have become, well, dull. Read More 70 MPs try to prevent Donald Trump visiting and speaking at Parliament \nHe’s right. Why? I think it’s because Trump pops up in everything I write and sours it. He’s like that dodgy shellfish whose taste you can’t get rid of, even after a swigging a bottle of Listerine. \nNow, that really is unacceptable. So take to the streets if you like! Condemn his executive orders! Tear into his cronyism and blast his intolerance! \nBut save a slogan and a placard for writers like me for whom Trump has become a tick, a tapeworm, a mother-in-law, that unwelcome guest we just can’t shake off. \nAnd he’s hurting us. \nDr Bernard Trafford is headmaster of the Royal Grammar School in Newcastle. He writes here in a personal capacity. Read More", "external_links": [], "published": "2017-02-02T01:00:00.000+02:00", "crawled": "2017-02-01T21:03:14.915+02:00", "highlightTitle": ""}