{"organizations": [], "uuid": "3dd114a84356083af0d502467eb157834791dbe3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article11749072.ece/ALTERNATES/s1200/JS97095416.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/brexit-plan-glance-what-means-12546832", "country": "GB", "domain_rank": 21960, "title": "Brexit plan at a glance: What it means for workers' rights, immigration and air travel", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Brexit plan at a glance: What it means for workers' rights, immigration and air travel", "spam_score": 0.0, "site_type": "news", "published": "2017-02-02T22:12:00.000+02:00", "replies_count": 0, "uuid": "3dd114a84356083af0d502467eb157834791dbe3"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/brexit-plan-glance-what-means-12546832", "ord_in_thread": 0, "title": "Brexit plan at a glance: What it means for workers' rights, immigration and air travel", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "neutral"}, {"name": "jack", "sentiment": "none"}, {"name": "owen humphreys/pa wire", "sentiment": "none"}, {"name": "brexit bill", "sentiment": "none"}, {"name": "steve parsons/pa wire", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "elizabeth tower", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "eu brexit", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "wales", "sentiment": "none"}, {"name": "republic of ireland", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "neutral"}, {"name": "houses of parliament", "sentiment": "none"}, {"name": "european court of justice", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}, {"name": "british airways", "sentiment": "none"}, {"name": "ecj", "sentiment": "none"}, {"name": "border force", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily   \nTheresa May is to ask EU leaders to give the UK a trade deal like the one we have now - but without freedom of movement. \nThe plan for a new trade deal allowing existing trading arrangements “to continue when we leave the EU” is revealed in the Government’s long-awaited White Paper on Brexit . \nAnd the document, 77 pages setting out proposals for quitting the EU, says that Ministers hope the new trade deal will be based on the arrangements that already exist. \nBelow are its key points: Trade Nissan's plant in Sunderland (Photo: Owen Humphreys/PA Wire) \nThe UK will leave the single market but seek a free trade agreement to ensure the “most frictionless trade possible” in goods and services with the EU. \nIt will try to strike a new customs agreement, which could involve leaving the tariff-free customs union completely or remaining a partial signatory to some aspects. \nBecause Britain already has zero tariffs on goods and common regulations with the EU, a new trade deal could “take in elements” of current single market arrangements. \nUK taxpayers will no longer pay “vast” contributions into the Brussels budget but there may be certain EU programmes where the country has an interest in making an “appropriate” payment to take part. \nThe Government will attempt to strike trade deals with countries around the world. Immigration A Border Force officer checking passports (Photo: Steve Parsons/PA Wire) \nBritain will regain full control of the number of people coming to the country from the EU and free movement of people will no longer apply. \nThe new immigration system will be designed to help fill skills shortages and welcome “genuine” students. \nBut any new approach could be “phased in” to give businesses and individuals time to plan and prepare for the new arrangements. \nBusinesses and communities will be consulted throughout and Parliament will have an “important role” in shaping a new system, which is likely to be brought forward in its own legislation. The rights of EU nationals living in the UK \nMinisters will seek to secure the rights of around 2.8 million EU nationals who live in the UK as soon as possible in negotiations. \nBut they will only do so when similar rights are guaranteed for the one million British immigrants in continental Europe. \nThe Government said it wanted to resolve the issue before formal negotiations but not all EU member states supported its approach. Sovereignty A Union Jack flag flutters in front of the Elizabeth Tower, commonly known as Big Ben (Photo: Getty Images Europe) \nBritain will leave the jurisdiction of the European Court of Justice (ECJ) but seek to set up separate resolution mechanisms for things like trade disputes. \nMinisters say arbitration systems are common in trade deals the EU strikes with other countries, such as with Canada or South Korea. Avoiding a cliff-edge Brexit \nThe Government is likely to phase in new rules after leaving the EU to give businesses and the public sector time to plan and prepare. \nMinisters will seek to agree a deal on the new relationship within the two-year formal exit process under Article 50 and then have a “phased process of implementation” before being completely free of Brussels regulations. Security and defence British Airways fleet \nBritain will continue to collaborate with the EU to fight crime and terror, with a focus on operational and practical cross-border co-operation, while continuing to back European interests around the world, including potential support for sanctions. The Irish border \nThe UK will seek to maintain the soft border between Northern Ireland and the Republic of Ireland by protecting the Common Travel Area, which was set up in 1923, long before the EU. \nThe Government wants to see as “seamless and frictionless” trade and movement of people between Northern Ireland and Ireland as possible. Workers’ rights \nThe Government will protect workers’ rights enshrined in EU law and attempt to enhance them as it takes back powers from Brussels. Read More MPs overwhelmingly back Brexit Bill in historic House of Commons vote Scotland, Wales and Northern Ireland \nThe UK Government will seek to strengthen the Union by devolving powers previously covered by EU laws in areas where the home nations already have some competence, such as agriculture, the environment and transport. Providing clarity \nMinisters will provide certainty wherever it can to reassure business, the public sector and the public during the negotiation talks. \nThe final deal will be put to a vote in both Houses of Parliament. Read More Government sets out EU Brexit plan as White Paper is published Science and innovation \nBritain will seek an agreement to continue to collaborate with European countries on science, research and technology initiatives. Read More", "external_links": [], "published": "2017-02-02T22:12:00.000+02:00", "crawled": "2017-02-02T17:56:31.304+02:00", "highlightTitle": ""}