{"organizations": [], "uuid": "bd3d1e85fcf2605e373052c18f7eb1f2c622d536", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12555956.ece/ALTERNATES/s1200/Sheep-with-lambs-in-Northumberland.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/farming/farm-subsidies-should-devolved-regions-12554384", "country": "GB", "domain_rank": 21960, "title": "Farm subsidies should be devolved to regions like the North East, report says", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Farm subsidies should be devolved to regions like the North East, report says", "spam_score": 0.0, "site_type": "news", "published": "2017-02-06T07:01:00.000+02:00", "replies_count": 0, "uuid": "bd3d1e85fcf2605e373052c18f7eb1f2c622d536"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/farming/farm-subsidies-should-devolved-regions-12554384", "ord_in_thread": 0, "title": "Farm subsidies should be devolved to regions like the North East, report says", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "none"}, {"name": "ed cox", "sentiment": "none"}, {"name": "anna round", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}], "organizations": [{"name": "business farm", "sentiment": "negative"}, {"name": "european union", "sentiment": "none"}, {"name": "ippr north", "sentiment": "none"}, {"name": "ippr", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "european union share", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Farm subsidies should be devolved to regions like the North East, report says Report by think tank IPPR North calls for subsidies to be more focussed when the UK leaves the European Union Share A sheep with two lambs in Northumberland (Photo: iStockphoto) Share Get business   Thank you for subscribing!   \nSubsidies for farming should be set at a regional level to unlock rural growth after Brexit, a leading think-tank has said. \nIPPR North, which has an office in Newcastle, says leaving the EU provides the opportunity to re-think farm subsidies to provide the best support for the rural economy in areas like the North East. \nFarming policy should be better matched to local economies, the group’s report says, such as by linking subsidies to flood prevention to help businesses avoid damage. \nAnd it says that limited funding should prioritise agricultural and food production, and link agriculture to scientific innovation. \nAnna Round, senior research fellow at IPPR North, said: “There is no single rural economy. The economy in rural areas is by its nature hugely diverse and covers much more than the ‘tractor and tourism’ stereotype but also hotspots of high-tech businesses such as advanced manufacturing, agri-tech and digital innovation. \n“This means a devolved, targeted approach is needed to really get the rural economy firing on all cylinders post-Brexit. \n“At a national level, we have a once-in-a-generation opportunity to get a farming policy that really works for the UK. \n“This will mean we must be as strategic as possible in how every penny is spent, prioritising environmental protections to prevent flooding, linking agriculture to scientific innovation, and boosting food production for both the UK and for exporting.” \nThe IPPR report says agriculture is key to the UK’s thriving food manufacturing sector, which stands to benefit post-Brexit due to the more competitive pound boosting exports. \nBut it says that current rules and funding for agriculture fail to properly link it with local economies. Because rural economies vary so much, it says, more devolved approach is best. \nThe report also calls for subsidies to be focussed on meeting the UK’s domestic food needs in a sustainable way, key environmental protection on issues like flood management and boosting food exports. \nIPPR North director Ed Cox said: “The vote to leave the vote was a big vote against the status quo and to take back control. \n“Devolution to people, councils and communities is essential as we leave the European Union in rural areas just as much as cities.” Like us on Facebook", "external_links": [], "published": "2017-02-06T07:01:00.000+02:00", "crawled": "2017-02-06T03:08:53.709+02:00", "highlightTitle": ""}