{"organizations": [], "uuid": "ab5b164d826286a5332db28ba55a99e18bc5d540", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article11054424.ece/ALTERNATES/s1200/JS73334597.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/26m-investment-metrocentre-pledged-owners-12647315", "country": "GB", "domain_rank": 21960, "title": "£26m investment at Metrocentre pledged by owners Intu Properties", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "£26m investment at Metrocentre pledged by owners Intu Properties", "spam_score": 0.0, "site_type": "news", "published": "2017-02-23T21:36:00.000+02:00", "replies_count": 0, "uuid": "ab5b164d826286a5332db28ba55a99e18bc5d540"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/26m-investment-metrocentre-pledged-owners-12647315", "ord_in_thread": 0, "title": "£26m investment at Metrocentre pledged by owners Intu Properties", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Business £26m investment at Metrocentre pledged by owners Intu Properties The investment follows last year's work to open up new dining zones at both Metrocentre and Eldon Square Share Inside intu Metrocentre in Gateshead Share Get business   Thank you for subscribing!   \nA £26m investment is to be made at the North East’s largest shopping centre after its owners Intu Properties unveiled a multi-million pound spending programme. \nIntu – which owns the Metrocentre and Eldon Square – will plough the sum into its Gateshead centre , which now has 316 stores, using the funds on mall refurbishment as well as ‘right-sizing’ of its shop units. \nThe announcement has been made in full-year results for the year ended December 31 2016 for the firm, which owns 17 centres across the UK and Spain. \nIn the accounts Intu said it had not been impacted by the Brexit vote , saying people are still very much shopping and retailers are still keen to be in the firm’s prime, high footfall centres. \nThe year saw the company record a footfall rise of 1.3% compared to a fall of 2% in the national ShopperTrak retail average, and retailers opened more than 200 shops, investing nearly £100m in their units. \nNet rental income topped £447m, up 2%, and underlying earnings increased by 7% to £200m. \nIn all, the firm has a current development pipeline of £655m which includes a raft of activities besides the Metrocentre investment , including this year’s plans to for an extension at intu Lakeside and the redevelopment of intu Broadmarsh in Nottingham and beyond 2019, intu said it has a £1.2bn pipeline of opportunities across several centres. \nProfit for the year of £172m was way down on the £518m recorded last year, but the previous year’s figure was skewed by a property revaluation surplus of £351m. Read More Haggling for millennials: How online shoppers can bag some bargains \nThe year saw the firm complete casual dining developments at both North East centres, with nine new additions to intu Metrocentre and 20 at intu Eldon Square, and David Fischel, intu chief executive, said both restaurant developments have delivered good financial returns. \nThe overall market value of intu Eldon Square rose from £299.7m to 317.7m, thanks to improved leisure offerings and Grey’s Quarter opening fully let, along with and improved tenant mix and minimal empty units. \nHowever, intu Metrocentre was down to £945.2m from £952.2m, having been impacted by the increase in stamp duty while seeing no real increase in rental values. \nDuring the year the firm agreed 214 long-term leases and many established fashion retailers increased the size of their units, including New Look Men, which opened its largest store to date at intu Metrocentre. Read More All change at Fenwick as chairman steps down to be replaced by former Co-op CEO \nMr Fischel said the firm is also introducing new concepts to our shopping centres, blurring the lines between short- and long-term lettings, including car showroom pop-ups, such as Mercedes Benz, across the portfolio. \nMr Fischel said: “In a year which will be remembered for its political turbulence, intu is pleased to have recorded a strong set of results. \n“With our focus on compelling customer experiences and family friendly fun day-out destinations, we are continuing to meet the demands of the changing retail world, recording increased footfall and 96% occupancy. \n“While the environment for business this year is likely to be challenging as the full impact emerges of the UK’s EU referendum vote, we are well positioned as we focus on top quality assets in prime locations with high occupancy and strong footfall.” Like us on Facebook", "external_links": [], "published": "2017-02-23T21:36:00.000+02:00", "crawled": "2017-02-23T17:06:29.634+02:00", "highlightTitle": ""}