{"organizations": [], "uuid": "da8bc461904c74d23278221e86770e37c4d40568", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12659001.ece/ALTERNATES/s1200/Hate-crime-figures.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/need-more-stop-hate-crime-12658996", "country": "GB", "domain_rank": 21960, "title": "We need to do more to stop hate crime - that's why Britain needs a Hate Crime Offenders Register", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "We need to do more to stop hate crime - that's why Britain needs a Hate Crime Offenders Register", "spam_score": 0.0, "site_type": "news", "published": "2017-02-27T01:00:00.000+02:00", "replies_count": 0, "uuid": "da8bc461904c74d23278221e86770e37c4d40568"}, "author": "Thom Brooks", "url": "http://www.chroniclelive.co.uk/news/north-east-news/need-more-stop-hate-crime-12658996", "ord_in_thread": 0, "title": "We need to do more to stop hate crime - that's why Britain needs a Hate Crime Offenders Register", "locations": [], "entities": {"persons": [{"name": "thom brooks", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "cleveland", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "wales", "sentiment": "none"}], "organizations": [{"name": "cps", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "durham law school", "sentiment": "none"}, {"name": "cps north east community involvement panel", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "A sign held during an anti racism protest (Photo: PA) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nHate crime isn’t something new. But its continuing rise is a serious problem that must be tackled. Doing nothing or being complacent are not options. \nIndividuals become hate crime victims where their being a victim is a result of their offender’s prejudice against them because of their race, religion, sexual orientation, disability or because they are transgender. \nThe main idea is that offending is a public wrong whoever the victim might be. If a victim was targeted as a result of their simply having certain characteristics – such as having a disability or appearing to be a member of an ethnic minority – this is considered to be a more dangerous public wrong. A key problem here is that the victim could have been anybody: a hate crime is a crime targeting a group. Bad enough that a crime has happened, but even worse than that when it could have been anybody – what a person is counts for more than who the person is. Hate crimes are offences we can all do without. \nSadly, hate crimes are on the rise. While they have been happening long before Brexit, there has been a noticeable increase in hate crimes reported to police since the controversial referendum result. \nOver the last year, about 75% of all police forces in England and Wales reported record numbers of hate crimes. Some areas had increases by 50%. Durham saw a rise of 16% and Cleveland rose by nearly a third. \nThere are several factors relevant. Police forces are getting better at recording reported hate crimes. More work has gone into engaging with communities to support victims coming forward and addressing concerns. This is very welcome and continuing. \nThe Crown Prosecution Service is getting better at prosecuting hate crimes, too. I’ve had the pleasure of serving on a CPS North East Community Involvement Panel and the efforts put into getting this right by the CPS are genuinely commendable. Of course, procedures and systems must be routinely monitored and improved – but hate crimes are squarely on the radar. Law enforcement and prosecutors are very much on the case even if there is always further work to be done. \nThese efforts at better recording hate crimes and prosecuting them may explain why more are being reported, but go nowhere near the major increases we’ve seen over the last year. If we’re to make more progress on tackling hate crimes, we need to do something different. \nLocking more people up for longer – without the right support within prisons in place – is both highly expensive and ineffective. When the US state of California brought in – by popular referendum – a ‘Three Strikes and You’re Out’ law that saw anyone convicted for a third felony offence sentenced to life in prison, several things went wrong and most especially the cost of incarcerating everyone affected went through the roof and a significant chunk of the state’s annual budget was going to prisons instead of to schools and health care. Studies found that any deterrence effect was negligible: the hugely expensive – and at the time popular – reforms became a failed experiment. \nSo we need to do something different to help bring down rising hate crime. \nLet’s launch a Hate Crime Offenders Register. It would work much like a register for sex offenders. We already know what are sexual offences. In addition to any sentencing, there are further restrictions – a ban on working with children and vulnerable people, limits on ability to go near certain locations. Plus it is subject to review to remove it under certain conditions satisfying a high threshold. \nWe should act similarly with individuals convicted of hate crimes. They should be restricted from working with similar groups and face similar kinds of restrictions on movement relating to the kinds of hate crimes they committed – all of it subject to future review so that those who make amends and turn their lives around for the better are not labelled hate crime offenders any longer than necessary. \nWe already know what are hate crimes. We already use a similar kind of register. There is already precedent in how cases are reviewed. Such a model could be launched quickly and potentially effectively. \nNo law will make everyone avoid criminal behaviour. I don’t believe for a second that a Hate Crime Offenders Register – or any other such proposal – will stop all hate crimes from happening. \nBut that is no reason to do nothing. We have crimes against committing murder – but murders still happen. We criminalise theft and people still steal. These are not reasons to legalise murder and theft. Instead they give us cause to think again how the laws we have can be improved – as well as the support many offenders (and the wider public) too rarely receive. \nNo register will stop hate crimes, but it can bring hate crimes down. It is a way of our society making a more vocal declaration that hate crimes will not be tolerated. Crime is bad enough, but to be fuelled or caused by hatred towards people on what they are is even worse. \nIf we’re not comfortable with hate crime offenders teaching young children or working with vulnerable adults, then a Hate Crime Offenders Register is one way of making that happen. \nA Hate Crime Offenders Register can be a tool used fairly quickly to send out a clearer signal to help stop the rise of hate crime in our region and nationally. \nIn the absence of better alternatives, it may be an idea whose time has come. \nThom Brooks is Head of Durham Law School and author of Becoming British (Biteback 2016) Like us on Facebook", "external_links": [], "published": "2017-02-27T01:00:00.000+02:00", "crawled": "2017-02-26T21:11:18.102+02:00", "highlightTitle": ""}