{"organizations": [], "uuid": "bd886315db964f5097c6578b103d322d6ff81f42", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12538859.ece/ALTERNATES/s1200/mosque.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/hate-crime-culprits-should-made-12636136", "country": "GB", "domain_rank": 21960, "title": "Hate crime culprits should be made to sign a register like sex offenders - academic claims", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Hate crime culprits should be made to sign a register like sex offenders - academic claims", "spam_score": 0.0, "site_type": "news", "published": "2017-02-22T12:00:00.000+02:00", "replies_count": 0, "uuid": "bd886315db964f5097c6578b103d322d6ff81f42"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/hate-crime-culprits-should-made-12636136", "ord_in_thread": 0, "title": "Hate crime culprits should be made to sign a register like sex offenders - academic claims", "locations": [], "entities": {"persons": [{"name": "paul nuttall", "sentiment": "none"}, {"name": "brooks", "sentiment": "none"}, {"name": "thom brooks", "sentiment": "none"}, {"name": "matthew feldman", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}], "locations": [{"name": "sunderland", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "wales", "sentiment": "none"}], "organizations": [{"name": "durham university’s law school", "sentiment": "none"}, {"name": "northumbria police", "sentiment": "none"}, {"name": "european parliament", "sentiment": "none"}, {"name": "durham police", "sentiment": "none"}, {"name": "press association", "sentiment": "none"}, {"name": "teesside university", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "home affairs committee", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "cleveland police", "sentiment": "none"}, {"name": "commons home affairs committee", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Sunderland mosque targeted by vandals in hate crime Share Get daily   Thank you for subscribing!   \nPeople guilty of hate crimes should be put on an official register and barred from certain jobs, according to a North East academic. \nThe “Hate Crime Offenders Register” would work in a similar way to the sex offenders register, which lists people convicted or cautioned for a sexual offence against children or adults. \nThom Brooks, Professor of Law and Government and head of school at Durham University’s Law School, suggested creating a similar register for hate crimes such as racist abuse or assaults, in evidence submitted to a Commons inquiry. \nThe Commons Home Affairs Committee is holding an inquiry into hate crime and its consequences. \nIn a written submission, Professor Brooks said some victims of hate crimes may be reluctant to report incidents to the police. \nHe said: “Given increasing concerns about hate crimes, there may be scope for Parliament to consider establishing a Hate Crime Offenders Register along the lines of the Sex Offenders Register – and to similar effect. \n“Anyone on a Hate Crime Offenders Register could be restricted from working with children and/or working in certain professions. This seems sensible, mirrors current policies in place and would help send a clearer signal of how serious these offences are.” A sign held during an anti racism protest (Photo: PA) \nRecord levels of hate crime were reported by three-quarters of police forces in England and Wales in the aftermath of last year’s EU referendum , and in some areas the number of incidents jumped by more than 50%. \nFigures complied by the Press Association found there were 394 hate crime offences recorded by Northumbria Police from July 2016 to September 2016, an increase of 48% compared to the previous six months. \nCleveland Police recorded 159 offences, an increase of 29%, and Durham Police recorded 66 offences, up by 16%. \nThe meaning of the statistics is contested. Ukip leader Paul Nuttall has said that such incidents have been “overblown” in an attempt to “rubbish Brexit”. \nHe told the Independent: “A lot of that [rise in hate crimes] is fabricated. \n“Of course there will be individual instances and people should never be victims of hate crime at all. \n“I’ve said this in the chamber in the European Parliament, my heart goes out to those people who have been victims, but I think a lot of this has been overblown specifically to try to rubbish Brexit.” Thom Brooks \nSpeaking to the Home Affairs Committee last month, another North East academic warned that the internet provided new opportunities to fascist and racist organisations. \nProfessor Matthew Feldman, co-director of the Centre for Fascist, Anti-Fascist and Post-Fascist Studies at Teesside University, told the inquiry; “The internet is the perfect storm in a teacup for the far right: it’s global; it’s potentially anonymous; it is potentially permanent in terms of the material that is there; and of course places like the United States, which are pretty close to having unrestricted free speech, allow you to host servers there. Read More Race hate crime in North East soars to record levels in post Brexit period \n“So, in that sense the far right has cottoned on to the value of the internet.” \nHe said the internet was “perfectly built for a far right that was, let’s say 30 or 50 years ago, meeting in the backrooms of pubs, dealing with these kind of dodgy off-prints of holocaust denial, or something like that. It is much, much easier now to circulate and attempt to normalise some of that discourse.” Video Loading Click to play Tap to play The video will start in 8 Cancel Play now", "external_links": [], "published": "2017-02-22T12:00:00.000+02:00", "crawled": "2017-02-22T07:20:36.417+02:00", "highlightTitle": ""}