{"organizations": [], "uuid": "e3f1ff3cd3e5e349d08c9022e2359c6386d23c87", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12573395.ece/ALTERNATES/s1200/Singapore.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/forget-china-india-asean-countries-12572974", "country": "GB", "domain_rank": 21960, "title": "Forget China or India. The ASEAN countries are the latest hot spot for export growth", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Forget China or India. The ASEAN countries are the latest hot spot for export growth", "spam_score": 0.0, "site_type": "news", "published": "2017-02-08T18:00:00.000+02:00", "replies_count": 0, "uuid": "e3f1ff3cd3e5e349d08c9022e2359c6386d23c87"}, "author": "nechronicle", "url": "http://www.chroniclelive.co.uk/business/business-news/forget-china-india-asean-countries-12572974", "ord_in_thread": 0, "title": "Forget China or India. The ASEAN countries are the latest hot spot for export growth", "locations": [], "entities": {"persons": [{"name": "north", "sentiment": "neutral"}, {"name": "dakers", "sentiment": "none"}, {"name": "mark lane", "sentiment": "none"}, {"name": "paul charlton", "sentiment": "none"}, {"name": "michael shanley", "sentiment": "none"}, {"name": "rowan", "sentiment": "none"}, {"name": "michael knox", "sentiment": "none"}, {"name": "mike rowan", "sentiment": "none"}, {"name": "brian dakers", "sentiment": "none"}, {"name": "parker hannifin", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "india", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "myanmar", "sentiment": "none"}, {"name": "philippines", "sentiment": "none"}, {"name": "south east asia", "sentiment": "none"}, {"name": "asia-pacific", "sentiment": "none"}, {"name": "berkeley", "sentiment": "none"}, {"name": "thailand", "sentiment": "none"}, {"name": "indonesia", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brunei", "sentiment": "none"}, {"name": "seaham", "sentiment": "none"}, {"name": "vietnam", "sentiment": "none"}, {"name": "cambodia", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "laos", "sentiment": "none"}, {"name": "malaysia", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}], "organizations": [{"name": "asean", "sentiment": "neutral"}, {"name": "asean (association of southeast asian nations", "sentiment": "none"}, {"name": "northumbria university", "sentiment": "none"}, {"name": "ellice consulting  to", "sentiment": "none"}, {"name": "north east chamber of commerce", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "north east england chamber of commerce", "sentiment": "none"}, {"name": "pdl", "sentiment": "none"}, {"name": "atradius", "sentiment": "none"}, {"name": "ellice consulting", "sentiment": "none"}, {"name": "prima", "sentiment": "none"}, {"name": "james berkeley", "sentiment": "none"}, {"name": "pte ltd", "sentiment": "none"}, {"name": "true potential", "sentiment": "none"}, {"name": "european business awards  dakers", "sentiment": "none"}, {"name": "pdl solutions", "sentiment": "none"}, {"name": "prima cheese", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Forget China or India. The ASEAN countries are the latest hot spot for export growth North East companies are tapping into new export opportunities in the ASEAN. Mark Lane discovers more about this fast growing Asian economy Share The ASEAN market – represented by ten nations, including Singapore (pictured) – offers huge potential for UK exporters Share Get business   Thank you for subscribing!   \nThink of Asia in terms of business and exporting and the mind will naturally default to China or India. There is another part of Asia, however, which until relatively recent years has been somewhat overlooked by North East companies involved in international trade. \nThe ASEAN (Association of Southeast Asian Nations) is a vast market which is represented by ten nations – Brunei, Cambodia, Indonesia, Laos, Malaysia, Myanmar, Philippines, Singapore, Thailand and Vietnam – each commercially developed and outward facing to varying degrees. \nLocated at the centre of the Asia-Pacific, ASEAN has a population of 626 million and an economy valued at a mouth-watering US$2.4trn. ASEAN is also the second-fastest growing Asian economy (after China), having grown by 300% since 2001 and has exceeded average global growth for the past 10 years. \nStill not convinced? Well consider also that with 67 million ‘middle class’ households – forecast to double by 2025 – ASEAN is a huge, rapidly-growing consumer market which would-be exporters ignore at their peril. \nThe good news is there are already plenty of North East businesses making their way to this exotic part of the world. Brian Dakers is international trade manager with the North East England Chamber of Commerce . He tells me the Chamber already has 48 member businesses which are currently exporting to at least one ASEAN market, “although most trade with at least two or three,” he says. Brian Dakers is international trade manager with the North East Chamber of Commerce \nSo what products are popular? Dakers says: “The products cover a wide spectrum, but there’s particular success in consumer products, predominately food and drink, which is increasingly popular in these markets, due to the increased appetites of the indigenous populations and the number of European migrants settling or holidaying there. \n“With enviable growth rates enjoyed by a number of the markets and an emphasis on diversifying the economy an undoubted consequence, this trend looks set to continue, offering significant possibilities for consumer-based products, as well as those operating in a variety of business areas, such as education. \n“There is also significant demand for more engineering products, such as those used subsea, as well as in the marine industry more broadly.” Read More Newcastle fintech firm True Potential named as finalist at European Business Awards \nDakers suggests that ASEAN is a market of surprises – one where things might not always be as they seem, hence the need – as always – for plenty of research. He adds: “It is always worth scratching below the surface of a perception you might hold of the market, to see what the figures mean for your product or service. \n“One example of this was a business I advised who had dismissed Indonesia as a market at first, due to the fact the country is over 80 per cent Muslim. This seems logical if you’re selling a product at odds with Islamic beliefs, until you consider that the remaining 20 per cent of the population of Indonesia equates to more than 50 million people.” \nOf course, there are plenty of risks doing business with ASEAN countries – as there are anywhere. This is an underdeveloped part of the world, parts of it a good decade or two behind China in terms of their commercial development. \nMike Rowan is the North’s regional manager for trade credit insurer Atradius. Asked what risk factors businesses heading to ASEAN markets need to consider, he answers: “Surprisingly, some of the main risks are very similar to those encountered when doing trade closer to home – the potential jeopardy surrounding payment. Payment delays, defaults and insolvencies are a real risk whether driven by financing requirements, mismanagement, tax regulations, fraud or labour issues. Mike Rowan is the North's regional manager for trade credit insurer Atradius \n“Political change, instability, succession and the slow pace of economic reforms within these nations also play a role. The more recent and growing territorial disputes, for example over maritime boundaries, is also a source of concern. \n“Issues of weak infrastructure and corruption – for example in the Philippines – and workforce ethics, and in-market ethnic differences, such as within Malaysia, can also emerge in and prolong political struggles, weighing heavily on economic reform and deterring investments. Contrast this with Vietnam which has been very open to international trade and investment.” Read More Northumbria University gives Gateshead manufacturer Parker Hannifin a £2.5m boost \nRisk issues aside, do the ASEAN countries represent a genuine opportunity for North East exporters? Rowan believes so. He adds: “Europe has long been an attractive trade partner due to its close proximity and EU trade agreements. However, our export credentials don’t need to be contained within these parameters. With uncertainty surrounding Brexit, the eyes of businesses are being turned to other markets across the globe to consider new trade destinations. \n“‘Made in Britain’ is an attractive label overseas and the devaluation of the pound currently enables local exporters to compete financially with other suppliers – they are well placed to realise growth by going global, capitalising on their products and services being perceived as more affordable. \n“The ASEAN region is a hot spot for export growth. It has enjoyed remarkable economic stability and progress, particularly in recent years. Out of China’s shadow, real trading opportunities have emerged for exporters to take advantage of these maturing economies; they are becoming independent sophisticated economies and mini-powerhouses in their own right.” \nJames Berkeley is an international business growth expert and managing director of Ellice Consulting. ASEAN is a market he believes offers huge potential for UK exporters, but he also suggests they need to think long and hard before taking the plunge. James Berkeley is an international business growth expert and managing director of Ellice Consulting \nTo this end, he has composed a list of questions he suggests exporters should be asking about any of the ASEAN markets before going through the green light. The first thing, he suggests, is to prioritise: “Which market needs are we most passionate about and great at, as an organisation addressing?” “Visualise a venn-diagram. What exactly lies in the middle? Ignore the rest. It might be creating, building and leveraging branded-football academies for four to 13-year age groups, dramatically increasing the number of ‘local’ stars and mass participation in football.” \nHe also suggests businesses need to “separate supposition from fact”, before heading to ASEAN markets. He adds: “What is our evidence? Are any highly similar businesses in that specific market doing what you want to do? If yes, why aren’t we there now? If no, why are we uniquely qualified to succeed?” \nIdentifying local partners should be a key element of any international trade strategy, suggests Berkeley, and it’s vital that this consideration is at the forefront of your plans for cracking the ASEAN market. He says: “You will probably need a minimum six months, and perhaps 12 months from first conversation to a signed agreement. You cannot rush building trusting relationships. Counter intuitively, the longer you take, the stronger the relationship. \n“Meet socially, as well as in business settings. Avoid all conceptual partnership discussions, a huge time waste. Have a clear, short-term piece of business in mind. Let that drive the formation of a local partnership.” \nBerkeley concludes: “It might be brief and specific to a single location or product. It might be a more enduring relationship (national, long-term). The point is that only real and immediate business should drive the collaboration.” \nPrima makes an ASEAN mark \nSEAHAM-based Prima Cheese is expert in the process of shredding and blending a variety of unique dairy products, specialising mainly in pizza cheese. Here, the company’s export supervisor, Michael Knox, gives us an insight into Prima’s work in the ASEAN countries… Michael Knox export supervisor at Seaham based Prima Cheese \nWhich of the ASEAN countries do you currently export to and how long have you been exporting to them? \nPhilippines, Singapore, Vietnam and Cambodia for the last three years. \nWhy did you target these countries and what success have you had there so far? \nWe are interested in developing the Prima brand in any country, however these countries are seeing a growing demand for pizza cheese due to more western tourists visiting these countries and due to the people becoming more exposed to western culture, so there is a growing demand for pizzas in restaurants, takeaways and hotels and that is where we come in. We have enjoyed good success so far and hope to continue doing so. \nWhat are the company’s aspirations for what it can achieve in the ASEAN countries? \nWe hope to achieve a foothold within the ASEAN markets and ensure the Prima brand is well known to companies as being a high-quality product they can rely on. We hope to begin exporting to some of the other ASEAN countries and garner a strong reputation in the process. \nWhat advice would you give to other exporters considering targeting the ASEAN countries? \nThat it is often quite a drawn out process so remain patient! It can take a long time before the first order can be processed because companies often require approval from their respective customs departments who will need to approve labelling, specifications etc and ensure that they meet their countries’ legislation regarding imports, in this case of food/dairy. It can take several months to be granted approved exporter status and begin trading. \nPDL expands in Singapore \nHexham-based engineering consultancy PDL Solutions, which provides engineering design and analysis services to its clients operating in safety critical industries, has an office in Singapore and recently deployed one of its team there on a permanent basis. We asked the company’s CEO, Paul Charlton, about the company’s expansion to the one of ASEAN’s key markets. Michael Shanley, who is heading up the Singapore office for PDL \nWhy did the company open a Singapore office? \nA number of our existing customers had their South East Asia headquarters in Singapore, so it was a logical region to target. \nIn addition, Singapore is an attractive location for UK businesses, because its legal system is based on British principles, which are easier to understand and work with. It is also a very safe and secure location to do business and it acts as a springboard to the wider ASEAN region. After a couple of years operating PDL Solutions (Asia) Pte Ltd, we decided to establish a permanent presence in Singapore by deploying our vice president Asia, Michael Shanley, to build upon the work we have done in the market since 2014. A permanent presence in the region is a demonstration of our commitment to the Singapore governmental departments, our clients in the region and it emphasises the global reach of the PDL group of companies. \nHow are things working out? \nFor the first two years we were flying in and out of Singapore on a monthly basis, building a great understanding of the market and a foothold with clients. Since having a permanent presence we have quickly increased the level of intelligence that we are gaining, the activities that we’re involved with and the orders that we’re winning. \nWhat’s the potential of the market out there for your business? \nWe see strong opportunities on a number of fronts, particularly in the midstream and downstream oil and gas sectors and the water industry in the short-term. In the future, we believe the transport and infrastructure sectors will be important targets for our niche engineering design and analysis services. \nWhat are the company’s aspirations for what it can achieve in Singapore and does it have plans for expansion in that country and/or elsewhere in the ASEAN countries? \nSingapore is a key part of our continued diversification strategy as we increase our capabilities across new industries and new geographies. It is also a strategic location for our future growth in the ASEAN region, particularly in countries such as Malaysia, Indonesia and Vietnam. Like us on Facebook", "external_links": [], "published": "2017-02-08T18:00:00.000+02:00", "crawled": "2017-02-08T14:55:30.025+02:00", "highlightTitle": ""}