{"organizations": [], "uuid": "a06fad393d89396183a3bc48def7081afa6af43c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article9801065.ece/ALTERNATES/s1200/JS49668848.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-opinion/turning-away-immigrants-isnt-just-12548886", "country": "GB", "domain_rank": 21960, "title": "Turning away immigrants isn't just morally wrong, it's not in our interests", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Turning away immigrants isn't just morally wrong, it's not in our interests", "spam_score": 0.0, "site_type": "news", "published": "2017-02-03T01:05:00.000+02:00", "replies_count": 0, "uuid": "a06fad393d89396183a3bc48def7081afa6af43c"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-opinion/turning-away-immigrants-isnt-just-12548886", "ord_in_thread": 0, "title": "Turning away immigrants isn't just morally wrong, it's not in our interests", "locations": [], "entities": {"persons": [{"name": "graeme whitfield", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "george osborne", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "federation of small businesses", "sentiment": "none"}, {"name": "national grid on tyneside", "sentiment": "none"}, {"name": "newcastle university", "sentiment": "none"}, {"name": "merz court", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Turning away immigrants isn't just morally wrong, it's not in our interests Journal business editor Graeme Whitfield on how the positive benefits of immigration are being ignored Share Get business   Thank you for subscribing! Could   \nLast week I went to Merz Court, a building at Newcastle University where lots of clever people are doing lots of clever things. \nThe building is named after the son of a German immigrant who invented the National Grid on Tyneside, so it is fitting that the researchers in Merz Court are now working on developing a ‘smart grid’ for the 21st century, looking at how electric cars can help smooth out the peaks and troughs of power coming from renewable energy sources. \nIt was fitting too that I was shown around this project by a German academic who pointed out European, African and Chinese researchers working alongside a number of English scientists. \nThis multi-national laboratory is not unique. \nMany tech companies in the North East similarly call on skilled staff from around the world, while one has only to have been ill or on holiday in the last few years to know how the NHS and our tourism industry are utterly reliant on migrant labour. \nIt is fairly obvious that many people in Britain think immigration is too high and that that is a major factor affecting the way they are voting. Former Chancellor George Osborne made much that point this week when he said that the Government was putting immigration control ahead of the economy in its stance on Brexit . Read More 'I voted against Brexit because it would be bad for the North East' \nBut the debate on immigration seems to ignore of all the positives of free movement: the academics trying to make the world a better place, the companies who grow because they can attract the right skills, the fact that you are much more likely to be treated by a foreigner than behind one in the queue at our hospitals. \nRecently a report by the Federation of Small Businesses quoted a construction company owner who said: “If I didn’t have access to my non-UK workforce I would close down. It wouldn’t be possible to operate without my European staff.” \nAnd this is the key thing about migrant workers. They are not ‘coming over here and taking our jobs’ as some people unthinkingly say. They are coming over here and supporting our jobs by keeping our employers in business. \nI find it impossible, on a purely moral basis, to tell people who have come to Britain to make a better life for them and their families, that they’re not welcome. \nWhat is slightly heartbreaking is that, even if you are completely hard-hearted about their foreigners in our communities, turning them away will harm our self-interests too. \nGraeme Whitfield is business editor of The Journal Like us on Facebook", "external_links": [], "published": "2017-02-03T01:05:00.000+02:00", "crawled": "2017-02-02T20:39:04.397+02:00", "highlightTitle": ""}