{"organizations": [], "uuid": "53e80764b5044070f128139b9b2f013db4120683", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12603994.ece/ALTERNATES/s1200/UK-inflation.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/shopping-cost-you-more-prices-12603403", "country": "GB", "domain_rank": 21960, "title": "Shopping will cost you more as prices rise, but is Brexit to blame?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Shopping will cost you more as prices rise, but is Brexit to blame?", "spam_score": 0.0, "site_type": "news", "published": "2017-02-14T23:15:00.000+02:00", "replies_count": 0, "uuid": "53e80764b5044070f128139b9b2f013db4120683"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/shopping-cost-you-more-prices-12603403", "ord_in_thread": 0, "title": "Shopping will cost you more as prices rise, but is Brexit to blame?", "locations": [], "entities": {"persons": [{"name": "arnott", "sentiment": "none"}, {"name": "mark carney", "sentiment": "none"}, {"name": "jonathan arnott", "sentiment": "none"}, {"name": "george osborne", "sentiment": "none"}, {"name": "sterling", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "sterling", "sentiment": "none"}, {"name": "ocado", "sentiment": "none"}], "organizations": [{"name": "british chambers of commerce", "sentiment": "none"}, {"name": "office for national statistics", "sentiment": "none"}, {"name": "bank", "sentiment": "none"}, {"name": "ons", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "bank of england", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "ocado", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Shopping will cost you more as prices rise, but is Brexit to blame? Shoppers are feeling the affects of Brexit in the wallet but the vote to quit the EU may also be helping manufacturers and creating new jobs Share UK inflation has hit the highest rate since 2014 (Photo: PA) Share Get daily   Could   \nPrices are going up in our shops, after inflation rose to 1.8%. \nIt follows warnings from a series of firms such as Apple, Ocado and Sonos that they are putting up prices because of the falling value of Sterling, the UK’s currency. \nAnd the bad news for shoppers has been linked to Brexit, which may be responsible for Sterling’s fall. \nBut a North East Brexit supporter said a weaker currency may be good for British manufacturers, by helping them sell more products overseas, which means it may be good for jobs. Jonathan Arnott MEP \nNorth East UKIP MEP Jonathan Arnott said: “A lower pound provides a lot of advantages to the economy, particularly at a time when manufacturing is struggling. \n“It provides a boost to our ability to export, and that in turn means more people with jobs.” Read More Npower price surge: Are you set to be hit in the pocket by price hikes \nThe Office for National Statistics (ONS) said the Consumer Price Index (CPI) measure of inflation hit 1.8% last month, up from 1.6% in December, marking its highest level since June 2014. \nAnd separate figures showed that the amount UK manufacturers are having to pay for raw materials and fuel has grown by 20.5% in January. \nA number of businesses have said they are increasing prices. \nOnline shopping firm Ocado has said it is likely to increase prices this year due to the fall in the value of the pound. \nApple has announced plans to increase the prices of apps in the UK by 25 per cent. \nSonos, a leading manufacturer of speakers and sound systems, said that the price of its wi-fi speakers would rise by between 15 and 25 per cent this month. Mark Carney, Governor of the Bank of England (Photo: PA) \nAnd a survey by the British Chambers of Commerce, which represents smaller businesses, found more than half of the UK’s small and medium-sized businesses say that they will have to raise prices over the next year because of the weakened pound. \nHowever, the figures aren’t all bad. \nThe value of Sterling fell against the Euro following last year’s referendum when the UK voted to leave the EU , but it’s still worth the same as it was in 2013, and it’s actually worth more than it was in the first half of 2011. Read More Rising fuel prices push inflation to highest rate since 2014 \nAgainst the US Dollar, it’s a different story, and Sterling is down compared to recent years. \nWhile we’ve grown used to having even lower rates of inflation in recent years, a rate of 1.8 per cent is still below the Bank of England target of 2%. This is the figure the Bank is supposed to aim for, not the maximum level allowed. \nA breakdown of the new inflation figure also shows that the cost of food and non-alcoholic drink continued to fall slightly over the past year, by 0.4 per cent, while the cost of clothes and footwear fell by 0.1 per cent. \nRoad transport costs have risen, however, due largely to increases in the cost of petrol . \nThe Office for National Statistics said in its monthly inflation report: “Within transport, the largest upward effect came from motor fuels, with prices rising by 3.4% between December 2016 and January 2017, having fallen by 2.6% a year earlier. \n“This continues the trend of increasing fuel prices seen since early 2016, reflecting movements in oil prices.” \nMr Arnott said: “It is easy to blame Brexit for anything negative that happens. But remain supporters were predicting huge economic problems immediately after the referendum if we voted to leave, and it hasn’t happened.” \nHe highlighted the announcement during the referendum campaign by George Osborne, the former Chancellor, that there would need to be an emergency tax-raising budget after the referendum in the event of a leave vote. Like us on Facebook", "external_links": [], "published": "2017-02-14T23:15:00.000+02:00", "crawled": "2017-02-14T18:36:57.349+02:00", "highlightTitle": ""}