{"organizations": [], "uuid": "ba571d81f47d822029ab031b2faf17fe0337eaa4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12294177.ece/ALTERNATES/s1200/Green-paper-on-corporate-governance.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12617016", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast RECAP: Clark to report to Government on future of Vauxhall jobs", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast RECAP: Clark to report to Government on future of Vauxhall jobs", "spam_score": 0.0, "site_type": "news", "published": "2017-02-17T14:55:00.000+02:00", "replies_count": 0, "uuid": "ba571d81f47d822029ab031b2faf17fe0337eaa4"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12617016", "ord_in_thread": 0, "title": "Business Breakfast RECAP: Clark to report to Government on future of Vauxhall jobs", "locations": [], "entities": {"persons": [{"name": "clark", "sentiment": "negative"}, {"name": "jonathon manning uber", "sentiment": "negative"}, {"name": "inga beale", "sentiment": "none"}, {"name": "dan ammann", "sentiment": "none"}, {"name": "nelson", "sentiment": "none"}, {"name": "jonathon manning brewdog", "sentiment": "none"}, {"name": "emily kenway", "sentiment": "none"}, {"name": "martin dickie", "sentiment": "none"}, {"name": "mick cash", "sentiment": "none"}, {"name": "margaret", "sentiment": "none"}, {"name": "valda goodfellow", "sentiment": "none"}, {"name": "monica galleti", "sentiment": "none"}, {"name": "goodfellow", "sentiment": "none"}, {"name": "greg clark", "sentiment": "none"}, {"name": "richard smith", "sentiment": "none"}, {"name": "len mccluskey", "sentiment": "none"}, {"name": "sajid javid", "sentiment": "none"}, {"name": "bertram", "sentiment": "none"}, {"name": "holliday", "sentiment": "none"}, {"name": "carnegie-brown", "sentiment": "none"}, {"name": "tom wills", "sentiment": "none"}, {"name": "paul", "sentiment": "none"}, {"name": "paul holliday", "sentiment": "none"}, {"name": "alan shearer", "sentiment": "none"}, {"name": "sibley", "sentiment": "none"}, {"name": "sarah smith", "sentiment": "none"}, {"name": "philip hammond", "sentiment": "none"}, {"name": "stephen martin", "sentiment": "none"}, {"name": "james martin", "sentiment": "none"}, {"name": "christophe sirugue", "sentiment": "none"}, {"name": "gerald eve", "sentiment": "none"}, {"name": "mrs goodfellow", "sentiment": "none"}, {"name": "mccluskey", "sentiment": "none"}, {"name": "jonathon manning", "sentiment": "none"}, {"name": "jonathan brady/pa wire", "sentiment": "none"}, {"name": "daniel leal-olivas/pa wire", "sentiment": "none"}, {"name": "simcoe", "sentiment": "none"}, {"name": "watt", "sentiment": "none"}, {"name": "jon sibley", "sentiment": "none"}, {"name": "james watt", "sentiment": "none"}, {"name": "john nelson", "sentiment": "none"}, {"name": "bruce carnegie-brown", "sentiment": "none"}, {"name": "javid", "sentiment": "none"}, {"name": "jo bertram", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "peterlee", "sentiment": "none"}, {"name": "aberdeen", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "luxembourg", "sentiment": "none"}, {"name": "baker street", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "bournemouth", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "aberdeenshire", "sentiment": "none"}, {"name": "columbus", "sentiment": "none"}, {"name": "luton", "sentiment": "none"}, {"name": "dublin", "sentiment": "none"}, {"name": "ponteland", "sentiment": "none"}, {"name": "sierra leone", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "glasgow", "sentiment": "none"}, {"name": "ellesmere port", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}, {"name": "newcastle haymarket", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "wood green", "sentiment": "none"}, {"name": "southern railway", "sentiment": "none"}, {"name": "berlin", "sentiment": "none"}, {"name": "brookfield", "sentiment": "none"}, {"name": "wales", "sentiment": "none"}, {"name": "frankfurt", "sentiment": "none"}, {"name": "malta", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "belgium", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}, {"name": "edinburgh", "sentiment": "none"}, {"name": "westminster", "sentiment": "none"}, {"name": "brewdog", "sentiment": "none"}], "organizations": [{"name": "vauxhall", "sentiment": "negative"}, {"name": "opel", "sentiment": "none"}, {"name": "northumbria university", "sentiment": "none"}, {"name": "lloyd", "sentiment": "none"}, {"name": "holliday inc", "sentiment": "none"}, {"name": "arriva", "sentiment": "none"}, {"name": "bbc", "sentiment": "none"}, {"name": "ugc", "sentiment": "none"}, {"name": "york", "sentiment": "none"}, {"name": "liverpool", "sentiment": "none"}, {"name": "sibley brewing company", "sentiment": "none"}, {"name": "santander", "sentiment": "none"}, {"name": "institute of directors", "sentiment": "none"}, {"name": "maritime and transport", "sentiment": "none"}, {"name": "confederation of british industry", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "merseyrail", "sentiment": "none"}, {"name": "arriva trains north", "sentiment": "none"}, {"name": "jpmorgan chase", "sentiment": "none"}, {"name": "jonathon manning goodfellow & goodfellow", "sentiment": "none"}, {"name": "newcastle united", "sentiment": "none"}, {"name": "moneysupermarket.com group", "sentiment": "none"}, {"name": "transport", "sentiment": "none"}, {"name": "tdi pont", "sentiment": "none"}, {"name": "opel vauxhall", "sentiment": "none"}, {"name": "bank of america", "sentiment": "none"}, {"name": "press association", "sentiment": "none"}, {"name": "iod", "sentiment": "none"}, {"name": "rmt", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}, {"name": "general motors", "sentiment": "none"}, {"name": "frc", "sentiment": "none"}, {"name": "3i group", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "lloyd's of london", "sentiment": "none"}, {"name": "st mary’s place", "sentiment": "none"}, {"name": "tdi pont ltd", "sentiment": "none"}, {"name": "federation of small businesses", "sentiment": "none"}, {"name": "unite", "sentiment": "none"}, {"name": "diamond inn", "sentiment": "none"}, {"name": "holliday inc limited", "sentiment": "none"}, {"name": "aon uk", "sentiment": "none"}, {"name": "aston university", "sentiment": "none"}, {"name": "fair tax mark", "sentiment": "none"}, {"name": "british chambers of commerce and association of convenience stores", "sentiment": "none"}, {"name": "psa group", "sentiment": "none"}, {"name": "close brothers", "sentiment": "none"}, {"name": "sse", "sentiment": "none"}, {"name": "start-up loan company", "sentiment": "none"}, {"name": "lloyd’s of london", "sentiment": "none"}, {"name": "uber", "sentiment": "none"}, {"name": "financial reporting council", "sentiment": "none"}, {"name": "town mouse ale house", "sentiment": "none"}, {"name": "gm", "sentiment": "none"}, {"name": "cadillac", "sentiment": "none"}, {"name": "daily telegraph", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning Uber launches financial advice sessions for UK workers \nUber is offering English courses, financial advice and introducing an appeals panel for its UK workers after facing criticism over lack of support and rights for its drivers. \nThe ride-hailing app says the changes were sparked after holding feedback sessions with “thousands” of drivers in recent months. It is now launching earnings advice sessions on how to best take advantage of the app, flexible pay options that allow drivers to cash out their fares before the end of the week and discounted online investment advice for products like ISAs and pensions. \nJo Bertram, Uber’s regional general manager for the UK, said: \nWhile drivers tell us they love the freedom of being their own boss we also know there are many things Uber can do better. \nOver the last year we’ve listened to thousands of drivers across the UK and that’s already led to improvements like the driver destinations feature. \nMs Bertram said further initiatives would be announced over the next few months. It comes shortly after Uber lost a landmark employment tribunal ruling that its drivers should be classed as workers rather than being self-employed, back in October. \nUber claimed it is a technology company rather than a taxi firm, and says employment arrangements allow its 30,000 drivers across England and Wales to be their own boss and work flexibly. But the tribunal panel offered a scathing dismissal of Uber’s arguments, suggesting the firm had tried to bamboozle its drivers and passengers with “fictions”, “twisted language” and “brand new terminology”. \nThe case was the first time Uber has faced legal action in the UK over whether its drivers are workers or self-employed. Uber has filed an appeal on the judgment. \nAs part of its new offerings for drivers announced on Thursday, Uber said workers will have access to free skills courses through FutureLearn, and free online language courses ahead of new English test requirements set to be enforced by Transport for London in September. \nDrivers that have stopped working with Uber will also have the right to appeal against “certain decisions” to a panel of other drivers, the company said. \nUber said: \nThe issue of when we have to end partnerships with drivers came up in some of our roundtable discussions. \nWhile this does not happen very frequently, it’s sometimes necessary - such as when serious incidents have been reported and investigated. “We want to ensure that this process is transparent and as fair as possible. An Uber car (Photo: PA) 9:05 Jonathon Manning Brewdog lives up to name with 'paw-ternity leave- if staff get a new furry friend \nA craft brewing company is offering staff a week of paid “paw-ternity leave” if they get a new dog. \nBrewDog, which runs a bar in Newcastle, is launching the Puppy Parental Leave programme to give employees time to bond with their new pet, whether they are welcoming a new puppy or taking in an older rescue dog. \nThe Aberdeenshire brewery is a dog-friendly workplace, with around 50 office dogs, and has already had inquiries from staff about the scheme. The puppy parental leave will also be available at its new brewery in Columbus, Ohio, which is due to open in Spring 2017. \nBrewDog co-founder James Watt said: \nIt’s not easy trying to juggle work and settle a new dog into your life, and many members of our crew have four-legged friends at home. \nSo we wanted to take the stress out of the situation and let our teams take the time they need to welcome their new puppy or dog into their family. \nWe always want to raise the bar when it comes to offering our staff the best possible benefits. At BrewDog, we care about two things above all else: People and beer. We also just really, really like dogs. \nThe company hopes the scheme will give dogs time to settle into their new home and surroundings while their owner is there. The brewery was started by Mr Watt and Martin Dickie in 2007 and both co-founders are often accompanied by their canines Simcoe and Dr Gonzo. \nIt has expanded significantly over the years and by 2015 had 540 employees and 32,000 shareholders as well as 44 bars. Employees at Brewdog's breweries will receive holidays when they get a new dog 8:58 KEY EVENT Merseyrail staff vote on industrial action \nDisputes over the role of train conductors has spread to another rail company as more workers vote on whether to strike. \nMembers of the Rail, Maritime and Transport (RMT) union at Merseyrail received ballot papers on Friday and are being urged to back a campaign of industrial action. \nUnion members at Arriva Trains North started voting on Thursday in a similar dispute, while the RMT is embroiled in a long-running dispute with Southern Railway, where the role of conductors has already been changed. \nRMT general secretary Mick Cash said: \nThe union’s position on driver-only operation is perfectly clear. We will not agree to any introduction of DOO and will fight to retain the safety-critical role of the guard and to keep a guard on the train. \nRMT has asked Merseyrail to give the union assurances that any new trains will have a second safety-critical crew member on board and that the guard will be retained on all services. \nWe set out clear deadlines giving the company ample time to give those assurances but the company have flatly refused to consider a guarantee of a second safety-critical person on the new trains. \nThe Arriva and Merseyrail ballots will close at the end of the month. RMT members on Southern will strike on February 22. Mick Cash, general secretary of the RMT (Photo: Jonathan Brady/PA Wire) 8:53 Jonathon Manning Goodfellow & Goodfellow cooks up £5.2m in sales as celebrities flock to their crockery \nLuxury tableware firm Goodfellow and Goodfellow is on course to smash its sales target of £6m a year ahead of target, driven by a growing list of celebrity chef clients. \nThe specialist crockery and kitchen equipment firm was launched by husband and wife team Paul and Valda Goodfellow in 2012, quickly accruing a strong client base of top restaurants in the North East and further afield. \nAfter posting sales of £1m in its first year of trading, the Peterlee firm has since opened a showroom in London’s Baker Street, where former chef Mr Goodfellow and his wife regularly welcome chefs and restaurateurs. \nSales currently sit at around the £5.2m mark and the founders, who have almost doubled headcount to 26 in the last three years, believe it is the London market that has helped its growth, which could rise higher on the back of a growing dining scene in the North East. \nTwo years ago the business was seeking to expand its offering for the home market, but for now the firm’s main focus is the professional market. \nTV cookery has given the business a boost, with many of the chefs battling it out on BBC’s Great British Menu using the company, and tableware featuring regularly on Masterchef and The Saturday Kitchen. Celebrity chef clients include James Martin and Monica Galleti, and top chefs are regular visitors to the firm’s London showroom. \nGoodfellow and Goodfellow currently has around 3,000 professional clients across the UK, Australia and the US, which is helping to drive up sales forecasts. \nMrs Goodfellow said: \nWe will hit £6m ahead of schedule, and my next aim is to hit the £10m mark. I’ll be proud when we get to that figure. \nWe have grown, and we did it in the face of such adversity because the economic picture was terrible. When times were tough we thought ‘what have we done?’ but now we’re more ambitious than ever. \nWhat we offer and the way we have done it has blown customers away, and people say we are now the go-to company. Valda Goodfellow of Goodfellow and Goodfellow (Photo: Valda Goodfellow) 8:48 KEY EVENT Sajid Javid slams 'scaremongering' over business rates \nCommunities Secretary Sajid Javid has accused “unscrupulous” companies of trying to scare business owners into thinking their taxes will soar in order to make a profit. \nMr Javid said “scaremongering” rating agents are manufacturing reports about business rates rising while “cynically” promising to help firms win an appeal against any increase “in exchange for a hefty fee”. \nHis intervention comes amid numerous negative reports about the Government’s controversial revaluation of business rates, due to come into force in April. \nMr Javid insisted that, from April 1, thousands of independent shops, small pubs and rural businesses will see their bills slashed while a third of businesses will pay no rates at all. Ministers are also facing a backlash after official figures suggested the Treasury could take in an extra £1bn after the revaluation. \nThe Government has said the predicted extra revenue is the result of growth and new properties coming into the system, and not due to existing business ratepayers being charged more. \nMr Javid also denied the accusations that the revaluation amounted to a “stealth tax”, insisting the Treasury “won’t make one penny more” as a result of the changes. But it comes after business leaders urged ministers to reconsider the pending shake-up amid warnings that it could lead to firms closing and staff being laid off. \nIn an article for the Daily Telegraph, Mr Javid said: \nAlthough there will inevitably be winners and losers in a cash-neutral revaluation, we’re taking action so the vast majority of businesses do not end up worse off, and to mitigate the impact on those who see their bills rising. \nI grew up above the family shop, and I know for myself that running a business is stressful enough without the Government adding to your worries. \nBut the only people who should be concerned about April’s changes are the scaremongering ratings agents, who are about to see much of their target audience celebrating a fall in their tax bill. \nThe Federation of Small Businesses has complained that the system is “increasingly unfair and outdated, with many facing arbitrary hikes in their bills”. An analysis by Gerald Eve, a firm which advises businesses on rates and property, suggests NHS hospitals and GP surgeries could see a £635m hike in their business rates over the next five years. \nThe Institute of Directors has called on Chancellor Philip Hammond to to tackle anomalies that see high street shops pay higher rates on small premises than online giants do for vast warehouses. \nMr Javid admitted the business rates system, which is based on the rental value of a commercial property, is not “perfect”. But he said the Confederation of British Industry, British Chambers of Commerce and Association of Convenience Stores backed it remaining in place two years ago. Communities Secretary Sajid Javid (Photo: PA Wire) 8:43 Jonathon Manning Town Mouse micropub opens at Newcastle Haymarket to champion local brewers \nA new craft beer pub is opening in Newcastle city centre to help champion North East microbrewers and their unique beers. \nThe Town Mouse Ale House starts serving next week in a basement unit on St Mary’s Place after the owner took on a former coffee shop, setting out to create new jobs as well as a new, independent venture. \nThe micropub, which has room for just 50 drinkers, is a first business for entrepreneur Jon Sibley and his newly-formed Sibley Brewing Company, initially offering four keg and four cask ales, six of which will be from small independent local brewers. \nThe Town Mouse is opening following a five-figure investment in the premises, with Mr Sibley securing a loan from the Start-up Loan Company through Transmit Start-Ups in Gateshead, and an initial three new jobs will be created. \nThe interior takes inspiration from the traditional ale houses of Belgium and basement pubs from Ireland and Berlin, and the venue will be proudly dog-friendly, with even a special ‘dog brew’ on offer. \nThe venture is a lifelong goal for Mr Sibley, who left his job in HR at Northumbria University to start life as a publican. He said: \nI am a keen home brewer and a beer enthusiast, and to open my own traditional ale house has long been a dream. When I left the university last year, it seemed an ideal time to give it a try and it’s all very exciting. \nThe quirky name reflects the premises – as it’s a basement unit, it’s dark and cosy – and we want to become known as a welcoming traditional ale house which serves great beers. \nA significant proportion of the ales we offer will come from very small brewers within the Tyne and Wear area. There are some great local beers which we are very pleased to help promote. Jon Sibley; Tom Wills; Sarah Smith 8:38 Unite sells portfolio of student accommodation for £295m \nStudent accommodation developer Unite has sold off 13 properties to fund manager Brookfield for £295m. \nThe sale includes a portfolio of properties located in Aberdeen, Birmingham, Bournemouth, Edinburgh, Glasgow, Liverpool and York totalling 4,175 beds. \nUnite said its share of the deal amounts to £102m, with the cash being used to fund further growth in mid- to high-ranked university locations with the most secure long-term growth prospects. \nPart of the proceeds will be injected into Unite’s recent 3,100 bed on-campus acquisition at Aston University and the remainder “recycled into Unite’s development activity”. \nChief executive Richard Smith said: \nThis sale is an important part of our strategy to recycle capital to fund our ongoing investments, focused on the strongest university towns and cities, where we have deep university relationships and where we can provide the best accommodation and services for our students. \nOur development pipeline supports further earnings growth as we continue to invest in strong student markets.” Unite said the move marks the first stage of a plan to recycle around £150m to £200m of assets during 2017 to take advantage of the “ongoing strength in the investment market for well let student accommodation. Funds from Unite's £295m property sale will be injected into the firm's investment at Aston University 8:33 Most consumers 'would rather shop with businesses paying fair share of tax' \nFour out of five consumers would rather shop with a business that pays its fair share of tax, a report shows. \nA survey of over 2,000 adults by the Fair Tax Mark organisation also found that a similar number preferred to work for a company that can prove its tax payments are fair. Most of those polled said they would trust a business if it was awarded a fair tax mark. \nEmily Kenway, director of the Fair Tax Mark, said: \nHard-working people have borne the brunt of austerity measures at the same time as some multimillion-pound businesses have been avoiding paying their fair share of corporation tax. \nThere is a crisis in the NHS, local libraries are closing and the social care system is on the brink of collapse. “Businesses failing to contribute to the public purse are depriving communities across the UK of vital public services.” \nThe organisation, launched in 2014 to assess corporation tax practices, launched a national map of businesses which have been awarded the accreditation - www.fairtaxmap.com . Firms including the Co-op, SSE and Lush are among those that have been given a fair tax mark. Consumers would rather shop with businesses that pay fair tax (Photo: PA) 8:27 KEY EVENT Popular Ponteland pub The Diamond Inn set to be run by new business \nA pub popular with footballers and other North East celebrities is being run by a new company after its previous operators went into liquidation. \nTDI Pont Ltd, which was previously trading as The Diamond Inn in Ponteland , filed a voluntary liquidation notice in January and has subsequently ceased trading. \nBut the venue recently named by Newcastle United legend Alan Shearer as his favourite pub is trading as normal after it was taken over by a newly formed company called Holliday Inc Limited. \nTDI Pont was owned by directors Margaret and Paul Holliday, with Mr Holliday having run the pub since 1986 after it underwent under an extensive refurbishment. Mr Holliday owns 75% of the shares of Holliday Inc. \nWhen asked whether The Diamond Inn had filed for voluntary liquidation, Mr Holliday said: \nThe Diamond Inn hasn’t, as such. The pub is still fine. It’s just the company that runs it. \nI have split a load of things up and changed a load of things, and that was one of the consequences of doing that. The Diamond Inn (Photo: UGC) 8:22 KEY EVENT Bosses back reforms to prevent another BHS-style crisis \nMore than 60% of company directors would back sweeping reforms to corporate governance that tighten the reins on private firms to help prevent another BHS-style crisis, a report has found. \nA survey of 34,000 bosses revealed two thirds want a new code of conduct to govern private companies in line with the level of scrutiny faced by publicly-listed firms, according to the Institute of Directors. \nThe findings come as the IOD looks to make its submission to the Government’s consultation on corporate governance, which closes on Friday. However, the lobby group stopped short of calling for private firms to fall under the Financial Reporting Council’s corporate governance code, which sets standards on board leadership, remuneration and shareholder relations for public companies. \nStephen Martin, director general of the IOD, said the UK’s standards for publicly-listed firms are emulated across the world, but the governance for private companies remains a mystery. He said: \nFor small companies, any new reporting requirements would be excessive, but there is a real appetite in the business community for a new code for large private firms. \nA private code would have to be less prescriptive than the one for listed corporations, based on broad governance principles rather than a lot of tick-box compliance. \nIf they get this right, the Government could really help to make boardrooms more transparent, and improve the functioning of these companies. \nThe work and pensions committee said last week that the Government would prevent another corporate crisis similar to the downfall of BHS if it made private firms abide by the FRC corporate code. It recommended that large private companies - or those with more than 5,000 defined benefit pension scheme members - should fall under FRC rules and called for changes to be made to the Companies Act 2006 to make directors at private businesses accountable to pensioners through their scheme’s trustees. Pedestrians walking past the BHS store in Wood Green, London (Photo: Daniel Leal-Olivas/PA Wire) 8:17 \nThe FTSE-100 index opened at 7277.92. \nThe pound at 8am was 1.2488 dollars compared to 1.2475 dollars at the previous close. \nThe euro at 8am was 0.8535 pounds compared to 0.8544 pounds at the previous close. 8:15 Lloyd's of London set to name Carnegie-Brown as new chairman \nInsurance market Lloyd’s of London is on course to name Santander board member Bruce Carnegie-Brown as its new chairman ahead of John Nelson’s departure later this spring. \nIt is understood that the firm’s directors are set to confirm the appointment by Monday, in hopes that Mr Carnegie-Brown will take the reins from Mr Nelson in May. \nIt will mark the end of a near-five year tenure for the Lloyd’s of London boss, who took over as chairman of the insurance market in 2011. Rumours of his planned departure first emerged in 2015. \nMr Carnegie-Brown, who is currently a non-executive vice chairman at Santander, has served on the Spanish bank’s board since 2015. He also sits on the board of its UK operations. \nThe incoming chairman was born in Sierra Leone in 1959. He spent 18 years at JPMorgan Chase and four years at Bank of America before taking up roles at Close Brothers and Aon UK, and founding the listed private equity division of 3i Group. He also also currently sits as non-executive chair of the Moneysupermarket.com Group. \nThe news comes as the insurance market gears up to reveal a location for a potential EU subsidiary as part of its Brexit contingency plans by the end of the first quarter. It would give Lloyd’s of London access to the single market even if the Government follows through with plans for a hard Brexit. \nSources told the Press Association earlier this month that Luxembourg has emerged as the frontrunner on a short list of five sites - including Malta, Dublin, Frankfurt and Paris - for a potential EU subsidiary. The move could see more than 100 jobs at the insurance market shifted from London to the continent. \nLloyd’s generates around 11% of its revenue in continental Europe and Mr Nelson and chief executive Inga Beale have previously warned that losing single market access would be detrimental. \nThe insurance market is set to outline the potential costs of a relocation when it suggests a new site to its members at the end of the first quarter. Lloyd’s may have to stump tens of millions of pounds to cover higher operating costs, regulatory requirements, and capitalisation. \nEU regulators may force Lloyd’s to capitalise a subsidiary separately, which means a portion of its cash will be put into untouchable reserves that will underpin the business. Lloyd's of London (Photo: Jonathan Brady/PA Wire) 8:10 Vauxhall workforce highly valued, minister told \nVauxhall’s brand and “committed workforce” are highly valued, Business Secretary Greg Clark has been told during crunch talks in Paris over the future of thousands of British production jobs. \nThe minister travelled to the French capital on Thursday to meet French industry minister Christophe Sirugue and board members of PSA Group, which is in talks to acquire General Motors’ loss-making European operation. \nThe deal would include Vauxhall, which has plants at Ellesmere Port and Luton employing around 3,500 staff. \nMr Clark said: \nI had constructive meetings in Paris with both my French counterpart, the industry minister, and executives of PSA Group, in which they explained the rationale behind this potential alliance. \nThey stressed that they valued highly the enduring strength of the Vauxhall brand, underpinned by its committed workforce. While discussions are still ongoing, they made clear to me that in any deal these were strengths they would wish to build on. “We agreed to remain in close contact during the period ahead. General Motors owns Vauxhall, Opel, and Cadillac 8:05 KEY EVENT Clark to report back following crunch Paris talks over Vauxhall jobs \nBusiness secretary Greg Clark is expected to report back to the Government on Friday after holding crunch talks in Paris over the future of thousands of British production jobs. \nThe minister travelled to the France on Thursday to meet French industry minister Christophe Sirugue and board members of PSA Group, which is in talks to acquire General Motors’ (GM) loss-making European operation. The deal would include Vauxhall, which has plants at Ellesmere Port and Luton, employing 4,500 staff. \nThis comes after GM said it would put Vauxhall in the “strongest possible position for the future” after attending talks with the Government and unions at Westminster today. \nGM president Dan Ammann met with Mr Clark and Unite general secretary Len McCluskey as concerns mount over Vauxhall’s 35,000-strong UK workforce. After the meeting, GM said: \nWhile we have no definitive news to report at this time, we can affirm that our objective in exploring opportunities with PSA Group is to build on the success of Opel Vauxhall and to put the business and the operations in the strongest possible position for the future. \nMr McCluskey said he had received “no assurances at the moment” over Vauxhall’s workforce, but believes “concrete proposals are imminent”. However, Mr Clark struck a more positive note, saying the talks had been “constructive” and he was reassured that the plants would not be “rationalised”. \nUnite is also seeking a meeting with PSA Group at the earliest opportunity to discuss the proposed deal that would see Vauxhall and Opel shift to the French government-backed automotive giant. The tie-up would cause GM to exit the UK and Europe, while transforming PSA Group into Europe’s second-largest car maker with a 16% share of the market. Greg Clark (Photo: Philip Toscano/PA Wire) Share", "external_links": [], "published": "2017-02-17T14:55:00.000+02:00", "crawled": "2017-02-18T01:36:00.578+02:00", "highlightTitle": ""}