{"organizations": [], "uuid": "fbdde43dbce3ad1baadfb2554b5153d8e22beeef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12619463.ece/ALTERNATES/s1200/Tony-Blair-Gives-Pro-Eu-Keynote-Speech.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/former-prime-minister-tony-blair-12619234", "country": "GB", "domain_rank": 21960, "title": "Former Prime Minister Tony Blair urges pro-Europeans to 'rise up' and stop Brexit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Former Prime Minister Tony Blair urges pro-Europeans to 'rise up' and stop Brexit", "spam_score": 0.0, "site_type": "news", "published": "2017-02-17T20:57:00.000+02:00", "replies_count": 0, "uuid": "fbdde43dbce3ad1baadfb2554b5153d8e22beeef"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/former-prime-minister-tony-blair-12619234", "ord_in_thread": 0, "title": "Former Prime Minister Tony Blair urges pro-Europeans to 'rise up' and stop Brexit", "locations": [], "entities": {"persons": [{"name": "tony blair", "sentiment": "negative"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "blair", "sentiment": "none"}, {"name": "campbell", "sentiment": "none"}, {"name": "jenny chapman", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "phil wilson", "sentiment": "none"}, {"name": "ronnie campbell", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "sedgefield", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}, {"name": "blyth valley labour", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "darlington labour", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Brexit can still be stopped, former Prime Minister Tony Blair has insisted. \nHe said leaving the European Union was not inevitable and urged supporters of EU membership to “rise up” and make the arguments for staying in. \nMr Blair, former MP for Sedgefield, called for politicians from different parties to work together, and said that the Labour Party today was too weak to put up a fight against Brexit . \nHe insisted: “They will say Leaving is inevitable. It isn’t. \n“They will say we don’t represent the people. We do, many millions of them and with determination many millions more.” \nMr Blair, Labour Prime Minister from 1997 to 2007, was speaking in London at an event organised by Open Britain, a cross-party pressure group. \nBut his proposals were immediately rejected by many Labour politicians. \nBlyth Valley Labour MP Ronnie Campbell said he believed Mr Blair was hoping to become President of the European Union. \nMr Campbell said: “Tony Blair has always wanted to be President of the EU and that is what this speech is about.” \nReferring to the House of Commons vote in which MPs backed legislation allowing the Government to trigger Article 50 and begin the process of leaving the EU, Mr Campbell said: “People voted in the referendum and we have done our democratic duty by agreeing with them. \n“Now we have to wait and see what deal we get with the EU.” \nLabour MP Phil Wilson, Mr Blair’s successor as MP for Sedgefield, said: “I voted to trigger article 50 because that decision was taken last year, but we do need to hold the government to account about what leave actually looks like \n“The definition of leave was not on the ballot paper last year. \n“if we believe one of the reasons people voted to leave was to take back control then surely we want Parliament to take back control and not just stand by and let it go through. That means holding the government to account.” \nDarlington Labour MP Jenny Chapman, a shadow minister for exiting the European Union, said on Twitter: “I defend Tony Blair as a great Labour leader who improved lives of my constituents. I do this a lot. His speech today won’t help.” \nIn his speech, Mr Blair said he wanted “to build support for finding a way out from the present rush over the cliff’s edge”. Read More People like me who predicted the worst about Brexit now need to admit we were wrong \nHe called for a “coalition” of people opposed to Brexit to persuade the public that the “pain” of staying in the EU is large and the gains are “largely illusory”. \nBut he said this would have to include people from different parties working together, because the Labour Party under Jeremy Corbyn’s leadership is to weak to put up a fight. \nMr Blair spoke about “the absence of an Opposition which looks capable on the polls of beating the Government”. \nHe said: “The debilitation of the Labour Party is the facilitator of Brexit. I hate to say that, but it is true. \n“What this means is that we have to build a movement which stretches across Party lines; and devise new ways of communication. \n“There are lots of different groups doing great work, Open Britain naturally being one. \n“These groups must find ways of concerting strategy and tactics effectively. We should begin to create informal links immediately and then build them into a movement with weight and reach. \n“We need to strengthen the hand of the MPs who are with us and let those against know they have serious opposition to Brexit At Any Cost.” \nAnd leaving the EU could mean the end of the United Kingdom, he said. \n“The possibility of the break-up of the UK – narrowly avoided by the result of the Scottish referendum – is now back on the table, but this time with a context much more credible for the independence case. \n“We are already seeing the de-stabilising impact of negotiation over border arrangements on the Northern Ireland peace process.” Video Loading Click to play Tap to play The video will start in 8 Cancel Play now", "external_links": [], "published": "2017-02-17T20:57:00.000+02:00", "crawled": "2017-02-17T16:30:11.667+02:00", "highlightTitle": ""}