{"organizations": [], "uuid": "bdbc91890fd076aa9a253029296a8fb3a4ee9919", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article10943675.ece/ALTERNATES/s1200/Peugeot-2008-1.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12606204", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Peugeot owner in talks to buy Vauxhall from General Motors", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Business Breakfast LIVE: Peugeot owner in talks to buy Vauxhall from General Motors", "spam_score": 0.0, "site_type": "news", "published": "2017-02-15T14:55:00.000+02:00", "replies_count": 0, "uuid": "bdbc91890fd076aa9a253029296a8fb3a4ee9919"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-12606204", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Peugeot owner in talks to buy Vauxhall from General Motors", "locations": [], "entities": {"persons": [{"name": "jim gee", "sentiment": "none"}, {"name": "sean hughes", "sentiment": "none"}, {"name": "mark rigby", "sentiment": "none"}, {"name": "crowe clark whitehill", "sentiment": "none"}, {"name": "ben birchall/pa wire", "sentiment": "none"}], "locations": [{"name": "st albans", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "luton", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "wales", "sentiment": "none"}, {"name": "ellesmere port", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}], "organizations": [{"name": "general motors", "sentiment": "negative"}, {"name": "vauxhall", "sentiment": "negative"}, {"name": "peugeot", "sentiment": "negative"}, {"name": "opel", "sentiment": "none"}, {"name": "gm europe", "sentiment": "none"}, {"name": "psa", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "psa group", "sentiment": "none"}, {"name": "citroen", "sentiment": "none"}, {"name": "university of portsmouth", "sentiment": "none"}, {"name": "chevrolet", "sentiment": "none"}, {"name": "cvs", "sentiment": "none"}, {"name": "bbc radio", "sentiment": "none"}, {"name": "gm", "sentiment": "none"}, {"name": "centre for counter fraud studies", "sentiment": "none"}, {"name": "cadillac", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The FTSE-100 index opened at 7268.56. \nThe pound at 8am was 1.2456 dollars compared to 1.2465 dollars at the previous close. \nThe euro at 8am was 0.8486 pounds compared to 0.8484 pounds at the previous close. 8:20 KEY EVENT Fraud 'epidemic' costing the UK £125bn a year \nBritish businesses are facing a fraud “epidemic” that is costing the UK £125bn per year, new research shows. \nFraudsters have taken advantage of technology and corporate inaction and sent the total annual losses linked to fraud and error to record levels - up 43% since 2008. \nA report by tax and advisory firm Crowe Clark Whitehill and the University of Portsmouth’s Centre for Counter Fraud Studies found that those losses are now equivalent to 6.54% of UK business expenditure. On a global basis, the financial cost of fraud now stands around £3.55tn - which is two thirds more than UK gross domestic product (GDP). \nJim Gee, head of forensics and counter-fraud at Crowe Clark Whitehill, said: \nFraud is a pernicious problem which affects every area of society. \nBusinesses are less financially stable and profitable, the quality of public services is diminished, and even charities do not get the full benefit of the donations which are made. \nOrganisations constantly analyse costs and seek to reduce them to the point of optimal efficiency, but fraud is being overlooked. \nOfficial statistics released in January showed that fraud and cyber crime now account for nearly half of all crime in the UK. However, proper fraud protection that cut losses by at least 40% would free up more than £50bn each year for the UK economy, the report said. That is more than the UK Government spent on defence or education in 2016. \nIt said that organisations that pay greater attention to the problem are shown to have “consistently lower loss rates,” but those losses will persist without adequate scrutiny. \nMr Gee added: \nOrganisations’ behaviour towards measuring and countering fraud can be the difference between a mediocre annual performance and stable growth. \nBusinesses can no longer afford to bury their heads in the sand. A computer hacker (Photo: Getty Images/iStockphoto) 8:15 Business rate rises blamed for closure of pubs \nSurging business rates have contributed to the closure of one in five pubs across England and Wales in the last six years, according to new research. \nFigures from rates and rents specialist CVS show that a fifth of pubs - or 11,443 - have closed between April 2010 and the end of last year, which is the equivalent of four pubs every day. \nThere is now the lowest ever number of pubs in England and Wales, at 43,231, down from 54,674 in April 2010. \nCVS, which compiled the research for BBC Radio 4’s You And Yours programme, said unfairly high business rates are a major factor behind the widespread pub closures. And there are fears over the health of many more pubs, as well as a raft of firms in other sectors, as rates are set to rise again in April. \nThe research suggests that 17,160 pubs will have to pay more in business rates from April, with rises for pubs in 881 towns across England and Wales. \nIt is estimated that overall business rate bills will be hiked by £421m for pubs in England and Wales over the next five years. This means pubs will have to pour an extra 121m pints to fund increases in property taxes paid to councils, CVS said. \nBut Mark Rigby, chief executive of CVS, said pubs in particular have been hit hard as rates are based on outdated valuations. They are paying their rates based on turnover valuation made in 2008, he said. He added: \n“There is no doubt about it anything that keeps operating costs high and not reflective of current circumstances is going to be a factor in terms of the long term health of the business.” \nThe Government’s recent revaluation means that all properties with a rateable worth of £12,000 or more will have to pay business rates. There are also significant differences in rate hikes, with central London pubs facing a 43% hike and those in Manchester looking at a 12% increase. \nSean Hughes, landlord of The Boot pub in St Albans, said his rates bill is set to soar by nearly 300% in April from £14,000 a year to £52,000. \nHe told You And Yours: \nIt leaves us in a very difficult situation. \nWe’ve worked out we’ll have to sell an additional 22,000 pints of beer a year just to pay for the increase. I can’t see how we’re going to do that. It’ll have a huge impact on our family run business - it makes you wonder if it’s worth it. Increased business rates have been blamed for the closure of pubs (Photo: Ben Birchall/PA Wire) 8:10 General Motors financials \nGM said last year that it had to raise UK car prices by 2.5% after the EU referendum result caused the British car industry to hit a “speed bump”. \nThe US motor giant behind Chevrolet and Cadillac added that its European arm was on course to break even before the plunge in the value of the pound following the Brexit vote. \nAnnouncing its full-year results last week, it said GM Europe had narrowed losses to $257m (£206m) in the year to the end of December, from a loss of $813m (£651m) the year before. \nIt also drove down fourth-quarter losses to $246m (£197m), from $298m (£238m) in the three months to December 31 2015. \nPSA Group, which also owns Citroen and DS, saw its Paris-listed shares jump 5% on news of a potential deal. General Motors owns Vauxhall, Opel, and Cadillac 8:05 KEY EVENT Peugeot owner PSA Group in talks to buy Vauxhall and Opel \nThe owner of Peugeot said it could buy Vauxhall and Opel from General Motors (GM) in a deal that would transform Europe’s car market. \nPSA Group is in talks over a “potential acquisition” of GM’s European car business, as it explores “strategic initiatives” aimed at boosting profits and cutting costs. However, it said there could be “no assurance that an agreement will be reached”. \nGM employs around 35,000 people in the UK under the Vauxhall brand, including 4,500 staff at plants in Ellesmere Port and Luton. \nA spokesperson for PSA said it has been working with GM on three projects across Europe since 2012, which delivered “substantial synergies” for both groups.The spokesperson added: \nWithin this framework, General Motors and PSA Group regularly examine additional expansion and cooperation possibilities, as well. \nPSA Group confirms that, together with General Motors, it is exploring numerous strategic initiatives aiming at improving its profitability and operational efficiency, including a potential acquisition of Opel. \nThere can be no assurance that an agreement will be reached. PSA group is in talks to acquire Vauxhall and Opel Share", "external_links": [], "published": "2017-02-15T14:55:00.000+02:00", "crawled": "2017-02-15T10:31:46.669+02:00", "highlightTitle": ""}