{"organizations": [], "uuid": "8fae055199391356394d449f47c280267906ea49", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12651735.ece/ALTERNATES/s1200/IBP_NEC_240217nissan_10JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/nissan-shows-faith-north-east-12651644", "country": "GB", "domain_rank": 21960, "title": "Nissan shows faith in North East with £37m investment in new press", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Nissan shows faith in North East with £37m investment in new press", "spam_score": 0.0, "site_type": "news", "published": "2017-02-24T19:26:00.000+02:00", "replies_count": 0, "uuid": "8fae055199391356394d449f47c280267906ea49"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/nissan-shows-faith-north-east-12651644", "ord_in_thread": 0, "title": "Nissan shows faith in North East with £37m investment in new press", "locations": [], "entities": {"persons": [{"name": "margot robbie", "sentiment": "none"}, {"name": "fitzpatrick", "sentiment": "none"}, {"name": "kevin fitzpatrick", "sentiment": "none"}, {"name": "ghosn", "sentiment": "none"}, {"name": "paul watson", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "carlos ghosn", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "wearside", "sentiment": "none"}, {"name": "sunderland share", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "renault-nissan alliance", "sentiment": "none"}, {"name": "hollywood", "sentiment": "none"}], "organizations": [{"name": "nissan", "sentiment": "negative"}, {"name": "sunderland council", "sentiment": "none"}, {"name": "nissan sunderland plant", "sentiment": "none"}, {"name": "european manufacturing", "sentiment": "none"}, {"name": "nissan bluebird", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "komatsu", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Nissan shows faith in North East with £37m investment in new press The 5,200 tonne press is the most advanced piece of kit unveiled by the motor manufacturer Share Click to play Tap to play The video will start in 8 Cancel Play now Watch this video again Video will play in Official launch of a new state of the art press at Nissan's car plant in Sunderland Share this video Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe launch of Nissan’s new £37m press facility marks the Japanese motor giant’s long-term commitment to the North East plant, a factory boss has declared. \nNissan unveiled the 5,200-tonne press after a two-year project to bring the firm’s most advanced piece of kit ot the North East. \nThe press, made by Komatsu, will make parts for its crossovers models such as the Qashqai and Juke as well its electric vehicles, at a rate of 15 panels per minute in a round-the-clock operation. \nAnd Nissan’s Divisional Vice President for European Manufacturing, Kevin Fitzpatrick, said the press’s launch marks a significant milestone in the plant’s 30-year history on Wearside, heralding a new era in manufacturing. \nThe new XL press, the first of its type in the Renault-Nissan Alliance, will be the biggest at Sunderland and joins the existing seven press lines. \nThe official unveiling of the investment comes a month after Carlos Ghosn, former CEO and now chairman of Nissan, said that Nissan would review the competitiveness of its car plant in Sunderland once the final outcome of Brexit negotiations becomes clear. \nThe car manufacturer announced in October that it was investing in production of new Qashqai and X-Trail models at Sunderland after receiving Government assurances that EU withdrawal would not affect the plant’s competitiveness, but Mr Ghosn said that while the company trusted Prime Minister Theresa May’s assurance, Nissan would want to “re-evaluate the situation” once the final deal is concluded. \nHowever, the new press will last around 25 years, suggesting the firm has clear commitment to the North East. Kevin Fitzpatrick, Nissan Divisional Vice President, European Manufacturing, during the official launch of a new state of the art press at Nissan's car plant in Sunderland (Photo: Newcastle Chronicle) \nMr Fitzpatrick said: “As far as the plant is concerned, it’s business as usual. We’ve been allocated the cars, we’re working on them, the design and purchasing groups are starting on sourcing, so for us it’s just: get on with it. \n“As for the new models, I know the dates but for commercial reasons I can’t give them. Some time this year we’ll be building a refreshed Qashqai and we’ve already announced that the new Juke and new X Trailer.” \nThe multi-million pound project at the Wearside plant has taken just over 18 months to complete, since ground was broken mid-way through 2015. Once at full capacity, it will be capable of stamping 2.5m panels a year with a force in excess of 5,200 tonnes \nThe official unveiling also celebrated the milestone of nine million cars built at the plant since production began in 1986. Official launch of a new state of the art press at Nissan's car plant in Sunderland (Photo: Newcastle Chronicle) \nMr Fitzpatrick, said: “The new press is a fantastic piece of cutting edge technology which sets up the next generation of production at Nissan Sunderland Plant. This is the most advanced press that Nissan has bought. \n“This is great. There’s no secret about how there’ve been stories in the past about the problems we’ve had over the last two to three years with the old press. We’ve had to take it out of production for extended repairs because it’s getting towards the end of its high-tonnage life. \n“So this press just takes all that business risk away. We still keep the old one for resilience, and use it on smaller parts. \n“The quality of the build and the efficiency of the installation are a real credit to the dedication, talent and sheer hard work of our team at the plant. Read More Watch Hollywood star Margot Robbie take Nissan's new concept car for a midnight spin \n“Reaching nine million cars is also a tremendous achievement for the plant. The vehicles we make have come a long way from the first Nissan Bluebird to roll off the line. And it’s not just the quantity - it’s the quality of craftsmanship that goes into our innovative and exciting cars that will keep pushing us towards new production records.” \nMore than 10 meters in height, with foundations deeper than 6.5m, the giant facility will press body sides and other panels for vehicles built in Sunderland. Kevin Fitzpatrick, Nissan Divisional Vice President, European Manufacturing, with Sunderland Council Leader Paul Watson (Photo: Newcastle Chronicle) \nMr Fitzpatrick added: “It’s truly impressive. \n“Two and a half years ago this was a huge hole in the ground. Now we have this building extension of 7,000 sq m and a press which weighs 2,000 tonnes in that hole. It’s a remarkable achievement and it was a remarkable construction. \n“Importantly, we’ve got a fantastic pool of talent here in the North East when we need to recruit and we added 24 new workers to the press shop headcount so that our experienced staff could bring this to fruition. \n“A project like this isn’t just down to skill - it’s about making sure the people with those skills are working together and at the right time. \n“The final ingredient for a project of this size is the investment and support of our senior executives in Nissan. \n“The £37m spent on this press is one of the investments that takes the total investment in Sunderland to above £4bn - it demonstrates the faith Nissan has in this plant on the expectation that we will be building cars here in Sunderland for many years to come.” Like us on Facebook", "external_links": [], "published": "2017-02-24T19:26:00.000+02:00", "crawled": "2017-02-24T14:49:50.651+02:00", "highlightTitle": ""}