{"organizations": [], "uuid": "be6c8c7af96c8b1c9b2e956c7f25e4191e46802f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article10233588.ece/ALTERNATES/s1200/JS73123717.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/news-opinion/many-secret-remainers-want-sabotage-12641528", "country": "GB", "domain_rank": 21960, "title": "Many secret Remainers want to sabotage the people's Brexit and say 'I told you so'", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Many secret Remainers want to sabotage the people's Brexit and say 'I told you so'", "spam_score": 0.0, "site_type": "news", "published": "2017-02-23T01:00:00.000+02:00", "replies_count": 0, "uuid": "be6c8c7af96c8b1c9b2e956c7f25e4191e46802f"}, "author": "Jonathan Arnott", "url": "http://www.chroniclelive.co.uk/news/news-opinion/many-secret-remainers-want-sabotage-12641528", "ord_in_thread": 0, "title": "Many secret Remainers want to sabotage the people's Brexit and say 'I told you so'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "News Opinion Many secret Remainers want to sabotage the people's Brexit and say 'I told you so' North East UKIP MEP Jonathan Arnott says Tony Blair's recent speech on the European Union was full of 'weasel words' Share Jonathan Arnott (Photo: Ian Forsyth/Getty Images) Share Get daily   Thank you for subscribing!   \nAlmost 20 years ago, just a few short months after Tony Blair came to power, the Blair government held a referendum in Wales on the creation of a new Welsh Assembly. \nOn a turnout of barely half the electorate, the ‘Yes’ vote beat the ‘No’ vote by 50.3% to 49.7%. From there, a Welsh Assembly was born. The result was accepted without serious demur. \nLast year we had a referendum across the whole of the UK on Britain leaving the European Union . There was a bigger margin of victory – almost 52 to 48 – and with a turnout of over 72% of the electorate. No General Election in the last 25 years has had such a turnout as the referendum on the European Union. The 17.4 million who voted for Brexit are more than have ever voted for anything in our nation’s history. \nTony Blair correctly recognised that the Welsh Assembly referendum was the decision of the people. It may have been a wafer-thin margin on a tiny turnout, but that was the nature of democracy. \nNeither of those excuses apply to the referendum on the European Union. Former Prime Minister Tony Blair during his speech on Brexit at an Open Britain event in central London. \nThe case for non-acceptance of Blair’s referendum would have been far stronger than any case relating to Brexit, yet Tony Blair persists in trying to reverse the democratic decision of the people in this case and asks the people to ‘rise up’ against our democratic decision. \nI would love to be able to sugar-coat it, but I can’t: in my opinion Tony Blair has shown himself to be a complete hypocrite. He will go down in history as a Prime Minister not only despised over his role in taking us to war in Iraq, but one who tilted at the windmill of democracy in Quixotic fashion. His poll rating numbers are the worst of any domestic politician, past or present, in the UK – on a par with Putin and Trump. \nBlair’s recent speech decrying the democratic will of the people is full of weasel words. He claimed that immigration was the key issue in the vote to leave the European Union, then assures us that “net immigration into the UK was roughly 335,000 in the year to June 2016. But just over half was from outside the EU.” \nIf half of our net immigration comes from 27 countries of the world, and almost as much comes from those 27 as the other 165, where does the problem lie? Surely it lies with the 27 – from which proportionally, whether you measure it by head of population or by state, immigration is far higher. Almost 50% of our immigration is coming from barely 6% of the world’s population. \nNo mention is made, or was ever made by the Remain campaign, about the quality of immigrants coming to this country. An immigrant from the EU could be either a brain surgeon or a career criminal; whilst we’re in the EU we’re not allowed to make a value judgement. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now", "external_links": [], "published": "2017-02-23T01:00:00.000+02:00", "crawled": "2017-02-22T20:19:36.073+02:00", "highlightTitle": ""}