{"organizations": [], "uuid": "cfb67c711acd93bfb96cd7c553a933b2563835b8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12239074.ece/ALTERNATES/s1200/Car-production-figures.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/nissan-gives-fresh-signals-production-12667340", "country": "GB", "domain_rank": 21960, "title": "Nissan gives fresh signals that production could still leave Sunderland depending on Brexit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Nissan gives fresh signals that production could still leave Sunderland depending on Brexit", "spam_score": 0.0, "site_type": "news", "published": "2017-02-28T18:44:00.000+02:00", "replies_count": 0, "uuid": "cfb67c711acd93bfb96cd7c553a933b2563835b8"}, "author": "Sean Seddon", "url": "http://www.chroniclelive.co.uk/news/north-east-news/nissan-gives-fresh-signals-production-12667340", "ord_in_thread": 0, "title": "Nissan gives fresh signals that production could still leave Sunderland depending on Brexit", "locations": [], "entities": {"persons": [{"name": "colin lawther", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "carlos ghosn", "sentiment": "none"}], "locations": [{"name": "sunderland", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "north east  confirming", "sentiment": "none"}], "organizations": [{"name": "brexit news nissan", "sentiment": "neutral"}, {"name": "nissan", "sentiment": "neutral"}, {"name": "sunderland", "sentiment": "neutral"}, {"name": "bbc", "sentiment": "none"}, {"name": "international trade committee", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "world trade organisation", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Nissan gives fresh signals that production could still leave Sunderland depending on Brexit Company boss said car giant would 'review' situation if UK does not get free trade deal after Brexit Share Click to play Tap to play The video will start in 8 Cancel Play now   \nNissan bosses have given fresh signals that they may still move production out of Sunderland after Brexit negotiations . \nThe car manufacturing giant was vocally concerned about the prospects of the UK’s automotive industry outside of the EU. \nDespite signalling commitment to the region in November, today brought fresh signs that arrangement could change. \nThe comments came from Colin Lawther, Nissan’s senior vice president of manufacturing, supply chain management and purchasing. \nSpeaking to the International Trade Committee in the House of Commons, he said Nissan would review the competitiveness of the Sunderland plant “as circumstances change”. Nissan's plant in Sunderland (Photo: Owen Humphreys/PA Wire) \nHe added: “We won’t wait until the end of the process - we will continually review the circumstance based on anything that materially changes. \n“At the moment we have got a set of circumstances that we are quite happy with and we will honour that decision going forward but if anything materially changes we will review.” \nAsked what might prompt a review of operations in the UK, he said “free trade agreements - that the big ticket item”. \nPrime Minister Theresa May has already signalled that she could leave the EU without a trade deal, despite most major players in industry preferring one. Read More Nissan recruitment drive and hundreds of jobs up for grabs in North East \nConfirming she would be willing to embark on a hard Brexit, she said in a speech in January: “While I am confident that this scenario need never arise – while I am sure a positive agreement can be reached – I am equally clear that no deal for Britain is better than a bad deal for Britain.” \nThat would mean the UK would be fully excluded from the single market and revert to World Trade Organisation trading rules. \nEuropean leaders have consistently said that May’s demands on freedom of movement are entirely compatible with the prospect of a free trade deal with a UK that is outside of the EU. Read More BBC's Question Time is coming to Sunderland - but what would you ask? \nThe government are set to trigger Article 50 in the coming weeks, kicking off at least two years of negotiations. \nIt’s not the first time Nissan have suggested that their commitment to Sunderland could be reversed in the future \nIn January, Nissan boss Carlos Ghosn said: “Obviously when the package comes, you are going to have to re-evaluate the situation, and say, ‘Okay, is the competitiveness of your plant preserved or not?’ \n“We are going to have to make decisions on investment within the next two to three years, so obviously the faster the Brexit results come, the better it is.” Like us on Facebook", "external_links": [], "published": "2017-02-28T18:44:00.000+02:00", "crawled": "2017-02-28T14:13:12.431+02:00", "highlightTitle": ""}