{"organizations": [], "uuid": "eb04dc1ffaa70ae92c500de2da8cd3b970dfd779", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12432639.ece/ALTERNATES/s1200/Brexit.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/lords-set-late-night-debates-12631130", "country": "GB", "domain_rank": 21960, "title": "Lords set for late night debates on quitting the EU but won't delay Brexit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Lords set for late night debates on quitting the EU but won't delay Brexit", "spam_score": 0.0, "site_type": "news", "published": "2017-02-21T15:00:00.000+02:00", "replies_count": 0, "uuid": "eb04dc1ffaa70ae92c500de2da8cd3b970dfd779"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/lords-set-late-night-debates-12631130", "ord_in_thread": 0, "title": "Lords set for late night debates on quitting the EU but won't delay Brexit", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Lords set for late night debates on quitting the EU but won't delay Brexit As Brexit debate continues, Newcastle MP Nick Brown tells off Labour rebels who opposed the Brexit Bill Share EU and Union flags (Photo: PA) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe House of Lords will not attempt to block or seriously delay Brexit , Labour has pledged. \nBut it may attempt to amend legislation to ensure Prime Minister Theresa May lets Parliament scrutinise any deal with the EU before it is signed. \nThe Lords has begun a series of debates on the Government’s European Union (Notification of Withdrawal) Bill, which allows Prime Minister Theresa May to begin the process of quitting the European Union , after it was approved by the House of Commons earlier this month. \nDebates are expected to stretch into the early hours of the morning. Members of the House of Lords will conclude two days of lengthy debates on Tuesday night - or possibly the early hours of Wednesday morning, if discussions continue past midnight. \nAnd there will be further discussions on Monday February 27 and Wednesday March 1, when the Lords will vote on amendments to the legislation. \nThe Government will oppose any amendments to the Bill but there is a possibility it could be defeated because it does not have a majority in the Lords. \nThis would lead to what is known as “ping pong”, with the legislation sent back to the Commons - which would almost certainly vote to remove the amendments and then send it back to the Lords. Lord John Shipley, former leader of Newcastle City Council and Liberal Democrat Councillor \nHowever, Labour’s leader in the Lords, Baroness Smith of Basildon, said she did not expect this process to last long, suggesting that Labour members of the Lords would swiftly admit defeat. \nShe told the BBC: “All the House of Lords can do is ask the Commons to look at an issue again. I don’t see any extended ping pong on this at all.” \nAround 190 peers are expected to speak during the two days set aside for the European Union (Notification Of Withdrawal) Bill’s second reading debate in the Lords, the first time the upper chamber will debate the legislation. \nThey include former Newcastle City Council leader Lord Shipley , who is proposing an amendment calling on the Government to produce a report on the impact of Brexit on the North East. \nLord Shipley, a Liberal Democrat, said: “People based in London and the south east are not as aware of the importance of exporting to regions like ours. \n“The fact that such a large proportion of our exports are going to the European Union hasn’t been understood in London. \n“This is an attempt too draw the Government’s attention to the fact that they need to think regionally as the negotiations continue for Brexit.” \nNewcastle East MP Nick Brown has sent out letters reprimanding Labour MPs who voted against the party line over Brexit, in his role as the party’s chief whip. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now", "external_links": [], "published": "2017-02-21T15:00:00.000+02:00", "crawled": "2017-02-21T10:39:08.989+02:00", "highlightTitle": ""}