{"organizations": [], "uuid": "510259f4b00cfeff2764e5f1dea14a7a8a303149", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12541693.ece/ALTERNATES/s1200/IBP_NEC_100117sunderland_07JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/sunderland-braced-46m-cuts-council-12541598", "country": "GB", "domain_rank": 21960, "title": "Sunderland braced for £46m cuts to services as council prepares to pass budget", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Sunderland braced for £46m cuts to services as council prepares to pass budget", "spam_score": 0.0, "site_type": "news", "published": "2017-02-01T23:35:00.000+02:00", "replies_count": 0, "uuid": "510259f4b00cfeff2764e5f1dea14a7a8a303149"}, "author": "Sean Seddon", "url": "http://www.chroniclelive.co.uk/news/north-east-news/sunderland-braced-46m-cuts-council-12541598", "ord_in_thread": 0, "title": "Sunderland braced for £46m cuts to services as council prepares to pass budget", "locations": [], "entities": {"persons": [{"name": "paul watson", "sentiment": "none"}, {"name": "coun speding", "sentiment": "none"}, {"name": "mel speding", "sentiment": "none"}], "locations": [{"name": "sunderland city", "sentiment": "none"}, {"name": "new wear crossing", "sentiment": "none"}, {"name": "sunderland city centre", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "international advanced manufacturing park", "sentiment": "none"}, {"name": "port of sunderland", "sentiment": "none"}], "organizations": [{"name": "news sunderland", "sentiment": "negative"}, {"name": "sunderland", "sentiment": "negative"}, {"name": "sunderland city council", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}, {"name": "invalid email  sunderland city council", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Sunderland braced for £46m cuts to services as council prepares to pass budget Sunderland City Council will make £74m of cuts by 2020 and has seen £250m slashed from its budget since 2010 Share Sunderland Civic Centre in Sunderland City Centre (Photo: Newcastle Chronicle) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nSunderland City Council is preparing to pass sweeping cuts to services as they look to save an eye-watering £74m by 2020. \nIn the 2017 financial year £46m is set to be cut from its coffers as frontline services see funding cut and withdrawn. \nSince 2010, the council have endured £250m worth of cuts from central government. \nNearly two-thirds of the proposed spending reductions will hit the city in the next financial year alone. \nCouncillor Mel Speding, Sunderland City Council’s cabinet secretary, said: “This year’s budget has been the toughest yet. \n“We’ve tried very hard to protect communities from the worst of the spending cuts by absorbing most of the impact ourselves. \n“Seven years of cuts under the Government’s austerity programme have left us with very little room for manoeuvre and there’s no doubt that people are going to notice changes to the services the council provides because of the cuts we’re having to make. \n“But we are listening to what people are telling us and within the very limited resources we have available, we are trying to take their views on board.” \nThe council is considering its options to reduce the impact of the cuts – including using £500,000 saved by introducing alternate weekly bin collections to fund grass cutting and fly tipping services, and investing an extra £75,000 for libraries. Councillor Paul Watson, leader of Sunderland City Council \nAnd last week Paul Watson, leader of Sunderland City Council, promised to mitigate a proposed 100% cut of £560,000 which is due to take effect from April 2017 after youth groups occupied the civic centre’s public gallery in protest. \nSee how young protesters at Sunderland council made their voices heard \nCoun Speding added: “Delivering the scale of reductions we’re talking about can only be achieved by radically looking at the council’s role and making fundamental changes to the way we operate which will inevitably impact on the services we provide to communities.” \nHowever, council spending on long-term infrastructure projects is set to increase by £148m over the next four years. \nAs previously reported, the council is pouring £86.9m into the International Advanced Manufacturing Park (IAMP) business park which they say could create 5,000 new high-quality jobs. \nThere’s also money for improvements to the Port of Sunderland, roads around the under-construction New Wear Crossing and upgrading the city’s street lights to LED. \nThe council will spend £2.7m on improvements to schools and £2.9m bringing the Tall Ships Race to Wearside. \nBrexit, jobs and a Mayor faux pas: 5 things we learned at Sunderland City Council meeting \nHowever, these projects come from a separate revenue stream and the council cannot use infrastructure funding to pay for frontline services. \nCoun Speding said: “It’s essential that we continue to invest in Sunderland’s infrastructure and economic regeneration if we are to deliver more and better jobs and economic growth and make the city more attractive to residents, visitors and businesses. \n“The development of the IAMP with the 5,000 plus jobs it will bring with it, the Port and the continued development of the road network around the New Wear Crossing which will open up new regeneration areas are key to the city’s economic growth.” \nCabinet will consider the proposals on February 8 before they go to full council for full approval in March. Like us on Facebook", "external_links": [], "published": "2017-02-01T23:35:00.000+02:00", "crawled": "2017-02-01T18:53:43.963+02:00", "highlightTitle": ""}