{"organizations": [], "uuid": "cd4bdbfda470dbf178ef2fcf415526849c6fc63a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12565873.ece/ALTERNATES/s1200/Public-funding-gap-divide.jpg", "site_section": "", "section_title": "", "url": "http://www.chroniclelive.co.uk/news/north-east-news/labour-impose-laws-ensuring-north-12565456", "country": "IE", "domain_rank": 21960, "title": "Labour will impose laws ensuring North East gets a fair share of spending - Chronicle Live", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 0, "title_full": "Labour will impose laws ensuring North East gets a fair share of spending - Chronicle Live", "spam_score": 0.022, "site_type": "news", "published": "2017-02-07T12:00:00.000+02:00", "replies_count": 0, "uuid": "cd4bdbfda470dbf178ef2fcf415526849c6fc63a"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/labour-impose-laws-ensuring-north-12565456", "ord_in_thread": 0, "title": "Labour will impose laws ensuring North East gets a fair share of spending - Chronicle Live", "locations": [], "entities": {"persons": [{"name": "jeremy corbyn", "sentiment": "none"}, {"name": "hull", "sentiment": "none"}, {"name": "ben  mr mcdonnell", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "mcdonnell", "sentiment": "none"}, {"name": "john mcdonnell", "sentiment": "none"}, {"name": "barnett", "sentiment": "none"}, {"name": "danny lawson/pa wire", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "liverpool", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "north west", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "crossrail", "sentiment": "none"}, {"name": "south east", "sentiment": "none"}], "organizations": [{"name": "news labour", "sentiment": "negative"}, {"name": "yorkshire", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "mcdonnell", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "northern powerhouse", "sentiment": "none"}, {"name": "whitehall", "sentiment": "none"}, {"name": "national investment bank", "sentiment": "none"}, {"name": "conservative", "sentiment": "none"}, {"name": "pa)  labour", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Labour will impose laws ensuring North East gets a fair share of spending Radical plan to end decades of unfairness proposed by Labour as they make even more pledges for the region Share Click to play Tap to play The video will start in 8 Cancel Play now MP says Labour will be in front of Tories within a year Share this video Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nNew laws will end decades of unfair funding which saw governments pour money into the south while failing to build new transport links and other infrastructure in the North, Shadow Chancellor John McDonnell has pledged. \nA Labour government would introduce legislation to ensure that the North of England receives investment, said the Shadow Chancellor. \nAnd he pointed out that London’s £15 billion Crossrail line, a new rail line running east to west through the capital, costs more than six times the entire budget for transport improvements in the North East - and it’s only one of a number of projects in the south. \nExpenditure in London and the south east is usually justified on the basis that the region’s strong economy means it attracts workers and businesses who need infrastructure. However, some experts argue that this becomes a self-fulfilling prophecy because investment in infrastructure helps strengthen the regional economy. Shadow Chancellor John McDonnell (Photo: Danny Lawson/PA Wire) \nMr McDonnell said: “We have to put an end to the Whitehall view that what’s good for the City of London is good for the country as a whole. \n“It’s time for the rest of the country to get a look in. \n“At present, this Tory government plans to invest less than half the amount per head in the North that London receives. \n“The Crossrail transport link alone is due to cost four times the entire public investment budget for Yorkshire, or six and half times that for the North East. \n“We can’t, as a country, face the world after Brexit if we are not all able to pull together. \n“So I can pledge this now: the next Labour government will put in place the mechanisms needed to close that gap in funding. \n“We will make sure that no government can ever again bias its own investment plans so heavily against the majority of the country. \n“We’ll introduce legislation to make sure future governments will be charged with auditing their regional capital spend against economic need, and reporting to Parliament when the investment imbalances are excessive.” \nHe said the new system would have a similar effect to the Barnett formula, which ensures that funding increases in England also lead to funding increases for Scotland. European Union flag in front of Big Ben \nMr McDonnell said: “It’ll be like a “Barnett formula for the north.” \nTreasury figures show that the North East’s share of funding for vital services such as health, education and transport has fallen since 2010, \nSpending on economic affairs, which includes transport and investment in research and infrastructure, has been particularly bad in the North East. \nIt rose from £527 per head in 2011-12 to £558 in 2015-16, but the average spend for all English regions rose from £534 to £664 in that period. \nIn London, the figure increased by more than a third from £869 in 2011-12 to £1,196 in 2015-16. Read More North East MPs welcome Labour plans for £10bn rail project linking Northern cities \nIn the North East, cash for transport rose by 34% from £223 per head in 2011-12 to £299 in 2015-16 - while in London it rose by 50% to £973 per head, or more than three times as much. \nThe new funding system is one of a number of measures to back the North now being proposed by Labour. \nOthers include building a £10 billion rail link from Liverpool to Hull and on to Newcastle , which Labour calls a Crossrail for the North. The Conservative Government is already considering whether to build such a line but has taken no firm decision, while Mr McDonnell said Labour was “absolutely committed” to the project. Labour Party leader Jeremy Corbyn (Photo: PA) \nLabour has also set out plans for a £500 billion “National Investment Bank” with a network of regional development banks, to lend money to regional bodies such as councils and combined authorities, for investment in infrastructure. \nLabour leader Jeremy Corbyn said: “The North-South divide in income, jobs and pay is increasing faster than ever. \nLast year, when 277,000 jobs were created in London only 1,000 extra materialised in the North West and the number fell by 40,000 in the North East.” \nConservatives said the proposed national investment bank would mean borrowing £500 billion, a claim Labour denies. \nA Conservative spokesman said: “Labour’s policy to borrow half a trillion pounds would crash our economy and threaten jobs and infrastructure. \n“Our modern industrial strategy puts investment in the Northern Powerhouse at the heart of this Government’s Plan for Britain.” Like us on Facebook ", "external_links": [], "published": "2017-02-07T12:00:00.000+02:00", "crawled": "2017-02-07T07:16:41.307+02:00", "highlightTitle": ""}