{"organizations": [], "uuid": "732f4ba893b40ccdb5b528229e5bfdf75363b3cb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30168298/15879998.jpg", "site_section": "http://www.westernmorningnews.co.uk/all-content.rss", "section_title": "Devon Live All Content Feed", "url": "http://www.devonlive.com/exports-pave-way-for-organic-milk-growth-conference-hears/story-30168298-detail/story.html", "country": "GB", "title": "AthwennaIrons published Exports pave way for organic milk growth, conference hears", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "AthwennaIrons published Exports pave way for organic milk growth, conference hears", "spam_score": 0.0, "site_type": "news", "published": "2017-02-28T17:31:00.000+02:00", "replies_count": 0, "uuid": "732f4ba893b40ccdb5b528229e5bfdf75363b3cb"}, "author": "AthwennaIrons", "url": "http://www.devonlive.com/exports-pave-way-for-organic-milk-growth-conference-hears/story-30168298-detail/story.html", "ord_in_thread": 0, "title": "AthwennaIrons published Exports pave way for organic milk growth, conference hears", "locations": [], "entities": {"persons": [{"name": "omsco", "sentiment": "none"}, {"name": "simon hadley nicholas saphir", "sentiment": "none"}, {"name": "saphir", "sentiment": "none"}, {"name": "tom rigby", "sentiment": "none"}, {"name": "nicholas saphir", "sentiment": "none"}], "locations": [{"name": "devon county", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "nfu conference", "sentiment": "none"}, {"name": "omsco", "sentiment": "none"}, {"name": "usda", "sentiment": "none"}, {"name": "nfu organics forum", "sentiment": "none"}, {"name": "nfu", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Exports pave way for organic milk growth, conference hears By AthwennaIrons | Posted: February 28, 2017 0 COMMENTS SHARES Simon Hadley Nicholas Saphir, OMSCo's executive chairman, third left, told farmers at the NFU Conference how the organic cooperative has achieved growth over the last few years Exports pave way for organic milk growth, conference hears   Pictures: Simon Hadley Nicholas Saphir, OMSCo's executive chairman, third left, told farmers at the NFU Conference how the organic cooperative... Comments (0) \nThe Organic Milk Suppliers Cooperative (OMSCo) has signed new members to meet demand growth from its premium export business, by increasing its milk pool nearly 30% over the next two years. \nNicholas Saphir, OMSCo's executive chairman, told farmers at last week's NFU Conference how the organic cooperative has achieved growth over the last few years despite a relatively static UK market. \nThe UK organic dairy sector grew 2.2% last year behind total UK organic food growth of 7%, the audience heard. \nMr Saphir explained: \"Global organic dairy market growth is currently outstripping that of the UK and our market diversification strategy has led us to spread risk and take advantage of this by developing premium, specialist organic dairy ingredients for sale worldwide.\" \nSince gaining USDA organic accreditation and Chinese certification, the cooperative's export business has gone from strength-to-strength, he added. \nREAD ALSO: Opportunities for organic farmers as market tops £2 billion \n\"We've now built long-term relationships with leading market players on a global manufacturing and distribution scale, and as a result, last financial year our exports grew by 58% to 20% of our total revenue,\" said Mr Saphir. \n\"However, we've spent almost an entire year supply constrained. We prioritised our UK sales and this has limited our potential export developments. \n\"Supplying the home market is a priority to ensure that it doesn't weaken again, but we think that in the medium term there's enough milk coming forward to meet limited growth in UK demand and this will be supplied by the natural expansion of the existing organic dairy supply base in the UK.\" \nLooking to the future, Mr Saphir went on to emphasise that international growth will continue to be a key strategy for OMSCo: \"Global consumer demand for organic dairy is creating new opportunities. \nREAD ALSO: Call for competitors as Devon County Show entries open \n\"However, there will be hurdles to overcome as we move forward into a post-Brexit reality. Most critically we need to ensure that policy makers understand the detailed implications of future trade options and that's something we're working hard to achieve.\" \nDairy farmer Tom Rigby, chairman of the NFU Organics Forum, added to the session: \"I am optimistic but we need to be resilient and adaptable. \"It is time for solidarity, working together and grabbing the opportunities presented. We need to run faster.\"", "external_links": [], "published": "2017-02-28T17:31:00.000+02:00", "crawled": "2017-02-28T13:50:36.256+02:00", "highlightTitle": ""}