{"organizations": [], "uuid": "46e08a1a0f2b235fd7037099e9dae468690749b3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12621070.ece/ALTERNATES/s1200/Autumn-statement.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/next-budget-2017-what-can-12621043", "country": "GB", "domain_rank": 21960, "title": "When is the next budget in 2017 and what can we expect to happen?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "When is the next budget in 2017 and what can we expect to happen?", "spam_score": 0.0, "site_type": "news", "published": "2017-02-17T23:12:00.000+02:00", "replies_count": 0, "uuid": "46e08a1a0f2b235fd7037099e9dae468690749b3"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/next-budget-2017-what-can-12621043", "ord_in_thread": 0, "title": "When is the next budget in 2017 and what can we expect to happen?", "locations": [], "entities": {"persons": [{"name": "philip hammond", "sentiment": "neutral"}, {"name": "nick forbes", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "david hodge", "sentiment": "none"}, {"name": "george osborne", "sentiment": "none"}, {"name": "osborne", "sentiment": "none"}, {"name": "hammond", "sentiment": "none"}, {"name": "tony blair", "sentiment": "none"}, {"name": "nick", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "south east", "sentiment": "none"}], "organizations": [{"name": "cbi", "sentiment": "none"}, {"name": "middlesbrough", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "bank of england", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "surrey council", "sentiment": "none"}, {"name": "budget", "sentiment": "none"}, {"name": "surrey", "sentiment": "none"}, {"name": "surrey county council", "sentiment": "none"}, {"name": "journal of the royal society of medicine", "sentiment": "none"}, {"name": "northern powerhouse", "sentiment": "none"}, {"name": "industrial strategy", "sentiment": "none"}, {"name": "cleveland councils", "sentiment": "none"}, {"name": "office for budget responsibility", "sentiment": "none"}, {"name": "newcastle city council", "sentiment": "none"}, {"name": "redcar", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News When is the next budget in 2017 and what can we expect to happen? Chancellor Philip Hammond will deliver a Budget for Brexit and for an industrial strategy to grow the economy in every region Share Chancellor Philip Hammond (Photo: PA)   \nWhen is the 2017 Spring Budget ? \nChancellor Philip Hammond will deliver his first Budget on March 8, 2017. \nHe delivered a major financial statement last year, in November, but that was the Autumn Statement, not the Budget. \nIt will be the first Budget since March 2010 to be delivered by anyone other than George Osborne, the former Chancellor. What is the Budget? \nThe Budget sets out the government’s plans for the economy based on the latest forecasts from the Office for Budget Responsibility, an independent agency set up by the Treasury which reports on how the economy is performing. \nThe March 8 statement is being billed as the Spring Budget - because a second one is due later in the year. \nTraditionally, Budgets took place in the spring. But Mr Hammond has decided they should come in the Autumn (replacing the annual Autumn Statement, which will be abolished). \nIt means we actually have two budget statements this year - the last spring Budget and the first of the new autumn Budgets. What will the Budget mean for the North East? \nBacking the regions will be a major theme in the Budget. \nIn the past, Mr Osborne used his statements to announce measures to back the Northern Powerhouse . \nMr Hammond may not highlight the policy to the same extent, although the Government insists it is still committed to it. \nBut he is likely to mention the Government’s Industrial Strategy, which Ministers say will promote economic growth in every region of the country including the north. \nThe CBI has urged the Chancellor to boost regional growth and productivity by providing more funding for skills and education. \nAnd the Budget could include more detail of the Government’s plans for a £170 million network of technical colleges for young people who do not go to university. What will the Budget mean for local councils? \nMr Hammond will come under pressure to help councils struggling with the cost of social care, following the row over an apparent deal between the Government and Surrey County Council, which withdrew plans to impose a 15 per cent council tax increase to pay for social care services. \nThe apparent arrangement came to light when Surrey Council leader David Hodge texted details to Nick Forbes, the leader of Newcastle City Council, in the mistaken belief that he was speaking to a Government official named Nick. \nAnalysis published by the Journal of the Royal Society of Medicine found that “disinvestment” in the health and social care system is the most likely explanation for 30,000 excess deaths in one year. \nCouncil leaders including the heads of Durham, Newcastle , Gateshead, Middlesbrough and Redcar and Cleveland Councils have written to Theresa May saying they demand the same treatment as Surrey. \nCharity Age UK has also called on the Government to inject some “urgent funds” into adult social care in the Spring Budget, after warning that the care system for older people is living on “borrowed time”. Read More What will the Budget mean for Brexit? \nThe Chancellor will talk about the future of the country after Brexit . \nTheresa May has vowed to trigger Article 50, which begins the process of leaving the EU, by the end of March. \nInflation has risen to 1.8 per cent and there is speculation it could rise further because the weakness of the pound, following last year’s referendum vote, makes imported goods more expensive. \nHowever, inflation is still below the Bank of England’s target level of two per cent. \nAnd the Government will stress plans to sign a comprehensive new trade deal with the EU. Read More Former Prime Minister Tony Blair urges pro-Europeans to 'rise up' and stop Brexit What will the Budget mean for businesses? \nSmall businesses have urged Mr Hammond to use the Budget to help them with a business rate revaluation due in April, which will mean some firms pay more. \nThe Federation of Small Businesses is worried about the increase - although in much of the North East, firms could enjoy cuts in their business rates. Increases are most likely in London and the south east. \nThe CBI has urged the Chancellor to reform business rates. Like us on Facebook", "external_links": [], "published": "2017-02-17T23:12:00.000+02:00", "crawled": "2017-02-17T18:42:48.388+02:00", "highlightTitle": ""}