{"organizations": [], "uuid": "c5f0c3f541fce968b0149eb0aeaafb1257d7243e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12546006.ece/ALTERNATES/s1200/heathrow.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/heathrow-expansion-allow-new-flights-12545838", "country": "GB", "domain_rank": 21960, "title": "Heathrow expansion will allow new flights from Durham Tees Valley Airport", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Heathrow expansion will allow new flights from Durham Tees Valley Airport", "spam_score": 0.0, "site_type": "news", "published": "2017-02-02T20:26:00.000+02:00", "replies_count": 0, "uuid": "c5f0c3f541fce968b0149eb0aeaafb1257d7243e"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/heathrow-expansion-allow-new-flights-12545838", "ord_in_thread": 0, "title": "Heathrow expansion will allow new flights from Durham Tees Valley Airport", "locations": [], "entities": {"persons": [{"name": "chris grayling", "sentiment": "none"}, {"name": "roberta blackman-woods", "sentiment": "none"}, {"name": "grayling", "sentiment": "none"}, {"name": "james ramsbotham", "sentiment": "none"}, {"name": "steve gill", "sentiment": "none"}], "locations": [{"name": "heathrow", "sentiment": "none"}, {"name": "durham tees valley airport heathrow", "sentiment": "none"}, {"name": "durham tees valley airport", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "belfast international", "sentiment": "none"}, {"name": "west london", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "prestwick", "sentiment": "none"}, {"name": "tees valley", "sentiment": "none"}, {"name": "north east england", "sentiment": "none"}, {"name": "heathrow airport", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "durham tees valley", "sentiment": "none"}, {"name": "newquay", "sentiment": "none"}, {"name": "humberside", "sentiment": "none"}], "organizations": [{"name": "state", "sentiment": "none"}, {"name": "department for transport", "sentiment": "none"}, {"name": "transport", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "liverpool", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "north east england chamber of commerce", "sentiment": "none"}, {"name": "durham tees valley airport", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Heathrow expansion will allow new flights from Durham Tees Valley Airport A third runway at Heathrow will create 5,000 North East jobs, airport managers have claimed Share Click to play Tap to play The video will start in 8 Cancel Play now   Thank you for subscribing!   \nThe North East will gain up to 5,000 new jobs from a third runway at Heathrow, airport managers claim. \nAnd there will be a major boost for Durham Tees Valley Airport, after Transport Secretary Chris Grayling said it was due to get flights to and from Heathrow by 2030. \nIt comes as the Government begins a major consultation about Heathrow expansion by publishing a National Policy Statement setting out detailed proposals. \nThe third runway proposal is controversial, particularly in the west London area most affected by flights, and opposed by some MPs. However, it has been backed by many regional airports across England, who stand to benefit from improved connections with Heathrow. \nA nationwide public consultation will last 16 weeks, before ministers submit a final version for a vote in Parliament this winter. A plane taking off at Heathrow Airport (Photo: PA) \nCity of Durham MP Roberta Blackman-Woods said: “Heathrow expansion will create jobs and growth for the whole of the UK, and I am pleased to see the project progressing on track with the launch of today’s consultation. \n“Expansion will mean up to 5,000 jobs and £4bn in economic benefits for our region, stimulating the North East economy and creating real opportunities post-Brexit. The North East is proud to be the strongest exporting region - up to 40 new long haul destinations via Heathrow will help our businesses get their goods to every corner of the globe. \n“The North East stands ready to help deliver the new runway, and I look forward to seeing the project develop, and local and national benefits secured.” \nAnd North East England Chamber of Commerce CEO James Ramsbotham said: “Businesses in North East England have a very strong exporting record and rely on the UK’s national hub airport at Heathrow to gain access to international markets. \n“In the decades ahead this is going to be increasingly important. Investment in runway capacity at Heathrow is crucial to the long term future of our economy and the maximisation of the potential of our exporting businesses. \n“We welcome the launch of the consultation as a step towards getting on with delivering jobs and growth for the UK.” Transport Secretary Chris Grayling (Photo: PA) \nMr Grayling named six UK airports which the Department for Transport “expects” be served by Heathrow once the third runway is opened. \nThey are Belfast International, Liverpool, Newquay, Humberside, Prestwick and Durham Tees Valley. \nSteve Gill, Chief Executive of Durham Tees Valley Airport , said: “Today’s announcement from the Secretary of State that the Government sees the increase in domestic routes as one of the key objectives of expansion at Heathrow is good news. Read More Allowance rises totalling more than £90k for Newcastle councillors rejected amid protests \n“Connectivity into the UK’s global hub is key to supporting economic growth of the regions and secured slots for regional services will ensure the economic benefit, including inbound tourism, are felt across the UK. \n“We look forward to working with Heathrow and airline partners to explore the opportunities offered by the expansion programme. \n“Obviously, a project of this kind will take a considerable time but I am sure that areas such as the Tees Valley will hope that progress on increasing regional connectivity can move forward as quickly as possible.” \nHeathrow must work “constructively” with airlines to increase its number of domestic routes, which currently stands at eight, in order to get expansion consent, the Department for Transport said. \nIt will also have to provide a “world-class” package of support for communities affected by expansion, ban scheduled night flights for six and a half hours and honour its commitment to pay home owners 25% above market value plus costs for homes which are compulsory purchased. \nThe Government’s draft national policy statement says an additional 260,000 take-off or landings will be permitted each year from the expanded airport, up from the current cap of 480,000. \nMr Grayling said the third runway at Heathrow would enhance the UK’s global links as the country leaves the EU. \nHe said: “Leaving the EU is a new chapter for Britain and provides us with a great opportunity to forge a new role in the world. \n“We are determined to seize that opportunity and having the right infrastructure in place will allow us to build a more global Britain.” Like us on Facebook", "external_links": [], "published": "2017-02-02T20:26:00.000+02:00", "crawled": "2017-02-02T16:05:43.806+02:00", "highlightTitle": ""}