{"organizations": [], "uuid": "b8e06accf4217d45da14fd22d807a215ae9c8a01", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article10433141.ece/ALTERNATES/s1200/JS61710206.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/prices-way-weak-pound-increases-12558523", "country": "GB", "domain_rank": 21960, "title": "Prices on the way as weak pound increases costs, North East business warn", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Prices on the way as weak pound increases costs, North East business warn", "spam_score": 0.0, "site_type": "news", "published": "2017-02-06T07:01:00.000+02:00", "replies_count": 0, "uuid": "b8e06accf4217d45da14fd22d807a215ae9c8a01"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/prices-way-weak-pound-increases-12558523", "ord_in_thread": 0, "title": "Prices on the way as weak pound increases costs, North East business warn", "locations": [], "entities": {"persons": [{"name": "north eas", "sentiment": "negative"}, {"name": "mark mowbray", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "peter hemington", "sentiment": "none"}, {"name": "adam marshall", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "ben powick", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "port of tyne", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "bcc", "sentiment": "none"}, {"name": "british chambers of commerce", "sentiment": "none"}, {"name": "england chamber of commerce", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "newcastle airport", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "north east england chamber of commerce", "sentiment": "none"}, {"name": "bdo llp", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Prices on the way as weak pound increases costs, North East business warn Poll by North East England Chamber of Commerce finds exports have been boosted by the weak pound but costs increasing Share Nissan cars awaiting export at Port of Tyne photographed by Mark Mowbray from a helicopter Share Get business   Thank you for subscribing!   \nFresh evidence that the weak pound will increase the price of products has emerged in a survey of North East businesses. \nThe new International Trade Survey conducted by the North East England Chamber of Commerce shows that well over half of businesses expected the fall in the value of the sterling to increase their costs in the coming year. As a result, almost half of those companies surveyed expected they will have to increase prices over the next 12 months. \nAnd while firms in the region had seen a positive effect on export sales because of the weak pound, 40% of North East business had seen a negative impact on business within the UK in the past few months. \nBen Powick, policy adviser covering international trade and Brexit at the Chamber, said: “The recent fall in the value of sterling has ignited a lot of debate around whether it has had a positive impact on businesses, both domestically and through international trade, on their exporting margins. \n“This research has clearly shown exporters are experiencing both good and bad effects. \n“Sterling’s value has had a significant impact on import prices, and as a manufacturing region we buy a substantial volume of goods from the EU in particular. Importers that are locked into contracts with suppliers abroad will have limited means to respond to the recent rise. \n“It is a concern for our members that currency rates are expected to be volatile with the transition to Brexit occurring over the next few months. \n“The Government recently outlined a 12-point plan on the direction of the forthcoming Brexit negotiations with significant changes to come for exporters in terms of our trading relationship with the EU. Our businesses need to have the right level of support to ensure there is minimal disruption and cost to their trading activities.” Read More Newcastle Airport should have links to America, China and India, report says \nThe Chamber’s survey feeds into a nationally poll by the British Chambers of Commerce, which found that one in four firms said the slide in the pound had been positive, but almost as many revealed a negative impact. \nDr Adam Marshall, director general of the BCC, said: “The depreciation of sterling in recent months has been the main tangible impact that firms have had to grapple with since the EU referendum vote. \n“Our research shows that the falling pound has been a double-edged sword for many UK businesses. Nearly as many exporters say the low pound is damaging them as benefiting them. \nBusiness adviser BDO LLP said that despite uncertainty over Brexit and Donald Trump’s presidency, economic prospects in the UK were encouraging. \nSpokesman Peter Hemington said: “The UK economy seems to be remarkably resilient. British businesses are surprisingly confident about the short term, encouraged by the opportunities our cheaper currency and a better-performing global economy have created. \n“These have provided a much-needed short-term boost for our economy, particularly our manufacturers.” Like us on Facebook", "external_links": [], "published": "2017-02-06T07:01:00.000+02:00", "crawled": "2017-02-06T03:08:46.792+02:00", "highlightTitle": ""}