{"organizations": [], "uuid": "c10622dab67d34ad1d71db793d3a757b17ace34c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12608992.ece/ALTERNATES/s1200/GWR_-NJL_150217meetingwith_01.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/meeting-witherika-marshall-communications-manager-12608371", "country": "GB", "domain_rank": 21960, "title": "A meeting with: Erika Marshall, communications manager at Nifco UK", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "A meeting with: Erika Marshall, communications manager at Nifco UK", "spam_score": 0.0, "site_type": "news", "published": "2017-02-16T12:00:00.000+02:00", "replies_count": 0, "uuid": "c10622dab67d34ad1d71db793d3a757b17ace34c"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/meeting-witherika-marshall-communications-manager-12608371", "ord_in_thread": 0, "title": "A meeting with: Erika Marshall, communications manager at Nifco UK", "locations": [], "entities": {"persons": [{"name": "erika marshall", "sentiment": "negative"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "england", "sentiment": "none"}], "organizations": [{"name": "nifco", "sentiment": "negative"}, {"name": "nifco uk", "sentiment": "negative"}, {"name": "normanby primary school", "sentiment": "none"}, {"name": "esh group", "sentiment": "none"}, {"name": "middlesbrough", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "ici", "sentiment": "none"}, {"name": "high tide foundation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Erika Marshall, Nifco UK (Photo: Creo PR)     \nA Meeting With... Erika Marshall, marketing and communications manager, Nifco UK What is the best thing about your job? \nOne of the things I love most about my role at Nifco is through using a wide and varied kit of communication tools, I make the connection between the outside world and the business – be that to celebrate success and achievements, encourage people to join our team or engage with young people to help make them aware of the many opportunities available to them once they finish education. It’s quite a responsibility and something I really enjoy doing. What is your proudest achievement? \nI am proud of everything I have achieved in both my life and career, I set out to work in automotive marketing and I made it. Working for Nifco is great and it has a fantastic story to tell – rising from the ashes to celebrated success. One of the things that has made me proudest this year, is being part of the team which has brought home our biggest haul of awards across a 12-month period – including winning the coveted North East Company of the Year trophy back in April, for a second time. What advice would you give to someone starting in your career? \nStudy, prepare, put the effort in and never give up, especially if you want to build your career in the fantastic North East of England. The marketing sector in the North East is highly competitive, so you’ve got to give yourself the best start you can so that you stand out from the crowd, once you’ve done that and you’re in. Be brave, be bold and don’t be afraid to take risks. Which individual has inspired you most and why? \nMy biggest inspiration is my Grandma. She came from a very working-class background as a child. After school, she worked in a clerical role at ICI until she followed the traditional route of marrying and making a home with the children while her husband went to work. Then one day she decided she wanted more from life. Alongside raising her young children, she studied a degree at the Open University and began a teaching career at a number of primary schools across Middlesbrough before taking the headship at Normanby Primary School, where she stayed until she reached retirement. Throughout her life she has had grit, determination, belief in herself and no fear about working hard to achieve her goals. What’s the best piece of advice you’ve been given? \nA wise man once told me: “When you are starting out, go for the low-hanging fruit first”. Small successes build confidence, that you have in yourself and that others have in you – making you likely to achieve more and have a support network around you when you face bigger challenges. What was the biggest challenge you’ve faced in your career so far? \nMy career took a few knocks at the start, when I left university I found that marketing roles were few and far between and I took roles in vehicle rental and direct marketing (mailshots) which were not at all inspiring, those were challenging times. But, they were stopgaps, short term leap pads to get me to the next stage – this is where you mustn’t give up. Good things come to those who work hard for them. How is your business going to change in the next 10 years? \nA lot can happen in 10 years; a lot can happen in just six months – you only have to look at the Brexit vote to see that. For certain, Nifco’s future will see the business continue along the path it has carved over the last 12 years. Strategic and planned growth, continued investment in current and future workforces and commitment to being proactive in the research and development of new automotive processes and products. What do you like to do out of work? \nMy family are my raison d’être, so I spend as much time with them as possible – particularly exploring this wonderful region in which we live and making memories. Family keeps me balanced and sane, whilst giving a nice little dose of crazy too. Aside from family time, I am a keen runner – running is definitely therapy for the mind. What do you always carry with you? \nMy mobile is my essential item – from appointments to lists to emails to the Spotify soundtrack to my life, it holds everything. I daren’t even think about what would happen if I lost it. In addition, I always have a couple of decaf tea bags in my handbag, I gave up caffeine a few months ago and feel so much better for it. What would you do if you had to change career? \nMy role at Nifco has given me lots of opportunities to engage with young people as part of our employability programme, working with the likes of Esh Group, High Tide Foundation and Darlington Festival of Ingenuity. As a business, it is our responsibility to educate young people about the opportunities available to them, so if I wasn’t working in marketing, a great alternative would be education. Like us on Facebook", "external_links": [], "published": "2017-02-16T12:00:00.000+02:00", "crawled": "2017-02-16T08:06:03.805+02:00", "highlightTitle": ""}