{"organizations": [], "uuid": "550206a5432a1b921ad51d88fd1ef04fd163282d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12648877.ece/ALTERNATES/s1200/JS99715574.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/search-find-best-exporting-team-12647547", "country": "GB", "domain_rank": 21960, "title": "Search is on to find the best exporting team in the North East", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Search is on to find the best exporting team in the North East", "spam_score": 0.0, "site_type": "news", "published": "2017-02-24T01:00:00.000+02:00", "replies_count": 0, "uuid": "550206a5432a1b921ad51d88fd1ef04fd163282d"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/search-find-best-exporting-team-12647547", "ord_in_thread": 0, "title": "Search is on to find the best exporting team in the North East", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Business Search is on to find the best exporting team in the North East The North East Exporters' Awards are being held on June 15 with eight awards due to be handed out Share Overall Exporter of the Year winner Dave Sidlow (laying in front row) and his team from Palintest Ltd. The North East Exporters Awards 2016 held at Ramside Hall Hotel Share Get business   Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe teams that make the North East the UK’s premier exporting region could be in line for recognition at an awards ceremony later this year. \nThe North East Exporters’ Awards - run by the North East England Chamber of Commerce in association with The Journal and our sister paper on Teesside, The Gazette - includes a category for the export team of the year. \nThe prize seeks to recognise a group of people working in export who can demonstrate significant added value to their business through adopting innovative techniques, personnel development and successful implementation of the companies’ export sales strategy. \nLast year the prize was won by Gateshead’s Palintest, which exports water analysis technologies, with the company firm also going on to win the prize for overall Exporter of the Year at the awards. \nThe team of the year prize is sponsored by the Chamber, whose chief executive James Ramsbotham said: “Sponsoring the export team of the year award is a fantastic opportunity for us to celebrate the great work our companies do to fully exploit overseas markets. \n“We are delighted to support this unique opportunity to acknowledge the team which is really outstanding in delivering export success. \n“The current situation with regard to our Brexit negotiations creates unwelcome uncertainty for businesses and it will have tested export teams I am sure. North East Exporters' Awards 2017 \n“So in order to recognise their outstanding achievements, I urge all companies who are involved with international trade to nominate their teams. Let them have their chance to go for the top honours, in these prestigious awards. \n“The Chamber has a great tradition of exporting and we are determined to help our members grow their markets. These awards ensure all of our business community realise the potential of new business which exists overseas, as well as those nearer home bases. \n“Our Manifesto clearly sets out our ambitions to be a Global North East and I urge all exporters to enter for these awards. Read More North East Exporters' Awards launched to find region's best overseas traders \n“Show us how great you are and how your team excels in being innovative and grows your company’s marketshare, while delivering great customer service. Seize the opportunity to put yourself on this promotional platform which is second to none.” \nEntries have opened in six categories for the event which takes place at Ramside Hall Hotel, Durham , on June 15. \nFor further information on judging criteria and eligibility visit www.northeastexportersawards.co.uk or contact Dawn Owens on 0191 2016430 or email dawn.owens@trinitymirror.com . The deadline for entries is April 14. Like us on Facebook", "external_links": [], "published": "2017-02-24T01:00:00.000+02:00", "crawled": "2017-02-23T20:43:21.758+02:00", "highlightTitle": ""}