{"organizations": [], "uuid": "b73f213509f948d534f78a041434547d98bac509", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article11644777.ece/ALTERNATES/s1200/newcastle-university-graduations.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/newcastle-university-puts-more-1bn-12664796", "country": "GB", "domain_rank": 21960, "title": "Newcastle University puts more than £1bn into North East economy", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Newcastle University puts more than £1bn into North East economy", "spam_score": 0.0, "site_type": "news", "published": "2017-02-28T07:01:00.000+02:00", "replies_count": 0, "uuid": "b73f213509f948d534f78a041434547d98bac509"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/newcastle-university-puts-more-1bn-12664796", "ord_in_thread": 0, "title": "Newcastle University puts more than £1bn into North East economy", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Newcastle University puts more than £1bn into North East economy New study shows that university supports thousands of jobs both directly and indirectly Share Get business updates   Thank you for subscribing!   \nAn assessment of Newcastle University’s contribution to the city has found that it added £1.1bn to the economy. \nThe university - which has more than 27,500 students and 5,780 staff - is the fourth largest employer in the North East and has an annual income of £475m. \nNow economic analysis by Regeneris and Urban Foresight has highlighted how the university’s foreign students put £115m into the local economy each year while research grants of £105 have helped support major investment in two National Innovation Centres in ageing and in data, plus a national research centre for subsea and offshore engineering on the banks of the Tyne. \nThe university’s supply chain spending supports 1,800 jobs, most of them in the North East, while its students spend an estimated £240m in the North East economy. \nOther boosts to the local economy include £17m from visits by students’ friends and family which support 430 jobs in the North East, 290 of them in Newcastle. Professor Chris Day, Pro-Vice-Chancellor, Faculty of Medical Sciences, Newcastle University \nProfessor Chris Day, the university’s vice-chancellor said: “Our original role as a University was to educate the pioneers of the industrial revolution to make advances in engineering, shipbuilding and agriculture. We also led the way in research into public health issues that blighted the local population at that time. \n“Today, even though we have grown in scale and diversity, and are now operating on a truly global stage, with campuses in London, Malaysia and Singapore, we continue to have a profound impact on the city of Newcastle and the North East of England. Read More £65m to create thousands of jobs in Newcastle is finalised \n“The challenge is how – as an anchor institution in Newcastle – we build on this to address issues of social inequality in our region while recognising that we also need to adapt to the wider impact of Brexit, globalisation and major societal changes such as an ageing population.” \nThe new report – which is the first time the university has assessed its economic impact – also highlights the institution’s role in attracting new businesses and jobs to the region. The Core at Newcastle Science Central \nIn partnership with Newcastle City Council , the university is creating Science Central, a £350m urban regeneration project on the site of the former Scottish and Newcastle brewery which aims to create 4,000 new jobs. \nPat Ritchie, chief executive of Newcastle City Council: “The close partnership we have with Newcastle University means the city benefits immensely from their world-class research, leading academics and talented students; all contributing to our local economy, our talent offer and to the vibrancy of our Great North City. \n“Our partnership with the university on Newcastle Science Central is one we are particularly proud of. It is a symbol of our shared vision and ambition spanning more than a decade. \n“The strength of that partnership is now more visible than ever as their Urban Sciences Building nears completion, with new commercial and academic developments due to start on site this year, and two national innovation centres planned in the fields of ageing and smart data. We look forward to continuing our strong and growing civic-university partnership for decades to come.” \nThe report also details the university’s impact in other parts of the North East. It operates two research farms in Northumberland, a coastal research and teaching centre at Tynemouth and a major marine technology facility at Blyth. \nThe university’s work with the business community is also highlighted, including internships from its business school and a number of programmes where the university is working with global companies. Like us on Facebook", "external_links": [], "published": "2017-02-28T07:01:00.000+02:00", "crawled": "2017-02-28T02:41:17.521+02:00", "highlightTitle": ""}