{"organizations": [], "uuid": "fd4ef563ed09fe6cbc8618c13550ff848f84d503", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12573939.ece/ALTERNATES/s1200/Trump.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-community-wont-12573638", "country": "GB", "domain_rank": 21960, "title": "The North East and its business community won't escape Trump ripple effect", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "The North East and its business community won't escape Trump ripple effect", "spam_score": 0.0, "site_type": "news", "published": "2017-02-08T20:22:00.000+02:00", "replies_count": 0, "uuid": "fd4ef563ed09fe6cbc8618c13550ff848f84d503"}, "author": "Francesca Craggs", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-community-wont-12573638", "ord_in_thread": 0, "title": "The North East and its business community won't escape Trump ripple effect", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "tim watkins", "sentiment": "none"}, {"name": "harold wilson", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "sellick", "sentiment": "none"}, {"name": "olley", "sentiment": "none"}, {"name": "keith burge", "sentiment": "none"}, {"name": "mark lane", "sentiment": "none"}, {"name": "gabay", "sentiment": "none"}, {"name": "clinton", "sentiment": "none"}, {"name": "jo sellick", "sentiment": "none"}, {"name": "donald", "sentiment": "none"}, {"name": "jonathan gabay", "sentiment": "none"}, {"name": "hilary clinton", "sentiment": "none"}, {"name": "burge", "sentiment": "none"}, {"name": "may", "sentiment": "none"}, {"name": "price bailey", "sentiment": "none"}, {"name": "joe scarborough", "sentiment": "none"}, {"name": "charles olley", "sentiment": "none"}, {"name": "liz ward", "sentiment": "none"}, {"name": "jonathan gabay  he", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "saudi arabia", "sentiment": "none"}, {"name": "usa", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "getty images north america", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "trump", "sentiment": "none"}, {"name": "institute of economic development", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "randall & payne", "sentiment": "none"}, {"name": "virtuoso legal", "sentiment": "none"}, {"name": "sellick partnership", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business The North East and its business community won't escape Trump ripple effect What does the election of Donald Trump as US president mean for business and for the region? MARK LANE seeks opinion from the North East business community Share The election of Donald Trump has prompted a mixed response from North East business leaders Share Get business updates   Thank you for subscribing! Could   \nFormer UK Prime Minister Harold Wilson once said that a week is a long time in politics. If that famous proclamation has any credence, four years in politics is sure to seem like a lifetime - especially for people of a nervous disposition who happen to harbour serious concerns about the election of Donald Trump as president of the United States until 2020. \nIt's easy to see why many have concerns. Among the many stories doing the rounds about Trump is one by former Republican congressman Joe Scarborough who has claimed that prior to his election, Donald Trump asked a foreign policy expert three times why the United States couldn’t use nuclear weapons if he became president. \nTrump’s election, without doubt, will lead to a more unstable political landscape. He will ruffle feathers internationally, and what is for sure, is that our planet will be a more uncertain place with a former reality TV star overnight becoming the most powerful man in the world. \nBut what does that mean for business; and what, if anything, does it mean for the North East? I received a strangely mixed response when I put this question out to the North East business community. \nFew put themselves forward on the subject, and several I approached, who I respect greatly, declined to comment altogether. Some of the respondents I found were in the “give him a chance” category, others were simply worried about what the near future might bring. A significant number, meanwhile (including many of those who I expected to have a quotable view but received nothing they would allow me to use in print), had serious reservations. US President Donald Trump (Photo: Getty Images North America) \nIn today’s unprecedentedly public media goldfish bowl the usual commentators I turn to seemed too afraid to put on record what they really think. \nKeith Burge, a director with the Institute of Economic Development (IED) and member of the IED’s North East branch, was brave enough to come forward with a candidly negative view. Asked for his immediate, gut feeling on Trump becoming president, he was unequivocal, telling us: “Trump does not have a single redeeming feature. I fear the worst. Trump’s strategy appears to be to shoot from the hip and hang the consequences. \n“His actions threaten to undermine world economic growth and stability. Whilst his decisions might appear far removed from us here in the North East, the consequences will be felt sooner or later.” \nAnd this, of course, is the key question as far as we are concerned: will Trump’s presidency impact on our region – and if so, how? \nBurge adds: “It is already evident that Trump is protectionist. Worse still, he can smell the UK Government ’s desperation to do a trade deal and will exploit that to the full. \n“I don’t see it helping North East exporters greatly and may bring import competition. More importantly, a US trade deal will be no compensation for the loss of single market membership.” \nJo Sellick, managing director of Newcastle-based recruitment firm Sellick Partnership, also has reservations although – unlike Burge – is prepared to look for the positives in a Trump presidency. Jo Sellick, managing director of Newcastle-based recruitment firm Sellick Partnership \nSellick told us: “Personally, I am shocked by the decision, and the thought of Trump being in power is incredibly frightening. \n“Hilary Clinton was the clear front-runner from the offset, and some would argue the true victor after having secured the popular vote. \n“One thing you can say about Trump, however, is that his actions following the campaign are true to his word – despite what anyone thinks, he is following through on many of the promises he made that won him the electoral college votes needed to succeed Clinton.” \nBut is Trump’s outwardly gung-ho approach a threat to the global economy – and, consequently, the North East region? \nSellick says: “Part of what has made Donald Trump attractive to voters – a reality TV star with no political past – is what makes him such an unpredictable factor for the business world, and of course his presence will have some effect on the global economy. However I am hopeful that it may uncover new opportunities for us here in the UK moving forward. Read More North East MP joins criticism of Commons Speaker over Donald Trump ban \n“Trump has already said the UK is at the front of the queue for a new trade deal, and after Theresa May’s recent visit and Trump’s invitation to a state visit here in the UK I believe this to be true. \n“This deal, if secured, will be a positive step for May, who has been struggling to show that the UK can secure its own trade deals after it leaves the EU. Her bargaining position with the other 27 members of the EU will be strengthened if she can show that she can do business with Trump.” \nSellick makes the valid point that Britain will not be exempt from Trump’s protectionist approach, especially given that America currently takes more of our products than any other outside the EU. \nHowever, he added: “Trump’s protectionist measures seem to be aimed towards cheaper mass-produced products, rather than the goods the North East tends to export, such as road vehicles, machinery and medicinal and pharmaceutical products. So at present I see little reason to fear that any new barriers will affect the UK or firms across the North East region.” \nBrand strategist Jonathan Gabay said that what happens next in terms of political relations between the UK and USA will “place an indelible mark on the blueprint for global jobs, stability, peace and cross-cultural identity.\" Brand strategist Jonathan Gabay \nHe told us: “Assuming the Prime Minister remains in office, in terms of potential trade agreements outside the EU, her first visit with President Trump suggests an interesting backstory. \n“According to reports, Prime Minister May was aware of President Trump’s intention to temporarily close borders to certain countries, yet diplomatically she chose not mention this publicly. \n“This, along with talks with other world leaders, could allude to the PM looking towards a post-Brexit era where trading partners – especially trading giants with strong business ties with super-powered commercial partners like Saudi Arabia – will be essential to the UK.” \nLooked at like this, Theresa May’s courting of Trump – which many commentators have been highly critical of – could be viewed as a necessary evil in a post-Brexit world. Read More Donald Trump not welcome, Gateshead councillors say, amid call to boycott state visit \nBut what about the more general uncertainty that Trump brings to the global arena? Again, Gabay suggests it is a case of keeping an open mind. \n“He added: “Whilst in theory, business is predictable, in practice – as any senior business person will know – it can on occasion, involve dealing with people prone to making demands (the customer) changing minds over one thing or another (the customer) and even sometimes being what some would view as abstruse whilst others would view otherwise. \n“Trump is not your average politician who publicly says what is media-expedient and then does something else. He simply does one thing or another. So perhaps the question is, would you rather deal with someone who changes lanes in broad daylight with every hazard in full view, or a person who drives according to the Highway Code during the day but switches between lanes under the cover of darkness?” \nA professional sector view \nThe UK200Group – the UK’s leading membership association of chartered accountancy and law firms – asked its members how Donald Trump’s election victory is likely to affect the UK’s economy. \nLiz Ward, principal at UK200Group member firm Virtuoso Legal said: “I have real concerns that the US will harden its position on international trade and it will become more difficult for overseas businesses to take their goods and services to the US market. The US already makes it difficult for the importation of some goods, especially software and some cutting-edge technologies such as pharmaceutical products. \nA contrary opinion was offered by fellow UK200Group member Charles Olley, partner of accountants Price Bailey. Olley said: “I am delighted that Donald Trump has been elected. Career politicians who spend their lives inventing policies and rules for everyone else again feel the wrath of the voters, just as they did or should do with the Brexit vote. There is so much waste to come out of both the US and UK administrations and wider public economy, and I feel sure Donald will find some of it. \nFinally to Tim Watkins, managing director of UK200Group member accountancy firm Randall & Payne who said: “The business community thrives on certainty, and at the moment we have a number of doubts about the future which we are all doing our best to deal with. A victory for the Republicans may mean we are nearer the front of the queue for a post-Brexit trade deal but perhaps we can expect an element of isolationism on the part of the US going forward.” Like us on Facebook", "external_links": [], "published": "2017-02-08T20:22:00.000+02:00", "crawled": "2017-02-08T16:06:31.497+02:00", "highlightTitle": ""}