{"organizations": [], "uuid": "6d7509dc77b3a2a00837f442c03e5d4cda5f0f54", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12585705.ece/ALTERNATES/s1200/Untitled-design.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/whats-on/food-drink-news/first-look-inside-tapas-revolution-12585524", "country": "GB", "domain_rank": 21960, "title": "First look inside Tapas Revolution before it opens in Newcastle's Eldon Square", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "First look inside Tapas Revolution before it opens in Newcastle's Eldon Square", "spam_score": 0.0, "site_type": "news", "published": "2017-02-10T18:59:00.000+02:00", "replies_count": 0, "uuid": "6d7509dc77b3a2a00837f442c03e5d4cda5f0f54"}, "author": "Gordon Barr", "url": "http://www.chroniclelive.co.uk/whats-on/food-drink-news/first-look-inside-tapas-revolution-12585524", "ord_in_thread": 0, "title": "First look inside Tapas Revolution before it opens in Newcastle's Eldon Square", "locations": [], "entities": {"persons": [{"name": "omar", "sentiment": "none"}, {"name": "antonio banderas", "sentiment": "none"}, {"name": "grey", "sentiment": "none"}, {"name": "gordon ramsay", "sentiment": "none"}, {"name": "omar allibhoy", "sentiment": "none"}], "locations": [{"name": "eldon square", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "eldon square grey", "sentiment": "none"}, {"name": "toon", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}, {"name": "intu eldon square", "sentiment": "none"}, {"name": "madrid", "sentiment": "none"}, {"name": "newcastle share", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "neutral"}, {"name": "chronicle", "sentiment": "none"}, {"name": "eldon square newcastle share click", "sentiment": "none"}, {"name": "geordies", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "What's On First look inside Tapas Revolution before it opens in Newcastle's Eldon Square Watch our walk-through and cooking lesson at Tapas Revolution, which is about to open at Eldon Square Newcastle Share Click to play Tap to play The video will start in 8 Cancel Play now First look inside Tapas Revolution in Newcastle Share this video Get what's on updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nAfter reviewing restaurants for the Chronicle for more than 25 years, few have had me as excited as Tapas Revolution, which is about to open in Newcastle city centre. \nThe latest addition to Grey’s Quarter in intu Eldon Square opens on Monday, but I’ve had a sneak peak – and tasted a dish – from owner, Spanish TV chef Omar Allibhoy, who is bringing a taste of the real Spain to the Toon with his biggest opening yet. \nDubbed the ‘Antonio Banderas of cooking’ by Gordon Ramsay, he’s a man on a mission and while I may have called it a restaurant, Omar is quick to correct me! \n“I wouldn’t consider us a Spanish restaurant, it’s a tapas bar,” he smiles. “It brings the bar element, the cafe element and the restaurant altogether, like the traditional tapas bars back in Spain. \n“A tapas bar in Spain is conceived for absolutely everything you may need, whether it is coffee in the morning, light lunch, menu del dia, the set menu, or after work for drinks or a proper sit-down dinner. That is what the concept embraces, it is all-day. \n“It’s the meeting point in Spain. In Britain you would say, let’s meet in a pub, let’s meet for a pint. In Spain we say let’s meet for tapas. It doesn’t necessarily mean you are going to eat tapas all the time, it means that you can come for a beer, a gin and tonic, or a coffee and some breakfast and it is all combined.” Read More Look inside new intu Eldon Square Grey's Quarter restaurants \nFirst impressions mean a lot, and my sneak peak inside the tapas bar has me eager to try it out proper. Every ingredient is sourced from Spain. “Post Brexit it’s getting tougher,” laughs Omar. So why Newcastle ? “I found Geordies to be the closest to Spanish, in terms of demographic – very social, they go out a lot, are very friendly, and this is the place I felt closest to my home, Madrid. \n“We signed this place two and a half years ago, so it’s been a long wait. I just wanted to display the best we’ve got and bring it here. I think it will be well embraced as Spanish and Geordies seem like a match.” \nOmar cooked me a tapas dish to test – the gambas al ajillo (tiger prawns with garlic and chilli oil cooked in a terracotta dish) – and I have to say it is the tastiest prawn tapas I have ever had. \nYou can see how to make it yourself here: Video Loading Click to play Tap to play The video will start in 8 Cancel Play now", "external_links": [], "published": "2017-02-10T18:59:00.000+02:00", "crawled": "2017-02-10T14:26:13.046+02:00", "highlightTitle": ""}