{"organizations": [], "uuid": "4a86a7c7770b53101a39c37ad6d8cf6a676603f4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.liverpoolecho.co.uk/incoming/article12549610.ece/ALTERNATES/s1200/JS110710494.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/north-east-leaders-say-brexit-12593469", "country": "GB", "domain_rank": 21960, "title": "North East leaders say Brexit poll reflects the 'uncertain times' we live in", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "North East leaders say Brexit poll reflects the 'uncertain times' we live in", "spam_score": 0.0, "site_type": "news", "published": "2017-02-13T12:00:00.000+02:00", "replies_count": 0, "uuid": "4a86a7c7770b53101a39c37ad6d8cf6a676603f4"}, "author": "Dan O'Donoghue", "url": "http://www.chroniclelive.co.uk/news/north-east-news/north-east-leaders-say-brexit-12593469", "ord_in_thread": 0, "title": "North East leaders say Brexit poll reflects the 'uncertain times' we live in", "locations": [], "entities": {"persons": [{"name": "policy north", "sentiment": "none"}, {"name": "chi onwurah", "sentiment": "none"}, {"name": "emma lewell-buck", "sentiment": "none"}, {"name": "wansbeck", "sentiment": "none"}, {"name": "purvis", "sentiment": "none"}, {"name": "jeremy middleton", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "ian lavery", "sentiment": "none"}, {"name": "onwurah", "sentiment": "none"}, {"name": "stephen purvis", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "south shields", "sentiment": "none"}, {"name": "liverpool", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}], "organizations": [{"name": "brexit", "sentiment": "negative"}, {"name": "invalid email  regional", "sentiment": "none"}, {"name": "tories", "sentiment": "none"}, {"name": "newcastle central", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "trinity mirror", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News North East leaders say Brexit poll reflects the 'uncertain times' we live in A poll carried out by our publishers, Trinity Mirror, has revealed one in seven Brexit voters would now change their vote Share Click to play Tap to play The video will start in 8 Cancel Play now How the EU referendum unfolded Share this video Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nRegional business and political leaders have said our Brexit poll - which revealed one in seven leave voters would now vote remain - reflects the “uncertain times” we live in. \nThe poll, which surveyed more than 40,000 across the country and 2,536 in the North East, revealed that 11.9% of Brexiteers would change their mind if asked again. \nThe result drew surprise from some but the majority of the region’s movers and shakers said the task was not to re-run the referendum, but instead get the best possible deal for the North East. \nWansbeck MP Ian Lavery , whose constituency voted to leave by 55%, said: “I am of the firm view that we have got to move on with the Brexit vote. \n“During the campaign there were lies and innuendo from both sides, but we got the result and we have to accept that. \n“Regardless of what the survey says we had a referendum which returned a result, some may not like it but that is democracy. \n“If we had a general election and people didn’t like the result we don’t have another election straight away.” Ian Lavery MP for Wansbeck speaks at the 2016 Labour Conference in Liverpool \nHe added: “I can understand why people have said what they have in the survey, we are now having more measured discussions about the affects of Brexit and I think some people may now be more informed. \n“But we have had the vote and that is that. I am completely opposed to the Liberal Democrats and their position that we should have a second referendum, we have got to get on with the massive challenge ahead.” \nStephen Purvis, chairman of thinktank Policy North, said: “This is undoubtedly a period of uncertainty and there are difficult challenges ahead for the Prime Minister, which is reflected in this poll. \n“However there is also a real opportunity for the North, and especially for our businesses here in the North East, to emerge from this period of change with a powerful, new leading role in a global Britain. Read More Brexit survey revealed: What you would do if given second shot at EU referendum \nPolicy North will this week commission North East entrepreneur Jeremy Middleton CBE to write a special report of the impact a new industrial strategy can have on the North East and how it can be used to build a stronger economy for the region post Brexit. \nMr Purvis added: “It is now crucial the voice of the North is heard as the Government’s plans for a modern industrial strategy develop, ensuring Brexit works for the North East and we are able to make the most of those opportunities ahead.” \nEmma Lewell-Buck MP, whose South Shields constituency gave a massive 63% vote in favour of Brexit, said that the survey result did not tally with people in her constituency. \nShe said: “When I talk to people in my constituency they are solid with the way they voted, they haven’t changed their minds. \n“I think the most important thing for us to focus on is to get on with the negotiations and get the best deal for the region.” South Shields MP Emma Lewell-Buck \nShe added: “I am disappointed by the way the Government is handling things, I think Theresa May really needs to pull her finger out - and we in the opposition we fight to make sure they get their act together.” \nNewcastle Central MP Chi Onwurah, whose constituency was the only one in the North East to vote remain, said the survey revealed the uncertainty that people were feeling. Read More How would your area vote if there was a second EU referendum? Use our interactive tool to find out \nMs Onwurah, who recently voted against the Government’s bill to trigger Article 50 which gives the Prime Minister the authority to start the exit process, said: “I voted against triggering Article 50 as this is a Tory Brexit. People did not vote for that, just like with the financial crisis the Tories will make ordinary people pay the price. \n“The Government’s priority is protecting things like the banking sector not North East businesses. \n“The survey result shows how uncertain people are over this whole process.” Read More", "external_links": [], "published": "2017-02-13T12:00:00.000+02:00", "crawled": "2017-02-13T07:54:14.826+02:00", "highlightTitle": ""}