{"organizations": [], "uuid": "5ea66b2c8f67337cf41abb2a1d6ff8dc20c67e5f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/30161043/15875016.jpg", "site_section": "http://www.thisisleicestershire.co.uk/specialolympics/rss.html?chid=181121", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/some-strange-decisions-brexit-trump-and-now-ranieri-says-liverpool-boss-jurgen-klopp/story-30161043-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "Jon_Paul published Brexit, Trump and now Ranieri - some strange decisions, says...", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "Jon_Paul published Brexit, Trump and now Ranieri - some strange decisions, says...", "spam_score": 0.0, "site_type": "news", "published": "2017-02-24T20:55:00.000+02:00", "replies_count": 0, "uuid": "5ea66b2c8f67337cf41abb2a1d6ff8dc20c67e5f"}, "author": "Jon_Paul", "url": "http://www.leicestermercury.co.uk/some-strange-decisions-brexit-trump-and-now-ranieri-says-liverpool-boss-jurgen-klopp/story-30161043-detail/story.html", "ord_in_thread": 0, "title": "Jon_Paul published Brexit, Trump and now Ranieri - some strange decisions, says...", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Brexit, Trump and now Ranieri - some strange decisions, says Liverpool boss Jurgen Klopp By Jon_Paul | Posted: February 24, 2017 0 COMMENTS SHARES Claudio Ranieri and Jurgen Klopp Brexit, Trump and now Ranieri - some strange decisions, says Liverpool boss... X \nCopy link to paste in your message / Comments (0) \nLiverpool boss Jurgen Klopp has led a chorus of disapproval from Premier League managers at the sacking of Claudio Ranieri. \nRanieri's reign was brought to an abrupt end on Thursday night when Leicester City decided the Italian was not the right man to save them from the threat of relegation. \nDespite leading City to the Premier League title last season against all the odds, and penning a new contract last summer, Ranieri was dismissed and the club are left searching for a replacement. \nKlopp, who side face City at the King Power Stadium on Monday night, said it was a strange decision to sack Ranieri. \n\"Am I surprised that things like this can happen? No,\" said Klopp. \n\"There have been some strange decisions – Brexit, Trump and Ranieri. \n\"He's a really special person in this business. A really nice guy. Wonderful person, I have to say.\" 'I'm really sad for Claudio' \nSunderland manager David Moyes, whose side are bottom of the table, just two points behind fellow relegation rivals City, is also sad to see Ranieri go. \n\"I'm really disappointed for Claudio,\" said Moyes. \"For managers, it's put in perspective that you can win the Premier League and go three-quarters of the next season not doing so well and lose your job. \n\"I'm really sad for Claudio. I think it's a really disappointing day for managers all around the world if this is what can happen. \n\"I think they had a really good manager. And sometimes changing manager doesn't always work. There is not big proof that works. \n\"I'm hoping that in a way they become a bit rudderless. \n\"They are out there looking for a manager when at this time of the season, being stable, keeping things right, picking up the points... It was an incredible result to go to Seville and come away with a 2-1 defeat. \n\"It has given them a fantastic chance of getting through in the Champions League. I don't know what else has gone on.\" 'Football world moves so fast' \nCrystal Palace's Sam Allardyce, who is no stranger to the sack, is also battling against relegation. \n\"I was surprised about that one more than any other dismissal this year,\" he said. \"You don't get long these days.\" \nTottenham boss Mauricio Pochettino, who this time last year was fighting Ranieri for top spot in the Premier League, also expressed his disbelief. \nRead more: Mourinho sends Ranieri heartfelt message \n\"He was nominated as the best manager in the world, and (today), he was sacked,\" said the Argentine. \"How the football world moves so fast.\" \nBournemouth boss Eddie Howe said Ranieri's historic achievements makes it harder to understand why the Italian was dismissed. \n\"I was shocked and disappointed,\" said Howe. \"Knowing Claudio as I do, his public persona is very much his private persona. \n\"I've got a lot of time for him, he's a really great guy, a real gentleman, a real positive person. \n\"To see him lose his job in the manner that he has is very sad, considering the historic achievements of last season.\" 'Disappointed for Ranieri and for Leicester' \nWest Brom manager Tony Pulis was also disappointed at the news but hopes City can turn around their fortunes in the league. \n\"You've got to be focused on the next game,\" said the Baggies boss. \"In management, it turns so quickly. You can't take your foot off the pedal. \n\"If you do that, if you start to get relaxed or take things for granted, it's the worse game in the world for kicking you up the backside. \n\"I'm disappointed for the manager. I'm disappointed for Leicester. It's been a tremendous year for them. \n\"There are still 13 games to go, they could still have a run of games and finish mid-table, and they can still get through to the next stage of the Champions League, which would be a remarkable season.\"", "external_links": [], "published": "2017-02-24T20:55:00.000+02:00", "crawled": "2017-02-24T17:03:01.653+02:00", "highlightTitle": ""}