{"organizations": [], "uuid": "71bb8b32a95f1747f3c760857810c62a35d96fe4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12656907.ece/ALTERNATES/s1200/Jeremy-Corbyn-Delivers-Road-To-Brexit-Speech.jpg", "site_section": "", "section_title": "", "url": "http://www.chroniclelive.co.uk/news/north-east-news/theres-no-thing-safe-seat-12655877", "country": "IE", "domain_rank": 21960, "title": "'There's no such thing as a safe seat any more' - could the North East's political map turn blue? - Chronicle Live", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 0, "title_full": "'There's no such thing as a safe seat any more' - could the North East's political map turn blue? - Chronicle Live", "spam_score": 0.223, "site_type": "news", "published": "2017-02-26T15:00:00.000+02:00", "replies_count": 0, "uuid": "71bb8b32a95f1747f3c760857810c62a35d96fe4"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/theres-no-thing-safe-seat-12655877", "ord_in_thread": 0, "title": "'There's no such thing as a safe seat any more' - could the North East's political map turn blue? - Chronicle Live", "locations": [], "entities": {"persons": [{"name": "jeremy corbyn", "sentiment": "negative"}, {"name": "trudy harrison", "sentiment": "none"}, {"name": "chi onwurah", "sentiment": "none"}, {"name": "jeremy", "sentiment": "none"}, {"name": "anne-marie trevelyan", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "onwuarh", "sentiment": "none"}, {"name": "david winnick", "sentiment": "none"}, {"name": "keith", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "copeland", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "east cleveland", "sentiment": "none"}, {"name": "lincolnshire", "sentiment": "none"}, {"name": "darlington", "sentiment": "none"}, {"name": "cumbria", "sentiment": "none"}, {"name": "north west", "sentiment": "none"}, {"name": "brexit  ukip", "sentiment": "none"}, {"name": "copeland", "sentiment": "none"}], "organizations": [{"name": "labour party", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}, {"name": "walsall labour", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "middlesbrough south", "sentiment": "none"}, {"name": "tories", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "newcastle central", "sentiment": "none"}, {"name": "conservative councillors’ association", "sentiment": "none"}, {"name": "snp", "sentiment": "none"}, {"name": "bishop auckland", "sentiment": "none"}, {"name": "stoke central", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Labour Leader Jeremy Corbyn (Photo: Getty Images Europe) Share Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \n“There’s no such thing as a safe seat any more”. \nCould parts of the North East be about to turn blue? \nLabour could lose three regional seats to the Conservatives if voting patterns in the Copeland by-election are repeated in the rest of the country. \nBishop Auckland, Darlington and the constituency of Middlesbrough South and East Cleveland would all turn from red to blue, if voters in the next general election behave in a similar way to those in Copeland, Cumbria. \nOne Labour politician, Newcastle Central MP Chi Onwurah , today said: “There’s no such thing as a safe seat any more.” \nLabour retained Stoke Central in Thursday’s dramatic by-elections but suffered a disastrous result in Copeland, losing the seat to the Tories. A polling station in Copeland (Photo: Getty Images Europe) \nWhile Copeland was a marginal seat, with Labour gaining a majority of just 2,564 votes in the 2015 general election, it is almost unheard of for a constituency to switch from the main opposition party to the party of government during a by-election. Historically, parties tend to become less popular when they are in power while opposition parties see their support increase. \nThere was a swing from Labour to Conservative of 6.69% in Copeland. The three North East seats would switch from Labour to Conservative if the same swing took place there. \nHowever, there is a complicating factor in the North East because UKIP picked up thousands of votes in many constituencies across the region in 2015. Read More Pressure mounts on Jeremy Corbyn over Labour's stance on Article 50 and Brexit \nUKIP had been seen as the main challengers in Stoke, but failed to make progress and there is speculation that the party, known for its opposition to the European Union, could lose support as Brexit takes place. \nIt remains to be seen whether former UKIP voters will switch to the Conservatives or to Labour, if the party’s support does indeed decline. \nMs Onwuarh said she was delighted Labour had held Stoke adding: “But looking at Copeland, we need to do better. Copeland should be a Labour seat.” \nAnd she said that UKIP’s failure to win Stoke could mean there was a danger for Labour. \n“If UKIP’s support really is on the wane then I think it does mean many of their voters will go to the Tories.” \nAsked if Labour seats in the North East could be threatened, she highlighted the SNP’s success in gaining almost every Labour-held seat in Scotland, which was once seen as a Labour heartland. \n“I think the concept of safe seats went with the SNP victory in Scotland. \n“If there were MPs complacent enough to believe in it before, we’ve now seen how fast change can happen.” \nShe added: “We need to be out every weekend, as I will be, talking and listening to what people say.” Conservative candidate Trudy Harrison and Husband Keith kiss after winning the Copeland by-election (Photo: PA) \nConservatives were celebrating the Copeland win and suggested the victory in the North West seat, which has returned Labour candidates since its 1983 creation, suggested their party’s message was getting across in ever part of the country. \nBerwick-upon-Tweed Conservative MP Anne-Marie Trevelyan said: “I think this reflects both a really great local candidate and Theresa May’s absolutely determined belief that the policies we drive forward as a Conservative government should work for everyone, everywhere. \n“Knocking on doors and on the phone, that’s what we were hearing - we like Theresa May and her view of the world. \n“The Conservative message has become less of a geographically based message. It’s one that resonates across the country with people who want to get on and have the tools to do it.” Read More Nissan shows faith in North East with £37m investment in new press \nConservative leader Theresa May said the win showed that her party was now the party of working people. \nSpeaking to Conservative Councillors’ Association conference in Lincolnshire, she said the result was a “devastating blow” for Labour, and “proof that Labour are out of touch with the concerns of ordinary working people”. \nJeremy Corbyn welcomed the Stoke result and insisted he would stay on as Labour leader, Labour Party leader Jeremy Corbyn is mobbed by television reporters during a visit to Stoke-On-Trent (Photo: Getty Images Europe) \nHe said the Copeland loss was “very disappointing” but added: “I was elected to lead this party. I am proud to lead this party. We will continue our campaigning work on the NHS, on social care, on housing.” \nMost of Mr Corbyn’s critics within the Labour Party remained quiet. One exception was Walsall Labour MP David Winnick, who said the Copeland result proved Mr Corbyn was “simply not acceptable to a large number of people who would normally vote Labour”. \nHe went on: “It is now entirely up to Jeremy and those close to him to decide what is best in the interests not simply of the party but of the people we are in politics to represent.” Like us on Facebook ", "external_links": [], "published": "2017-02-26T15:00:00.000+02:00", "crawled": "2017-02-26T10:49:53.314+02:00", "highlightTitle": ""}