{"organizations": [], "uuid": "e9268b260fd75dcf6dc7c52177f218b565a5f52a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.gazettelive.co.uk/incoming/article14254419.ece/ALTERNATES/s1200/VRR_JNL_080217_mankin_01.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/special-features/positive-momentum-deals-market-despite-14254075", "country": "GB", "domain_rank": 21960, "title": "Positive momentum in deals market despite economic uncertainty", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-07T02:01:00.000+02:00", "replies_count": 0, "uuid": "e9268b260fd75dcf6dc7c52177f218b565a5f52a"}, "author": "Adam Gray", "url": "https://www.chroniclelive.co.uk/special-features/positive-momentum-deals-market-despite-14254075", "ord_in_thread": 0, "title": "Positive momentum in deals market despite economic uncertainty", "locations": [], "entities": {"persons": [{"name": "paul mankin", "sentiment": "negative"}], "locations": [], "organizations": [{"name": "general election", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Positive momentum in deals market despite economic uncertainty Paul Mankin, the corporate finance partner of PwC, reviews the annual deals activity of 2017 Share Adam Gray Native Content Writer 00:01, 7 FEB 2018 Get daily   Thank you for subscribing!   \nWe anticipated a bumpy ride in the deals market in 2017 as a result of apparently slow progress in the Brexit negotiations and the increased levels of uncertainty in the market caused by the General Election. \nIf actual levels of deal activity in the region are taken as a barometer then this has proved to be the case. There were 148 transactions completed during 2017 which was a decrease in activity of almost 20% compared to the previous year. \nHowever, if we take a closer look at the underlying data, a more positive picture of the North East deals market emerges. Firstly, the total disclosed deal value reached a seven-year high of £4.13 billion – an increase of almost 50% on 2016. \nThere was a good spread of deal sizes with eight transactions having a disclosed value of more than £100m compared to three in 2016, and 15 deals greater than £25 million were recorded during the year. \nA reduction in investment activity at the smaller value end accounted for a decrease in deal volumes across the region. The delay in the launch of the North East Fund (Jeremie 2) also had a significant impact on activity. \nThe old Jeremie Fund closed in December 2016 and it has only recently been announced that agreement has been reached in principle with the European Investment Bank for the new fund to be launched in 2018, which is good for the region. \nThere was a fall in the number of acquisitions made by North East companies during the year compared to 2016, although several businesses made multiple acquisitions. \nContinuing to follow the downstream buyout model, Fairstone added twelve IFAs in 2017. \nHC One acquired Helen McArdle Care early in the year and followed this by paying £300 million for 122 care homes from Bupa. \nStadium Group also made two acquisitions as did Carr’s Group, Pacifica and Patrick Parsons. \nThe continuing economic and political instability does not appear to have had an impact on international deal flow in the region. \nThe proportion of cross-border M&A activity has remained static over the past couple years at 18%, only slightly down on the levels of the previous three years. \nThe number of UK companies investing in the North East rose by a third compared to 2016 with 38 domestic disposals of North East businesses. \nSignificant transactions included the sale of O’Brien Waste to Biffa Plc for more than £30 million and the sale of urgent care services provider Vocare to Totally Plc. The largest domestic disposal was the sale of Quantum Pharma to fellow AIM-listed company Clinigen for £150 million. Quantum floated in 2014 providing an exit for LDC and in February last year NorthEdge exited Ramsdens via an IPO. \nThe only other private equitybacked IPO to have taken place in the North East was ScS in 2015. \nThe record levels of private equity activity in the region in 2016 were not sustained last year with the number of new investments cancelling out the exits. In addition to the Ramsdens IPO there were four significant exits – all to cross-border trade acquirers. First announced at the end of 2016, the £1.35 billion secondary buy-out of Parkdean was one of three completing in 2017. \nAlthough businesses are mindful of the uncertainty around Brexit and the eventual impact this might have, it does not seem to be preventing them from pressing ahead with their growth strategies through M&A. \nOffsetting these factors is the continuing high levels of funding available from private equity, development capital and from lenders, which is enabling shareholders with quality businesses to look for a full exit, derisk, or raise funding to support future growth plans. \nAdded to these factors is the need for companies to keep pace with new technologies, which is already impacting the global deals market with non-tech companies buying the technologies they need. Mergermarket predicts this will be a key driver of dealmaking in 2018. \nI expect the combination of these factors to continue to make it a seller’s market with high multiples paid for the right assets and so the positive momentum across the deals market looks set to continue throughout 2018. Charlotte Tracy (Image: Handout) Charlotte Tracy, director of corporate finance, PwC, reviews private equity activity in the North East in 2017 \n2016 was a record year in the region for private equity activity but these levels were not sustained in 2017 with numbers dropping to similar levels recorded in 2015. \nThere were 13 significant transactions of which nine completed in the first half of 2017. Of these, only five were primary buyouts which is half the number recorded in each of the previous two years. Having said that, the level of secondary buyouts and trade exits remained consistent and with almost 50 significant private equity portfolio companies currently based in the North East, there is plenty of potential for the level of private equity exits to be maintained. \nInitially announced at the end of 2016, the largest disclosed deal of the year was the secondary buyout of Parkdean by Canadian private equity firm Onex Corp for £1.35 billion, which provided an exit for Electra and Alchemy Partners and was one of three secondary buyouts to complete in 2017. Exits: \nIt was encouraging to see significant inbound deal activity in 2017, with four portfolio companies being sold to international trade buyers. Innovia Group was sold to Canadian speciality label business CCL Industries for £681m, Nomad Holdings was sold to French headquartered Alstom, NorthEdge sold Fine Industries to Chinese-based life sciences company Lianhetech for over £100m, and BGF exited Chemoxy in a sale to French chemical company Novocap. Most active private equity houses: \nBGF, who exited Chemoxy in 2017, has made seven investments in the region – the first one being an £8 million investment in Wear Inns back in 2012 which it still holds along with J&B Recycling, Broadband Satellite Services and Total Recycling Services. The second most active private equity house in the region has been NVM, having made six significant investments over recent years. And whilst 3i have historically been active across the region its exit from Mayborn in 2016, 10 years after investing, was the last North East company within 3i’s portfolio. \n2017 also saw NorthEdge transact twice in the same month. Exiting Fine Industries and backing the existing management team at Sunderland headquartered Clearly Drinks in April. In February they also completed a partial exit of Ramsdens Holdings via an IPO and sold the remaining 30% in a share placing on AIM in December. \nWhether it’s a case of regional private equity backed companies acquiring such as Fairstone, Patrick Parsons and HC One or private equity houses investing or exiting, recent activity would suggest that despite the political ambiguity surrounding Brexit negotiations there will continue to be a healthy deal flow from private equity in the North East during 2018. Kate Campbell (Image: Handout) Kate Campbell, assistant director corporate finance, PwC, talks cross-border deal activity in the North East region \nThe proportion of international versus domestic merger and acquisition (M&A) activity in the North East market has remained reasonably static over the past five years, accounting for approximately 20% of the total number of acquisitions and disposals each year. \nHowever, since 2013 we have seen more than double the number of international companies acquiring businesses in the North East compared with regional businesses buying overseas. \nDespite the UK currently moving towards Brexit, mainland Europe has accounted for more than 40 per cent of cross-border activity. There have been more than twice as many European companies investing in the region compared with acquisitions made by regionally-based businesses on the continent. In 2017, these included the sale of the Explorer Group to German company Erwin Hymer, Nomad to Alstom, and Chemoxy to Novocap. \nOutside of Europe, the US accounted for around a third of cross-border deal activity. In the last five years US-based corporates have acquired 21 companies in the region, although the number of deals completed annually have been in decline, from six in 2013 to just two in 2017 which included the sale of Sevcon to Borgwarner Inc. \nConversely, the number of US acquisitions made by North East-based businesses has increased from two in 2013 to five over the last year. \nThis has not been limited to acquisitions by North East-based PLCs such as Sage and Carr’s, but also Riba Enterprises who acquired Digicon Information at the start of the year and Thomas Swan, who acquired a specialist chemical manufacturing facility in Alabama in October 2017. \nOne trend that has come to prominence is the emergence of Chinese investors in the region. In 2015, PwC acted for SMD when it was acquired by CSR for £120m. This was the first of three significant exits by private equity houses by way of a trade sale to a Chinese corporate that PwC has acted on in the North East. A year later 3i sold Mayborn to Shanghai Jahwa and in 2017, we also advised Fine Industries on its sale to Lianhetech providing an exit for NorthEdge. \nThe deals activity suggests that businesses based in the North East are becoming increasingly attractive investments for European and Asia-Pacific based acquirers, whereas on the other hand US companies are becoming more attractive investment opportunities to North East buyers. \nAgainst the ongoing political and economic uncertainties, it will be interesting to see if these trends continue in 2018. Like us on Facebook", "external_links": [], "published": "2018-02-07T02:01:00.000+02:00", "crawled": "2018-02-07T03:09:09.009+02:00", "highlightTitle": ""}