{"organizations": [], "uuid": "edf9c644c01b93f12cfcb3ffff51098829ae453f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14265434.ece/ALTERNATES/s1200/Brexit.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/stop-taking-idiots-theresa-facing-14264972", "country": "GB", "domain_rank": 21960, "title": "'Stop taking us for idiots': Theresa May facing Brexit backlash from North East employers", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-08T20:00:00.000+02:00", "replies_count": 0, "uuid": "edf9c644c01b93f12cfcb3ffff51098829ae453f"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/stop-taking-idiots-theresa-facing-14264972", "ord_in_thread": 0, "title": "'Stop taking us for idiots': Theresa May facing Brexit backlash from North East employers", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "ross smith", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "john redwood", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}], "organizations": [{"name": "necc", "sentiment": "none"}, {"name": "neecc", "sentiment": "none"}, {"name": "north east england chamber of commerce", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily   \nEmployers have told the Government to stop “taking us for idiots” following the leak of damning assessments showing Brexit will cause huge damage to the North East’s economy. \nThere’s been reaction across the region to Government analysis showing the economy will be hurt more in the North East than in any part of the United Kingdom. \nSupporters of Brexit pointed out gloomy warnings about leaving the EU have been proved wrong before. \nBut North East England Chamber of Commerce (NEECC) said the Government now needed to explain how it would protect the region. Ross Smith, North East England Chamber of Commerce's NECC Director of Policy \nRoss Smith, director of policy, said the Government must explain why it believed Brexit would be a success. \nHe added: “They should explain what these beliefs are based on, and that should be something rather more substantial than vague talk of a bespoke trade agreement. \n“Don’t keep taking us for idiots, and don’t leave the only counter argument to come from long-term anti-EU ideologues like John Redwood claiming the figures are wrong without any evidence.” \nHe added: “Businesses in North East England need to attract people to live, work and invest in our region. Given that these figures have now been released, we need something much more concrete than we have seen to date from Government to support us in doing that.” \nBut Brexit-supporting MEP Jonathan Arnott said the downbeat predictions were based on Treasury data which had been proved wrong in the past. Jonathan Arnott (Image: Getty Images Europe) \nThe North East MEP, previously with UKIP and now an independent, said: “Actual recent empirical evidence suggests that we shouldn’t believe a word of it.” \nHe pointed out the Treasury warned during the EU referendum campaign the economy would shrink if the country voted to leave, even before Brexit actually happened - but this prediction had not come true. \n“The reason these figures are always out is that they consider the downside rather than the upside,” said Mr Arnott. \n“Nobody ever factors in the benefits of Brexit; the ability to negotiate trade deals with third countries, the ability to get rid of unnecessary EU regulations, or run a more competitive economic policy. \n“Here in the North East, the figures have the worst projections in the UK - and why? Because for a region that trades more than any other with non-EU countries, the failure to consider the benefits of Brexit will mean the figures are more wrong than anywhere else in the UK.” \nReaction to the leak at Westminster has been muted, perhaps because both major parties are committed to pressing ahead with leaving the EU. \nKeir Starmer, Labour’s Shadow Brexit Secretary, issued a statement on Twitter saying: “Time for those advocating hard Brexit to take responsibility for their decisions instead of blaming others.” \nBut the analysis shows the North East economy will be 11% smaller than previously predicted even if the UK agrees a trade deal with the EU. \nQuitting without a deal would mean regional economic output is down by 16% within 15 years. Read More At last the truth: Brexit will devastate North East economy, leaked Government paper shows \nThe only way to significantly reduce the damage would be to stay in the single market, which would mean the North East economy shrank by just 3%. \nHowever, both Labour and the Conservatives appear to be opposed to continued single market membership, despite pressure from some Labour politicians such as Sedgefield MP Phil Wilson, who backs continued single market membership. Phil Wilson MP \nThink tank IPPR North said the Government should now publish the figures officially. \nSenior researcher, Luke Raikes, said: “Government should publish the detail of these impact assessments urgently, so that businesses in the North may prepare.” \nPrime Minister Theresa May insisted Brexit would allow the UK to do more trade across the world, as she met senior bosses of Japanese businesses at 10 Downing Street. Read More", "external_links": [], "published": "2018-02-08T20:00:00.000+02:00", "crawled": "2018-02-08T20:38:29.072+02:00", "highlightTitle": ""}