{"organizations": [], "uuid": "274bf29d9366488461a1f76bdcee0ddcd2d4ff53", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13852203.ece/ALTERNATES/s1200/PIP-payments.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/mistakes-during-controversial-disability-assessments-14285547", "country": "GB", "domain_rank": 21960, "title": "Mistakes during controversial disability 'assessments' have destroyed faith in the system, MPs say", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-14T07:00:00.000+02:00", "replies_count": 0, "uuid": "274bf29d9366488461a1f76bdcee0ddcd2d4ff53"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/mistakes-during-controversial-disability-assessments-14285547", "ord_in_thread": 0, "title": "Mistakes during controversial disability 'assessments' have destroyed faith in the system, MPs say", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "commons work and pensions committee", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Mistakes during controversial disability 'assessments' have destroyed faith in the system, MPs say Trust has collapsed in the system of assessments for people claiming Employment and Support Allowance and Personal Independence Payments Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nMistakes during controversial “assessments” of people with disabilities and long-term illnesses have destroyed confidence in the system, MPs have concluded. \nThey urged the Government to consider dismissing private firms hired to carry out the assessments, which help determine whether or not claimants get benefits such as Employment and Support Allowance (ESA) and Personal Independence Payments (PIP). \nThe Commons Work and Pensions Committee said it had an “unprecedented” response when it asked members of the public to get in touch with their experiences of being assessed. \nSome people said reports of their assessments included the results of physical examinations that hadn’t happened. Some reports left out crucial information provided during the interview, and some seemed to refer to entirely different people. Around 10,000 will get an extea £70 - £90 a week in PIP payments (Image: PA) \nPublishing their findings, the MPs said the number of mistakes taking place, and the number of decisions eventually overturned on appeal, had created “a lack of trust in both benefits” and led to fears the system is deliberately rigged against claimants. \nThey said: “At worst, there is an unsubstantiated belief among some claimants and their advisers that assessors are encouraged to misrepresent assessments deliberately in a way that leads to claimants being denied benefits.” \nResponding to the findings, the Department of Work and Pensions said it aimed to ensure every person feels they are treated fairly, with respect and dignity, and was looking at ways of making sure assessments were more transparent. \nMPs published the conclusions in a 66-page report following a lengthy investigation, which included interviews with Government Ministers, assessors and claimants. \nThe MPs received more than 3,500 written submissions from members of the public, many of whom had been through assessments, as well as almost 200 from organisations \nIt follows long-standing concern that firms such as Capita, Atos Independent Assessment Services and Maximus Centre for Health and Disability Assessments, who are employed by the Department for Work and Pensions (DWP), are not doing a good job. \nCampaign groups and some backbench MPs have claimed that assessments are riddled with mistakes, and claimants are humiliated or asked irrelevant questions \nEvidence presented to the inquiry appeared to back this up. The Down’s Syndrome Association reported parents of children with the genetic condition being asked how long they’ve had it and how they caught it. \nOne person with serious mental health problems read in the report of their assessment that their mental health clearly wasn’t an issue because they had smiled. \nThe Work and Pensions Committee pointed out that since 2013, 290,000 claimants of PIP and ESA - 6% of all those assessed - only received the correct award after challenging DWP’s initial decision. \nBut even for people whose claims are dealt with properly, a belief that the system can’t be trusted leads to “distress and confusion” and encourages more appeals, driving up costs, the MPs said. \nThey said assessments should be recorded, to increase transparency and improve trist in the process. \nAnd the MPs said that the DWP should consider whether to replace the current private assessors. Read More Labour attacks Northumbrian Water's £108m payment to shareholders \n“The Department will need to consider whether the market is capable of delivering assessments at the required level and of rebuilding claimant trust. If it cannot - as already floundering market interest may suggest - the Department may well conclude assessments are better delivered in house.” \nLaura Pidcock, Labour MP for North West Durham, is one of a number of politicians to have raised concerns. \nShe said: “I definitely would say Atos and Capita are not capable of carrying out these contracts.” \nAssessments appeared to focus on physical abilities, such as whether people could raise their arms or walk a given distance, but did not take into account mental health conditions that mean cause different symptoms from day to day, she said. Read More 'How did you get Down's Syndrome?' Seven shocking examples of assessors' questions during PIP tests \n“Many constituents have said to us that there are lies in the report. \n“I know that sounds like a very strong thing to say. But the assessors are under so much pressure, they have targets for the number of people they have to get through in a day that it just doesn’t make for a morally sound system.” \nA Department for Work and Pensions spokesperson said: “As the Work and Pensions Committee highlights, assessments work for the majority of people, with 83% of ESA claimants and 76% of PIP claimants telling us that they’re happy with their overall experience. \n“However, our aim has to be that every person feels they are treated fairly, with respect and dignity. Read More Theresa May and her ministers plan six speeches to answer questions about Brexit \n“We are committed to continuously improving the experience of our claimants, that is why we’ve commissioned five independent reviews of the Work Capability Assessment – accepting over 100 recommendations – and two independent reviews of PIP assessments. \n“We continue to work closely with our providers to ensure people receive high quality assessments, and are exploring options around recordings to promote greater transparency and trust.” Like us on Facebook", "external_links": [], "published": "2018-02-14T07:00:00.000+02:00", "crawled": "2018-02-14T08:07:06.001+02:00", "highlightTitle": ""}