{"organizations": [], "uuid": "2276cbae84d01f333d4cc14d3649ff4fcbd10558", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article12987348.ece/ALTERNATES/s1200/Brexit.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/brexit-not-turn-britain-mad-14311388", "country": "GB", "domain_rank": 21960, "title": "Brexit will not turn Britain into a Mad Max-style wasteland, pledges David Davis", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-20T00:30:00.000+02:00", "replies_count": 0, "uuid": "2276cbae84d01f333d4cc14d3649ff4fcbd10558"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/brexit-not-turn-britain-mad-14311388", "ord_in_thread": 0, "title": "Brexit will not turn Britain into a Mad Max-style wasteland, pledges David Davis", "locations": [], "entities": {"persons": [{"name": "david davis brexit", "sentiment": "negative"}, {"name": "david davis", "sentiment": "negative"}, {"name": "brexit", "sentiment": "none"}, {"name": "davis", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Brexit Secretary David Davis (Image: PA) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nLeaving the European Union will not turn the UK into a Mad Max-style science fiction dystopia, Brexit Secretary David Davis is to pledge. \nIn a speech setting out how the UK plans to continue trading with the EU after Brexit , he will stress that there are no plans to slash regulation and create a “race to the bottom”. \nThe UK will no longer be bound by EU rules after Brexit, but Mr Davis will say that the Government will continue to enforce high standards on issues such as workers’ rights or environmental protection. Read More \nAnd this will make it easy for the EU and UK to co-operate and trade together. \nMr Davis will also insist he is “certain” the EU and UK can achieve a good deal. \nThe speech, entitled ‘Road to Brexit: Foundations of the future economic partnership’, is designed to provide some detail about how Brexit will work. \nMr Davis will say: “We will continue our track record of meeting high standards after we leave the European Union. \n“Now, I know that for one reason or another there are some people who have sought to question that these really are our intentions. \n“They fear that Brexit could lead to an Anglo-Saxon race to the bottom. \n“With Britain plunged into a Mad Max-style world borrowed from dystopian fiction. \n“These fears about a race to the bottom are based on nothing, not history, not intention, nor interest.” \nBut he will say that the UK needs to reassure people that such fears are unfounded. \nMr Davis will also say that the UK will be free to set its own rules, but these will be based on “a common set of principles” shared with the European Union. \n“A crucial part of any such agreement is the ability for both sides to trust each other’s regulations and the institutions that enforce them. \n“Such mutual recognition will naturally require close, even-handed cooperation between these authorities and a common set of principles to guide them. \n“And the certainty that Britain’s plan, its blueprint for life outside of Europe, is a race to the top in global standards not a regression from the high standards we have now, can provide the basis of the trust that means that Britain’s regulators and institutions can continue to be recognised. \n“This will be a crucial part of ensuring our future economic partnership is as open, and trade remains as frictionless as possible. Read More \n“I am certain that is in the interests of both sides \n“And because of that, I am certain that we can get this right.” Like us on Facebook", "external_links": [], "published": "2018-02-20T00:30:00.000+02:00", "crawled": "2018-02-20T01:18:20.044+02:00", "highlightTitle": ""}