{"organizations": [], "uuid": "94c87611407c08ac8037da73751cc13f2b151657", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13448953.ece/ALTERNATES/s1200/ECP_NEC_160416boris_012JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/boris-johnson-brexit-warning-live-14288266", "country": "GB", "domain_rank": 21960, "title": "Boris Johnson Brexit warning LIVE: Derailing plan to leave European Union would be 'disastrous mistake'", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-14T13:15:00.000+02:00", "replies_count": 0, "uuid": "94c87611407c08ac8037da73751cc13f2b151657"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/boris-johnson-brexit-warning-live-14288266", "ord_in_thread": 0, "title": "Boris Johnson Brexit warning LIVE: Derailing plan to leave European Union would be 'disastrous mistake'", "locations": [], "entities": {"persons": [{"name": "jonathan walker", "sentiment": "negative"}, {"name": "boris johnson brexit", "sentiment": "negative"}, {"name": "johnson", "sentiment": "none"}, {"name": "jonathan walker  boris i", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "boris", "sentiment": "none"}, {"name": "jonathan walker  boris", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}], "organizations": [{"name": "european union", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The Sun’s Political Editor \nA pro-EU Conservative MP \nThe Sunday Times Political Editor 11:58 Jonathan Walker The speech and press conference comes to an end \nAnd that’s it. The message to Brexit supporters is that they have to accept that remainers have genuine concerns, and treat them with respect. \nThe message to remain supporters is that Brexit won’t be as bad as they fear. \nHas Boris convinced you? 11:57 Jonathan Walker \nBoris on his attempt to win over remainers and convince them Brexit won’t be so bad: “I accept that this morning I’m not going to persaude everybody. But I’ve got to try.” 11:50 Jonathan Walker \n“I really think that people’s fears are unfounded. We can make a great, great success of this”. 11:49 Jonathan Walker \nMr Johnson is now answering questions. A journalist tells him that he is a “divisive figure”. \nMr Johnson says he has been “extremely moderate” in the things he says, “and loving and caring”. 11:48 Jonathan Walker \nOne of the key lines of the speech was the assertion that Brexit must mean the UK makes its own rules and regulations. This means not being bound by the EU rules that govern the single market. \nMr Johnson said: “We would be mad to go through this process of extrication from the EU and not to take advantage of the economic freedoms it will bring.” 11:47 Jonathan Walker \nAlthough Mr Johnson talks about healing divisions, some journalists think that he’s really sending a message to his opponents in the Cabinet \nBoris also rules out a second referendum 11:44 Jonathan Walker \nBoris ends his speech by saying Brexit is “the great liberal project of this age” and one that can eventually unite the whole country. 11:44 Jonathan Walker \nBoris insists that Britons will continue to be able to live, work and retire in the EU after Brexit. \n“If we get the right deal on aviation and on visa-free travel - both of which are in our mutual interest - this expansion of UK tourism will continue, not just beyond the EU but within the EU itself. \n“There is no sensible reason why we should not be able to retire to Spain. “For those who really want to make Britain less insular, the answer is not to submit forever to the EU legal order.” 11:43 Jonathan Walker \n“Brexit is about re-engaging this country with its global identity and all the energy that can flow from that. \n“I absolutely refuse to accept the suggestion that it is an un-British spasm of bad manners. \n“It’s not some great V-sign from the cliffs of Dover, it is the expression of legitimate and natural desire to self govern of the people, by the people, for the people. \n“That is surely not some reactionary Farageist concept.” 11:38 11:37 Jonathan Walker \nBoris is making the case for what’s sometimes described as a “hard” Brexit, which involves not being part of the Single Market and Customs Union. That’s because being part of these institutions would mean obeying rules which are decided by the EU. \nHe says: “It’s only by taking back control of our laws” that UK firms will be able to innovate. \n“That would be intolerable, it would be undemocratic” and it would make it impossible for us to sign new free trade deals. Foreign Secretary Boris Johnson (Image: Getty Images Europe) 11:34 Boris welcomes immigration - but only for skilled workers \nMr Johnson is still in favour of immigration - but only for skilled workers. \nHe says the UK shouldcontinue to accept skilled EU immigrants. Talks about “high earning, high spending types” who came to London. \n“But we also need to ask ourselves some hard questions about the impact of 20 years of uncontrolleed immigration” by low skilled, low wage workers and the effect it had on British workers, he says. 11:31 Jonathan Walker \nPeople didn’t vote leave because they are “hostile to European culture and civilisation” but because they wanted to take back control, says Boris 11:29 Jonathan Walker \nBoris says the aim of EU’s policies is to create an over-arching European state. British politicians have always found this difficult to accept. \n“Ever more powers and competencies have been handed to EU institutions.” 11:28 Reaction to Boris Johnson's speech 11:26 Jonathan Walker \nBoris points out that the UK actually used to be joined to the European mainland in the past (actually about 8,000 years ago) \n“Britain and Holland used to be joined by a territory known as Doggerland, though the customs of Doggerland and now lost to history” 11:22 Jonathan Walker \n“We will continue to be Eurpeans both practically and psychologically.” \nBut Boris also points out that the UK already has links with other parts of the world and those will continue. \nThe UK has a large “diaspora” of Brits living in countries such as Australia and Canada, he says. 11:19 Jonathan Walker \nBoris Johnson asks: “Is this the time now for the referendum winners to gloat?” \nHe says the Brexiteers won the referendum - but they must accept that “leave” voters have real concerns about what it means for the UK. \n“It’s not good enough now for us to say to remainers, ‘you lost, get over it’.” 11:18 KEY EVENT Boris wants to reassure 'remain' voters about Brexit \nBoris Johnson, the Foreign Secretary and a leader of the “leave” campaign in the 2016 Brexit referendum, is delivering a speech at the headquarters of the Policy Exchange think tank in London. \nHe says he wants to reassure people who are sceptical about Brexit that it won’t be bad for the UK. Britain's Foreign Secretary Boris Johnson (Image: Getty Images Europe) More On", "external_links": [], "published": "2018-02-14T13:15:00.000+02:00", "crawled": "2018-02-14T14:00:17.001+02:00", "highlightTitle": ""}