{"organizations": [], "uuid": "5d79c9dc68452c9eefb41ac8d7ef374c4f1f044a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article1178761.ece/ALTERNATES/s1200/34720430.jpg", "site_section": "http://www.leicestermercury.co.uk/rss.xml", "section_title": "leicestermercury - frontpage", "url": "https://www.leicestermercury.co.uk/news/business/businesses-just-weeks-comply-gdpr-1178940", "country": "GB", "domain_rank": 48128, "title": "Businesses have just weeks to comply with GDPR - aka General Data Protection Regulation", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-13T02:00:00.000+02:00", "replies_count": 0, "uuid": "5d79c9dc68452c9eefb41ac8d7ef374c4f1f044a"}, "author": "Tom Pegden", "url": "https://www.leicestermercury.co.uk/news/business/businesses-just-weeks-comply-gdpr-1178940", "ord_in_thread": 0, "title": "Businesses have just weeks to comply with GDPR - aka General Data Protection Regulation", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "none"}, {"name": "howes percival", "sentiment": "none"}, {"name": "paula bailey  law", "sentiment": "none"}], "locations": [], "organizations": [{"name": "general data protection regulation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get Business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nWhile Brexit takes the headlines, the coming year will also be a key period for data protection. \nThe General Data Protection Regulation (GDPR) comes into force on May 25. \nThe huge shake-up will see the introduction of fines of up to 20 million euros (around £17.7 million) – or 4 per cent of a company’s global turnover – for privacy breaches. \nFollowing a two year transition period the changeover will alter how businesses can use customer information – with tougher punishments on those failing to comply with personal data storage and handling rules. \nTo make matters worse GDPR introduces a duty of \"accountability\" which means companies have a legal obligation to ensure they are compliant in advance. \nAlthough widely considered to be the biggest change to data protection in 20 years, research shows that almost two-thirds of businesses are unaware of the changes, leaving them susceptible to fines. Howes Percival employment expert Paula Bailey \nLaw firm Howes Percival has a Leicester office close to Junction 21 of the M1 at Braunstone . \nIt’s team says that in order to be ready, employers should establish a compliance timeline, carry out a data audit, determine the basis upon which data will be processed, update key policies and processes and make sure everything they do is documented. \nIt’s a lot to consider. \nPaula Bailey, an employment law expert and partner in the firm, said time was of the essence. \nShe said: \"The new data protection legislation, which comes into force in May, will provide increased rights and protections in respect of an individual's personal data. \n“The magnitude of the changes coupled with stiff penalties for non-compliance means that it's vital that employers ensure they have systems in place to make sure they are compliant.” \nRob Mayo, president of East Midlands Chamber, recently said it was one of a number of big changes this year affecting the country’s business future. \nHe said the new rules were far more prescriptive and considerably more punitive if you got something wrong than the current outdated data protections regulations. East Midlands Chamber president Rob Mayo \nMr Mayo said: “If you haven’t considered the change yet, or believe that GDPR won’t affect you, I urge you to think again and make a start on your journey to understand and implement the changes you will need to make.” \nTo help support businesses during the changeover the chamber has: Created a dedicated section on its website that is being updated regularly with key events, information and advice to help keep all businesses aware of their responsibilities and give them the confidence to take the necessary action to comply with the new legislation. Created a guidance document – available to download from the chamber website – written in collaboration with member law firm Geldards. Arranged a series of one-day training courses to provide more information, practical exercises and tools to aid businesses in meeting the challenges of GDPR. The Leicester session, which costs £175 plus VAT, and is on March 21 at Friars Mill. Details are available on the chamber website. Click on the chamber website here \nMeanwhile, a marketing-focused seminar about new GDPR and online privacy regulations will also take place at Leicester Racecourse in Oadby, later this month. \nRun by Market Harborough-based digital marketing agency the Ideal Marketing Company, the half day event takes place from 8am on Wednesday, February 28. \nAimed at digital teams, marketing managers and business owners and presented by Ideal’s head of digital marketing Jessica Shailes, the seminar will explain how business can comply with GDPR while maintaining effective marketing communications. \nJessica said: “There is a lot confusion and concern surrounding GDPR, but the laws are a positive move forward and can actually help businesses achieve better results in their marketing. \n“Because the change will affect every business, even a corner-shop café, all industries will find this seminar worthwhile.” \nIt runs from 8am to 11.30am and costs £60 plus VAT per person. ", "external_links": [], "published": "2018-02-13T02:00:00.000+02:00", "crawled": "2018-02-13T02:24:17.004+02:00", "highlightTitle": ""}