{"organizations": [], "uuid": "b45890639450f64f5c425517b5eadd8393d24f68", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14335202.ece/ALTERNATES/s1200/SGP_NEC_250218BREXIT02JPG.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/anti-brexit-bus-visits-north-14335180", "country": "GB", "domain_rank": 21960, "title": "Anti-Brexit bus visits the North East as campaigners ask if leaving the EU is ‘worth it’", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-25T18:00:00.000+02:00", "replies_count": 0, "uuid": "b45890639450f64f5c425517b5eadd8393d24f68"}, "author": "Sara Nichol", "url": "https://www.chroniclelive.co.uk/news/north-east-news/anti-brexit-bus-visits-north-14335180", "ord_in_thread": 0, "title": "Anti-Brexit bus visits the North East as campaigners ask if leaving the EU is ‘worth it’", "locations": [], "entities": {"persons": [{"name": "sadiq khan", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "tynemouth metro station", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "tyneside", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "european union", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now Get daily   Thank you for subscribing!   \nAn anti-Brexit bus visited the North East today where voters were asked whether they think leaving the European Union is worth it. \nPro-European supporters have crowd-funded the red vehicle, which is emblazoned with “Brexit to cost £2,000 million a week”. \nThe campaign vehicle, which aims to get people to think about the impacts of leaving the EU, was at Tynemouth Metro Station before it travelled to Durham. \nA crowd gathered to listen to live music played by a band and to hear speeches made by organisers. \nThe idea for the “ Brexit : Is it worth it?” bus came from The Boris Bus, which promised £350million for the NHS if the UK voted Leave Europe and did the rounds in the run-up to the 2015 referendum. Read More London Mayor Sadiq Khan issues Brexit warning to North East on Tyneside visit \nHowever, this latest campaign vehicle was the same red colour but had a very different message on its side, stating: “Brexit to cost £2,000million a week... says the Government’s own report” and posed the question “Is is worth it?”. \nPhilip Richmond, one of the campaign organisers, said: “We have been received brilliantly by the public, so far. \n“The bus itself is a bit lighthearted and is a bit of a joke mocking Boris Johnson. \n“On the more serious side, I would say, for the first time, we’re now getting an idea about what Brexit will cost because we have seen the Government’s own analysis via that leaked report. Anti Brexit bus tour at Tynemouth station, North Tyneside (Image: Newcastle Chronicle) \n“It basically says, if the Government get the kind of Brexit they are pursuing with trade deals with the EU, the United States and other countries around the world, we’re still going to be £2,000million poorer each week. \n“That figure increases to £3,200million if we don’t get that Brexit and we’re governed by World Trade Organisation rules. \n“That’s going to be felt in things like jobs, living standards, in the NHS , and we’re basically getting people to ask themselves, is it worth it? \n“Some people will still say “Yes, it is worth it” but I think many, many more people will think it’s a high price to pay. That is what the campaign is about - getting people to ask themselves, is Brexit worth it?” Read More Brexit: If there was another referendum how would you vote? Geordies have their say \nThe bus is taking part in a 33-stop nationwide tour, which started on Wednesday, February 21, at Westminster, in London. \nThe £2,000million figure is based on the UK Government’s own leaked report that Brexit with a Free Trade Agreement will cost us 5% of GDP after 15 years. Like us on Facebook", "external_links": [], "published": "2018-02-25T18:00:00.000+02:00", "crawled": "2018-02-25T18:19:53.003+02:00", "highlightTitle": ""}