{"organizations": [], "uuid": "acb794dc84f2b771c8b342990e0491bda4d5f3e6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14294272.ece/ALTERNATES/s1200/Launch-event-of-South-Tees-Development-Corporation-Master-Plan.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/more-north-east-firms-now-14294239", "country": "GB", "domain_rank": 21960, "title": "More North East firms are now exporting - and want to build up trade with the US", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-16T02:01:00.000+02:00", "replies_count": 0, "uuid": "acb794dc84f2b771c8b342990e0491bda4d5f3e6"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/more-north-east-firms-now-14294239", "ord_in_thread": 0, "title": "More North East firms are now exporting - and want to build up trade with the US", "locations": [], "entities": {"persons": [{"name": "david coppock", "sentiment": "negative"}, {"name": "simon quin", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "yorkshire", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "department for international trade", "sentiment": "negative"}, {"name": "lloyds bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "David Coppock, regional director for the North East at the Department for International Trade (Image: Evening Gazette) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nMore North East companies are now selling overseas – and they expect their export sales to rise, a new report reveals. \nA total of 41% of businesses across the region now export – up from 32% six months ago – while 20% are now preparing for a lift in overseas sales. \nThe figures are revealed in the latest Business in Britain report from Lloyds Bank, which has identified the US as offering the biggest opportunities for North East exporters. \nThe report shows a strong finish to 2017, in which 27% said their international trade had increased in the second half of the year. \nSome said they are facing new challenges, with 43% of exporters deciding to focus more on UK sales in light of Brexit , but most are optimistic about what lies ahead. \nSimon Quin, Scotland, North East and Yorkshire area director for global transaction banking, SME at Lloyds Bank Commercial Banking said: “A growing number of North East firms now do business overseas, with the majority seeing international trade playing an important role in their plans, despite the continued climate of domestic and international uncertainty. \n“Judging from North East firms’ export performances over the previous six months, this confidence is not misplaced and by using international trade as a growth strategy for their business British firms can also manage risk during periods of uncertainty.” \nThe Business in Britain report, now in its 26th year, gathers views of more than 1,500 UK companies, including 73 in the North East, and tracks a range of performance and confidence measures. North East exporters expect their total overseas sales to increase. (Image: Savannah Morning News) \nAmong North East firms 40% say the biggest barrier to exporting is exchange rate uncertainty, followed by 12% who said they have difficulty finding potential customers and 8% are battling industry specific regulations. \nBased on their current overseas trading, the current top three most popular partner countries for North East firms are France, followed jointly by Germany and the US. \nLooking ahead, the country exporters in the region expect the biggest opportunities for international trade to come from is the US (27%), followed by Germany (17 %) and France (7%). \nSimon Quin added: “While not the most popular partner at the moment, North East exporters see the trade market in the US as the promised land as they look to pre-emptively tackle the impact of a potential loss of access to the EU single market. \n“Given the familiarity of UK businesses with the products and culture of the US, and the fact they are primarily English-speaking, it is understandable that this is a key target for North East exporters. However, I would encourage exporters not to neglect other countries, as they may be more accessible than they might think and there are numerous sources of help available to manage this process. \nDavid Coppock, regional director for the North East at the Department for International Trade, said: “Across the North East, businesses are taking advantage of the huge demand for British products overseas. \n“Exporting is a journey for any business, but challenges and complexities can be overcome and results show that it’s worth doing for firms seeking resilience and growth.” Like us on Facebook", "external_links": [], "published": "2018-02-16T02:01:00.000+02:00", "crawled": "2018-02-16T04:20:30.000+02:00", "highlightTitle": ""}