{"organizations": [], "uuid": "c6e4c2ed32a2eb737ec5e8c51662f26a402d7482", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.devonlive.com/incoming/article1130108.ece/ALTERNATES/s1200/EMB-MAIN-SUNDAY-MIRROR-Martin-Lewis.jpg", "site_section": "http://www.leicestermercury.co.uk/rss.xml", "section_title": "leicestermercury - frontpage", "url": "https://www.leicestermercury.co.uk/news/uk-world-news/martin-lewis-money-saving-expert-1189966", "country": "GB", "domain_rank": 48128, "title": "Every bit of Martin Lewis Money Saving Expert advice from 2018 so far", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-11T11:30:00.000+02:00", "replies_count": 0, "uuid": "c6e4c2ed32a2eb737ec5e8c51662f26a402d7482"}, "author": "James Rodger", "url": "https://www.leicestermercury.co.uk/news/uk-world-news/martin-lewis-money-saving-expert-1189966", "ord_in_thread": 0, "title": "Every bit of Martin Lewis Money Saving Expert advice from 2018 so far", "locations": [], "entities": {"persons": [{"name": "martin lewis", "sentiment": "neutral"}], "locations": [{"name": "birmingham live", "sentiment": "none"}], "organizations": [{"name": "liverpool echo", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Every bit of Martin Lewis Money Saving Expert advice from 2018 so far With Martin Lewis around, we're all better off Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nNot all heroes wear capes. \nBut you can sure that if Money Saving Expert Martin Lewis did wear one, he'd have got a good deal on it. \nThe financial guru has built a huge reputation as the man who can help us to make money and to save it too. \nAnd he's been busy already this year issuing an abundance of amazing advice. \nSo we've now had them all rounded up in one place, thanks to Birmingham Live . \nHopefully something here will end up putting a little extra in your pocket. O2 Priority \nO2 customers can be the first to get their hands on gig tickets and a whole range of other freebies, reports the Liverpool Echo. \nIt can be annoying for customers of other networks, but thankfully Martin Lewis - aka MoneySavingExpert.com - has revealed a loophole which means YOU can take advantage of O2 Priority. \nO2 says anyone with an O2 mobile – including Pay and Go, Pay Monthly and business customers – is eligible to get it. So if you've ANY unlocked phone, it's easy. \nHere's the four steps you need to follow, according to the website. Order a free Pay As You Go Sim card from O2 and insert the Sim into your smartphone. Connect to wi-fi and download the O2 Priority app. Open the app and enter your O2 phone number (it should be on the Sim packaging). Then O2 will send you a text with your activation code, which you'll need to enter in the app. Now insert your normal Sim and (fingers crossed) the app should still work - it's meant to disappear if you insert other sims, but we've tried it on a few unlocked handsets, and the app remained usable. Direct debits \nMartin Lewis has warned people to check their direct debits. \nAppearing on TV show This Morning he said bank account holders could be wasting hundreds of pounds every single month. \nHe said: \"If you bank online simply go to the direct debits and standing orders page and check for things you no longer use or need. \n\"It can range from waste like a gym membership that you never go to (check you’re out of contract), to absurd, the cameraman on my show found he was paying council tax for an old property he’d since sold – wasting thousands.\" How to save money without leaving the house \nYou can make money from your living room the financial guru has said. \nThe financial expert, currently with his own show on ITV on Monday nights, had a very handy tip for us all. \nHe says, through doing a “personal stock take”, you can shift unwanted items and make money, on sites such as eBay . \n“Finally, now’s the perfect time to do an annual personal stock clearance, and make some extra cash for 2018,\" he advised. \n“Walk around the house and examine everything; from books, CDs, DVDs, old mobile phones and clothes. \n“If you've not used it since last January, consider flogging it. \n“Have a look on eBay to see if any of your bits are suitable for sale. \n“There are also lots of recycling sites that will pay you for old mobiles and gadgets. \n“Just make sure you do your research first to find the one that’ll give you the most.\" Cut down on waste \nThe foods that you should leave out of the fridge have been revealed by Money Saving Saving Expert Martin Lewis. \nHis guidance suggests easy changes anyone can make to cut down on avoidable food waste . (Image: Getty) \nWhen trying to keep things fresh, people automatically think to store things in the fridge, but there is a whole host of food that you should never put in there if you want them to last. \nFinancial guru Martin Lewis's website Money Saving Expert has looked at how food should be stored to make them last the longest - even if they are past their 'best before dates'. \nIt said: \"Consumers can use sensory cues to determine whether the food is suitable to eat, be that looking for visible mould on bread, tasting to see if biscuits or crisps are stale, or smelling some dairy products (with ‘best before’ dates) to see if they have soured.\" \nSo what should you be keeping out of the fridge? Potatoes keep best in cool, dry places in their original packaging and away from direct sunlight. Bananas should never go in the fridge and should be stored in a cool, dry place in their original bag. Onions keep best in cool, dry places in their original packaging and away from direct sunlight. Bread should never go in the fridge and and should be stored in a cool, dry place in the packaging, which should be resealed to keep it as fresh as possible. \nAnd what definitely needs to go in the fridge? Eggs need to stay in their box and in the fridge. Apples and oranges and most other fruit and veg keep longer in the fridge. Tomatoes also keep longer in the fridge in their original packaging. Passport \nMartin Lewis has warned travellers to renew their passports if they have less than six months validity left on them. \nHe spoke out to say people shouldn’t neglect to check whether their passport have enough expiry time on them for travelling, reports the MEN. \nHe recalled one case when parents had to return home from their planned trip because their child only had two months left on their passport. \nMost countries require that passports should have at least six months of validity when traveling internationally and will not permit a traveller to enter the country unless their passport is set to expire at least six months after the final day of travel. \nMartin said: “Check the expiry date and if it’s less than six months you need to go about renewing it.” \nThe new navy passports introduced after Brexit will be phased in slowly, but current British passport holders will able to continue using their burgundy passports until they expire. \nMartin also urged people to check the expiry on their European Health Insurance Card, which gives travellers the right to access state-provided healthcare during a temporary stay in another European Economic Area country or Switzerland. \nThe EHIC covers treatment that is medically necessary and covers the treatment of pre-existing medical conditions and routine maternity care. \nTravellers can apply for or renew an EHIC online free of charge at ehic.org.uk Be fuel efficient \nThere are ways to save fuel and money if you buy in the right place, in the right way - and drive more efficiently. \nEven if you need to do the same mileage, you can slash your costs significantly with his tricks to improve your car's fuel efficiency. \nThere's lots you can do - for the details click here , as it's a lot of information to include in this round-up! The best firms to haggle with \nMartin Lewis has identified the best firms to barter with when you’re at the end of your household contracts. \nWhether it’s your digital TV service, mobile phone or breakdown cover, there are bargains to be had for anyone brave enough to put aside their British reserve and indulge in financial flirtation. \nBased on a survey of people who tried to haggle, Martin said the AA was top-of-the-pile, with a 90 per cent success rate. \nFrom tenth to sixth were Virgin Media, AA Insurance, Vodafone, Plusnet, and Three – all with 70 to 80 per cent success rates. \nEE was fifth, with a success rate of 80 per cent, Admiral fourth (82 per cent), Sky third (86 per cent) and the RAC second (87 per cent). How and when do you haggle? \nThis is what he told BBC Radio 5 Live’s Emma Barnett on his weekly financial slot. \n“This is the real powerhouse place you haggle these days – when you’re coming to the end of your contract. \n“Whether it’s your broadband, your digital TV, your mobile phone, your breakdown cover, you are holstering a huge weapon of loyalty. \n“They are mature businesses desperate to keep you. \n“They don’t want you to go elsewhere because everyone’s got their products so all they have got is to try to retain business. \n“That means you are in a haggling world. \n“The best time to haggle is when you are just approaching the end of your contract because you are free to leave without penalties. \n“You do it with politeness and charm, never anger or aggression. \n“Think of it as a form of financial flirtation. \n“Your job is to win them on-side, to get them to help you, to get them to enjoy what’s going on, working together to get you the best price.” The rules \nBenchmark your prices - find out what is available from other providers. \nMartin said: “Your business is taken for granted as an existing customer, it’s new customers whose business is fought for.” \nBe honest about what you want to pay \n“Get on the phone, tell them you are at the end of your contract and paying too much. \n“If it’s TV, start with a channel audit – are you watching everything you’ve got, do you need to be paying for it? \n“Tell them what price you want to pay and if it doesn’t work, say: ‘That’s too much, I’m going to have to leave’. \n“That gets you put through to what’s publicly known as disconnections but is often known internally as customer retentions. They have the real power to negotiate.” \nDon’t be afraid to walk away - and NEVER auto-renew \n“Many people are telling me that, if they do leave, especially the big digital TV firms, a week later they get a letter with a new, far cheaper, offer. \n“But, if you can get it cheaper elsewhere and the company you’re with isn’t willing to play ball, you should leave. \n“Business models are predicated on drawing customers in with a cheap price for a year and then hoiking the price up afterwards in the hope that many customers, either through apathy or ignorance, will stick with them for the long term. \n“They hope you won’t haggle because many people don’t. \n“They just auto-renew, which is the great money-saving sin.” How changing banks could get you £1k \nMoneySavingExpert Martin Lewis has also called on bank customers to re-evaluate their accounts. \nThe money-saving guru - with a show now on ITV - has recommended they ditch some popular high street banks. \nThe calls come in a bid to tell customers they can make more cash elsewhere. \nPeople who regularly switch their bank accounts can get free money just by changing their account. \nAnd, promisingly, some are getting up to £1000. The best bank accounts to switch to \n* Firstdirect.com gives £100 to switchers (or £125 via my mse.me/topbanks). There’s also a linked 5% regular savings account for up to £300/mth and you may get a £250 0% overdraft, reports the Liverpool Echo. \n* Switch to hsbc.co.uk’s Advance account and you get £150 within 50 days and another £50 if you’re with it after a year. Plus there’s a linked 5% regular savings account you can put up to £250/month in. \n* Natwest.com pays a £125 switch bonus on many of its current accounts. The standout though is its Reward account which, for a £2/month fee, gets you 2% bills cashback on direct debits for council tax, energy, broadband etc. \n* New switchers to bank.marksandspencer.com get a £125 M&S gift card and a 5% regular savings account they can put up to £250/mth in. Unlike other banks you get this even if you don’t pay anything in, though put £1,000+/month (equivalent to paying in a £13,000+ salary) and you also get £5/month added to the gift card for the first year. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now HOW TO SWITCH YOUR BANK ACCOUNT \nThe switching service is largely automated. \nWhen you apply to the new bank, it will undertake its normal account-opening procedures. \nIt will confirm that it will use the new current account switching service backed by the Current Account Switch Guarantee. \nYou'll be asked to provide two separate documents for proof of identity and proof of address. \nOnce your new account has been opened, you will need to complete a 'Current Account Switch Agreement' form and a 'Current Account Switch Service – Account Closure' form. \nThis is what happens next: \nStep 1 \nYou will be able to choose and agree a convenient switch date for you with the new bank or building society. \nIt can't be a Saturday, Sunday or bank holiday, and must be at least seven working days after your account has been opened. \nStep 2 \nOnce this has been agreed, your new bank will provide confirmation that the switch has begun and will be completed on the agreed switch date. \nStep 3 \nYou will continue using your old current account up until the agreed switching date. Your new bank will contact you if there any issues during this period. \nStep 4 \nOn the switch date, your new bank will be responsible for moving your incoming and outgoing payments, and transferring any money to your new account, before closing the old account and sending confirmation that the process is complete. \nIf you run into any problems during or after the switching process, you should complain in the first instance directly to your new bank. \nIf you're not happy with the answer you get or it doesn't reply to you within eight weeks, you can take your complaint to the Financial Ombudsman Service (FOS) . Supermarket reductions \nA top tip was that many staff have the authority to reduce prices at their discretion - particularly goods that are damaged/nearing their sell-by dates. \nIf you're friendly, staff are more likely to help than when you're rude. \nReduction times vary not just by supermarket but by store (and it's particularly dependent on opening times). \nAs a rough guide, the first yellow stickers tend to appear mid-morning, and silly-price reductions begin early evening, when stores cut prices by 75% and more, reveals Martin Lewis. \nHere's when MoneySavers revealed to moneysavingexpert website the best times to bag these bargains. \nFinal reductions often start around 7pm – and most bargains have been snapped up by 9pm. Co-op \nDiscounts at Co-op very much varies by store. One former staff member told Martin Lewis items which expire that day tend to have a 50% discount and reductions increase around 5pm, though another MoneySaver said you have to wait until 8pm for 75% discounts. M&S Food \nM&S shoppers have revealed how they've seen final reductions at 6.30pm in stores which close at 7pm, and at 8pm in stores closing at 9pm. One person revealed that M&S often marks down items reaching their sell-by date \"just after lunch\". ", "external_links": [], "published": "2018-02-11T11:30:00.000+02:00", "crawled": "2018-02-11T11:56:39.013+02:00", "highlightTitle": ""}