{"organizations": [], "uuid": "fd311c81deb4f76460fedaca997b7e1ea56aa1ca", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13588380.ece/ALTERNATES/s1200/Brexit.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/city-leaders-meet-eu-brexit-14311068", "country": "GB", "domain_rank": 21960, "title": "City leaders meet EU Brexit chief Michel Barnier - but wait for talks with the UK Govermment", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-19T20:42:00.000+02:00", "replies_count": 0, "uuid": "fd311c81deb4f76460fedaca997b7e1ea56aa1ca"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/city-leaders-meet-eu-brexit-14311068", "ord_in_thread": 0, "title": "City leaders meet EU Brexit chief Michel Barnier - but wait for talks with the UK Govermment", "locations": [], "entities": {"persons": [{"name": "nick forbes", "sentiment": "negative"}, {"name": "michel barnier", "sentiment": "negative"}, {"name": "david davis", "sentiment": "negative"}, {"name": "barnier", "sentiment": "none"}, {"name": "coun forbes", "sentiment": "none"}, {"name": "guy verhofstadt", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "eu brexit", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "newcastle city", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "core cities", "sentiment": "none"}, {"name": "european parliament", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Brexit secretary David Davis (Image: PA) Share Get daily   Thank you for subscribing!   \nNewcastle City leader Nick Forbes urged the Government to consult big cities about plans to leave the European Union , as he met EU chief negotiator Michel Barnier in Brussels. \nHe said the “core cities” including Newcastle wrote to Brexit Secretary David Davis six months ago, inviting him to meet them at any time. \nBut they have heard nothing back. By contrast, Mr Barnier invited city leaders to talk to him in the EU’s Brussels headquarters. \nCoun Forbes said: “I very much hope that the UK government will begin to engage seriously with us, so that we can shape a future for our cities.” Read More Home Secretary faces demands for inquiry into 800 unpublished Ogreave police files \nHe was part of a delegation of 10 council leaders and city mayors who Mr Barnier and other key figures including Guy Verhofstadt, the European Parliament’s Brexit co-ordinator, on Monday. \nThe meeting was organised by the Core Cities group, which represents 10 of the biggest cities outside London. \nMr Barnier has been representing the EU in talks with the UK as the country prepares to leave the European Union in March 2019. \nMr Forbes, a Labour politician, said big city leaders were worried that the Government was focusing on the interests of the financial services sector in London but neglecting the needs of other industries such as manufacturing in the North East. \nHe said: “We have been making the case for the interests of cities to be better represented in the Brexit negotiations. One of the things we are concerned about is that the current government seems obsessed with a Brexit that will deliver for the city of London, and our industries in the North East are potentially vulnerable if the Government doesn’t take our interests into account. \n“The North East is a region that makes stuff and exports it. 62% of what we make is exported to the EU. \n“So any deal that outs up barriers to trade will be bad for North East businesses and potentially have a devastating impact on jobs.” \nMr Davis met regional mayors representing Tees Valley, Greater Manchester and the Liverpool City Region last year, but local authority leaders in areas without mayors were not included. Read More Why it's getting harder for young people in the North East to become home owners \nMr Forbes said: “We have issued an open invitation to meet with David Davis. \n“And I very much hope he will engage with us in the next few months, to get the cities agenda further up the list of priorities.” \nAt the meeting with Mr Verhofstadt it was agreed that the Core Cities leaders would return to Brussels to address members of the European Parliament before the summer. \nCouncil leaders and mayors from Bristol, Cardiff, Birmingham, Nottingham, Manchester and Leeds were included in the talks alongside Mr Forbes. \nA spokesperson for the Department for Exiting the European Union, which Mr Davis leads, said: “The Secretary of State meets a wide range of stakeholders from both the UK and Europe on a regular basis, including from local and regional Government. \n“We are seeking an unprecedented, comprehensive and ambitious economic partnership - one that works for all parts of the UK.” Like us on Facebook", "external_links": [], "published": "2018-02-19T20:42:00.000+02:00", "crawled": "2018-02-19T21:54:39.005+02:00", "highlightTitle": ""}