{"organizations": [], "uuid": "0db1419f0f66af3930df03bdb2e2bba17740c581", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14244545.ece/ALTERNATES/s1200/Lord-Adonis-Durham-City-Station.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/labours-lord-adonis-confident-jeremy-14244497", "country": "GB", "domain_rank": 21960, "title": "Labour's Lord Adonis 'confident' Jeremy Corbyn will eventually support second EU referendum", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-05T10:00:00.000+02:00", "replies_count": 0, "uuid": "0db1419f0f66af3930df03bdb2e2bba17740c581"}, "author": "Sean Seddon", "url": "https://www.chroniclelive.co.uk/news/north-east-news/labours-lord-adonis-confident-jeremy-14244497", "ord_in_thread": 0, "title": "Labour's Lord Adonis 'confident' Jeremy Corbyn will eventually support second EU referendum", "locations": [], "entities": {"persons": [{"name": "jeremy corbyn", "sentiment": "positive"}, {"name": "adonis", "sentiment": "positive"}, {"name": "spe", "sentiment": "positive"}, {"name": "brexit", "sentiment": "none"}, {"name": "andrew adonis", "sentiment": "none"}, {"name": "tony blair", "sentiment": "none"}, {"name": "gordon brown", "sentiment": "none"}], "locations": [{"name": "durham city railway sta", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}], "organizations": [{"name": "news labour", "sentiment": "positive"}, {"name": "labour", "sentiment": "positive"}, {"name": "invalid email  a labour", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Labour's Lord Adonis 'confident' Jeremy Corbyn will eventually support second EU referendum Speaking on a visit to Durham to discuss the East Coast Main Line row, he said: 'My view is that the best thing to do is to stop Brexit' Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nA Labour big-hitter has called on his party to “stop Brexit” in order to protect jobs and public services - and thinks Jeremy Corbyn is listening. \nLord Andrew Adonis, who served as a minister under Tony Blair and Gordon Brown, has positioned himself as a key figure in the pro-EU movement. \nHe reaffirmed his support for a second referendum and hopes the initial result could be reversed on a visit to Durham . \nLabour leader Jeremy Corbyn has consistently rejected holding another vote on the issue despite pressure from some in his party but Lord Adonis said he believes that could change before March 2019. Lord Andrew Adonis visits Durham City Railway Station to talk about the East Coast bailout (Image: Newcastle Chronicle) \nThe Labour peer recently resigned his role as government infrastructure tsar over their Brexit stance and accusing them of “bailing out” Stagecoach and Virgin by releasing them from the East Coast franchise early. \nHe said: “There’s a huge problem at the moment, almost all civil servants in Whitehall are having to deal with the consequences of Brexit. \n“Things like the East Coast Main Line bailout have happened as a result because there hasn’t been enough fire power in Whitehall to deal with urgent problems facing the country. \n“It’s not just the rail network - it’s also problems facing the NHS, the education system, employment rights. Lord Adonis with Sedgefield MP Phil Wilson (left) (Image: Newcastle Chronicle) \n“All of these issues have been falling by the wayside I hope we can put that right. \n“My view is that the best thing to do is to stop Brexit. Read More Lord Adonis on East Coast Main Line: 'Government is bailing out millionaires' \n“I think when the country sees the terms of what Theresa May negotiates in Brussels and how bad it’s going to be - as we leave the single market, customs union and millions of jobs are in jeopardy - I think people will demand a final say on the Brexit deal.” \nNorth East exporting companies like Nissan facing “emasculated markets” also stand to lose out, he added. \nHe called for a referendum on the eventual departure deal, with retaining EU membership as an option, before the UK formally leaves in March 2019. Labour leader Jeremy Corbyn (Image: PA) \nWith attention focused on simmering tensions in the Conservative party over the shape of the new relationship with the EU, the Labour party is quietly drifting towards its own rupture on the issue. \nCalls for a second referendum, a policy supported by the Liberal Democrats, have been increasing in their volume and regularity from Labour figures. \nPressed on whether the leader of his party could support the policy, Lord Adonis said he thought Jeremy Corbyn would come round to his way of thinking. \nMr Corbyn, whose perceived failings in the referendum campaign and long-held Euroscepticism were major factors behind an attempt to dislodge him as leader, has repeatedly said the Leave vote must be respected. \nIn recent weeks he has also reaffirmed his position that a second referendum on EU membership won’t offered by a Labour government or supported by the party. Read More Leaked document suggests the North East will be badly hit by Brexit \nLord Adonis said: “I hope he will oppose Brexit because the party is overwhelmingly committed to staying in the EU. \n“I’m confident that Jeremy will stand with members and people in the country as a whole in opposing this Brexit plan.” Like us on Facebook", "external_links": [], "published": "2018-02-05T10:00:00.000+02:00", "crawled": "2018-02-05T11:19:39.079+02:00", "highlightTitle": ""}