{"organizations": [], "uuid": "0c62b0f6b106dc95cf24e9f55afe3dbc578a7b22", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14260262.ece/ALTERNATES/s1200/Pupils-to-face-rape-lessons-at-11.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/calls-sex-ed-compulsory-schools-14259947", "country": "GB", "domain_rank": 21960, "title": "Calls for sex ed to be compulsory in schools as HALF of kids are not told how to deal with abuse", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-07T19:11:00.000+02:00", "replies_count": 0, "uuid": "0c62b0f6b106dc95cf24e9f55afe3dbc578a7b22"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/calls-sex-ed-compulsory-schools-14259947", "ord_in_thread": 0, "title": "Calls for sex ed to be compulsory in schools as HALF of kids are not told how to deal with abuse", "locations": [], "entities": {"persons": [{"name": "sou", "sentiment": "negative"}, {"name": "lewell-buck", "sentiment": "none"}, {"name": "emma lewell-buck", "sentiment": "none"}], "locations": [], "organizations": [{"name": "house of commons", "sentiment": "none"}, {"name": "pshe", "sentiment": "none"}, {"name": "department for education", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Calls for sex ed to be compulsory in schools as HALF of kids are not told how to deal with abuse South Shields MP Emma Lewell-Buck supports calls to make personal, social, health and economic education compulsory Share A pupil in a school (Image: PA) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nCampaigners calling for every child to be taught about sex and relationships in school say it would help protect them from paedophiles and exploitative relationships. \nSouth Shields MP Emma Lewell-Buck is among those calling for personal, social, health and economic education (PSHE) to become a compulsory subject. \nThe Department for Education currently encourages schools to teach PSHE and is considering whether to make it a statutory subject, so that schools have to teach it. \nMs Lewell-Buck told a House of Commons debate children needed to be taught what to do if they were abused, while teenagers should be taught how to recognise sexual exploitation and grooming. South Shields MP Emma Lewell-Buck \nShe said: “Time and again I have heard the argument made that it should be up to parents to take responsibility for teaching their children issues covered in sex and relationship education and PSHE, but the fact is that not all parents and carers feel able to.” \nAll maintained schools are already required to teach some sex education to all pupils of primary and secondary age, but the compulsory element is limited to the biological aspects of puberty and reproduction. \nThe Children and Social Work Act 2017 gave the Education Secretary the power to require every school to teach personal, social, health and economic education, but so far this has not been used. Schools minister Nick Gibb (Image: PA) \nMs Lewell-Buck said she had dealt with children who were victims of abuse in her former role as a child protection social worker. \nShe said: “The details are etched on my brain - I wish they were not - of every single child I ever worked with who suffered sexual abuse. Read More Employers say the North East needs expanded Heathrow Airport to thrive after Brexit \n“I remember working with children who had been abused and teaching them about their personal areas - the areas that no-one has a right to touch. \n“I taught them what to do if someone did - if it happened at home or at school, if the perpetrator was an adult or if they were harmed by another child. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \n“Not a single child I worked with had ever been taught that in school or by their parents. Many of the dedicated teachers I met along the way asked me for my materials so that they could replicate that learning in their classrooms.” \nSome children are not currently being taught how to protect themselves, Ms Lewell-Buck said, and a recent survey found 50% of young people were not taught at primary school how to get help if they experienced unwanted touching or sexual abuse. poll loading Do you think sex education should be compulsory in schools? 0+ VOTES SO FAR Yes Yes \n“Even if introducing PSHE with sex and relationship education stops that from happening to just one child, it will be totally worth it,” the Labour MP added. Read More Free school meals plan means children will go without if their parents work extra hours, MPs warn \nSchools Minister Nick Gibb said the Government was gathering views “from as wide a range of bodies as possible” about the best way to teach PSHE and there would be a public consultation next year. \nHe added: “PSHE can encompass many areas of study, and in considering whether it should be made compulsory, it is important to balance the need for schools to have freedom and flexibility to tailor their local PSHE programme to reflect the needs of their pupils.” Like us on Facebook", "external_links": [], "published": "2018-02-07T19:11:00.000+02:00", "crawled": "2018-02-07T20:00:17.000+02:00", "highlightTitle": ""}