{"organizations": [], "uuid": "62f91ece0244a5a507de35b79faf00f23781158f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.derbytelegraph.co.uk/incoming/article1234377.ece/ALTERNATES/s1200/Theresa-May-New.jpg", "site_section": "http://www.leicestermercury.co.uk/rss.xml", "section_title": "leicestermercury - frontpage", "url": "https://www.leicestermercury.co.uk/news/uk-world-news/how-to-get-free-degree-1237611", "country": "GB", "domain_rank": 48128, "title": "You can get a degree for FREE and here's how", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-20T13:28:00.000+02:00", "replies_count": 0, "uuid": "62f91ece0244a5a507de35b79faf00f23781158f"}, "author": "leicestermercury", "url": "https://www.leicestermercury.co.uk/news/uk-world-news/how-to-get-free-degree-1237611", "ord_in_thread": 0, "title": "You can get a degree for FREE and here's how", "locations": [], "entities": {"persons": [{"name": "ruth sparkles", "sentiment": "none"}, {"name": "teresa may", "sentiment": "none"}], "locations": [{"name": "england", "sentiment": "none"}, {"name": "east midlands", "sentiment": "none"}], "organizations": [{"name": "money charity", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "You can get a degree for FREE and here's how Who says university means crippling debt? Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nPrime Minister Teresa May chose the East Midlands to herald a review into higher education in England - thought by many to offer poor value for money. \nThe majority of undergraduates leave university under a cloud of debt thanks to £9,250 annual tuition fees. \nThis need not be the case according to Ruth Sparkles, editor of teen careers and lifestyle magazine Future Mag, there are ways to get a degree on the cheap. \nShe said: “New graduates in England face average debt levels of more than a third of the average mortgage, according to research from The Money Charity. \n“One cheaper alternative is to do your degree at a further education college, these generally cost around £6,000 a year.” Read More \nHowever, she also says that youngsters can get a degree without paying a penny for tuition and here's how: 1. Find a company who will pay for your degree \nNot as far-fetched as it might seem – such degrees are sometimes called sponsored degrees. A new degree developed by The University of Chichester and Peter Symonds College in Winchester has produced a BA (Hons) in Insurance. The academics worked with Be Wiser Insurance to create the UK’s first degree in Insurance. \nSchemes vary, but this particular programme offers undergraduates a salary of around £20,000 a year and covers tuition fees. Students are offered a management level job on graduation. \nThe armed forces and large companies such as Rolls-Royce and Mars also sponsor students on degree courses to ensure they have the skills they need. The University of Leicester (Image: Will Johston) 2. Higher and degree apprenticeships \nThese are quite new and similar to sponsored degrees. Many universities are working in collaboration with businesses to offer such apprenticeships – covering all sorts of roles and industries. Early adopters include Airbus, Morrisons and Barclays. Read More De Montfort University student claims peers used shocking racial slur against her 3. A full-fee scholarship \nSuch scholarships do exist, but they’re a bit like an albino tiger…exceptionally rare. A couple of examples include those offered by Newcastle University and London’s Goldsmiths university. In previous years, Goldsmiths had ten full tuition fee waivers - worth £27,000 each for Lewisham's brightest talent, covering fees for three years. The Scholarship Hub is a free online database of over 3,000 scholarships and bursaries you could have a look at. 4. Crowdfunding \nCrowdfunding means you are relying on the generosity of others, be they family, friends or absolute strangers to pay your fees. This radical route seems to be most successful if you have a fabulous back-story, ask for smaller sums of money and offer something tangible in return. One crowd funding student’s campaign, dubbed Send Brian to Oxford has already raided over £17,000! Read More Students crushed during 'serious incident' before Loughborough University social night 5. Study abroad \nBrexit might mean this option is not available for the full three years, but currently there are opportunities to study free (or at very low cost) in Germany, France, Norway, Sweden, Finland, Denmark, Austria, Greece and more – visit topuniversities.com for more information. Like us on Facebook ", "external_links": [], "published": "2018-02-20T13:28:00.000+02:00", "crawled": "2018-02-20T14:41:46.063+02:00", "highlightTitle": ""}