{"organizations": [], "uuid": "353da1269ddbe4b2d24b759578bd283d3b8ef823", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.nottinghampost.com/whats-on/food-drink/article690205.ece/ALTERNATES/s1200/JO2JPG.jpg", "site_section": "", "section_title": "", "url": "https://www.leicestermercury.co.uk/whats-on/food-drink/jamie-oliver-close-12-restaurants-1201472", "country": "GB", "domain_rank": 48128, "title": "Jamie Oliver to close 12 restaurants and axe 450 staff due to huge debts - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.93, "site_type": "news", "published": "2018-02-12T14:46:00.000+02:00", "replies_count": 0, "uuid": "353da1269ddbe4b2d24b759578bd283d3b8ef823"}, "author": "Joshua Barrie", "url": "https://www.leicestermercury.co.uk/whats-on/food-drink/jamie-oliver-close-12-restaurants-1201472", "ord_in_thread": 0, "title": "Jamie Oliver to close 12 restaurants and axe 450 staff due to huge debts - Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "leicester mercury jamie oliver", "sentiment": "negative"}, {"name": "jamie oliver", "sentiment": "negative"}, {"name": "barwell", "sentiment": "none"}], "locations": [{"name": "nottingham", "sentiment": "none"}, {"name": "bristol", "sentiment": "none"}, {"name": "low pavement", "sentiment": "none"}, {"name": "harrogate", "sentiment": "none"}], "organizations": [{"name": "sun", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jamie Oliver to close 12 restaurants and axe 450 staff due to huge debts Staff are owed £2.2m by the celebrity chef's company Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nCelebrity chef Jamie Oliver is having to close 12 of his 37 restaurants due to massive debts. \nIt is said that 450 members of staff are to lose their jobs as the restaurant empire announces debts of £71.5m. \nEarlier this month, the company announced closures in cities such as Bristol, Reading, and Harrogate. \nHowever, it is believed that the restaurant in Low Pavement, Nottingham, will not be axed. Read More Barwell fish and chip shop selling the perfect Valentine's Day treat \nHigh Court documents newly obtained by the Sun on Sunday show the company owes staff £2.2m, writes the Mirror Online. \nThey also reveal that the chain owes £30.2m in overdrafts and loans and £41.3m to the likes of HMRC, landlords, and suppliers. \nJamie Oliver, whose food empire stretches across media content, cookbooks, separate restaurant brands and charitable foundations, allegedly begged landlords to cut rents in a bid to stop the collapse after losing £10m in 2017. \nThe celebrity chef's chain, which opened its first site in Oxford in 2008, will have 25 restaurants left in the UK, and 28 overseas. \nThe company's restructuring plan was backed by 95 per cent of creditors. \nThe Company Voluntary Arrangement, an insolvency process, is set to secure rent reductions in the remainder of Jamie's Italian sites. \nJamie Oliver and his wife Jools are reportedly worth around £150m. \nThe star's personal assets are not thought to be at risk if the company goes into liquidation. \nLast year, Jamie Oliver blamed Brexit on the closure of six of his Jamie's Italian branches. \nHe blamed poor trading conditions, rising food and staffing costs, and a weakening pound. Read More Simple recipe for American style pancakes for something a bit different on Shrove Tuesday \nThe company told Mirror Online: \"We are pleased to have received the overwhelming support from our creditors for our proposal to reshape Jamie’s Italian restaurants. The CVA approval ensures Jamie’s Italian’s great staff and suppliers can all get paid and has saved 1,800 jobs. \n\"We have a strong brand and are focused on continuing to deliver the levels of service, taste and the experience our loyal customers deserve. \n\"We are working hard to ensure that our estate is fit for the current trading environment and we feel confident that this newly shaped business will provide strong opportunities for growth and profitability.\" \nThe Jamie's Italian restaurants facing closure are Bath, Bristol, Bluewater, Chelmsford, Greenwich, Harrogate, St Albands, Kingston, Reading, Kingston, Milton Keynes, London's Threadneedle St site, and the Piccadilly Diner, also in London. \nHis two Barbecoas barbecue restaurants are also on the market, according to MCA Insight's Monday trade bulletin. \nJamie's Italian is one of many restaurant groups to suffer a difficult mid-market. \nChains such as Byron and Prezzo are also facing closures and losses. \nJames Wallin, from MCA Insight, which first broke the news, told Mirror Online: \"The troubles facing Jamie’s Italian are by no means specific to this group, but symptomatic of a wider trend across the casual dining sector. \n\"The past decade has seen an explosion in chain restaurants opening across the UK, buoyed by cheap lending and seemingly insatiable appetite for eating out. \n\"We went way past the tipping point where supply outstripped demand and brands are now facing pressures on all fronts – their revenues have been hit by customers tightening their belts and their profits by multiple rising costs. \n\"I don’t expect Jamie’s Italian to be disappearing from our high streets anytime soon (although his Barbecoa steakhouse concept does appear to be on the way out) but, like other branded restaurants, it needs to adapt to a very different trading environment.\" \nRestaurant consultant Hugh Richard Wright said he thinks medium-sized chains are struggling due to reduced customer spend, and higher business costs. \nHe added that the availability of great food, often for less, is having an impact; the market is arguably saturated. Read More UK's favourite topping revealed for National Pizza Day \nHugh added: \"In the case of Jamie’s Italian and similar groups of this size such as Strada and Byron, I think it’s also attributable to consumers abandoning the ‘middle market’ having realised they can get better quality food from (say) their local Italian or burger joint at the same price or less. \n\"This I think is a problem afflicting a lot of mid-market chains: the food isn’t (usually) terrible, but nor is it good enough to justify the prices charged. \n\"Discerning consumers would rather pay more for better, or if they just want convenience and cheapness. It’s why so many chefs will tell you that the Big Mac is the best burger; it might not be as good quality meat or bread as say one of the ‘better burger’ chains, but it is satisfying, filling, consistent – and £2.99.\" \nMirror Online has contacted Jamie Oliver for further comment. Like us on Facebook ", "external_links": [], "published": "2018-02-12T14:46:00.000+02:00", "crawled": "2018-02-13T04:59:13.016+02:00", "highlightTitle": ""}