{"organizations": [], "uuid": "523a77a369d1ccd8ba5f4bb4faec18f6d5195cbc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article11086866.ece/ALTERNATES/s1200/JS49205137.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14246824", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Newcastle app developer Gospelware is forced to close", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-06T10:10:00.000+02:00", "replies_count": 0, "uuid": "523a77a369d1ccd8ba5f4bb4faec18f6d5195cbc"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14246824", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Newcastle app developer Gospelware is forced to close", "locations": [], "entities": {"persons": [{"name": "gospelware", "sentiment": "negative"}, {"name": "michael dunn", "sentiment": "none"}], "locations": [], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "newcastle journal", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford Former Flynn's bar to reopen as new operator is revealed \nRemember Flynn’s bar on Newcastle Quayside back in the 1990s? Famed for its cheap trebles and cocktails I expect many of you had decent nights out with a pit stop there - but it’s been closed for many years, and has yet to benefit from the resurgence of activity along the Quayside. \nThat’s all set to change, however, now that an operator has emerged for the building, which is set to have a bit of a refit. \nAnd after almost two years of waiting to find out how that operator will be, I can reveal that Pub Culture, a relatively new leisure company headquartered in Sunderland, is going to create a jazz bar within the building. The former Flynns Bar on Newcastle Quayside (Image: Newcastle Chronicle) 9.05 Coreena Ford Connection Retail \nAn award-winning North East-based flooring retailer is to create dozens of new jobs after investing more than £1m in opening nine new ‘bricks and mortar’ stores across the UK. \nConnection Retail has already opened two stores in January at Newport and Swindon, with a third to follow in Edinburgh this Saturday. \nFurther stores in Keighley, Birmingham, Croydon, Crewe, York and Leeds are also scheduled to open before the end of May. \nThe new sites will mean that the firm – which is based in Shildon, County Durham, and opened its first shop at Birtley, Gateshead last year – will more than double its physical store presence. \nThe company, which recorded turnover of £18.7m in its most recent accounts, is aiming for revenues of £24m this year and £35m in 2019. \nThe new stores opening this year will all sell products from the company’s three brands, Flooring Superstore, Direct Wood Flooring and Grass Direct. \nManaging director Dan Foskett said: “This year represents a significant expansion of our retail flooring business as we open new stores across England, Wales and Scotland. \n“This bricks and mortar expansion strategy complements the significant online presence we have built up since starting trading in 2012. \n“We are growing at a fantastic rate, whilst at the same time being able to maintain online pricing in our high street stores. \n“And, just as importantly, it means we are investing in towns and cities across the UK, creating dozens of new job opportunities for local people.” The Flooring Superstore (Image: Copyright unknown) 8.55 Coreena Ford UK markets continue global sell-off \nLondon’s top-flight index has joined global markets by crashing into the red over fears that rising inflation could force central banks to hike interest rates. The FTSE 100 Index sank by more than 2.5% but has pared losses to fall 163.57 points to 7,167.08. \nAcross Europe, Germany’s Dax plummeted by 2.7% and the Cac 40 in France was languishing 2.1% lower. \nFalls in Europe followed a brutal overnight sell-off in Asia and on Wall Street, where the Dow Jones Industrial Average and the S&P 500 dropped 4.6% and 4.1% respectively. \nTokyo’s Nikkei 225 Day closed down 4.7%, while the Hong Kong’s Hang Seng Index plunged 5% lower. \nThe global equity sell-off has been building since last Friday when traders became spooked by the prospect of tighter monetary policy after the US posted strong average earnings data. The crash follows deep losses during yesterday’s session when more than £27bn was wiped off the value of London’s blue-chip stocks. Traders and financial professionals work on the floor of the New York Stock Exchange 8.52 Coreena Ford Retailers see growth despite typically tough January \nBritish retailers continued to battle “tough” conditions in January, but experts pointed to higher sales during a typically difficult month for trading. \nFigures from the British Retail Consortium (BRC) and KPMG showed like-for-like retail sales rose 0.6% in January, compared with a fall of 0.6% for the same month in 2017. \nTotal sales rose 1.4% last month, following a rise of just 0.1% a year ago. \nIt was dubbed a decent performance by experts, as the post-Christmas period tends to put a strain on sales. \nHelen Dickinson, BRC chief executive, said: “The persisting tough trading environment played out at the start of the year with a mixed set of trading updates and subsequent announcements. “Sales as well as profits are seemingly harder to come by. \n“Against this challenging backdrop, 2018 didn’t have a bad start during what is traditionally a lean month, with sales creeping up in line with the year’s average.” She said that the sector continued to struggle from “divided fortunes” for food and non-food sales. \nBritish households are still in the midst of an income squeeze on the back of higher inflation and weaker wage growth, that has left consumers with less cash for non-essentials. Food sales increased increase 2.9% on a like-for-like basis in the three months to January, while total sales rose 4.1% over the period. \nIn contrast, like-for-like non-food retail sales fell 1.2% and dropped 0.6% on a total basis, which is below the 12-month average decrease of 0.1% and marks the first 12-month average drop since September 2009. Non-food sales fared better online, rising 5.3%. The retail sector had a typically tough January (Image: Daily Mirror) 8.43 FTSE and European markets latest \nThe FTSE-100 index at 8.15am was down 184.74 at 7150.24. \nFalls were also widespread across European markets, with the Dax in Germany down 2.6% and France’s Cac 40 off 3%. \nConnor Campbell, financial analyst at Spreadex, said: “The only hope for the markets at the moment is that investors suddenly decide that the sell-off has been a bit overdone - though in a way it is fitting, matching the astonishing, record-breaking recent rise of the global indices with an equally astounding, heart-stopping drop. “Admittedly the Bank of England could go some way to allaying investors’ fears of rising interest rates on Thursday, if Mark Carney issues a more dovish statement than forecast.” 8.37 Coreena Ford Financial watchdog boss calls for Brexit 'assurance' \nThe boss of Britain’s financial watchdog has urged the Government to hand firms, markets and regulators “much-needed assurance” over the Brexit transition period. \nAndrew Bailey, chief executive of the Financial Conduct Authority (FCA), has called on UK and EU regulators to send companies a clear signal of their commitment to the process by drawing up a memorandum of understanding (MoU) to underpin a “stable and orderly” change. \nThe UK and the European Union have already agreed to honour a two-year transition period to give businesses and organisations the chance to avoid disruption and prepare for a new status quo. \nHowever, the two parties remain divided over what the “implementation phase” should look like, with Britain wanting to maintain full-membership rights and the EU wanting to strip the UK of its decision-making powers. S \npeaking during the Future of the City dinner last night, Mr Bailey said he could not “stress too much that we need these arrangements in place”. \nHe said: \nThe best solutions are mutually agreed and enacted so that they are consistent. \nAnd to achieve this, we need by the end of March a joint commitment by the political authorities to a well-defined implementation or transition period which will create the space and support for the regulators to work with firms and political authorities to put practical solutions into place. “It can be done, and I think there is a growing consensus on both sides that it must be done. I sense this view increasingly taking hold from my discussions around Europe. \nBut it needs support in the form of a timely commitment to a transition agreement which will allow the regulators to get on and tackle these issues. \nA joint agreement to get on with this is in the interest of everyone involved. And it will give much-needed assurance to firms and markets as well as regulators. Andrew Bailey, head of the FCA 8.30 KEY EVENT Gateshead's Old Town Hall to be transformed into major visitor attraction \nGateshead’s historic Old Town Hall could soon be turned into a major visitor attraction after an agreement was reached with developers from the North East. \nA call out was made last March for a developer to regenerate the Old Town Hall Quarter, when the Grade II-listed town hall was put up for sale, together with a patch of land surrounding the former heart of the town. \nNow it has emerged that the Old Town Hall Quarter is on the verge of being sold to Dinosauria Ltd – an entertainment business which has had plans to create a top attraction in the North East for several years. \nGateshead Council agreed at its last cabinet meeting on January 23 to lease the site to Dinosauria Ltd on a 250-year lease as part of its strategy to sell off surplus assets, paving the way for the building to be turned into an attraction. \nThe plan is being driven forward by Newcastle wealth managers Tier One Capital, which held an event a few years ago in a bid to bring investors on board. \nDocuments were sent to potential investors detailing opportunities for investment through the EIS investment scheme, which provides investees with a range of Income Tax, Capital Gains Tax and Inheritance Tax benefits. \nDinosauria Ltd was initially driving forward plans to create a dinosaur-themed centre, to complement the region’s existing museum and educational offering with a more interactive and engaging experience for children. \nIt is now understood, however, that dinosaurs will not be the theme of the attraction. \nThe building was the council headquarters for almost 120 years and its sale, marketed by property agents Cushman and Wakefield, also includes council-owned buildings such as Swinburne House, which was previously used as a bank, a building society, and the borough’s first public library and post office. Old Town Hall in Gateshead (Image: Gateshead Council) 8.23 Coreena Ford Oil price rally help sboost BP profits \nOil giant BP has cheered one of the strongest years in the company’s recent history after a hike in the cost of crude helped annual profits more than double. The energy giant saw underlying replacement cost profit - BP’s preferred income measure - soar to 6.2 billion (£4.4 billion) for 2017, up from 2.6 billion (£1.9 billion) the year before. \nOn a fourth-quarter basis, BP chalked up another rise at 2.1 billion (£1.5 billion), climbing from 400 million (£286.2 million) over the same three-month period in 2016 BP is among a string of oil majors benefiting from climbing prices, having seen Brent crude hit 70 per barrel last month - its highest level in more than three years. \nGroup chief executive Bob Dudley said: \n2017 was one of the strongest years in BP’s recent history. \nWe delivered operationally and financially, with very strong earnings in the downstream, upstream production up 12%, and our finances rebalanced. \nWe enter the second year of our five-year plan with real momentum, increasingly confident that we can continue to deliver growth across our business, improving cash flows and returns for shareholders out to 2021 and beyond. BP boss Bob Dudley (Image: Dominic Lipinski/PA Wire) 8.17 Coreena Ford Ocado slumps to loss of £500,000 \nOnline grocer Ocado has slumped to a full-year loss and warned that earnings will be knocked by the cost of developing its new warehouses and IT systems. \nThe group reported a pre-tax loss of £500,000 on a 52-week comparable basis to December 3, down from profits of £12m a year earlier, despite seeing sales rise 12.4%. \nIt cautioned that underlying earnings in the 2018 financial year would “reflect” the costs of investing in its UK logistics hubs, which include a distribution centre in Andover, Hampshire, and its technology platform. \nThe group - which delivers food for supermarkets Waitrose and Morrisons as well as own-brand goods - is planning to fork out £210m over the year ahead, while it also announced that it was issuing an extra 5% of its share capital with investors to raise money for its technology business. \nIt said full-year sales are expected to rise by 10% to 15% over the 2018 financial year, which would mark a slowdown on growth in previous years. \nBut it expects earnings to “ improve significantly” for the 2019 financial year thanks to investment in the business. \nOcado chief executive Tim Steiner said: “Now is the time to take advantage of our growth opportunities. \n“We will invest to ramp up our new solution in both Erith and Andover and to have the right resources in place to meet growing demand for the Ocado Solutions offer.” \nInvestment news will be music to Tharsus’ ears. \nThe Northumberland manufacturer has been working with the online grocery retailer for several years, making swarms of robots as part of Ocado’s warehouse automation project. An Ocado home delivery van (Image: Katie Collins/PA Wire) 8.10 KEY EVENT FTSE 100 slumps amid inflation fears \nThe FTSE 100 Index has crashed by more than 230 points to 7,104.94 as inflation fears rock global markets. \nThis marks its lowest level since late 2016, dropping as low as 7079.4 at one stage soon after opening. \nThe pound at 8am was $1.3961 compared to $1.4021 dollars at the previous close, while the euro at 8am was 0.8882p compared to 0.8859p at the previous close. Screen displaying the FTSE 100 at the London Stock Exchange (Image: Yui Mok/PA Wire) 8.05 KEY EVENT Award-winning app developer Gospelware ceases trading \nAward-winning app developer Gospelware has been forced to close , leading to 15 jobs being lost in Newcastle city centre. \nThe company found itself with cashflow problems after a major client failed to pay the company on time. \nGospelware was also due to start a number of contracts in January but its financial situation was made worse after the projects were delayed. \nAs a result of the closure, 15 staff have been made redundant, and the company is now in the process of informing customers about its situation. \nMichael Dunn, who co-founded Gospelware with his business partner Ryan Davies, confirmed that the company had ceased trading but declined to comment on the company’s situation. \nGospelware had won a string of awards for its work over the last few years, including a global Webby Award for best user interface. The Webby Awards honour businesses, celebrities, and artists from across the internet and are highly prized by those in the industry. \nThe company had also won a prize at the Big Chip Awards, which celebrate tech firms around the North, for the same project with motorbike crash detection app Realrider, which alerts the emergency services in the event of an accident. \nRealsafe Technologies, which owns the Realrider app, employs an in-house team to run the app and will not be affected by Gospelware’s closure. \nAndrew Richardson, chief commercial officer at Realsafe technologies, said: “The closure of Gospelware doesn’t affect our business, as they haven’t been involved in our app for a while. They did the design element for us. \n“I wish the guys well. They did a great job on the design work when we rebranded the app and I wish them success in the future.” Michael Dunn of Gospelware (Image: Newcastle Journal) More On", "external_links": [], "published": "2018-02-06T10:10:00.000+02:00", "crawled": "2018-02-06T10:11:57.021+02:00", "highlightTitle": ""}