{"organizations": [], "uuid": "75e4833ffd2888251a77e60910b6e1285c963d01", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14175591.ece/ALTERNATES/s1200/Busiest-day-in-UKs-aviation-history.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/employers-say-north-east-needs-14253477", "country": "GB", "domain_rank": 21960, "title": "Employers say the North East needs expanded Heathrow Airport to thrive after Brexit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-07T07:00:00.000+02:00", "replies_count": 0, "uuid": "75e4833ffd2888251a77e60910b6e1285c963d01"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/employers-say-north-east-needs-14253477", "ord_in_thread": 0, "title": "Employers say the North East needs expanded Heathrow Airport to thrive after Brexit", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Why the North East needs an expanded Heathrow Airport to thrive after Brexit Business leaders write to MPs as Government considers findings of Heathrow third runway consultation Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe North East needs an expanded Heathrow Airport to ensure it thrives after Brexit , the region’s business leaders have warned. \nThey wrote to MPs urging the Government to press ahead with proposals for a third runway at Heathrow, which were delayed last year. \nNorth East England Chamber of Commerce, which represents 3,000 businesses across the region, said expanding Heathrow would make it easier for Newcastle International Airport and Durham Tees Valley Airport to provide flights to destinations across the globe via London. \nAnd it said: “With the United Kingdom’s relationship with Europe and the rest of the world changing as a result of the vote to leave the European Union, maintaining global connectivity for the whole of the UK, will be vital to ensuring our businesses remain competitive.” \nThe Government announced in October 2016 that it was backing a third runway at Heathrow Airport and plans for the new runway were included in the draft Airports National Policy Statement (NPS) published by the Department for Transport. Newcastle International Airport (Image: Daily Mirror) \nBut the statement needs Parliamentary approval before Heathrow Airport can apply for planning permission to build the runway. \nAnd MPs have still not been asked to vote on the plans. Instead, the Government launched revised proposals for an NPS in October 2017. \nIt said that a new study had found expanding Heathrow would have a negative effect on air quality, noise and biodiversity. \nThe Department for Transport launched a new consultation and is now considering the findings. Ministers said they were on track to publish final proposals for expansion in the first half of 2018, allowing a vote in Parliament to take place. \nNorth East England Chamber of Commerce has written to the House of Commons Transport Committee to call on the Government to press ahead with Heathrow. \nIt said the North East needs air links with the rest of the world and these are provided partly by Heathrow, with services from regional airports such as Newcastle International going to the Heathrow “hub” from where passengers fly across the globe. Read More North East councils say Government is making it 'hard to plan ahead' with delays to funding reforms \nThe Chamber said in a written submission: “As a globally-facing region, North East England requires consistent, reliable access to an international hub airport in order for our businesses to trade across the world. Without additional capacity at such a hub, North East England’s regional airports and the domestic aviation network will be required to compete just to maintain existing flights, with very little room for growth.” \nThere are up to six flights a day between Newcastle International Airport and London Heathrow, linking the North East to destinations around the world. Heathrow’s expansion plans would ensure these flights are protected into the future, and offer the potential for Durham Tees Valley to build a commercially viable case for its own direct flights to Heathrow. \nAs well as expanding Heathrow, the Chamber said the Government’s air strategy should explicitly back regional airports, for example by ring-fencing slots to ensure domestic flights continued. \nThe Chamber also urged the Government to ensure that North East suppliers and workers were given opportunities to work on the expansion of Heathrow. \n“Heathrow expansion should be viewed as one of several strategically significant infrastructure projects, and therefore consideration must be made of the skills and supply chain for the projects as part of wider efforts to rebalance and support the UK economy. \n“In particular, the expansion of Heathrow – both the infrastructure work itself and the subsequent additional air capacity – should seek to harness the opportunity which lies in regions like North East England, which are ripe for job creation, economic growth and further investment.” \nTransport Minister Jesse Norman confirmed in the House of Commons that the Government’s preferred option was for a new runway at Heathrow, but said no decision had been made. Read More East Coast Main Line franchise on verge of collapse, Chris Grayling admits \nSpeaking in January, he said: “For additional capacity in the south-east, the Government’s preference is for a new north-west runway at Heathrow. The revised analysis shows that the north-west runway scheme will deliver the greatest benefits the soonest, and that it will continue to offer the greatest choice of destinations and frequency of vital long-haul routes.” \nHe added: “That is the Government’s preference at present, but I emphasise that no final decision - indeed, no decision of any kind - has been taken on the matter.” Like us on Facebook ", "external_links": [], "published": "2018-02-07T07:00:00.000+02:00", "crawled": "2018-02-07T08:37:19.009+02:00", "highlightTitle": ""}