{"organizations": [], "uuid": "57a150b71ade9dac0e5da29388ad4c35c9da7876", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14260537.ece/ALTERNATES/s1200/brexit-teaser.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/last-truth-brexit-devastate-north-14260552", "country": "GB", "domain_rank": 21960, "title": "At last the truth: Brexit will devastate North East economy, leaked Government paper shows", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-07T20:02:00.000+02:00", "replies_count": 0, "uuid": "57a150b71ade9dac0e5da29388ad4c35c9da7876"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/last-truth-brexit-devastate-north-14260552", "ord_in_thread": 0, "title": "At last the truth: Brexit will devastate North East economy, leaked Government paper shows", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "negative"}, {"name": "phil wilson", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "sedgefield", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe economy of the North East will suffer massive damage as a result of Brexit and shrink by 11% even if there is a comprehensive trade deal, the Government’s own analysis shows. \nAnd if we crash out of the EU without a deal then GDP in the North East will be hit by 16%. \nThe devastating effect on jobs and wages in the region is revealed in impact assessments which the Government attempted to keep secret. \nThey confirm the North East, with its manufacturing industries and large number of exporters, would be harder hit than any other part of the UK. \nOne North East MP said the case for another referendum on whether to go ahead with Brexit was stronger than ever. \nSedgefield MP Phil Wilson said: “With new information becoming available, the British people should have another say on what the final deal is, and whether we should go ahead with it.” The North East will be hardest hit by Brexit, according to the leaked papers. \nThe analysis shows the impact of leaving the EU over 15 years compared to what would happen to the UK economy if Brexit didn’t take place. \nInformation first emerged at the end of January, when details were obtained by website Buzzfeed. \nMPs were then permitted to see them in “a confidential reading room” - and more details have now been leaked to the media. \nSky News and the BBC both separately published the regional breakdown. They have still not been published officially, and Government policy is that they should remain confidential. \nThe analysis shows Brexit would mean the North East economy shrank by 3% even if the UK remained a member of the single market. This “best-case scenario” appears highly unlikely, as both Labour and the Conservative Government insist that Brexit must involve leaving the single market. poll loading Which way would you vote if there was a second referendum? 1000+ VOTES SO FAR Leave Remain \nThe BBC reports the UK car industry’s GDP would shrink by 1% if the we remain in the EU single market, but would lose 8% if there was a free trade agreement and 8.5% if the UK left without a deal and went to World Trade Organisation rules. \nAcross the UK as a whole, leaving the EU without a deal would hit GDP by 8%. Brexit with a free trade deal would shrink the UK economy by 5%, and staying in the single market would mean the economy was reduced by 2%. The Nissan factory in Sunderland. (Image: Unknown) \nUnder every scenario, London would be the region hurt the least. \nNewcastle North MP Catherine McKinnell said: “It’s hard to overstate just how concerning these figures are for the North East - which already has the highest unemployment in the country - and local jobs. \n“There is not a shred of evidence that any deal with the EU, or future trade agreements with other countries, will outweigh the clear disadvantages of leaving the single market and customs union, never mind the catastrophic effect of leaving the EU without any deal at all. \n“The Government’s own figures now reveal quite how damaging Brexit could be for the North East - yet we still have absolutely no idea how they intend to mitigate the impact of this on our region. Read More How the Government says it will help millions of workers with new rights \n“Ministers are living in cloud cuckoo land if they think the North East will be better off under any of the Brexit outcomes they might want to achieve - and continuing to stick their fingers in their ears whilst singing loudly is not going to stop this impending damage to our region.” \nPrime Minister Theresa May has chaired the first of two key Brexit meetings with senior ministers as the Government attempts to clarify its position. Prime Minister Theresa May. (Image: Getty Images Europe) \nThe Brexit cabinet committee is to sketch out what the future relationship between the UK and EU might look like. A meeting was held on Wednesday and another takes place Thursday. \nAs the Commons has been promised a vote on any deal with the EU, and EU institutions will also need to approve it, some sort of agreement is likely to be needed by October. Read More Why the North East needs an expanded Heathrow Airport to thrive after Brexit \nBut at this stage it seems the Government still hasn’t decided what sort of agreement it wants, leaving little time for negotiations. \nMrs May vowed to be “robust” in Brexit talks after Brussels released papers showing it wants to put in place a method to rapidly curtail the UK’s single market benefits if it breaches agreements on a transition deal. \nAsked during Prime Minister’s Questions if she would see off any “threats” from the European Union, Mrs May said: “We will be robust in our arguments. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \n“As I have said right from the very beginning we will here noises off, we will hear all sorts of things being said about positions that are being taken. \n“What matters is the positions we take in the negotiations as we sit down and negotiate the best deal. We’ve shown we can do that. We did it in December and we are going to do it again.” Read More", "external_links": [], "published": "2018-02-07T20:02:00.000+02:00", "crawled": "2018-02-07T20:23:30.000+02:00", "highlightTitle": ""}