{"organizations": [], "uuid": "1b842a7b42f4cd936fe4c18108090bbeb18d6930", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14293997.ece/ALTERNATES/s1200/HCR_NEC150218humans.jpg", "site_section": "", "section_title": "", "url": "https://www.chroniclelive.co.uk/news/local-news/newcastle-city-centre-humans-portraits-12842585", "country": "GB", "domain_rank": 21960, "title": "Newcastle's Humans of NE1: Fascinating portraits & interviews with people in the city centre - Chronicle Live", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.016, "site_type": "news", "published": "2018-02-15T16:52:00.000+02:00", "replies_count": 0, "uuid": "1b842a7b42f4cd936fe4c18108090bbeb18d6930"}, "author": "Hannah Colley", "url": "https://www.chroniclelive.co.uk/news/local-news/newcastle-city-centre-humans-portraits-12842585", "ord_in_thread": 0, "title": "Newcastle's Humans of NE1: Fascinating portraits & interviews with people in the city centre - Chronicle Live", "locations": [], "entities": {"persons": [{"name": "stephanie oswald", "sentiment": "none"}], "locations": [{"name": "south america", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "ecuador", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now \nHumans of NE1 celebrates the people living in and visiting Newcastle city centre, giving insights into their diverse lives - whether it be their secrets, hopes, dreams or histories. And you can meet them here. \nThe project replicates the phenomenal Humans of New York , telling personal stories of people in the city and sharing their portraits without identifying them by name. \nNE1 Limited employed photographer Stephanie Oswald for this ambitious undertaking for NE1’s Get into Newcastle website. Our blog will be updated regularly, featuring new faces and stories. And it might feature someone you know! \"I chose to do it in Ecuador\" (Image: Stephanie Oswald for NE1) \n“I went to South America last summer, volunteering with a charity in Ecuador. I study medicine and I did some surgery with them, and I got to travel afterwards. I think that was the best thing that I’ve done so far. \n“The charity had a mobile van that they converted into an operating theatre that they could drive. And they would drive into remote locations so they could do surgery on people who couldn’t afford to pay for it or didn’t have access to healthcare. So it would be rural communities in Ecuador. They would have to do stuff that was quite low risk, but they still got to do things like hernia operations, or gallbladder removal. They also provided GP-type help. I was on work experience and I could help with the surgery and also help post-operation, making sure patients were OK after they were operated on. \n“All medical students have to do a period of eight weeks and I chose to do it in Ecuador. It’s a really good opportunity to see what healthcare is like in a different place, and it’s a good opportunity to practise Spanish. My mum is from Venezuela so the poverty was not as shocking as it might have been for someone else. I understood the culture quite well.” \"I quit my fancy corporate graduate job\" (Image: Stephanie Oswald for NE1) \n“Last year I quit my fancy corporate graduate job to run my own business. Probably the scariest thing I’ve done, but also the most exciting, so that’s probably the best thing I’ve done so far. We’d been trading for 10 months before I quit my job. I was running the business alongside doing my full-time job, but it just got to the point when I couldn’t do both. And I needed to commit full time. \n“My business is called Creatures of XIX. We make ath-leisure clothing, athletic-leisure. It started off being pole-dancing focused, because both myself and my partner we pole for fitness and fun. We’re working with a supplier in China, Russia, a couple in the UK, and sell international. \n“I always wanted to have my own business but I never quite knew what. I’ve been doing pole dancing for six years, and my business partner approached me and said, ‘I’ve had this idea for ages and I don’t know how to make it happen, do you want to do it with me?’, and I was like ‘Hell, yes!’ \n“We have the pole-clothing range that we make ourselves, we have our own manufacturers and our own designs, we’ve got a couple of brands that we distribute for, and we generally commission sport leggings and crop tops and things like that. It’s hard work, but really good fun.” \"I look at the fish, I dive down around coral reefs to see how the fish are doing\" (Image: Stephanie Oswald for NE1) \n“The best period of my life is now because I love my job. I have the chance to travel all over the world and dive, that’s my job. I’m a marine biologist, I work in tropical areas but I’m based in Newcastle. “I travel once a year to go to different locations. I stay in one spot for a couple of months. I look at the fish, I dive down around coral reefs to see how the fish is doing. Global warming has a great impact on coral reefs, they are bleaching, dying, but how about the fish? My job is to look at them. \n“Before I moved to Newcastle I was in Hong Kong, and I started diving there as a hobby. I was an environmental engineer at that time, and I thought diving was much more interesting! So I changed my career to become a marine biologist. \n“For my job now I film and take pictures underwater. It can be very depressing though because the corals are dying. And everything you see is either pale white or totally green because the corals are dead, and you just see sea grasses or algaes. It’s very depressing at the moment. Hopefully I can find a solution. \n“Corals are half-animal-half-plants, they capture food from water and eat it, they work like a plant. Some corals are more resilient, but they’re still dying. The water heats up, and there is more carbon dioxide that dissolves in the water, so the water becomes more acid.” \"It’s peaceful, it’s like an urban jungle\" (Image: Stephanie Oswald for NE1) \n“My favourite part of the day is getting into bed, or making a cup of tea, or eating chocolate, or just generally going for a stroll. \n“I like walking through Newcastle when it’s really early in the morning and the sun is just coming up, and there’s nobody about. It’s peaceful, it’s like an urban jungle. It’s nice to explore then. I used to start work at 6.30am so that’s why I would get up early. I’m going to uni now so I don’t work that early any more. I enjoyed that, crossing the bridges, looking at the river, when there’s nobody around. Very peaceful and relaxing. Best part of the day. I still do it now from time to time, randomly. I listen to music sometimes as well. And usually I try to find somewhere where they sell coffee.” “Well, if I’ve got no money I’ve got no money, I can rough it” (Image: Stephanie Oswald for NE1) \n“I work in graphic design, in a design agency. I set up the agency myself 14 years ago. There’s seven of us now. So it’s been a steady progression over the last 14 years. \n“It’s quite daunting to start working for yourself, but I was in a job that I didn’t like doing and I ended up walking out. And it sort of forced my hand a bit so I thought I would give it a go, to work for myself. “I would say that the first two or three years, it’s fits and starts. It’s ups and downs - some weeks I would have no money, some weeks I wouldn’t. But then eventually, you start to build a bit of momentum where you get a regular turnover. And then I managed to take another designer on. And then I just gradually built it up from there. \n“We do work all over the country, and we’ve just started doing some work for a place in Germany. But the majority of our business is in the North East. Even when it gets quite stressful, and tiring, I always remember what it was like to work for a company that I didn’t like, with people that I didn’t really like. \n“If I had a piece of advice to someone who’s starting a business, I would say “keep going”. You’ve got to earn a living, and that’s the hard thing. \n“When I first started, I was single, I didn’t have a girlfriend, I didn’t have any children or anything so I just thought “well, if I’ve got no money I’ve got no money, I can rough it”. Once you have those responsibilities, it’s harder to make that move, unless you’ve got a regular supply of work coming your way. For me I just felt like it was the right thing to do. Keep going, and if you’re well organised and if you’re good at what you do, you should be all right. If you’ve got the talent, and you enjoy it, that’s the main thing. \n“Money isn’t everything. I would rather have an average wage or a low wage but doing something that I like to do myself, than have a big wage working for a company where I’m not really happy.” \"One of us is an animal person and the other isn’t\" (Image: UGC TNE) \n“We’re best friends, we’ve known each other 17 years. We’re 21. So we’ve been friends since we were four. We went to primary school together. We have nothing in common really though! I think that’s what makes us good friends. We like all different things. We do completely different courses at uni. One of us is an animal person and the other isn’t. One of us is really into the environment the other is really not. We have different style for everything. Different tastes in men as well, which is always good.” \"I’m the youngest of seven\" (Image: Stephanie Oswald for NE1) \n“Recently my brother had a little girl. It’s not my first niece, my brother and my sister already had children. That makes me happy, seeing them. I have a big family, I’m the youngest of seven. I’m 37, so back in the day, having big families was less unusual. I’m the youngest, but the oldest is 52. So there’s a bit of a gap between each of us. \n“I think it was tradition back then, in the North East of England maybe, to have big families. I’ve got friends that grew up with huge families as well, who have four or five siblings. \n“It’s good now but back then, when I was younger, it wasn’t always easy. You’re always fighting for love, because you want attention from your parents. Now I’ve grown older and I’m happy now with a big family, but it wasn’t the same then.” \"I began to use surfing as a way to escape from my life situation\" (Image: Stephanie Oswald for NE1) \n“I started surfing at 17. I enjoyed it straight away. It’s a very immersive experience and I’ve not met anyone who didn’t enjoy surfing after trying it. It’s exciting, very refreshing and healthy. \n“I surfed every other day for about 10 years. It became a kind of addiction and ultimately I began to use surfing as a way to escape from my life situation, which was not as I wanted to be. It worked temporarily but it’s like putting a plaster on a wound that needs stitches. \n“I love surfing, it made me feel alive and competent and expressive, but I felt like I needed to take a hiatus. Sometimes we need to put something down to make space available for something new.” \"There’s nothing worse when you can’t listen to your records” (Image: Stephanie Oswald for NE1) \n“The worst part of my year was that I lost my grandma. I knew her well, I was quite close to her. When she passed away, it was hard. But I’ve managed to have family around and I have my boyfriend with me now, so it helps us a bit. \n“What I often used to do with my grandma is that we used to listen to Elvis Presley together and have cups of tea and chat about life and stuff. I think she had a little love for him. It’s a typical thing, obviously he was a big pop star at the time so she fell in love with him as a teenager, and never lost that love throughout the years. She used to have records and the record player broke, so we got CDs for her instead and a CD player. There’s nothing worse when you can’t listen to your records.” “I’ve always liked music, but I didn’t learn any instrument when I was younger\" (Image: Stephanie Oswald for NE1) \n“I really enjoyed putting the Oxjam festival on recently. It’s a music festival and all the money is for Oxfam. All the bands play for free. This year we did a three-day festival, one day in Gateshead, one day in the Ouseburn, and one day as part of Newcastle College, for younger bands. It’s a lot of work but I really enjoy it. I really like talking to bands, contacting venues, and I design posters as well. It’s a chance to be creative. It’s voluntary. I’ve got a day job but this is particularly enjoyable because it’s something I choose to do. \n“I’ve always liked music, but I didn’t learn any instrument when I was younger. I didn’t do music at school at all. After I left school I started working for a while, I started DJing, and then I did a degree in music. I studied music production. If you get into DJing, and you want to make music, but that you don’t really play any instrument, then music production is the natural way to go.” “I know I’m young, but you just have to have an early start\" (Image: Stephanie Oswald for NE1) \n“I do a lot of things in politics, I do a lot of campaigning to end poverty, so I go to the House of Commons a lot and speak there. \n“I’m doing my A-levels now, but I started being involved in campaigning when I was 14. I just got really annoyed, about poverty in Newcastle. So I joined a group called Poverty Ends Now and we go to the House of Commons, but I also do other things about religious and racial discrimination. I’m just a really angry person! But in a good way, in a way that I try to change the world. I do that in my spare time. \n“I study politics, sociology and history. Hopefully I would like to work in Parliament, but not in politics because it’s too weird. You have to be on the outside to make a change, do things with charities. I think we’re in a scary place, because of Donald Trump and Brexit. \n“I think people need to be more loving. That’s my aim. I do a lot of end poverty and racism and stuff, but my aim is just for everyone to be more accepting of each other, to stop being so afraid of each other, that makes me really sad. You’ve just got to share little happinesses, you just have to be nice to people. And obviously you go to Parliament and tell important people off, but mostly you’ve just got to be nice every day to people. \n“I know I’m young, but you just have to have an early start. People respect you when you’re young, because they’re like ‘Oh, she’s one of us’.” “OK I need to just grow up and deal with things” (Image: Stephanie Oswald for NE1) \n“The best period of my life is now because I love my job. I have the chance to travel all over the world and dive, that’s my job. I’m a marine biologist, I work in tropical areas but I’m based in Newcastle. \n“I travel once a year to go to different locations. I stay in one spot for a couple of months. I look at the fish, I dive down around coral reefs to see how the fish is doing. Global warming has a great impact on coral reefs, they are bleaching, dying, but how about the fish? My job is to look at them. \n“Before I moved to Newcastle I was in Hong Kong, and I started diving there as a hobby. I was an environmental engineer at that time, and I thought diving was much more interesting! So I changed my career to become a marine biologist. \n“For my job now I film and take pictures underwater. It can be very depressing though because the corals are dying. And everything you see is either pale white or totally green because the corals are dead, and you just see sea grasses or algaes. It’s very depressing at the moment. Hopefully I can find a solution. \n“Corals are half-animal-half-plants, they capture food from water and eat it, they work like a plant. Some corals are more resilient, but they’re still dying. The water heats up, and there is more carbon dioxide that dissolves in the water, so the water becomes more acid.” \"I travelled a lot. I went to seven countries\" (Image: Stephanie Oswald for NE1) \n“Best thing about my year was that I travelled a lot. I went to seven countries. I went to Hong Kong and Thailand last Christmas, and then in the summer I went to Slovenia, Bosnia and Croatia, and then I went to Japan, and in December I just came back from Austria. I do like travelling, but last year was exceptional as I don’t normally travel so much. \n“There are various reasons why I travelled so much: my brother lives in Hong Kong, so last year I went to see him there, and then I went to Thailand to celebrate my mum’s 60th birthday. And the summer was three new places, one being Bosnia because my boyfriend’s from there. Then he went off on a big travel and I met him at the end, and he ended in Japan. And I went to Austria this Christmas because as my brother lives away, we meet in different places every Christmas. \n“I like travelling a lot, but I don’t think I’ll be doing it much in 2017, it’s too expensive. My boyfriend came here from Bosnia maybe 20 years ago, when it all kicked off, when the war broke out, so they’ve been here for ever, him and his family. Bosnia is nice, it’s got horrible parts like anywhere though. People are very friendly, the food is good, but there’s a lot of evidence of war still. We crossed the border from Slovenia, and there were graves everywhere.” \"I played football until I was 44, 45\" (Image: Stephanie Oswald for NE1) \n“I wanted to be a footballer when I was little. I played football, although not to the level that generated any income. I played football until I was 44, 45. I watch it now but not as much as I used to. I don’t watch Newcastle United anymore.” \"We love each other, we don’t have a lot of problems\" (Image: Stephanie Oswald for NE1) \n“I’m from Egypt and I come from a nice family. We love each other, we don’t have a lot of problems. I graduated with high grades at the school of engineering, and becoming an engineer was my dream. \n“But what was hard was the army. It was a tough time. It’s obligatory in Egypt. It lasted for about a year and a half. That was the hardest. I was a soldier, but just in training. If there was a war I would be on the front lines. There is a lot of equipment in the army, so we learn to use it. The equipment I learnt about is in air defence. So it’s for targeting airplanes or something. \n“We would get up early at 5am, we would run and do some exercises, and in the evening we had shifts to guard the place. So it was either working in the unit, cleaning it, taking care of it in the morning, or guarding the place at night. It was hard also because there was someone of a higher rank than me who controlled everything that I did. Sometimes it was kind of humiliating you know. So it was a hard time. But of course I learnt a lot from it. To be tough, to face hard times and so on. \n“I haven’t talked about a religion so far, I’m a Muslim, so maybe the hardest time for me was when I was thinking I’m not good enough, not being a good Muslim. This may be the worst time. \n“I’m doing a Masters in Egypt and in my university they have an exchange programme with the university here, so I came here two months ago. I’m doing some research, and in one month I’ll go back. I like the city here, it’s clean, there’s order here. In Egypt, it’s chaotic. So here it’s much better. But I miss my family and I miss my friends. \n“While in Newcastle, I have joined a programme for feeding the homeless. So I think I’m spending my time in a good way.” \"We got together when we were 14, 15\" (Image: Stephanie Oswald for NE1) \n“A bad period for me would be when I broke up with my latest girlfriend. We had been together for two years. But then we got back together six months after that. We’ve known each other for years, since we were 12. We got together when we were 14, 15. We didn’t get on at first though.” \"We haven’t been in a war\" (Image: Stephanie Oswald for NE1) \n“I’m Persian. If I want to talk about a difficult period in my life I must definitely mention the military service for my country. I had to do it like others guys for 17 months. We haven’t been in a war at all and that was just for training and learning how to use guns, and the problem is when you do something without having any choice, that’s not great. \n“But now I’m enjoying being here, I’m studying at the university, and I have a chance to do my music career at same time. It’s good because I started again to do both. \n“I studied electronic engineering in Iran, and here I’m doing my Masters in electrical power engineering. It’s difficult for me to do this degree, it’s a strange language in different culture, but I am quite happy with it, England is like I had imagined, I have lots of things to do here.” \"It hasn’t been diagnosed yet here in the UK\" (Image: Stephanie Oswald for NE1) \n“Now is a bit of a stressful time, it’s good and bad at the same time. I have to manage my time between studying and family life, so it’s a bit stressful. I’m doing a full-time Phd, I’m in my 3rd year, and I have three daughters. They are 12, eight and four. It’s quite hard to manage to give them their own time, to play with them, to give them some special time, and to study at the same time. \n“On my PhD I’m working on a rehabilitation programme for muscular skeleton disease. So it’s physiotherapy for fibromyalgia. It’s a muscular skeleton disease. It affects the whole body. It’s quite common, but there’s no evidence, it hasn’t been diagnosed yet here in the UK. There is a lot of work on it though in the USA, in Germany and in the UK. So we’re looking for the evidence-based practice. \n“I’m from Libya. I did my Masters here in 2005, and then I came back for my Phd. I like Newcastle particularly. I like the social life here. I have been in many places in the UK, but I like Newcastle much better. It’s cheaper and people are friendly as well. I’m in the last year of my PhD.” \"I think I had always wanted children\" (Image: Stephanie Oswald for NE1) \n“I just had my first daughter, she’s 10 months old, so that’s really wonderful. She’s just super-cute, funny, adorable, and fascinating. I think I had always wanted children, but I left it pretty late, I’m 43 so I took my time. She’s still very little so we don’t really have to do any parenting, like telling her not to do stuff, she’s still a baby. She’s getting very engaged with her own environment so it’s all changing all the time. \n“Sleep is really not good but it’s the only thing I would say is a real challenge. If I was 21 and really wanted to party a lot, and go out drinking with my mates, maybe I would be frustrated. But I’ve done lots of that so I don’t feel like I’m losing out on stuff I haven’t done already. \n“I’m a musician and I’m in Newcastle to play a gig at the Cluny, and we’re going to Edinburgh tomorrow and playing again, just a three-day tour. I came from Berlin, that’s where I live now.” \"I’m just trying to seize the day and live for the moment\" (Image: Stephanie Oswald for NE1) \n“I’m coming out of a bad period at the moment. For a long time after university I didn’t know what I wanted to do and I’ve been working as a waitress for a while. That made me feel a bit depressed. Now I’m just trying to seize the day and live for the moment and I’m saving up to go travelling in January. \n“I try not to think of everything so long term and have everything planned out. So it’s a good moment at the moment. I’m hopefully going to go travelling for a year, I want to do a teaching English as a foreign language course, and hopefully find a European country before Brexit comes into play, live there for a while, and see if I enjoy it. \n“Italy would be my ideal place to go. For the food, the culture. It’s somewhere I’ve never been, but as I’m quite artistic and I like history, I think it’s somewhere that I would have an affinity with. Hopefully Tuscany, in the North, in the hills. \n“I studied English literature, but I didn’t actually graduate, I was going through quite a bad period then. But I’ve decided to sort of leave it for now and go travelling and maybe come back to it. I love reading, absolutely love it, but studying it took some of the fun out of it. So I’m glad that I’ve left that and I got back into reading again. I like F Scott Fitzgerald obviously, but I also like the more obscure things like Kurt Vonnegut, he wrote a good book called Breakfast of Champions that’s a bit off the wall but I really like it. I also like poetry, so a few different things really.” \"I finally found what I wanted to do\" (Image: Stephanie Oswald for NE1) \n“My time at school was not too good. I didn’t really like school, never really got into it. No lessons were interesting. So I was just glad when I got my GCSEs done and I got out. I wasn’t too sure what else I wanted to do. It wasn’t until I started doing animation here at uni that I knew what I wanted to do. \n“After my GCSEs I went to college for a bit, that was definitely better than school. I was doing art and design at college. I used to do a lot of drawing, a lot of sketching. It was the college course that led me to do animation here. So I finally found what I wanted to do. \n“I like 2D, 3D, stop motion, all sorts of animation. I just have to figure out what I’m doing next basically. I would love to work on films, maybe more with a mature audience kind of thing. Less kid stuff, more mature. I like sketching whatever, I just really like drawing.” \"We’re enjoying the partying a bit too much\" (Image: Stephanie Oswald for NE1) \n“On Sunday, we were all together, and we had a really nice day. We managed to form quite a good friendship group in Newcastle. We went out for a roast dinner, lots of chatting, and then we went out on a night out. \n“We started uni at the same time two months ago. We’re not on the same course though. We’re in the same accommodation block. We have a nice friendship group, we’ve met people in Newcastle who just live here, who are in our friendship group as well. It’s quite mixed surprisingly, we’re Newcastle and Northumbria students mixed together. \n“We’ve done quite well compared to other people who seem to just know one or two people. We’re a mix of students and locals. We’re enjoying the partying a bit too much!” “Being in foster care was a bad time\" (Image: Stephanie Oswald for NE1) \n“I was fostered all my life, in foster care. So you’re taken away from your family, but you have contact with them. So I moved from home to home. I had foster homes. \n“There are different reasons why you wouldn’t stay in one foster family - sometimes the relationship between the carer and the child can break down, or it can be a number of other reasons. But essentially, you get moved from place to place, every time. \n“I did stay with one particular family for six years, between the ages of 10 and 16, and they were great. They taught me everything. But when I got older, I wanted more independence, I wanted to invite friends to stay at home, and the family had other children of their own, so I left as our relationship became a bit more difficult. \n“Being in foster care was a bad time, but it set me up for the rest of my life. Now I’m very adaptable, I’m very focused and driven. I’ve come through this experience strong. So I’ve gone from a fairly traumatic experience to a good experience. I still see my mum from time to time but she lives down South. \n“I would like to own my own bar one day. I’ve got a child, so I want to own my own bar and give him something as part of my legacy. He’s one, he will be two in February.” \"You have to look for the good news\" (Image: Stephanie Oswald for NE1) \n“The last two years for me have been good and bad. Last year, my dear father died, but my son got married at the beginning of this year. So it’s been all good and bad mixed in together. So you have to look for the good news, not always the bad news.” \"I think every mother wants a girl\" (Image: Stephanie Oswald for NE1) \n“A really good period in my life was when I had my daughter. She’s 29 years old in 10 days now. It was good because I got my girl. I had two boys already, and I got my girl. I wanted to have a girl, I think every mother wants a girl. She does the washing up and cleans up for me! \n“At the moment it’s a hard period though because my daughter and her ex-husband are fighting for my grandchildren, so we’re having a big struggle now with the kids, so we just have to wait and see what happens. The children are four, five and eight. I see them, they come, I had them yesterday, I see them through the week. Hopefully it will be sorted soon.” \"That was a highlight today” (Image: Stephanie Oswald for NE1) \n“I had a hot chocolate earlier and that was really good, I really enjoyed that. That was a highlight today.” \"We’ve got a little group called Toon Tashes\" (Image: Stephanie Oswald for NE1) \n“I’m doing Movember. There are six of us that are doing it, and we’ve got a little group called Toon Tashes. It wasn’t really a big idea, but then me and my friend were doing it, and all the other lads wanted to do it as well, so we set up a little page on the website, and we’ve raised a couple of hundred pounds from family and friends. \n“I’ll get rid of the moustache afterwards though, I’m not going to lie. My mum and my girlfriend feel there is something dodgy about it. I don’t normally sport facial hair.” \"That was definitely my best Christmas\" (Image: Stephanie Oswald for NE1) \n(Mother - on the left) \n“My best Christmas ever was when I had Robert, my first child, who was born 10 days before Christmas. He was very ill when he was born, and he came out of hospital on Christmas eve, so that was definitely my best Christmas. He was born 6 weeks early, and he was very poorly when he was born. We thought we would be in hospital all over the holidays, but he came home on Christmas eve.” \"I met the love of my life, and I’m still married to her\" (Image: Stephanie Oswald for NE1) \n“The best period in my life was when I got married. In 1990. I met the love of my life, and I’m still married to her. I had known her for a long time before we got married, but we only started going out a year and a half before we got married.” \"I started off at the very top of Gateshead \" (Image: Stephanie Oswald for NE1) \n“I love walking in the fresh air. Being out in the fresh air. You can do Hadrian’s walk up to the sea, through Wallsend, beautiful, just what you need on a day like today. Today I started off at the very top of Gateshead and walked down here. And then I will go along to The Cycle Hub and then to the Ouseburn, beautiful.” More On ", "external_links": [], "published": "2018-02-15T16:52:00.000+02:00", "crawled": "2018-02-16T01:28:41.002+02:00", "highlightTitle": ""}