{"organizations": [], "uuid": "1eedac3d053df0c10d6fe8e729a39511242fb6cb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14285260.ece/ALTERNATES/s1200/SGP_NEC_130218HOLY02JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/north-east-brexit-disaster-northern-14285106", "country": "GB", "domain_rank": 21960, "title": "North East Brexit disaster? Northern Powerhouse minister Jake Berry MP dismisses chilling report", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-13T18:00:00.000+02:00", "replies_count": 0, "uuid": "1eedac3d053df0c10d6fe8e729a39511242fb6cb"}, "author": "Sean Seddon", "url": "https://www.chroniclelive.co.uk/news/north-east-news/north-east-brexit-disaster-northern-14285106", "ord_in_thread": 0, "title": "North East Brexit disaster? Northern Powerhouse minister Jake Berry MP dismisses chilling report", "locations": [], "entities": {"persons": [{"name": "jake berry", "sentiment": "negative"}, {"name": "st aiden", "sentiment": "none"}, {"name": "berry", "sentiment": "none"}, {"name": "lindisfarne mead", "sentiment": "none"}], "locations": [{"name": "north east brexit", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "holy island", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}], "organizations": [{"name": "northern powerhouse", "sentiment": "negative"}, {"name": "buzzfeed news", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News North East Brexit disaster? Northern Powerhouse minister Jake Berry MP dismisses chilling report Speaking on a visit to Northumberland, the minister cast doubt on a leaked civil service report which said North East would suffer post-Brexit Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily   Thank you for subscribing!   \nThe Northern Powerhouse minister has rubbished a report which said the North East is drifting towards a post-Brexit economic slump. \nJake Berry MP said he didn’t have faith in figures compiled by civil servants which show the region taking a major hit following the UK’s departure from the EU. \nSpeaking on a visit to the Lindisfarne Mead distillery on Holy Island, Mr Berry painted an optimistic picture for North East businesses post-Brexit. \nThe government came under intense pressure to release their internal Brexit impact analysis report after details were leaked to Buzzfeed News. Northern Powerhouse minister Jake Berry visiting St Aiden's winery on Holy Island, Northumberland (Image: Newcastle Chronicle) \nMPs were eventually permitted to see the document in a “confidential reading room” and further eye-watering details emerged. \nThe study found that, under a “no deal” scenario, the region’s economic output would shrink by 16% over 15 years. \nEven if the government negotiates a comprehensive free trade agreement, the North East economy will still dip by 11%, the report finds. Northern Powerhouse minister Jake Berry with Ian Robertson from St Aiden's winery on Holy Island, Northumberland (Image: Newcastle Chronicle) \nAsked if exporting companies in the region would have the rug pulled out from under them by Brexit, Mr Berry said he “very much doubts it”. \nHe added: “These are very long term projections and economists usually turn out to be wrong. Read More Theresa May and her ministers plan six speeches to answer questions about Brexit \n“If you look at the strength of businesses like this with fantastic people and a fantastic product which is consumed across the globe, Brexit presents a real opportunity.” \nHe went on to say: “In my experience, businesses plan long term and I suspect they’re doing so right now. Lindisfarne Mead at St Aiden's winery on Holy Island, Northumberland (Image: Newcastle Chronicle) \n“Brexit is 13 months away and I accept there is a period of uncertainty during that time but as we get nearer that date the uncertainty will disappear.” \nThe minister was speaking on a three day tour of the North East and Teesside during what has been a turbulent few weeks for the Government. \nSteve Baker MP, a junior minister in the Department for Exiting the EU , was forced to apologise after making comments calling into question the independence of civil servants involved in forecasting the impact of Brexit. \nJacob Rees Mogg MP, who has become the public face of Brexit-supporting Tory backbenchers, accused the Treasury of “fiddling the figures”. Northern Powerhouse minister Jake Berry visiting St Aiden's winery on Holy Island, Northumberland (Image: Newcastle Chronicle) \nThe Northern Powerhouse minister said trading abroad needs to become the cornerstone of the North East’s growth in the future. \nHe said: “In a post-Brexit world exports are going to become more and more important to places like the North East. Read More At last the truth: Brexit will devastate North East economy, leaked Government paper shows \n“This region is already a net exporter and produces some fantastic products - there are challenges but there are opportunities too.” \nSix major speeches delivered by senior cabinet ministers, culminating in a set-piece address by Prime Minister Theresa May, will set out the Government’s Brexit vision over the next two weeks. Like us on Facebook", "external_links": [], "published": "2018-02-13T18:00:00.000+02:00", "crawled": "2018-02-13T19:16:11.000+02:00", "highlightTitle": ""}