{"organizations": [], "uuid": "6197826b02abc2f9771e7bd0723c41853c0f266d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article343396.ece/ALTERNATES/s1200/maplinsJPG.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "devonlive - frontpage", "url": "https://www.devonlive.com/whats-on/shopping/maplin-collapses-administration-putting-2500-1275317", "country": "GB", "title": "Maplin collapses into administration putting 2,500 jobs at risk", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-28T14:29:00.000+02:00", "replies_count": 0, "uuid": "6197826b02abc2f9771e7bd0723c41853c0f266d"}, "author": "Abbie Bray", "url": "https://www.devonlive.com/whats-on/shopping/maplin-collapses-administration-putting-2500-1275317", "ord_in_thread": 0, "title": "Maplin collapses into administration putting 2,500 jobs at risk", "locations": [], "entities": {"persons": [{"name": "toys", "sentiment": "none"}, {"name": "maplin", "sentiment": "none"}, {"name": "graham harris", "sentiment": "none"}, {"name": "harris", "sentiment": "none"}, {"name": "abbie bray", "sentiment": "none"}], "locations": [{"name": "exeter", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "plymouth", "sentiment": "none"}, {"name": "daily mirror", "sentiment": "none"}, {"name": "rutland partners", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Maplin collapses into administration putting 2,500 jobs at risk The news comes just hours after Toys 'R' Us announced they would also be going into administration Share Abbie Bray What's On Reporter 12:29, 28 FEB 2018 Maplin in Exeter is at threat of closure Share   \nMaplin is the second high street retailer to collapse into administration today, putting 2,500 jobs at risk. \nThe group, owned by private equity firm Rutland Partners, called in accountancy giants PricewaterhouseCoopers after attempts to rescue the chain failed, reports the Daily Mirror . \nAll Maplin stores across Britain and Ireland, of which there are more 200, will continue to trade and remain open for business, chief executive Graham Harris said. Plymouth's Maplin store relocated to a bigger unit in 2015 Read More These are the best Toys 'R' Us deals as prices slashed by up to 80 per cent \nThe firm fell into administration on the same day it was announced Toys R Us had entered administration , where more than 3,000 jobs are under threat. \nMr Harris said Maplin had been hit by the impact of the Brexit-hit pound, a \"weak consumer environment\" and the withdrawal of credit insurance. \nHe said: “I can confirm this morning that it has not been possible to secure a solvent sale of the business and as a result we now have no alternative but to enter into an administration process. \n\"During this process Maplin will continue to trade and remains open for business. \n\"The business has worked hard over recent months to mitigate a combination of impacts from sterling devaluation post Brexit, a weak consumer environment and the withdrawal of credit insurance. \" Maplin in Exeter is at threat of closure Read More Now Poundworld and New Look stores under threat of closure \nHe continued: \"This necessitated an intensive search for new capital that in current market conditions has proved impossible to raise. These macro factors have been the principal challenge not the Maplin brand or its market differentiation. \n\"We believe passionately that Maplin has a place on the high street, and that our trust, credibility and expertise meets a customer need that is not supported elsewhere. \n\"We will now work tirelessly alongside Zelf Hussain, Toby Underwood and Ian Green, from PWC, who have been appointed as the as Joint Administrators of Maplin Electronics Limited, to achieve the best possible outcome for all of our colleagues and stakeholders.” Read More", "external_links": [], "published": "2018-02-28T14:29:00.000+02:00", "crawled": "2018-02-28T14:38:24.016+02:00", "highlightTitle": ""}