{"organizations": [], "uuid": "2b6607f2b1840c03f964ec5a3e4b1052115b3e43", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/business/article1207244.ece/ALTERNATES/s1200/tablet.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "devonlive - frontpage", "url": "https://www.devonlive.com/news/business/devon-firm-works-white-house-1207030", "country": "GB", "title": "Devon firm that works for the White House is paying for staff degrees and house deposits", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-13T15:11:00.000+02:00", "replies_count": 0, "uuid": "2b6607f2b1840c03f964ec5a3e4b1052115b3e43"}, "author": "Hannah Finch", "url": "https://www.devonlive.com/news/business/devon-firm-works-white-house-1207030", "ord_in_thread": 0, "title": "Devon firm that works for the White House is paying for staff degrees and house deposits", "locations": [], "entities": {"persons": [{"name": "appleg", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "stuart brocklehurst", "sentiment": "none"}], "locations": [{"name": "bristol", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "barnstaple", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}], "organizations": [{"name": "white house", "sentiment": "none"}, {"name": "applegate marketplace", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Devon firm that works for the White House is paying for staff degrees and house deposits Applegate Marketplace has six workplace degree staff members and is giving them up to £10,000 to help them get on the housing ladder Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nA pioneering Devon company has pledged to give thousands to help its employees get on the housing ladder and it is urging other businesses to do the same. \nOnline procurement website, Applegate Marketplace, based in Barnstaple and Plymouth is match funding up to £10,000 for its degree placement staff saving up for a deposit on a home. \nIt is part of plans to reverse the brain drain from the region to Bristol, London and beyond. \nChief Executive Stuart Brocklehurst, 44, said: “The South West has low rates of talent retention because people leave in search of jobs and then don’t come back until later life or to start a family but we want to change that.” Read More Devon firm forges ahead with AI plans saying there's nothing to fear from the 'rise of the robots' \nThe First Rung scheme is open to staff on Applegate’s work-placed degree programme. \nOn completing the course they receive a BSc (Hons) in Business and Management, and two professional qualifications: MCIM (Member of the Chartered Institute of Management) and CMgr (Chartered Manager). \nIt has six placements for people who may not otherwise have considered a degree level, put off by the classroom or can’t afford student debt. Read More \nStuart said: “If you are going off to do a residential degree course you are facing a £55,000 debt or more. \nBut with our programme you have no student debt and are paid to study. \n“Plus with our scheme, if they put their pay rises aside we match that to help get on the housing ladder in Devon. \n“So that can mean at 23 years -old you can have a mortgage on a two-bed terrace in Barnstaple or a flat by the sea in Ilfracombe, have a job, a degree and no student debt, that’s quite an attractive proposition. \nAt the moment, Applegate has six of 2,000 staff across the UK on the work placed degrees and is the only company match-funding for a house deposit. \nStuart said: “I would love there to be more businesses getting involved in this. \n“Of course there is nothing wrong with a residential degree but it’s not for everyone and if this allows people to make a career here and afford to live in the South West without student debt then that’s a great start.” \nAnd staying in Devon does not mean career suicide, he insists. \nFormed as an early internet business in 1996, Applegate Marketplace has evolved to become a major online procurement site allowing global businesses and governments to find suppliers for everything they need from office furniture and spare parts for nuclear subs to loo rolls. \nIt has 153,000 suppliers in the database, who pay a subscription to be listed and the service is free for the buyer. \nIt is used in 100 countries with 45% of business in the UK and 55% worldwide. \nThat’s not a bad reach from offices on an industrial estate in Barnstaple. \nStuart described its beginnings as an online yellow pages but a £2million investment in tech last year has grown the service, allowing the company to gather quotes from a number of suppliers. \nIt now employs 55 staff. \nHe explained: “We have a great store of data after 20 years in business so it made sense to build the service around that.” \nApplegate recently won a prestigious grant from Innovate UK to develop Artificial Intelligence systems which will enable it to process far higher volumes of transactions. What is AI? \nAccording to Wikipedia ,Artificial intelligence (AI, also machine intelligence, MI) is intelligence displayed by machines, in contrast with the natural intelligence ( NI ) displayed by humans and other animals. \nIn computer science, AI is any device that perceives its environment and takes actions that maximise its chance of success at some goal. \nThe term artificial intelligence is applied when a machine mimics cognitive functions that we associate with the human mind, such as learning and problem solving. \nCapabilities generally classified as AI as of 2017 include successfully understanding human speech like Amazon's Alexa,competing at a high level in games of strategy like chess, autonomous cars and interpreting complex data, including images and videos. \nApplegate is working with the University of Exeter’s Machine Learning team, headed by Professor Richard Everson, on the development. \nStuart said: “A constraint on our growth is the checking process which is done by our staff at the moment. \nIf we can involve AI, we can deal with any volume of capacity then we will be able to turbo charge our business.” \nApplegate counts huge organisations among its buyers including NATO, US Navy, Ministry of Defence, Cabinet Office and the National University of Mongolia. \nBut the most high profile has to be the White House. \nStuart said: “I was sitting in our office in Barnstaple when the White House popped onto the screen, I thought: ‘Oh come on, you’re having a laugh, I really could not believe it at first.” Read More Devon digital learning company expands into Dublin as Brexit looms \n“It seems incredible that we could reach such organisations from Barnstaple but why not? We have very good broadband, we have access to great machine learning expertise at the universities of Exeter and Plymouth and office space is £5.70 a sq ft for office space rather than £130 a sq ft for offices that it used to cost when I worked in St James’, London. Why would we want to be in a city where your staff are exhausted with travelling before they even get to work?” Stuart Brocklehurst and workplace degree student Jo Nanceckivell \nStuart did his fair share of city working and more besides. \nGraduating from Oxford in theology, he went straight into banking and was part of a group that introduced Visa 3D secure technology. \nUnder contract to the US Treasury, he dodging bullets in Baghdad at the end of the second Gulf war in 2003 before working as a communications director for a tech firm in Madrid in 2010. \nThroughout his travels, he had a permanent home in North Devon but did not expect to find a role that would mean he could also work locally. \nIn 2014, he was approached to become a non-executive director of Applegate and soon became chief executive and major shareholder. \nHe said: “In past jobs, the outcome was making rich people richer than they were before. \n“Now, we can create real opportunities for people and get them on the housing ladder. It makes it much more real and fulfilling.” Like us on Facebook ", "external_links": [], "published": "2018-02-13T15:11:00.000+02:00", "crawled": "2018-02-13T16:30:14.002+02:00", "highlightTitle": ""}