{"organizations": [], "uuid": "a952e4aad1f4c87fd2afbd9358aa9bfbd3e31183", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article1277222.ece/ALTERNATES/s1200/May-and-Corbyn.jpg", "site_section": "http://www.leicestermercury.co.uk/rss.xml", "section_title": "leicestermercury - frontpage", "url": "https://www.leicestermercury.co.uk/news/leicester-news/jeremy-corbyn-theresa-send-messages-1277109", "country": "GB", "domain_rank": 48128, "title": "Jeremy Corbyn and Theresa May send messages to victims of Leicester explosion at Prime Minister's Questions", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-28T18:25:00.000+02:00", "replies_count": 0, "uuid": "a952e4aad1f4c87fd2afbd9358aa9bfbd3e31183"}, "author": "Jacob Jarvis", "url": "https://www.leicestermercury.co.uk/news/leicester-news/jeremy-corbyn-theresa-send-messages-1277109", "ord_in_thread": 0, "title": "Jeremy Corbyn and Theresa May send messages to victims of Leicester explosion at Prime Minister's Questions", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "jeremy corbyn", "sentiment": "negative"}, {"name": "corbyn", "sentiment": "none"}], "locations": [{"name": "leicester", "sentiment": "none"}], "organizations": [{"name": "house of commons", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Jeremy Corbyn and Theresa May send messages to victims of Leicester explosion at Prime Minister's Questions 'We should commend the activities and the work of the emergency services who day in day out do so much for all of us.' Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nJeremy Corbyn and Theresa May have both expressed condolences to those impacted by the recent fatal explosion in Leicester. \nBoth the Prime Minister, and leader of the opposition have also praised the emergency services dealing with the incident. \nTheir messages came at the start of today’s Prime Minister’s Questions, where the Labour leader addressed the incident before asking his first question to his Conservative counterpart. \nAddressing the PM and the House of Commons, Mr Corbyn said: “I hope the whole House will join me in passing our deepest condolences to the families of the people who died and those injured in the explosion in Leicester . \n“Could we say thank you to all the emergency services and hospital staff who worked to save lives in that terrible situation.” Read More Leicester explosion updates: Tributes to people missing since blast as investigation continues \nHe then asked the Prime Minister about her stance on Brexit and Britain’s relationship with the European Union. \nBefore answering this question, she said: “Can I first of all say to the right honourable gentleman that I join him and I’m sure the whole House in expressing our condolences to the family and friends of those who lost their lives in the explosion in Leicester. \n“I also agree with him that we should commend the activities and the work of the emergency services who day in, day out do so much for all of us. But in circumstances like that, really showed the great job that they do.” Prime Minister Theresa May outside Downing Street Labour leader Jeremy Corbyn \nMr Corbyn had previously shared a message on Twitter in the wake of the incident. \nWriting the day after the incident, he said: “My thoughts are with the families of the four people who died and those injured in yesterday's explosion in Leicester. Thank you to the emergency services who are still on the scene and hospital staff who are working to save lives.” Read More ", "external_links": [], "published": "2018-02-28T18:25:00.000+02:00", "crawled": "2018-02-28T18:47:26.001+02:00", "highlightTitle": ""}