{"organizations": [], "uuid": "2f632cdcb0dc73eac68956d42bff3cc919cb3f10", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14240765.ece/ALTERNATES/s1200/Lord-Adonis-Durham-City-Station.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/lord-adonis-east-coast-main-14240645", "country": "GB", "domain_rank": 21960, "title": "Lord Adonis on East Coast Main Line: 'Government is bailing out millionaires'", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-02T21:38:00.000+02:00", "replies_count": 0, "uuid": "2f632cdcb0dc73eac68956d42bff3cc919cb3f10"}, "author": "Sean Seddon", "url": "https://www.chroniclelive.co.uk/news/north-east-news/lord-adonis-east-coast-main-14240645", "ord_in_thread": 0, "title": "Lord Adonis on East Coast Main Line: 'Government is bailing out millionaires'", "locations": [], "entities": {"persons": [{"name": "andrew adonis", "sentiment": "negative"}, {"name": "virgin", "sentiment": "none"}, {"name": "phil wilson", "sentiment": "none"}, {"name": "adonis", "sentiment": "none"}, {"name": "gordon brown", "sentiment": "none"}], "locations": [{"name": "east coast", "sentiment": "none"}, {"name": "durham city railway station", "sentiment": "none"}, {"name": "durham city railway sta", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}], "organizations": [{"name": "sedgefield", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "stagecoach", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}, {"name": "network rail", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Lord Andrew Adonis visits Durham City Railway Station to talk about the East Coast bailout (Image: Newcastle Chronicle) Share Get daily   \nLord Andrew Adonis has slammed the Government for its running of the long-troubled East Coast Main Line. \nSpeaking on a visit to Durham, the former Labour minister repeated his accusation that Government ministers are “bailing out” the private firms currently operating it. \nHe dramatically resigned his role as the Government ’s infrastructure tsar in December with a furious attack on the policy and its Brexit approach. \nDuring his time as a minister in Gordon Brown’s Government, Adonis was pivotal in taking the franchise back into public hands following Network Rail ’s disastrous tenure running the service. \nIt was re-privatised in 2015 and run jointly by Virgin and Stagecoach but the Government has announced they will replace the contract ahead of time, effectively releasing the firms from their obligation to repay the entirety of the £3.3bn they pledged to the Treasury. Lord Andrew Adonis with Sedgefield MP Phil Wilson at Durham City Railway Station (Image: Newcastle Chronicle) \nStagecoach have previously admitted they overbid for the franchise and confirmed it was seeking improved terms to boost the profitability of the line. \nA Department for Transport spokesperson denied the move amounts to a bailout and says the post-2020 partnership which will replace the current arrangement will improve the service. \nSpeaking outside Durham train station, Lord Adonis said: “Bailing out Richard Branson and Brian Souter will cost taxpayers hundreds of millions of pounds. \n“That money could have been spent on improving infrastructure like opening new rail lines such as the Leam Side line which is desperately needed here to relieve congestion. \n“Instead, all of this money is going into the coffers of two of the richest companies in the world, Virgin and Stagecoach, and I think that’s a huge mistake. \n“Over time I hope we can reverse it because I think it’s in the public interest that a public company takes over the East Coast Main Line. \n“What I hoped would happen in 2009 is that the successful new company would be able to bid for new franchises. \n“It got a big vote of confidence from passengers who loved it, it had really efficient fares and it returned a big dividend to the taxpayer. Read More Transport for the North unveil 30-year, £69bn road and rail plan - plus a 'Northern Oyster card' \n“In 2010, the Government reversed the decision to allow it to bid for new contracts - ironically, they replaced it with the current franchise which is now defaulting. \n“That’s a huge tragedy for the travelling public, it will cost taxpayers hundreds of millions of pounds but I’m still hopeful it can be reversed.” \nHowever, he stopped short of fully endorsing Labour leader Jeremy Corbyn’s proposal to nationalise rail services across the board, instead proposing a more mixed model. \nHe said: “I take it a stage at a time. Failing franchises like the East Coast Main Line, where you have companies proposing to walk away from billions of pounds worth of commitments to taxpayers, should certainly be taken back into public hands. \n“What I would like is to allow successful public companies to bid for new contracts. \n“I think they should bid in a level playing field with private companies and see who offers the best deal for the taxpayers.” \nThe National Audit Office has confirmed it will investigate the impact of the planned changes on the public finances. \nA DfT spokesperson said: “The Government has been very clear - no one is getting a bailout and Virgin Stagecoach will continue to meet its financial commitments made to the taxpayer on the East Coast rail franchise, as it has done since 2015. \n“Premium payments continue to flow to the taxpayer, as they currently do, and any suggestion that the taxpayer will be out of pocket is completely wrong. \n“Stagecoach has also – on average - paid 20% more back to the taxpayer than when the line was operated by Directly Operated Railways and we continue to receive hundreds of millions of pounds. \n“The decision to bring in a partnership to run the service from 2020 is to ensure the train companies work more closely with those responsible for the infrastructure like the track and signalling to help improve the service for passengers.” Like us on Facebook", "external_links": [], "published": "2018-02-02T21:38:00.000+02:00", "crawled": "2018-02-02T21:41:19.022+02:00", "highlightTitle": ""}