{"organizations": [], "uuid": "c67aa56ff10c0166565b23493315a44ac29f3a16", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14246514.ece/ALTERNATES/s1200/Homebase-sale.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/homebase-puts-2000-jobs-risk-14246479", "country": "GB", "domain_rank": 21960, "title": "Homebase puts 2,000 jobs at risk with plans for up to 40 store closures", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-05T12:13:00.000+02:00", "replies_count": 0, "uuid": "c67aa56ff10c0166565b23493315a44ac29f3a16"}, "author": "Agency Staff", "url": "https://www.chroniclelive.co.uk/business/business-news/homebase-puts-2000-jobs-risk-14246479", "ord_in_thread": 0, "title": "Homebase puts 2,000 jobs at risk with plans for up to 40 store closures", "locations": [], "entities": {"persons": [{"name": "blyth", "sentiment": "none"}, {"name": "rob scott", "sentiment": "none"}, {"name": "alnwick", "sentiment": "none"}], "locations": [{"name": "gateshead", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "auckland", "sentiment": "none"}, {"name": "hexham", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "business homebase", "sentiment": "negative"}, {"name": "homebase", "sentiment": "negative"}, {"name": "bunnings uk", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "berwick", "sentiment": "none"}, {"name": "wesfarmers", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Homebase puts 2,000 jobs at risk with plans for up to 40 store closures New owners of the chain, which has eight sites in the North East, are planning a huge cost-cutting programme Share A Homebase store (Image: PA) Share Get business   Thank you for subscribing!   \nNearly 2,000 Homebase staff could be axed after the DIY chain’s Australian owner launched a review of the business that may see up to 40 stores shut. \nWesfarmers, which owns Homebase’s parent firm Bunnings UK, said on Monday that trading at the chain has been “poor” as it booked a £454m impairment charge linked to its acquisition of the retailer. \nHomebase has eight stores in the North East, with sites in Newcastle , Gateshead, Hexham, Alnwick, Berwick, Blyth , Bishop Auckland and Washington . \nWesfarmers managing director Rob Scott said: “The Homebase acquisition has been below our expectations which is obviously disappointing. \n“In light of this, a review of Bunnings UK has commenced to identify the actions required to improve shareholder returns.” \nThe group later confirmed that between 20 and 40 of the worst performing Homebase stores could close down in the latest sign of distress on the British high street. \nHomebase operates from 250 stores and employs 12,000 in total in the UK. \nPoor trading at Homebase is expected to drag Bunnings into an underlying loss of £97m for the first half of the year, Wesfarmers confirmed. \n“We need to address underperformance in our portfolio that is detracting from positive performance in other areas, and the announcement today sets out decisive actions to achieve this,” Mr Scott added. Read More North East businesses urged to tap into new markets by joining the space race \nBunnings acquired Homebase in 2016 in a £340m deal and has been attempting to reposition the brand. \nAs well as revamping the stores and slashing prices, Homebase is in the process of being rebranded as Bunnings. \nBut Wesfarmers said that its review will evaluate the performance of rebranded pilot stores to “inform the future plans for Bunnings UK”. \nIn addition Peter “PJ” Davis, the man who spearheaded the foray into the UK, is to retire from the business with Damian McGloughlin taking his place. Read More Major Hexham employer Egger UK invests £19m to boost capacity \nThe potential store closures come following a miserable January for the high street, which has seen thousands of jobs disappear after Sainsbury’s, Tesco and Morrisons also swung the axe. \nRetailers have been hit by a surge in Brexit-fuelled inflation, which has seen the cost of goods rocket and consumer confidence plummet since the referendum result. Like us on Facebook", "external_links": [], "published": "2018-02-05T12:13:00.000+02:00", "crawled": "2018-02-05T12:22:49.000+02:00", "highlightTitle": ""}