{"organizations": [], "uuid": "1a28854f2197680072d12797de7fc40f0eb3480a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.derbytelegraph.co.uk/incoming/article1274353.ece/ALTERNATES/s1200/Maplin-gv.jpg", "site_section": "", "section_title": "", "url": "https://www.leicestermercury.co.uk/whats-on/shopping/maplin-administration-uk-job-losses-1274361", "country": "GB", "domain_rank": 48128, "title": "2,500 jobs at risk as electronics store Maplin falls into administration - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.929, "site_type": "news", "published": "2018-02-28T12:11:00.000+02:00", "replies_count": 0, "uuid": "1a28854f2197680072d12797de7fc40f0eb3480a"}, "author": "Oliver Astley", "url": "https://www.leicestermercury.co.uk/whats-on/shopping/maplin-administration-uk-job-losses-1274361", "ord_in_thread": 0, "title": "2,500 jobs at risk as electronics store Maplin falls into administration - Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "maplin", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}], "organizations": [{"name": "st george", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "2,500 jobs at risk as electronics store Maplin falls into administration Talks with potential buyers have not succeeded Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nStricken electronics retailer Maplin, which has an outlet at the St George's retail park, has called in administrators. \nThis puts 217 stores and some 2,500 jobs at risk in the UK. \nIts stores have been experiencing falling profits as consumers switch to online shopping. \nThe weaker pound caused by the Brexit vote and problems raising new capital were cited by bosses as a contributing factor to the firm's failure. \nAdministration means insolvency experts will take over the running of the business and seek to sell off assets to achieve the best deal for those owed money by Maplin. \nThe outcome for stores and employees is unclear but a significant number of job losses are likely unless a buyer decides to take on the stricken business and retain some of Maplin's 217 branches. Read More Toys R Us has fallen into administration \nConsultancy firm PricewaterhouseCoopers (PwC) will handle any administration process and subsequent sale. \nGraham Harris, the company's chief executive, said: \"I can confirm this morning that it has not been possible to secure a solvent sale of the business and as a result we now have no alternative but to enter into an administration process. \n\"During this process Maplin will continue to trade and remains open for business.\" \nHe added that the retailer has been struggling to mitigate the impact of the pound's devaluation post the Brexit vote, a weak consumer environment and the withdrawal of credit insurance. Read More Leicestershire Innovation Week: County to shine spotlight on hi-tech achievements \n\"This necessitated an intensive search for new capital that in current market conditions has proved impossible to raise. \n\"These macro factors have been the principal challenge, not the Maplin brand or its market differentiation,\" Mr Harris added. \nEdinburgh Woollen Mill, run by retail billionaire Philip Day, had been touted as a potential rescuer for Maplin. \nBut talks are thought to have broken down, leaving Rutland no alternative but to call in administrators. Read More How to use your smartphone to manage your finances - and save hundreds of pounds \nHigh street chains across the board have been hit hard by falling consumer spending, soaring inflation and competition from online rivals. \n\"We believe passionately that Maplin has a place on the high street, and that our trust, credibility and expertise meets a customer need that is not supported elsewhere,\" the chief executive insisted. Like us on Facebook ", "external_links": [], "published": "2018-02-28T12:11:00.000+02:00", "crawled": "2018-02-28T13:23:57.003+02:00", "highlightTitle": ""}