{"organizations": [], "uuid": "79c5e010fe6568b408aba8fe0e3c0d052da515e7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14266015.ece/ALTERNATES/s1200/Prof-on-Brexit.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/leading-newcastle-university-cancer-professor-14265905", "country": "GB", "domain_rank": 21960, "title": "Leading Newcastle University cancer professor leaves the UK - citing Brexit fears", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-09T07:00:00.000+02:00", "replies_count": 0, "uuid": "79c5e010fe6568b408aba8fe0e3c0d052da515e7"}, "author": "Sean Seddon", "url": "https://www.chroniclelive.co.uk/news/north-east-news/leading-newcastle-university-cancer-professor-14265905", "ord_in_thread": 0, "title": "Leading Newcastle University cancer professor leaves the UK - citing Brexit fears", "locations": [], "entities": {"persons": [{"name": "leer", "sentiment": "none"}, {"name": "david charlton photography", "sentiment": "none"}, {"name": "josef vormoor", "sentiment": "none"}, {"name": "prof vormoor", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "netherlands", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "newcastle university", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "utrecht", "sentiment": "none"}, {"name": "northern institute for cancer research", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nA leading Newcastle University scientist, who has pioneered cancer treatments for children, has shared his Brexit fears as he prepares to leave the UK. \nProfessor Josef Vormoor has left his role with the Northern Institute for Cancer Research after three years as director and 12 years working at the university. \nThe highly respected 54-year-old from Leer, Germany, is swapping the North East for Utrecht to take up a role at Netherlands’ national cancer centre. \nWhile he says his mind was ultimately made up by the allure of a new opportunity, Prof Vormoor admits the UK’s departure from the EU was on his mind. Leading cancer professor Josef Vormoor leaves UK (Image: David Charlton Photography) \nHe said: “I have always thought of myself as a European first and a German second and it’s about much more than economics for me - I believe we are stronger together and the EU has produced decades of peace and stability. \n“It’s hard to predict but I think the evidence shows a hard Brexit will hurt the economy and it will have a knock-on effect in how scientific research in funded. \n“The worst thing is the lack of clarity. We still don’t know what the country will look like or what status Europeans living in the UK will have.” \nThere have been dire warnings from some in the science industry about the effect Brexit could have on research funding and attracting the brightest minds. \nAnd Prof Vormoor warned it was almost inevitable there would be negative consequences for universities and hospitals in the short term. \nHe said: “Recruiting doctors and scientists from Europe is going to be more difficult and I expect the funding situation to become tougher. \n“There hasn’t been a mass exodus from the North East’s science community yet but people are concerned and watching what is happening. poll loading Which way would you vote if there was a second referendum? 3000+ VOTES SO FAR Leave Remain \n“I still think people will come to work in this country’s universities and hospitals in the long term because they’re fantastic but there’s going to be a difficult period in the short term because of the lack of certainty. \n“Scientific research is a global community. The majority of clinical trials to treat cancer in children I’ve been involved with have been cross-border because there simply haven’t been enough patients here to test treatments on. \n“I really hope this continues to be possible but we don’t know if that will be the case.” \nGovernment analysis of three different versions of post-Brexit deals show the North East suffering disproportionately, with a 16% drop in the region’s economic output in a ‘no deal’ scenario. \nWhile some dispute the figures, Prof Vormoor said he hopes the decision can be reversed to stop the region being hit. \nHe said: “I still have a glimmer of hope Brexit isn’t going to happen. Read More At last the truth: Brexit will devastate North East economy, leaked Government paper shows \n“People were lied to, people didn’t vote for a hard Brexit and we still haven’t seen our £350m a week extra for the NHS. \n“I don’t feel like I’ve been pushed out of the country and I cherish the university and the North East, but I worry for the future of both.” \nProf Vormoor will be replaced as director of cancer research by Professor Steve Clifford, an appointment described as “fantastic” by Prof Vormoor. \nA Newcastle University spokesperson said: “Firstly, we would like to take this opportunity to thank Prof Vormoor for his outstanding work at the university and we wish him all the best for the future. \n“We know the EU referendum decision has caused great uncertainty as we employ many diverse nationalities in our community. Read More The North East areas which could pay the highest price for Brexit \n“The UK is a major beneficiary of the EU’s support for research and we continue to prioritise securing opportunities for our researchers and students to access vital pan-European programmes and build new global networks. \n“We remain unswerving in our commitment to a continuation of substantial numbers of European and international staff and students as we support and value all their contribution.” Like us on Facebook ", "external_links": [], "published": "2018-02-09T07:00:00.000+02:00", "crawled": "2018-02-09T11:12:57.002+02:00", "highlightTitle": ""}