{"organizations": [], "uuid": "ca1d9db9585f22dde98cdb2ec3f70840d2c0b99e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article9597649.ece/ALTERNATES/s1200/JS39638562.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/newcastle-residents-set-face-5-14287027", "country": "GB", "domain_rank": 21960, "title": "Newcastle residents set to face 5% council tax increase for a second year", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-14T13:00:00.000+02:00", "replies_count": 0, "uuid": "ca1d9db9585f22dde98cdb2ec3f70840d2c0b99e"}, "author": "Laura Hill", "url": "https://www.chroniclelive.co.uk/news/north-east-news/newcastle-residents-set-face-5-14287027", "ord_in_thread": 0, "title": "Newcastle residents set to face 5% council tax increase for a second year", "locations": [], "entities": {"persons": [{"name": "tyne", "sentiment": "none"}], "locations": [], "organizations": [{"name": "news newcastle", "sentiment": "negative"}, {"name": "newcastle", "sentiment": "negative"}, {"name": "newcastle city counci", "sentiment": "negative"}, {"name": "newcastle city council", "sentiment": "none"}, {"name": "wear archives & museums", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Newcastle residents set to face 5% council tax increase for a second year Newcastle City Council has to save £13m but leader assures the authority is a long way off going bust Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nNewcastle residents will see their council tax bills hiked by 5% for a second year as the council grapples with yet more savings. \nIn an all too familiar announcement the authority has proposed to increase council tax by 3% with a further 2% rise applied to pay for adult social care, meaning bills will go up by 5% \nDespite the income increase from taxpayers, grants from central government continue to fall and the authority will still have to make £13m of savings. \nAround 40 jobs will be cut from the council, though the authority says that many of these are already vacancies. \nTo make savings Newcastle City Council are proposing to: Save £141,640 by funding the city’s Christmas lights from sponsorship Cut its contribution to Tyne and Wear Archives & Museums by £150,000 Increase garden waste charges from £1 to £2 per collection Reduce its contribution to NewcastleGateshead Initiative by £40,000 Save £2.6m by developing new ways of caring for adults with complex needs Read More Newcastle to get a £1million 'spring clean' ahead of the Great Exhibition of the North \nThis comes as the first UK council went bust in 20 years. \nTory-run Northamptonshire council issued a section 114 notice, effectively going bust last week, though Newcastle City Council’s leader Nick Forbes said that will not happen to Newcastle. Nick Forbes speaks at a devolution event (Image: Newcastle Chronicle) \nHe said: “Although the money we have to save next year is smaller than in previous years no one should underestimate the scale of the task that we face. \n“Six years ago I warned that councils could go bust if the Government did not ease up on austerity. \n“Northamptonshire County Council has now been forced to announce that it doesn’t have enough money to meet its expenditure – the first time this has happened in over 20 years. \n“I can assure the residents of Newcastle that thanks to good financial management, this council is in a much stronger position, because we have looked into the future and had an honest and open conversation with our communities and partners about how we could keep facilities and services going in the face of deep and unfair cuts.” (Image: Newcastle City Council) \nDespite the economic uncertainty the council has proposed £370m of investment in the city including; The construction of 1,000 affordable new homes 150 specialist homes for older people and those with disabilities and complex needs Hosting the Great Exhibition of the North in 2018 which will give a huge economic boost to the city Read More Newcastle City Council's website caught up in global cyber attack that hit NHS and US court \nThough the authority is not out of the woods yet, and warn there will be a further £15m of savings in 2019/20. \nCoun Forbes added: “These challenges will continue as we struggle with public sector pay, welfare reform and the uncertainty of Brexit. \n“The future will be tough, but we have a plan to continue to invest in skills, jobs and housing so we can grow our economy.” \nThe report will go before the city council’s cabinet on February 19. If the report is approved, it will go forward to be debated at full council on March 7 when a budget is expected to be set for 2018/19. Like us on Facebook", "external_links": [], "published": "2018-02-14T13:00:00.000+02:00", "crawled": "2018-02-14T14:00:38.015+02:00", "highlightTitle": ""}