{"organizations": [], "uuid": "25236c09f913b37141816f97ac221988deca49a4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14274564.ece/ALTERNATES/s1200/TMP_NEC_070218Spruce06JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/transport-north-boss-hits-back-14274351", "country": "GB", "domain_rank": 21960, "title": "Transport for the North boss hits back at criticism and sets out vision to transform the region", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-12T10:00:00.000+02:00", "replies_count": 0, "uuid": "25236c09f913b37141816f97ac221988deca49a4"}, "author": "Sean Seddon", "url": "https://www.chroniclelive.co.uk/news/north-east-news/transport-north-boss-hits-back-14274351", "ord_in_thread": 0, "title": "Transport for the North boss hits back at criticism and sets out vision to transform the region", "locations": [], "entities": {"persons": [{"name": "jonathan spruce", "sentiment": "none"}, {"name": "john prescott", "sentiment": "none"}], "locations": [{"name": "newcastle", "sentiment": "none"}], "organizations": [{"name": "news transport", "sentiment": "positive"}, {"name": "newcastle share click", "sentiment": "none"}, {"name": "transport", "sentiment": "none"}, {"name": "tfn", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Transport for the North boss hits back at criticism and sets out vision to transform the region Jonathan Spruce, the body's strategy director, responded to angry comments by John Prescott ahead of an event in Newcastle Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe man responsible for overseeing the North’s transport vision for the next 30 years insists the region will get a “real voice” as he responded to criticisms the body was a “bloody fraud”. \nJonathan Spruce, the strategic director of Transport for the North (TfN) set out his hopes ahead of a consultation event in Newcastle where the ambitious long-term vision was put to the public. \nLast month, TfN unveiled its central document, encompassing three decades worth of rail and road improvements with a view to rebalancing the nation’s economy. Jonathan Spruce strategy director for Transport for the North (Image: newcastle chronicle) \nMr Spruce, 47, knows the North East well, having worked on what eventually became the Tees Valley devolved authority, and believes it will have a transformative effect on the region’s industry. \nBut some, most notably former deputy Prime Minister John Prescott, weren’t convinced by the announcement. \nHe angrily told the BBC on January 16 that, as it doesn’t have statutory powers or its own money, it amounts to a “bloody fraud”. \nResponding to those comments and more general criticism, Mr Spruce said: “The North has never had this sort of collaboration before so don’t decry that. \n“People compare TfN to Transport for London (TfL) and say we’ve not got this power or that power but that misses the point. \n“When TfL started, or similar bodies in Scotland and Wales, they had a lot less than they have now. \n“Devolution is a two-way street and you have to prove yourself - it would be a very brave central Government department that gave everything away at once. General view of Central Station, Newcastle (Image: Newcastle Chronicle) \n“If we can show we can work together and make clear recommendations and get results in terms of job creation, that makes our argument that we should have more powers in the future stronger. \n“What Prescott was saying was laudable to the extent he wants TfN to have more powers but people who criticise us need to understand this is a first step, not a final step.” \nAmong the plans for the North East are to connect it to Northern Powerhouse Rail, an improvement strategy which will link the region’s largest cities and eventually see train journeys between Newcastle and Liverpool cut from well over three hours down to two. \nA smart-ticketing system for the North, which will allow passengers to move around the region with one pass, is another headline TfN policy and the roll-out is planned to start this year. Read More Transport for the North: what is it, what will it do and what does it means for you? \nBut it’s been a long process to get every North East authority around the table on transport investment. \nMr Spruce admits a culture of competitiveness and a lack of cooperation has hindered the region in the past but he believes TfN can provide a forum to put that in the past. \nHe said: “There was a general feeling that each city in the North could be the ‘top dog’ but as time has gone on we’ve realised there’s no point in us all fighting each other. \n“We’ve seen examples around Europe where cities have come together and developed regional strategies and experienced growth together rather than trying to make it happen separately. \n“The South East is overheating and it can’t go on - if the UK is to prosper post-Brexit then the North needs to grow. \n“The point of it is to give the North a real voice so we can tell Government what our transport needs are. Read More Transport for the North unveil 30-year, £69bn road and rail plan - plus a 'Northern Oyster card' \n“Every five years we make our recommendations and set out our priorities for the region and they’re duty bound to listen to us and explain why if they don’t accept our plans. \n“But this has never just been about transport - we start with ultimate goal of growing the economy and creating jobs and work backwards.” \nA public consultation on the 30-year plan will run until April 17.​ Like us on Facebook", "external_links": [], "published": "2018-02-12T10:00:00.000+02:00", "crawled": "2018-02-12T10:51:57.002+02:00", "highlightTitle": ""}