{"organizations": [], "uuid": "0894d92a91c9a2a7be01bbb05d114d923782415b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14239001.ece/ALTERNATES/s1200/CBP_NEC_041217CHINESE11.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/new-city-wide-centre-help-14238783", "country": "GB", "domain_rank": 21960, "title": "New city-wide centre to help hundreds of Newcastle pupils learn Mandarin Chinese", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-03T18:00:00.000+02:00", "replies_count": 0, "uuid": "0894d92a91c9a2a7be01bbb05d114d923782415b"}, "author": "Hannah Graham", "url": "https://www.chroniclelive.co.uk/news/north-east-news/new-city-wide-centre-help-14238783", "ord_in_thread": 0, "title": "New city-wide centre to help hundreds of Newcastle pupils learn Mandarin Chinese", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "none"}, {"name": "hibah aslam", "sentiment": "none"}, {"name": "erin bryce", "sentiment": "none"}, {"name": "vicky wu", "sentiment": "none"}, {"name": "liz urwin", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "st cuthbert", "sentiment": "none"}, {"name": "nhsg", "sentiment": "none"}, {"name": "british council", "sentiment": "none"}, {"name": "catholic high school", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}, {"name": "newcastle high school for girls", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nPupils across Newcastle will have the chance to learn Chinese, thanks to a new city-wide initiative. \nAccording to a British Council report published in November, the UK will be in desperate need of foreign language speakers after Brexit, with Mandarin Chinese ranked as the second most needed global language. \nThe Swire Chinese Language centre aims to ensure Newcastle schoolchildren have the opportunity to learn the vital skill, sending Chinese teachers out to schools across the city. So far, 450 pupils from 12 different primary and secondary schools are signed up, with plans to add 10 more schools to the initiative by next year. Teacher Vicky Wu takes the class at St Cuthbert's Catholic High School in Newcastle (Image: Newcastle Chronicle) \nThe centre was launched at the start of this school year Newcastle High School for Girls (NHSG) and St Cuthbert’s Catholic High School. \nNHSG pupils Liz Urwin, 14, Hibah Aslam, 14, and Erin Bryce, 13, were among the first to sign up for the classes. Read More 'Deep injustice at the heart of education system' revealed - with North East children missing out \nErin said: “I wanted to do it because I thought it was something that would be really useful for the future - we study French and German but this was a great opportunity, not everyone gets to study Mandarin at school.” Liz, who hopes to take the language at GCSE level said classes had proved interesting - and not as daunting as some might have feared. \nHibah added: “It’s not quite as hard as you might think, though the reading and writing are quite difficult because there are a lot of different characters. I feel like we’ve already learned a lot of the basics, we’re at a good starting point already.” Pupils from St Cuthbert's Catholic High School in Newcastle have been given to opportunity to have Chinese lessons. Teacher Vicky Wu takes the class (Image: Newcastle Chronicle) \nNHSG headmistress Hilary French said: “This is a very exciting opportunity to share our passion for language learning with our local educational partners, here in the North-East. \n“We recognise the importance of studying Chinese and we are providing future generations with valuable language skills that will enable them to maximise their career potential in the global economy.” Read More Why your child will need to learn Mandarin and Arabic after Brexit \nCarol Davison, head of St Cuthbert’s Catholic High School, added: “The Swire Chinese Language Centre Newcastle opens up a fantastic opportunity for local students to learn a language that is not taught as widely as others. \n“We are excited to pioneer this initiative and we would love to hear from primary and secondary schools across the North-East that would like to get involved.” Like us on Facebook", "external_links": [], "published": "2018-02-03T18:00:00.000+02:00", "crawled": "2018-02-03T18:53:20.079+02:00", "highlightTitle": ""}