{"organizations": [], "uuid": "d029354d45490953473e556c489ed0139e84b03c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article12008248.ece/ALTERNATES/s1200/JS41234350.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/local-news/north-east-news-live-updates-14258593", "country": "GB", "domain_rank": 21960, "title": "North East news LIVE: Latest breaking news, sport, weather, traffic and travel", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-08T08:30:00.000+02:00", "replies_count": 0, "uuid": "d029354d45490953473e556c489ed0139e84b03c"}, "author": "Katie Dickinson", "url": "https://www.chroniclelive.co.uk/news/local-news/north-east-news-live-updates-14258593", "ord_in_thread": 0, "title": "North East news LIVE: Latest breaking news, sport, weather, traffic and travel", "locations": [], "entities": {"persons": [], "locations": [{"name": "central station", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "neville street", "sentiment": "none"}], "organizations": [{"name": "met office", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "\nThe fire has now been extinguished 13:14 Door staff tried to resuscitate Durham University student \nDurham Police have released more details about the circumstances of the young woman’s death. \nThey say officers were called to the Walkergate area of the city at about 11.50pm following reports of a student on the floor outside of the night club. \nWhen officers arrived, the student was being resuscitated by door staff before the ambulance service continued attempts to revive her. Unfortunately, she was pronounced dead at the scene. 12:45 Durham University 'shocked and saddened' by student death \nOwen Adams, Pro-Vice Chancellor Colleges and Student Experience, said: \nWe are extremely shocked and saddened by the death of a Durham University student in Durham City last night. \nWe are offering support to students and staff. \nOur thoughts are with the student’s family and friends at this very difficult time. \nWe are unable to comment further on what is an ongoing police investigation. \nFollow updates from the scene here . 12:21 Do you know these men? \nPolice have released CCTV footage of four men they want to trace after a man was knocked unconscious and robbed in Newcastle city centre. \nThe incident happened on Ellison Place, near Northumbria University’s Newcastle city campus, on Sunday, January 21, at about 12.30am. \nPolice say five offenders approached a 27-year-old man, knocking him unconscious and stealing his phone from his pocket. \nThe victim suffered minor facial injuries, and was left shaken by the incident. \nOfficers are carrying out enquiries into the incident and are appealing for the men pictured to get in contact. \nThey were in the area at the time and may have information that could help with the enquiry. Police want to trace these four men \nAnyone with any information that could be useful, is asked to contact Northumbria Police on 101 quoting reference 8695U/18 or Crimestoppers anonymously on 0800 555 111. 12:07 Another service cancelled \nThe 12.41pm from Newcastle to Penzance has also been affected by a person being hit by a train in Fife this morning. \nThe service has been cancelled altogether. 11:54 Train cancelled \nAnother service - the 12.38pm from Newcastle to Edinburgh - has been cancelled due to a fault on the train. \nIt had been due to arrive in Edinburgh at 2.07pm. 11:42 KEY EVENT Person hit by train \nThe 11.59am service from Newcastle to London King’s Cross is currently delayed by an hour and 40 minutes due to a person being hit by a train. \nThe train is also due to be calling at Berwick, Darlington and York. 11:30 New mobile speed camera catches 98 drivers in two days \nA new mobile speed camera is catching out scores of drivers on a major Northumberland road. \nA speed camera enforcement van has been deployed in Powburn which lies on the busy A697. \nIt was introduced by Northumbria Police following safety concerns from residents and councillors over the high volume of speeding traffic in the village. A mobile speed camera has been deployed on the busy A697 (Image: handout) \nSix of these motorists were travelling 50mph or over in the 30mph limit so will face an automatic court summons. 11:18 Student 'suffered a serious head injury' \nThe North East Ambulance Service have provided a comment on the death of a Durham Unversity student last night: \nWe received a call at 11.50pm to reports of an incident outside Missoula nightclub in Durham, in which someone had received a serious head injury. \nCPR was already in progress. We sent three resources as well as an officer. \nSadly the patient passed away. \nFollow updates from the scene here . 10:52 Brexit fallout \nThe economy of the North East will suffer massive damage as a result of Brexit and shrink by 11% even if there is a comprehensive trade deal, the Government’s own analysis shows. \nAnd if we crash out of the EU without a deal then GDP in the North East will be hit by 16%. \nImpact assessments, which the Government tried to keep secret, revealed that the North East would be harder hit than any other part of the UK. \nDetails were first leaked to website Buzzfeed at the end of January, with analysis focusing on the impact of leaving the EU over 15 years, compared to an economy where Brexit doesn’t take place. A Union Jack flies with the European Union flag (Image: Getty Images Europe) \nThe Brexit cabinet committee is to sketch out what the future relationship between the UK and EU might look like. A meeting was held on Wednesday and another takes place today. ", "external_links": [], "published": "2018-02-08T08:30:00.000+02:00", "crawled": "2018-02-08T09:51:07.016+02:00", "highlightTitle": ""}