{"organizations": [], "uuid": "d60d24ac9234f0cb1abcaf80a48b7d327bb82aeb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14268530.ece/ALTERNATES/s1200/Brexit.jpg", "site_section": "", "section_title": "", "url": "https://www.chroniclelive.co.uk/business/business-news/japanese-firms-could-leave-north-14268454", "country": "GB", "domain_rank": 21960, "title": "Japanese firms could leave the North East after Brexit, top ambassador warns - Chronicle Live", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.219, "site_type": "news", "published": "2018-02-09T15:20:00.000+02:00", "replies_count": 0, "uuid": "d60d24ac9234f0cb1abcaf80a48b7d327bb82aeb"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/japanese-firms-could-leave-north-14268454", "ord_in_thread": 0, "title": "Japanese firms could leave the North East after Brexit, top ambassador warns - Chronicle Live", "locations": [], "entities": {"persons": [{"name": "koji tsuruoka", "sentiment": "negative"}, {"name": "brexit", "sentiment": "negative"}, {"name": "theresa may", "sentiment": "none"}, {"name": "tsuruoka", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "downing street", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "komatsu", "sentiment": "none"}, {"name": "hitachi", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Japanese firms could leave the North East after Brexit, top ambassador warns Koji Tsuruoka has warned that if Brexit makes leads to Japanese firms becoming unprofitable they will leave the UK Share Koji Tsuruoka, Japanese Ambassador to the UK, speaks outside 10 Downing Street, London (Image: PA) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe future of a number of some of the North East’s largest employers has been called into question after Japan’s top ambassador said unprofitable firms may not stay after Brexit . \nJapanese companies such as Nissan , Hitachi and Komatsu employ thousands of people across the North East, but Japanese ambassador Koji Tsuruoka warned that a bad trade deal with the EU could force many of these companies to leave the country. \nHis comments were made outside Downing Street after Mr Tsuruoka met with Prime Minister Theresa May and 19 heads of Japanese companies. \nDuring the meeting Mrs May reiterated her promise that Brexit would allow the UK to strike a free trade deal with Japan. Read More 'Don't take us for idiots': North East business leader reacts to Brexit impact figures \nBut afterwards during a press conference the ambassador warned that if Japanese firms become unprofitable due to bad Brexit deals they will leave the UK. \nMr Tsuruoka said: “If there is no profitability of continuing operations in the UK, not Japanese only, no private company can continue operations. So, it is as simple as that. \n“This is all high stakes and all of us need to keep in mind.” \nHe added: “Our Prime Minister has requested that the Japanese companies be fully consulted and listened to while the UK prepares to engage with the EU on relations of the future of the economic ties between the two.” \nThe view that many Japanese businesses could shut up shop is worrying news for the North East, which is home to a large number of Japanese firms. \nAs well as major manufacturers such as Nissan, Hitachi, and Komatsu, there are also a number of Japanese owned firms working in the automotive supply chain. These include Sunderland’s Sanoh Industrial Co, Calsonic Kansei, Stockton’s Nifco, Unipres, and NSK Bearings. \nMr Tsuruoka did not go as far as to say that Brexit negotiations were a “threat” to Japanese businesses operating in the UK, but he used the opportunity to call for more clarity to be given to the business community as the talks progressed. \n“Uncertainty is a very important source of concern, as if you don’t know what will happen in the near future of course you will very reluctant to make any decision,” he said. “There is an importance of having clarity in the short term, as well as the longer term, and we have been told that the implementation period or transition period will be discussed and the prospect of agreeing with the EU is very positive. That is the first step that we will appreciate and welcome.” Read More Another 101 Carillion workers lose jobs as Official Receiver's review of contracts continues \nThe Japanese ambassador’s comments came just days after the Government released an impact report that predicted that the North East economy will be the worst hit by Brexit. \nThe forecast predicted that under a ‘no deal’ scenario growth in the region would be 16% lower than if the UK remained in the EU. Under a free trade arrangement growth would still fall by 11%, while remaining within the single market would lower the growth reduction to 3%. \nFollowing the release of the report Ross Smith from the North East England Chamber of Commerce called for the Government to stop treating people like “idiots”, and asked politicians to reconsider leaving the Customs Union. Like us on Facebook", "external_links": [], "published": "2018-02-09T15:20:00.000+02:00", "crawled": "2018-02-09T17:09:02.037+02:00", "highlightTitle": ""}