{"organizations": [], "uuid": "1056d90e2a82a962961d46c32afa95e3d4328c3a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14175591.ece/ALTERNATES/s1200/Busiest-day-in-UKs-aviation-history.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14245954", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: British Airways owner hits out at Heathrow's 'monopoly' on terminals", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-05T10:05:00.000+02:00", "replies_count": 0, "uuid": "1056d90e2a82a962961d46c32afa95e3d4328c3a"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14245954", "ord_in_thread": 0, "title": "Business Breakfast LIVE: British Airways owner hits out at Heathrow's 'monopoly' on terminals", "locations": [], "entities": {"persons": [{"name": "carillion", "sentiment": "none"}, {"name": "moore stephens", "sentiment": "none"}], "locations": [{"name": "heathrow", "sentiment": "none"}, {"name": "carillion", "sentiment": "none"}], "organizations": [{"name": "british airways", "sentiment": "negative"}, {"name": "coreena ford", "sentiment": "negative"}, {"name": "london stock exchange", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford FTSE 100 and pound latest \nThe pound at 9am was 1.4131 dollars compared to 1.4125 dollars at the previous close. The euro at 9am was 0.8819 pounds compared to 0.8811 pounds at the previous close. \nThe FTSE-100 index at 8:45am was down 82.71 at 7360.72. Screen displaying the FTSE 100 at the London Stock Exchange (Image: Yui Mok/PA Wire) 9.05 KEY EVENT More than 2,600 firms at risk in wake of Carillion collapse \nMore than 2,600 construction companies became insolvent in the last financial year, with more facing problems because of the collapse of Carillion, according to a new report. \nThe number of firms going insolvent jumped by 8% in 2016-17 compared to the previous year, a study by accountants Moore Stephens found. \nCarillion’s liquidation has put at risk the future of many other businesses in its supply chain as many will only receive a fraction of what they were owed, said the report. \nConstruction companies waited an average of 69 days for payment last year, up from 52 days five years earlier, said the report, adding that Carillion had come in for criticism over the extension of its standard payment terms to 120 days. \nLee Causer, of Moore Stephens, said construction consistently has the highest number of insolvencies of all industries in the UK, adding: \nThe fall of Carillion could be the trigger for even more construction companies going under. \nCarillion has left a huge number of subcontractors out of pocket, when they are already facing enormous financial pressures. \nProfit margins in construction are already very tight and late payment of subcontractors is now standard procedure for far too many in the sector. \nThe Construction Industry Training Board (CITB) said over 150,000 jobs are set to be created in the industry over the next five years despite Carillion’s collapse and uncertainty over Brexit. \nOver 15,000 carpenters and 9,300 labourers will be needed, as well as more mangers, as housebuilding increases, it was predicted. \nCITB policy director Steve Radley added: “Despite all the gloom around Carillion and uncertainty from Brexit, our report’s message is that construction will continue to grow and create more jobs.” \nAround 140 apprentices are still to find work in the North East after construction giant Carillion collapsed last month, and l ocal businesses are being urged to come to the rescue by hiring the remaining staff. Defaced branding is seen outside Carillion's Royal Liverpool Hospital site (Image: Getty Images Europe) 8.55 Coreena Ford Lloyds bans bitcoin purchases with credit cards \nLloyds Banking Group has banned credit card customers from buying Bitcoin amid fears they could be left in debt as the cryptocurrency’s value deflates. \nThe banking giant, which includes Halifax, MBNA and Bank of Scotland, is thought to be the first in the UK to ban credit card customers from borrowing to buy the digital currency, which has more than halved in value in recent months. \nBitcoin’s slide has led to concerns that people who borrow money to purchase it will be left with large debts if the virtual currency continues to depreciate. Significant numbers of people in Britain are thought to have bought Bitcoin as it surged in value, peaking at nearly 20,000 US dollars (£14,465) in December. As news of Lloyds’s ban emerged on Sunday the value was around 8,000 dollars (around £5,700). \nA spokeswoman for the banking group said: \nAcross Lloyds Bank, Bank of Scotland, Halifax and MBNA, we do not accept credit card transactions involving the purchase of cryptocurrencies. \nThe move follows warnings by regulators in the US, South Korea, China, Russia and India over the cryptocurrency. \nGermany’s Bundesbank has also called for global regulation of Bitcoin and France’s finance minister wants tougher rules for cryptocurrencies. \nMeanwhile, Facebook banned adverts for Bitcoin and other cryptocurrencies on its sites after recent criticism from users about scams and hoaxes being promoted in their newsfeed. \nCritics say cryptocurrencies are used by criminals and rogue states to carry out clandestine transactions. \nEarlier this month, US billionaire Warren Buffett ruled out a foray into cryptocurrencies, warning that the Bitcoin boom will “come to a bad ending”. \nThe chairman and chief executive of Berkshire Hathaway has joined the chorus of voices criticising the digital currency. \nHis comments came just a day after JP Morgan chief executive Jamie Dimon said he regretted calling Bitcoin a “fraud”. \nDespite the slide, Bitcoin’s current value is significantly higher than its 900 dollar (£640) position recorded 11 months ago. Bitcoin tokens (Image: Getty Images Europe) 8.50 KEY EVENT Newcastle's historic Grainger Market could be run by outside operators \nOutside operators could be brought in to run the best known market in the North East as part of plans to safeguard its future. \nNewcastle’s Grainger Market welcomed around 6.5m visitors last year – some 124,000 people every week – and has been a favourite destination for residents and tourists for 180 years. \nBut owner Newcastle City Council wants to align the market with the needs of the 21st Century consumer, sustaining its future through staging events and by investing in the historic market. \nImprovements have already been made to the entrances and further investment has been pledged to carry out refurbishments in the glazed arcade area. \nNow, on top of gaining permission to stay open until midnight on special occasions following the success of late-night Christmas opening hours, it has emerged that the council is to hold to a market-sounding event to see if other organisations could better manage the site. \nIn the latest newsletter to its 109 tenants, the council says it will host the event at Newcastle City Library on March 7, inviting “experienced market and retail management companies, market and retail consultants or current stallholder groups” to discuss ways to evolve the market’s future. General views of the Grainger Market (Image: Newcastle Chronicle) 8.45 KEY EVENT Tesco to bring in new UK chief \nBooker boss Charles Wilson will head up Tesco’s UK business following the supermarket’s £3.7bn takeover of the wholesaler. \nThe appointment of highly-regarded Mr Wilson will see current UK and Ireland boss Matt Davies, who joined Tesco in 2015, leave the group in April 2018 after a handover period. \nTesco group chief executive Dave Lewis said: “I am delighted Charles will be joining the Tesco board and executive committee. \n“He brings substantial commercial and retail experience and has an exceptional track record of increasing performance and driving growth in customer-focused businesses. \n“Charles is ideally suited to lead the UK & ROI business for the combined group in the next phase of our turnaround.” \nThe retail veteran will receive a base salary of £575,000 per year and an annual bonus opportunity of up 200% of that sum, as well as an annual performance share plan opportunity of up to 225% of his pay. \nMr Wilson began his career in 1986 with Procter & Gamble, after which he held roles at OC&C Strategy and Abberton Associates. \nIn 1998 he became an executive director at Booker before taking the top job in 2005. \nIn December Tesco, which is undergoing a turnaround under Mr Lewis, got the green light from the competition watchdog for its takeover of Booker. \nThe firm said the group’s trading performance is in line with expectations and it expects to deliver “at least”£1.575bn in operating profit for the full year. Dave Lewis, CEO of Tesco (right) and Charles Wilson, CEO of Booker, when they signed the takeover deal last year. Mr Wilson will now lead Tesco’s UK business. (Image: Stephen Lock/Tulchan Communications/PA Wire) 8.40 Coreena Ford US bank Citi to keep staff in UK despite Brexit \nUS banking giant Citi plans to keep the vast majority of its 9,000 strong workforce in the UK, regardless of how Brexit talks pan out. \nThe group will pepper its EU operations with an extra 150 staff, but is set to bolster offices through a hiring spree rather than a shift of British employees, its local government liaison has assured. \nIt is understood that job moves will stay in the single digits. “We’re moving some roles and will create several,” Alan Houmann, head of government affairs for Europe, the Middle East and Africa (EMEA), said. \nWhen asked whether the outcome of Brexit negotiations could spark a larger raft of relocations, he suggested larger trends were at play and that the central causes of any further moves were “not directly on Brexit”. Citi will keep the majority of its workforce in the UK despite Brexit 8.34 Coreena Ford Natural cosmetics company in North East takes off as people snub chemicals \nA North East entrepreneur has developed an online marketplace for luxury, all-natural beauty products after suffering a life threatening illness while working as a make-up artist at the BBC. \nJo Suddes founded Flourish Beauty three years ago after her health deteriorated while working as a make-up artist on television productions such as Peaky Blinders. \nAfter 18 months a doctor realised she was suffering from severe allergies as a result of the cosmetic products she was handling at work. The diagnosis forced Ms Suddes to quit her job but also inspired her to launch her own business selling natural make up products. \nAfter researching what products were available on the market, Ms Suddes founded Flourish Beauty, with the aim of selling make up that combined natural ingredients with the luxury packaging she had come to expect while working in the industry. \nThe company’s website now stocks 14 brands of organic cosmetic products, including Absolution, Sister & Co, and Soapwalla. Jo Suddes, owner of Flourish Beauty (Image: copyright unknown) 8.25 KEY EVENT Manufacturer to re-shore jobs from China to UK \nVacuum cleaner maker Gtech has announced plans to create more than 100 jobs by shifting some of its manufacturing operations back to the UK. \nThe firm said part of its production would be moved from China to Worcestershire, with an eye to start manufacturing on home soil in 2019. \nThe move comes as it presses ahead with a global expansion, pushing the company into eight new territories across Asia, the Middle East and Europe over the next 12 months. \nFounder and chief executive Nick Grey said: \nOne piece of feedback I get repeatedly from the British public is ‘Nick, why don’t you manufacture your products here?’. So we have designed the product to be manufactured here in the UK. \nCurrently Gtech products are built in China and transported to the UK in shipping containers which are unloaded into a warehouse. \nThey are then individually picked and delivered to consumers. Instead, the new product will be built on the day of dispatch and collected from the end of the line by the courier. \nGtech, which is based in Worcester and employs 200 staff, has grown into a £121m business since it was founded in 2001 Gtech inventor and founder Nick Grey, as the vacuum cleaner maker has announced plans to create more than 100 jobs by shifting some of its manufacturing operations back to the UK. 8.18 Coreena Ford Trinity Mirror talks to buy Daily Express are 'ongoing' \nThe publisher of the Journal, Chronicle, Sunday Sun and Daily Mirror has said it remains locked in discussions over a deal to buy the Daily Express and Daily Star. \nIn a stock market announcement, Trinity Mirror responded to media reports suggesting a deal with parent firm Northern & Shell could be sewn up this week. \n“Trinity Mirror notes the media speculation over the weekend about it acquiring certain assets of Northern & Shell. \n“As previously announced, discussions are ongoing, but there can be no certainty that a deal will be agreed,” the company said. \nLast year the firm confirmed discussions were under way to buy 100% of Northern & Shell, which is run by Richard Desmond. \nIt is the second time in less than two years that Trinity has opened talks with Northern & Shell. \nMr Desmond acquired the newspaper titles in 2000 for £125 million, although it is unclear how much a deal would be worth today. \nIt has been reported, however, that Trinity Mirror shareholders could oppose the planned takeover if the company agrees too high a price. \nThe print media industry is grappling with a decline in print advertising and any combination could herald cost savings and a shared cut of a larger advertising pool. \nIn 2015 Trinity took over local newspaper group Local World in a near £200 million deal, giving it control of the Cambridge News, Nottingham Post, Hull Daily Mail and Leicester Mercury. The Daily Mirror publisher is in talks to acquire Daily Express group Northern & Shell 8.10 Coreena Ford Ryanair warns of further disruption as profits rise \nBudget airline Ryanair has reported rising third-quarter profits - but warned of further disruption to flights as it thrashes out deals with unions across Europe. \nThe Irish carrier booked a 12% increase in net profit to 106 million euros (£93.5m) in the three months to December 31. \nRevenues rose 4% to 1.4 billion euros while passenger numbers rose 6% to 30.4 million during a period in which Ryanair was forced to cancel flights after mismanaging pilots’ annual leave. \nThe debacle, which affected 700,000 passengers, came alongside pilot strike action. \nRyanair has since pledged to increase pilot pay by 20% and beef up its cabin crews, a move that will see staff costs rise by an additional 45 million euros (£39.7m) this year. \nThe airline also agreed to recognise the British Airline Pilots’ Association (Balpa), the trade union representing pilots. \nBut Ryanair warned: \nAs we finalise union discussions along similar lines to that agreed in the UK, we expect some localised disruptions and adverse PR so investors should be prepared for the same. \nThe group also pointed to European airline consolidation and bankruptcies - such as Monarch, Air Berlin and Alitalia - which, it said, are providing more growth opportunities in the UK, Italy and Germany in particular. \nBoss Michael O’Leary said: \nWe are pleased to report this 12% increase in profits during a very challenging third quarter. \nFollowing our pilot rostering failure in September, the painful decision to ground 25 aircraft ensured that punctuality of our operations quickly returned to our normal 90% average. \nWhile union recognition may add some complexity to our business and may cause short-term disruptions and negative PR, it will not alter our cost leadership in European aviation, or change our plan to grow to 200 million traffic per annum by March 2024. \nThe group also announced a 750 million euro (£661.3 million) share buyback and maintained its full-year profit guidance in the range of 1.4 billion euros (£1.24bn) to 1.45 billion euros (£1.28bn). A Ryanair plane (Image: PA) 8.05 KEY EVENT British Airways owner hits out at Heathrow 'monopoly' on airport's terminals \nThe owner of British Airways is calling for an end to Heathrow’s “monopoly” on the airport’s terminals, saying competition between third operators would lower costs for passengers. \nInternational Airlines Group (IAG) was responding to a consultation related to Heathrow’s expansion, saying the development provides “a great opportunity” for independent firms to design, build and run commercial facilities at the airport, including terminals. \nIAG chief executive Willie Walsh said: “Heathrow’s had it too good for too long and the Government must confirm the CAA’s (Civil Aviation Authority) powers to introduce this type of competition. \n“This would cut costs, diversify funding and ensure developments are completed on time, leading to a win-win for customers.” \nHe said the company’s proposal will ensure Heathrow is focused on cost control, “something it has been reluctant to do in the past”. \nIAG claims that the move would also create a new source of funding for the airport’s infrastructure projects, whereas its current investments are funded through debt. \n“This is not rocket science. Most major US airports have terminals owned or leased by airlines and there are European examples at Frankfurt and Munich airports,” Mr Walsh said. \n“There’s absolutely no reason why this cannot happen at Heathrow.” \nThe Department for Transport is due to publish final proposals for a third runway at Heathrow in the first half of the year for a vote in Parliament. \nIf the scheme is approved, the airport will submit a planning application after consulting local communities on detailed proposals. \nIt hopes to begin construction in early 2021, with the runway completed by the end of 2025. \nThe third runway was due to cost about £16.8 billion, but Heathrow claims it can complete the project for £14 billion. \nAirlines have expressed concerns that landing charges could be hiked to help pay for the investment, but the airport insists that the landing charges - currently around £22 per passenger - will remain “close to today’s levels”. \nThe region stands to reap the rewards of the expansion , which would boost connections to Newcastle International Airport and ultimately drive forward growth within the region’s economy. \nThe proposals include looking to create up to 21 additional daily domestic services while the new runway is under construction, boosting connections to Newcastle and enabling more onward connections to destinations across the globe. British Airways aircraft (Image: Steve Parsons/PA Wire) More On", "external_links": [], "published": "2018-02-05T10:05:00.000+02:00", "crawled": "2018-02-05T11:19:36.004+02:00", "highlightTitle": ""}