{"organizations": [], "uuid": "089bca1a2a59ae6fcee17a33256cf17165f05a80", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article12244426.ece/ALTERNATES/s1200/JS83480729.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/bt-ultrafast-broadband-rolled-out-14235131", "country": "GB", "domain_rank": 21960, "title": "BT 'ultrafast' broadband rolled out to three million homes - but not in the North East", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-01T20:00:00.000+02:00", "replies_count": 0, "uuid": "089bca1a2a59ae6fcee17a33256cf17165f05a80"}, "author": "Mike Kelly", "url": "https://www.chroniclelive.co.uk/news/north-east-news/bt-ultrafast-broadband-rolled-out-14235131", "ord_in_thread": 0, "title": "BT 'ultrafast' broadband rolled out to three million homes - but not in the North East", "locations": [], "entities": {"persons": [], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "liverpool", "sentiment": "none"}, {"name": "cardiff", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "bristol", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "edinburgh", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}], "organizations": [{"name": "bt", "sentiment": "none"}, {"name": "leeds", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily   Thank you for subscribing!   \nPlans to introduce “ultrafast” internet connections to three million UK homes in eight UK cities by 2020 have come under fire. \nFirst by critics who described it as “PR spin” that masks the fact the country is lagging behind the rest of Europe on broadband speed. \nAnd there have also been concerns that none of the cities are in the North East. \nThe plan was revealed by BT’s Openreach, which manages the UK’s broadband infrastructure, on Thursday. \nIt said it was accelerating its plan to run fibre-to-the-premises (FTTP) broadband technology to homes and businesses that will increase internet speeds from 24 megabits a second (Mb) under superfast broadband to 100 Mb. BT Openreach \nThe first phase will begin this year, targeting eight cities across the UK - Birmingham, Bristol, Cardiff, Edinburgh, Leeds, Liverpool, London and Manchester. \nAs none are North East, some see the announcement as a snub to the region. \nHowever a BT spokesperson said: “Today’s announcement is certainly not a snub to the North East region. The reality is that somewhere always has to be first and then the roll-out begins from there. \n“Just as Newcastle was one of the first three UK locations to trial G.fast ultrafast broadband technology and since then it has rolled out to other locations across the country. Read More Super slow broadband - UK revealed as having 31st quickest internet connection \n“The North East already has more than 97% superfast broadband coverage and Openreach are actively rolling out fibre broadband throughout Tyne and Wear, Northumberland and County Durham via the multi-million pound Broadband Delivery UK (BDUK) partnerships between Openreach and public sector partners in Northumberland , Gateshead, Sunderland, South Tyneside, North Tyneside and Tees Valley.” Clive Selley \nHowever industry expert Dave Millett, who worked for BT for a decade and now runs consultancy firm Equinox, is one of a number of critics who believe the UK should have opted long ago for a national future-proof fibre-to-the-home network. \nInstead, BT’s approach has been to lay fibre to cabinets on the street and then rely on old copper cables to take broadband into the home. \nThis was driven by the Government’s order to make superfast broadband at 24 Mb available to 95% premises by the end of 2017. Culture Secretary Matt Hancock hailed the successful completion of that target this week. \nMeanwhile Clive Selley, chief executive of Openreach, said: “Now having got to 95% the mandate is twofold: fix the last 5% and move on to the upgrade from superfast to ultrafast speeds.” \nHowever Mr Millett said to get a better picture you had to compare the UK’s performance to its peers. Openreach Engineer laying fibre in a duct as part of BT’s £2.5bn super-fast broadband programme (Image: Johnnie Pakington photography) \nHe said: “The UK ranks 31st in the world for average broadband speeds. \n“BT’s targets for FTTP availability by 2020 is what EU countries achieved, on average, in 2016.” \nMr Millett said the Government could spend a fraction of the money earmarked for the HS2 and HS3 high-speed rail schemes - “which don’t come anywhere near Newcastle” - and be far better for UK business. Read More Are you with BT for broadband? If so, you will want to know this \nHe said: “They are based on the Victorian communications breakthrough of the day - i.e. railways. It should be focusing on the communications breakthrough of the 21st century which will reduce the need for people to travel so much and reduce the need to concentrate businesses in cities but let them be distributed around the country.” \nHe added: “And think of the impact of Brexit. We will want to attract businesses to invest in the UK, yet we’ve got the worst telecommunications technology in the whole of Europe.” Like us on Facebook", "external_links": [], "published": "2018-02-01T20:00:00.000+02:00", "crawled": "2018-02-01T20:14:24.004+02:00", "highlightTitle": ""}