{"organizations": [], "uuid": "1a628bdf9b3117656aac0f16a66618630c7a9774", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/business/article1232449.ece/ALTERNATES/s1200/Hunter-Stoves-HQ.jpg", "site_section": "http://www.westernmorningnews.co.uk/editorschoices.rss", "section_title": "devonlive - frontpage", "url": "https://www.devonlive.com/news/business/meet-exeter-stove-maker-trying-1232381", "country": "GB", "title": "Meet the Exeter stove maker that is trying to make our cities greener", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-19T13:17:00.000+02:00", "replies_count": 0, "uuid": "1a628bdf9b3117656aac0f16a66618630c7a9774"}, "author": "Hannah Finch", "url": "https://www.devonlive.com/news/business/meet-exeter-stove-maker-trying-1232381", "ord_in_thread": 0, "title": "Meet the Exeter stove maker that is trying to make our cities greener", "locations": [], "entities": {"persons": [{"name": "gavin tabo", "sentiment": "none"}, {"name": "paul grimes", "sentiment": "none"}], "locations": [{"name": "exeter", "sentiment": "none"}, {"name": "cornwall", "sentiment": "none"}, {"name": "exeter business park share    a devon", "sentiment": "none"}, {"name": "camelford", "sentiment": "none"}], "organizations": [{"name": "hunter stoves group", "sentiment": "none"}, {"name": "university of exeter", "sentiment": "none"}, {"name": "defra", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Meet the Exeter stove maker that is trying to make our cities greener Hunter Stoves Group is pioneering a prototype wood burning stove to cut emissions Share Hunter Stoves HQ at Exeter Business Park   \nA Devon business is pioneering plans to create a woodburning stove that helps make our cities greener. \nHunter Stoves Group, based in Exeter with 55 staff also has a research and manufacturing site in Camelford, Cornwall where it makes more than 200 designs of multifuel, wood and gas stoves. \nNow, it has teamed up with the University of Exeter to create a prototype stove that will further cut back polluting emissions. Paul Grimes, MD, Hunter Stoves \nManaging Director Paul Grimes said: “It’s at an early stage and it is nigh on impossible to have zero emissions but let’s see how far we can go. \n\"All our stoves are DEFRA certified to be used in smoke control areas but we want to go the next stage further because we want to have the best products with the lowest emissions.\" Read More Quintessential country pub that dates back more than 1,000 years could be yours \nProfessor Gavin Tabor from the College of Engineering, Mathematics and Physical Sciences at the University of Exeter, is leading the research. Engineering doctorate student Adam Azenic is working on a stove with a second chamber to allow for a highly efficient seondary burn of harmful gases and pollutants. \nThe model is at design stage with the first build due to begin this week. Hunter Stoves makes around 200 different models \nHunter Stoves also plans to team with the Danish Institute of Technology to learn from its world beating clean-air innovations. \nThis is the latest development for the firm, founded in 1970 and behind brands including Herald, Di Lusso, Avalon, Cleanburn and Parkray stoves. \nIt comes ahead of plans to introduce eco-design legislation in January 2022 that will make it illegal to sell a stove that has not passed emission and efficiency tests. Read More Dawlish, Totnes and Plymouth set to benefit in £2billion pledge for region's railways \nLast September, the Mayor of London, Sadiq Khan called for a ban on the burning of solid fuel, like wood and coal, in specified zones in a bid to tackle air pollution. \nBut the Stove Industry Alliance states that the biggest culprit is open fires, which account for around 70% of the wood burnt in London. \nThe Stove Industry Alliance (SIA), the trade body representing companies that design, manufacture and market wood-burning stoves in the UK, say that replacing open fires and older stoves with appliances compliant with forthcoming European regulations on eco-design could reduce emissions by up to 90%. \nMr Grimes said: “We want to have the best quality products with the lowest emissions on the market. \n“We know that is what our retailers are telling us that their customers want and it is the right, responsible thing for us to do.” Read More Devon firm that works for the White House is paying for staff degrees and house deposits \nThe company currently spends around £750,000 a year on research and development and first formed a dedicated department in 2003, pre-empting a major shift in the industry to reduce both running costs and emissions. In 2008, the research and development department was expanded, with around £1.5million of investment in a bespoke facility in Camelford. \nMr Grimes said: “Ours is not a huge industry but there is quite a lot of competition. \n“We are one of the few that are investing in research and development because we want to stand out with the best products on the market. \n“At the moment we can meet the new standards that will be introduced but we cannot sit on our laurels. We are looking to go a lot further because it is vital that our business is sustainable and responsible.” \nThere are plans to grow the market in Europe and overseas. \nAround 90% of the business is within the UK with distributors in Europe, Japan and New Zealand. \n“We are planning to do a lot more to reach that untapped market. \n“We have talked to partners in Sweden and have contacts with distributors in France and Spain. \n“We have very good, efficient products that we feel sure there is an overseas market for and the lower we can get the emissions through this project, the more desirable those products will be.” The Hunter Stoves team celebrate 21 years in its Exeter base \nAnd Mr Grimes says that Brexit has so far worked in its favour with the exchange rate reducing the price of its stoves in Europe by 20%. \n“It has made us more marketable and the opportunity to sell has increased as a result.” \nHe called for free trade to continue and predicted that any tariffs would not offset the exchange rate advantage. \nHe added: “I sincerely hope that the relationships we have built up with overseas institutions will continue and I don’t see why they won’t. \n“These are relationships that we have built up and we will work with Europe whether Brexit happens or not.” Like us on Facebook", "external_links": [], "published": "2018-02-19T13:17:00.000+02:00", "crawled": "2018-02-19T13:51:31.000+02:00", "highlightTitle": ""}