{"organizations": [], "uuid": "380b6568ad7779293739da26e8b7d4dae1b309a4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14257772.ece/ALTERNATES/s1200/SGP_NEC_180717DELIVEROO02JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/how-government-says-help-millions-14257624", "country": "GB", "domain_rank": 21960, "title": "How the Government says it will help millions of workers with new rights", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-07T13:30:00.000+02:00", "replies_count": 0, "uuid": "380b6568ad7779293739da26e8b7d4dae1b309a4"}, "author": "Simon Meechan", "url": "https://www.chroniclelive.co.uk/news/north-east-news/how-government-says-help-millions-14257624", "ord_in_thread": 0, "title": "How the Government says it will help millions of workers with new rights", "locations": [], "entities": {"persons": [{"name": "deliveroo", "sentiment": "none"}], "locations": [{"name": "deliveroo", "sentiment": "none"}], "organizations": [{"name": "news how the government", "sentiment": "neutral"}, {"name": "tuc", "sentiment": "none"}, {"name": "taylor review", "sentiment": "none"}, {"name": "trades union congress", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News How the Government says it will help millions of workers with new rights Critics have said the likes of Deliveroo and Uber can exploit staff so a review looked into how employment rights need to be updated Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily   Thank you for subscribing!   \nMajor Government reforms promise sick pay and holiday rights to millions who work in the ‘gig economy’ or are signed up to zero hour contracts. \nThe pledges come in response to the Taylor Review , which has examined issues around workers’ rights for those in ‘gig economy’ jobs for the likes of Uber and Deliveroo, where roles appear to be in a grey area between being employed and self-employed. The review also looked into issues for those who have zero hour contracts, where staff do not have a minimum amount of hours promised to them. They have been criticised as exploitative by the Trades Union Congress (TUC). \nThe review concludes with a seven point plan to create a fair work environment , but the Government says it will go even further to give workers better deals. \nUnions however are wary, describing the reforms as “baby step” where a “giant leap” is needed. What is the Taylor Review? A phone displays the Uber ride-hailing app (Image: Getty Images Europe) \nMatthew Taylor was chosen by the Government to lead an independent review examining how employment practices need to change so they can keep up with 21st century business models. \nThe rise of apps like Uber and Deliveroo, which delivery drivers and taxi-style drivers use to pick up jobs, is one development which has led to calls for a change in employment models. \nEqually, there has been an increase in zero hour contracts, where staff do not get a minimum amount of hours they have to work and can come with few rights to holiday or sick pay. \nOne thing the review looked at is the extent which these growing employment methods undermine rights like the Living Wage and maternity leave. \nIt made seven points “towards fair and decent work”. \nIt says the same principles should apply to all forms of employment, while modern flexibility must be maintained, but not at the cost of weaker rights for those who work in the gig economy or on zero hour contracts. It also says workers should be given opportunities to progress and earn above the minimum wage. Read More What is the ‘gig economy’? A Deliveroo delivery rider (Image: Newcastle Chronicle) \nThe term 'gig economy' refers to a labour market where a worker takes advantage of short-term or freelance opportunities instead of permanent, rigid roles. \nAround 5m people in the UK work in the sector. Popular gig economy jobs include driving cabs for Uber or delivering takeaway food for Deliveroo. Workers use these apps to claim individual jobs and get paid for the “gigs” or tasks they complete. \nFans say the gig economy offers flexibility to work when you want, but critics say it can lead to exploitation and pay below the minimum wage. Read More Modern workers 'like cogs in a machine rather than human beings', Government review says What is a zero hour contract? \nEmployees hired on zero hour contracts are not entitled to set hours or shifts. The employee is still entitled to minimum wage and statutory annual leave. \nCritics say zero hour contracts can be exploitative, as employers can get out of paying sick pay or holiday pay. Supporters say they offer flexibility. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now What is the Government saying? \nIn response to the review, the Government says it will go further to improve rights for workers. \nIt says the Government: Will make sure unpaid interns are not doing the same tasks as a paid employee Will name and shame employers who do not pay sums awarded in tribunals Will make fines bigger for employers who show “malice, spite or gross oversight” \nIt will ensure fair pay by: Providing all 1.2 million agency workers with a clear breakdown of who pays them and any costs or charges deducted from their wages Asking the Low Pay Commission to consider the impact of higher minimum wage rates for workers on zero-hour contracts Considering repealing laws allowing agencies to employ workers on cheaper rates \nThe Government will increase transparency in the business environment by: Defining ‘working time’ for flexible workers who find jobs through apps or online so they know when they should be being paid Launching a task force with business to promote awareness and take-up of the right to request flexible working introduced in 2014 Making sure new and expectant mothers know their workplace rights and raise awareness amongst employers of their obligations Launching a new campaign to encourage more working parents to share childcare through Shared Parental Leave – a right introduced in 2015 What has the reaction been? \nThe business world has been supportive, but labour unions have suggested more needs to be done to tackle inequality in pay and holiday rights. “Flexibility and fairness must go hand in hand” Business Secretary Greg Clark (Image: Getty Images Europe) \nNeil Carberry of the CBI said: “Business agrees with the Government that flexibility and fairness must go hand in hand, and it is right to review rules to ensure they are fit for the 21st century - this also forms a key part of the industrial strategy. \n“Firms will be keen to play their part in promoting greater awareness of employee rights, such as shared parental leave and flexible working, which will improve diversity and, therefore, productivity.” \nStephen Martin, director general of the Institute of Directors, said: “This could be the biggest shake-up of employment law in generations. It is right, therefore, that Government proceeds cautiously by consulting widely. \n“However, while they have accepted almost every single recommendation from the Taylor Review, and in some cases even gone further, the lack of action on tax reform is a wasted opportunity.” \nBusiness Secretary Greg Clark said: “The Taylor Review said that the current approach to employment is successful but that we should build on that success, in preparing for future opportunities. \n“We want to embrace new ways of working, and to do so we will be one of the first countries to prepare our employment rules to reflect the new challenges.” A ‘baby step’ Frances O'Grady at the Liberal Democrat Conference 2016 in Brighton \nTUC general secretary Frances O’Grady added: “The Government has taken a baby step - when it needed to take a giant leap. \n“These plans won’t stop the hire and fire culture of zero-hours contracts or sham self-employment, and they will still leave 1.8 million workers excluded from key protections. \n“Ministers need to up their game. At the very least they must end the undercutters’ charter that means agency workers can be paid less than permanent staff doing the same job.” \nUnison general secretary Dave Prentis said: “The Government’s good work plan looks set to fall at the first hurdle. It’s no good, it won’t work and it isn’t a plan. \n“Britain’s worst employers need to be dragged kicking and screaming into the 21st century, but sadly this response won’t do that. \n“If ministers spent more time trying to make life better for working people rather than focusing on the twists and turns of Brexit, exploited workers might have something to celebrate today.” \nGillian Guy, chief executive of Citizens Advice, said: “While the Government consultation on the rights \nof gig economy workers is a step in the right direction, it leaves hundreds of thousands of people in limbo with respect to their rights. \n“With their employment status a grey area, people remain at risk of being taken advantage of by unscrupulous bosses.” Like us on Facebook", "external_links": [], "published": "2018-02-07T13:30:00.000+02:00", "crawled": "2018-02-07T15:54:16.013+02:00", "highlightTitle": ""}