{"organizations": [], "uuid": "96a528c08c63b91d8baf4ed86b44001b7b38140e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14350897.ece/ALTERNATES/s1200/Untitled-design.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/toys-r-maplin-collapses-raise-14350755", "country": "GB", "domain_rank": 21960, "title": "Toys R Us and Maplin collapses raise questions for future of high street", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-28T18:21:00.000+02:00", "replies_count": 0, "uuid": "96a528c08c63b91d8baf4ed86b44001b7b38140e"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-news/toys-r-maplin-collapses-raise-14350755", "ord_in_thread": 0, "title": "Toys R Us and Maplin collapses raise questions for future of high street", "locations": [], "entities": {"persons": [{"name": "maplin", "sentiment": "negative"}, {"name": "richard lim", "sentiment": "none"}, {"name": "prezzo", "sentiment": "none"}], "locations": [{"name": "prezzo", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "loughborough echo", "sentiment": "none"}, {"name": "retail economics", "sentiment": "none"}, {"name": "maplins", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Toys R Us and Maplin collapses raise questions for future of high street Jobs will be lost around the North East as major retailers go into administration Share Toys R Us, Prezzo and Maplin Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe collapse of two major retail chains - both with a significant presence in the North East - has raised fresh questions about the future of the high street. \nToys R Us and electronics company Maplins both went into administration this morning, putting more than 5,000 jobs at risk. \nThe collapse of the two firms was followed by an announcement that restaurant chain Prezzo would be shutting a third of its 300 sites, marking a black day for the UK and the North East high street. \nRetail experts warned that more closures were likely to follow as high costs, the growth of online and a squeeze on consumer spending take their toll on shopping businesses. A Maplin store (Image: Loughborough Echo) \nRichard Lim, chief executive of Retail Economics said: “All is not well on UK high streets. \n“The perfect storm of spiralling operating costs, softer consumer demand, and seismic structural changes has claimed another victim. \n“Put simply, the retailer was too slow to embrace omnichannel, were burdened with too many stores and failed to deliver a retail ‘experience’ good enough to stand out from their competitors.” \nRichard Hyman, who has analysed the retail sector for more than 30 years and predicted last year that 2018 would be “the year of retail distress”, said the latest developments came as “no surprise”. A Toys R Us store \nHe said: “As the pressure mounts, the weakest will fall. Brexit is an exacerbating factor but the principal cause is structural. We’ve got too many shops, the shops are too big, and there are too many websites. \n“There are too many mouths to feed and the consumer economy is in a very weak condition and has been for a very long time, and there is no evidence of that changing.” \nEconomists are expecting some relief for high street shoppers as inflation eases and wage growth picks up pace, but political uncertainty is likely to mean that the retail sector remains under intense pressure. \nThe biggest victim of the retail slump since BHS came when administrator Moorfields Advisory started an “orderly wind-down” of Toys R Us after the embattled firm failed to find a last-minute buyer to save the business. \nOne of the nation’s biggest toy retailers, the company has stores in the North East at the Metrocentre, Sunderland and Stockton. Read More Toys R Us closure: everything customers need to know \nToys R Us announced a Company Voluntary Arrangement (CVA) at the end of last year in an attempt to shore up its financial position by allowing it to shut loss-making stores and secure deep discounts on rental costs. \nBut efforts to find a buyer fell flat and the firm was forced to call in the administrators. \nMaplin - which has stores in Newcastle, the Metrocentre, Durham and Cramlington - is still trading while administrators PwC try to find a buyer. Read More UK snow LIVE: More than 400 North East schools shut; cars stranded and roads closed \nZelf Hussain, joint administrator and PwC partner, said: “The challenging conditions in the UK retail sector are well documented. \n“Like many other retailers, Maplin has been hit hard by a slowdown in consumer spending and more expensive imports as the pound has weakened. \n“Our initial focus as administrators will be to engage with parties who may be interested in acquiring all or part of the company. We will continue to trade the business as normal whilst a buyer is sought. \n“Staff have been paid their February wages and will continue to be paid for future work while the company is in administration.” Prezzo (Image: hinckley times) \nMeanwhile, hundreds of jobs are expected to be lost at Prezzo as the restaurant chain edges closer to a restructuring that will see up to 100 sites close. \nThe company, which is owned by private equity firm TPG Capital and has sites in Newcastle and Darlington, is set to launch a Company Voluntary Arrangement (CVA), which will allow the Italian-themed chain to exit unprofitable branches and secure rent reductions on the remaining estate. Like us on Facebook", "external_links": [], "published": "2018-02-28T18:21:00.000+02:00", "crawled": "2018-02-28T18:29:30.022+02:00", "highlightTitle": ""}