{"organizations": [], "uuid": "b21a8e79b2278d8485249174a6e6e6afb174955e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14256075.ece/ALTERNATES/s1200/Schools-escaping-food-standards.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/free-school-meals-plan-means-14255823", "country": "GB", "domain_rank": 21960, "title": "Free school meals plan means children will go without if their parents work extra hours, MPs warn", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-07T07:00:00.000+02:00", "replies_count": 0, "uuid": "b21a8e79b2278d8485249174a6e6e6afb174955e"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/free-school-meals-plan-means-14255823", "ord_in_thread": 0, "title": "Free school meals plan means children will go without if their parents work extra hours, MPs warn", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Free school meals plan means children will go without if their parents work extra hours, MPs warn Families will suddenly lose their right to free school meals if their income increases slightly Share Some children will lose their right to free school meals if their parents work extra hours (Image: PA) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nSome children will lose their right to free school meals if their parents work extra hours or receive a modest pay rise, MPs have warned. \nIt’s a result of the introduction of Universal Credit, which has changed the way free school meals are allocated. \nUnder the government’s plans, a household with an income below £7,400 will be eligible for free school meals. \nBut that will end if the income reaches this level - creating what critics call a “cliff edge”. \nWashington & Sunderland West MP Sharon Hodgson said the proposal was “ridiculous”. \nAnd she led a House of Commons debate urging the Government to rethink the plan. Read More Employers say the North East needs expanded Heathrow Airport to thrive after Brexit \nShe said: “What we want to avoid is families avoiding a pay rise or working more hours for fear that they will lose out if they do so.” \nA family could lose free meals worth many hundreds of pounds if their income increased slightly, she said. \nFree school meals are worth £2.30 per child per day, which over a 38-week school year comes out at £437 per child. \nMs Hodgson said: “A family with three children earning just below the £7,400 threshold would be set to lose out on £1,200 of the value of free school meals if they worked just a few hours more or got a pay rise.” \nShe said the Government claimed Universal credit was designed to ensure work always pays, and anyone whose income rose would actually be better off as a result. However, the way proposed free school meal system would stop this happening, she said. \n“The cliff edge will be detrimental to families and especially children,” she added. \nUniversal Credit is a new benefit, which replaces a range of benefits and tax credits. The Government has introduced temporary arrangements which mean that any family currently receiving Universal Credit is eligible for free school meals. \nMs Hodgson said this system should continue permanently. \nChildren’s Minister Nadhim Zahawri, responding on behalf of the Government , said people earning £40,000 could be eligible for small Universal Credit payments in some circumstances, and he did not believe they should get free school meals. \nThe Government had not yet decided exactly how the new system would work, he said. Read More \n“We will be publishing our response to this consultation shortly.” \nUniversal free infant pupils will continue to be available to all infant school children, Mr Zahawri said. Like us on Facebook ", "external_links": [], "published": "2018-02-07T07:00:00.000+02:00", "crawled": "2018-02-07T08:37:19.007+02:00", "highlightTitle": ""}