{"organizations": [], "uuid": "5d784ac04463e4cf732919e965f130056313c727", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1147806.ece/ALTERNATES/s1200/west50-618x416.jpg", "site_section": "", "section_title": "", "url": "https://www.devonlive.com/news/business/west50-list-here-50-brightest-1146456", "country": "US", "title": "Devon and Cornwall's 50 best and brightest - The West50 - Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "", "spam_score": 0.045, "site_type": "news", "published": "2018-02-01T18:07:00.000+02:00", "replies_count": 0, "uuid": "5d784ac04463e4cf732919e965f130056313c727"}, "author": "Hannah Finch", "url": "https://www.devonlive.com/news/business/west50-list-here-50-brightest-1146456", "ord_in_thread": 0, "title": "Devon and Cornwall's 50 best and brightest - The West50 - Devon Live", "locations": [], "entities": {"persons": [{"name": "devon", "sentiment": "none"}, {"name": "chris loughlin", "sentiment": "none"}, {"name": "steve hindley", "sentiment": "none"}, {"name": "hindley", "sentiment": "none"}, {"name": "mr loughlin", "sentiment": "none"}, {"name": "loughlin", "sentiment": "none"}], "locations": [{"name": "cornwall", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "pennon group", "sentiment": "none"}, {"name": "british water", "sentiment": "none"}, {"name": "cornwall local enterprise partnership", "sentiment": "none"}, {"name": "constructing excellence south west leadership council", "sentiment": "none"}, {"name": "midas group", "sentiment": "none"}, {"name": "devon community foundation", "sentiment": "none"}, {"name": "water uk", "sentiment": "none"}, {"name": "cbe", "sentiment": "none"}, {"name": "heart of the south west local enterprise partnership", "sentiment": "none"}, {"name": "cbi", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ECONOMY \nChris Loughlin, Chief executive, Pennon Group \nAs a major advocate in the #BackTheSouthWest campaign, Chris Loughlin is committed to growth and prosperity for the region. \nHe is the head of Exeter-based Pennon Group, the region’s biggest Plc, employing 4,987 staff. \nMr Loughlin is currently chairman of British Water, a director of Water UK and a trustee of the charity WaterAid. \nAn enthusiastic advocate of local business, Mr Loughlin is also vice chairman of the Cornwall Local Enterprise Partnership. \nSteve Hindley CBE, Chief executive Midas Group \nSteve Hindley has more than 40 years of experience in the construction industry and heads Midas Group. \nAs chief executive and chairman, Mr Hindley has transformed Midas from a small regionally based contractor to a property services group operating throughout the UK and in all property sectors. \nMr Hindley is chairman of the Heart of the South West Local Enterprise Partnership, chairman of Constructing Excellence South West Leadership Council, chairman for the Devon Community Foundation and a former chairman of the CBI Construction Council and of the CBI South West Council. (Image: Matt Austin) \nKarime Hassan Chief executive & Growth director, Exeter City Council \nNamed one of 2017 Faces of Growth by accounting and consultancy firm Grant Thornton, Mr Hassan is credited for leading Exeter’s high-growth strategy and dedication to attracting investment opportunities. \nMr Hassan and his team have directed several growth projects in recent years for the city, including Exeter Science Park, community homes in Cranbrook and the redevelopment of the Princesshay shopping centre. (Image: Terry Barnecutt) \nMiles Carden, Enterprise Zone Manager Aerohub at Cornwall Airport Newquay & Spaceport \nMiles is part of the team putting Cornwall at the forefront of the space race. \nThe Newquay Aerohub/Goonhilly partnership is one of eight sites bidding to create the UK’s first spaceport and tap into the £25 billion spaceflight launch market by 2020. \nIt has been in talks with a number of potential investors to develop the spaceport facilities at Newquay Airport. \nWork on the Aerohub Business Park at Cornwall Airport Newquay started this year, and will be completed in early 2019. \nAerohub is currently home to 14 businesses employing more than 450 people at an average annual wage of £33,400 – almost twice the average wage in Cornwall. \nToby Parkins, Chairman Tech South West \nThe co-founder of Headforwards, Cornwall’s biggest software company heads up Tech South West, an organisation that brings together the most innovative businesses across the region. \nAn advocate for collaboration and supporting entrepreneurs, he is at the forefront of Cornwall’s growing tech sector. \nHeadforwards, based in Penryn, is set to grow even bigger after it announced ambitious plans to recruit up to 2,000 people over the next five to 10 years. \nAnd he says that being in beautiful Cornwall with its sandy surf breaks and broadband speeds are key to recruiting the next Headforwards techies. Investing in our people brings with it a variety of economic opportunities \nLooking after your people is looking after the economy, says Ken Lewins, partner, Foot Anstey \nUtilising the potential that new and developing technologies offer, developing and retaining people, addressing barriers, growing higher value employment opportunities and promoting equality and diversity is hugely important for the success of a vibrant South West economy. \nYou only need to look at some of the region’s initiatives and strategies, to understand how this focus will continue to develop the South West’s economic success across its diverse industries and sectors. \nKey to the success and delivery of these strategies are employers, the businesses operating in the South West who are leading the way by continuing to invest in and develop technology, as well as increasing the skills of and demand for a responsive and flexible work force. \nFor Foot Anstey, investing in and adopting technology is key to the delivery of effective legal services and collaborating with our clients. This includes our recent investment in our client digital collaboration tool, as well as artificial intelligence and machine learning technologies for security controls. Investment in people is just as important and not just talent, training and retention, but the technology that people expect in today’s constantly changing and dynamic workplace. \nAgile and flexible working capabilities may be viewed as a challenge for employers but are absolutely necessary for contemporary working practices and exceptional client service. We work in a diverse environment and with people across the globe requiring the flexibility to provide legal advice without the constraints of geography or time-zone restrictions is essential. \nWe continually invest in our people which in turn brings opportunities. The multiplier effect is not to be ignored and a strong legal industry in the region brings with it a variety of economic opportunities. \nINNOVATION, CREATIVE & DIGITAL \nRob Love, Chairman of Crowdfunder \nA pioneer of social funding, Rob Love is at the helm of a business valued at £16.8 million. Last year, the reward-based crowdfunding platform based in Cornwall secured investment from business incubator and accelerator Broody, which has acquired a 5% stake. \nThe deal will see the two organisations working together as partners to cement Newquay-based Crowdfunder’s position and give Broody’s portfolio of start-ups access to the benefits of crowdfunding. Crowdfunder has more than 600,000 members and has raised more than £45 million for crowdfunded projects across the UK since 2014. \nIt has the declared aim of becoming the biggest social funding platform in the world. \nLouise Pasterfield, Founder of Sponge UK \nThe vision behind Sponge UK, the Plymouth digital learning company with major clients including GlaxoSmithKline, the NHS and the United Nations. \nMrs Pasterfield is at the helm of one of the largest, independent, female-owned elearning companies in Europe. Sponge has experienced significant growth in the past six years and is a Sunday Times Top 100 Best Small Companies to Work For. \nMrs Pasterfield is a women in STEM advocate and speaks regularly at regional, national and international events on the learning technologies industry, women in business and the digital economy. \nWill Jackson, Founder of Engineered Arts \nEngineered Arts has helped put Cornwall on the map for innovations in robotic technology. Started in 2004, Engineered Arts has grown to become a leading manufacturer of humanoid robots with commissions for Kew Gardens, Eden Project and sales worldwide. \nThe company develops and sells an ever expanding range of humanoid and semi-humanoid robots featuring natural human-like movement and advanced social behaviours. It employs a team in Penryn that specialises in software development, mechanical engineering, 3D design and animation. \nEngineered Arts’ humanoid robots are used worldwide for social interaction, communication and entertainment at public exhibitions and attractions, as well as university research labs. New chief executive... Ian McFadzen of Plymouth Science Park \nIan McFadzen, Chief executive, Plymouth Science Park \nIan McFadzen became chief executive of Plymouth Science Park in 2017, a move from the University of Plymouth where he was commercial director of the Marine Innovation Centre. \nWith more than 30 years of experience in the public and private sectors, Mr McFadzen brought to his new job expertise in translating research into commercially viable business opportunities, particularly in the fields of biomedicine and life sciences. \nMr McFadzen was the founding director of two biotechnology companies, including Plymouth’s Biovault, the UK’s largest accredited private sector human tissue bank. \nHe has worked with a range of science parks across the UK, including Plymouth, Cambridge, Bristol and Bath. \nThe former research biologist spent the past ten years at the university, and has worked on collaborative R&D programmes across Europe, North America and South East Asia. Luke Lang and Darren Westlake, Crowdcube. \nLuke Lang and Darren Westlake, Founders of Crowdcube \nThe fintech pioneers were both named in Debrett’s Britain’s 500 most influential people in 2016. \nBased in Exeter, the business faciliates pooled investment from individuals to allow entrepreneurs to secure funding directly from the general public, bypassing business angels and banks. \nThe platform has seen £391,485,095 invested in pitches with 488,313 registered members. \nFOOD Mark Sullivan, CEO of the Provenance group speaking at the Connected Cornwall conference held at Healeys in November 2017 \nMark Sullivan, Chief executive of Provenance Brands \nProvenance Brands is the company behind some of Cornwall’s best known names including Warrens Bakery, Simply Cornish, Cornish Sea Salt, Cornish Seaweed and The Cornish Crisp Company. \nMark Sullivan is growing a portfolio of synergistic businesses, with a strong innovation and international outlook, around the theme of provenance. \nFormerly a managing director of JP Morgan (London), where he focused on strategic advisory matters, he specialises in how food and drink producers can take their brand to an international market. \nMary Quicke MBE, Managing director, Quicke’s Traditional \nMary Quicke is at the helm of a £4million business making award winning cheeses. \nQuicke’s Cheese is the largest British naturally matured traditional cheddar maker and Mary is the fourteenth generation on the farm, running the business since 1987. \nThe cheese sells to key outlets in the UK, and over one third to export, mainly US and Australia. \nMs Quicke has launched the Academy of Cheese, is a Dairy Sector Board Member of AHDB and a judge at the World Cheese Awards, Bath & West Show, British Cheese Awards and the American Cheese Society Awards. Catherine Mead, owner and director of Lynher Dairies home of Cornish Yarg and Cornish Kern \nCatherine Mead, Managing director, Lynher Dairies \nCatherine Mead heads up a team of 30 that make the celebrated Yarg cheese. \nThe latest cheese, Kern, has just been named the best cheese in the world, winning supreme champion at the World Cheese Awards. \nThe big name cheeses are made in a small dairy at Ponsanooth in Mid Cornwall but is sold all over the world. \nMs Mead has designed an apprenticeship in cheese-making with Duchy College, is a trustee of Cornwall Food Foundation, vice-chairman of the Specialist Cheese Makers Association and a former chairman of Cornwall Agri Food Council. \nGuy Watson, Founder, Riverford Organic Farms \nThe veg box pioneer has seen the expansion of Riverford from a small local enterprise to delivering around 47,000 boxes every week with veg grown at four regional farms and a number of independent organic farmers and growers. \nTwice voted BBC Farmer of the Year and last year awarded Best Organic Farmer of the Year and Organic Market Innovator of the Year by the Soil Association, he lectures regularly on ethical business and highlights political issues relevant to food and farming. His leadership has been recognised with numerous awards including Observer Best Ethical Business. Jonathon Jones, MD Trading at Tregothnan, right, pictured with George Eustice MP \nJonathon Jones, Managing director of trading at Tregothnan \nJonathon Jones is the pioneer behind the UK’s very first and only tea plantation. \nArriving as head gardener at the Cornish Estate in 1996, he used his expert camellia cultivating knowledge and experience travelling world tea plantations to set up the plantation. Now, Tregothnan tea is stocked by big name brands including Liberty, Waitrose and Fortnum and Mason. \nAn advocate of export opportunities for the region, Tregothnan tea is sold worldwide with key markets in the US, China, Japan, Korea and Taiwan. \nHOSPITALITY & TOURISM \nSimon Tonge, Executive director of Whitley Wildlife Trust \nSimon Tonge leads the charitable organisation which owns Paignton and Newquay zoos, the Living Coasts exhibit in Torquay and three nature reserves in Devon. \nThe former Senior Curator at London Zoo and trainee accountant, is chairman of the European Association of Zoos and Aquariums (EAZA); a member of the Zoological Society of London’s Zoos Advisory Committee; chairman of the Committee for Population Management of the World Association of Zoos and Aquaria (WAZA); and sits on the board of two conservation charities in southern Africa. \nFunds generated by the attractions support conservation projects in the UK and overseas. Sir Tim Smit, the co-founder of the Eden project \nSir Tim Smit, Co-founder of the Eden Project and Lost Gardens of Heligan \nThe man behind the Lost Gardens of Heligan and the Eden Project was last year’s winner of the Western Morning News Lifetime Achievement Award. \nSir Tim has been praised for leadership that has helped transform the economy in not just Cornwall but the whole of the South West. \nTogether with John Nelson, he restored the Lost Gardens of Heligan before opening the award winning Eden Project near St Austell in Cornwall. \nSince opening in 2001, it has attracted more than 18 million visitors and inspired an economic renaissance in Cornwall by contributing more than £1.7 billion to the local economy. \nSir Tim continues to spread Eden’s message far and wide with plans for Cornwall to become a world leader in agronomy and horticulture. Nathan Outlaw \nNathan Outlaw, Chef and restaurateur \nNathan Outlaw’s flagship restaurant in Port Isaac has been named the UK’s Best Restaurant in the Waitrose Good Food Guide 2018. \nIt has also reached the number four spot on the Harden’s Best UK Restaurant list. \nIt is the only Cornish restaurant to ever hold two Michelin stars and is known for showcasing the finest sustainable seafood caught off the Cornish coast. Celebrity chef Rick Stein (Image: Lewis Whyld/PA Wire) \nRick Stein CBE, Restaurateur and TV personality \nHonoured with a CBE in the New Year Honours List, the chef, restaurateur, cookery book author and TV presenter kick-started Padstow in North Cornwall as a foodie destination. \nRick Stein has written more than 20 cookery books and made more than 25 cooking TV programmes. \nHe owns 13 restaurants under his brand name including the Seafood Restaurant in Padstow which is his company’s flagship restaurant. \nHe has cooked for the Queen, Prince Charles, Margaret Thatcher and former French president Jacques Chirac. \nKevin Bishop, Chief executive, Dartmoor National Park \nAs chief executive for Dartmoor National Park Authority, Kevin Bishop has been head of one of the region’s most important natural assets and major visitor attractions for ten years. \nHe is a member of the World Commission on Protected Areas and was a council member for the Countryside Council for Wales, on the Royal Society for the Protection of Birds Committee for Wales and has acted as an adviser to the Heritage Lottery Fund. \nMANUFACTURING \nNick Ames, Chief executive, Supacat SC Group \nUnder Nick Ames’ leadership, the company behind military vehicle designers and manufacturer, Supacat and heavy engineering company Blackhill, has enjoyed huge expansion. \nOrders from Australia, Norway and New Zealand for Supacat’s special forces vehicles have boosted overseas earnings from £2.5 million to more than £32 million over the last three years. \nMr Ames has also overseen the Group’s expansion outside the defence sector including major engineering contracts at Hinkley Point C. \nPreviously, Mr Ames worked at Serco Group as a divisional finance director and divisional managing director, responsible for clients such as the European Space Agency, European Southern Observatory and nuclear research centre CERN. Mike Carr and Henk Wiekens are joint managing directors at Falmouth-based Pendennis Shipyar \nMike Carr & Henk Wiekens, Joint Managing directors, Pendennis \nMike Carr and Henk Wiekens led the management buyout of Pendennis in 1993, creating a business that is a major player in the global superyacht industry and was named the fastest growing business in the region in the Western Morning News’ Fast Growth 75. \nUnder their leadership, Pendennis now has the largest specialist superyacht facilities in the UK. \nIn 2015, Pendennis completed a £22 million redevelopment to expand and modernise its existing facilities. \nIt now has a 400 strong staff and an award-winning four-year apprenticeship scheme. \nAnthony Sheriff, Chairman of Princess Yachts \nJoining from McLaren in 2016, Sheriff has been at the helm of the luxury boat builder Princess Yachts as its order book hit a record £640 million. \nThe Plymouth firm, which employs 2,500 people and has an award winning apprenticeship scheme, is about to embark on a £100 million five-year investment programme. \nThere are plans for a further six new Princess model launches before the end of 2018. Having a ball... Michael LeGoff, right, with Plymouth Raiders' boss Bob Widdecombe when Plessey sponsored the basketball team \nMichael Le Goff, Chief executive, Plessey Semiconductors \nMichael Le Goff leads one of the region’s most important manufacturers, buoyed by £100million in investment since 2012. The renowned physicist, engineer and former Canadian navy officer has been in charge at Plessey since 2009, when he founded the company with the acquisition of legacy assets. \nPlessey employs 150 staff making sought-after products, mainly h-tech LEDs for lighting. \nLast year, he became chairman of Plymouth Science Park. In charge... David Nairn, managing director at Burts Chips (Image: Penny Cross) \nDavid Nairn, Chief executive, Burts Chips \nDemand for Burts Potato Chips Ltd is soaring so fast it has bought an existing company and its factory in Leicester to stay ahead. In September alone, it sold £3 million of products, up 45 per cent on sales for September 2016. \nDavid Nairn has steered huge investment into the current plant in Plymouth to enable £50 million in sales. This increase in capacity will help satisfy demand from retailers across the UK, US, Canada, and Europe, the Middle East and Africa. Keep pressing hard to ensure South West doesn’t fall behind on communications \nGood connections are the key to success for the South West, says Tim Price, Rural Affairs specialist at NFU Mutual. \nWhat is the single most important factor to help the South West’s businesses forge ahead in 2018? \nThere is no doubt in my mind that it is communications – the ability for the South West to connect with its business customers quickly, clearly and on time. \nBy “communications” I mean everything from road and rail links to get goods in and out of the region, through to superfast broadband to enable us to compete globally and the right skills and training to enable us to tell the world about our fantastic location, farm produce and business skills. \nIt is good connections through personal contacts which help make NFU Mutual the choice of insurer for thousands of farms, business and homeowners across the region. We are committed to maintaining our local offices against the current trend for many financial services organisations. \nWe also know that modern businesses need the support of our technical experts at our Bristol regional office and Stratford head office available instantly to support them in a-fast moving business world. \nLike other businesses in Devon and Cornwall, we rely on the region’s road network and internet connectivity to deliver these services quickly and efficiently. \nFor the year ahead, think how connections can help your business grow – and keep up pressure on local Government and MPs to keep the fight for superfast broadband across the region at the top of the South West political agenda. \nThroughout history the South West has striven to drive its economic growth through communications. From the days of packhorses to the stage coach and then the coming of the railways, new technology has provided the tools to enable the region to develop and thrive. \nWe are still in the same race – but the stakes are higher. To move our goods from our farms, factories and mines we need excellent road and rail links. In a world market where the ability to trade fast online is at the heart of future growth potential, we need to press our politicians and business leaders hard to ensure the South West doesn’t fall behind. \nWe need to ensure that after Brexit we get the finance needed to upgrade our road and rail network. We need to ensure we are spreading the word about our scenery, food and business opportunities. \nTo communicate these messages we need decent internet connections. It is crucial that our farmers, shops, hotels and businesses have access to high speed internet service. So it is vital that our leaders continue to press hard for action on bringing superfast broadband to the South West’s many uncovered and poorly-served areas to avoid us missing out. \nPOLITICS Ben Bradshaw \nBen Bradshaw, Labour MP for Exeter \nThe former radio reporter and vicar’s son, who has represented Exeter since 1997, is a passionate supporter of the Open Britain campaign, which argues that the Westcountry’s workers and businesses will be seriously worse off after Brexit. He believes “pulling out of the single market and the customs union in 2019 will drive our economy over a cliff edge, putting jobs and family finances at risk”. Defying the Labour whip for the first time in his career over the Article 50 Bill to trigger the Brexit process, Ben intends to continue campaigning against a hard Brexit during 2018. George Eustice, MP for Camborne and Redruth \nGeorge Eustice, Conservative MP for Camborne and Redruth \nHaving worked on his family’s fruit farm at Hayle before becoming an MP, George Eustice was well placed to take on the role of Parliamentary Under Secretary of State for Farming, Food and the Marine Environment. Although a strong advocate for the industry, he caused dismay among many Westcountry farmers for backing the Leave campaign. Countering his critics, he has vowed to be a “champion of farmers” after the UK leaves the EU in 2019, stating that he remains “absolutely confident” a post-EU agricultural policy would benefit agricultural businesses. Topsham Cllr Andrew Leadbetter \nAndrew Leadbetter, Conservative councillor for Wearside & Topsham on Devon County Council \nDevon County Council’s cabinet member for economy, growth and transportation, and former chairman of the Peninsula Rail Task Force for the South West, Andrew Leadbetter also sits on the Heart of the South West Local Enterprise Partnership and Local Transport Board. After the rail line was washed away at Dawlish in 2014, he oversaw the Closing The Gap strategy aimed at making the region’s main rail link resistant to weather challenges. \nClosing The Gap recommends investment for the next 20 years to deliver £7.2 billion of regional gross value added (GVA) and £1.8 billion of transport benefits. Gary Streeter, MP for South West Devon (Image: John Allen) \nGary Streeter, Conservative MP for South West Devon \nA former Tiverton Grammar School boy, Gary Streeter’s focus for the region’s business community is in campaigning for the delivery of a modern communications infrastructure for the South West, both physical and virtual. \nThe roll-out of superfast broadband, improved on-board internet connectivity for train travellers, dualling of the A303 all the way to Honiton, and full dualling of the A30 through Cornwall are among his priorities. In 2019, he will pursue the case for funding a study into discreet electrification of certain routes. Dr Sarah Wollaston \nSarah Wollaston, Conservative MP for Totnes \nAs chair of the Health Select Committee in the House of Commons, the former GP has consistently challenged her government’s proposals for drastic financial cuts and systemic changes to health and social care provision across Cornwall and Devon. Defying the Tory whip by voting for Labour’s amendment to halt the roll-out of Universal Credit, she remains a thorn in the side of Theresa May, accusing the Prime Minister of “scapegoating” family doctors. She has announced a Health Select Committee inquiry into Sustainability and Transformation Partnerships and Accountable Care Organisations early in 2018. \nSPORT Craig Overton prepares to bowl during a two-day Ashes tour match against a Western Australian XI at the WACA in Perth on November 5, 2017 (Image: TONY ASHBY/AFP/Getty) \nCraig Overton, Cricketer \nCraig Overton, 23, is the older of Somerset fast-bowling twins. The Barnstaple-born sportsman won selection for England’s 2017/18 tour of Australia after an impressive county season. \nWith his brother Jamie, Craig’s career began at Instow CC, representing Devon in age-group cricket before graduating to Somerset and the England Under-19 set-up in early 2012. Craig played seven Championship matches that summer, winning a place at the Under-19 World Cup and then the Lions tour to Australia in early 2013. Andrew Cotton at home in North Devon (Image: Rob Tibbles) \nAndrew Cotton, Surfer \nNorth Devon surfer Andrew Cotton is on the road to recovery after breaking his back during a spectacular wipe-out big wave surfing in Portugal. \nThe top level athlete, adventurer and guest speaker is one of the world’s most respected big-wave surfers, travelling the globe surfing some of the biggest and heaviest waves on the planet such as Peahi in Hawaii, Mavericks in California and The Right in West Australia. Conrad Humphreys, centre, pictured with David Allen OBE and John Laramy \nConrad Humphreys, Yachtsman \nSouth Hams-based Conrad Humphreys has been a professional yachtsman for more than 20 years and most recently came to prominence as the professional skipper onboard the tiny 23ft open boat, Bounty’s End in the recreation of Captain Bligh’s epic story of survival, Mutiny on the Bounty for Channel Four. \nConrad is a triple round-the-world yachtsman. He competed as the youngest entrant in the Whitbread Round the World Yacht Race (now Volvo Ocean Race) and became the fifth British yachtsman in history to complete the legendary Vendée Globe, single-handed, non-stop around the world without assistance. Jack Nowell missed the Autumn internationals through injury (Image: Getty) \nJack Nowell, Rugby union player \nThe Newlyn-born 24-year-old is an established first-team player for the Exeter Chiefs, giving a try-scoring performance in the Premiership final as Chiefs claimed their maiden premiership title in 2017. Making his debut for England in the 2014 Six Nations Championship, he has scored 11 tries in 31 Tests. Tom Daley \nTom Daley, Diver \nThe Plymouth-born diver started his path to stardom aged seven as a member of Plymouth Diving Club, where his talent was identified early, and has made an impact in national and international competitions from the age of nine. He represented Great Britain at the 2008 Summer Olympics where he was Britain’s youngest competitor, age 14, and the youngest from any nation to participate in a final. \nAt the 2016 Olympic Games, Daley and Daniel Goodfellow won a bronze medal in the synchronised 10m platform. He also set an Olympic record score in the individual 10m platform, broken the following day by Chen Aisen. He married partner Dustin Lance Black at a lavish ceremony at Bovey Castle, Devon, in 2017. Like us on Facebook", "external_links": [], "published": "2018-02-01T18:07:00.000+02:00", "crawled": "2018-02-01T11:29:17.075+02:00", "highlightTitle": ""}