{"organizations": [], "uuid": "4c29570752314a1151cb08442582f9f44de548e0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article271471.ece/ALTERNATES/s1200/Neil-ParishJPG.png", "site_section": "http://www.middevongazette.co.uk/politics.rss", "section_title": "devonlive - News", "url": "https://www.devonlive.com/news/news-opinion/carmakers-should-stop-trying-beat-1214828", "country": "GB", "title": "Carmakers should stop trying to beat the system – and take their responsibilities to citizens seriously", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-14T17:50:00.000+02:00", "replies_count": 0, "uuid": "4c29570752314a1151cb08442582f9f44de548e0"}, "author": "Neil Parish", "url": "https://www.devonlive.com/news/news-opinion/carmakers-should-stop-trying-beat-1214828", "ord_in_thread": 0, "title": "Carmakers should stop trying to beat the system – and take their responsibilities to citizens seriously", "locations": [], "entities": {"persons": [], "locations": [{"name": "tiverton", "sentiment": "none"}, {"name": "honiton", "sentiment": "none"}], "organizations": [{"name": "european research group on environment and health", "sentiment": "none"}, {"name": "vw", "sentiment": "none"}, {"name": "volkswagen", "sentiment": "none"}, {"name": "invalid email  neil parish", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News opinion Carmakers should stop trying to beat the system – and take their responsibilities to citizens seriously Allegations that the largest car maker in the world, Volkswagen, are behind emissions tests on caged animals, including monkeys, are plain disturbing, says Neil Parish MP Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nNeil Parish is the Conservative MP for Tiverton and Honiton and has been since 2010 \nAllegations that the largest car maker in the world, Volkswagen, are behind emissions tests on caged animals, including monkeys, are plain disturbing. \nAn investigation found that 10 monkeys were locked in airtight chambers by researchers and made to breathe in diesel exhausts from a VW Beetle while watching cartoons. Such tests cannot be ethically justified or explained away - and those responsible should be held to account. Read More \nWhile the now defunct European Research Group on Environment and Health in the Transport Sector are said to be directly responsible, the organisation was financed by a trio of car giants including Volkswagen, Daimler and BMW. The research was conducted before the emissions scandal broke (Image: Getty) \nThe fact it was commissioned to defend diesel’s green reputation – and valuable tax breaks, only serves to compound the damaged trust in the auto industry. This was not about saving lives, but commercial advantage. \nFew will forget that in 2015, VW admitted 11 million diesel cars were manipulated with cheating software to make them seem less polluting. Read More I will not allow Brexit to side-line food and farming in this country \nCarmakers should stop trying to beat the system – and take their responsibilities to citizens seriously. Air quality is not an issue which will simply evaporate. Politicians in this country and around the world are determined to deliver clean air, because health matters - and lives are being cut short. Neil Parish MP \nFour key parliamentary Select Committees are about to release a report, following our joint inquiry into air quality at the end of last year. As Chair of the Environment Food and Rural Affairs Select Committee, I want our government to use every tool in the box to tackle toxic air. If that means being tough with big car companies like Volkswagen, so be it. Read More Plans to reopen Cullompton railway station are on the right track MP says \nOther nations have sought compensation for the 2015 ‘diesel dupe’. We should do the same. US diesel owners and government regulators have a settlement valued at more than £11 billion cash. \nBut here, Transport Ministers have been coy on what action, if any, will be taken against Volkswagen. I’m yet to understand why. Compensation could be ploughed back in to improving air quality, with further investment into electric vehicles, rapid charging networks and the Clean Air Zones this country desperately needs. Read More \nI fully understand that car companies provide skilled jobs and valuable investment in this country, but when their act needs cleaning up, let’s not sit in the slow lane. Like us on Facebook ", "external_links": [], "published": "2018-02-14T17:50:00.000+02:00", "crawled": "2018-02-14T17:58:00.000+02:00", "highlightTitle": ""}