{"organizations": [], "uuid": "eb2c62b725465a93f3e65b04037c0f74b86a24b6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.plymouthherald.co.uk/incoming/article1203675.ece/ALTERNATES/s1200/Farm-1.jpg", "site_section": "", "section_title": "", "url": "https://www.devonlive.com/news/devon-news/rural-leaders-call-change-planning-1203566", "country": "US", "title": "Rural leaders call for change to planning policy on homes for retiring farmers - Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "", "spam_score": 0.041, "site_type": "news", "published": "2018-02-12T18:37:00.000+02:00", "replies_count": 0, "uuid": "eb2c62b725465a93f3e65b04037c0f74b86a24b6"}, "author": "Athwenna Irons", "url": "https://www.devonlive.com/news/devon-news/rural-leaders-call-change-planning-1203566", "ord_in_thread": 0, "title": "Rural leaders call for change to planning policy on homes for retiring farmers - Devon Live", "locations": [], "entities": {"persons": [], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "wales", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}], "organizations": [{"name": "invalid email", "sentiment": "none"}, {"name": "country land and business association", "sentiment": "none"}, {"name": "homes for retiring farmers", "sentiment": "none"}, {"name": "cla", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Rural leaders call for change to planning policy on homes for retiring farmers Research has found farmers are older than people in other self-employed occupations Share Families are responsible for most British farms and much of the farmed land Share Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe planning policy on homes for retiring farmers in England must catch up with the rest of the UK before Brexit changes take effect, industry leaders have warned. \nThe Country Land and Business Association (CLA) says that while the planning frameworks of Wales, Scotland and Northern Ireland recognise that being able to build a new rural home can be crucial in helping a farmer to retire and in bringing young people into farming, England’s National Planning Policy Framework still does not. \nThe organisation, which represents 30,000 landowners, farmers and rural businesses in England and Wales, has set out the case for change in its Homes for Retiring Farmers paper, which was published last week. According to statistics included in the Homes for Retiring Farmers paper, the UK farming population is getting older (Image: Press Association) \nThe paper proposes that a “recognition of the needs of retiring farmers” should be added to paragraph 55 of the National Planning Policy Framework. This addition would encourage local authorities to grant permission for this type and purpose of rural development, it adds. \nMark Bridgeman, CLA deputy president, said: “The process of farm succession is notoriously difficult, and restrictions on building in the countryside create an additional barrier for farming families wanting to make space for the next generation to take over the farm business. Read More Search under way for 2018 Devon Farm Business Awards winners \n“Agriculture has an ageing workforce, and handing over the farm to the next generation or to a young person entering into the industry can be financially and emotionally difficult.” \nAccording to statistics included in the paper, the UK farming population is getting older. In 2000 only 5% of agricultural holders were under 35 years old, compared to 7% in 1990. Talking about succession and who will take over the family business can be a difficult conversation for farmers (Image: Rob Stothard / Getty Images) \nFarmers are also older than people in other self-employed occupations, with 52% of farmers 55 years or older, compared to 27% of rural self-employed and 22% of urban self-employed. \nThe paper also shows that families are responsible for most farms and much of the farmed land. A survey of 255 farmers in six areas of England found that 84% operated established family farms (farms run by operators who are at least the second generation of their family to be farming the same farm or nearby farm), and were responsible for managing 86% of the area covered by the survey. Read More South West owners warned to control their dogs as cost of livestock worrying claims rockets \nMr Bridgeman continued: “England is the only country in the UK that does not recognise in its planning system that a home on the farm for the retiring farmer to move into can really ease this process while also allowing the retired farmer to continue to provide advice and support. \nIt is expected that the changes Brexit will bring to the farming sector may be the catalyst for many farmers to retire, therefore now is the right time to change the National Planning Policy Framework, added Mr Bridgeman. \nThe Ministry of Housing, Communities and Local Government is currently undertaking a review of the National Planning Policy Framework for England. Like us on Facebook ", "external_links": [], "published": "2018-02-12T18:37:00.000+02:00", "crawled": "2018-02-12T18:47:32.001+02:00", "highlightTitle": ""}