{"organizations": [], "uuid": "7eccbb6ff501ac9fb68b3304dbea449dedb3dfa0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14296252.ece/ALTERNATES/s1200/SMD-visit.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/labour-plans-industrial-strategy-reverse-14295504", "country": "GB", "domain_rank": 21960, "title": "Labour plans Industrial Strategy to reverse North East decline that began in the 1980s", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-15T20:00:00.000+02:00", "replies_count": 0, "uuid": "7eccbb6ff501ac9fb68b3304dbea449dedb3dfa0"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/labour-plans-industrial-strategy-reverse-14295504", "ord_in_thread": 0, "title": "Labour plans Industrial Strategy to reverse North East decline that began in the 1980s", "locations": [], "entities": {"persons": [{"name": "long bailey", "sentiment": "none"}, {"name": "chi onwurah", "sentiment": "none"}, {"name": "rebecca long bailey", "sentiment": "none"}, {"name": "rebecca long-bailey", "sentiment": "none"}], "locations": [{"name": "south east", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "negative"}, {"name": "energy", "sentiment": "none"}, {"name": "labour’s industrial strategy", "sentiment": "none"}, {"name": "newcastle central", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Labour plans Industrial Strategy to reverse North East decline that began in the 1980s Shadow Business Secretary Rebecca Long Bailey met North East employers to discuss Labour's plans for industry Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily   Thank you for subscribing!   \nNorth East employers have met the authors of Labour’s plan to help businesses succeed in every part of the country. \nRebecca Long Bailey, Labour’s Shadow Business Secretary, visited Newcastle to consult employers about Labour’s Industrial Strategy, a plan designed to grow the economy and ensure region’s outside London and the South East get a fairer share of investment. \nShe was joined by Chi Onwurah, the Labour MP for Newcastle Central and the Shadow Business Minister responsible for the strategy. \nMs Long Bailey said: “We have set out a bold and ambitious industrial strategy, backed up by meaningful investment, to deliver the skills, infrastructure, business which will radically transform our economy.” Rebecca Long-Bailey MP, Shadow Secretary of State for Business, Energy and Industrial Strategy, is shown around SMD by Production Manager John Murphy (Image: Newcastle Chronicle) \nThe strategy sets out what Jeremy Corbyn ’s party will do if it wins the next election. Plans include creating new publicly-owned local energy companies and creating a ‘National Education Service’ which will allow worker to learn new skills at any point in their careers. \nLabour would also set up a National Investment Bank with nine regional banks, to provide investment for businesses including small firms. \nThis is part of a plan to provide £500bn of investment over ten years and it has been criticised by Conservatives who say it would mean borrowing huge sums of money. \nWhile some of the cash would come from the private sector, Labour has said it would borrow at least £250bn over ten years by selling Government bonds. Rebecca Long-Bailey MP, Shadow Secretary of State for Business, Energy and Industrial Strategy, is shown around SMD by Production Manager John Murphy (Image: Newcastle Chronicle) \nThe politicians visited Newcastle-based Soil Machine Dynamics, the world’s second-biggest provider of remotely-operated underwater vehicles. \nThey hosted a round table debate for business leaders at the Mining Institute in Newcastle. \nLabour points out there are still huge differences between economic output in the North and in the South. The latest figures, which are for 2015, show GVA per head - the official measure of economic output - was £43,629 in London while it was £18,927 in the North East and £21,867 in the North West. \nSpeaking at the event, Ms Onwurah said the North East was still suffering the effects “forced de-industrialisation” under the Conservative Government led by Margaret Thatcher in the 1980s. \nShe said: “The legacy of this economic neglect for our region is low productivity, low-pay, and under-investment. Newcastle Central MP, Chi Onwurah (Image: Newcastle Chronicle) \n“Since the financial crisis, UK wage and productivity growth has been poor, and in the North East we have the highest levels of unemployment and underemployment in the country. \n“Despite talk from this Government o f a ‘Northern Powerhouse’, only £220 per head is spent on transport in the North East, compared to over £2,000 per head in London. \n“Despite this the North East has so much to offer: no other region can boast our energy mix, with towns such as Blyth already benefitting from the energy boom. And here in Newcastle our tech economy is the fastest growing in the UK outside of London. Read More Labour government would label meat from animals which haven't been stunned \n“But I believe that to help the North East prosper we need to do more. We need a proper Labour industrial strategy that empowers businesses with the skilled workforce, modern infrastructure and business support that you need to succeed.” \nMs Long Bailey said: “We have set out a bold and ambitious industrial strategy, backed up by meaningful investment, to deliver the skills, infrastructure, business which will radically transform our economy. Rebecca Long-Bailey MP, Shadow Secretary of State for Business, Energy and Industrial Strategy, is shown around SMD by Production Manager John Murphy (Image: Newcastle Chronicle) \n“This series of round tables will gather the views of businesses up and down the country to ensure our strategy is relevant and responsive to business.” What’s in Labour’s Industrial Strategy? \nThe initial Industrial Strategy was published before the 2017 election. Labour is now consulting on the plans and says it will develop them further before the next election. \nEnergy \nLabour says it will set up new publicly-owned energy companies to supply households with energy and services to reduce energy demand. \nSkills \nA ‘National Education Service’ will make it easier to obtain adult education and life-long learning. The idea is that working people will be able to learn new skills throughout their lifetimes. \nResearch and development \nLabour says it will increase research and development in the UK by providing £1.3bn in public funding in its first two years in office. \nIn turn, it says this bring in more private investment. \nThe way the Government distributes research and development funding will be reviewed, to ensure that money is distributed in a way that reduces regional inequality. \nFunding for businesses \nA ‘National Investment Bank’ will be created to provide funding for both the public and the private sector in a way that delivers growth in every part of the country. \nLabour says that one of the major causes of imbalances in our economy is that in recent years the pursuit of short-term return has guided investment disproportionately towards London and the South-East. \nThe national bank will have a network of nine regional development banks, and these will provide funding for businesses, particularly small firms, which Labour says currently find it difficult to obtain investment. \nInvestment in infrastructure such as transport \nA ‘National Transformation Fund’ will be created to increase investment in UK energy, transport and digital infrastructure. \nThis will include major projects such as building a new “Crossrail for the North” rail line running from the North East to the North West. \nLabour also says it would make “strategic investments in rail freight in the North East”. The industrial strategy included a pledge to upgrade the trains on the Tyne and Wear Metro, though since it was published the present Government has allocated funding to do this too. \nAnd the Labour says it will “retrofit buses to improve comfort and environmental standards”. Read More Boris Johnson calls for Brexit unity - then hints he'll resign if he doesn't get what he wants \nFree Wi-Fi \nA Labour Government would “work with local authorities to provide free public Wi-Fi in city centres” - following the examples of Newcastle and Sheffield, which have already introduced free Wi-Fi schemes. \nDiscouraging overseas supply chains \nMajor manufacturers will be encouraged to buy parts and services from UK suppliers. At the moment, many of them have supply chains stretching across many countries. \nOnly good employers will get Government contracts \nThe Government spends £200bn a year in private sector contracts, and Labour says it would use this spending power to support British industry, and to encourage firms to pay good wages. \nIt would require any company bidding for a public sector contract to give full trade union recognition for their workforce and move towards a ratio of 20:1 between the lowest and highest paid staff, so that top managers cannot earn more than 20 times what the lowest-paid staff get. Like us on Facebook", "external_links": [], "published": "2018-02-15T20:00:00.000+02:00", "crawled": "2018-02-15T20:16:01.052+02:00", "highlightTitle": ""}