{"organizations": [], "uuid": "89b3b321fe45d3fc7d6b73fa6e967969bdc56da0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14338886.ece/ALTERNATES/s1200/Brexit.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/jeremy-corbyn-says-labour-wants-14338776", "country": "GB", "domain_rank": 21960, "title": "Jeremy Corbyn says Labour wants a Brexit to support the car industry", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-26T15:16:00.000+02:00", "replies_count": 0, "uuid": "89b3b321fe45d3fc7d6b73fa6e967969bdc56da0"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/jeremy-corbyn-says-labour-wants-14338776", "ord_in_thread": 0, "title": "Jeremy Corbyn says Labour wants a Brexit to support the car industry", "locations": [], "entities": {"persons": [{"name": "jeremy corbyn", "sentiment": "neutral"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "coventry", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "neutral"}, {"name": "eu", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jeremy Corbyn says Labour wants a Brexit to support the car industry Labour leader announces support for membership of 'a customs union' following warnings from carmakers such as Nissan Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nJeremy Corbyn has vowed to protect the nation’s car industry, as he said Labour wanted to negotiate a new “customs union” with the European Union. \nThe announcement, in a high-profile speech in Coventry, means a Labour government would try to negotiate a new customs union with the EU, allowing goods to be transported between the UK and EU countries without restrictions after Brexit. \nThe Conservative government has ruled out membership of a customs union, which means there is now a clear difference between the parties on Brexit. \nCarmakers including Nissan have said it is essential that the UK stays in a customs union, because their businesses depend on the ability to import parts from suppliers across Europe. \nAnd Mr Corbyn responded directly to their concerns, using Mini-manufacturer BMW, which has a headquarters near Coventry, as an example. \nHe said: “If we look at the example of one of Britain’s most iconic brands in this sector, the Mini, we begin to see how reliant our automotive industry is on a frictionless, interwoven supply chain. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \n“A mini will cross the Channel three times in a 2,000-mile journey before the finished car rolls off the production line. Starting in Oxford it will be shipped to France to be fitted for key components before being brought back to BMW’s Hams Hall plant in Warwickshire where it is drilled and milled into shape.” \nHis comments echoed a warning delivered by Colin Lawther, a Senior Vice President at Nissan, to a House of Commons inquiry last year. \nMr Lawther said that production at Nissan’s Sunderland plant depended on the ability to bring about 5 million parts into the plant every day without delays - many of them imported from Europe. Read More Historic change to organ donor law approved as MP shares her daughter's heart-rending story \nMr Corbyn’s announcement that Labour would support membership of a customs union is seen as a major new development in the party’s Brexit policy. \nHowever, the Labour leader said the UK should not remain part of the existing customs union. Instead, it should negotiate a new customs union which allows the UK to help make the rules - rather than accepting rules drawn up by the EU - and which allows the UK to sign new trade deals with other parts of the world, he said. Labour leader Jeremy Corbyn (Image: PA) \nMr Corbyn said: “A new customs arrangement would depend on Britain being able to negotiate agreement of new trade deals in our national interest. \n“Labour would not countenance a deal that left Britain as a passive recipient of rules decided elsewhere by others. That would mean ending up as mere rule takers.” \nHe also made it clear that Labour would take the UK out of the single market, saying: “Labour would negotiate a new and strong relationship with the single market that includes full tariff-free access and a floor under existing rights, standards and protections.” Read More Is vaping bad for you or is it safe? More people are switching to e-cigarettes \nMr Corbyn may have been paving the way for Labour to support a rebel Conservative House of Commons amendment designed to keep the UK in some form of customs union with the EU. Tory MP Anna Soubry is backing the amendment, and in theory Conservative rebels and Labour could have the numbers to defeat the Government. \nThere has been speculation that this could even force Prime Minister Theresa May to call another general election, giving Mr Corbyn the opportunity to become Prime Minister, though it remains to be seen whether a significant number of Conservative Mps really would vote against the Government. Prime Minister Theresa May (Image: AP) \nLiam Fox, Conservative Secretary of State for International Trade, described Labour’s approach as cynical. \nHe said: “This is a cynical attempt by Labour to try and frustrate the Brexit process and play politics with our country’s future – all the while, betraying millions of Labour voters. \n“Labour’s confused policy would be bad for jobs and wages, it would leave us unable to sign up to comprehensive free trade deals, and it doesn’t respect the result of the referendum.” \nAnd North East independent MEP Jonathan Arnott said: “Whatever weasel words they use, substituting ‘the’ for ‘a’, today is the day that Labour make clear they do not support the will of the British people. They do not support the referendum result, in which more people voted Leave than have ever voted for anything in British political history. They do not support their own General Election Manifesto, to which scores of Labour MPs owe their seats.” \nBut Mr Corbyn was praised by the CBI, the body that represents major employers. \nCarolyn Fairbairn, CBI Director-General, said: “The Labour leader’s commitment to a customs union will put jobs and living standards first by remaining in a close economic relationship with the EU. It will help grow trade without accepting freedom of movement or payments to the EU. \n“Growing trade is not an ‘either or’ question – Germany already exports five times as much with China as the UK from within the customs union. Many thousands of ambitious UK firms are looking to break into new markets. These companies need Government to focus on making access to markets simpler, not putting up barriers to our most important trading partner. \n“Importantly, a customs union will go part of the way to providing a real-world solution to the Irish border question that is of such urgent concern to the people and firms of Northern Ireland.” Like us on Facebook ", "external_links": [], "published": "2018-02-26T15:16:00.000+02:00", "crawled": "2018-02-26T16:37:14.005+02:00", "highlightTitle": ""}