{"organizations": [], "uuid": "709c221da7f44965e2946566ff06a7d88808b53a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14292322.ece/ALTERNATES/s1200/TMP_NEC_051217NewcastleCityCentreStockPics17JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/newcastle-students-refuse-support-striking-14292295", "country": "GB", "domain_rank": 21960, "title": "Newcastle students refuse to support striking lecturers - but they won't condemn them either", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-15T13:00:00.000+02:00", "replies_count": 0, "uuid": "709c221da7f44965e2946566ff06a7d88808b53a"}, "author": "Hannah Graham", "url": "https://www.chroniclelive.co.uk/news/north-east-news/newcastle-students-refuse-support-striking-14292295", "ord_in_thread": 0, "title": "Newcastle students refuse to support striking lecturers - but they won't condemn them either", "locations": [], "entities": {"persons": [{"name": "ronnie reid", "sentiment": "none"}], "locations": [{"name": "durham", "sentiment": "none"}], "organizations": [{"name": "newcastle university", "sentiment": "negative"}, {"name": "newcastle", "sentiment": "negative"}, {"name": "university and college union", "sentiment": "none"}, {"name": "universities uk", "sentiment": "none"}, {"name": "newcastle university students’ union", "sentiment": "none"}, {"name": "nusu", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Newcastle University (Image: newcastle chronicle) Share Get daily   Thank you for subscribing! Could not subscribe, try again later Invalid Email \nStudents have refused to support their striking lectures - but they won’t take a stand against them either. \nMembers of the University and College Union at Newcastle , as well as Durham, are set to walkout for 14 days in a dispute over changes to pensions. \nLast Thursday, Newcastle University Students’ Union (NUSU)’s student council rejected a motion to “[express] support for the actions of the striking lecturers.” \nAt the same time, students voted down an opposing motion, which argued that any more money for lecturer pensions “is not in keeping with student value for money” and calling on the union to work with employer body Universities UK on a “sustainable scheme”. \nThe motion was brought by NUSU president Ronnie Reid, who argued that the current system of lecturers’ pension was running a deficit, and that maintaining it as it is, could cost academics and students money. Read More Newcastle and Durham university strike dates announced with 14 days of disruption planned \nAfter the votes, Mr Reid said: “As a result of the Student Council meeting of February 8, it has been decided that NUSU will take a neutral stance on the proposed industrial strikes beginning on February 22. \n“NUSU will instead fully focus on supporting all students that may be impacted by the action. This includes gaining ring fenced assurances on PEC forms for affected dissertations and assignments.” \nNUSU marginalised genders officer Emily Sherwood brought the motion in support of the strikers to the council, and resigned at the meeting when the motion failed to pass. \nIn a statement announcing their resignation, they said: “The motion I brought forward to council as part of a larger group of students supporting the strike was critical in deciding what sort of union NUSU is and aims to be: either a union which acts like one and supports on-campus struggles, or an institution which functions only in the interests of university management. \n“The wellbeing of staff directly affects their teaching conditions. Their teaching conditions are our learning conditions. We should not be pitted against each other but working alongside each other in our struggles.” Read More Leading Newcastle University cancer professor leaves the UK - citing Brexit fears \nBy contrast, at time of writing, nearly 2,500 students had signed a petition demanding that Newcastle University refund students some of their fees for every lecture missed during the strikes. \nProfessor Chris Day, vice-chancellor and president of Newcastle University, said: “I can assure our students that we are making every effort to minimise the impact that industrial action may have on them. \n“The University Library, PC clusters and other services/facilities will remain open as usual, although there may be reduced staffing in some parts of the University. Topics that have not been delivered because of industrial action will be excluded from any assessments. \n“We are disappointed that things have got this stage, and we understand the strength of feeling among our students as well as our staff. As this is a national issue, it cannot be resolved locally by Newcastle University but we do hope that an agreement can be reached quickly.” Like us on Facebook", "external_links": [], "published": "2018-02-15T13:00:00.000+02:00", "crawled": "2018-02-15T13:13:40.002+02:00", "highlightTitle": ""}