{"organizations": [], "uuid": "38e19d7ff7f92df1ceb54a42949591036cfcd19f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.plymouthherald.co.uk/incoming/article1203122.ece/ALTERNATES/s1200/DFBA-1.jpg", "site_section": "http://www.devonlive.com/rss.xml", "section_title": "devonlive - frontpage", "url": "https://www.devonlive.com/news/devon-news/search-under-way-2018-devon-1203037", "country": "US", "title": "Search under way for 2018 Devon Farm Business Awards winners", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-12T17:49:00.000+02:00", "replies_count": 0, "uuid": "38e19d7ff7f92df1ceb54a42949591036cfcd19f"}, "author": "Athwenna Irons", "url": "https://www.devonlive.com/news/devon-news/search-under-way-2018-devon-1203037", "ord_in_thread": 0, "title": "Search under way for 2018 Devon Farm Business Awards winners", "locations": [], "entities": {"persons": [{"name": "devon", "sentiment": "none"}, {"name": "stephens scown", "sentiment": "none"}, {"name": "addington fund", "sentiment": "none"}], "locations": [{"name": "devon", "sentiment": "none"}], "organizations": [{"name": "devon farm business awards", "sentiment": "none"}, {"name": "dcaa", "sentiment": "none"}, {"name": "devon county agricultural association", "sentiment": "none"}, {"name": "addington fund", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Search under way for 2018 Devon Farm Business Awards winners The awards highlight the excellence and dynamism of farming in Devon Share Winners and sponsors at last year's Devon Farm Business Awards. Nominations are now being sought for the 2018 event Share Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe search is on for excellence in Devon agriculture as the fifth Devon Farm Business Awards were launched this week. \nThe awards highlight the excellence and dynamism of farming in Devon at a time of great uncertainty within the agricultural sector and are organised by the Addington Fund, the Devon County Agricultural Association (DCAA) and leading regional solicitors Stephens Scown. \nSheila Cole, Chairman of Trustees of the Addington Fund said: “The Devon Farm Business Awards are a wonderful opportunity to celebrate all that is great about Devon’s farmers. The awards will be presented on Wednesday, May, 18 at the Westpoint showground \n“The Addington Fund is deeply committed to helping the farming community in Devon. Farmers are not great at singing their own praises, but these awards are a real chance for the county’s farmers to receive the recognition they so richly deserve. \n“The trustees are very grateful for the ongoing support of Stephens Scown, Devon County Agricultural Association and all the sponsors, which has contributed greatly to the success of the Awards.” Read More \nFarmers and growers in Devon are invited to apply for one of the following categories: Best Commercial Farmer; The CAAV John Neason Diversification Award; Devon’s Best Young Farmer; Best Woman in Farming; Lifetime Achievement Award. \nDevon’s Farmer of the Year will be awarded from the category winners. \nPhil Reed, partner and head of rural services at Stephens Scown said: “Farmers are notoriously reluctant to shout about their success, but that is exactly what we need to do. The Devon Farm Business Awards is our way of saying thank you and celebrating success. Read More Devon and Cornwall police rescue 200 farm workers in modern slavery raid \n“Please take the time to put yourself forward, or nominate another farmer who is doing great things. We need to give the sector the recognition it deserves for the enormous contribution it makes to all of our lives.” \nMrs Mary Quicke MBE, Chairman of the DCAA, added: “The Devon Farm Business Awards provide so many inspiring examples of how family farming businesses are rising to the many challenges of today’s world. And that has never been more important, given the many uncertainties that still surround the Brexit process and its implications for farming. Rachel Leonard of Northcott Barton Farm, winner of Best Woman in Farming at the 2017 Devon Farm Business Awards \n“What we can be sure of, however, is that the best farming businesses, in terms not only of production efficiency, but also customer focus and environmental awareness, will survive and prosper whatever the future holds. By turning the spotlight on those businesses, and highlighting the lessons they provide, the awards have a key role in equipping us for that future.” \nEntries close on Friday, March 9, with the winners being announced at a gala dinner to be held on the eve of the Devon County Show, on Wednesday, May, 18 at the Westpoint showground. \nInformation about the awards and how to enter can be found at www.addingtonfund.org.uk/event-type/devon-farm-business-awards Like us on Facebook ", "external_links": [], "published": "2018-02-12T17:49:00.000+02:00", "crawled": "2018-02-12T18:04:22.030+02:00", "highlightTitle": ""}