{"organizations": [], "uuid": "aa7cd285a5dec0c93a9912670aef0350256b583c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article9696777.ece/ALTERNATES/s1200/JS62958534.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/ivory-trade-stain-humanity-should-14279081", "country": "GB", "domain_rank": 21960, "title": "Ivory trade is a 'stain on humanity' and should be banned completely says North Tyneside MP", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-13T07:00:00.000+02:00", "replies_count": 0, "uuid": "aa7cd285a5dec0c93a9912670aef0350256b583c"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/ivory-trade-stain-humanity-should-14279081", "ord_in_thread": 0, "title": "Ivory trade is a 'stain on humanity' and should be banned completely says North Tyneside MP", "locations": [], "entities": {"persons": [{"name": "mar", "sentiment": "negative"}, {"name": "michael gove", "sentiment": "none"}, {"name": "glindon", "sentiment": "none"}, {"name": "mary glindon", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}], "organizations": [{"name": "invalid email  north tyneside", "sentiment": "none"}, {"name": "time", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Ivory trade is a 'stain on humanity' and should be banned completely says North Tyneside MP Mary Glindon joins campaigners calling on Michael Gove to act as the partial ban currently in place means elephants are still hunted for their tusks Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nNorth Tyneside MP Mary Glindon has backed calls for a total ban on the ivory trade which she describes as a “stain on humanity”. \nEnvironment Secretary Michael Gove is looking at the results of a consultation into Government proposals for such a plan which received 70,000 responses. \nAnd MPs are urging him to press ahead with the proposal, to discourage the slaughter of elephants. \nMs Glindon said : “The poaching crisis is a stain on humanity and is pushing an iconic species to extinction. The UK wants to be a world leader in tackling the illegal wildlife trade and tough laws can end UK ivory markets once and for all. \n“Time is running out for elephants and we must act now before it is too late.” Elephants are still hunted for their tusks (Image: ROBERTO SCHMIDT/AFP/Getty Images) \nThe UK already prohibits the sale of ivory pieces produced after 1947. But there are fears that newer pieces of ivory are also being sold in the UK, with dealers lying about the date items were produced. \nThe former Metropolitan police commissioner, Lord Hogan-Howe, warned in a House of Lords debate that the current legislation was “fuelling demand for ivory and providing a hiding place for illegal modern ivory to be laundered through the legal market”. \nCampaigners say it means UK demand for products is helping encourage the slaughter of elephants for their tusks. \nPressure on the Government to act has grown after China introduced a complete ban on ivory last year. Read More 'Stop taking us for idiots': Theresa May facing Brexit backlash from North East employers \nAnd 92 MPs have signed a House of Commons motion calling on the Government “to press for a total ban on ivory sales and to close down the UK ivory market, including that of antique ivory, with immediate effect”. \nMs Glindon spoke after attending an event in the Commons where campaigners displayed tusks and parts of tusks from a herd of 30 elephants. \nShe said: “Each ivory piece I saw represents a dead elephant, shot or poisoned for its tusks. Ivory surrender is a practical way for concerned citizens to show their disgust and help end this trade.” Michael Gove \nPolling commissioned by International Fund for Animal Welfare and carried out by YouGov revealed an overwhelming 95% of respondents stated that they would not be interested in purchasing antique ivory. A YouGov survey of MPs also found 97% of MPs to be supportive of either a total ivory ban or a ban with some exemptions. \nThe Department for the Environment, Food and Rural Affairs said Ministers were looking at the responses to the consultation and a decision is expected in due course. Read More Northumbria Police boss warns 'vulnerable' force will struggle to cope with emergencies \nSpeaking at the close of the consultation in January, Mr Gove said: “It is imperative we halt the decline in the elephant population to protect these wonderful animals for future generations. \n“It’s incredibly heartening that so many people have contributed to our consultation. The response underlines that we are a nation which cares for wildlife. In 2018 the UK must be front and centre of global efforts to end this insidious trade.” Like us on Facebook", "external_links": [], "published": "2018-02-13T07:00:00.000+02:00", "crawled": "2018-02-13T07:17:22.032+02:00", "highlightTitle": ""}