{"organizations": [], "uuid": "579653b1f7e204accac1975c029a9db66558f26a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article1153233.ece/ALTERNATES/s1200/MSP_MERC_01FEB18_9108JPG.jpg", "site_section": "http://www.leicestermercury.co.uk/rss.xml", "section_title": "leicestermercury - frontpage", "url": "https://www.leicestermercury.co.uk/news/business/unite-union-vows-fight-plans-1153212", "country": "GB", "domain_rank": 48128, "title": "Unite union vows to fight plans that could see 270 jobs cut at Brush in Loughborough", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-01T19:33:00.000+02:00", "replies_count": 0, "uuid": "579653b1f7e204accac1975c029a9db66558f26a"}, "author": "Tom Pegden", "url": "https://www.leicestermercury.co.uk/news/business/unite-union-vows-fight-plans-1153212", "ord_in_thread": 0, "title": "Unite union vows to fight plans that could see 270 jobs cut at Brush in Loughborough", "locations": [], "entities": {"persons": [{"name": "matt short", "sentiment": "none"}], "locations": [{"name": "loughborough brush gene", "sentiment": "none"}, {"name": "loughborough", "sentiment": "none"}], "organizations": [{"name": "loughborough news unite", "sentiment": "negative"}, {"name": "unite", "sentiment": "none"}, {"name": "brush generators", "sentiment": "none"}, {"name": "loughborough", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Unite union vows to fight plans that could see 270 jobs cut at Brush in Loughborough Brush Generators warns workers a big drop in sales has put their jobs at risk - before sending them home for the day Share Brush Turbogenerators in Loughborough (Image: Matt Short) Share Get Business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nUnite has vowed to challenge the rationale behind plans to axe up to 270 people at Brush Generators in Loughborough. \nBrush told workers this morning that their jobs were at risk, before sending them home for the day. \nThe Loughborough company said cuts were needed following a big downturn in revenue. \nIt said sales of its generators, used in everything from power plants to heavy industry, had been hit hard by customers switching over to sustainable ways of energy production. Read More Brush Generators issue full statement over claim 270 jobs at risk \nIt is understood a consultation will get underway with staff next week. \nThe union Unite said shifting production overseas and cutting jobs here would put a big hole in the region’s engineering skills base. \nUnite national officer Linda McCulloch said: \"Unite will be fighting to save jobs and protect our members’ interests. \n\"This is a highly skilled workforce who contributes massively to the local economy and wider UK engineering and manufacturing sector. \n\"Offshoring their jobs will deny the local community of decent well paid work and further hollow out the region’s engineering skill base. \n\"Unite is far from convinced of the case behind this move and will be challenging the rationale during the consultation. Read More 270 Brush workers in Loughborough 'told to go home' \n\"Over the coming days and weeks, Unite will be giving maximum support to our members through this distressing time as we fight to protect jobs and skills.\" \nBrush chief executive Chris Abbott said there had been a \"critical\" drop in orders for the type of generators made in Loughborough. The Brush site this morning (Image: Loughborough Echo) \nHe said: \"We must therefore consult on the need to reduce our manufacturing capacity in order to safeguard the long term future of Brush and protect the legacy of one of Britain’s longest established manufacturing businesses. \n\"We will do our utmost to ensure that the affected employees are supported to the best of our ability and that we find the most favourable outcomes for all concerned. Read More 36 jobs at risk with closure of dry cleaning company \n\"Loughborough nevertheless remains at the heart of our after-market operations, which are flourishing, and the transformers unit, which is also performing well. \n\"We will also continue to focus upon innovative solutions with investment in our engineering, research and product development presence at Loughborough – where we have a real leadership edge.” \nLoughborough MP Nicky Morgan said: “It's very sad news and it will be a big loss for the town.” Nicky Morgan \nShe said Brush management had written to her and confirmed workers were being told to come back to work on Monday for an update. \nAsked if she thought that the job losses could be due to Brexit, she said: “I think it is too early to speculate. The first concern is the employees and supporting their future.” \nBrush has been part of Loughborough’s industrial heritage for more than 125 years. \nThe massive site between Nottingham Road and Meadow Lane is also home to Brush Traction and Transformers. Like us on Facebook ", "external_links": [], "published": "2018-02-01T19:33:00.000+02:00", "crawled": "2018-02-01T20:46:10.012+02:00", "highlightTitle": ""}