{"organizations": [], "uuid": "38433a319dbe7b232abe0341bc417ad43546366c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13957710.ece/ALTERNATES/s1200/JS115501421-1.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14276977", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Serious Fraud Office charges Barclays over £2.2bn loan to Qatar", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-12T10:30:00.000+02:00", "replies_count": 0, "uuid": "38433a319dbe7b232abe0341bc417ad43546366c"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14276977", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Serious Fraud Office charges Barclays over £2.2bn loan to Qatar", "locations": [], "entities": {"persons": [{"name": "jonathon manning", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "qatar", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "barclays", "sentiment": "negative"}, {"name": "serious fraud office", "sentiment": "negative"}, {"name": "barclays bank", "sentiment": "negative"}, {"name": "qatar canary wharf", "sentiment": "negative"}, {"name": "hsbc", "sentiment": "negative"}, {"name": "sfo", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The president of Sunderland based outdoor brand Berghaus has stepped down from the business . \nRichard Leedham has spent the last 22 years with Berghaus, spending recent years driving forward a business turnaround which last year saw the firm return to profit. \nDocuments have now been filed at Companies House confirming his departure from the firm, which forms part of the Pentland Brands and is based in the multiaward-winning building in Sunderland which has previously been voted one of the coolest offices in the region. \nMr Leedham said: \nIt’s been an incredible experience for me, leading a brand that I’ve loved since my youth and working with such a talented and passionate team. \nI’ll always be grateful to Pentland for the opportunity that I’ve had here and to everyone in the company and wider industry who has supported me in my time at Berghaus. \nThanks to continued significant investment from Pentland Brands, there are some exceptional product and marketing initiatives on the horizon that will make a big impact, and that is a very exciting prospect for whoever takes on the role of brand director. \nChris Stephenson, global president, active division, Pentland Brands, said: \nI’d like to thank Richard for his outstanding contributions to the Berghaus business. He’s been a passionate leader and will always be a member of the Berghaus and Pentland extended family. \nFor now, it’s business as usual and I’d like to thank Richard for his commitment to supporting the smooth transition for his teams, our partners and our customers. \nMost recent accounts for the business, which designs and makes outdoor clothing, footwear and accessories, show the firm turned an operating loss of £4.8m in 2015 into profit of £800,000 for 2016. \nAnd while overall turnover dropped from £57m in 2015 to £54.7m, the firm grew sales for the third year running in the UK, the brand’s primary territory. Richard Leedham, Berghaus brand president 9:20 Jonathon Manning Bricklayers and plumbers set to earn above the national average by 2022 \nWorkers training to be plumbers, electricians and bricklayers can expect to earn well above the national average when they are qualified, according to a new study.People learning a trade can expect to earn around £2,000 a year above the national average by 2022, research by Screwfix found.The DIY chain predicted that the highest earners will be plumbers and electricians, with pay set to reach £31,000.The average annual salary of a tradesperson will be over £27,500 by 2022, said the report.Graham Bell, chief executive of Screwfix, said: \nThe research supports our belief that a trade apprenticeship is a strong career choice for young people in this country. \nApprenticeships lead to careers in highly skilled jobs, which are in high demand and therefore attract a healthy, competitive salary. \nFor young people starting out they offer a great career choice without the burden of large debts from university fees. Screwfix has helped Kingfisher make £787m in profit 9:16 Inquiry into Intercity East Coast rail franchise to be launched \nThe Transport Committee is launching an inquiry into the InterCity East Coast rail franchise.The Committee said there are “serious questions” to be asked, adding that they will look at the best way forward, and the wider implications for the rail franchising system.Earlier this month, Transport Secretary Chris Grayling announced that the Stagecoach-led franchise would only be able to continue in its current form for a “very small number of months”.Lilian Greenwood, chair of the Committee, said: \nThis failure - not once, but three times - has drawn criticism from all corners. \nThere are serious questions to be asked of the train operator, Network Rail and ministers, and the Transport Committee intends to ask them. \nThe failure of the East Coast franchise has wider implications for rail franchising and the competitiveness of the current system. \nLessons need to be learned by all concerned. In the meantime, the Department for Transport must take the right steps to protect passengers and taxpayers. \nSafeguards must be put in place to restore public confidence in the sustainability of our railways. \nA Stagecoach Group spokesman said: \nVirgin Trains East Coast is a \nwell-run, profitable railway and we are continuing to meet our contractual commitments, as we have done throughout the past 21 years in operating train services on behalf of the government \nWe are progressing our £140m investment plans, topping franchise league tables for customer satisfaction and delivering 30% higher payments to the taxpayer than when the route was in public ownership, and we are happy to assist the work of the Transport Committee. \nA Department for Transport official said: \nThe Transport Secretary has been clear over the issues facing the East Coast rail franchise and the next steps we will take to protect services for passengers. \nWe will work with the Transport Select Committee on this inquiry. Long-distance services on the East Coast Main Line could be re-nationalised within months (Image: PA) 9:13 Jonathon Manning Australia's Smiggle to open Oxford Street flagship store \nAustralian stationery retailer Smiggle is set to defy the gloom hanging over the British high street as it presses ahead with plans to open a flagship store on London’s Oxford Street.Managing director John Cheston told the Press Association that Smiggle is not scaling back its ambitious store opening programme. \nWe had a very strong half, and the first quarter was very strong with back to school, we will consider prudently our store openings. \nBut the target is still to be bringing in 200 million Australian dollars (£112m) in revenue by 2019 and to have around 200 stores, including opening a two floor Oxford Street flagship in May. \nIt could be less than 200 stores, it could be more, depending on the deal we get with landlords. \nSmiggle - which bills itself as the “ultimate creator of colourful, fun, fashion-forward stationery” - currently has 125 UK stores.The group currently employs 1,000 people in the UK, but this will grow to over 2,000 with 200 stores.Its British arm reported sales of £29m in 2016 and recorded a £3.8m pre-tax profit, according to accounts filed at Companies House.Smiggle’s expansion comes at a brutal time for the sector, with several retailers announcing large scale job cuts and store closure plans over the past months.This has included fellow Australian firm Wesfarmers, which is the ultimate parent company of DIY chain Homebase.The group said this month that between 20 and 40 of the worst performing Homebase stores could close down, with 2,000 jobs at risk.Retailers have been hit by a surge in Brexit-fuelled inflation, which has seen the cost of goods rocket and consumer confidence plummet since the referendum result.On Brexit, Mr Cheston added: \nWe are insulated to a certain degree from inflation, parents cherish their kids and grandchildren and our entry price is low. \nBut at the same time, stagnant wage growth, rising interest rates and inflation are problems. \nSmiggle is ultimately owned by Premier Investment, the firm chaired by Australian billionaire Solomon Lew. A Smiggle store packed with goodies 9:00 Jonathon Manning North Shields Jiu Jitsu company gets backing from Dragons' Den star \nA North East Jiu Jitsu business has gained a host of new members after Dragons’ Den star Theo Paphitis promoted the business by tweeting about the company to his 500,000 online followers. \nJonathan Poulter, who co-owns Serenity Jiu Jitsu with Anne Haswell, tweeted the businessman about his martial arts gym as part of the Small Business Sunday, Mr Phapitis’ regular online slot in which he promotes small businesses. \nThe gym was one of six weekly winners to have its message retweeted by Mr Paphitis to his Twitter followers, giving the gym a major profile boost. \nMr Poulter’s tweet highlighted how martial arts classes often help students improve their confidence, focus, and sometimes even their grades at school. \nMr Poulter said: \nWe’ve only been in business for six months so it is great to have support from Theo this early on. \nIt’s difficult for small businesses to raise their profile and Theo has recognised our hard work and helped spread the word about our adults, children and school classes to his following. Excited to see him and other Small Business Sunday winners at his annual networking event, as well as checking in with other winners in their exclusive weekly Twitter #SBSWinnersHour. \nThe North Shields company specialises in teaching Brazilian Jiu Jitsu, submission grappling, and self defence classes. Adult classes take place from Monday to Saturday, while children’s classes take place on a Mondays, Thursdays and Saturdays. Anne Haswell (L) training at Serenity Jiu Jitsu with one of the gym's members (Image: Serenity Jiu Jitsu) 8:55 Jonathon Manning Businesses enjoying strong start to 2018, research shows \nBusinesses are enjoying a strong start to the year despite mounting uncertainty over Brexit, driving an expected increase in economic output, according to new research.A study by business advisors BDO LLP suggested that the UK can expect GDP growth of around its long-term trend of 2% in the early part of 2018.The services sector has seen an improving performance, linked to the pickup in the global economy and better than expected consumer spending in the UK, said the report.Record high employment levels look set to continue early in the first half of the year, although further increases in prices could be on the horizon for UK consumers, said BDO.Peter Hemington, a partner at BDO LLP said: \nBritish businesses have made a strong start to 2018 despite the ongoing uncertainty about our nation’s future outside of the EU. \nHowever, if the government continues to stall on providing a clear Brexit strategy for businesses, the performance of UK firms will suffer. \nWe need the government to align quickly and communicate its Brexit plan. It is crucial so that UK businesses can make informed investments to best prepare for the future. Money (Image: PA) Jonathon Manning Japanese firms could leave the North East after Brexit, top ambassador warns \nThe future of a number of some of the North East’s largest employers has been called into question after Japan’s top ambassador said unprofitable firms may not stay after Brexit . \nJapanese companies such as Nissan , Hitachi and Komatsu employ thousands of people across the North East, but Japanese ambassador Koji Tsuruoka warned that a bad trade deal with the EU could force many of these companies to leave the country. \nHis comments were made outside Downing Street after Mr Tsuruoka met with Prime Minister Theresa May and 19 heads of Japanese companies. \nDuring the meeting Mrs May reiterated her promise that Brexit would allow the UK to strike a free trade deal with Japan. \nBut afterwards during a press conference the ambassador warned that if Japanese firms become unprofitable due to bad Brexit deals they will leave the UK. \nMr Tsuruoka said: \nIf there is no profitability of continuing operations in the UK, not Japanese only, no private company can continue operations. So, it is as simple as that. \nThis is all high stakes and all of us need to keep in mind. \nOur Prime Minister has requested that the Japanese companies be fully consulted and listened to while the UK prepares to engage with the EU on relations of the future of the economic ties between the two. \nThe view that many Japanese businesses could shut up shop is worrying news for the North East, which is home to a large number of Japanese firms. \nAs well as major manufacturers such as Nissan, Hitachi, and Komatsu, there are also a number of Japanese owned firms working in the automotive supply chain. These include Sunderland’s Sanoh Industrial Co, Calsonic Kansei, Stockton’s Nifco, Unipres, and NSK Bearings. \nMr Tsuruoka did not go as far as to say that Brexit negotiations were a “threat” to Japanese businesses operating in the UK, but he used the opportunity to call for more clarity to be given to the business community as the talks progressed. Koji Tsuruoka, Japanese Ambassador to the UK, speaks outside 10 Downing Street, London (Image: PA) 8:45", "external_links": [], "published": "2018-02-12T10:30:00.000+02:00", "crawled": "2018-02-12T10:51:55.009+02:00", "highlightTitle": ""}