{"organizations": [], "uuid": "9ecd72858f8ee48a70713bfc60b230f07d365439", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.plymouthherald.co.uk/news/business/article358685.ece/ALTERNATES/s1200/Louise-Pasterfield-Head-and-Shoulders.jpg", "site_section": "http://www.westernmorningnews.co.uk/editorschoices.rss", "section_title": "devonlive - frontpage", "url": "https://www.devonlive.com/news/business/devon-digital-learning-company-expands-1174215", "country": "GB", "title": "Devon digital learning company expands into Dublin as Brexit looms", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-06T16:07:00.000+02:00", "replies_count": 0, "uuid": "9ecd72858f8ee48a70713bfc60b230f07d365439"}, "author": "Hannah Finch", "url": "https://www.devonlive.com/news/business/devon-digital-learning-company-expands-1174215", "ord_in_thread": 0, "title": "Devon digital learning company expands into Dublin as Brexit looms", "locations": [], "entities": {"persons": [{"name": "devon", "sentiment": "none"}, {"name": "louise pasterfield", "sentiment": "none"}, {"name": "michael quann", "sentiment": "none"}], "locations": [{"name": "dublin", "sentiment": "none"}, {"name": "nottingham", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "sponge uk share    devon", "sentiment": "none"}, {"name": "sponge uk", "sentiment": "none"}], "organizations": [{"name": "brexit", "sentiment": "none"}, {"name": "sponge uk", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Devon digital learning company expands into Dublin as Brexit looms The Plymouth firm has opened its first office in Europe Share Louise Pasterfield of Sponge UK Share Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nDevon digital learning company, Sponge UK, has announced its expansion into Ireland to safeguard against Brexit uncertainty. \nThe new office in Dublin follows the opening of its third office, in Nottingham, in December. Read More Devon women's business idea could revolutionise the way swimsuits are made forever - and they'll be on Dragon's Den this weekend \nLouise Pasterfield, Managing Director at Sponge UK said: “Opening in Dublin is an important step for us as we expand our footprint in Europe as well as bringing us closer to clients in Ireland. We found there was a high demand from clients for us to have a permanent base outside the UK, with many wanting greater business security ahead of Brexit.” \nThe new team, headed up by Michael Quann, will include Sponge UK’s microlearning division, leading on personalised and adaptive learning technology solutions for workplace learning. Sponge UK is expecting to grow and generate new jobs throughout 2018 and beyond, including its microlearning division. \n“Ireland’s growing reputation as a technology innovation hub fits well with our global strategy. Dublin is a vibrant city and we are optimistic about our future growth here. Read More \n“We’ve seen, with the global brands we’re working with, how microlearning is transforming the way we do workplace learning, with huge impact on business performance. \n“We are very fortunate to have Michael leading this at our office in Dublin.” Hub... PSP is now home to about 150 businesses \nBased at Plymouth Science Park, Sponge is an award-winning company that creates innovative workplace learning solutions for global organisations. Clients include Coca-Cola, Toyota, adidas, Tesco, GlaxoSmithKline, the NHS and the United Nations. \nIt specialised in creating custom-built digital training programmes using new technologies to help organisations build knowledge, skills and boost performance. Read More \nThe Sponge Dublin office will be based at Synergy Global in Lake Drive on the Citywest Business Campus. \nSponge has offices at Moorgate, London and Nottingham. \nAmerican-born Louise Pasterfield established Sponge UK in 2004 and came up with the name to reflect that when learning is successful, people absorb it like a sponge. \nIn 2017, the company’s turnover grew by 50%, helping to create 40 additional jobs. The business has now grown to over 100 employees. \nIn 2016, Sponge was named in the Sunday Times Top 100 Best Small Companies to Work For. \nThe company has won multiple industry awards for its learning solutions, the most recent coming in November 2017 at the Learning Technologies Awards, Europe’s biggest learning technology award programme. Sponge received accolades for an innovative digital learning programme developed for insurance brand AXA and Sponge’s Jason Butler was named Learning Developer of the Year. \n“Last year was an extraordinary year for us,” said Louise, “and the launch of our new office in Dublin is a great way to start 2018. With many organisations looking to modernise their training to utilise what new technologies offer, I believe that 2018 is going to be another extremely busy year.” Like us on Facebook ", "external_links": [], "published": "2018-02-06T16:07:00.000+02:00", "crawled": "2018-02-06T16:16:28.046+02:00", "highlightTitle": ""}