{"organizations": [], "uuid": "49da93561a923a9303e9304620e528056105ec35", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14328714.ece/ALTERNATES/s1200/Vaping-research.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/health/vaping-bad-you-safe-more-14328428", "country": "GB", "domain_rank": 21960, "title": "Is vaping bad for you or is it safe? More people are switching to e-cigarettes", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-24T18:00:00.000+02:00", "replies_count": 0, "uuid": "49da93561a923a9303e9304620e528056105ec35"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/health/vaping-bad-you-safe-more-14328428", "ord_in_thread": 0, "title": "Is vaping bad for you or is it safe? More people are switching to e-cigarettes", "locations": [], "entities": {"persons": [{"name": "jeremy corbyn", "sentiment": "none"}], "locations": [{"name": "great britain", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nAn estimated 2.9 million people in Great Britain smoke e-cigarettes. \nBut are they safe? That’s the question MPs are asking. \nAn inquiry has been formed to quiz scientists, doctors and the manufacturers themselves, in an attempt to decide whether the growing popularity of e-cigarettes, also known as vaping, should be welcomed or not. \nFor some experts, the answer is obvious. Smoking kills 80,000 people a year in England and Scotland, and it is estimated that 474,000 hospital admissions a year in England are directly attributable to smoking. \nBut e-cigarettes do not contain tobacco and do not involve burning, which means they don’t produce carbon monoxide, tar or smoke. \nInstead, they work by heating a solution of water, a chemical called propylene glycol - also used as a food preservative - and nicotine to create a vapour that the user inhales. Read More Jeremy Corbyn backs calls to get more women and girls into science and engineering \nThere is also a flavouring, which can range from cherry, grape or lemon to cookie dough, cinnamon or pancake. \nThere’s little doubt that e-cigarettes are safer than the conventional variety. And they can be used a substitute for traditional cigarettes, helping long-term smokers to quit the habit or, at least, switch to a less risky alternative. \nCharity Cancer Research highlighted the benefits of e-cigarettes in a written submission to the Commons inquiry. \nThe charity said: “E-cigarettes are almost certainly far safer than smoking, as they do not contain tobacco.” \nBut the charity also says that “long-term data will be needed” to confirm just what impact e-cigarettes have on people’s health. \nAnd experts agree. They include Dr Richard Holliday, a research fellow at Newcastle University’s School of Dental Sciences. Newcastle University (Image: newcastle chronicle) \nSmoking is linked to periodontitis, a gum disease that can lead to people losing their teeth. \nDr Holliday told the inquiry: “With regards to e-cigarettes there is now broad agreement in many fields that vaping with e-cigarettes is far safer than tobacco smoking. However, there are still mixed opinions among dental professionals. \n“We conducted a recent survey and found a third of dental professionals were of the opinion that e-cigarettes were more or equally harmful for health compared to conventional cigarettes.” \nSome academics warn that society has been too eager to assume e-cigarettes are safe. \nProfessor Michael Balls, an expert on toxicity and safety testing based at the University of Nottingham, and researcher Dr Robert Coombes said in a joint submission to the inquiry: “We are especially surprised by the lack of scholarship and scientific rigour that is being applied to the safety assessment of these products, and feel it important to exploit our independence by speaking out.” \nThe main benefit of e-cigarettes is supposedly that it allows people to inhale nicotine without burning. But these academics say nicotine is “actually one of the most toxicologically and pharmacologically active substances known” and may be linked to cancer and heart disease. Read More 'We want a hard Brexit' - North East MP signs letter setting out demands to Theresa May \nThe Commons Science and Technology Committee is examining the impact of electronic cigarettes on human health and whether they are being regulated correctly. This includes, for example, looking at the rules which govern advertising. \nIt has heard from a number of academics, and this week will hear evidence from manufacturers including Philip Morris Ltd - the UK arm of one of the world’s tobacco giants, with brands such as Marlboro, which also owns e-cigarette brands Vivid, Nicocig and MESH. \nE-cigarettes are still less popular than traditional cigarettes, which were smoked by 7.6 million adults in the UK in 2016 - 16% of the population. \nBut e-cigarette use is rising, while the number of conventional smokers is falling. \nAnd we still don’t know what that means for the nation’s health. \nPublic Health England, a Government agency, and the Medicines and Healthcare products Regulatory Agency, which regulates medicines, told the inquiry: “There is good reason to believe that they are substantially less harmful than smoking tobacco.” \nBut they also admitted: “As relatively new products, long-term evidence on e-cigs does not yet exist. They are unlikely to be risk free.” Like us on Facebook", "external_links": [], "published": "2018-02-24T18:00:00.000+02:00", "crawled": "2018-02-24T19:54:34.005+02:00", "highlightTitle": ""}