{"organizations": [], "uuid": "bed9218b6c0731654ca952abd0f6fc56a09a3b3f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article11499907.ece/ALTERNATES/s1200/JS61919163.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/major-hexham-employer-egger-uk-14239794", "country": "GB", "domain_rank": 21960, "title": "Major Hexham employer Egger UK invests £19m to boost capacity", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-04T10:00:00.000+02:00", "replies_count": 0, "uuid": "bed9218b6c0731654ca952abd0f6fc56a09a3b3f"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/major-hexham-employer-egger-uk-14239794", "ord_in_thread": 0, "title": "Major Hexham employer Egger UK invests £19m to boost capacity", "locations": [], "entities": {"persons": [{"name": "egger", "sentiment": "negative"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "ayrshire", "sentiment": "none"}, {"name": "austria", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "hexham", "sentiment": "none"}], "organizations": [{"name": "major hexham", "sentiment": "negative"}, {"name": "business major hexham", "sentiment": "negative"}, {"name": "hexham", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Major Hexham employer Egger UK invests £19m to boost capacity The firm's turnover rose last year despite being impacted by the weakening of sterling in the wake of the Brexit vote Share An aerial view of the Egger facility at Hexham, Northumberland Share Get business   \nMultimillion-pound investments were made at Northumberland’s largest manufacturing employer Egger last year, when it said it served up a “stable” financial performance in the wake of Brexit. \nThe Hexham factory , which makes wood pannelling, forms part of an international, privately-owned group of companies – headquartered in Austria – with plants across Europe manufacturing a range of materials. \nThe products made in Hexham go on to be used in a raft of every day items, including kitchenware, bedrooms and offices, wall panelling in hotels; counters and shelving in shops and structural flooring in the housebuilding industry. \nAccounts for the year ended April 30 2017 have been published and now include financial for its Ayrshire and Hexham plants, resulting in the lift in average employee numbers from 562 to 700 across its administration, production and distribution departments, with the full-time equivalent numbers rising from 544 to 679. \nIn a strategic report within the accounts, Egger directors said the firm saw a 4.3% turnover rise to £259m, while operating profit also rose from £24.1m to £25.8m. Ebitda, however, dropped from £34m to £33.1m. \nTotal shareholder funds increased from £55.6m to £73.6m. \nThe directors sounded a cautionary note on Brexit , saying the UK economy and market remains vulnerable to certain risks and uncertainties, in particular Brexit, and that the biomass industry continues to put pressure on its business. \nThe report said: “Despite the negative impact of the weakening of sterling on raw material costs Egger UK has delivered a stable financial performance compared to the previous year. \n“Wood is the main raw material used to make wood based panel. The biomass industry continues to increase its demand for wood, thereby causing upwards price pressure on wood. The price and availability risks are mitigated by Egger UK entering into long term contracts with key suppliers.” \nFollowing the publication of the accounts, the firm revealed it had invested heavily during the accounts period. \nThe firm said: “The 30 April 2017 financial statements show a positive result, but does include extraordinary items as a result of merging the legal entities for both the Hexham and Ayrshire plant. \n“Although, like-for-like, the result for the year is not at the level it was in the previous year, it is still seen as a positive result given the cost pressures that were presented. \n“The financial performance was heavily affected by the devaluation of sterling due to the outcome of the Brexit referendum. The devaluation meant that many of the company’s key supplies, such as chemicals, raw paper, spare parts and imported products, became much more expensive. \n“During the year, £19m was invested throughout its UK operations as part of its sustainable long-term growth strategy. This included investment in a new lamination line as well as a new tongue and groove structural flooring line at the Egger (UK) Limited Hexham plant, both giving increased production capacities. Read More Sunderland online gambling firm tombola sees turnover leap after scoring big in Europe \n“In January 2017, the company launched its greatest ever portfolio of decors for furniture, interior design and specification sectors. This collection includes over 120 brand new designs offering industry-leading and ultra-realistic textures. \n“Despite the ongoing uncertain economic outlook due to Brexit, the market has remained positive and Egger (UK) Limited is well placed to sustain its market leading position based on its mix of customers, ongoing reinvestment in production technologies and product range.” Like us on Facebook", "external_links": [], "published": "2018-02-04T10:00:00.000+02:00", "crawled": "2018-02-04T10:13:07.007+02:00", "highlightTitle": ""}