{"organizations": [], "uuid": "bf76461e427a3e0deb96beab510ae5349cf780b6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14272670.ece/ALTERNATES/s1200/The-Sex-Pistols.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/johnny-rotten-might-say-brexit-14272675", "country": "GB", "domain_rank": 21960, "title": "As Johnny Rotten might say about Brexit - 'ever get the feeling you've been cheated'", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-11T07:00:00.000+02:00", "replies_count": 0, "uuid": "bf76461e427a3e0deb96beab510ae5349cf780b6"}, "author": "Mike Kelly", "url": "https://www.chroniclelive.co.uk/news/north-east-news/johnny-rotten-might-say-brexit-14272675", "ord_in_thread": 0, "title": "As Johnny Rotten might say about Brexit - 'ever get the feeling you've been cheated'", "locations": [], "entities": {"persons": [{"name": "johnny rotten", "sentiment": "negative"}, {"name": "malcolm mclaren", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "getty images", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "  \nIt was punk legend Johnny Rotten who said at the end of the last Sex Pistols gig - ‘ever get the feeling you’ve been cheated?’ \nHe was commenting on what he saw as the bad management of the band by Malcolm McLaren. \nI wonder how many people think the same now about bad management by the government of this country as we face up to a Dystopian post-Brexit Britain . \nThe EU referendum was billed as the chance to ‘claim back our country’ from the clutches of Europe. What was omitted from that sentence was: ‘... and hand it over to the US’. The Sex Pistols (Image: Getty Images) \nAs report after report details how much the country is to suffer because of Brexit, we are being led down a garden path that suggests the only way this country can survive is to become the 51st state of the US - ideological servitude to a country run by a narcissistic bigot. \nAnd of course if we need any reminding, it was places like Sunderland which handed the result to Leave that are going to suffer the most. \nHow the Wearside city must hate the fact it was the first constituency to be seen to officially back Brexit as its results came through first. \nEvery time a report comes out to reveal the damage that will be done by getting out of Europe, Sunderland features at the top of the league of pain and so, inevitably, the irony merchants in the press head there. Johnny Rotten (Image: Daily Mirror) \nLast week proved a watershed in regards to facing up to the grim reality of what Brexit will actually mean. \nFirst there were the economic impact forecasts based on the various options on leaving Europe and how they would affect the UK economy. \nNone were good. The worst was the ‘no deal’ option which the diehard Leavers have wrapped in the union flag as the most honourable and therefore preferable. In the North East it will see the its GDP plunge 16%. Read More Brexit: If there was another referendum how would you vote? Geordies have their say \nThen, even more worrying, was how Prime Minister Theresa May responded when Lib Dem leader Vince Cable asked this about post-Brexit trade talks with the US: “Can she give an absolute guarantee that, in those negotiations, the NHS will be excluded from their scope”. \nMay said it was too early to judge what “requirements” the US would have in those talks. \nIn other words no guarantee about the NHS as everything is on the table. In an attempt to survive, a desperate garage sale of all the country’s valuables will have to be held - and after years of privatising public utilities, there’s not much left. Read More \nExcept, of course, the jewel in the crown, the NHS which private US health and insurance firms have long coveted. Standing between them and it at present is Jeremy Hunt. \nAnarchy in the UK anybody? Like us on Facebook", "external_links": [], "published": "2018-02-11T07:00:00.000+02:00", "crawled": "2018-02-11T07:12:24.001+02:00", "highlightTitle": ""}