{"organizations": [], "uuid": "e3c7a39a3c7974c09c6304ad9146047dde07b086", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14319862.ece/ALTERNATES/s1200/GWR_-NJL_250417bizschool_01.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/pot-washer-head-university-business-14319747", "country": "GB", "domain_rank": 21960, "title": "From pot washer to head of university business school: meet Sharon Mavin", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-21T18:00:00.000+02:00", "replies_count": 0, "uuid": "e3c7a39a3c7974c09c6304ad9146047dde07b086"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-news/pot-washer-head-university-business-14319747", "ord_in_thread": 0, "title": "From pot washer to head of university business school: meet Sharon Mavin", "locations": [], "entities": {"persons": [{"name": "sharon mavin prof sharon mavin", "sentiment": "negative"}, {"name": "sharon mavin", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "amble", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}], "organizations": [{"name": "newcastle university", "sentiment": "negative"}, {"name": "newcastle university business school", "sentiment": "negative"}, {"name": "northumbria university", "sentiment": "none"}, {"name": "roehampton university", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Prof Sharon Mavin, Newcastle University Business School (Image: Newcastle University) Share Get business   Thank you for subscribing!   \nSharon Mavin, 52, is director of Newcastle University Business School, the first woman to hold the role. She had previously run the business school at Roehampton University in London and has also been associate dean of the business school at Northumbria University. She grew up in Amble, Northumberland, and is an expert in gender and leadership studies. What did you want to be when you were growing up? \nI wanted secretly to be a lawyer. At that time I was surrounded by people who were becoming lawyers or were lawyers. I didn’t really know what they did but they seemed to have a really interesting life. What is the secret of your success? \nIt depends what you define as success! Work ethic is a key part of it, so is drive and the ability you can develop to see a bigger picture. And being passionate as an academic about the research you’re doing is really important. What was your first job (and how much did it pay)? \nI had a few ‘first jobs’ all at the same time. Probably the very first one was working as a pot washer and waiting on tables at the pubs in Warkworth. How much did it pay? I can’t remember! Who has been the biggest influence on your career? \nMy friend’s mum, who was head of education at Castington and Acklington prison. She saw something in me and really gave me confidence to succeed. The other person is Janet Bridges, who is head of the Castle View Academy in Sunderland and she was my geography teacher. Around the same time she gave me huge confidence and belief in myself academically. How important is it for business to play a role in society? \nIt’s of huge importance for business to play a role in society and it’s a key focus of Newcastle University Business School that we develop graduates who understand responsible management. We want them to be citizens and to understand the positive and negative roles that business can have in society. That’s a real value of the business school and it’s something I care about myself. How would you sum up your work philosophy? \nI’m an academic and I could talk about that in an 80,000-word thesis! I’ve learned that I enjoy building something and helping other people. It’s about getting the right people in the right place at the right time, doing the right thing, so they’re enjoying work. That’s the key thing - it’s all about the people. Read More Women at Greggs paid 22% less than men, new figures reveal What ambitions do you still have? \nI’ve been researching and working in practice on women’s leadership for 24 years. I see the current situation in society as a real opportunity, a possible tipping-point for gender-inclusive leadership. That would be still a burning ambition of mine - to be able to see gender-inclusive leadership and not to still have to fight for it. What would you do if you had to change career? \nI would buy some property up the coast and I would either do bed and breakfast or I would set up a new business doing writing retreats and yoga. Read More Barratt could switch production from Germany to UK in Brexit contingency move What’s the best thing about your job? \nVariety - it’s never the same. Being a director or a dean of a business school, it’s very fast-paced, very diverse. We can be regional, national, international; we can be working on research, learning and teaching, or working with employers. It can be working with the city or planning new buildings; it can be working with the next cohort of MBA students or it can be about our next world rankings - it’s very diverse. What was your best preparation for a life in business? \nWorking in the service industry. It helps you understand operations, processes and people. Read More Sage CEO says firm is '12 to 18 months ahead of competition' at big event on Tyneside What advice would you give to someone starting out in your profession? \nDon’t specialise too early. Your subject specialism as an academic is really important and developing your research expertise is critical. But being open to all the different roles you can work in at a university is really important and people should engage in all the different possibilities out there. Beyond just learning and teaching and research, it could be an international job, something in the corporate and executive area, it could be managing programmes. People shouldn’t specialise before they have to. Like us on Facebook", "external_links": [], "published": "2018-02-21T18:00:00.000+02:00", "crawled": "2018-02-21T19:19:31.010+02:00", "highlightTitle": ""}