{"organizations": [], "uuid": "08f3413ae4651bf3f131fcf810d5a4402c0fc3bb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14256135.ece/ALTERNATES/s1200/Sports-Direct-AGM.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14307159", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Mike Ashley's Sports Direct damned by Church of England for failings", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-19T10:12:00.000+02:00", "replies_count": 0, "uuid": "08f3413ae4651bf3f131fcf810d5a4402c0fc3bb"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14307159", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Mike Ashley's Sports Direct damned by Church of England for failings", "locations": [], "entities": {"persons": [{"name": "mike ashley", "sentiment": "negative"}, {"name": "jim mawdsley", "sentiment": "none"}], "locations": [{"name": "england", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "london stock exchange", "sentiment": "none"}, {"name": "coreena ford newcastle", "sentiment": "none"}, {"name": "northstar ventures", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford Business leaders propose 'partial customs union' for post-Brexit trade \nBusiness leaders are suggesting a “partial customs union” as a compromise plan for future trade with the European Union after Brexit. \nThe Institute of Directors (IoD) said its proposals would cover industrial goods and processed agricultural products and would help maintain the competitiveness of key industries. \nWith business groups pressing the Government for more information on trading arrangements post-Brexit, the IoD said it would support a “bespoke” deal with European counterparts. \nA customs union similar to Turkey’s agreement with the EU could be used as a base to build a broader free trade agreement, it was suggested. \nTurkey and the EU are seeking to improve their agreement, and the IoD argued the UK should take some of the proposed changes on board when negotiating its own customs arrangements with the bloc. \nIn its report, the IoD said its suggestion would allow the UK to forge its own trade agreements alongside EU negotiations. It would also allow the UK to maintain full control over agricultural tariffs, said the business group. Areas like Sunderland and County Durham which backed Brexit could pay the highest price for the UK leaving Europe (Image: PA) 9.00 KEY EVENT Raising a toast to the North East's bouyant brewing industry \nThere are more breweries in the UK than at any point since the 1930s, but micro breweries face a raft of challenges to get noticed. \nThe country is now home to over 2,000 breweries with around 80 in the North East alone. \nAnd in our Monday long read, Jonathon Manning spoke to growing breweries, a retail specialists selling their beers and a micropub, to reveal a bouyant industry that shows no signs of slowing down. Let's toast the North East's brewing industry 8.50 Coreena Ford Carillion investors 'were fleeing for the hills' \nInvestors in Carillion were “fleeing for the hills” after spotting that the construction giant was heading for disaster, it has been revealed. \nEvidence to a Parliamentary inquiry into the company’s collapse last month showed that one leading investor was considering suing Carillion, and believe management should be investigated. \nAlmost 1,000 former Carillion workers have been made redundant and jobs have also been lost among sub contractors since the firm went into liquidation. Auditors KPMG will be questioned this Thursday, February 22, by the Business and Work and Pensions select committees and asked why Carillion’s accounts were signed off. \nFrank Field, chairman of the Work and Pensions Committee, said there was a disconnect between what Carillion directors told MPs earlier this month - that all was sunny until problems with a contract in Qatar hit them “out of the blue”. \nHe said: “Their stewardship had, they proudly told us, been adjudged ‘best in class’ by their friends at KPMG. “On the other hand, investors were fleeing for the hills, and it appears those who looked closest ran fastest. “We will be taking evidence from the auditors and the investors - as well as demanding more company papers - to get to the bottom of who knew what and, most importantly, when.” Defaced branding is seen outside Carillion's Royal Liverpool Hospital site (Image: Getty Images Europe) 8.45 Coreena Ford Newcastle cat lover set to expand pet-sitting venture after turning a hobby into a business \nA former finance businesswoman is set to expand her cat-sitting service across the North East after turning her passion for cats into her own business venture. \nClaire Moorhouse, of Newcastle, had a successful career in finance when she adopted a rescue cat from a Gateshead rehoming centre in a move which would change her life. \nExcited by the idea of a complete career change, she realised there was a big gap in the North East market for pet owners who didn’t want to put their feline friends into pet hotels when they went away. \nAfter gaining indemnity insurance and a DBS check, she launched Holiday Kitty Cat Care, a pet-minding service which sees her drive across the region, from morning until late at night, to care for scores of cats while their owners go on holiday. \nOver the last year, demand for her services has grown rapidly, thanks to tapping into online marketing and social media to spread the firm’s name, and she has now taken on three other members of staff to help. \nAnd Mrs Moorhouse has plans to expand further across the North East, to give more cat owners the chance to use her service. Claire Moorhouse of Holiday Kitty Cat Care with her rescue cat Monty (Image: Tony Scott) 8.40 Coreena Ford We must stimulate growth in the North East, construction groups demand \nThe National Federation of Builders has called for North East authorities to take action to deliver fairer public procurement in a bid to stimulate the region’s construction sector. \nConstruction output has risen across every region of the UK except the North East, the CITB’s Construction Skills Network (CSN) report Industry Insights claims. \nYet the CITB predicts that the North East will still need to recruit 840 new workers into the sector each year, compared to 31,600 needed nationally. \nPredictions show that output for commercial, infrastructure and public works, including housing, is set to fall between 2018 and 2022, but output for repair and maintenance, industrial and private housing looks set to grow. \nThe report found that access to public procurement opportunities remains a challenge for construction businesses across the UK and members of the National Federation of Builders (NFB), consisting mainly of SMEs and regional contractors, report that access to public procurement is particularly prohibitive in the North East. \nThe issue has been highlighted by the Construction Alliance Northeast (CAN), which drew up a Construction Charter calling for a complete re-think on public procurement. \nIts mission has received support from scores of local businesses, as well as the North East England Chamber of Commerce. \nDespite training and retaining 66% of apprentices and typically employing within 15 miles of their head offices, many SMEs and regional contractors across the North East continue to be disadvantaged by oversubscribed supplier frameworks, contractual processes and a focus on “most economically advantageous tenders”. \nThe CITB says the regional supply chain is unable to sustainably grow, with many builders consigned to bidding for small works and one-off jobs with the largest contractors. Construction output has increased everywhere except the North East, where regional contractors are hampered by supplier frameworks (Image: PA) 8.35 Coreena Ford New chairman at insurance and travel group Saga \nInsurance and travel group Saga has appointed Old Mutual’s Patrick O’Sullivan as its next chairman. \nMr Sullivan will take the reins on May 1, and is set to be paid £325,000 per year. He will replace Andrew Goodsell, who the company confirmed in October was set to retire from the board. \nHe said: \nSaga is a household name and a brand that I admire. I am very pleased to be joining at a pivotal moment in the development of the company as it focuses on sustaining profitability and growth across the businesses. \nI look forward to working with management and the Saga board to build on recent investments and initiatives to deliver profitable growth. 8.30 Coreena Ford Dividends rise as firms recover from sterling collapse \nUK companies cautiously raised shareholder payouts last year as firms started to recover from the effects of the Brexit-hit pound. \nDividends grew just 3% on a headline basis to 95.7 billion (£68bn) in 2017 in Britain, according to the latest Janus Henderson Global Dividend Index, marking a rebound following a 3.5% drop a year earlier. \nThe “relatively modest” increase reflected a large number of companies falling out of a ranking of the most valuable 1,200 firms based on market valuation following the post-Brexit vote collapse of sterling. \n“Sterling remained sharply lower against the dollar in the first half of the year, and its recovery in the second half was not enough to prevent an exchange rate loss for the year overall,” the report said. \nHowever, the UK still managed to outpace the rest of Europe, which saw dividend growth rise only 1.9% to 227.4 billion (£161.8bn) on the back of steep cuts in fourth-quarter shareholder payouts from the likes of French utility firms and Spain’s Telefonica. \nAs a result, France posted flat dividend growth for 2017 while Spain suffered its third consecutive year of declines. \nOther major countries including the US, Japan, Switzerland, Hong Kong, Taiwan and the Netherlands all enjoyed a knockout quarter, with dividends hitting new records. \nIt helped drive total global payouts up 7.7% year on year to a record 1.25 trillion (£889bn). Money (Image: PA)", "external_links": [], "published": "2018-02-19T10:12:00.000+02:00", "crawled": "2018-02-19T10:45:41.003+02:00", "highlightTitle": ""}