{"organizations": [], "uuid": "45493a0e38bcb3441ae18b43182a9d41cba553b5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14194729.ece/ALTERNATES/s1200/British-Construction-Company-Carillion-Goes-Into-Compulsory-Liquidation.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/another-101-carillion-workers-lose-14262550", "country": "GB", "domain_rank": 21960, "title": "Another 101 Carillion workers lose jobs as Official Receiver's review of contracts continues", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-08T13:58:00.000+02:00", "replies_count": 0, "uuid": "45493a0e38bcb3441ae18b43182a9d41cba553b5"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/another-101-carillion-workers-lose-14262550", "ord_in_thread": 0, "title": "Another 101 Carillion workers lose jobs as Official Receiver's review of contracts continues", "locations": [], "entities": {"persons": [{"name": "carillion", "sentiment": "none"}], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Business Another 101 Carillion workers lose jobs as Official Receiver's review of contracts continues So far, 2,250 jobs of the collapsed construction giant have been saved but 930 workers have been made redundant Share Click to play Tap to play The video will start in 8 Cancel Play now Get business   Thank you for subscribing!   \nMore than 930 Carillion workers have so far lost their jobs following the collapse of the infrastructure giant. \nLatest figures released by the Official Receiver details how more jobs have been safeguarded, but that other roles have been made redundant. \nThe Official Receiver is continuing to review Carillion’s contracts, as well as core divisions of the business, and confirmed that a further 1,221 jobs have been safeguarded. \nThe roles are connected to the delivery of both public and private contracts and cover services for a city council, as well as a range of facilities management services. A Carillion worker (Image: PA) \nThis means 2,250 jobs have been saved to date. \nHowever, 101 roles have been made redundant in a mix of back-office functions and engineering support roles that new suppliers no longer require, taking the total number of job losses to 930. \nThe Official Receiver said: “We continue to engage with staff, elected employee representatives and unions throughout. Those who have lost their jobs will be able to find support through Jobcentre Plus’ Rapid Response Service and are also entitled to make a claim for statutory redundancy payments. \n“The liquidation process continues and we remain focused on engaging with staff and new suppliers about any changes to jobs and contracts. Read More Debenhams to cut 320 jobs in cost-cutting drive as retail troubles continue \nMeanwhile, the Government is being urged to establish a new code of conduct for the delivery of public services by private companies in the wake of Carillion’s collapse. \nUnison said its preferred option was for services to be provided in-house, but it called for a new set of principles to be introduced when the private sector is given contracts. \nIn a letter to the Government, Unison general secretary Dave Prentis said companies receiving taxpayers’ money to deliver public services should abide by principles including integrity, openness and accountability. Read More 'Don't take us for idiots': North East business leader reacts to Brexit impact figures \nHe said: “Selflessness and integrity mean there can be no place for companies that use tax havens, that blacklist workers for belonging to unions, make it hard for unions to represent the workforce, and generate profits by attacking pay and terms and conditions. \n“The principles of accountability and openness require full transparency. This means that all procurement information should be available online - including tender documentation, bids and all signed and amended contracts.” Like us on Facebook", "external_links": [], "published": "2018-02-08T13:58:00.000+02:00", "crawled": "2018-02-08T14:17:56.006+02:00", "highlightTitle": ""}