{"organizations": [], "uuid": "9ea2f7d3964a0a23056c030fc12b15a2310a5ac8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14254884.ece/ALTERNATES/s1200/New-Look-profits.jpg", "site_section": "http://www.thejournal.co.uk/business/?service=rss", "section_title": "nechronicle - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/new-look-could-close-up-14254954", "country": "GB", "domain_rank": 21960, "title": "New Look could close up to 60 stores as sales and profits slump", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-06T18:51:00.000+02:00", "replies_count": 0, "uuid": "9ea2f7d3964a0a23056c030fc12b15a2310a5ac8"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-news/new-look-could-close-up-14254954", "ord_in_thread": 0, "title": "New Look could close up to 60 stores as sales and profits slump", "locations": [], "entities": {"persons": [{"name": "alistair mcgeorge", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "new look", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "invalid email  struggling fashion chain new look", "sentiment": "none"}, {"name": "brait", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business New Look could close up to 60 stores as sales and profits slump Fashion chain with a number of stores in the North East has posted a pre-tax loss of £123.5m Share A New Look store (Image: PA) Share Get business   Thank you for subscribing!   \nStruggling fashion chain New Look has posted another set of dismal figures as the retailer continues to consider a raft of store closures. \nNew Look, owned by South African investment group Brait, posted a pre-tax loss of £123.5m in the three quarters to December, while sales slumped 6.3% to £1bn. \nThe high street chain booked an underlying operating loss of £5.1m, which compares to a £111.5m profit in the same period last year. \nLike-for-like sales in the UK plunged 10.7% during the period, while online sales through New Look’s website fell 15%. \nAlistair McGeorge, who has been parachuted into the role of executive chairman for another stint at New Look, said the poor showing reflected a challenging market and heavy discounting. \nIt is also understood that the company is considering a range of options aimed at improving its performance, which includes store closures. \nNew Look has 594 stores in the UK, with flagship shops in Newcastle’s Eldon Square and the Gateshead Metrocentre among 18 in the North East. It is thought to be mulling plans for a Company Voluntary Arrangement (CVA), which would put it on a firmer financial footing by allowing it to shut loss-making outlets and secure rental reductions. \nAround 60 stores, or 10% of the store estate, are thought to be at risk of closure. \nMr McGeorge said: “I am confident that we are now making the necessary changes to get the company back on track and we continue to have sufficient liquidity to deliver our plans. \n“In particular, we are focusing on reducing costs, recovering the broad appeal of our product and reconnecting with our customers. \n“We are already realigning our pricing to offer significantly better value, adding flexibility to our buying model, and improving our speed to market.” \nRetailers across the board, such as Next, have been stung by rising costs and falling consumer confidence as Brexit-fuelled inflation hits the sector hard. \nThe group is also struggling under £1.2bn of borrowings but is not seeking a debt restructuring. \nMr McGeorge returned to the firm following the abrupt departure of chief executive Anders Kristiansen in September. Like us on Facebook", "external_links": [], "published": "2018-02-06T18:51:00.000+02:00", "crawled": "2018-02-06T19:12:19.000+02:00", "highlightTitle": ""}