{"organizations": [], "uuid": "4d1caca34af5751f8990d2fe39808be3e3949951", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14266413.ece/ALTERNATES/s1200/JS143056810.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14266422", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Trinity Mirror snaps up Daily Express and Daily Star titles in £126.7m deal", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-09T10:35:00.000+02:00", "replies_count": 0, "uuid": "4d1caca34af5751f8990d2fe39808be3e3949951"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14266422", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Trinity Mirror snaps up Daily Express and Daily Star titles in £126.7m deal", "locations": [], "entities": {"persons": [{"name": "joe garner", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}], "organizations": [{"name": "trinity mirror", "sentiment": "negative"}, {"name": "daily express and daily star", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford Gary Hutchinson and London investor to plough £750,000 into Fat Buddha makeover \nDingy subways under the former Swan House roundabout will be given a facelift as part of £750,000 plans to transform Newcastle’s Fat Buddha venue. \nNew owner Gary Hutchinson, the former Sunderland AFC commercial director and head of Club Wembley, has formed a joint venture with London investors to plough significant funds into the sizeable bar and restaurant within the 55 Degrees North building. \nMr Hutchinson bought the bar from former owner Bob Senior last year as the first focus for his new firm Chrysalis Leisure, with ambitious plans to pursue a number of venues across the region. \nAnd a complete redesign for the late-night bar and restaurant venue, splitting it into two separate areas with different identities, is now set to go ahead, with the bar area drawing inspiration from Alpine ski lodges. \nA new name for the bar on the ground floor has yet to be finalised, although the licensing application has been submitted under the name The Schloss and another working title of Antler has also been mooted. \nLicensing officials will ponder an application to extend the current licence from a 2am finish to 3am next week, and the joint venture – PAGH Ventures – also wants to add 40 square feet through a new garden extension to “improve the look and feel of the piazza”. \nRead more about PAGH Ventures plans for the bar and restaurant here . Fat Buddha bar in Newcastle (Image: Newcastle Chronicle) 9.38 Coreena Ford 'We are used to operating a broad stable of titles' - Simon Fox on the Northern&Shell deal \nThe Daily Mirror and Daily Express have very different political leanings - so will readers see changes to the individual papers and websites once they’re under the same Trinity Mirror umbrella? \n“Definitely not,” Simon Fox told the BBC. \n“The Daily Mirror is not going to become right wing, the Daily Express is not going to become left wing. We’ve got 100 titles in the group. They all operate with their own editors and those editors have full editorial independence to make the decisions that are right for the readers, so we are quite used to operating a broad stable of titles.” \n“We don’t see the political teams mixing in any way. Where we are talking about sharing content, that will be in sport, features and what we call the back of the book, but I think we can actually invest and improve our products in terms of our political coverage.” 9.30 Coreena Ford EE launches 4G broadband antenna in bid to help rural areas \nEE has launched a new 4G antenna to help provide rural homes across the UK with superfast broadband for the first time. \nThe telecoms giant says the new system could help more than 580,000 rural homes gain access to high-speed internet. \nThe solution uses a small antenna attached to the outside of a home, which then carries a 4G broadband signal inside via a cable to a connected 4GEE Home Router. \nThe launch follows a successful trial in the Northern Fells in Cumbria, where download speeds of more than 100Mbps were recorded - Ofcom defines superfast broadband as speeds greater than 30Mbps. \nEE’s Max Taylor said: “As our network continues to expand into some of the most remote parts of the UK, we’ve seen the amazing impact that 4G connectivity can have on rural communities. \n“Our newest 4G home broadband router and antenna takes this one step further, ensuring thousands of families in rural areas across the UK could enjoy the benefits of superfast broadband inside their home for the very first time - whether video-calling the grandparents or streaming their favourite TV series.” The new 4GEE Home Router - the antenna solution set to help connect and deliver superfast broadband in rural areas 9.24 Coreena Ford Apple's HomePod has finally arrived \nHomePod, Apple’s take on the smart home speaker and designed to rival Amazon Echo and Google Home, has gone on sale in the UK. \nThe £319 speaker is seen as a high-end alternative to Amazon and Google’s popular devices, and uses Apple’s own virtual assistant Siri to carry out voice commands. \nThe device had initially been due to launch in December, however Apple delayed the release saying it needed a “little more time” on the speaker. \nIn early reviews, the HomePod has been praised for its audio quality, but the intelligence and ability of Siri - compared to Amazon Alexa and the Google Assistant - has been questioned. \nApple’s Phil Schiller said the focus of HomePod was on audio quality. \n“HomePod is a magical new music experience from Apple,” he said. \n“It brings advanced audio technologies like beam-forming tweeters, a high-excursion woofer and automatic spatial awareness, together with the entire Apple Music catalogue and the latest Siri intelligence, in a simple, beautiful design that is so much fun to use. \n“We’re so excited for people to get HomePod into their homes, apartments and businesses to hear it for themselves. We think they will be blown away by the audio quality.” \nHowever, the high price of the HomePod - at £319 it is significantly more expensive than the £75 Echo and £129 Google Home - has also been questioned. The Apple HomePod. 9:11 Nationwide profits rise but net lending tumbles \nNationwide has chalked up another rise in profits despite enduring a hefty drop in net lending and warning over the squeeze on household spending power.Britain’s biggest building society saw underlying pre-tax profit rise 2% to £883m for the nine months ending in December, boosted by the £26m sale of its payments system VocaLink.However, intense market competition took its toll on net lending for prime mortgages, which sank 41% to £4.3 billion over the period.Its current account performance made for brighter reading, with the number of openings rising 8% to 617,000 accounts.Chief executive Joe Garner said the firm had traded “strongly”, but expects the UK economy to grow “modestly” in the coming months as he flagged a “noticeable” slowdown in consumer spending.He said: \nAs we anticipated, a subdued buy to let mortgage market, plus sustained competition, slowed the pace of growth in our mortgage book. \nWith third quarter mortgage reservations significantly stronger than for the same period last year, we expect a strong final quarter for our gross lending. \nOn a statutory basis, profits fell 6% to £886m over the nine-month period, while gross mortgage lending slipped to £24.1bn , down from £26.2bn compared to the year before.Mr Garner added: \nLooking ahead, we expect the economy to continue to grow but only modestly. \nConsumer spending, which has been a key driver of growth, has slowed noticeably, and almost three quarters of those surveyed in our Brexit Consumer Panel expressed concern about the rising cost of goods and services. \nModest economic growth is also likely to hold back the housing market and house price growth. A Nationwide branch KEY EVENT 'There will be job cuts' - Simon Fox, Trinity Mirror CEO \nTrinity Mirror chief executive Simon Fox admitted that job cuts will come as a result of the deal. \nPooled resources mean duplication of roles - so back office functions can expect to undergo a restructure. \nIn an interview with BBC Breakfast he said: “By bringing our two organisations together we can be stronger, so by pooling our edutorial teams instread of duplicating and sending the same reporters to the same football matches we can be much more efficient and cover more matches, more breadth of coverage. \n“So it’s good for readers, it’s good for advertisers, it’s good for our shareholders, good for our pension funds. \n“If you are employed by a financially stronger organisation that’s good for everyone. \n“There will over time be job cuts because we are going to remove duplication, mainly in back office functions. We are bringing two very similar businesses together and when you do that there’s a certain amount of duplication so there will be some changes. We will be talking to those teams in due course but broadly this is very good.” Simon Fox, CEO of Trinity Mirror 8.40 Shares rise in Trinity Mirror \nFollowing this morning’s announcement by Trinity Mirror, shares have risen 7% to 75.2. \nThe FTSE-100 index at 8.15am was down 43.10 at 7127.59. Screen displaying the FTSE 100 at the London Stock Exchange (Image: Yui Mok/PA Wire) 8.45 Coreena Ford Marriott Gosforth Park Hotel put up for sale as part of major property deal \nTwo of the region’s best-known large hotels have been put up for sale as part of a major property deal. \nThe Newcastle Marriott Gosforth Park Hotel and its counterpart on the seafront at Sunderland are being advertised as part of a lot of five Marriott sites that have gone on to the market. \nBoth hotels are well-known as popular event venues, with the Gosforth Park site being the long-term home for the Tyneside and Northumberland Business Awards and the North East Business Executive of the Year event. \nBuilt in the 1960s, the Gosforth Park hotel has also welcomed countless North East, national and international TV and film stars, sporting stars and rock bands. \nFor the last 18 years it has traded under the Marriott banner and it is the headline site of the Project Royale lot being marketed by leisure property specialist Christie & Co. The asking price for the hotels is not known, nor whether the hotel staff form part of each deal. \nBut the hotels are being advertised as being “free and clear of the current Marriott branding and management, providing for re-positioning and re-branding opportunities”– suggesting the Marriott name is likely go. Marriott Gosforth Park Hotel (Image: Newcastle Chronicle) 8.30 KEY EVENT Trinity Mirror strikes £126.7m deal with Northern&Shell \nTrinity Mirror has reached a £126.7m agreement to buy a string of titles from Richard Desmond’s firm Northern & Shell, including the Daily Express, the Daily Star and OK! magazine. \nThe publisher of the Chronicle, Journal, Sunday Sun and the Gazette in the North East will stump up an initial payment of £47.7m, followed by £59m between 2020 and 2023 and a further £20mby issuing 25.8 million shares to Northern & Shell priced at 10p each. \nNorthern & Shell is owned by Richard Desmond, who acquired the Express titles in 2000 for £125m. \nThe deal represents a major shake-up of the UK media landscape, bringing together the politically left-leaning Sunday Mirror, with more right-wing publications such as the Sunday Express. \nThe deal will also see Trinity Mirror seize control of Daily Star Sunday, celebrity magazines New! and Star, and a 50% slice of the Irish Daily Star. \nTrinity Mirror chief executive Simon Fox said: \nThis deal is a really exciting moment in Trinity Mirror’s history, combining some of the most iconic titles in the UK media industry. \nIt is good for our readers, good for our customers and good for our shareholders. \nNorthern & Shell’s titles have a large and loyal readership, a growing digital presence and a stable revenue mix and offer an excellent fit with Trinity Mirror. \nTrinity Mirror will also shift £41.2m to the Northern & Shell pension scheme and make further payments of £29.2m as part of the scheme’s recovery plan. \nThe print media industry is grappling with a decline in advertising and any combination could herald cost savings and a shared cut of a larger advertising pool. \nMr Desmond, chairman of Northern & Shell, said: \nToday’s transformational transaction is a logical and natural next step in the evolution and consolidation of the media sector and will create a larger and stronger platform serving all stakeholders. \nIn Trinity Mirror we have a great partner, who will be an excellent steward of the business going forward, and I am delighted to be able to retain an ongoing interest in the combined group. Simon Fox", "external_links": [], "published": "2018-02-09T10:35:00.000+02:00", "crawled": "2018-02-09T11:12:56.000+02:00", "highlightTitle": ""}