{"organizations": [], "uuid": "879fa41f8b81456d832561ce3a2b58c171b26871", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/news/article268472.ece/ALTERNATES/s1200/Jet2JPG.jpg", "site_section": "http://www.leicestermercury.co.uk/rss.xml", "section_title": "leicestermercury - frontpage", "url": "https://www.leicestermercury.co.uk/news/business/jet2-creating-75-jobs-east-1218268", "country": "GB", "domain_rank": 48128, "title": "Jet2 is creating 75 jobs at East Midlands Airport - and here's what's available so far", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-15T13:51:00.000+02:00", "replies_count": 0, "uuid": "879fa41f8b81456d832561ce3a2b58c171b26871"}, "author": "Tom Pegden", "url": "https://www.leicestermercury.co.uk/news/business/jet2-creating-75-jobs-east-1218268", "ord_in_thread": 0, "title": "Jet2 is creating 75 jobs at East Midlands Airport - and here's what's available so far", "locations": [], "entities": {"persons": [], "locations": [{"name": "east midlands airport", "sentiment": "none"}, {"name": "antalya", "sentiment": "none"}, {"name": "castle donington airport", "sentiment": "none"}, {"name": "turkey", "sentiment": "none"}, {"name": "dalaman", "sentiment": "none"}, {"name": "bodrum", "sentiment": "none"}, {"name": "east midlands", "sentiment": "none"}], "organizations": [{"name": "ryanair", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get Business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nOne of East Midlands Airport’s biggest airlines hopes to recruit up to 75 new members of staff this summer to meet growing demand. \nThe boss of Jet2.com said it needs the extra staff as it adds new routes such as Turkey, with holidaymakers returning there after several years of political upheaval. \nAs fears of terrorism, the refugee crisis and the 2016 coup attempt subside, it has become the biggest growing market for Jet2.com, with a new route added to Bodrum and extra flights to Dalaman and Antalya this year. \nThe airline is the biggest tour operator in the region and second-biggest airline behind Ryanair. \nRight now the business is looking for workers to join it at the Castle Donington Airport in positions ranging from cabin crew to front of house duty manager, engineers, baggage loaders and customer services agents. \nThe extra jobs will take its staff numbers at East Midlands to nearly 600 ahead of the summer season. The airline is also launching a new route Bodrum (Image: Getty) \nManaging director Phil Ward, speaking as the airline celebrated its 15th birthday, said: “This year we will carry in excess of one million passengers from East Midlands Airport (EMA), which is a very substantial and important airport for us. \n“It’s well-connected with the M1 and East Midlands Parkway railway station and we’ll grow steadily rather than dramatically. \n“We have 36 destinations from East Midlands this year and think we have a good spread that we’ll continue to serve at good frequencies. \n“Over the past 15 years, we’ve proven we’re a good, stable and reliable operator that offers excellent customer service. \n“We’re very financially stable and are committed to being at this airport for a long time to come.” \nJet2.com first landed at the Castle Donington Airport in 2010, when it had four planes stationed there and 150 staff. \nSince then, it has added three more planes – with capacity also served by aircraft in Alicante and Palma – and flown 4.5 million passengers, at 93 percent capacity, to destinations including Budapest, Corfu, Dubrovnik, Faro, Ibiza, Lanzarote, Prague, Salzburg, Tenerife and Verona. \nIt is also set to quadruple its original number of employees in the region with the latest recruitment drive, with jobs including pilots, cabin crew, engineers, and check-in and ramp staff. \nEMA managing director Andy Cliffe has previously spoken about how he would like to see routes created from the region to major airport hubs like Paris, Frankfurt and Brussels. \nJet2.com previously served Paris but it was passed on to Flybe, before it was later dropped. Read More \"Brexit won’t stop East Midlands Airport expansion\" \nMr Ward said his airline would not be focusing on those routes that carried more business passengers. \n“We tried Paris but it needed a smaller airplane and ours are quite big. A destination like that needs the right style of carrier. \n“Our focus is about sending people from the cold of England to the sunshine of the Mediterranean and that’s where we want to grow the market.” \nScott Knowles, chief executive at East Midlands Chamber, said: “The airport plays a vital role in the region’s success, providing key links to export destinations and making it easy for our businesses to service existing clients on a global scale and chase new markets. \n“It is also a key link in providing both inbound and outbound tourism, so the non-business routes are as important to the local economy as those used by the business community.” Like us on Facebook ", "external_links": [], "published": "2018-02-15T13:51:00.000+02:00", "crawled": "2018-02-15T14:06:43.050+02:00", "highlightTitle": ""}