{"organizations": [], "uuid": "58c608b75278bdaae4553285449fc9c3fd6957ca", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bostonstandard.co.uk", "main_image": "https://res.cloudinary.com/jpress/image/fetch/f_auto,ar_3:2,q_auto:low,c_fill/https://www.bostonstandard.co.uk/webimage/1.8372801.1518178756!/image/image.jpg", "site_section": "http://www.bostonstandard.co.uk/rss/cmlink/1.335257", "section_title": "Boston Standard MBSP.news.feed", "url": "https://www.bostonstandard.co.uk/news/business/investing-in-boston-feature-part-one-why-boston-is-now-open-for-business-1-8372802", "country": "GB", "title": "INVESTING IN BOSTON FEATURE PART ONE: Why Boston is now ‘open for business’", "performance_score": 0, "site": "bostonstandard.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-11T14:00:00.000+02:00", "replies_count": 0, "uuid": "58c608b75278bdaae4553285449fc9c3fd6957ca"}, "author": "", "url": "https://www.bostonstandard.co.uk/news/business/investing-in-boston-feature-part-one-why-boston-is-now-open-for-business-1-8372802", "ord_in_thread": 0, "title": "INVESTING IN BOSTON FEATURE PART ONE: Why Boston is now ‘open for business’", "locations": [], "entities": {"persons": [{"name": "clive gibbon", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "daniel jaines", "sentiment": "none"}], "locations": [{"name": "boston", "sentiment": "none"}, {"name": "boston", "sentiment": "none"}], "organizations": [{"name": "boston borough council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "INVESTING IN BOSTON FEATURE PART ONE: Why Boston is now ‘open for business’ Clive Gibbon and logos Published: 12:  \nThe borough council has revealed a new strategy to entice business to the town. With £50million already invested in two years, what more can the council do? Daniel Jaines reports. \nBoston is ‘open for business’ say the local authority’s leaders as they revealed work that has been going on behind the scenes to bring investment into the town. \nClive Gibbon, economic development manager for Boston Borough Council, has now been in the role (previously held as part of another officer’s portfolio)for just over a year. \nHis role is to go out and start having conversations with the business community, and he and the council have now come up with a plan which aims to get investors and developers doing three things - ‘Start in Boston’, ‘Grow in Boston’ and ‘Invest in Boston’. \nIt is part of a rebrand, and a refocusing on getting businesses into Boston, especially with concerns on the horizon including Brexit and the Government’s withdrawal of some funding from 2020. \nThe rebrand will see them take a more hands-on approach with networking with partners and agencies to direct businesses to locations in the town which need them through conversations with developers and retail businesses. \nMr Gibbon told The Standard: “Our vision is to create a strong, safe and resilient economy that works for all by positioning the borough as a destination of choice for investing, working, living and visiting. \n“Boston is about growth, growth, growth. It’s happening, it’s all here and going forwards. It’s all about growth. \n“There’s a fantastic opportunity within the borough coming in \n“Boston, I’m convinced, is about to explode. Brexit aside it hasn’t been too bad and we’ve done a lot. \n“We’re not resting on our laurels and watching it all happen around us. We are promoting Boston as a place of action and vision, a place to live, visit and work.” \n“Through the adopted Council Plan, the emerging South East Lincolnshire Local Plan and the Economic Plan the council is very well placed to deliver the right sort of environment to enable and support businesses to start, nurture businesses to grow and encourage inward investment.” \nSome of the council’s work will see small businesses pointed in the direction of new developments where they can grow - for example moving from the Boston Enterprise Centre to a bigger unit. \nThe council will further utilise its placement to see how future planning applications could benefit businesses. \nThere will also be work to try and address any skills shortages in the area, including partnering schools, colleges, universities and companies to point pupils in the direction of future options. \nLinks with neighbouring authorities will also be utilised to build a ‘broader economic landscape’. \nThe hope is to tackle potential local problems, such as teachers and doctors/nurses before they occur. Part of this will be tackled by heading to, and organising jobs fairs in the local area as well as challenging businesses to change the perceptions of the kind of work they offer. \nFor example agricultural industries, known for instance for cabbage picking, could instead advertise potential future opportunities such as advertising and marketing, technology research and development. \nA website is to be launched, similar to the Visit Boston site, but with a crisp business feel. The council says it will give more information on how the council can support businesses. Follow Us On", "external_links": [], "published": "2018-02-11T14:00:00.000+02:00", "crawled": "2018-02-11T15:04:30.018+02:00", "highlightTitle": ""}