{"organizations": [], "uuid": "057297af34b85c5b7b45e6d6f41c903cbc55977a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/health/article1223684.ece/ALTERNATES/s1200/Sarah-Wollaston.jpg", "site_section": "http://www.westernmorningnews.co.uk/health.rss", "section_title": "devonlive - Health", "url": "https://www.devonlive.com/news/health/who-should-pay-nhs-asks-1223472", "country": "GB", "title": "Who should pay for the NHS? asks Sarah Wollaston", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-16T15:35:00.000+02:00", "replies_count": 0, "uuid": "057297af34b85c5b7b45e6d6f41c903cbc55977a"}, "author": "Keith Rossiter", "url": "https://www.devonlive.com/news/health/who-should-pay-nhs-asks-1223472", "ord_in_thread": 0, "title": "Who should pay for the NHS? asks Sarah Wollaston", "locations": [], "entities": {"persons": [{"name": "sarah wollaston news who", "sentiment": "none"}, {"name": "sarah wollaston", "sentiment": "none"}, {"name": "matt richards", "sentiment": "none"}], "locations": [{"name": "totnes", "sentiment": "none"}, {"name": "south devon", "sentiment": "none"}], "organizations": [{"name": "nhs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Who should pay for the NHS? asks Sarah Wollaston The NHS is so stretched that ‘I don’t think the beds ever get cold’, Totnes MP Sarah Wollaston tells Matt Richards as she argues for a new look at paying for health Share Click to play Tap to play The video will start in 8 Cancel Play now   \n“Sometimes you just have to keep saying things again and again and again before you get your way,” says Sarah Wollaston, laughing. \nThe Conservative MP for Totnes - the unique South Devon town with its own currency and the willpower to reject Costa for being a chain - is sitting in her constituency office chatting to me about the importance of funding the NHS properly. It’s clearly high on her agenda. \n“I’m absolutely convinced that we need to be spending more on health and social care,” she says. \nShe believes that the government’s regular claims about health spending being at a record high misses the point, because the increase in people living with long term conditions means it is still not enough. \n“Yes funding has increased in real terms, but it hasn’t increased enough to keep pace with the increase in demand,” she says. “That’s the point.” Dr Wollaston chairs the influential Health Select Committee \nHer interest and expertise in health betrays her professional background – she spent twenty four years as a doctor in the NHS before entering Parliament in 2010 following David Cameron’s call to get more people from non-political backgrounds into Westminster. \nAs Chair of the Health Select Committee, Dr Wollaston is now the most influential MP outside of government when it comes to health policy. Her job, along with her fellow committee members from across the political spectrum, is to scrutinise the work of Health and Social Care Secretary Jeremy Hunt, the Department of Health, and the NHS. \nThis scrutiny comes as the South West feels the impact of the so-called NHS crisis. In December, the proportion of people being seen at Derriford’s A&E department within the important four-hour timeframe was just 70.5% - down from 83% the previous year and well adrift of the 95% target. Last weekend, waiting times at Truro’s A&E were reportedly over seven hours. Read More Devon hospital reports worst A&E wait times performance on record \n“I don’t think the beds ever get cold,” she says, explaining that the problem stems from the fact that these days 95% of NHS beds are occupied, when it should be more like 85%. This means that when demand is higher, such as in winter, the system just isn’t flexible enough to cope. \nBut she is clear: the case for more cash for the NHS isn’t only about now, it’s about the long term as well. \n“We need it to be looking at both health and social care,” she says, “and we need to not only deal with the funding shortfall that we have here and now, but we need to deal with the ten year horizon and beyond.” \nShe is concerned, however, that the Tories’ experiences at the election, which arguably turned on the issue of increased personal costs for long term health conditions – quickly labelled the Dementia Tax – could scare her colleagues away from serious conversations about how the NHS should be funded. \n“The wrong lesson to learn from the election campaign would be that you can never ask or set out who is going to contribute more without it destroying you politically.” \nHer view is that “we have to be prepared to pay more… people tell me they are prepared to contribute.” A&E departments have been under enormous pressure this winter \nBut it requires political will on both sides of the Commons to make it happen: “Neither political party has a monopoly of good ideas on how we can fund it.” \nFor her, top ups and charges are the wrong route to go down because they increase inequality – she wants to stick with a tax payer funded system. \n“We should re-envisage national insurance as being national health care insurance.” But she says careful thought needs to be given to how this would work. \n“We can’t just put it all onto working age employed adults.” she says. “Do you have to look at how you spread that fairly over the generations and look at people’s wealth as well?” \nIt’s complicated – how to deal with people who are self-employed, or who are earning in retirement, or those who are asset wealthy but not currently working. \nShe wants to lay out all the options: “We now need to have an honest conversation with the public about what the costs would be about funding health and social care properly.” \nAnd her job? \n“To keep bringing the evidence to the table,” she says. “To try to coax and cajole as many colleagues as possible in a collaborative way.” \nShe does this in various ways, from bluntly tweeting her views on health policy, to the production of detailed research through the Health Select Committee. \nAnd it seems the committee is keeping busy. Current enquiries include: adult social care funding; minimum alcohol pricing; air quality; the impact of Brexit on medicine; children’s mental health provision; NHS transformation; and nursing. \nA glance through the recently published report on nursing makes for a somewhat sobering read. Whilst the ongoing spat between Jeremy Hunt and the NHS doctors has made regular headlines over the last few years, an under-reported crisis appears to have been brewing in this other vital profession. \nSome stats: a 23% reduction in nursing applications since the NHS bursary was scrapped in 2017; 30% of students not completing their course; professional development funding shrunk from £205m to £83m in just two years. A&E waiting times in Truro were reportedly over seven hours last weekend \nDr Wollaston tells me that, whilst the drop in applicants is concerning, it is also crucial that existing nurses are not forgotten. \n“You can focus as much as you like on putting water into the colander,” she says, “but if it’s all coming out the other end it’s not going to actually increase the workforce.” \nI suggest that such a drop in cash for professional development goes beyond efficiency savings, and has the potential to impact on how, or whether, nurses feel valued. \nShe nods. “Feeling valued was a theme,” she says, of the nurses she met as part of the enquiry. The committee has called for the funding cut to be reversed. \nWhen combined with pay restraints and a stressful working environment, the result has been something of an exodus - over 29,000 nurses and midwives left their professional register in 2016/17. That’s 9% more than the previous year. Read More NHS community health nurse numbers slashed by a quarter in the South West since 2010 \nIt’s not all criticism, though. She welcomes the new role of Nursing Associate in providing a career pathway for Healthcare Assistants, as well as the recent announcement that pay rises for nurses won’t have to be found from within existing NHS budgets. The report also highlights that 33,000 of the 36,000 current nurse vacancies are being filled by agency staff, leaving a national staffing shortfall of 1%. \nIt is this measured, evidence-led approach that demonstrates Dr Wollaston’s role best - her position may involve being critical of the government, but she is not the opposition. This is most evident when I ask her if she thinks people have died because of decisions the government has made regarding the NHS. \nShe withdraws slightly: “It would be foolish of me to point to any specific example.” \nAnd is Jeremy Hunt a good Health Secretary? \nShe says she thinks his passion has been trying to improve patient safety: “I think he has a very strong track record on that,” she says, though it’s unclear whether she approves of the results, or merely the passion. \nShe also tells me he wants to see health and social care looked at as one system, and funded in a way that reflects the changing demands on the service - two aims she strongly supports. \n“In that respect, yes,” she says in answer to the question, before adding: “My job is to hold him to account for how the Health Service is being managed. It’s not my job to always agree.” \nA diplomatic response. Though, if her Twitter account is anything to go by, she reserves her harshest comments for the omnipresent issue of Brexit. \nA recent tweet by her reads: “Better for PM to go down fighting the case for what is the best for the economy of all parts of the UK. The indecision is no longer acceptable.” Brexit uncertainty continues to dominate UK politics \nI ask about the Brexit impact reports that show the effect on the UK’s regional economies of various exit scenarios, but which the government has insisted on keeping locked away for MP’s eyes only. \n“It’s absolute nonsense to keep these things secret,” she says with evident frustration. “The other side [the EU] will have already have made their own analysis.” \nJust to really make the point, Dr Wollaston recently retweeted a leaked photo of the economic assessment. It shows the South West’s economy dropping by 1% if the final deal involves staying in the Single Market, 2% if the UK establishes a free trade agreement, or 5% if we leave without a deal – the so-called ‘cliff edge’. \nIt is for this last issue, and those supporting it, that she saves her full ire, as another recent tweet demonstrates. \n“The #Mogglodytes [supporters of Hard-Brexiteer MP Jacob Rees-Mogg] plotting to oust the PM unless she bows to their demands need to face the reality that there is no Parliamentary majority for their disruptive, disastrous hard #Brexit.” \nClearly, being labelled a “self-consumed malcontent” by the Daily Mail for her vote to give Parliament a final say on Brexit – resulting in abuse aimed at her constituency staff - has not dampened her resolve. \n“I’m not trying to obstruct Brexit,” she says, in the manner of someone who’s made the point many times before. “What I’m trying to do is make sure we get the best possible Brexit.” Read More A third of Devon businesses say Brexit could be a good thing \nInitially a Leave supporter, she switched to the Remain camp during the referendum campaign. She accepts that Brexit will happen, she says, but like many MP’s is concerned about the range of unintended consequences of a ‘cliff edge’ exit. \nShe returns to health to make her point: “If we had a cliff edge walk away Brexit… that would have a very serious implication on the supply chain of medicines and devices”. \nSo what does the best possible Brexit look like for her? \n“A customs union,” she says. A new agreement, different to the current customs union, that would maintain good trade relationships with the EU whilst also allowing for the establishment of new trade deals with non-EU countries. \nBut it’s not just about money. It’s also about political stability and the potential impact of different trading arrangements on the currently fluid UK/Ireland border. \n“Any of us who remember those terrible years of the Troubles don’t want to see a return to that,” she says. “Ruling out a customs union… in my view creates really serious issues for what is going to happen.” Sarah Wollaston is one of many MPs concerned with Theresa May's Brexit approach \nFirst up, though, is the short term transition period. \n“It’s for the birds,” she says, of the idea that new agreements for the two year period – which will begin in March 2019 – can be reached within a year. “The clock is ticking.” \nDr Wollaston suggests handling the transition by joining the existing European Free Trade Agreement (EFTA) that countries such as Switzerland and Norway currently enjoy. It would mean the UK leaving the Common Fisheries Policy – a big issue in her Totnes constituency – but still allow for easy trade. \nHowever, despite evident frustrations around the government’s recent ruling out of a future customs union, as well as it’s secrecy around the impact reports, she doesn’t want to see a leadership challenge. \nWhat she does want is more transparency: “Let’s let the public see it [the impact assessment] so we can have an honest debate about the type of transition deal we need and the type of Brexit we want.” \nIt is this apparent desire for open conversations with the public that seems to unite Dr Wollaston’s current political priorities – from being upfront about funding the NHS, to seeking out the views of ordinary nurses, to being honest about the impact of Brexit. \nThe approach seems to be working, helping her tread the line between measured diplomacy with colleagues and remaining an independent-minded MP for an independent-minded town. \nLater, in a local cafe (independent, of course) I ask left-wing locals Dennis and Julie, probably not natural supporters, what they make of her. \n“I still wouldn’t vote for her party,” says Dennis. “But as a person I think she’s done well.” Like us on Facebook", "external_links": [], "published": "2018-02-16T15:35:00.000+02:00", "crawled": "2018-02-16T20:50:04.022+02:00", "highlightTitle": ""}