{"organizations": [], "uuid": "a4e04a42be86981caf5fda3b9bb0d3319f91cdc9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1153443.ece/ALTERNATES/s1200/1024px-Wild_rabbit_us.jpg", "site_section": "http://www.devonlive.com/rss.xml", "section_title": "devonlive - frontpage", "url": "https://www.devonlive.com/news/devon-news/draft-animal-welfare-bill-might-1153415", "country": "US", "title": "Draft animal welfare bill might mean farmers have to feed hungry wild rabbits", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-01T19:36:00.000+02:00", "replies_count": 0, "uuid": "a4e04a42be86981caf5fda3b9bb0d3319f91cdc9"}, "author": "Daniel Clark", "url": "https://www.devonlive.com/news/devon-news/draft-animal-welfare-bill-might-1153415", "ord_in_thread": 0, "title": "Draft animal welfare bill might mean farmers have to feed hungry wild rabbits", "locations": [], "entities": {"persons": [{"name": "michael gove", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "mr parish", "sentiment": "none"}, {"name": "honiton", "sentiment": "none"}, {"name": "neil parish", "sentiment": "none"}], "locations": [{"name": "tiverton", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "food and rural affairs committee", "sentiment": "none"}, {"name": "sisters food group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Draft animal welfare bill might mean farmers have to feed hungry wild rabbits Neil Parish, chairman of the Environment, Food and Rural Affairs Committee, says the bill needs to go back to the drawing board Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nNew laws designed to better protect animals might be counter-productive and force farmers to feed hungry wild rabbits, Neil Parish has said. \nEnvironment Secretary Michael Gove has published a draft bill that would enshrine animal sentience into UK law post- Brexit and introduce jail sentences of up to five years for animal abusers. \nBut Mr Parish, who is the MP for Tiverton and Honiton, as well as the Environment, Food and Rural Affairs Committee chairman, has said that the bill should go back to the drawing board as the full implications of the bill have not been considered. Read More Devon MP slams Christmas biscuit gift from 2 Sisters Food Group as \"very disappointing” \nAnd speaking on Radio 4’s Today programme, Mr Parish agreed with questions that there was the potential for the bill to force farmers to feed wild rabbits if they were hungry. \nHe said: “There may well be that potential as part of the bill, and the legal advice that we were given that this bill is too loosely drafted. Instead of parliament making the laws, much will be ended up with judicial reviews in the courts.” Neil Parish MP \nClause 1 of the Bill surrounds the recognition of animal sentience. As strong advocates of the need for a five-year maximum sentence for animal cruelty, EFRA worry that the \"vagueness and ambiguity\" of the purpose and meaning of Clause 1 will \"impede and delay\" the introduction of this measure. Read More Four big porn sites now require your name and address ahead of new UK laws \nMr Parish said that the committee were absolutely in favour of getting the strongest possible sentences for animal welfare offences, but said that the bill needed to be re-drafted in a tighter way. \nThe report from the EFRA committee says that: “Animals deserve better than to be treated in a cavalier fashion yet the impression given to us is one of haste. It appears that this draft Bill has been presented to the public - and Parliament - in a far from finished state.” A wild rabbit \nMr Parish added: “The Bill has been rushed and the legislation has suffered as a result”, Mr Parish explained. Read More £10m Axminster relief road 'will unlock so many opportunities' for the town \n“The UK urgently needs a new law focused on animal sentience but this law must be properly thought through and worked out. This legislation is not that. \n“It is important that the Government considers the full implications of a bill before publishing it. It has failed to do so in this case. The bill has been rushed and the legislation has suffered as a result. \n“I am strongly in favour of the increased sentencing provisions in the Bill, but if the UK wants to set a ‘gold standard’ in animal welfare then the punitive measures for crimes against animals must include a greater range of offences. \n“The UK urgently needs a new law focused on animal sentience but this law must be properly thought through and worked out. This legislation is not that.” Neil Parish \nThe draft Animal Welfare bill says the Government “must have regard to the welfare needs of animals as sentient beings in formulating and implementing government policy. Read More 1,500 staff to be axed by Morrisons in major store shake-up \nIt also increases the maximum prison sentence for animal cruelty from six months to five years in England and Wales. \nBut MPs said they were worried the “vagueness and ambiguity” of reforms around animal sentience would “impede and delay” tougher sentencing and called for the proposals to be separated into two bills \nA Defra spokesman said: “We are very grateful to the EFRA committee for their scrutiny of the draft animal welfare bill and are pleased they support the principles behind it. Read More Shocking CCTV shows savage street brawl that left man in a pool of blood \n“We will carefully consider their recommendations as we take legislation forward and will formally respond in due course. \n“We will ensure the UK is a world leader in animal welfare, including by increasing sentences for animal cruelty and recognising animal sentience in law.” Like us on Facebook ", "external_links": [], "published": "2018-02-01T19:36:00.000+02:00", "crawled": "2018-02-01T19:51:29.013+02:00", "highlightTitle": ""}