{"organizations": [], "uuid": "a512f71a6a3309adc05d0263c2ba147411095c9e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article11881861.ece/ALTERNATES/s1200/JS96355993.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14261503", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Nissan bosses to meet Theresa May amid Brexit concerns", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-08T10:35:00.000+02:00", "replies_count": 0, "uuid": "a512f71a6a3309adc05d0263c2ba147411095c9e"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14261503", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Nissan bosses to meet Theresa May amid Brexit concerns", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "helen whitfield", "sentiment": "negative"}, {"name": "coreena ford carillion", "sentiment": "none"}, {"name": "blaydon", "sentiment": "none"}, {"name": "graeme whitfield", "sentiment": "none"}], "locations": [{"name": "ernst", "sentiment": "none"}], "organizations": [{"name": "nissan", "sentiment": "negative"}, {"name": "nbs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KEY EVENT Childhood ambitions, superpowers and a life in business: Helen Whitfield in the Business Interview \nFrom this week, we’ve introduced a new feature in which we interview members of the business community from all manner of sectors. \nBusiness editor Graeme Whitfield has compiled a list of 50 questions - and each week our profiled business leader picks around 10 numbers matching those probing questions. \nFirst up for the all-new business interview is Helen Whitfield, 49, who is the chief operating officer of NBS, a global provider of construction information and knowledge management services. \nShe grew up in Blaydon and worked at Ernst and Young before joining NBS. A qualified accountant, she was the first female director at NBS. NBS chief operating officer Helen Whitfield (Image: handout from client) 9.25 Coreena Ford Carillion collapse should lead to new code of conduct \nThe Government is being urged to establish a new code of conduct for the delivery of public services by private companies in the wake of construction giant Carillion’s collapse. \nUnison said its preferred option was for services to be provided in-house, but it called for a new set of principles to be introduced when the private sector is given contracts. In a letter to the Government, Unison general secretary Dave Prentis said companies receiving taxpayers’ money to deliver public services should abide by principles including integrity, openness and accountability. \nHe said: “Selflessness and integrity mean there can be no place for companies that use tax havens, that blacklist workers for belonging to unions, make it hard for unions to represent the workforce, and generate profits by attacking pay and terms and conditions. \n“The principles of accountability and openness require full transparency. This means that all procurement information should be available online - including tender documentation, bids and all signed and amended contracts.” Work on the Sunderland Vaux site halted after the collapse of Carillion (Image: Newcastle Chronicle) 9.17 KEY EVENT The North East areas which could pay the highest price for Brexit \nAreas like Sunderland and County Durham which backed Brexit could pay the highest price for the UK leaving Europe , according to yet another report. \nA team of trade experts at the University of Sussex studied recently-leaked estimates from the Treasury to analyse the relative impact of the different scenarios now being considered on 122 manufacturing sectors. \nThey believe versions of Brexit under consideration by the cabinet could cut British manufacturing exports by up to a third. \nThe paper, by the UK Trade Policy Observatory, finds that even if the Government is able to strike free trade agreements (FTAs) with every other major country, it would still lead to falls in exports of 34% and 30% for the food and textiles industries respectively if they face new barriers with their main markets in Europe. \nBritain’s car industry, which includes Nissan, could be particularly hard hit after Brexit because trade barriers in the sector tend to be high across the world. \nThe Sussex university academics estimate price rises for UK-made cars of 14%, and falling vehicle exports, in a no deal Brexit scenario. \nAccording to the team who wrote the report: “Areas of the country where there are many jobs in food processing may see gains in output, but most manufacturing jobs are in sectors which are at risk from Brexit, and a list of the areas most at risk – Sunderland, Birmingham, Coventry, Derby, Cheshire East, Solihull and County Durham – show the importance of the motor industry in assessing the risks of Brexit.” 9.15 Coreena Ford Housebuilder Bellway lines up 14% revenues rise \nNewcastle housebuilder Bellway has cheered the UK’s robust market as it lines up a 14% rise in half-year housing revenues. \nThe group said housing revenues were expected to rise to £1.3 billion for the six months to the end of January, up from £1.1 billion over the same period last year. \nThe move has been largely driven by a 6% lift in housing completions to 4,741, with the average selling price enjoying a near 8% climb to a record £276,000. \nExecutive chairman John Watson said: “Bellway is continuing to make a sizeable contribution to the supply of much-needed new homes and has delivered a further increase in both volume and average selling price in the six-month trading period. \n“Significant investment in land, together with ongoing plans to expand the divisional structure, should lead to a further increase in output and hence result in additional value creation for our shareholders.” Shares were up just shy of 1% shortly after the London Stock Exchange opened for trading. Artist's impression of new homes at Scaffold Hill Farm by Bellway Homes and Taylor Wimpey 9.10 Coreena Ford Thomas Cook issues warning of 'unpredictable' market \nTravel giant Thomas Cook has said demand for summer holidays abroad shows no sign of abating, but warned of a competitive and “unpredictable” market. \nBoss Peter Fankhauser cheered a “good start” to the financial year as group revenues rose 7% to £1.7bn in the first quarter to December 31. The tour operator’s seasonal loss narrowed by £10m to £42m in the quarter after its airline was boosted by the collapse of rivals such as Monarch in the UK and Air Berlin in Germany. \nTotal UK bookings are flat for the winter season and 3% higher for the summer season so far despite hotel price hikes for two of its biggest markets - the Canaries and Spain. \nMr Fankhauser said the group had “got off to a good start” overall, but warned over a difficult market. He said: “From all that we see so far, customers’ appetite for a summer holiday abroad shows no sign of slowing down.” \nHe added that Thomas Cook remained on track for full-year forecasts despite a “highly competitive - and, at times, unpredictable - market”. \nThe group said it continued to see pressure on profits amid a price war in Spain. \nIt has sought to shift demand back to more profitable destinations Egypt and Turkey following woes in recent years due to terrorist attacks and political unrest. \nIts airline arm saw a “particularly strong performance” in the first quarter, with an 8% rise in passengers to 3.5 million in the period, while it has seen a “double-digit rise” in summer 2018 bookings. Thomas Cook has said demand for summer holidays abroad shows no sign of slowing. (Image: PA) 9.05 Coreena Ford TalkTalk plots broadband venture \nTalkTalk is laying the groundwork for a broadband infrastructure drive by launching a joint venture with Infracapital to roll-out full fibre to three million homes and businesses. \nThe telecoms firm said £1.5bn would be invested in a new company, which will ramp up competition and help shift Britain’s digital infrastructure back in line with major European nations. \nInfracapital, an infrastructure investment arm of M&G Prudential, will take an 80% slice of the new company and make an initial £400 million investment, with TalkTalk owning 20% and stumping up £100m. The move comes as TalkTalk tapped investors for £200m to shore up its balance sheet, help drive customer growth and underpin its fibre investment plans. \nThe share placing will be 19.99% of existing share capital, with executive chairman Sir Charles Dunstone and other top-level bosses taking up to £40m. However, the firm said it would have to cut its dividend to 2.5p in order to fund the investment drive The TalkTalk logo (Image: PA) 9.00 Coreena Ford Debenhams to cut 320 store manager jobs \nDepartment store chain Debenhams is set to slash 320 store management roles as it pushes through a major cost-cutting drive after being confronted by flagging sales. \nThe retailer said efforts to drive down the “complexity” of management positions, coupled with changes to working practices, would bring “significant cost savings”. \nThe move could hit 25% of store management roles across the organisation, with a new structure expected to be rolled out by the end of next month. Debenhams saw its share price slump as much as 24% last month after warning over profits and slashing prices to bolster lacklustre festive sales. \nIt also announced plans to ramp up cost savings, with around another £10m earmarked for this financial year and £20m extra annually under a reorganisation led by chief executive Sergio Bucher. \nShares in the firm are currently down 1.23% at 28.96. Debenhams, in Newcastle (Image: Newcastle Chronicle) 8.56 KEY EVENT Ross Smith, director of policy at The Chamber, on regional Brexit forecasts \nRoss Smith, director of policy at North East England Chamber of Commerce, has written an insightful piece on what must happen now, in light of the regional forecasts. Here’s what he has to say: \nThe forecasts that have emerged from Government today indicating that North East England would potentially be the region hardest hit by Brexit should come as no great surprise. \nAfter all, our businesses are the most successful in the country when it comes to trading with Europe. If doing that trade is going to be made more difficult, it stands to reason that we have the most to lose. \nWhat is a surprise is that 20 months after the vote, the Government has still failed to adequately address this point. That’s particularly staggering when you consider that the Conservatives were elected last year on the basis of a manifesto that says closing the gap between London and other parts of the UK is “the biggest prize in Britain today”, a “great endeavour”, and that they were “determined to lead the way in the next Parliament”. If figures being shared around Whitehall suggest that their stated top priority could be seriously undermined, I would expect to see some concerted action to tackle it. Instead, all we’ve seen is arguments and obfuscation. \nSo what should happen now? Firstly, we need some frankness from the Government. Presumably they believe it will work out better than this, otherwise they wouldn’t be going through with Brexit. Also, given the manifesto commitments set out above, they must believe that it will work out at least as well for the North East as for London. They should explain what these beliefs are based on, and that should be something rather more substantial than vague talk of a bespoke trade agreement. Don’t keep taking us for idiots, and don’t leave the only counter argument to come from long-term anti-EU ideologues like John Redwood claiming the figures are wrong without any evidence. \nSecondly, the Government must reconsider leaving the Customs Union. The advantage to doing so is the opportunity to pursue independent trade deals with other countries. That will present opportunities – but it will also present huge risks, involve great complexity and require huge capacity building. It is questionable whether the opportunities can genuinely be greater than the negative impact of disrupting trade with our nearest markets. \nIf there is sufficient evidence to show there will be benefits from leaving the Customs Union, then the transition period should be extended. The time to put in place the capacity to deliver such trade deals, and the time for businesses to adjust to new terms of trade and respond to a signal that they should prioritise different markets, is perilously short. \nThere should also be major investment taking place now to enhance the international trade support available to businesses, and crucially the technical training and advice needed to deal with new customs procedures. We should also see investment going into the systems that are needed. That’s not visible, which doesn’t build confidence. \nI could go on – I haven’t even touched on massive issues like the effect of changes to migration and how European funding for regions like ours will be replaced. \nThe bottom line is this: businesses in North East England need to attract people to live, work and invest in our region. Given that these figures have now been released, we need something much more concrete than we have seen to date from Government to support us in doing that, and in winning for them “the biggest the prize in Britain today”. \nDelivering Brexit successfully and in line with that manifesto commitment can’t be impossible, otherwise our Government wouldn’t be devoting all its focus to doing so. But it is very difficult, and so far the Government have shown themselves either incapable or unwilling to take the tough choices needed. They have also been appalling at communication. The release of these forecasts must be a watershed moment when they rise to the massive challenge they have taken on. Ross Smith, North East England Chamber of Commerce director of policy 8.45 Coreena Ford Brexit will devastate North East economy, leaked Government paper shows \nTheresa May’s Brexit “war cabinet” will meet again today against a backdrop of official forecasts showing the regions and sectors of the economy which face being hardest-hit by withdrawing from the European Union. \nThe economy of the North East will suffer massive damage as a result of Brexit and shrink by 11% even if there is a comprehensive trade deal, the Government’s own analysis shows. \nAnd if we crash out of the EU without a deal then GDP in the North East will be hit by 16%. \nThe devastating effect on jobs and wages in the region is revealed in impact assessments which the Government attempted to keep secret. \nThey confirm the North East, with its manufacturing industries and large number of exporters, would be harder hit than any other part of the UK. \nOne North East MP said the case for another referendum on whether to go ahead with Brexit was stronger than ever. \nSky News and the BBC both separately published the regional breakdown. They have still not been published officially, and Government policy is that they should remain confidential. \nThe analysis shows Brexit would mean the North East economy shrank by 3% even if the UK remained a member of the single market. This “best-case scenario” appears highly unlikely, as both Labour and the Conservative Government insist that Brexit must involve leaving the single market. brexit-teaser KEY EVENT Nissan bosses to meet with Prime Minister amid growing Brexit concerns \nRepresentatives from Nissan are among those from three Japanese carmaking giants who are due to meet the Prime Minister today. \nMajor Japanese investors will meet Theresa May and Chancellor Philip Hammond to discuss Brexit. \n“Attendees will cover the most significant investors in the UK in such areas as banking, life sciences, technology and the manufacturing sector,” a Downing Street spokesman said yesterday. \nBanks, drug companies and carmakers Toyota and Honda will also be at the meeting. \nIn 2016, former chief executive and now chairman of Nissan Carlos Ghosn met Mrs May to seek assurances about tariffs in the wake of Brexit. \nLast February the firm unveiled a new £37m press facility, a month after Mr Ghosn said that Nissan would review the competitiveness of its car plant in Sunderland once the final outcome of Brexit negotiations becomes clear. \nThe car manufacturer announced in October 2016 that it was investing in production of new Qashqai and X-Trail models at Sunderland after receiving Government assurances that EU withdrawal would not affect the plant’s competitiveness, but Mr Ghosn said that while the company trusted Prime Minister Theresa May’s assurance, Nissan would want to “re-evaluate the situation” once the final deal is concluded. \nThe new press will last around 25 years, suggesting the firm has clear commitment to the North East. While Mr Ghosn was satisfied with Mrs May’s responses more than a year ago, that may well have now changed. The Nissan factory in Sunderland (Image: Unknown) More On", "external_links": [], "published": "2018-02-08T10:35:00.000+02:00", "crawled": "2018-02-08T11:34:34.003+02:00", "highlightTitle": ""}