{"organizations": [], "uuid": "ba35278f7831bbd3b23cce9e617a976d8bcc7fda", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14261394.ece/ALTERNATES/s1200/Aung-San-Suu-Kyi.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/aung-san-suu-kyi-stripped-14261180", "country": "GB", "domain_rank": 21960, "title": "Aung San Suu Kyi WILL be stripped of Newcastle Freedom of City honour", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-08T10:00:00.000+02:00", "replies_count": 0, "uuid": "ba35278f7831bbd3b23cce9e617a976d8bcc7fda"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/news/north-east-news/aung-san-suu-kyi-stripped-14261180", "ord_in_thread": 0, "title": "Aung San Suu Kyi WILL be stripped of Newcastle Freedom of City honour", "locations": [], "entities": {"persons": [{"name": "aung san suu kyi", "sentiment": "negative"}], "locations": [{"name": "aung san suu kyi", "sentiment": "none"}, {"name": "myanmar", "sentiment": "none"}, {"name": "bangladesh", "sentiment": "none"}], "organizations": [{"name": "newcastle freedom of city", "sentiment": "negative"}, {"name": "newcastle city council", "sentiment": "negative"}, {"name": "united nations", "sentiment": "none"}, {"name": "freedom of newcastle", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Aung San Suu Kyi WILL be stripped of Newcastle Freedom of City honour Newcastle City Council voted to strip the Mayanmar State Counsellor of the honour over the treatment of the Rohingya people Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nNobel Peace Prize winner Aung San Suu Kyi will be stripped of the Freedom of Newcastle after councillors from across party lines banded together to take back the honour. \nNewcastle City Council originally awarded Ms Suu Kyi Freedom of the City in 2011 “in recognition of her long-standing campaign in support of human rights and freedom of speech”. \nBut the Myanmar State Counsellor will now be stripped of the honour for failing to condemn the persecution of the Rohingya people in her home country. Aung San Suu Kyi (Image: AP) \nOver 650,000 Rohingya people have been forced to flee their homes because of a military crackdown in Myanmar, and many are now living in camps in Bangladesh. \nThe United Nations has said the treatment of the Rohingya people “cannot be ruled out as genocide”. \nAt a meeting on Wednesday night, members of the Newcastle Bangladesh community filled the Civic Centre’s public gallery to hear the result of a motion was put forward by council leader Nick Forbes . \nIn his opening speech, Coun Forbes said: “This is a chance to show we are serious that Newcastle is a freedom city. \n“We can’t all fail but to be moved by the plight of those driven out of their homes, out of their country, and who have seen their homes and villages burnt behind them.” Nick Forbes leader of Newcastle City Council (Image: Newcastle Chronicle) \nThe motion was seconded by Coun Dipu Ahad, who said the council did not want to remove Ms Suu Kyi’s honour but needed to in order to show it would not stand by silently. \nConservative and Liberal Democrat councillors also added their support to the proposal, which was unanimously agreed. \nFreedom of the City is an honorary title and the highest accolade the council is able to bestow. It has previously been given to humanitarians including Nelson Mandela , Bob Geldof and Andrei Sakharov. \nThe award has never before been revoked, meaning the Constitutional Committee now needs to establish the arrangements needed to withdraw Freedom of the City from Ms Suu Kyi. Read More \nWhen the motion was passed, Coun Forbes said: “Normally when we consider the Freedom of the City we do so with joy and with a sense of pride. Now there is no sense of pride or joy. \n“We are united by our condemnation and our sorrow that this has come to pass. \n“This doesn’t feel remote or distant. This is a part of the world where we have many people from living in this city, who have done so much to raise money to help there fellow Muslims in their time of need. Read More At last the truth: Brexit will devastate North East economy, leaked Government paper shows \n“This is about us standing should to shoulder with the affected community. What we are doing tonight is showing we stand in solidarity with those affected and that we uphold our values by guarding them. \n“People will say this city, its council, and its communities are united in their condemnation, and are part of a movement to bring about change.” Like us on Facebook", "external_links": [], "published": "2018-02-08T10:00:00.000+02:00", "crawled": "2018-02-08T10:40:53.054+02:00", "highlightTitle": ""}