{"organizations": [], "uuid": "840aedf7e3f2d6708076bfffe2aa81959be54ac2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.gazettelive.co.uk/incoming/article14342940.ece/ALTERNATES/s1200/Tony-Earnshaw-managing-director-of-UK-Commercial-Group-Ltd.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/special-features/uk-commercial-group-facilities-management-14342870", "country": "GB", "domain_rank": 21960, "title": "Going for growth, but still customer-focused: The North East firm aiming high in 2018", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-27T15:42:00.000+02:00", "replies_count": 0, "uuid": "840aedf7e3f2d6708076bfffe2aa81959be54ac2"}, "author": "Adam Gray", "url": "https://www.chroniclelive.co.uk/special-features/uk-commercial-group-facilities-management-14342870", "ord_in_thread": 0, "title": "Going for growth, but still customer-focused: The North East firm aiming high in 2018", "locations": [], "entities": {"persons": [{"name": "tony earnshaw", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}], "organizations": [{"name": "commercial group", "sentiment": "none"}, {"name": "uk commercial group ltd", "sentiment": "none"}, {"name": "ukcg", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Tony Earnshaw, managing director of UK Commercial Group Ltd (Image: UK Commercial Group Ltd) Share Get daily   Thank you for subscribing!   \nA Gateshead facilities management business is targetting significant growth this year following a period of consolidation. \nUK Commercial Group Ltd (UKCG) provides an extensive range of services, including specialist maintenance, commercial cleaning, commercial supplies and training. \nThe company offers a comprehensive portfolio of commercial support services to customers from all sectors, including supermarket chains, care homes, schools, restaurant chains, pubs and hotels. UKCG's fleet of vehicles (Image: UK Commercial Group Ltd) \nHeadquartered in the North East, UKCG has taken up a wealth of lucrative contracts across the UK in recent years - in the process creating a stellar reputation as one of the most dependable firms of its kind. \nThe company has grown to dominate a vast share of the UK-wide commercial specialist maintenance and contract cleaning industry and, despite the uncertainty surrounding Brexit, is aiming for a further 25 to 30 per cent growth in 2018. \nDespite the huge role the internet now plays in business, it is still necessary for any firm wishing to gain status as a national brand to boast several locations. UKCG operates offices in four of England’s major cities - Newcastle, Leeds, Manchester and London. Specialist maintenance \nUKCG offers specialist maintenance services, including plumbing, gutter and drainage repairs, extractor hood and fan repairs, damp proofing, and fire and flood restoration, on a reactive or PPM basis. Commercial cleaning \nDelivered nationwide, UKCG’s commercial cleaning services include window cleaning, gutter and drain cleaning, extractor system and deep kitchen cleaning, garden maintenance and waste removal. Commercial supplies \nUKCG offers a range of commercial supplies, including stationery supplies, workwear, janitorial, safety (PPE) supplies, cleaning products and furniture, available to purchase through a dedicated website - www.ukcommercialsupplies.co.uk Training \nFrom one-day to multiple-day sessions, UKCG provides a range of training courses to help clients and their employees gain new skills. Courses are delivered at the company’s Newcastle training school, which is fully equipped to provide both a classroom teaching environment and practical hands-on experience in simulated environments. \nTony Earnshaw, managing director of UK Commercial Group Ltd, said: “We don’t want to be the biggest, we want to be the best. \n“Customer service is at the heart of everything we do and in these times of uncertainty, it’s vital all customers feel valued and can rely on companies to support them.” Saras Hope Foundation provides holiday breaks for children living with cancer, giving them smiles, hope and precious memories (Image: Saras Hope Foundation) Doing their bit for charity \nThe UKCG team actively take part in charitable work for the company’s nominated charity, Saras Hope Foundation www.sarashopefoundation.co.uk , and will be competing in this year’s Great North Run with pride raising vital funds. \nTony added: “We have been raising funds for Saras Hope Foundation for many years now, a charity which is close to my heart. This year is their 10th Anniversary.” \nPlease donate what you can to help UKCG reach its goal of raising £1,000.00 for the children’s cancer charity - https://mydonate.bt.com/fundraisers/teamukcc \nFor more information on UKCG, visit www.ukcommercialgroup.co.uk or call 0800 032 9533. Like us on Facebook", "external_links": [], "published": "2018-02-27T15:42:00.000+02:00", "crawled": "2018-02-27T16:08:05.014+02:00", "highlightTitle": ""}