{"organizations": [], "uuid": "6a6892c418863956e45b0c8705cdeeed42b9b4e9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14331747.ece/ALTERNATES/s1200/Jeremy-Corbyn-Delivers-Speech-On-Banking-To-The-EEF.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "https://www.chroniclelive.co.uk/news/news-opinion/labour-leader-jeremy-corbyns-allotment-14331746", "country": "GB", "domain_rank": 21960, "title": "Is Labour leader Jeremy Corbyn's allotment a communist plot?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-24T12:45:00.000+02:00", "replies_count": 0, "uuid": "6a6892c418863956e45b0c8705cdeeed42b9b4e9"}, "author": "Mike Kelly", "url": "https://www.chroniclelive.co.uk/news/news-opinion/labour-leader-jeremy-corbyns-allotment-14331746", "ord_in_thread": 0, "title": "Is Labour leader Jeremy Corbyn's allotment a communist plot?", "locations": [], "entities": {"persons": [{"name": "jeremy corbyn", "sentiment": "neutral"}, {"name": "john major", "sentiment": "none"}, {"name": "bob geldofski", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "ján sarkocy", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News opinion Is Labour leader Jeremy Corbyn's allotment a communist plot? In a week that made Carry on Spying look like a documentary, the right wing press made hay with some weird claims Share Jeremy Corbyn (Image: Getty Images Europe) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nJeremy Corbyn’s meeting with Czech Spy Bob Geldofski couldn’t have come at a better time for the Government and its right wing supporters. \nDazed and confused over Brexit , divided and just about conquered by endemic infighting, Theresa May’s faltering leadership makes that of John Major shortly before the Tony Blair New Labour wipe out seem ruthlessly efficient in comparison. \nAnd as their political opponents and the British public watch in wonder as this - we were once told - well-oiled political machine conks out so very publicly, it was time to go on the counter attack. \nThe bizarre story centred around Labour leader Corbyn’s meeting during the Cold War with a Czech spy called Jan Dymic. He was a diplomat working in the Czech embassy in the 1980s, whose real name was actually Ján Sarkocy. \nDuring it Corbyn allegedly revealed state secrets. What these secrets were Jan wouldn’t say because that was confidential. We’d just have to take his word for it - this from a man who claimed he and the Czechs were behind Live Aid. \nHowever one bit of information he did let slip that Corbyn told him was what his political polar opposite Margaret Thatcher had “for breakfast, lunch and dinner, and what she would wear next day”. \nTo me, as the whole story smacked of letting your imagination run riot, this opened up a whole new avenue of speculation, with more than a hint of Romeo and Juliet. Read More Jeremy Corbyn backs calls to get more women and girls into science and engineering \nTo quote from the play: “From forth the fatal loins of these two foes. A pair of star-cross’d lovers take their life.” \nAlas, it was not to be. Instead, with little wit, Corbyn was branded a “collaborator” on the front page of the Daily Mail; the Sun, the Telegraph and the usual suspects did something similar, while the Defence Secretary Gavin Williamson accused Corbyn of a “betrayal of this country” and the episode showed that the Labour leader “can’t be trusted.” \nThis line of attack was skewered by former Sunday Times editor and TV presenter Andrew Neil - who, let us not forget, is no fan of Labour - in an interview with the hapless Tory MP Steve Baker who failed dismally in his attempts to defend the indefensible comments made by Williamson. \nIt didn’t help that a parallel story was running about Boris Johnson actually meeting up with a certain Sergey Nalobin who works for the Russian Embassy and is suspected of being an intelligence agent. In a long-deleted tweet, he described Johnson as his “good friend.” \nNalobin is believed to be part of a programme to ‘deepen’ relations between Russia and Conservative politicians, using the Conservative Friends of Russia group. \nAccording to the Guardian, Nalobin’s father was a KGB general, who the Government believes was involved in the murder of Alexander Litvenenko. \n‘Nothing to see here’ seemed to be the response to the Boris Johnson story of those looking to pillory Corbyn. Why ever could that be? Like us on Facebook", "external_links": [], "published": "2018-02-24T12:45:00.000+02:00", "crawled": "2018-02-24T13:11:48.029+02:00", "highlightTitle": ""}