{"organizations": [], "uuid": "18f304ab5c9d22ba750352b359365e3758049d78", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.birminghammail.co.uk/incoming/article14043947.ece/ALTERNATES/s1200/theresa-brexit.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/theresa-ministers-plan-six-speeches-14280695", "country": "GB", "domain_rank": 21960, "title": "Theresa May and her ministers plan six speeches to answer questions about Brexit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-12T20:00:00.000+02:00", "replies_count": 0, "uuid": "18f304ab5c9d22ba750352b359365e3758049d78"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/theresa-ministers-plan-six-speeches-14280695", "ord_in_thread": 0, "title": "Theresa May and her ministers plan six speeches to answer questions about Brexit", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "neutral"}, {"name": "brexit share theresa may", "sentiment": "none"}, {"name": "david lidington", "sentiment": "none"}, {"name": "liam fox", "sentiment": "none"}, {"name": "david davis", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "boris johnson", "sentiment": "none"}], "locations": [{"name": "brussels", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "international trade", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Theresa May and her ministers plan six speeches to answer questions about Brexit Two weeks of Brexit speeches follow warnings that the North East's economy will be hurt most by Brexit Share Theresa May in Brussels for Brexit talks Share Get daily   Thank you for subscribing!   \nSix speeches by cabinet ministers will set out the Government’s vision for Brexit over the next two weeks. \nIt follows the leak of the Government’s impact assessment showing the economy of the North East could be 16% smaller after Brexit if there is no trade deal, and 11% smaller even if a deal is signed. \nForeign Secretary Boris Johnson will deliver what is being trailed as an upbeat message about Brexit on Wednesday, followed by Prime Minister Theresa May speaking about Brexit and security on Saturday. \nBrexit Secretary David Davis will next week talk about what leaving the EU means for business, International Trade Secretary Liam Fox will speak about trade and cabinet minister David Lidington will explain what Brexit means for devolution. Theresa May in Brussels for Brexit talks \nMrs May will then wrap the whole thing up when she delivers a second speech, titled Road to Brexit: A Future Partnership. \nSome Conservative MPs have been pushing the Government to offer a more positive message about Brexit. \nBerwick-upon-Tweed Conservative MP Anne-Marie Trevelyan said in an interview over the weekend that Chancellor Philip Hammond had been “a bit Eeyore-ish” over Brexit - a reference to the children’s book character Eeyore, who is portrayed as pessimistic and gloomy. \nShe praised Mr Hammond as a “sensible, clever man” but admitted: “I think the chancellor is a cautious man by nature. Sometimes I would like him to be a bit more forthright perhaps, but that’s not how he does his politics.” \nQuestions which have yet to be answered is how the Government will handle immigration policy after Brexit officially takes place in March 2019. \nMrs May is reported to want to ensure that EU citizens who arrive during the planned transition period, which could last for two years after Brexit, do not gain an automatic right to settle in this country. Anne-Marie Trevelyan \nOther questions facing the Government include how it will ensure the predictions in the impact assessments, which show the North East suffering more economic damage from Brexit than any other part of the UK, don’t come true. \nIt also remains to be seen how the Government will protect the car industry if it takes the UK out of the customs union. Firms including Nissan have warned that border checks would play havoc with their production method, known as “just in time”, which involves bringing in parts from suppliers as and when they are needed. \nThere are many unanswered questions about what the Government what like to happen during the transition period. Ministers say that during this period, the UK should have “the same terms of trade during the implementation period as is currently in place today.” However, they say no decision has been made on whether this means remaining in the Customs Union or not. Read More 'Stop taking us for idiots': Theresa May facing Brexit backlash from North East employers \nLabour also faces questions about its policy and Labour MPs are reported to be calling for party’s members be given a direct say on its Brexit policy by creating a policy commission to decide what the party’s official stance on leaving the European Union should be. \nJeremy Corbyn’s party appears to be shifting towards supporting permanent membership of the Customs Union, which would place the UK in a similar position to Turkey, which is a member of the EU’s Customs Union but not the Single Market. Labour leader Jeremy Corbyn (Image: PA) \nHowever, Shadow Chancellor John McDonnell stated over the weekend that Labour backed membership of “a customs union” rather than the Customs Union. \nSedgefield MP Phil Wilson raised concerns after the Japanese ambassador warned that Japanese businesses might consider pulling out of the UK if Brexit goes badly. \nSpeaking after a Downing Street summit with the Prime Minister and 19 leaders from Japan’s big businesses including Nissan and Hitachi, Ambassador Koji Tsuruoka said “if there is no profitability of continuing operations in the UK - not Japanese only - then no private company can continue operations. It is as simple as that. This is all high stakes that I think all of us need to keep in mind.” \nLabour MP Mr Wilson said: “If the Government doesn’t get its act together soon, we could be saying ‘Sayonara’ to Japanese businesses based in the UK. \n“Japanese companies have invested in this country, supporting more than 160,000 jobs, largely on the basis that it provides a bridge into a the wider European market. If that bridge collapses, their investment will dry up.“ Like us on Facebook", "external_links": [], "published": "2018-02-12T20:00:00.000+02:00", "crawled": "2018-02-12T20:34:08.003+02:00", "highlightTitle": ""}