{"organizations": [], "uuid": "816006786ea9c714d546ce3ca1e3b6d421895033", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13605553.ece/ALTERNATES/s1200/Pro-EU-Peoples-March-For-Europe-In-London.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/general-election-fallout-live-updates-14261641", "country": "GB", "domain_rank": 21960, "title": "Brexit fallout LIVE: Updates on leaked report which claims North East would be hardest hit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-08T11:25:00.000+02:00", "replies_count": 0, "uuid": "816006786ea9c714d546ce3ca1e3b6d421895033"}, "author": "Jonathan Walker-NEC", "url": "https://www.chroniclelive.co.uk/news/north-east-news/general-election-fallout-live-updates-14261641", "ord_in_thread": 0, "title": "Brexit fallout LIVE: Updates on leaked report which claims North East would be hardest hit", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathan Walker Brexit means we can do more trade with Japan, says Theresa May \nMore on the Prime Minister’s meeting with Japanese investors: Theresa May has told senior bosses of Japanese businesses that Brexit is “no small undertaking”, but will allow the UK to forge a free trade deal with Japan, PA reports. \nThe Prime Minister said she hoped the talks with major Japanese investors would be “very constructive” as she highlighted the improved UK growth forecast announced by the Bank of England earlier. \nThe heads of businesses including household names such as Mitsubishi, Honda, Nissan and Panasonic - which employ thousands of workers across the country - met at Number 10 amid concern over estimates of the impact of Brexit on economic growth. \nOfficial estimates obtained by Sky News of the potential impact of non-tariff barriers - such as extra red tape, customs checks and rules of origin regulations - on various economic sectors, suggested the motor industry faces cost increases of between 5% and 13%. \nAnd the economically important financial services sector stands to suffer a 5% to 10% cost increase. The Nissan factory in Sunderland (Image: Unknown) \nJoined by Chancellor Phillip Hammond, Business Secretary Greg Clark and International Trade Secretary Liam Fox, Mrs May opened the meeting, saying: “As we look to the relationship between the UK and Japan we see already year-on-year trade between our two countries continues to increase, with Japans’s investment in the UK reaching £46.5 billion in 2016.” \nShe told them the Government’s modern industrial strategy made the UK “more attractive”. And she added: “Just today we have seen the Bank of England raise its forecast for UK growth compared with its estimates three months ago. \n“As we look ahead of course I recognise that UK’s exit for the European Union is no small undertaking, but importantly it does present an opportunity to strike free trade deals around the world and build on our already strong relationship with Japan.” 14:52 Jacob Rees-Mogg at Number 10 \nJacob Rees-Mogg, the arch-Brexiteer, has appeared n the doorstep of Number 10 Downing Street to hand in a petition against the 0.7% aid budget: 13:55 Japanese bosses hold Brexit talk with May \nTop bosses from over 20 Japanese companies are holding talks with the Government amid concerns that billions in investment are at risk because of Brexit. Among those attending a meeting hosted by Prime Minister Theresa May will be the heads of carmakers Nissan, Honda and Toyota, which employ thousands in the UK. They will be joined by some of Japan’s biggest banks - Nomura, Mizuho and Sumitomo Mitsui Banking Corporation - all of which have a significant presence in the City of London. The meeting comes as the Government faces intense pressure to secure tariff-free access to the EU’s single market for car manufacturers following Brexit, as well as secure a trade deal for financial services. Business and trade ministers Greg Clark and Liam Fox will also be in attendance. 13:25 Jonathan Walker Let's keep the Brexit debate civilised, says MP Anne-Marie Trevelyan \nAnne-Marie Trevelyan, the pro-Brexit Conservative MP for Berwick-upon-Tweed, has urged Tory colleagues to keep cool after fellow Tory Anna Soubry urged Theresa May to “sling out” hardline eurosceptics. \nSpeaking on BBC Two’s Newsnight earlier this week, Ms Soubry said: “They are not the Tory party I joined 40 years ago and it is about time Theresa stood up to them and slung ‘em out. \n“They have taken down Major, they took down Cameron, two great leaders neither of whom stood up to them.” Anne-Marie Trevelyan (Image: handout) \nMs Trevelyan was asked about the comments in an interview with website BrexitCentral . \nShe said: \nIt’s always disappointing when colleagues fall below the level of what I would call civilised discussion.” \nStarting to throw insults at colleagues is just a shame. She’s one of those who believes very strongly in the European project and I have the greatest respect for her. I disagree with her fundamentally [on Brexit] but I think perhaps other than that we have very similar views. 12:39 Brexit 'most important factor' in UK's economic future \nBrexit is still deemed the most important factor in determining the UK’s economic future, the Bank of England has said. \n“Developments regarding the United Kingdom’s withdrawal from the European Union - and in particular the reaction of households, businesses and asset prices to them - remain the most significant influence on, and source of uncertainty about, the economic outlook. \n“In such exceptional circumstances, the MPC’s remit specifies that the Committee must balance any trade-off between the speed at which it intends to return inflation sustainably to the target and the support that monetary policy provides to jobs and activity.” 12:04 Pressure to release financial services Brexit paper \nThe Government’s refusal to commit to publishing a paper on the financial services industry after Brexit has been condemned by the Treasury Select Committee’s chairwoman. \nSenior Tory Nicky Morgan said “the clock is ticking” for the vital industry and called for a position paper to be published immediately. \nIn a withering response to the Treasury, Mrs Morgan said: “Nothing undermines a negotiating position more than not having one.” \nEconomic Secretary John Glen wrote to Mrs Morgan setting out the Government’s position, insisting that it would not publish anything which could undermine the Brexit negotiations. \nHe said: “It is important to be cognisant of the fact that the UK’s intentions for our future relationship with the EU form an integral part of our negotiating strategy. “Negotiations are highly sensitive and we want to secure the best possible outcome, including for our financial services industry.” 11:50 The North East areas which could pay the highest price for Brexit \nAreas like Sunderland and County Durham which backed Brexit could pay the highest price for the UK leaving Europe , according to yet another report. \nA team of trade experts at the University of Sussex studied recently-leaked estimates from the Treasury to analyse the relative impact of the different scenarios now being considered on 122 manufacturing sectors. \nThey believe versions of Brexit under consideration by the cabinet could cut British manufacturing exports by up to a third. \nThe paper, by the UK Trade Policy Observatory, finds that even if the Government is able to strike free trade agreements (FTAs) with every other major country, it would still lead to falls in exports of 34% and 30% for the food and textiles industries respectively if they face new barriers with their main markets in Europe. A Nissan car dealership (Image: Andrew Matthews/PA Wire) \nBritain’s car industry, which includes Nissan, could be particularly hard hit after Brexit because trade barriers in the sector tend to be high across the world. \nThe Sussex university academics estimate price rises for UK-made cars of 14%, and falling vehicle exports, in a no deal Brexit scenario. \nAccording to the team who wrote the report: “Areas of the country where there are many jobs in food processing may see gains in output, but most manufacturing jobs are in sectors which are at risk from Brexit, and a list of the areas most at risk – Sunderland, Birmingham, Coventry, Derby, Cheshire East, Solihull and County Durham – show the importance of the motor industry in assessing the risks of Brexit.” 11:36 'Don't take us for idiots': North East business leader reacts \nA leading member of the North East England Chamber of Commerce has told the Government to stop treating people in the region like ‘idiots’, after a leaked Government forecasts showed the region will suffer after Brexit . \nRoss Smith, director of policy at the Chamber, has criticised Ministers for failing to address how the North East’s export heavy economy will survive following the UK’s exit from the EU. Ross Smith, the North East Chamber of Commerce director of policy \nMr Smith said: \nThe forecasts that have emerged from Government today indicating that North East England would potentially be the region hardest hit by Brexit should come as no great surprise. \nAfter all, our businesses are the most successful in the country when it comes to trading with Europe. If doing that trade is going to be made more difficult, it stands to reason that we have the most to lose. \nWhat is a surprise is that 20 months after the vote, the Government has still failed to adequately address this point. That’s particularly staggering when you consider that the Conservatives were elected last year on the basis of a manifesto that says closing the gap between London and other parts of the UK is ‘the biggest prize in Britain today’, a ‘great endeavour’, and that they were ‘determined to lead the way in the next Parliament’. \nIf figures being shared around Whitehall suggest that their stated top priority could be seriously undermined, I would expect to see some concerted action to tackle it. Instead, all we’ve seen is arguments and obfuscation. \nRead more of his comments here . 11:20 MP says ministers 'living in cloud cuckoo land' \nNewcastle North MP Catherine McKinnell has signed an amendment to the Trade and Customs Bill calling for the UK to remain part of the Customs Union. \nShe said: \nIt’s hard to overstate just how concerning these figures are for the North East - which already has the highest unemployment in the country - and local jobs. \nThere is not a shred of evidence that any deal with the EU, or future trade agreements with other countries, will outweigh the clear disadvantages of leaving the single market and customs union, never mind the catastrophic effect of leaving the EU without any deal at all. \nThe Government’s own figures now reveal quite how damaging Brexit could be for the North East - yet we still have absolutely no idea how they intend to mitigate the impact of this on our region. \nMinisters are living in cloud cuckoo land if they think the North East will be better off under any of the Brexit outcomes they might want to achieve - and continuing to stick their fingers in their ears whilst singing loudly is not going to stop this impending damage to our region. 10:58 'The type of news we feared Brexit would bring' \nTwo North East Labour MEPs have spoken out following the report \nPaul Brannen, Labour MEP for the North East of England, commented: \nThis is the type of news we always feared Brexit would bring. As the poorest English region, the North East was inevitably going to be more vulnerable to the economic upheaval of leaving the EU. To see this figure in black and white however is a real shock. \nA 16% reduction in the GDP of the North East translates into thousands of job losses. This is frankly a nightmare scenario for our region and for the government to be aware of this and still be willing to consider a no deal Brexit is absolute madness. At the very least the UK needs to stay in the Single Market and the Customs Union. \nJude Kirton-Darling, Labour MEP for the North East of England, added: \nAs disquieting as this may be, it is unfortunately only the beginning of a string of awful news to come out of the leaked impact assessment papers, and the direct result of the Tories being incapable of negotiating a Brexit deal that won’t drain all money and economic prospects out of the North East. \nOur region is not prepared to take this hit, especially in the context of ceasing to be the beneficiary of vital EU funding that has helped North East economy for many years. My constituents did not vote for a future outside of the EU that will see them unbelievably worse off. 10:53 KEY EVENT Nissan and Hitachi in Downing Street to meet the Prime Minister and Chancellor \nRepresentatives of major North East employers Nissan and Hitachi will be in Number 10 today to meet the Prime Minister and the Chancellor. \nIt’s a coincidence that the long-planned meeting takes place the day after the Brexit assessments were leaked. \nBut Brexit will be one of the items on the agenda. \nThe event, in the early afternoon, is a roundtable for Japanese investors. A range of other businesses from Japan’s manufacturing, banking and telecommunication sectors will also be there, including Toyota, Honda and Mitsubishi. The Nissan factory in Sunderland (Image: Unknown) \nRepresenting the Government will be Prime Minister Theresa May, Chancellor Philip Hammond, Business Secretary Greg Clark and International Trade Secretary Liam Fox. \nThe UK’s industrial strategy and trading relationship with Japan are also on the agenda, although it’s safe to assume Brexit will be part of those discussions too. \nThe meeting follows a joint visit to the country in September 2017 where the International Trade Secretary and the Prime Minister met the Prime Minister of Japan and discussed future growth and bilateral trade. \nIn November the Department for International Trade set up a trade working group with Japan to do explore ambitions on global free trade. \nInternational Trade Secretary Liam Fox said in a statement to the media: “As we take control of our trade policy for the first time in forty years, it’s important that we build upon our strong trade relationships with global partners like Japan. \n“As an international economic department, engaging with Japanese buyers and investors is a key part of showcasing what the UK offers the world. Every penny of investment secured boosts local economies and creates new jobs back in the UK.” 10:45 Jonathan Walker 'We shouldn't believe a word of it' says pro-Brexit MEP \nClaims that Brexit will cause enormous harm to the North East economy are just not true, according to MEP Jonathan Arnott. \nThe pro-Brexit MEP, previously a member of UKIP and now an independent, says that Treasury data has been misinterpreted - and the data has a track record of being flawed in any case. Jonathan Arnott (Image: Getty Images Europe) \nHe said: \nActual recent empirical evidence suggests that we shouldn’t believe a word of it. Let’s look at the facts from recent Treasury predictions. \nThe Treasury projected that the UK would fall into recession and lose between 3% and 6% of GDP in the last 18 months. Real data shows the economy has grown in every single quarter. They projected the loss of between half a million and 800,000 jobs over the last 18 months. The reality is that jobs have been created. \nNow they’re projecting not over 18 months but over 15 years. If they’re so wildly wrong in 18 months, why does anyone suppose they’ll be right over 15 years? For pity’s sake, even Government Ministers are saying these figures should come with a health warning. \nThe reason these figures are always out is that they consider the downside rather than the upside. Nobody ever factors in the benefits of Brexit; the ability to negotiate trade deals with third countries, the ability to get rid of unnecessary EU regulations, or run a more competitive economic policy. \nHere in the North East, the figures have the worst projections in the UK - and why? Because for a region that trades more than any other with non-EU countries, the failure to consider the benefits of Brexit will mean the figures are more wrong than anywhere else in the UK. \nNow there’s all kinds of misinformation and propaganda being spread about this: continuity Remainers are trying to make it sound like these figures predict the economy contracting. In fact, they predict it growing at a slower rate. \nThe 16% prediction is a worst-case scenario, spread over 15 years, and is based upon about as much proven track record as using a crystal ball to predict this week’s lottery results. 10:40 Jonathan Walker Should the Government now publish all the details? \nThe assessment showing how the North East will be affected by Brexit has still not been officially published. \nThe Government’s approach is officially that they should remain confidential. \nThink tank IPPR North says they must now be releaed in full, so that people know what to expect from Brexit. \nLuke Raikes, Senior Research Fellow at IPPR North, said: \nThis impact analysis appears to confirm that the North is at greater risk from Brexit than London, as many had feared. \nThe North’s supply chains in goods and services are more closely integrated with the EU. This means that adjusting to Brexit will be extremely challenging. \nGovernment should publish the detail of these impact assessments urgently, so that businesses in the North may prepare. \nNorthern businesses do have the ability to adapt, but they may need government support. \nThe UK government must learn from previous economic shocks and from other advanced economies. \nThey must let regions take on more power and funding over industrial strategy so that they can mobilise the people and funds to weather the challenge ahead. 10:25 Jonathan Walker Employers demand 'concerete action' to protect the North East \nRoss Smith, Director of Policy at North East England Chamber of Commerce, says it’s no surprise the North East could be the region hardest-hit by Brexit - but he says it’s a surprise that 20 months after the Brexit referendum, “the Government has still failed to adequately address this point”. \nIn an article published on the Chamber’s website , he said: \nThe bottom line is this: businesses in North East England need to attract people to live, work and invest in our region. \nGiven that these figures have now been released, we need something much more concrete than we have seen to date from Government to support us in doing that, and in winning for them “the biggest the prize in Britain today”. \nDelivering Brexit successfully and in line with that manifesto commitment can’t be impossible, otherwise our Government wouldn’t be devoting all its focus to doing so. \nBut it is very difficult, and so far the Government have shown themselves either incapable or unwilling to take the tough choices needed. They have also been appalling at communication. \nThe release of these forecasts must be a watershed moment when they rise to the massive challenge they have taken on. 10:21 Business leaders say 'patience is wearing thin' \nBusiness and political leaders are raising pressure on the Government on Brexit with a warning that “patience is wearing thin” in the business community. \nAs ministers in the Prime Minister’s Brexit “war cabinet” met to discuss what they want from the future relationship with the EU , the business lobby intervened to demand “clear negotiating objectives”. \nIn its toughest statement on Brexit yet, the British Chambers of Commerce (BCC) said that the business community’s patience with the Cabinet’s “continued division” on Brexit is “wearing thin” and Theresa May must urgently deliver a clear statement of Government wants. \nIn a letter to Mrs May, the BCC warned that companies were beginning to activate Brexit contingency plans, which will be seen as a coded warning that jobs could leave the UK. Dr Adam Marshall (Image: Coventry Telegraph Archive) \nBCC director general Adam Marshall and president Francis Martin went on: “The perception amongst businesses on the ground, large and small alike, is one of continued division. Even amongst the many optimistic, future-oriented firms - those who see opportunity in change - patience is wearing thin. Directly-affected companies are poised to activate contingency plans. Many others, worryingly, have simply disengaged.” \nRead more here . Details leaked to media \nThe analysis shows the impact of leaving the EU over 15 years compared to what would happen to the UK economy if Brexit didn’t take place. \nInformation first emerged at the end of January, when details were obtained by website Buzzfeed. brexit-teaser \nSky News and the BBC both separately published the regional breakdown. They have still not been published officially, and Government policy is that they should remain confidential. \nThe analysis shows Brexit would mean the North East economy shrank by 3% even if the UK remained a member of the single market. This “best-case scenario” appears highly unlikely, as both Labour and the Conservative Government insist that Brexit must involve leaving the single market. Calls for second referendum \nOne North East MP said the case for another referendum on whether to go ahead with Brexit was stronger than ever. \nSedgefield MP Phil Wilson said: “With new information becoming available, the British people should have another say on what the final deal is, and whether we should go ahead with it.” Brexit will devastate North East \nThe economy of the North East will suffer massive damage as a result of Brexit and shrink by 11% even if there is a comprehensive trade deal, the Government’s own analysis shows. \nAnd if we crash out of the EU without a deal then GDP in the North East will be hit by 16%. \nThe devastating effect on jobs and wages in the region is revealed in impact assessments which the Government attempted to keep secret. \nThey confirm the North East, with its manufacturing industries and large number of exporters, would be harder hit than any other part of the UK. More On", "external_links": [], "published": "2018-02-08T11:25:00.000+02:00", "crawled": "2018-02-08T11:34:34.000+02:00", "highlightTitle": ""}