{"organizations": [], "uuid": "32b315e18edd953dafa839f40873b58430c55c90", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14296476.ece/ALTERNATES/s1200/Untitled-design-17.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/newcastle-leader-heads-brussels-put-14296342", "country": "GB", "domain_rank": 21960, "title": "Newcastle leader heads to Brussels to put city's case to EU Brexit negotiator Michel Barnier", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-16T07:00:00.000+02:00", "replies_count": 0, "uuid": "32b315e18edd953dafa839f40873b58430c55c90"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/newcastle-leader-heads-brussels-put-14296342", "ord_in_thread": 0, "title": "Newcastle leader heads to Brussels to put city's case to EU Brexit negotiator Michel Barnier", "locations": [], "entities": {"persons": [{"name": "michel barnier newcastle", "sentiment": "negative"}, {"name": "michel barnier council", "sentiment": "negative"}, {"name": "barnier", "sentiment": "none"}, {"name": "coun nick forbes", "sentiment": "none"}, {"name": "david davis", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "nick forbes", "sentiment": "none"}, {"name": "michel barnier", "sentiment": "none"}], "locations": [{"name": "brussels", "sentiment": "none"}, {"name": "eu brexit", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "nottingham", "sentiment": "none"}, {"name": "cardiff", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "bristol", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "newcastle city council", "sentiment": "none"}, {"name": "british government", "sentiment": "none"}, {"name": "leeds", "sentiment": "none"}, {"name": "eu brexit", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Newcastle leader heads to Brussels to put city's case to EU Brexit negotiator Michel Barnier Councillor Nick Forbes says Newcastle's people and businesses must have a voice as Brexit takes place Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe leader of Newcastle City Council is to meet chief EU Brexit negotiator Michel Barnier in Brussels. \nCoun Nick Forbes said it was “vitally important” the city’s businesses and people have a voice in the Brexit process. \nMr Barnier has been representing the EU in talks with Brexit Secretary David Davis and other senior British Government figures, as the UK prepares to leave the European Union in March 2019. Read More Labour government would label meat from animals which haven't been stunned \nOn Monday he will meet leaders and mayors of the UK’s major cities, including Bristol, Cardiff, Birmingham, Nottingham, Manchester and Leeds as well as Newcastle. \nIt comes less than two weeks after a leaked Government impact assessment showed economy of the North East could suffer massive damage as a result of Brexit. Labour Councillor Nick Forbes (Image: Daily Mirror) \nQuitting the EU without a trade deal would leave the economy of the North East 16% smaller than if we stayed in, while the economy will be 11% smaller even if a deal is signed, according to the assessments. \nCity leaders say their goal is not to interfere with the Government’s negotiations, but to ensure cities have a voice in the process and continue to forge links with European cities even after Brexit. \nCoun Forbes, said: “Government is, of course, leading on the Brexit negotiations. Our Core Cities meeting with Mr Barnier is not part of those discussions. \n“But Core Cities are the engines of growth for the UK economy and it’s vitally important that the interests of our communities and businesses have a voice in the process. European Union chief Brexit negotiator Michel Barnier (Image: AP) \n“We are working with Government to deliver devolution and that will play a critical role in the success of the UK’s post-Brexit economy.” \nThe ten cities already work together on a number of issues, calling themselves Core Cities UK. \nLeaders and mayors will visit the European Commission headquarters alongside the President of the European cities network, called EUROCITIES. \nThey will also be urging other European urban areas to highlight to their Governments the importance of a positive relationship between cities. \nThe city leaders and mayors plans to share the outcome of the discussion with Government ministers and opposition shadow ministers. Read More", "external_links": [], "published": "2018-02-16T07:00:00.000+02:00", "crawled": "2018-02-16T08:34:07.005+02:00", "highlightTitle": ""}