{"organizations": [], "uuid": "38c014b82f81e52e201c8c7020b04b7f9931e3d3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article950755.ece/ALTERNATES/s1200/Morrisons.jpg", "site_section": "", "section_title": "", "url": "https://www.devonlive.com/news/jobs/1500-staff-axed-morrisons-major-1152601", "country": "US", "title": "1,500 staff to be axed by Morrisons in major store shake-up - Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "", "spam_score": 0.604, "site_type": "news", "published": "2018-02-01T18:17:00.000+02:00", "replies_count": 0, "uuid": "38c014b82f81e52e201c8c7020b04b7f9931e3d3"}, "author": "Ravender Sembhy", "url": "https://www.devonlive.com/news/jobs/1500-staff-axed-morrisons-major-1152601", "ord_in_thread": 0, "title": "1,500 staff to be axed by Morrisons in major store shake-up - Devon Live", "locations": [], "entities": {"persons": [{"name": "paignton", "sentiment": "none"}, {"name": "gary mills", "sentiment": "none"}, {"name": "mike southon", "sentiment": "none"}, {"name": "bideford", "sentiment": "none"}, {"name": "morrisons", "sentiment": "none"}, {"name": "plympton", "sentiment": "none"}], "locations": [{"name": "tiverton", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "crediton", "sentiment": "none"}, {"name": "totnes", "sentiment": "none"}, {"name": "tavistock", "sentiment": "none"}], "organizations": [{"name": "morrisons", "sentiment": "none"}, {"name": "plymouth herald", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get Daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \n1,500 shop floor worker jobs are at risk at Morrisons. \nThey have become the latest supermarket to announce large-scale job cuts. \nThe supermarket giant, which has stores in Plymouth, Plympton, Tavistock, Totnes, Exeter, Crediton, Teignmouth, Tiverton, Paignton and Bideford, have said the shake-up is part of a restructure that would see more customer service staff and fewer managers. \nUnder the proposals, roles such as warehouse manager are set to be culled, as the Plymouth Herald reports. \nGary Mills, Morrisons retail director, said: “Our aim is to serve customers better with more front-line colleagues in stores improving product availability and helping customers at the checkouts. Morrisons, Bideford (Image: Mike Southon) \n“Very regrettably, there will be a period of uncertainty for some managers affected by these proposals and we’ll be supporting them through this important process. \n“Our commitment is to redeploy as many affected colleagues as possible.” Read More There are more than 100 jobs now available at a Devon theme park \nSimultaneously Morrisons said it will create 1,700 junior jobs. \nThe Bradford-based firm also said affected managers will be given the opportunity to apply for around 800 management vacancies in Morrisons stores. Morrisons Exeter \nSeveral household names have embarked on job cutting drives recently, including supermarket behemoths Tesco, Sainsbury’s and Asda. \nEarlier this week B&Q said it is to swing the axe on 200 head office jobs as part of a cost-cutting drive at the DIY retailer. Read More \nThe news comes at a bruising time for high street retailers, which are struggling with Brexit-fuelled inflation that has sent the cost of goods rocket and consumer confidence plummeting. \nTo compound matters, firms have been stung by soaring business rates. \nHowever, Morrisons has been among the strongest performers compared to its peers over the past 12 months, with a turnaround led by chief executive David Potts bearing fruit. Morrisons \nOver Christmas, Morrisons was a stand-out performer among the so called Big Four thanks to surging sales of its premium range and efforts to keep a lid on prices. \nGroup like-for-like sales jumped 2.8% in the 10 weeks to January 7, with retail sales up 2.1% and wholesale 0.7% ahead. Read More 'Unexploded device' found in flats in Kingskerswell \nIt said it enjoyed an “especially strong” festive season as sales picked up pace in the last seven weeks, up 3.7% across the group. \nJoanne McGuinness, Usdaw and Sata national officer, said: “This is a further big upheaval for the Morrisons store management team after the restructure in 2014/15. We will be entering into consultations with the company on behalf of our members affected by these changes, which the company proposes to implement in April. Morrisons home delivery van \n“We are providing Sata members with the support, advice and representation they require through this process. Our priorities are to avoid redundancies and help our members stay employed within the business. We have secured from Morrisons a commitment to offer redeployment opportunities for all affected managers.” Like us on Facebook ", "external_links": [], "published": "2018-02-01T18:17:00.000+02:00", "crawled": "2018-02-02T04:12:02.061+02:00", "highlightTitle": ""}