{"organizations": [], "uuid": "2f2fc67bb9a4b3c0db02a0347a0e523bf11d37c9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1252750.ece/ALTERNATES/s1200/fishmanPNG.png", "site_section": "http://www.westernmorningnews.co.uk/editorschoices.rss", "section_title": "devonlive - frontpage", "url": "https://www.devonlive.com/news/devon-news/drop-bass-devon-restaurants-urged-1252748", "country": "GB", "title": "Drop the bass - Devon restaurants urged to pull fish from menu", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-23T09:14:00.000+02:00", "replies_count": 0, "uuid": "2f2fc67bb9a4b3c0db02a0347a0e523bf11d37c9"}, "author": "Keith Rossiter", "url": "https://www.devonlive.com/news/devon-news/drop-bass-devon-restaurants-urged-1252748", "ord_in_thread": 0, "title": "Drop the bass - Devon restaurants urged to pull fish from menu", "locations": [], "entities": {"persons": [{"name": "darren", "sentiment": "none"}, {"name": "emma carter", "sentiment": "none"}], "locations": [{"name": "devon", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "kingsbridge", "sentiment": "none"}, {"name": "south devon", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "british hospitality association", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nCaterers are being urged to take wild sea bass off the menu by the body that represents anglers. \nThe Angling Trust has written to the British Hospitality Association calling on it to make sure its members aren’t supporting illegal fishing by selling or serving protected spawning sea bass in February and March. \nA ban was introduced by the EU on February 1 this year to protect wild bass when they come together to spawn and are particularly vulnerable to fishing. The spawning stock of bass in northern European waters has declined by two-thirds since 2010. \nThe trust said: “Unfortunately, despite the ban on bass being landed, members of the public have reported fresh wild bass from northern European waters being sold by fishmongers and restaurants in February. Read More South Devon trawlermen on trial accused of illegal scallop fishing \n“As a result, the Angling Trust is raising awareness of the ban with the catering industry in the UK.” \nEmma Carter, who manages Kingsbridge, South Devon, fishmonger Catch Of The Day with husband Darren, said they would not stock sea bass at this time of year. \n“I’m an ex-fisherman and I won’t stock it in the spawning season, and that’s the same with plaice,” she said. \n“What’s getting on our nerves at the moment is that the French boats are fishing in our waters, taking our bass and landing it in France. \n“After Brexit we’ll be able to get our fish back.” \nDan Garnett – “Dan the Fishman” – from Clovelly Fish in North Devon, said: “The provenance of fish is very important and I would not entertain on my market stall any imported foreign so-called wild sea bass. Read More Shocking picture shows how beautiful seabird was killed by careless fisherman \n“We are selling no bass at the moment because there’s a total ban. \n“My customers are furious that they are being denied the opportunity to eat fresh sea bass when we know that stocks are healthy. \n“We like to work hand-in-hand with anglers’ organisations. We must protect today in order to protect the future.” \nThe Devon and Severn Inshore Fisheries and Conservation Authority is banning all netting except for sandeels in the region’s estuaries from March 1. \nMr Garnett said: “That is effectively putting out of business our small fleet of boys who fish inshore in winter when it’s too rough to go over the bar. \nIn a letter, the Angling Trust has called on the British Hospitality Association to inform its members that the buying or selling of fresh wild northern sea bass in February and March risks supporting illegal landings of a stock which is so threatened that it may not be able regenerate itself for an extended period. Read More Hundreds of whales and dolphins spotted off our coast \nMembers of the public can help by informing any restaurants or retailers selling wild bass from northern European waters that the fish they are selling or serving in February and March has been landed illegally. \n“In order to support the campaign the Angling Trust’s partner, Save Our Sea Bass, has set up a Facebook group, Sea Bass – Prohibited Species, for members of the public to report incidences of wild bass being sold during the closed period during February and March. \nDavid Mitchell, head of marine at the Angling Trust, said: “Retailers and caterers may not be aware of the ban on landing any bass during February and March this year. \n“We are trying to help raise awareness that any purchasing, selling or serving of wild bass during these months risks supporting illegal fishing as well as threatening the future of the stock. Read More Product recall on Young's Chip shop fish cakes that could contain pieces of metal \n“The catering industry can play an important role in cutting out demand for illegal landings of bass and helping to inform consumers about regulations put in place to prevent wild sea bass being removed from menus permanently.” \nThe British Hospitality Association did not respond to a request for comment. The organisation yesterday agreed to a merger with the Association of Licensed Multiple Retailers, to form a new trade body, UKHospitality. Like us on Facebook ", "external_links": [], "published": "2018-02-23T09:14:00.000+02:00", "crawled": "2018-02-23T10:13:45.004+02:00", "highlightTitle": ""}