{"organizations": [], "uuid": "8231a7f92ec24744cda0f05caa946fba64b642bf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14099284.ece/ALTERNATES/s1200/John-McCabe.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/chamber-commerce-president-john-mccabe-14288206", "country": "GB", "domain_rank": 21960, "title": "Chamber of Commerce president John McCabe on hard work, good people and not playing for Liverpool FC", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-14T20:00:00.000+02:00", "replies_count": 0, "uuid": "8231a7f92ec24744cda0f05caa946fba64b642bf"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-news/chamber-commerce-president-john-mccabe-14288206", "ord_in_thread": 0, "title": "Chamber of Commerce president John McCabe on hard work, good people and not playing for Liverpool FC", "locations": [], "entities": {"persons": [{"name": "john mccabe", "sentiment": "neutral"}, {"name": "rio tinto alcan", "sentiment": "none"}, {"name": "robson brown", "sentiment": "none"}], "locations": [{"name": "blyth", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}], "organizations": [{"name": "liverpool fc chamber of commerce", "sentiment": "neutral"}, {"name": "liverpool fc", "sentiment": "neutral"}, {"name": "chamber of commerce", "sentiment": "neutral"}, {"name": "northumbrian", "sentiment": "none"}, {"name": "newcastle building society", "sentiment": "none"}, {"name": "north east england chamber of commerce", "sentiment": "none"}, {"name": "transco", "sentiment": "none"}, {"name": "share north east england chamber of commerce", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Chamber of Commerce president John McCabe on hard work, good people and not playing for Liverpool FC PR company boss John McCabe answers a random selection of questions in our weekly business interview Share North East England Chamber of Commerce president John McCabe (Image: Unknown) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nJohn McCabe, 45, is the founder and MD of Fusion PR in Blyth, Northumberland . He started his career as an apprentice at Northumbrian Water before working in public relations for Robson Brown, Transco, Newcastle Building Society and Rio Tinto Alcan. He is currently the president of the North East England Chamber of Commerce. What was the biggest mistake in your working life and how did you react? \nNot sure if it was a mistake or not, but a regret is not doing my own thing and starting my own business until I was in my mid-forties. I wish I’d been able to do that earlier in my career. What is the secret of your success? \nI’m a firm believer in all aspects of life in surrounding yourself with good people and not being afraid to ask for help. No one has all the answers but if you’ve got good people around you and you don’t know what to do, the chances are they will. What did you want to be when you were growing up? \nCaptain of Liverpool. I was brought up as a Liverpool fan, it’s been in my family for years so I’ve known nothing else but supporting Liverpool. I was brought up to be a Liverpool fan, my kids have been encouraged to be Liverpool fans. I’m incredibly proud to be from the North East but I’m proud of my football team too. How is your business going to change in the next 10 years? \nWe’ve recently appointed a creative director to allow us to broaden our offering to clients beyond public relations, into aspects of creative, design and marketing. It was important for us to make that step in order to try to differentiate ourselves from a pretty competitive field. Brexit: good or bad? \nI, like everybody else, had an opinion on Brexit and I voted in the referendum. The result is what it is. I would just like to see the Government making a better job of the instruction the British people gave them. What would your superpower be? \nI’m not a big fan of superheros. But the one I like best is Batman because he doesn’t actually have any superpowers, he’s just become really good at what he does. I don’t need to fly or run faster than a speeding bullet. Batman has just got really good in his crimefighting capacity so that seems a good model. What are your main motivations at work? \nOne is genuinely to create good jobs and opportunities for good people. The other is to deliver an outstanding service to our clients. What’s your biggest source of frustration at work? \nI would say – and I’m answering this both in my Chamber capacity and in my day job – it’s that as a region we’re quite humble, in terms of the people and the businesses people have created and grown here. There’s room for us to do a little bit more to recognise the work those businesses do. How important is it for business to play a role in society? \nIt’s hugely important, first and foremost in terms of the jobs that businesses create and sustain and the impact that has on people and their families. But business also has a big role too in lifting aspirations for people in a region, and also we should be conducting business in the right way. What is your proudest achievement? \nI’m not really driven by achievements but when I look back I’m really pleased that my parents were able to see some of what I’ve done in my career and express their pride in it. I took a lot of joy and satisfaction from that. My dad is no longer with us but would have been incredibly proud of the Chamber presidency and with the business we’ve set up. Talent, hard work or ambition: which is the most important? \nHard work, absolutely. I came from a very working class background, I didn’t go to university. I came from a place where aspirations weren’t as high as they maybe should be but it means that whatever I’m doing today I’m doing through hard work rather than anything else. Describe yourself in three words. \nResolute, hard-working and loyal. (Is hard-working one word or two? One if it’s hyphenated, I reckon!) Like us on Facebook", "external_links": [], "published": "2018-02-14T20:00:00.000+02:00", "crawled": "2018-02-14T20:16:23.047+02:00", "highlightTitle": ""}