{"organizations": [], "uuid": "249580732bb7e38d4b20ab22f2f57791a6540559", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1136409.ece/ALTERNATES/s1200/FisherPNG.png", "site_section": "http://www.devonlive.com/rss.xml", "section_title": "devonlive - frontpage", "url": "https://www.devonlive.com/news/devon-news/prime-ministers-sympathy-family-paignton-1265723", "country": "US", "title": "Prime Minister's sympathy for family of Paignton woman killed in OAP driver crash", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-26T16:59:00.000+02:00", "replies_count": 0, "uuid": "249580732bb7e38d4b20ab22f2f57791a6540559"}, "author": "Tina Crowson", "url": "https://www.devonlive.com/news/devon-news/prime-ministers-sympathy-family-paignton-1265723", "ord_in_thread": 0, "title": "Prime Minister's sympathy for family of Paignton woman killed in OAP driver crash", "locations": [], "entities": {"persons": [{"name": "sherlock", "sentiment": "none"}, {"name": "evelyn fisher", "sentiment": "none"}, {"name": "evelyn fisher  evelyn", "sentiment": "none"}, {"name": "vauxhall corsa", "sentiment": "none"}, {"name": "william sherlock", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "mrs fisher", "sentiment": "none"}], "locations": [{"name": "paignton", "sentiment": "none"}, {"name": "hyde road", "sentiment": "none"}, {"name": "torquay", "sentiment": "none"}, {"name": "whidbourne avenue", "sentiment": "none"}], "organizations": [{"name": "oap", "sentiment": "none"}, {"name": "preston conservative club", "sentiment": "none"}, {"name": "house", "sentiment": "none"}, {"name": "exeter crown court", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Prime Minister's sympathy for family of Paignton woman killed in OAP driver crash 'We take this issue very seriously' she tells the House Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe Prime Minister has voiced her and MPs' sympathy with the family of Paignton woman killed when an elderly driver veered off the road on to the pavement where she was walking. \nTheresa May said the whole House had sympathy for the family of Evelyn Fisher who was killed in the crash. Driver William Sherlock, 90, was due to stand trial at Exeter Crown Court but the case was shelved because he is too old and infirm to attend court. \nSherlock, of Whidbourne Avenue, Torquay, had denied causing the death of 61-year-old Mrs Fisher by dangerous driving. \nHis Vauxhall Corsa was alleged to have mounted the pavement in Hyde Road, Paignton, on the afternoon of Saturday April 2, 2017, and hit Mrs Fisher before crashing into the window of the Big Baguette cafe. Evelyn Fisher \nEvelyn, who had worked at Preston Conservative Club, suffered fatal injuries and died in hospital. Hundreds of people turned out for her funeral. She left a partner, daughter and two grandchildren. \nAt the inquest, coroner Deborah Archer called on the Department of Transport to tighten up the rules on elderly drivers as a result. Ms Archer said she would use her powers to call for a review of the policy of people ‘self-reporting’ medical issues to the DVLA. Read More Calls for new tests on older drivers after town centre fatal crash tragedy \nTorbay MP Kevin Foster told the House: “My constituent Evelyn Fisher was killed when a car mounted the pavement, with tests done after the incident indicating that the driver had an undiagnosed medical condition that would have needed to be assessed by the Driver and Vehicle Licensing Agency had it been detected beforehand. Read More \n“What view does the Prime Minister take of the current system and rules for ensuring that those who hold driving licences are fit to drive?” \nThe Prime Minister responded that Mr Foster had raised ‘a very important point’. Sarah Wollaston is one of many MPs concerned with Theresa May's Brexit approach \nShe said: “It is absolutely crucial - of course we want to ensure this - that people who are driving are actually fit to drive. \n“I know that the sympathies of not just my hon. Friend but the whole House will be with Evelyn’s family and friends. \n“The current driving licence system is designed to balance road safety with the needs of the individual. Read More Hot jacket spuds for the baboons - and other ways the zoo prepares for the Beast from the East \n“All drivers must inform the DVLA if they have a medical condition that might affect their driving and should discuss any of their concerns with their own medical professionals. \n“We take this issue very seriously and are committed to ensuring that those who are granted a driving licence are fit to drive.” Like us on Facebook ", "external_links": [], "published": "2018-02-26T16:59:00.000+02:00", "crawled": "2018-02-26T17:07:17.004+02:00", "highlightTitle": ""}