{"organizations": [], "uuid": "fea1c0fdddf12f5bda36abadd1c1e9c6a724ebce", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14286474.ece/ALTERNATES/s1200/New-baby-lambs.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/labour-government-would-label-meat-14286003", "country": "GB", "domain_rank": 21960, "title": "Labour government would label meat from animals which haven't been stunned", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-14T10:00:00.000+02:00", "replies_count": 0, "uuid": "fea1c0fdddf12f5bda36abadd1c1e9c6a724ebce"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/labour-government-would-label-meat-14286003", "ord_in_thread": 0, "title": "Labour government would label meat from animals which haven't been stunned", "locations": [], "entities": {"persons": [{"name": "ewe", "sentiment": "none"}, {"name": "johner", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}], "organizations": [{"name": "news labour", "sentiment": "negative"}, {"name": "invalid email  shoppers", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Labour government would label meat from animals which haven't been stunned Plan to let shoppers know if animals have been stunned is part of wide-ranging plan to improve animal welfare Share Sheep and week-old lambs (Image: PA) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nShoppers would gain the right to know whether meat has come from animals killed using Halal or Kosher methods under a Labour government, as part of a major package of measures to promote animal welfare. \nAll meat would be labelled to reveal whether the animal was stunned or not, as well as which country it came from and how it was produced. \nKosher meat produced in line with Jewish traditions, and some Halal meat produced according to Islamic traditions, comes from animals which are not stunned before they are slaughtered. \nBut some vets and animal welfare groups say this causes unnecessary suffering. Current UK law requires all other meat to be stunned before slaughter. Ewe and lambs in a meadow (Image: Johner) \nThe labelling plan is just part of major package of laws to protect animal welfare, to be announced by Labour today. \nOther proposed policies include: Enshrining the principle of animal sentience in law, to ensure it prevents practices that expose animals to cruel and degrading treatment.Conservative MPs were widely criticised on social media last year when they voted against a proposal to add a statement that animals are sentient to Brexit legislation. Strengthening the Hunting Act to close loopholes that allow illegal hunting Consulting landlords on giving tenants the default right to keep pets unless there is evidence the animal is causing a nuisance Establishing an independent zoo inspectorate to draw up revised standards of animal welfare A total ban on imports of Foie Gras, which is produced by force-feeding geese or ducks Ending the badger cull. This involves killing badgers in an attempt to reduce the spread of TB to cattle, but there is disagreement about how effective it is Requiring motorists to report accidents where an animal has been injured Banning live exports of animals for slaughter or fattening and introducing mandatory CCTV in all slaughterhouses Designing post-Brexit farm subsidies to move away from intensive factory farming and bad environmental practices Prohibiting the third party sale of puppies and tackling puppy smuggling by reintroducing rabies testing before entry into the UK Working with organisations like the People’s Dispensary for Sick Animals to help pet-owners on low income get veterinary treatment A comprehensive review of animal testing with a view to improving practice, limiting animal suffering and increasing transparency Introducing a ‘blue belt’ to protect and enhance the marine environment around the UK and our overseas territories \nIan Lavery, Labour MP for Wansbeck and Labour Party Chair, said: “There is an awful lot there \n“For many years, political parties left the issue of animal welfare behind. But it’s a top priority for the public. Read More Theresa May and her ministers plan six speeches to answer questions about Brexit \n“It’s good to see that the Labour Party understands how critical the issue of animal welfare is in today’s society. \n“This plan proves once again that the Labour Party are on the front foot. We are listening to what people say and are planning to do something radical to improve animal welfare.” Ian Lavery (Image: Daily Mirror) \nSue Hayman MP, Labour’s Shadow Environment Secretary, said: “Our vision is one where no animal is made to suffer unnecessary pain and we continue to drive up standards and practice in line with the most recent advances and understanding.” \nConservatives aid Labour were “playing catch-up” because the Government was already improving animal welfare, including by introducing tougher sentences for people who abuse animals, introducing mandatory CCTV into slaughterhouses, proposing a ban on ivory sales and banning microbeads to protect marine life. \nConservative MP Steve Double MP said: “Labour are belatedly playing catch-up with the huge progress made by this Government on animal welfare. Read More Labour attacks Northumbrian Water's £108m payment to shareholders \n“However, Labour wouldn’t even be able to deliver some of these promises because they want to keep following EU rules after Brexit. \n“From introducing mandatory CCTV into slaughter houses to increasing the maximum sentence for animal cruelty ten-fold, the Conservatives will continue taking the action needed to ensure animals receive the proper protection they deserve.” Like us on Facebook", "external_links": [], "published": "2018-02-14T10:00:00.000+02:00", "crawled": "2018-02-14T12:08:32.043+02:00", "highlightTitle": ""}