{"organizations": [], "uuid": "32cebf13ad37a7a37a3b5d7dd89088a751689c4b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14250660.ece/ALTERNATES/s1200/East-Coast-rail-franchise.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/east-coast-main-line-rail-14341203", "country": "GB", "domain_rank": 21960, "title": "East Coast Main Line rail boss explains why the franchise collapsed - causing surprise among MPs", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-27T15:00:00.000+02:00", "replies_count": 0, "uuid": "32cebf13ad37a7a37a3b5d7dd89088a751689c4b"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/east-coast-main-line-rail-14341203", "ord_in_thread": 0, "title": "East Coast Main Line rail boss explains why the franchise collapsed - causing surprise among MPs", "locations": [], "entities": {"persons": [{"name": "griffiths", "sentiment": "none"}, {"name": "martin griffiths", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "manchester arena", "sentiment": "none"}], "organizations": [{"name": "stagecoach group", "sentiment": "none"}, {"name": "invalid email  bosses", "sentiment": "none"}, {"name": "vtec", "sentiment": "none"}, {"name": "stagecoach", "sentiment": "none"}, {"name": "virgin trains east coast", "sentiment": "none"}, {"name": "european referendum", "sentiment": "none"}, {"name": "house of commons public accounts committee", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily   Thank you for subscribing!   \nBosses responsible for the East Coast Main Line rail service have blamed “political uncertainty” for the collapse of the franchise. \nThe Scottish vote on independence, the European Referendum, the two recent general elections and even the Manchester Arena bombing were all blamed by Martin Griffiths, chief executive of Stagecoach Group. \nStagecoach owns 90% of Virgin Trains East Coast (VTEC), which was due to run services until 2023 but is now set to quit the franchise early. \nMr Griffiths said: “In the last three years rail revenue growth across the UK has collapsed. That is to do with the economy, that is to do with political uncertainty.” \nHis comments were met by incredulity from MPs on the House of Commons Public Accounts Committee, which is investigating what went wrong. Martin Griffiths (Image: Mirror/Stagecoach) \nMr Griffiths said that VTEC was actually performing better than most other franchises in terms of attracting passengers. \nBut he said the entire rail network was suffering from low passenger growth. \nHe said: “When we bid for this franchise, nobody foresaw two referendums, one in Scotland. \n“We didn’t foresee the Brexit referendum, with two general elections. \n“All of these things create ... we are in a very different place. That’s my point.” \nHe also told the inquiry: “We’ve had some very terrible high profile incidents in places like Manchester, which you will clearly all be aware of, and a fundamental change in people’s perception about travel.” \nStoke Central MP Gareth Snell told him: “I think that is a baffling excuse frankly, that two referendums stopped people getting on a train.” Read More Jeremy Corbyn says Labour wants a Brexit to support the car industry \nThe company is 10% owned by Richard Branson’s Virgin Group was awarded the franchise in 2014 and began running services linking Edinburgh, Newcastle and London in 2015. \nIt now says it cannot afford to pay the Government the sums it promised, because passenger numbers have not risen as much as expected. \nThe Commons Committee had summoned Mr Griffiths to explain what went wrong. \nAlso giving evidence was David Horne, VTEC’s Managing Director. He said passenger revenue for long distance rail services across the UK had been growing by 7.5% a year when the business presented its bid for the franchise, but this had fallen significantly and growth since April 2017 was just 1.2%. Read More \nHe said: “Across the sector passenger revenue numbers are still growing but are growing at a much lower rate than they were at the time of bidding. \n“We have also seen an impact in terms of the price that people are prepared to pay. \n“I think it’s fair to say that people are under more financial pressure than was expected. \n“And we’re certainly seeing that the market is shifting more in terms of lower cost fairs.” \nThe Public Accounts Committee is looking into rail franchising in the UK and will set out its conclusions in a report later this year. Like us on Facebook", "external_links": [], "published": "2018-02-27T15:00:00.000+02:00", "crawled": "2018-02-27T16:08:34.004+02:00", "highlightTitle": ""}