{"organizations": [], "uuid": "4a8f6d16ca954dfa2f8db03291715ee6bfa938f3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article8582404.ece/ALTERNATES/s1200/JS56006566.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/leaderless-losing-lib-dems-upset-14238646", "country": "GB", "domain_rank": 21960, "title": "Leaderless and losing - Lib Dem's upset Labour in late Sunderland leader's seat", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-02T18:00:00.000+02:00", "replies_count": 0, "uuid": "4a8f6d16ca954dfa2f8db03291715ee6bfa938f3"}, "author": "Sean Seddon", "url": "https://www.chroniclelive.co.uk/news/north-east-news/leaderless-losing-lib-dems-upset-14238646", "ord_in_thread": 0, "title": "Leaderless and losing - Lib Dem's upset Labour in late Sunderland leader's seat", "locations": [], "entities": {"persons": [{"name": "rui", "sentiment": "negative"}, {"name": "niall hodson", "sentiment": "none"}, {"name": "martin haswell", "sentiment": "none"}, {"name": "john hardy", "sentiment": "none"}, {"name": "paul watson", "sentiment": "none"}], "locations": [{"name": "sunderland", "sentiment": "none"}, {"name": "pallion", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "negative"}, {"name": "sunderland city council", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Ballot Box (Image: Rui Vieira/PA Wire) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe Liberal Democrats have stunned Sunderland’s Labour establishment with a by-election upset triggered by the death of the council leader. \nVoters in Pallion went to the polls on Feburary 1 after Paul Watson, who held the ward for Labour since 1997, lost his battle with cancer last November aged 63. \nLib Dem candidate Martin Haswell won 1,251 votes, a decisive victory over Labour’s John Hardy on 807 and the Conservatives in a distant third with 126. \nIt’s the party’s second by-election win in a row after claiming the Sandhill ward in January 2017 and their third breakthrough since they secured their first ward in the city in 2016. \nLabour are without a permanent leader and are not expected to choose a new one until after local elections in May. Lib Dem councillor Niall Hodson \nBuoyed by last night’s win and challenging incumbents without a figurehead, the Lib Dems are eyeing big gains in that poll. \nNiall Hodson, the leader of the group of three now sitting on Sunderland City Council, said “local dissatisfaction with the Labour council is deeply ingrained and widespread”. \nThe 32-year-old councillor for Millfield added: “We’re expecting big things in the local elections in May. Read More Liberal Democrat leader Vince Cable on Brexit, devolution and the party's chances in the North East \n“People are aggrieved with the Labour party at a local level and feel like they have been taken for granted. \n“This election had nothing to do with Brexit - it was about a sense the council are not doing well enough on things like housing, social services and the cleanliness of the city.” Sunderland Civic Centre in Sunderland City Centre (Image: Newcastle Chronicle) \nHe added that uncertainty surrounding the regeneration of the Vaux site after the collapse of Carillion has also “created a sense Labour aren’t on top of running the city”. \nDeputy leader of Sunderland City Council, Coun Henry Trueman, admitted the result was “disappointing”. \nHe said: “We had a great candidate who put in an awful lot of effort before the by-election. \n“We will continue to serve the people of the city and the Pallion ward. This will not this will not deter us from serving the people of the city. \n“Obviously it is a concern but we have not had much time to digest it but we will make sure we will address the issue.” Read More ", "external_links": [], "published": "2018-02-02T18:00:00.000+02:00", "crawled": "2018-02-02T18:59:25.024+02:00", "highlightTitle": ""}