{"organizations": [], "uuid": "f20a00ccb99f058329aeb3708ae0c2c75f30b0fd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article705218.ece/ALTERNATES/s1200/GettyImages-528946990.jpg", "site_section": "", "section_title": "", "url": "https://www.leicestermercury.co.uk/sport/leicester-city-sacking-claudio-ranieri-1251817", "country": "GB", "domain_rank": 48128, "title": "Why the Leicester City sacking of Claudio Ranieri was played out like a Shakespearean tragedy - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.559, "site_type": "news", "published": "2018-02-23T07:00:00.000+02:00", "replies_count": 0, "uuid": "f20a00ccb99f058329aeb3708ae0c2c75f30b0fd"}, "author": "Rob Tanner", "url": "https://www.leicestermercury.co.uk/sport/leicester-city-sacking-claudio-ranieri-1251817", "ord_in_thread": 0, "title": "Why the Leicester City sacking of Claudio Ranieri was played out like a Shakespearean tragedy - Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "claudio ranieri", "sentiment": "negative"}, {"name": "jose mourinho", "sentiment": "none"}, {"name": "ranieri", "sentiment": "none"}, {"name": "jamie vardy", "sentiment": "none"}, {"name": "chelsea", "sentiment": "none"}, {"name": "rob tanner", "sentiment": "none"}], "locations": [{"name": "leicester city", "sentiment": "none"}, {"name": "hollywood", "sentiment": "none"}, {"name": "belvoir drive", "sentiment": "none"}, {"name": "england", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Why the Leicester City sacking of Claudio Ranieri was played out like a Shakespearean tragedy Here's what Rob Tanner wrote about the shock dismissal hours after finding out Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \n\"Emotional? No it was normal,\" Claudio Ranieri told reporters as he left Belvoir Drive for the last time. \nBut there is nothing about the saga of his sacking by Leicester City that is normal and absolutely everything about it has been emotional. \nJose Mourinho has admitted himself that his departure from Chelsea last season having also taken them to a Premier League title before losing his job amidst claims of player unrest behind the scenes was nothing compared to Ranieri's exit. \nTalk about a movie about Jamie Vardy's life , if you believe all the rumours and speculation about the events leading up to and since Ranieri's sacking it could make a Hollywood blockbuster itself. \nSynopsis: The Champions of England, loved by the world, suffer a dramatic fall from grace. There is growing disharmony amongst his team as relegation looms amidst accusations of plots and betrayal, and Ranieri is eventually sacked, two weeks after the owners pledge their allegiance, in an airport hotel, while his players discover the news on social media. \nThe beloved Ranieri's departure sends shockwaves around the world and there is wailing in the streets of Leicester , as if the deposed leader had died, while the finger of recrimination is turned on his alleged betrayers, who plead their innocence publicly as the world turns on City for its' cruel act. \nAnd there is still a final act to play out. Who is the successor? Could it be a return of Nigel Pearson on his trusty stead to once again come to the club's rescue, as he did following relegation to League One and after the mayhem that was the end of the Sven-Goran Eriksson era? \nNow that would be a dramatic final act in keeping with the drama already played out. Read More A Shakespearean tragedy \nLet's face it, there have been more plot twists than a Shakespearian play! \nKing Claudio's fall from grace has more than a passing resemblance to King Lear, the monarch blinded by his own over-confidence of the decline around him, who is then stabbed in the back by his two favourite daughters and then finds reason in his subsequent madness. \nKing Lear revisited 2017: King Claudio, the man who led City to their greatest triumph becomes blinded by the awards and his own success to the extent that he becomes deaf to his wise advisors and his new decision making leads those to question his sanity, creating unrest amongst his troops and ultimately his downfall. \nHowever, like all rumours and speculation, elements of events may have been exaggerated. \nNot only have the players been said to have spoken en masse with the owners once, but four times by one report, in which they expressed their dissatisfaction in Ranieri. \nThe Mercury understands that a big meeting between players and owners hadn't taken place, but it is believed that several senior players were asked for their thoughts on what has been going wrong and their observations would have included the confusion caused by some of Ranieri's tactical changes. Claudio Ranieri lifts the Premier League Trophy as Leicester City boss. (Photo by Shaun Botterill/Getty Images) \nThey may have let Ranieri down with performances on the pitch (even the players would have to admit that) but suggestions that there has been a masse revolt behind the scenes that has influenced chairman Vichai Srivaddhanaprabha, an extremely powerful global businessman, may be exaggerating the extent of player power. \nThere is no question that emotions are running high, even more so after Ranieri's wonderful and powerfully emotional statement. If the City fans were upset before, they were positively weeping after that piece of writing. \nFootball fans who were so enchanted with City's rise last season are now so enraged they want the full decline, as punishment, while the blame game is being played with those players bearing the brunt. \nEvery writer or pundit has had their say too, and the groundswell of opinion is Ranieri was betrayed. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nCity fans are planning demonstrations of support for Ranieri on Monday night before and during the Liverpool game, while Reds boss Jurgen Klopp has also waded in, likening the decision to Brexit and the election of Donald Trump, two equally divisive events. \nBut now the emotion has to be put to one side. It is time for cool, calm heads. \nCity have fallen into the relegation zone after Saturday's results. An already serious situation is reaching crisis-point. \nCity have been in a worse position two years ago, but they rallied together and came through. \nEveryone must do so again if this tale is to have a happy ending, or it will descend into a tragedy. Like us on Facebook ", "external_links": [], "published": "2018-02-23T07:00:00.000+02:00", "crawled": "2018-02-23T07:56:25.002+02:00", "highlightTitle": ""}