{"organizations": [], "uuid": "b5bd8f985a51f1773bbafa8fa9eb5d22b381f695", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14262097.ece/ALTERNATES/s1200/VRR_JNL_301116_rossmith_01JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/dont-take-idiots-north-east-14262013", "country": "GB", "domain_rank": 21960, "title": "'Don't take us for idiots': North East business leader reacts to Brexit impact figures", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-08T12:44:00.000+02:00", "replies_count": 0, "uuid": "b5bd8f985a51f1773bbafa8fa9eb5d22b381f695"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/dont-take-idiots-north-east-14262013", "ord_in_thread": 0, "title": "'Don't take us for idiots': North East business leader reacts to Brexit impact figures", "locations": [], "entities": {"persons": [{"name": "ross smith", "sentiment": "none"}, {"name": "smith", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "north east england", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}], "organizations": [{"name": "north east england chamber of commerce", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nA leading member of the North East England Chamber of Commerce has told the Government to stop treating people in the region like ‘idiots’, after a leaked Government forecasts showed the region will suffer after Brexit . \nRoss Smith, director of policy at the Chamber, has criticised Ministers for failing to address how the North East’s export heavy economy will survive following the UK’s exit from the EU. \nMr Smith said: “The forecasts that have emerged from Government today indicating that North East England would potentially be the region hardest hit by Brexit should come as no great surprise. \n“After all, our businesses are the most successful in the country when it comes to trading with Europe. If doing that trade is going to be made more difficult, it stands to reason that we have the most to lose. Read More Brexit fallout LIVE: Updates on leaked report which claims North East would be hardest hit \n“What is a surprise is that 20 months after the vote, the Government has still failed to adequately address this point. That’s particularly staggering when you consider that the Conservatives were elected last year on the basis of a manifesto that says closing the gap between London and other parts of the UK is ‘the biggest prize in Britain today’, a ‘great endeavour’, and that they were ‘determined to lead the way in the next Parliament’. \n“If figures being shared around Whitehall suggest that their stated top priority could be seriously undermined, I would expect to see some concerted action to tackle it. Instead, all we’ve seen is arguments and obfuscation. \n“So what should happen now? Firstly, we need some frankness from the Government . \n“Presumably they believe it will work out better than this, otherwise they wouldn’t be going through with Brexit. Also, given the manifesto commitments set out above, they must believe that it will work out at least as well for the North East as for London. \n“They should explain what these beliefs are based on, and that should be something rather more substantial than vague talk of a bespoke trade agreement. Don’t keep taking us for idiots, and don’t leave the only counter argument to come from long-term anti-EU ideologues like John Redwood claiming the figures are wrong without any evidence.” \nThe Government was forced to release the its regional impact reports after they were leaked to the media. Read More Business leaders say 'patience is wearing thin' over Government Brexit dithering \nThe forecast predicts that the North East will be the worst hit by the withdrawal from the EU with a ‘no deal’ scenario leading to growth in the region falling by 16%. Under a free trade arrangement growth would still fall by 11%, while remaining within the single market would lower the growth reduction to 3%. \nMr Smith also called on the Government to reconsider leaving the Customs Union. While he admitted that there would be opportunity to negotiate with other countries, he said questioned whether the opportunity outweighed the risk of disrupting trade with the UK’s nearest markets. Read More Space incubator to help five North East firms reach for the stars \n“If there is sufficient evidence to show there will be benefits from leaving the Customs Union, then the transition period should be extended,” Mr Smith said. “The time to put in place the capacity to deliver such trade deals, and the time for businesses to adjust to new terms of trade and respond to a signal that they should prioritise different markets, is perilously short.” Like us on Facebook ", "external_links": [], "published": "2018-02-08T12:44:00.000+02:00", "crawled": "2018-02-08T14:18:30.007+02:00", "highlightTitle": ""}