{"organizations": [], "uuid": "25800695ee40c5497cda62d2a16be9494fb128db", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14261077.ece/ALTERNATES/s1200/Brexit.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/north-east-areas-could-pay-14260952", "country": "GB", "domain_rank": 21960, "title": "The North East areas which could pay the highest price for Brexit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-08T07:00:00.000+02:00", "replies_count": 0, "uuid": "25800695ee40c5497cda62d2a16be9494fb128db"}, "author": "Mike Kelly", "url": "https://www.chroniclelive.co.uk/news/north-east-news/north-east-areas-could-pay-14260952", "ord_in_thread": 0, "title": "The North East areas which could pay the highest price for Brexit", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}], "organizations": [{"name": "university of sussex", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}, {"name": "uk trade policy observatory", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The North East areas which could pay the highest price for Brexit Experts studied recently-leaked Treasury papers to reach their grim conclusion about the post-Brexit economy Share Areas like Sunderland and County Durham which backed Brexit could pay the highest price for the UK leaving Europe (Image: PA) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nAreas like Sunderland and County Durham which backed Brexit could pay the highest price for the UK leaving Europe, according to yet another report. \nA team of trade experts at the University of Sussex studied recently-leaked estimates from the Treasury to analyse the relative impact of the different scenarios now being considered on 122 manufacturing sectors. \nThey believe versions of Brexit under consideration by the cabinet could cut British manufacturing exports by up to a third. \nThe paper, by the UK Trade Policy Observatory, finds that even if the Government is able to strike free trade agreements (FTAs) with every other major country, it would still lead to falls in exports of 34% and 30% for the food and textiles industries respectively if they face new barriers with their main markets in Europe. Britain’s car industry, which includes Nissan, could be particularly hard hit after Brexit (Image: PA) \nWhile food processing would enjoy domestic sales increases that would offset the blow, the overall impact of relying solely on trade deals outside Europe would be to cut all manufacturing exports by 13% and reduce total output by 3.6% as sectors such as carmaking struggle to gain access to markets, according to the research. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nBritain’s car industry, which includes Nissan, could be particularly hard hit after Brexit because trade barriers in the sector tend to be high across the world. \nThe Sussex university academics estimate price rises for UK-made cars of 14%, and falling vehicle exports, in a no deal Brexit scenario. \nAccording to the team who wrote the report: “Areas of the country where there are many jobs in food processing may see gains in output, but most manufacturing jobs are in sectors which are at risk from Brexit, and a list of the areas most at risk – Sunderland, Birmingham, Coventry, Derby, Cheshire East, Solihull and County Durham – show the importance of the motor industry in assessing the risks of Brexit.” Read More", "external_links": [], "published": "2018-02-08T07:00:00.000+02:00", "crawled": "2018-02-08T07:48:57.006+02:00", "highlightTitle": ""}