{"organizations": [], "uuid": "2c4cd2875b09d766d279c182ec38a9eb8f7bbc60", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/whats-on/whats-on-news/article1275394.ece/ALTERNATES/s1200/BC_0031-1.jpg", "site_section": "", "section_title": "", "url": "https://www.devonlive.com/whats-on/whats-on-news/bridget-christie-brings-brand-new-1275431", "country": "US", "title": "Bridget Christie brings brand new comedy show What Now? to Devon - Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "", "spam_score": 0.031, "site_type": "news", "published": "2018-02-28T14:07:00.000+02:00", "replies_count": 0, "uuid": "2c4cd2875b09d766d279c182ec38a9eb8f7bbc60"}, "author": "Lewis Clarke", "url": "https://www.devonlive.com/whats-on/whats-on-news/bridget-christie-brings-brand-new-1275431", "ord_in_thread": 0, "title": "Bridget Christie brings brand new comedy show What Now? to Devon - Devon Live", "locations": [], "entities": {"persons": [{"name": "devon bridget", "sentiment": "none"}, {"name": "bridget christie", "sentiment": "none"}, {"name": "bridget", "sentiment": "none"}], "locations": [{"name": "devon - devon live what", "sentiment": "none"}, {"name": "tiverton comedy hall", "sentiment": "none"}, {"name": "tiverton", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "leicester square theatre", "sentiment": "none"}, {"name": "tiverton community arts theatre", "sentiment": "none"}], "organizations": [{"name": "netflix", "sentiment": "none"}, {"name": "tiverton share get daily", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Bridget Christie is coming to Tiverton Share Get   \nMulti-award winning and highly acclaimed comedian Bridget Christie is heading to Tiverton with her brand new show What Now ? \nBridget’s last show, the critically acclaimed Brexit show Because You Demanded It, sold out its 21-night Leicester Square Theatre run and subsequent UK tour. It won Best Show at the comedy industry Chortle Awards 2017, and was The Guardian’s No.1 Comedy of 2016. Read More Tiverton comedy club ditched by another comedian in favour of TV appearance \nAs well as theatres up and down the UK, Bridget will also be doing a run at London’s Leicester Square Theatre, starting on 9th September 2018. \nIn March 2017 Bridget’s debut stand-up special ‘Stand Up for Her’ was launched globally on Netflix, making her the first British female comic to have a live stand-up show on the channel. It has also been bought by BBC Brit (Nordic territories) and will be broadcast in Sweden, Denmark, Norway, Finland, the Faroes, and Iceland in early 2018. Video Loading   \nHer new BBC Radio 4 series, Bridget Christie’s ‘Utopia’, will be broadcast on Wednesdays at 1830, from 7 February 2018. The Radio Times said ‘Laugh out loud….This is the funniest thing I’ve heard on radio for years’. \nIn 2013 Bridget won the Foster’s Edinburgh Comedy Award for Best Show with her show A Bic For Her. This show also won the 2014 South Bank Sky Arts Award for Best Comedy, the 2014 Chortle Award for Best Show and a 2014 Hospital 100 Club Award for Performance and Theatre. It was a total sell out in Edinburgh and became the highest selling comedy show at Soho Theatre ever, selling out every night of its 54-night run. Her follow-on show, An Ungrateful Woman, also sold out its entire 52-night run. \nBridget’s debut BBC Radio 4 series, Bridget Christie Minds the Gap, was broadcast in April 2013. It won Best Radio at the 2014 Chortle Awards and a prestigious 2014 Rose D’Or International Broadcasting Award for Best Radio Comedy. It was also nominated for a Radio Academy Award 2014. A second series was broadcast in January 2015 and won a 2015 Chortle Award for Best Radio Programme, for the second year running. Bridget’s upcoming brand new radio series will transmit later this year. Read More Plans to demolish and relocate Tiverton High School with purpose built theatre are unveiled \nHer 2014 tour, a double bill of A Bic For her and An Ungrateful Woman, won the 2015 Chortle Award for Best Tour. \nBridget was also nominated for a 2014 British Comedy Award for Best Female TV comic, for her performance on Have I Got News For You. \nHer debut book, A Book for Her, was published by Century Random House in hardback in July 2015 to universal critical acclaim, and was reviewed by every UK national newspaper. The book has also just been published in Spain. It was one of the Top 100 Books for Christmas in The Telegraph, the Top Ten Comedy Books in The List, and Book of the Day in The Observer newspaper. It was also nominated for a 2016 Chortle Award for Best Book. \nBetween October 2015 and March 2016 Bridget had her own hugely popular weekly column in Guardian Weekend magazine, for which she gained a Glamour Magazine 2016 award nomination for Columnist of the Year. \nBridget's last four Edinburgh festival fringe shows have been in the Top 5 best reviewed shows of the fringe, and her last show (Because You Demanded It) was named the top rated comedy show of the fringe by The List magazine. \nBridget will be playing at the Tiverton Comedy Hall at Tiverton Community Arts Theatre on Saturday, June 9. For more details and ticket booking call 07443 502523 or visit www.comedyhall.co.uk Like us on Facebook", "external_links": [], "published": "2018-02-28T14:07:00.000+02:00", "crawled": "2018-02-28T14:21:18.011+02:00", "highlightTitle": ""}