{"organizations": [], "uuid": "7af4e5c706fcd401a5c849b0f3d7d03447d6bb97", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14022391.ece/ALTERNATES/s1200/John-McDonnell-interview.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/labour-attacks-northumbrian-waters-108m-14280244", "country": "GB", "domain_rank": 21960, "title": "Labour attacks Northumbrian Water's £108m payment to shareholders", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-12T18:27:00.000+02:00", "replies_count": 0, "uuid": "7af4e5c706fcd401a5c849b0f3d7d03447d6bb97"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/labour-attacks-northumbrian-waters-108m-14280244", "ord_in_thread": 0, "title": "Labour attacks Northumbrian Water's £108m payment to shareholders", "locations": [], "entities": {"persons": [{"name": "john mcdonnell", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}], "organizations": [{"name": "news labour", "sentiment": "negative"}, {"name": "northumbrian water", "sentiment": "negative"}, {"name": "labour", "sentiment": "negative"}, {"name": "invalid email  northumbrian", "sentiment": "none"}, {"name": "labour and conservatives", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Labour attacks Northumbrian Water's £108m payment to shareholders The focus on dividends paid by the North East water firm comes as Labour and Conservatives disagree over nationalisation Share Shadow chancellor John McDonnell (Image: PA) Share   \nNorthumbrian Water has come under fire from the Labour Party for paying out £108 million to shareholders last year. \nIt was one of six water companies attacked for paying out more in dividends than it made in profits. \nShadow Chancellor John McDonnell said: “These figures reveal that our water system is broken. It is a national scandal that since 2010 these companies have paid out billions to their shareholders, almost all their profits, whilst receiving more in tax credits than they paid in tax.” \nLabour is highlighting its plans to re-nationalise key industries including water and energy firms. It says bringing them into public ownership would mean profits were used to improve services or keep bills down, or went to the Treasury, rather than going to shareholders. \nConservatives say Labour’s plans would mean taxpayers ended up “footing the bill” and receiving sub-standard services. \nEnergy and water were once provided by state-owned businesses, but these were privatised under the Conservative Government led by Margaret Thatcher in the 1980s. Rail privatisation began under Tory Prime Minister John Major in the early 1990s. Northumbrian Water \nLabour research shows that water companies issued over £1.6 billion in dividend payments in 2017, an increase of 24% on the previous year. \nAnd six water companies that paid out more in dividends in 2017 than their pre-tax profits, including Thames Water, Anglian Water, Yorkshire Water, Northumbrian Water, Southern Water and South West Water. \nMr McDonnell said: “These companies operate regional monopolies which have profited at the expense of consumers who have no choice in who supplies their water. Yet at the same time they hike up prices and load up on debt while shelling out billions in dividend payments to shareholders.” \nHe added: “Labour will replace this dysfunctional system with a network of regional, publicly-owned water companies.” \nThe water industry argues that the present system of ownership has provided investment to improve services. \nMichael Roberts, Chief Executive of industry body Water UK, said: “It’s wrong for Labour to suggest that our water system is broken. Water companies secure capital provided by lenders and shareholders, who need water companies to make a return in order to finance significant improvements to the industry. \n“Under public ownership, the water sector in England was starved of cash and standards were poor. Private companies have instead invested heavily to reduce leakage, improve drinking water quality, and protect the environment – and they continue to invest £8 billion each year in even better services. In real terms, bills are roughly where they were 20 years ago and will be falling over the next few years.” \nSpeaking over the weekend Mr McDonnell said Labour’s re-nationalise plan meant creating local and regional suppliers serving local communities, rather than re-creating the national state-owned utilities that existed before privatisation. \nLabour argues the plan will not cost taxpayers anything, because the government would gain assets which generated income. \nHowever, Mr McDonnell also said a Labour government would issue bonds to pay for the purchase of utilities - a form of borrowing - with Parliament setting the price to be paid. The profits made by the utilities would cover the interest payable, he said. \nConservative Treasury Minister Robert Jenrick said: “Labour’s plans would put politicians in charge of running everything from water to electricity, meaning people have nowhere to turn when things go wrong. We know from last time that the country would end up footing the bill for Labour’s mistakes – and they’d hike your taxes to pay for them.” Read More 'Stop taking us for idiots': Theresa May facing Brexit backlash from North East employers \nLabour is also planning to bring train franchises back into public control. This will cost nothing, as it simply involves waiting for existing train operating franchises to come to an end, and then transferring operations to a state-owned operator rather than inviting bids from private operators. \nConservatives argue however that a state-owned business would not be able to invest in the railways in the same way as the private sector. Labour argues that profits would be available for investment, and says failure of the Stagecoach/Virgin franchise on the East Coast Main Line shows that the current system of private operators isn’t working. Like us on Facebook", "external_links": [], "published": "2018-02-12T18:27:00.000+02:00", "crawled": "2018-02-12T18:44:08.061+02:00", "highlightTitle": ""}