{"organizations": [], "uuid": "db5b441113defe256d403d2489d14e8b20dd5f22", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1262851.ece/ALTERNATES/s1200/pexels-photo-355097.jpg", "site_section": "http://www.middevongazette.co.uk/politics.rss", "section_title": "devonlive - News", "url": "https://www.devonlive.com/news/devon-news/politics-britain-today-cracked-tea-1262854", "country": "GB", "title": "Politics in Britain today is a cracked tea-cup", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-26T09:35:00.000+02:00", "replies_count": 0, "uuid": "db5b441113defe256d403d2489d14e8b20dd5f22"}, "author": "Keith Rossiter", "url": "https://www.devonlive.com/news/devon-news/politics-britain-today-cracked-tea-1262854", "ord_in_thread": 0, "title": "Politics in Britain today is a cracked tea-cup", "locations": [], "entities": {"persons": [{"name": "hillary clinton", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "ben bradshaw", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "philip wolfgang", "sentiment": "none"}, {"name": "ben", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}], "organizations": [{"name": "torquay", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Torquay's image \nWe saw the same thing happen in the United States presidential election, when boring Hillary Clinton met interesting (if scary) Donald Trump. \nReason rarely prevails. We go with our gut instincts – and if we have no gut instincts we follow the person who seems to know where they’re going. Since early in 2016, it has been clear that voices in the moderate centre of British politics hadn’t a clue where they were going. \nWhat they need is a new teacup. A bright, shiny one with an interesting pattern. \nThere is an army of middle-of-the-road voters desperate to support middle-of-the-road politicians who aren’t that happy with hard Brexit or a decade of austerity; anti-Semitism or re-nationalisation. \nWe have no need to go searching for these leaders because they already exist, in the squirming centre of both our main parties. \nExeter’s Labour MP Ben Bradshaw announced last September, somewhat belatedly, that he now supports Corbyn to win the next general election. Read More Philip Wolfgang: Succession planning must involve the whole farming family \nOnly Ben knows if this is a genuine conversion on the Road to Damascus or a pragmatic piece of diplomacy. But Ben is a typical of a great many politicians. They may be wedded to their parties, but they are not sworn enemies of the opposition and they are genuinely interested in getting the best for their constituents. \nIt would surely be easier for Ben to work with South West Devon MP Gary Streeter – another thoroughly decent man – than it is for Gary Streeter to work with the ultra-Right Tory Jacob Rees-Mogg. \nIn the absence of a handy transfer window, it’s going to take courage for any politician to cross the divide. Perhaps memories of Plymouth MP David Owen’s “Gang of Four” defection that created the short-lived SDP are too recent. \nBut that was then, and this is now. In 1981 the Tories were rampant under Thatcher and the breakaway was a purely Labour one. \nWe need a new teacup. Read More Drop the bass - Devon restaurants urged to pull fish from menu \nIn a new book, “The Enigma of Reason” (Harvard), the cognitive scientists Hugo Mercier and Dan Sperber take a stab at answering this question. Mercier, who works at a French research institute in Lyon, and Sperber, now based at the Central European University, in Budapest, point out that reason is an evolved trait, like bipedalism or three-color vision. It emerged on the savannas of Africa, and has to be understood in that context. \nJohn McDonnell told a Resolution Foundation event this morning: \n“Our position is, yes, we want to see on the table ‘a’ customs union negotiation, not ‘the’ customs union. We think there could be a reform. ‘A’ customs union is a way forward, particularly in solving some of the issues around Northern Ireland. \n“What we’re concerned about is that the government have ruled even that option off the table, I think they’re going to have to come back and readdress it.” \nThe reason they are opting for ‘a’ customs union is that membership of ‘THE’ Customs Union, for non-EU countries, limits those countries’ ability to influence new trade talks. McDonnell uses the example of Turkey, who follow EU tariffs policy but have no say over them or any new deals. \nIt turns out there are several – perhaps many – wet Conservatives who agree with the Labour line. And they are proposing an amendment to the Brexit Trade Bill. Read More Urgent warning as thousands of inhalers recalled due to faults \nAnna Soubry and Ken Clark have proposed a motion which, If passed, would require the government to “take all necessary steps to implement an international trade agreement which enables the UK to participate after exit day in a customs union with the EU.” \nWhile the amendment may not be heard for a couple of months, that gives more time for Parliament’s sensible voices to organise. \nAnd the most significant thing of all: with this wording, both Labour and sensible Tories could get behind it. \nWe are witnessing some kind of soft Brexit alignment in Parliament. A slow-motion backlash against the rabid slash-and-burn Brexit policy we have seen coming from Rees-Mogg band of Brextremists. \nRemain campaign group Open Britain detect a sea-change. \nAlison McGovern MP, leading supporter of Open Britain, said: \n“There is clearly no majority in Parliament for crashing out of the Customs Union. Yet the Prime Minister remains determined to do so. Read More History made as NFU welcomes Minette Batters as its first female president \n“The reality is that staying in the Customs Union is vital if we are to avoid a hard border in Ireland and to maintain truly frictionless trade. But on its own it is not enough – we must also stay in the Single Market. \n“Ultimately, if the Government delivers a deal that does not protect our trade with Europe and the frictionless border in Ireland, everyone has the right to keep an open mind about whether that kind of Brexit serves the national interest.” \nJust a few days ago, we published a call for the ‘mutineers’ to stand up: \n“Most current Conservative MPs backed Remain during the EU referendum. According to the FT’s analysis, 176 of the 317 Conservative MPs backed Remain. Surely they do not want to see a slash-and-burn Brexit that tears up our economy? \n“So – now the challenge. Will the so-called soft-Brexit ‘mutineers’ (as the Telegraph dubbed them) finally stand up to the shady ERG bunch? Rees-Mogg is not the Conservative party… \n“There are sensible voices out there – some of whom have already spoken out: figures like Nicky Morgan, Justine Greening, Heidi Allen and Dr Sarah Woollaston. \n“The Tory hard-right are organised. Perhaps it’s time for some voices of reason to get organised, too?” Like us on Facebook", "external_links": [], "published": "2018-02-26T09:35:00.000+02:00", "crawled": "2018-02-26T10:00:54.012+02:00", "highlightTitle": ""}