{"organizations": [], "uuid": "dffefa9e7de88a698c6ba8bb45b8f5aac2c81651", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1246333.ece/ALTERNATES/s1200/30001544.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "devonlive - frontpage", "url": "https://www.devonlive.com/news/devon-news/history-made-nfu-welcomes-minette-1246423", "country": "GB", "title": "History made as NFU welcomes Minette Batters as its first female president", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-21T19:42:00.000+02:00", "replies_count": 0, "uuid": "dffefa9e7de88a698c6ba8bb45b8f5aac2c81651"}, "author": "Athwenna Irons", "url": "https://www.devonlive.com/news/devon-news/history-made-nfu-welcomes-minette-1246423", "ord_in_thread": 0, "title": "History made as NFU welcomes Minette Batters as its first female president", "locations": [], "entities": {"persons": [{"name": "minette batters", "sentiment": "none"}, {"name": "guy smith", "sentiment": "none"}, {"name": "meurig raymond", "sentiment": "none"}], "locations": [{"name": "wiltshire", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}], "organizations": [{"name": "national farmers union", "sentiment": "none"}, {"name": "nfu", "sentiment": "none"}, {"name": "nfu conference", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "History made as NFU welcomes Minette Batters as its first female president National Farmers Union head hails from South West and will help steer Britain through Brexit Share Minette Batters saw off her sole challenger Guy Smith Share Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nHistory was made at the NFU Conference today as the organisation welcomed its first female president – and the first from the South West. \nWiltshire livestock farmer Minette Batters saw off her sole challenger Guy Smith to take the top role at the event in Birmingham. She became the first woman to lead the union in its 110-year history. \nA confident performer and respected figure within South West farming communities, Ms Batters succeeds outgoing president Meurig Raymond, who announced last year that he would not be seeking re-election having served four years in the top role. Minette Batters, the first female president of the NFU \nSpeaking to the Western Morning News after the leadership elections, held bi-annually to decide the next team of officeholders to lead the union forward, Ms Batters said: “I’ve always been so hugely grateful to the South West for their support. They have backed me throughout and that means so much, so I would just like to say a huge thank you to all of them for their support over the years. Read More Food and tourism top priorities for Devon, business leaders hear at launch of Business Awards 2018 \n“It’s always about making sure that every farming sector is prioritised and of course there’s huge diversity in UK agriculture. Within the South West we’ve got farmers in Cornwall picking daffodils, a lot of dairy and arable, beef, sheep, pigs and poultry - we’ve got everything going on in the region. And of course they’ve all got different concerns right now, let alone the decision to Brexit and what the impacts of that will mean, but I think it’s really about reassuring them that the NFU is there for them, the NFU is ambitious on their behalf and to really get behind us and back us. \n“I want to represent as many farmers and growers across the region and across the whole country as possible.” Minette Batters \nMs Batters, a co-founder of initiatives such as Ladies in Beef and Great British Beef Week alongside Devon farmer, Jilly Greed, added that it would be “essential” for UK farming to achieve a free trade deal within the next twelve months. “We’ve been trading with Europe tariff free for over 40 years,” she said. “That’s been good for consumers and it’s been good for farmers, so achieving that free trade deal is essential and of course we are looking to achieve an interim period to ensure that the hand-over towards that free trade deal works well and gives time for adjustment. Read More Why people can't get enough of Devon homes with holiday cottages - and how you can get in on the action \n“I think there’s a real need to make sure that the supply chain is functioning fairly and also that we have campaigns that really reach out to our consumers. There’s a growing support for buying British, but do people really understand what our high standards of welfare mean? I want people to know that and farmers to be really engaging with their marketplace.” Minette tends to her livestock \nMs Batters, who is the sixth generation of her family to farm on the Longford Estate near Salisbury, concluded: “I am delighted to have been elected as president of the NFU and I am grateful to all the members who have given me the opportunity to lead our industry through Brexit and beyond. \n“At the heart of the NFU is its members and I would like the organisation to aim even higher on their behalf. British farming is in the spotlight like never before and this is a great opportunity to reposition the sector in the eyes of the nation.” \nThe officeholder elections, which took place after the AGM of the NFU Council, also saw members voting for a new deputy and vice president. \nFollowing the withdrawal of Leicestershire farmer, Charles Sercombe, from the bid to become deputy, it was a three-horse race between Guy Smith, current dairy board chairman Michael Oakes and NFU Hertfordshire chairman, Stuart Roberts. Read More ", "external_links": [], "published": "2018-02-21T19:42:00.000+02:00", "crawled": "2018-02-21T19:58:35.001+02:00", "highlightTitle": ""}