{"organizations": [], "uuid": "485093202fe35e7c73d013ce0a757f6fd457bd42", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/business/article1174695.ece/ALTERNATES/s1200/FT2G2018.jpg", "site_section": "http://www.westernmorningnews.co.uk/editorschoices.rss", "section_title": "devonlive - frontpage", "url": "https://www.devonlive.com/news/business/third-devon-businesses-say-brexit-1174666", "country": "GB", "title": "A third of Devon businesses say Brexit could be a good thing", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-06T16:27:00.000+02:00", "replies_count": 0, "uuid": "485093202fe35e7c73d013ce0a757f6fd457bd42"}, "author": "Hannah Finch", "url": "https://www.devonlive.com/news/business/third-devon-businesses-say-brexit-1174666", "ord_in_thread": 0, "title": "A third of Devon businesses say Brexit could be a good thing", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "none"}], "locations": [{"name": "devon", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News A third of Devon businesses say Brexit could be a good thing In the recent study carried out by Fast Track 2 Growth, 35% of Devon businesses said they believed Brexit presented opportunities for growth Share The Fast Track 2 Growth 2018 programme was launched at the Hotel du Vin in Exeter Share Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nA third of Devon businesses are confident that Brexit will be beneficial and a opportunity to grow their company, according to a new survey. \nIn the recent study carried out by business support programme Fast Track 2 Growth , 35% of Devon businesses said they believed Brexit presented opportunities for growth, compared with 23% who said leaving the EU was likely to have a negative impact on their business. \nIn another positive finding, 63% of companies expect to recruit more people in 2018 than 2017. \nThe survey, which gathers feedback on industry trends and projections with a particular focus on growth, saw companies from a wide range of sectors including healthcare, technology, agriculture and professional services from across Devon take part. \nIt found that 45% of companies expect the biggest opportunity for growth for their business this year will come from sales to new customers, with 38% saying it will be from newly launched products and services. \nLewis Banfield, of Fast Track to Growth partner PKF Francis Clark said: \"The positivity reflected in the survey does not surprise me. It reinforces our own experience of working with clients. We are living and working in challenging yet exciting and innovative times. The South West is a positive hotbed of inventive and interesting ventures which are being set up by entrepreneurs and which drive employment and value back into the local economy. \n\"We are in the lucky position of being able to guide these businesses through those challenges and help them reach their full potential, which is one of the reasons we are pleased to support the Fast Track to Growth Programme.\" \nNow in its third year, Fast Track to Growth is backed by partners including Devon County Council, and helps companies with their growth plans through access to free expertise, advice and planning. \nPhil Sampson, director of Fast Track to Growth partner Sampson Hall, said: “Leadership is important in turbulent times and drives an organisation’s ability to exploit opportunities that Brexit will bring. The Fast Track to Growth programme allows organisations large and small to develop their capability to optimise their success and achieve their desired growth. Sampson Hall are proud to have been involved with the programme for the last three years and have seen first hand the benefit it brings to local businesses.” \nThe 2018 programme was recently launched at Hotel du Vin in Exeter ahead of a Free Growth Day event with business workshops and 1-1 sessions with experts on Wednesday April 18 at Rockbeare Manor, near Exeter Airport. \nAll companies who join at www.ft2g.co.uk also have the chance of being shortlisted for a full intensive business growth programme over three days in May and June. A final Dragons’ Den style pitch event will see two secure ongoing business support worth up to £10,000 each. \nThe organisations providing business expertise across the programme are Aptus, Astley Media, Barclays, Commissioning HR, Cosmic, Devon County Council Economy Team and Trading Standards, Logo Creative Partners, PKF Francis Clark, Sampson Hall, Stephens Scown LLP and SETSquared Exeter. Like us on Facebook", "external_links": [], "published": "2018-02-06T16:27:00.000+02:00", "crawled": "2018-02-06T16:58:00.008+02:00", "highlightTitle": ""}