{"organizations": [], "uuid": "918c798434488e22779eb8b43d057e4bb54494f5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14328903.ece/ALTERNATES/s1200/JS144390611.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/historic-change-organ-donor-law-14328766", "country": "GB", "domain_rank": 21960, "title": "Historic change to organ donor law approved as MP shares her daughter's heart-rending story", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-23T15:57:00.000+02:00", "replies_count": 0, "uuid": "918c798434488e22779eb8b43d057e4bb54494f5"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/historic-change-organ-donor-law-14328766", "ord_in_thread": 0, "title": "Historic change to organ donor law approved as MP shares her daughter's heart-rending story", "locations": [], "entities": {"persons": [{"name": "geoffrey robinson", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}], "locations": [], "organizations": [{"name": "house of commons", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nHundreds of lives may could be saved each year after MPs agreed an historic change to organ donation laws. \nThe House of Commons unanimously approved plans for an “opt-out” system, so that people who die are automatically considered to have given consent for their organs to be used to help others. \nIt will replace the existing system, under which people must sign up to a donor register before their organs can be used. \nThe change was proposed by backbench Labour MP Geoffrey Robinson, who said it would be easy to opt out - and family members would still have a veto over whether their loved one’s organs can be used. \nHis private member’s bill received its second reading, and there are further stages to go before it becomes law. Labour leader Jeremy Corbyn (Image: PA) \nBut it has the support of both the Government and Labour leader Jeremy Corbyn. Following the unanimous approval of the House of Commons, the way is clear for the law to be changed. \nMPs heard a number of moving accounts of people who had benefitted from or required organ transplants during the debate. \nSunderland Central MP Julie Elliott gave a hugely personal speech in the Commons about her eldest daughter Rebecca, 36, who has chronic kidney disease. \nShe said Rebecca, who has a six-year-old daughter, now undergoes dialysis for eight hours every night to cope with the condition. \n“For me as a mother, my natural instinct has always been to make things better for your children. It’s what we all do,” said Ms Elliott. An NHS organ donor card \n“To me, she’s always going to be the baby that I gave birth to 36 years ago. You love that child instantly and unconditionally, and that never changes. \n“It’s a terrible situation to be in a situation where you can’t fix something that’s gone terribly wrong. Read More Jeremy Corbyn backs calls to get more women and girls into science and engineering \n“But what I can do from the privileged position I have of being a member of this place is raise awareness and campaign for a change in the law to that deemed consent.” \nMPs heard how Rebecca had been signed up to run the London Marathon before her diagnosis in October 2016 after a routine blood test. Labour MP Julie Elliott (Image: Adam Gerrard) \nFive family members had offered to donate organs but none of them were a match, Ms Elliott added. \nShe said that while dialysis had restored her daughter’s quality of life and enabled her to go back to work, she still had bad days. \n“Whenever she has a bad day, and she does bad days emotionally, because it’s a very difficult thing to be dealing with, she’ll say, ‘I’m sick of this dialysis’, I’ll say ‘just think what’s the alternative Rebecca’, and that very quickly focuses your mind and you pick yourself up,” said the Labour MP. \n“The impact on our family has been huge. You go through a period of shock and disbelief and anger as to why Rebecca, and more than one doctor has said to us through this period that it shouldn’t be happening to her. \n“She’s been a fit, healthy young woman who’s done everything right in terms of looking after her health, and they can’t find the reason why this has happened. Read More 'We want a hard Brexit' - North East MP signs letter setting out demands to Theresa May \n“And the emotions and the journey you go through are like a rollercoaster, because it’s not just the dire impact of what’s happening medically to Rebecca, but it’s the emotional impact of seeing what is happening to her might mean your daughter might not be there when I’m still here, which is not something any parent ever wants to consider. \n“But it’s also, although my children are grown up, they’re having to deal with seeing their mother less coping than I normally am, and I’m a fairly strident, coping kind of woman normally, but also for all of them dealing with their sister might not be here, and that’s all very, very difficult.” Like us on Facebook", "external_links": [], "published": "2018-02-23T15:57:00.000+02:00", "crawled": "2018-02-23T16:13:54.003+02:00", "highlightTitle": ""}