{"organizations": [], "uuid": "73b0e7000a25eaab8ffdacabd90ca686a5e0c029", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14339485.ece/ALTERNATES/s1200/JS144764628.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/newcastle-leader-nick-forbes-urges-14339366", "country": "GB", "domain_rank": 21960, "title": "Newcastle leader Nick Forbes urges Jeremy Corbyn to back single market membership", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-26T18:00:00.000+02:00", "replies_count": 0, "uuid": "73b0e7000a25eaab8ffdacabd90ca686a5e0c029"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/newcastle-leader-nick-forbes-urges-14339366", "ord_in_thread": 0, "title": "Newcastle leader Nick Forbes urges Jeremy Corbyn to back single market membership", "locations": [], "entities": {"persons": [{"name": "nick forbes", "sentiment": "negative"}, {"name": "jeremy corbyn", "sentiment": "negative"}], "locations": [{"name": "norway", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "liechtenstein", "sentiment": "none"}, {"name": "iceland", "sentiment": "none"}], "organizations": [{"name": "news newcastle", "sentiment": "negative"}, {"name": "newcastle", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "newcastle city council", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "newcastle city counci", "sentiment": "none"}, {"name": "european economic area", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Newcastle leader Nick Forbes urges Jeremy Corbyn to back single market membership Jeremy Corbyn has supported staying in a customs union after Brexit but some Labour politicians want him to go further Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily   Thank you for subscribing!   \nMore than 80 senior Labour figures including the leader of Newcastle City Council have urged Jeremy Corbyn to back remaining in the single market. \nThey said the UK should be part of the European Economic Area (EEA) after Brexit - which would mean remaining in the single market permanently. \nIt would mean the UK had a similar status to Iceland, Liechtenstein or Norway. These three countries are all members of the EEA despite not being in the EU. \nA letter signed by Labour politicians including Newcastle leader Nick Forbes said: “As a minimum - Labour must clearly and unambiguously set as a negotiating objective the goal of remaining part of the European Economic Area, in order to participate on a permanent basis in the Single Market.” Nick Forbes leader of Newcastle City Council (Image: Newcastle Chronicle) \nIt came as Labour leader Jeremy Corbyn set out his proposal for the UK to remain in “a new comprehensive UK-EU customs union” after Brexit. \nBut Mr Corbyn appeared to rule out continued membership of the single market. \nHe repeated his proposal, set out in Labour’s election manifesto last year, to end freedom of movement - a policy that would almost certainly make continued single market membership impossible. \nIn his speech in Coventry, Mr Corbyn said: “Labour would negotiate a new and strong relationship with the single market that includes full tariff-free access and a floor under existing rights, standards and protections.” Labour leader Jeremy Corbyn (Image: Getty Images Europe) \nHe added: “Our immigration system will change and freedom of movement will as a statement of fact end when we leave the European Union.” \nEEA membership allows for the free movement of people, goods, services and capital within the European Single Market. Read More Jeremy Corbyn says Labour wants a Brexit to support the car industry \nIt means membership of the EEA would allow the UK to continue to have freedom of movement with the EU even after Brexit - just as Iceland, Liechtenstein and Norway have today. \nHowever, this also means that any UK Government hoping to end freedom of movement would probably be unable to support membership of the EEA. \nOpponents of EEA membership also argue that countries such as Norway currently have to accept rules set out by the EU. \nThe letter was organised by the Labour Campaign for the Single Market. Labour leader Jeremy Corbyn (Image: Getty Images Europe) \nLabour politicians signing it include Sunderland Central MP Julie Elliott and Houghton and Sunderland South MP Bridget Philipson. \nThey said: “Our commitment to social justice dictates that we should also seek to participate in – not simply have ‘access’ to - the EU’s Single Market. Why? Because the Single Market is more than a free trade zone between EU countries. \n“It is a framework of rules - including on employment rights, consumer and environmental standards - that protects people from the worst excesses of globalisation and unfettered capitalism.” Read More Historic change to organ donor law approved as MP shares her daughter's heart-rending story \nAnd they added: “Indeed, if we want to be able to fund our anti-austerity investment programme we can’t afford the multi-billion pound hit to the public finances that leaving the Single Market would entail. \n“We can only properly fund local services, schools, hospitals, social care and international development if our businesses thrive and our economy grows. And, if we want to build a modern, low-carbon economy that protects workers and tackles tax avoidance, we will only achieve it through collaboration and frictionless trade with our nearest neighbours.” Like us on Facebook", "external_links": [], "published": "2018-02-26T18:00:00.000+02:00", "crawled": "2018-02-26T19:40:47.048+02:00", "highlightTitle": ""}