{"organizations": [], "uuid": "20df4ad427f33be2fd5d8f356236ca76c6357e2d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1259176.ece/ALTERNATES/s1200/bovey-traceyPNG.png", "site_section": "http://www.westernmorningnews.co.uk/politics.rss", "section_title": "devonlive - News", "url": "https://www.devonlive.com/news/devon-news/devon-town-shocked-after-finding-1259159", "country": "GB", "title": "Devon town shocked after finding out its twin town in France had ditched them", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-24T16:11:00.000+02:00", "replies_count": 0, "uuid": "20df4ad427f33be2fd5d8f356236ca76c6357e2d"}, "author": "Daniel Clark", "url": "https://www.devonlive.com/news/devon-news/devon-town-shocked-after-finding-1259159", "ord_in_thread": 0, "title": "Devon town shocked after finding out its twin town in France had ditched them", "locations": [], "entities": {"persons": [{"name": "devon", "sentiment": "none"}, {"name": "bo", "sentiment": "none"}, {"name": "cllr chris robillard", "sentiment": "none"}, {"name": "bovey tracey", "sentiment": "none"}, {"name": "mark passmore/apex", "sentiment": "none"}, {"name": "le molay-littry", "sentiment": "none"}, {"name": "tracey", "sentiment": "none"}], "locations": [{"name": "france", "sentiment": "none"}, {"name": "teignbridge", "sentiment": "none"}, {"name": "theydon bois", "sentiment": "none"}, {"name": "essex", "sentiment": "none"}, {"name": "normandy", "sentiment": "none"}, {"name": "le molay-littry", "sentiment": "none"}], "organizations": [{"name": "telegraph", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Devon town shocked after finding out its twin town in France had ditched them Councillors in Bovey Tracey found out this week that their twin town of Le Molay-Littry in Normandy had found a new twin town instead Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nA bombshell was dropped on Bovey Tracey this week when it was revealed their twin town had left them and found a new partner. \nCouncillors in the Teignbridge town had contacted their twin town of Le Molay-Littry in Normandy, France, to discuss plans for a cultural exchange. \nBut instead, the town was shocked to hear that the French town had severed links with them, and to add insult to injury, they had taken up with a rival in Essex, the French-sounding village of Theydon Bois as their new twin town. Bovey Tracey (Image: MARK PASSMORE/APEX) \nThe Telegraph reports that Cllr Chris Robillard had to deliver the bad news to the council that Le Molay-Littry had found a new twin town because it felt unloved. Read More A popular Devon restaurant is launching a takeaway roast dinner service this weekend \nHe said: “We haven't had any official contact with them for many years and they have now gone and twinned with another town near Epping Forest. \n“They were initially positive about the idea of renewing our friendship when I made contact towards the end of last year. \n\"But in the meantime they've had a change in the local government, a new mayor and other officers and the new regime has decided to say ‘au revoir’. I can’t say I blame them. It must be 15 years since we last had contact. They thought we’d forgotten them.” \nThe decision has also given the council a practical problem to deal with as the main road in the town is called Le Molay-Littry Way and all of the town signs say ‘twinned with’ on them. Junction of B3344, Le Molay-Littry Way (Image: Torquil MacLeod) \nBut in Le Molay-Littry, a pretty tourist town close to the D-Day beaches and the site of the Bayeux tapestry, the mayor has held out the possibility of a ménage-à-trois rather than a divorce. Read More One of Devon's Take Me Out stars will compete in a national beauty pageant where she could be named Miss British Isles \nGuillaume Bertier told The Telegraph: “It’s very important to keep up ties with our English friends, especially in this time of Brexit. We will get the twinning back on track again.” \nMonsieur Bertier is travelling to Theydon Bois in April but said he would also visit Bovey Tracey and hoped to maintain a relationship with both. Read More \nBrigitte Mottin, the deputy mayor, added: “The twinning programme is not dead, it is just dormant. There may well be a renaissance.” Like us on Facebook ", "external_links": [], "published": "2018-02-24T16:11:00.000+02:00", "crawled": "2018-02-24T16:30:34.008+02:00", "highlightTitle": ""}