{"organizations": [], "uuid": "aaf75afe2195e7f766151e709fa1c18915ab6325", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1216751.ece/ALTERNATES/s1200/lanesclose.png", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "devonlive - frontpage", "url": "https://www.devonlive.com/news/devon-news/lanes-end-should-you-join-1216744", "country": "GB", "title": "When lanes end should you join the back of the queue, or drive on?", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-15T09:02:00.000+02:00", "replies_count": 0, "uuid": "aaf75afe2195e7f766151e709fa1c18915ab6325"}, "author": "Neil Shaw", "url": "https://www.devonlive.com/news/devon-news/lanes-end-should-you-join-1216744", "ord_in_thread": 0, "title": "When lanes end should you join the back of the queue, or drive on?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "News opinion When lanes end should you join the back of the queue, or drive on? Who is most evil: Drivers who block the lane ahead, drivers who jump the queue or drivers who won't let you in? Share Neil Shaw Head of Digital 07:02, 15 FEB 2018 Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nSo you’re driving down a busy road and you suddenly come across a roadwork sign, quickly followed by a sign saying your lane is about to end – dropping from two to just one. \nWhat to do? \nAs you carry on down the road the signs count down how much of your lane is left. 800yards, 600yards, 400yards. \nAt what point are you supposed to pull over? \nFew things are more divisive in British culture than this issue – whether you should instantly join the back of the queue in the lane that is staying open, or carry on down the closing lane until you reach the end then merge in turn. \nBrexit, religion, whether cream or jam go first on a scone are all meaningless compared to this debate. Read More Watch as water main bursts, sending huge fountain 40 feet into the air \nThe problem is, we are British – we queue. We queue better than any other nation on earth. So when you see a line you feel like you should join at the back, rather than carrying on and ‘pushing in’ further along. \nThere are special places in hell for queue jumpers. \nSome will appoint themselves Guardians of the Great British Queue. Usually they drive a white van – and they will sit in the closing lane keeping pace with the one staying open to make sure You Shall Not Pass. \nThese Gandalfs sit playing with their staffs, er gearsticks, to ensure no-one pushes in. Some call them Knights of the Ending Lane, Protectors of the One True Highway and Saviours of Great Britishness. Others call them Cockwombles. \nSo who is right? What does the law say about ending lanes, what is the fastest and safest way for everyone to get where they are going? \nFrustratingly, the Highway Code is not clear. \nIn this case, Rule 134 applies: “You should follow the signs and road markings and get into the lane as directed. In congested road conditions do not change lanes unnecessarily. Merging in turn is recommended but only if safe and appropriate when vehicles are travelling at a very low speed, e.g. when approaching road works or a road traffic incident. It is not recommended at high speed.” \nSo you should pull over to the lane staying open, unless there's a queue - in which case you should merge in turn - but only if it's safe and appropriate. Read More \nThe problem being that some drivers - both those who block the closing lane and those who refuse to let you pull in - make merging less than safe or appropriate. \nThat’s cleared that up then. \nExperts say going to the end of the closing lane then merging in turn is the most efficient way. \nIt reduces the risk of accidents by ensuring the speed of both lanes is similar and it reduces congestion by spreading the traffic over two lanes rather than one - shortening the queue. \nThe Government's Traffic Sign Manual for layouts through roadworks says: \"The equal use of both lanes for queuing shortens the physical extent of the queues and so reduces delays arising from interference with upstream junctions.\" Read More Roadworks 'perfect storm' begins across South Devon \nA 2008 study by Ken Johnson, a state work zone engineer in Minnesota, found this zip-merging method to be the safest and best way of tackling the closing-lanes conundrum. But Gandalf the White Van Man hasn’t read the 2008 study, because it wasn’t in The Star. \nIn short, we all have to drive with a little common courtesy, and decide for ourselves what is the right thing to do. \nSo what about those white van drivers? Well that is one place where the law is crystal clear. Deliberately blocking a lane, or deliberately driving too slowly, is illegal – and would count as either careless driving or dangerous driving. You could be hit with a big fine and up to nine points. \nMagic your way out of that one White Vandalf. Like us on Facebook ", "external_links": [], "published": "2018-02-15T09:02:00.000+02:00", "crawled": "2018-02-15T09:12:39.000+02:00", "highlightTitle": ""}