{"organizations": [], "uuid": "37114c6752634b3c00b6c25ec1654f065ace0452", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1215996.ece/ALTERNATES/s1200/DMJPG.jpg", "site_section": "http://www.middevongazette.co.uk/politics.rss", "section_title": "devonlive - News", "url": "https://www.devonlive.com/news/devon-news/politicians-generally-decent-people-you-1226391", "country": "GB", "title": "Politicians are (generally) decent people, and you can always vote them out if you like", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-16T19:34:00.000+02:00", "replies_count": 0, "uuid": "37114c6752634b3c00b6c25ec1654f065ace0452"}, "author": "Patrick Phelvin", "url": "https://www.devonlive.com/news/devon-news/politicians-generally-decent-people-you-1226391", "ord_in_thread": 0, "title": "Politicians are (generally) decent people, and you can always vote them out if you like", "locations": [], "entities": {"persons": [{"name": "david morrish", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "David Morrish pictured in 1998 Share Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThere’s an accepted wisdom in journalism that politicians are fair game. They put themselves up for election, so it’s right their decisions are up for public scrutiny and their skins should be slightly thicker than the average man or woman’s. \nIn my view it’s perfectly OK to robustly hold them to account, publish criticism of their policies, check out how they’re spending public money and poke a bit of fun at them. \nNowadays social media makes it easy for people to voice their disapproval with a few presses of a mobile phone keypad, and they do so in droves. In fact a lot of my Facebook and Twitter feed is made up of people spouting political views that they wouldn’t dream of sharing at a dinner party. Read More Dartmouth Regatta may not have an airshow this year after massive financial losses \nIt might be a bit of Brexit, which has polarised opinions but the bile level appears to have been ramped up in recent months. \nPersonally, I think it’s all gone a bit too far because, believe it or not, the vast majority of politicians are in it for the right reasons – especially at a local level. \nRecently we had to remove a post from DevonLive.com , where the author had said that a senior councillor had probable been down to Staples to collect brown envelopes. Apart from the fact that this jibe didn’t work brilliantly (surely anyone with enough cash to bribe a politician councillor would also supply their own envelopes) I thought this was a bit uncalled for. \nOf all politicians councillors are probably the most hard-working and dedicated to the communities they serve. While MPs spend most of their week in London, councillors face their public every time they step outside their house. Read More ", "external_links": [], "published": "2018-02-16T19:34:00.000+02:00", "crawled": "2018-02-16T21:04:13.012+02:00", "highlightTitle": ""}