{"organizations": [], "uuid": "b0361b8811409dcdb7b9f848231051cc88eff33a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1132283.ece/ALTERNATES/s1200/HH5A1187JPG.jpg", "site_section": "https://www.devonlive.com/rss.xml", "section_title": "devonlive - frontpage", "url": "https://www.devonlive.com/news/news-opinion/advantages-exeter-city-centre-site-1276335", "country": "US", "title": "The advantages of a Exeter city centre site for pool and bus station are obvious", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-28T15:55:00.000+02:00", "replies_count": 0, "uuid": "b0361b8811409dcdb7b9f848231051cc88eff33a"}, "author": "Ben Bradshaw", "url": "https://www.devonlive.com/news/news-opinion/advantages-exeter-city-centre-site-1276335", "ord_in_thread": 0, "title": "The advantages of a Exeter city centre site for pool and bus station are obvious", "locations": [], "entities": {"persons": [{"name": "ben bradshaw", "sentiment": "none"}, {"name": "sidwell", "sentiment": "none"}, {"name": "bridget batchelor photograhy", "sentiment": "none"}], "locations": [{"name": "exeter", "sentiment": "none"}, {"name": "princesshay", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}], "organizations": [{"name": "st sidwell", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The advantages of a Exeter city centre site for pool and bus station are obvious Ben Bradshaw gives his views on the bus station and the St Sidwell's point redevelopment Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nWhen, in last month’s column, I tackled the thorny issue of student flats, I got such a positive response, I’ve decided to take on another local controversy this month: the bus station redevelopment. \nLet me stress, MPs have no locus in local planning matters. They are rightly the responsibility of democratically elected local councillors who are answerable to the public at the ballot box. Read More \nBut there’ve been so many claims and counter claims about the bus station, that it’s sometimes hard to separate fact from fiction. Exeter Bus and Coach Station. Exeter GVs, Saturday, January 27, 2018. Credit: Bridget Batchelor Photograhy \nThe land bordered by Sidwell and Paris streets has long been earmarked for redevelopment, following the successful redevelopment of Princesshay. \nThe decision to move the bus maintenance depot out to Marsh Barton (you don’t need to maintain buses on a prime city centre site) has freed up more land. Read More Bus station and pool boss 'verbally savaged for two and a half hours' at packed public meeting \nThe bus station has a certain 1960s charm, but few would argue it couldn’t be improved. The same goes for the Pyramids, Exeter’s public swimming pool. It was built in the 1930s and is not only hugely costly to maintain, but repair and maintenance work increasingly difficult because parts and equipment are becoming obsolete. Ben Bradshaw after increasing his majority in May \nThis is the background to the decision, by the council, to redevelop the area in question to include a new, modern pool and bus station, as well as shopping, restaurant, entertainment and other facilities. \nThe advantage of a city centre site for both pool and bus station are obvious in terms of public access. Another is it will attract private investment. In fact, the bulk of the investment in the initial plan was private sector. St Sidwell's Point in Exeter City Centre \nWhy no city centre theatre? That’s one question that’s often asked. Read More Exeter City Council would dearly love to build more council homes, but the Government won’t let it \nNobody would turn down a good-sized provincial theatre, like Plymouth’s, in Exeter. Indeed, there are proposals for a new theatre on the current Corn Exchange site. \nHowever, the sort of theatre we’re talking about would require significant public investment to build and generous on-going public subsidy to run. In the current climate of austerity, that is sadly not likely in the short term. The Exeter bus and coach station redevelopment site \nWhat about an Olympic-sized pool? Again, this would be nice in an ideal world, but it would also need significant public spending to build and run. Sport England, the national body responsible for promoting sport, including swimming, say they don’t believe such a scheme would be viable in Exeter, given the provision elsewhere in the region. \nLocated at Arena Park or on the edge of the city, as its advocates suggest, would also make access difficult for people without cars, particularly children, and so hamper its main role as a community pool for all. Read More Unless Brexit talks go well, there could be ANOTHER General Election \nThis is the background against which the council is operating. Its initial proposals stalled last autumn when the main developer, Crown Estates, pulled out citing market conditions related to Brexit. \nBut, as recent investments in Exeter show, there is still confidence in our city despite the national picture. The council is now working on revised plans, which we await with interest. Like us on Facebook ", "external_links": [], "published": "2018-02-28T15:55:00.000+02:00", "crawled": "2018-02-28T16:26:03.036+02:00", "highlightTitle": ""}