{"organizations": [], "uuid": "fcbc71c3e55c04f4ee2726d39458e02ccc78440c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article361746.ece/ALTERNATES/s1200/Anne-Marie-Morris-MPppPNG.png", "site_section": "http://www.middevongazette.co.uk/politics.rss", "section_title": "devonlive - News", "url": "https://www.devonlive.com/news/news-opinion/brexit-opportunity-improve-invest-skills-1178310", "country": "GB", "title": "Brexit is an opportunity to improve and invest in the skills of our domestic workforce", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-07T12:03:00.000+02:00", "replies_count": 0, "uuid": "fcbc71c3e55c04f4ee2726d39458e02ccc78440c"}, "author": "Anne Marie Morris", "url": "https://www.devonlive.com/news/news-opinion/brexit-opportunity-improve-invest-skills-1178310", "ord_in_thread": 0, "title": "Brexit is an opportunity to improve and invest in the skills of our domestic workforce", "locations": [], "entities": {"persons": [{"name": "anne marie morris", "sentiment": "none"}, {"name": "anne marie morris", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "newton", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News opinion Brexit is an opportunity to improve and invest in the skills of our domestic workforce Anne Marie Morris MP says membership of the EU has not been conducive to our service-based economy as it has been to manufacturing economies. Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nANNE MARIE MORRIS IS THE CONSERVATIVE MP FOR NEWTON ABBOT AND HAS BEEN SINCE 2010 UK’s Independent Trade Policy \nThe UK is a historic trading nation which once again has its own independent trade policy to shape and the opportunity to pursue new relationships with the world. We should focus on negotiating new agreements that suit our service based economy and aren’t one-size-fits-all EU deals. \nThe global economy offers plenty of untapped trade potential for the UK and Brexit gives us real scope for improving trade relationships with emerging markets. The South West exports the lowest proportion of goods to the EU compared to the rest of the United Kingdom. The fastest growth in international trade for the South West comes from developing economies. Read More How we manage the UK border is about to change quite radically \nThe think tank Open Europe, has found the top ten markets for UK goods and services exports outside the EU, represent together untapped export potential of just over £41 billion in 2030. It is to the enormous economic benefit of the country, and the South West in particular, that we develop an ambitious, outward-looking trade policy to complement our new trade relationship with the EU. Anne Marie Morris MP \nThe UK’s Comparative Advantage \nThe task of the government is draw on our comparative advantage in services. Membership of the EU has not been conducive to our service-based economy as it has been to manufacturing economies. \nTrade in services trade has been poorly supported because of the limitations of the Single Market in which many non-tariff barriers to trade in services still exist, particularly relating to linguistic and legal differences. We should prioritise liberalising service exports as, while growth in global goods trade is slowing, service trade is expanding. Read More Inherent unfairness of schools funding formula has not been addressed \nThe global shift towards greater services trade is an opportunity for the UK, since it is already the world’s second largest exporter – beaten only by the USA - and the single biggest exporter of services in the EU. Reducing barriers to trade in services, in the same way as trade in goods, would reduce our trade imbalances and boost economic growth. Anne Marie Morris MP \nSupporting Exporting Businesses \nBrexit is also an opportunity to improve and invest in the skills of our domestic workforce and to deepen our domestic supply chains. To get more businesses exporting, it is important to get the fundamentals supporting the South West’s economy right. Investment in road and rail infrastructure to improve connectivity and ensuring a successful implementation of the broadband roll-out are key. Read More Fears another storm could once again cut off Dawlish rail line \nWe need to plug the skills gap, which I am pleased to see the Government doing through its £20 million investment in the Institute of Coding, a consortium of more than 60 universities, businesses, and industry experts, as well as through a £10 million investment in free and subsidised training courses to help adults retrain and learn new skills – the pilot programme of which will take place in Devon and Somerset! Exporting is crucial to the growth of our regional economy and we have an abundance of innovation and ambition to increase trade flows. \nGrowth in the South West \nThe South West has more coastline than any other region and our region’s ports are a regional and national asset, providing historic gateways for trade, export, and employment. Read More The Mercy or Fifty Shades - what's YOUR choice of cinema viewing this weekend? \nEach year more than 45 million tonnes of fish is landed at ports in the South West, making up just under half of the total English and Welsh catch. 2017 has been a record-breaking year for the Port of Teignmouth as it has handled its highest tonnage of cargo since 2008. Teignmouth Harbour \nHigher capacity shipments have been made possible by the dredging campaign by Teignmouth Harbour Commission. Teignmouth can now welcome much larger vessels to the port to carry much larger volumes of cargo. Investments like these in our infrastructure are key examples of ways in which we can encourage and support British businesses to take advantage of the huge potential to grow exports. Read More \nLast year exports of goods rose in every region of the UK, with 13.7% growth in the South West in particular. We are in a prime position to unlock further opportunities overseas. Like us on Facebook", "external_links": [], "published": "2018-02-07T12:03:00.000+02:00", "crawled": "2018-02-07T12:17:07.003+02:00", "highlightTitle": ""}