{"organizations": [], "uuid": "f6c7bae71ff0c9bec84bbde40a24de2b6c7da87e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14155984.ece/ALTERNATES/s1200/Carillions-office-at-Partnership-House-in-Gosforth.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/60-jobs-saved-carillions-gosforth-14293774", "country": "GB", "domain_rank": 21960, "title": "60 jobs saved at Carillion's Gosforth legal arm as Clifford Chance enters Newcastle", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-15T14:32:00.000+02:00", "replies_count": 0, "uuid": "f6c7bae71ff0c9bec84bbde40a24de2b6c7da87e"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/60-jobs-saved-carillions-gosforth-14293774", "ord_in_thread": 0, "title": "60 jobs saved at Carillion's Gosforth legal arm as Clifford Chance enters Newcastle", "locations": [], "entities": {"persons": [{"name": "michael bates", "sentiment": "none"}], "locations": [{"name": "gosforth", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}], "organizations": [{"name": "carillion", "sentiment": "negative"}, {"name": "clifford chance", "sentiment": "negative"}, {"name": "newcastle", "sentiment": "negative"}, {"name": "carillion advice services", "sentiment": "none"}, {"name": "newcastle share click", "sentiment": "none"}, {"name": "cas - carillion", "sentiment": "none"}, {"name": "the journal", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "60 jobs saved at Carillion's Gosforth legal arm as Clifford Chance enters Newcastle The magic circle law firm has acquired CAS - Carillion's legal services division in Newcastle Share Click to play Tap to play The video will start in 8 Cancel Play now Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nOne of the UK’s biggest law firms has saved 60 jobs in Newcastle after acquiring Carillion’s legal services division in Gosforth. \nConcerns had been raised about the future of Newcastle-based CAS (Carillion Advice Services) after the outsourcing giant collapsed last month. \nSources close to the firm previously told The Journal that the legal division was still profitable and it was likely it would be sold. \nNow the firm’s 60 paralegal roles have been saved, after law firm Clifford Chance stepped in to acquire the team. Clifford Chance managing partner Michael Bates \nThe move is Clifford Chance’s first entrance to the Newcastle market. The firm is one of the UK’s “magic circle” law firms - the biggest five law firms in the country - and is the first of the group to set open a base in the North East. Its headquarters are in the heart of London’s financial district at Canary Wharf. \nThe office will continue to be led by Lucy Nixon who will report to Clifford Chance’s managing partner Michael Bates and global head of client services solutions Oliver Campbell, who is also responsible for the firm’s legal support centre in India. Read More North East manufacturing should be 'at the heart' of Brexit talks, says Northern Powerhouse minister \nMr Campbell said: “We are excited to be developing our operations in Newcastle. This is an excellent team, drawn from a pool of high-quality local talent. We see significant opportunities for developing our offering over time in Gosforth, building on the extremely successful foundations laid by the CAS team, as an integral part of the local business economy. Oliver Campbell, Clifford Chance’s global head of client services solutions (Image: Unknown) \n“We have been very impressed by the CAS team in Newcastle. They bring a huge amount of expertise in areas that are already an important priority for the firm, such as legal tech and process-driven service delivery.” Read More Another 101 Carillion workers lose jobs as Official Receiver's review of contracts continues \nThe 60 paralegals working at Gosforth’s Partnership House specialise in large projects for clients and low to medium complexity work. This includes document reviews, due diligence, e-disclosure and litigation support. \nIt was originally developed as part of Carillion’s in-house legal team but was spun out in order to provide support to other law firms and in-house legal teams. The use of CAS also became a requirement for law firms that managed to win a place in Carillion’s legal panel. Carillion's office at Partnership House in Gosforth (Image: NCJ Media) \nMichael Bates said: “Our priority is always to ensure that we are best placed to provide the optimum service to our clients. By working with the CAS team, we will enhance our ability to provide extremely cost-effective, efficient and high-quality service on a range of low complexity legal tasks as an integral part of our overall client offer. \n“To date, we have delivered this work either through our Legal Support Centre in India, or through working with other third parties including legal outsourcers. The addition of the team in Newcastle, with their well-recognised expertise in unbundling, developing processes and applying the latest in legal tech, will enable us to provide clients with another option from within the firm.” Like us on Facebook", "external_links": [], "published": "2018-02-15T14:32:00.000+02:00", "crawled": "2018-02-15T14:54:25.000+02:00", "highlightTitle": ""}