{"organizations": [], "uuid": "a8c7cacb8bbaa2949569370b98a471bd586d12e1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/article1179668.ece/ALTERNATES/s1200/VERWEY_9.png", "site_section": "http://www.westernmorningnews.co.uk/editorschoices.rss", "section_title": "devonlive - frontpage", "url": "https://www.devonlive.com/news/devon-brothers-launch-worlds-first-1179659", "country": "GB", "title": "Devon brothers launch the world's first marquee-hire comparison site", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-07T14:56:00.000+02:00", "replies_count": 0, "uuid": "a8c7cacb8bbaa2949569370b98a471bd586d12e1"}, "author": "Hannah Finch", "url": "https://www.devonlive.com/news/devon-brothers-launch-worlds-first-1179659", "ord_in_thread": 0, "title": "Devon brothers launch the world's first marquee-hire comparison site", "locations": [], "entities": {"persons": [{"name": "bill verwey", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "tim", "sentiment": "none"}], "locations": [{"name": "newton abbot", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tim and Bill Verwey have launched the world's first marquee-hire comparison site MarqueeBookings.co.uk Share Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nA new website that allows users to find a marquee within minutes has been launched in Newton Abbot. \nDevon brothers Tim and Bill Verwey came up with the idea of a comparison site for marquees after the experience their sister went through in trying to plan her own marquee wedding. \nNow, customers can find, compare and book a marquee from 115 trusted registered companies on their website MarqueeBookings.co.uk There are 450 different types of marquees listed on the website \nTim said: “We all found it impossible to answer these simple questions online... how much will the marquee cost, how big does it need to be, what will it look like & will it fit in my garden? \n“We thought, why isn't there a website that easily answers all of these questions, especially as you can already order food or flights or book a holiday in seconds. Read More A third of Devon businesses say Brexit could be a good thing \n“So we set out to build a website that brings the marquee industry into the 21st century and we are the only comparison website in the world for marquee hire.” \nThe brothers honed their entrepreneur skills while studying at university before Tim went off to work ski seasons and Bill headed to a big corporate in Germany. \nTim explained: “We both got into tech startups and entrepreneurship at university plus Bill spent years putting marquees up in Devon and Cornwall. \n“We always wanted to start a company and MarqueeBookings.co.uk was born.” The website allows customers to choose the right marquee for their budget, site and number of guests \nMarquee Bookings uses a bespoke algorithm that inputs the details of the event including the size of the site, number of guests and even what type of furniture and flooring will be used within the marquee, and then produces a tailored quote. Read More Devon digital learning company expands into Dublin as Brexit looms \nThere are 110 marquee companies registered with 450 marquees available to hire on the website. \nOrganisers are able to book and pay for the marquee hire online, receiving the same price on marqueebookings.co.uk as they would booking direct with the supplier. \nTim said: “We have good relationships with our marquee suppliers and are all about transparency and keeping everyone in the loop. We are offering event organisers the power of choice, in a couple of clicks you know exactly what size marquee you need, you can see exactly what they look like and you can book within seconds. You don’t need to ring 20 different marquee companies and go back and forth with quotes, we have removed that whole process – saving time and money.” Like us on Facebook ", "external_links": [], "published": "2018-02-07T14:56:00.000+02:00", "crawled": "2018-02-07T15:03:23.009+02:00", "highlightTitle": ""}