{"organizations": [], "uuid": "bfdf8d85f11751a943c19951905c54e39fc3c18c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14106342.ece/ALTERNATES/s1200/Brexit.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/business-leaders-say-patience-wearing-14258563", "country": "GB", "domain_rank": 21960, "title": "Business leaders say 'patience is wearing thin' over Government Brexit dithering", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-07T15:37:00.000+02:00", "replies_count": 0, "uuid": "bfdf8d85f11751a943c19951905c54e39fc3c18c"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/business-leaders-say-patience-wearing-14258563", "ord_in_thread": 0, "title": "Business leaders say 'patience is wearing thin' over Government Brexit dithering", "locations": [], "entities": {"persons": [{"name": "catherine mckinnell", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "business business", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "bcc", "sentiment": "none"}, {"name": "cabinet", "sentiment": "none"}, {"name": "eu customs union", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "union", "sentiment": "none"}, {"name": "chambers of commerce", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Business leaders say 'patience is wearing thin' over Government Brexit dithering Warning comes as Newcastle MP Catherine McKinnell backs plans to keep UK in EU Customs Union after Brexit Share EU and Union flags (Image: PA) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nBusiness and political leaders are raising pressure on the Government on Brexit with a warning that “patience is wearing thin” in the business community. \nAs ministers in the Prime Minister’s Brexit “war cabinet” met to discuss what they want from the future relationship with the EU , the business lobby intervened to demand “clear negotiating objectives”. \nIn its toughest statement on Brexit yet, the British Chambers of Commerce (BCC) said that the business community’s patience with the Cabinet’s “continued division” on Brexit is “wearing thin” and Theresa May must urgently deliver a clear statement of Government wants. Theresa May in Brussels for Brexit talks \nMeanwhile, one North East MP has joined a last gasp campaign to keep the UK in the EU Customs Union, saying that \nkeeping barrier-free trade is “critical” for the region’s economy. \nThe Government has faced calls from the EU for clarity and criticism at home for failing to spell out what it wants 18 months on from the referendum vote to Leave. \nIn a letter to Mrs May, the BCC warned that companies were beginning to activate Brexit contingency plans, which will be seen as a coded warning that jobs could leave the UK. Dr Adam Marshall (Image: Coventry Telegraph Archive) \nBCC director general Adam Marshall and president Francis Martin went on: “The perception amongst businesses on the ground, large and small alike, is one of continued division. Even amongst the many optimistic, future-oriented firms - those who see opportunity in change - patience is wearing thin. Directly-affected companies are poised to activate contingency plans. Many others, worryingly, have simply disengaged. \n“Clear UK negotiating objectives are crucial to both business and public confidence. \n“While the BCC has campaigned strongly in favour of a status-quo transition period, to give businesses time to plan for change, this transition must lead to a clear endpoint. \n“There is no room for continued ambiguity as companies make investment and hiring decisions. The Government must set out its plans.” \nElsewhere Catherine McKinnell , MP for Newcastle North, has signed an amendment to the Trade and Customs Bill calling for the UK to remain part of the Customs Union. Read More Newcastle skyscraper Hadrian's Tower to open rooftop to public 18 times a year \nMs McKinnell said that being able to trade with the EU was particularly important for the North East’s economy, due to its role as a major exporting region. \nShe said: “I believe the Prime Minister’s decision to insist on pulling the UK out of the Customs Union has been a catastrophic error of misjudgement and could have a devastating impact on the North East and local jobs for decades to come. Newcastle North MP Catherine McKinnell (right) \n“Over 60% of the North East’s exports currently go to the EU, and businesses across the region have repeatedly made clear that frictionless, barrier-free trade is absolutely critical for the future of key sectors of our economy, including the automotive industry, pharmaceuticals, energy, oil and gas. \n“This is not just about tariffs, but the endless new red tape and time wasted on extra bureaucracy now facing North East business, with many of the region’s exporters also having EU-based firms as part of their supply chain. \n“There’s also not a shred of evidence that any new free trade deals the UK may be able to negotiate after we have left the EU will be able to make up for the disadvantages of leaving the Customs Union.” Read More Leaked document suggests the North East will be badly hit by Brexit \nMs McKinnell’s comments come a week after an impact report commissioned by the Government showed the UK would be worse off outside the EU under every scenario modelled - and that the North East would be one of the worst affected regions. \nA UK Government spokesman said: “The Prime Minister has set out a clear ambition for a deep and special partnership with the European Union and we are confident of securing an implementation period that will provide businesses with certainty.” Like us on Facebook", "external_links": [], "published": "2018-02-07T15:37:00.000+02:00", "crawled": "2018-02-07T16:12:05.000+02:00", "highlightTitle": ""}