{"organizations": [], "uuid": "3ef4c2f36dd8837a0bf261ee90e82cbdbd634745", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14319440.ece/ALTERNATES/s1200/IBP_NEC_300714greggs_02JPG.jpg", "site_section": "http://www.thejournal.co.uk/business/?service=rss", "section_title": "nechronicle - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/women-greggs-paid-22-less-14319426", "country": "GB", "domain_rank": 21960, "title": "Women at Greggs paid 22% less than men, new figures reveal", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-21T16:31:00.000+02:00", "replies_count": 0, "uuid": "3ef4c2f36dd8837a0bf261ee90e82cbdbd634745"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/women-greggs-paid-22-less-14319426", "ord_in_thread": 0, "title": "Women at Greggs paid 22% less than men, new figures reveal", "locations": [], "entities": {"persons": [{"name": "greggs", "sentiment": "neutral"}, {"name": "roger whiteside", "sentiment": "none"}], "locations": [{"name": "quorum business park", "sentiment": "none"}, {"name": "newcastle city centre", "sentiment": "none"}, {"name": "neville street", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Women at Greggs paid 22% less than men, new figures reveal The bakery giant said men hold more senior positions than women, which has caused the difference in pay Share Greggs on Neville Street, Newcastle City Centre (Image: Newcastle Chronicle) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nWomen working at bakery giant Greggs are paid on average 21.7% lower than their male colleagues, according to official figures. \nThe company, which is headquartered at Newcastle’s Quorum Business Park, claimed that the reason for the pay difference was not due to women being paid less to do the same job, but was instead caused by the “structure of its workforce”. \nPart of the reason for the pay difference is because Greggs employs far more women than men in its branches and front line operations, which are often its lower paid roles. Around 73% of staff in its lowest paid positions are women. \nHowever, Greggs’ chief executive Roger Whiteside admitted that a pay gap is present within the highest pay quartile of the company, where women are paid on average 16% less than men. Roger Whiteside (Image: Newcastle Chronicle) \nDespite the number of men and women in the top quartile being roughly equal, men make up 60% of the firm’s top management grades. \nThe lack of women in senior roles has also led to the average bonus paid to women being on average 53.9% lower than that paid to men. However, the number of women eligible for a bonus is five per cent higher than the number of eligible men. \nMr Whiteside said: “We are committed to reducing our gender pay gap and continue to support the development of all our colleagues and in particular our talented female colleagues into senior management roles. We are already working on this and at board level we have exceeded Government guidelines with 43% of our board being women. Read More Sage CEO says firm is '12 to 18 months ahead of competition' at big event on Tyneside \n“Board composition is easier to address because non-executive appointments are governed by tenure guidelines creating a constant cycle of new recruitment. \n“Opportunities to increase female representation at the most senior executive management grades are less frequent, as they necessarily depend on vacancies becoming available within that team and historically, turnover at senior management level has been low. \n“Nevertheless we are making progress and have recently increased female representation at the most senior management grade, now accounting for 25% of direct reports to the CEO. As a member of the Women’s Business Council, we are committed to investing in several programmes to develop female leaders at Greggs, focusing on support for female career development and flexible working as a key enabler.” Read More Barratt could switch production from Germany to UK in Brexit contingency move \nAll UK companies with more than 250 employees must publish their gender pay gap by April 2018 as part of efforts to close the divide between the sexes. \nIn January Virgin Money was found to have the highest pay gap in the region, with women paid an average of 32.5% less than men. Technology giant Sage’s UK operations had a smaller pay gap, coming in at 4.5%. Like us on Facebook", "external_links": [], "published": "2018-02-21T16:31:00.000+02:00", "crawled": "2018-02-21T21:01:28.029+02:00", "highlightTitle": ""}