{"organizations": [], "uuid": "a95ce5b78ab25ed24dabd733a712eca13338b642", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14236194.ece/ALTERNATES/s1200/JS135364780.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14236208", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: iPhone sales fall but Apple still reports record profits", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-02T10:00:00.000+02:00", "replies_count": 0, "uuid": "a95ce5b78ab25ed24dabd733a712eca13338b642"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14236208", "ord_in_thread": 0, "title": "Business Breakfast LIVE: iPhone sales fall but Apple still reports record profits", "locations": [], "entities": {"persons": [{"name": "liam fox", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "downing street", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "apple", "sentiment": "negative"}, {"name": "fox  international t", "sentiment": "neutral"}, {"name": "financial times", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "\nMike Ashley has became the single biggest shareholder of five-a-side football company Goals Soccer Centres . \nThe Newcastle United owner increased his stake in the company on Tuesday, January 30, when he used Sports Direct International to purchase an additional one million shares in Goals Plc. \nBased on Goals’ share price it is estimated that Sports Direct spent around £715,000 to acquire the additional shares. \nSports Direct increased the number of shares it owns in Goals from around 13.2 million to 14.2 million. \nThe deal means that Sports Direct now owns 18.92% of the shares in Goals, making it the company’s biggest single shareholder and surpassing Harwood Capital, which owns around 18.61%. \nGoals has 46 sites around the UK, including centres in Newcastle, Sunderland and Middlesbrough, and it has also opened two centres in California and is looking to expand its growth in North America. Sports Direct founder Mike Ashley (Image: Joe Giddens/PA Wire) 8:50 Jonathon Manning Utilitywise sees debt figures fall \nNorth East energy consultancy firm Utilitywise has seen its net debt fall at the half-year mark. \nThe company, which was forced to delay publication of its annual results after its auditor requested an independent review of its contracts and accounts, said its net debt at January 31 2018 was £15m. \nThe figure represents a £4m reduction in the firm’s net borrowing since July 2017. \nUtilitywise provided a breakdown of its debt, which consists of £11.9m of bank borrowings and £3.1m of other loans. The latter figure is due to be repaid by 2022. Utilitywise CEO, Brendan Flattery Jonathon Manning New Metro fleet to come under spotlight at Journal transport breakfast \nThe future of the Tyne and Wear Metro system will come under the spotlight at an event being organised by The Journal later this year. \nThe business breakfast on March 1 will see leaders from key organisations in the North East examining the state of transport infrastructure in the region as well as plans for future improvements. \nThere will also be a keynote speech from Nexus managing director Tobyn Hughes on the new Metro fleet and what it will mean for the North East. \nBusinesses from around the North East joined Nexus in lobbying the Government for funding for a new Metro fleet, with the campaign winning success last year when a £337m funding package was announced by Chancellor Philip Hammond in the Budget. \nThe new Metros are due to come into service in 2021 and will replace 40-year-old carriages that have become increasingly unreliable. \nJournal business editor Graeme Whitfield said: \nSecuring funding for the new Metro fleet was probably the main demand from the North East business community last year. Companies around the region know how crucial it is, not least because their staff are often inconvenienced when the trains we currently have break down. \nWe’re looking forward to hearing from Tobyn on the difference that the new fleet will make, and the potential for new Metro and local rail routes in parts of the region that aren’t currently served. \nThe transport breakfast was arranged after a poll of North East business leaders showed that transport infrastructure was the main priority for the business community. \nMore details, as well as table and ticket reservations, are available from event manager Jennifer Lee on 0191 201 6168 or by emailing jennifer.lee@trinitymirror.com . \nThe event is being sponsored by Newcastle International Airport, Stagecoach North East and Northern Rail. Nexus managing director Tobyn Hughes (Image: Nexus) 8:40 Jonathon Manning Amazon boss puts sales rise down to success of virtual assistant Alexa \nAmazon sales increased by 38% in the last three months of 2017, to more than $60.5bn (£42.4bn), as the technology giant reported its latest quarterly financial results.The US firm also reported a 69% increase in operating income, rising to $2.1bn (£1.47bn) compared with $1.3bn (£910m) for the same period last year.The figures were just above analyst expectations for the company’s performance.Having started life as an online shopping platform, the firm has become increasingly known for its technology hardware and software - most notably its Amazon Echo line of smart speakers, which are powered by virtual assistant Alexa.Amazon founder and chief executive Jeff Bezos said the rise of of the company’s Alexa products was a key factor in the company’s continued growth. \nHe said: \nOur 2017 projections for Alexa were very optimistic, and we far exceeded them. We don’t see positive surprises of this magnitude very often - expect us to double down. \nWe’ve reached an important point where other companies and developers are accelerating adoption of Alexa. \nThere are now over 30,000 skills from outside developers, customers can control more than 4,000 smart home devices from 1,200 unique brands with Alexa, and we’re seeing strong response to our new far-field voice kit for manufacturers. \nMuch more to come and a huge thank you to our customers and partners. Amazon Echo Dot KEY EVENT Northern Bear says it has not suffered from Carillion, but industry could still face harm \nNewcastle construction firm Northern Bear Plc has said that it has not been impacted by the collapse of outsourcing giant Carillion, but warned it is still unclear how the wider industry will be affected. \nThe collapse of Carillion led to building projects across the UK grinding to a halt, with workers unable to access the site. One such project where building work ceased was the Vaux Brewery development in Sunderland. \nA statement Northern Bear said: \nThe Board notes the announcement made by Carillion plc on 15 January 2018, stating that it was entering into compulsory liquidation with immediate effect. \nWhilst the Group has occasionally traded with companies within the Carillion plc group, there has been no material direct impact on the Group’s results arising from the liquidation. \nAs a Board, we are of the opinion that the full impact of the liquidation on the wider industry in which the Group operates will only become clear over the medium term. Should we become aware of any material indirect impact on the Group’s results we will, of course, update shareholders further. \nThe comments come as Northern Bear revealed it was expecting to publish strong financial results for the last six months, despite poor weather in January. Northern Bear's headquarters in Prestwick Park, Newcastle 8:30 Jonathon Manning Mother who quit job to launch baby yoga business poised to go nationwide \nA mother who quit her retail career to launch baby yoga classes is on the verge of rolling out her venture across the UK, after soaring demand. \nRebecca Riley launched Sunderland-based Kalma Baby four years ago, after giving up her retail management role to raise her first child. \nMrs Riley spotted a gap in the market for mother and baby yoga classes after looking around for baby groups which could help her son Tyler, who was born prematurely, at 30 weeks. \nYoga is now increasingly recognised as an alternative therapy for common ailments among babies and children such as colic and constipation, so Mrs Riley believes she picked the perfect time to launch her venture. \nShe trained as a baby yoga instructor and has since built up a network of 14 franchisees across the North East, from north Northumberland to Darlington, and further expansion is now planned. \nOver the next year, Kalma Baby franchises will start in several locations throughout Yorkshire, and discussions are under way to take the business into London. \nThe company runs baby, toddler and junior yoga groups, baby developmental massage classes and yoga classes for pre and postnatal mothers. \nIt also works closely with 25 North East schools, offering classes with themes such as anti-bullying, designed to ease anxiety and stress among pupils. \nFor older children and young adults, yoga can reduce stress and anxiety and also help to manage long-term conditions including cerebral palsy and ADHD. \nShe said: \nWhen children come along there is often a necessity for mums to work flexibly, especially given the astronomical cost of childcare. \nThey can miss out on lots of things with their children if they work nine-to-five, and therefore there is huge demand for career opportunities like ours. Of course, we have strict criteria for franchisees, while we also give them a lot of support, including ongoing yoga and marketing training. \nBaby and young people’s yoga is growing immensely around the world, as evidence of its healing, health-boosting and relaxing powers increases. Through our ongoing expansion, we hope to help many more parents and children experience yoga’s many benefits in 2018. Left: Rebecca Riley of Kalma Baby and Jamie Ollivere of RTC with (front) Laura Horsley and daughter Ava (Image: Kalma Baby) 8:25 KEY EVENT Britain cannot be in a customs union with the EU post-Brexit, says Dr Fox \nInternational Trade Secretary Liam Fox has said that Britain cannot be involved in any customs union with the EU following Brexit.His comments came as Prime Minister Theresa May insisted that it was not necessary to choose between the alternatives of frictionless trade with Europe and the ability to strike new deals elsewhere in the world.And she appeared to leave the door open to some form of customs agreement when pressed on the issue during her visit to China.Asked on Sky News whether the £9bn of deals struck during the three-day trip showed it was possible to stay closely aligned with the EU and its customs union while still increasing trade with countries like China, the PM replied: \nWhat I want to do is ensure that we have got the best possible trade arrangements with China and with other countries around the world once we have left the European Union. I do want to do those free trade agreements. \nDowning Street has rejected a report in the Financial Times that ministers are privately considering a customs union arrangement for post-Brexit trade in goods in order to avoid disruption to exports - something which Brexiteers believe would hamstring efforts to strike free trade agreements with global giants such as the US and China.Speaking in Shanghai on the last day of her China trip, Mrs May suggested that it would not be necessary to choose between the two, telling the BBC: \nI don’t believe that those are the alternatives. \nWhat the British people voted for is for us to take back control of our money, our borders and our laws and that’s exactly what we are going to do. \nWe also want to ensure that we can trade across borders. \nMrs May has repeatedly said that Brexit will mean leaving the existing EU single market and customs union arrangements. The customs union currently frees members from tariffs when trading with one another but requires them to observe a common external tariff regime and not to strike deals with third countries.In an interview in Shanghai with Bloomberg TV, Dr Fox indicated that the UK was also ruling out entering into any other customs union arrangement with the remaining EU27. \nHe said: \nIt is very difficult to see how being in a customs union is compatible with having an independent trade policy because we would therefore be dependent on what the EU negotiated in terms of its trading policies and we’d be following behind that. \nWe have to be outside of that to take advantage of those growing markets. \nOne of the reasons we are leaving the European Union is to take control and that’s not possible with a common external tariff. \nThe Prime Minister said her goal in upcoming talks on the future relationship with Europe was “an arrangement for trading with the EU which is going to be good for trade between the UK and EU and good for jobs in Britain”.She told the BBC: \nIt means a free trade agreement with the EU. We are now starting to negotiate that free trade agreement with the EU. We want that to enable trade to take place on as frictionless and tariff free a basis as possible across our borders, but we also want to be signing trade deals in the rest of the world, like here in China. A European Union flag in front of Elizabeth Tower. (Image: Daniel Leal-Olivas/PA Wire) 8:20 Jonathon Manning Irn-Bru maker says low-sugar drink has gone down will with customers \nIrn-Bru maker AG Barr has insisted the response to its new low-sugar recipe for the popular Scottish fizzy drink has been “encouraging” as it toasted a surge in annual group sales.The firm, which also makes Rubicon and Tizer, admitted it was still “early days” after stopping making the original full-sugar version in early January - a move which prompted a backlash among loyal Irn-Bru fans.But it added: \nOur extensive research and testing in the preceding years gave us confidence that we had an excellent taste match and, whilst it is still early days, the consumer response to the new product has so far been encouraging. Irn Bru ", "external_links": [], "published": "2018-02-02T10:00:00.000+02:00", "crawled": "2018-02-02T10:34:07.004+02:00", "highlightTitle": ""}