{"organizations": [], "uuid": "d64b9c19e2b8116527b615edd9806e6767da0a59", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14291265.ece/ALTERNATES/s1200/borisj.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/boris-johnson-calls-brexit-unity-14291339", "country": "GB", "domain_rank": 21960, "title": "Boris Johnson calls for Brexit unity - then hints he'll resign if he doesn't get what he wants", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-14T19:32:00.000+02:00", "replies_count": 0, "uuid": "d64b9c19e2b8116527b615edd9806e6767da0a59"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/boris-johnson-calls-brexit-unity-14291339", "ord_in_thread": 0, "title": "Boris Johnson calls for Brexit unity - then hints he'll resign if he doesn't get what he wants", "locations": [], "entities": {"persons": [{"name": "boris johnson", "sentiment": "negative"}, {"name": "brexit", "sentiment": "negative"}, {"name": "johnson", "sentiment": "none"}, {"name": "philip hammond", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "world economic forum", "sentiment": "none"}, {"name": "cabinet", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Boris Johnson delivers his Brexit speech Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nBoris Johnson held out an olive branch to opponents of Brexit as he insisted victorious Brexiteers must “reach out to those who still have anxieties”. \nHe delivered a speech urging the country to “unite about what we all believe in – an outward-looking liberal global future for a confident United Kingdom.” \nBut although it was billed as an attempt to mend divisions, the speech also appeared to be a warning to people, possibly including Cabinet colleagues, who are calling for a so-called “soft Brexit”. \nMr Johnson said i t would be “mad” to end up with a Brexit settlement that meant the UK continued obeying EU rules - something that would be probably required if the UK remained a member of the single market or customs union, or negotiated a new settlement similar to full membership. \nHis vision of Brexit appeared incompatible with the one set out by Chancellor Philip Hammond, who told the World Economic Forum in Davos in January that he wanted “very modest” changes to the UK’s relationship with the EU. British Chancellor of the Exchequer Philip Hammond (Image: Getty Images Europe) \nMr Johnson’s speech, delivered at the London premises of think tank Policy Exchange, was the first of six about Brexit being delivered by senior members of the Government, including two from Prime Minister Theresa May. \nIt failed to win over MPs sceptical about Brexit. Catherine McKinnell, Labour MP for Newcastle upon Tyne North, said: “The very last thing we needed was yet another vague speech about Brexit and yet more grand, but totally unsubstantiated, claims about the opportunities it will bring. Read More Labour government would label meat from animals which haven't been stunned \n“People and businesses across the country want some answers to really important questions about what leaving the EU will mean in practice, so they can start to actually plan for this – whether that’s in relation to their individual rights, or how local firms will be able to trade freely with what is the North East’s largest market; trade which currently supports many thousands of jobs. \n“It’s just not good enough – almost twenty months on from the referendum – to be no clearer now as to what the Government actually wants from the final Brexit deal, something Boris Johnson must take responsibility for as one of the main campaigners for leaving the EU. British Labour Party politician Catherine McKinnell (Image: Newcastle Chronicle) \n“Yet again, the future of our country and people’s livelihoods are playing second fiddle to internal battles within the Conservative Party.” \nConservative MP Anna Soubry, also a Brexit-sceptic, said on Twitter; “Boris Johnson fails to understand the very real concerns of British business far from reaching out it will drive many to deeper despair. \n“He argued for a hard Brexit which British business doesn’t want and for which there’s no majority in the country nor Parliament.” Read More 'How did you get Down's Syndrome?' Seven shocking examples of assessors' questions during PIP tests \nMr Johnson declined to rule out resigning from the Cabinet if he didn’t get his way, as he took questions from journalists. \nHe said “We are all very lucky to serve and I’m certainly one of those,” he said. \nSetting out his approach, Mr Johnson said: “We would be mad to go through this process of extrication from the EU and not to take advantage of the economic freedoms it will bring.” \nBy leaving the EU “we will be able, if we so choose, to fish our own fish, to ban the traffic in live animals and payments to some of the richest landowners in Britain”. \nThere would be freedom to cut VAT on fuel, and “simplify planning and speed up public procurement”. EU and Union flags (Image: PA) \nMr Johnson said the issue was about “who decides” and “it may very well make sense” to remain in alignment with EU standards on some products - but that commitment should not be written in to the Brexit deal. \n“I don’t think we should necessarily commit, as a matter of treaty, that forever and a day we are going to remain locked into permanent congruence with the EU,” he said. \nBrexit Secretary David Davis, International Trade Secretary Liam Fox and Mrs May’s deputy David Lidington are expected to speak in the coming weeks. \nIt follows criticism of the Prime Minister for failing to spell out Britain’s Brexit aims. \nThe Chancellor, who is not on the list of set piece speeches, is on a tour of European capitals aimed at building business and political ties. Like us on Facebook", "external_links": [], "published": "2018-02-14T19:32:00.000+02:00", "crawled": "2018-02-14T20:00:30.007+02:00", "highlightTitle": ""}