{"organizations": [], "uuid": "e93f6f59f8bb9dac7b477a27e8a9286c533e8048", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13252107.ece/ALTERNATES/s1200/Chelsea-v-Hull-City-Premier-League.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14287090", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Sky retains majority of Premier League Football", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-14T10:30:00.000+02:00", "replies_count": 0, "uuid": "e93f6f59f8bb9dac7b477a27e8a9286c533e8048"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14287090", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Sky retains majority of Premier League Football", "locations": [], "entities": {"persons": [{"name": "akzonobel", "sentiment": "none"}, {"name": "berry", "sentiment": "none"}, {"name": "jake berry", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "ashington", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "northern powerhouse", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KEY EVENT North East manufacturing should be 'at the heart' of Brexit talks, says Northern Powerhouse minister \nThe Government’s Northern Powerhouse minister has said keeping high quality manufacturing jobs in the North East should be at the “heart of Brexit negotiations”, while playing down fears that leaving the EU could see major Japanese employers quit the region. \nJake Berry, minister for the Northern Powerhouse and Local Growth, praised the region’s strong manufacturing heritage and said Brexit talks should focus on keeping jobs and businesses in the North East. \nMr Berry said: \nIt is too early to say what any trade deal will look like but from a Northern Powerhouse point of view keeping our high quality manufacturing is hugely important to growing a strong economy in the North of England. \nOne of the interesting things is that while there are challenges around Brexit there is a huge opportunity to create trade new trade opportunities around the world. \nHis comments where made during a visit to AkzoNobel’s new paint factory in Ashington, Northumberland. \nThe £100m facility, which produced Dulux branded paints, became the largest single investment ever made by the paint and coatings firm when it opened in September 2017. \nThe company employs 150 people in Ashington and supports more than 100 roles in the local supply chain. Minister for the Northern Powerhouse and Local Growth, Jake Berry MP tries his hand at some decorating in the new Dulux Academy at AkzoNobel Ashington (Image: Unknown) 9:15 Serco slashers price for Carillion healthcare contracts deal Defaced branding is seen outside Carillion's Royal Liverpool Hospital site (Image: Getty Images Europe) 9:10 KEY EVENT Irresponsible body contouring ad banned \nAn advert for a body contouring treatment has been banned for suggesting that slim people would benefit from weight loss and trivialising the procedure.The press ad for ABC Lasers, seen in Aesthetics Journal’s September 2017 edition, showed the lower half of a woman wearing briefs and pinching some flesh from her stomach and text stating: \nIf you can pinch it, we can treat it. \nFurther text alongside the image of a clock stated: \n20 minute body contouring. \nA reader, who believed the ad implied that the model needed to undergo body contouring despite being slim, complained that it was irresponsible.The Advertising Standards Authority (ASA) also challenged whether the “If you can pinch it, we can treat it” claim and the emphasis on speed trivialised the decision to undergo body contouring.ABC Lasers said the ad would be changed before they published it again.Aesthetics Journal said the publication was for healthcare professionals and other staff and industry representatives, and therefore would not put pressure on individuals to feel they needed to undergo body contouring.The ASA said it was a concern if medical professionals passed on to consumers the impression that body contouring could benefit people who were slim or that the decision to undergo the procedure was one that could be made quickly.It said: \nWe considered the photograph, which showed the model’s pronounced hip bone and her briefs gaping away from her body because of the bone’s prominence, suggested that she was particularly slim. \nWe considered the image nevertheless suggested, because she was able to pinch flesh from her tummy between her thumb and forefinger, along with the text ‘If you can pinch it, we can treat it’, that she would still benefit from body contouring. \nWe considered that the message that such slim people would benefit from weight loss treatment and the targeting of the ad towards those who were already slim was irresponsible. \nIt ruled that the ad must not appear again, adding: \nWe told ABC Lasers to ensure their ads did not suggest that particularly slim people could benefit from body contouring or that the decision to undergo body contouring was one that could be taken lightly. This advert has been banned by the Advertising Standards Authority 9:05 KEY EVENT Hargreaves Services sees turnover fall by £20m at half-year \nHargreaves Services Plc has slipped into the red after its turnover slipped by £20m at the half-year. \nTurnover at the Durham-based mining and bulk material logistics firm fell from £170.9m to £150.3m for the six months leading up to November 2017. \nAs a result the firm made an operating loss of £2.7m. \nSpeaking in the accounts chairman David Morgan said: \nUnderlying trading in the first half was in line with management expectations. Revenue was £150.3m (2016: £170.9m). The reduction is primarily due to the inclusion of £10.2m of legacy asset sales in 2016, whereas only £0.4m of such sales arose in the current period. \nAdditionally, the first half of the year saw a reduction of £6.3m in revenue on three legacy contracts in specialist earthworks. \nHe added: \nThe Group’s operational focus on delivering consistent performance with an emphasis on risk management and margin improvement is beginning to bear fruit. \nProgress on the key strategic objective of realising value from the Group’s Property and Energy assets has continued with further significant news, particularly in respect of the Energy portfolio, expected in the next few months. The Group has a strong balance sheet to support its strategy and the Board remains confident that there is substantial shareholder value to be realised. Hargreaves Services Jonathon Manning GKN to pay £2.5bn to shareholders \nAutomotive and aerospace firm GKN has confirmed plans for a £2.5bn cash payout to shareholders over the next three years as it continues to fight off a hostile takeover bid by Melrose. \nIt said a significant part of the cash will come from divestments over the first 12 to 18 months, and will include the sale of its Powder Metallurgy business. The company is also introducing a dividend policy aiming to pay out 50% of its free cash flow between 2018 and 2020. \nGKN chief executive Anne Stevens said: \nThe new strategy brings clarity, accountability and focus to GKN’s world class businesses and will allow the group to attain world class financial performance. \nGKN has great technologies and great people. We have strong market positions and have delivered good growth, with management revenues last year of over £10 billion. But too often we pursued growth at the expense of returns, this will no longer be the case. \nThe new strategy brings discipline, both financial and operational. \nThis strategy is expected to generate significant cash for shareholders in the short term and meaningful sustainable cash flows over the mid to long term. \nWe expect to deliver £340m of recurring annual cash benefit from the end of 2020 and are targeting a return of up to £2.5bn to our shareholders over the next three years, with a significant part expected to come from divestments executed within the first 12-18 months. \nWe have a plan and we are dedicated to delivering it. GKN", "external_links": [], "published": "2018-02-14T10:30:00.000+02:00", "crawled": "2018-02-14T12:08:31.013+02:00", "highlightTitle": ""}