{"organizations": [], "uuid": "c7702fe504a5dcc3b99921d299fa7ef38d5f2581", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article1258647.ece/ALTERNATES/s1200/28578385JPG.jpg", "site_section": "", "section_title": "", "url": "https://www.leicestermercury.co.uk/news/business/meet-demolition-man-who-reduced-1258616", "country": "GB", "domain_rank": 48128, "title": "Meet the demolition man who reduced Belgrave flyover to rubble - and misses our industrial past - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.995, "site_type": "news", "published": "2018-02-24T12:54:00.000+02:00", "replies_count": 0, "uuid": "c7702fe504a5dcc3b99921d299fa7ef38d5f2581"}, "author": "Justine Halifax", "url": "https://www.leicestermercury.co.uk/news/business/meet-demolition-man-who-reduced-1258616", "ord_in_thread": 0, "title": "Meet the demolition man who reduced Belgrave flyover to rubble - and misses our industrial past - Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "richard dolman", "sentiment": "none"}, {"name": "justine halifax", "sentiment": "none"}, {"name": "andrew thompson", "sentiment": "none"}, {"name": "richard", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "desford", "sentiment": "none"}, {"name": "carlton", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "market bosworth", "sentiment": "none"}], "organizations": [{"name": "leicester mercury get business", "sentiment": "negative"}, {"name": "ar demolition", "sentiment": "none"}, {"name": "british union shoe machinery", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get Business updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nRichard Dolman’s is an inspirational story for budding entrepreneurs, writes Justine Halifax. \nThe 44-year-old is the managing director of family-run AR Demolition in Carlton, near Market Bosworth, the business he co-owns with his 46-year-old cousin Andrew Thompson. \nRichard has built the successful company up from scratch over the last decade. \nAfter the business was launched in 2007, its turnover was £1 million. \nThat now stands at more than £18.5 million, and its employee tally has risen from two to 105. \nThe company can also boast an impressive portfolio of high profile projects, both in Leicester and across the UK, including London. Sitting pretty - Richard Dolman of AR Demolition \nThese include demolishing the Belgrave Flyover and the British Union Shoe Machinery factory, which once stood nearby. \nThe team was also involved in demolishing the former TI Tubes site in Desford almost a decade ago. \nBut, for Richard, the highlight for the firm and “a real pivotal moment” was its involvement in the £500 million King’s Cross Station ticket concourse development, which opened in 2012. \nWhat makes the company’s success all the more remarkable is that AR Demolition was launched just as Britain entered the financial crisis of 2007-2008. Phase 2 of the demolition of the Belgrave Flyover begins (Image: Mike Sewell) \nSo how did it survive and achieve success while others fell by the wayside? \nIt was down to a combination of establishing firm roots and not living beyond its business means, and a philosophy of being up front and honest at all times. \nIn fact, the recession coincided with the company’s most rapid growth. \nYet the foundations for AR Demolition were laid by Richard’s disappointing experience in the workplace. \nHe left school at 16 and became an apprentice restoring vehicles such as old Jaguars. What goes up must come down: Belgrave Flyover was erected in 1973 \nBut he was left “uninspired” when his boss said he’d “probably always be a mechanic” if he stayed with the firm. \nSo when a friend with a JCB digger suggested Richard followed suit, it set the ball in motion. \n“At first I saw it as a joke, but then I mentioned it to my dad and he said he’d help me if I wanted to give it a go,” recalled Richard. \n“But dad said he wouldn’t just give me the money, I‘d have to pay it back with interest, and added that he wouldn’t bail me out if I got into trouble. \n“I was only 20 and he scared the living daylights out of me.” Belgrave Flyover going up \nRichard took a loan out against his parents’ house, then bought his own JCB. \nAfter a few years doing general hire work, he got his first demolition job pulling down a fuel station. \nSoon Richard asked Andrew to join forces with him and AR Demolition was born. \n“I’d like to say our success is down to integrity, and that’s a big part of it, but it’s not the secret,” Richard said. \n“As we were 100 per cent self-taught in demolition we accidentally ended up doing things differently to anyone else. \n“Instead of treating a job as a ‘let battle commence’ scenario like other contractors were doing, adding in extra charges wherever possible, we were the opposite, and customers liked that approach, coupled with the fact that we took on all aspects of the fallout of the job rather than contracting out.” End of an era for Belgrave Flyover (Image: Alex Hannam) \nSome sound financial advice from Richard’s dad has also helped in building up the business. \nRichard said: “I remember doubling my money on one job and saying to my dad, ‘I’m going to buy another JCB digger’. \n“But he told me not to do anything until I’d paid the first one off and got a backbone for the business. \n“And that mentality has always stuck with me as I’ve always reinvested in the business and machinery.” Read More \nLast year alone, Richard put £1.5 million back into the company. \nHe also plans to develop and run his own apprenticeship scheme in the next two years. \nRichard said: “I want to encourage people in the industry with future careers. \n“I’d like to get a gradual stream of apprenticeships across the business – not just people to operate machinery but also surveying, engineering, accounts... \n“I may have an eye on growth, but it’s not part of my main criteria. \n“For me it’s about trying to maintain a sustainable growth rather than a turnover growth. Read More Why destroy this Leicester industrial heritage? \n“Most people gauge success by wealth. \n“And, don’t get me wrong, I’d like the nice car and the nice house, but success for me is when you get a group of people in a boardroom who need something doing but are not sure how to go about it, and someone says ‘We’ll get AR Demolition in and they’ll deal with it all’. \n“For me I think if you concentrate on wealth you can go the wrong way, but if you do the right thing I believe wealth will follow.” \nBut while demolishing old factories is commonplace for the firm, the work is tinged with sadness for him. \n“Leicester is a great hub of education,” said Richard. Richard Dolman \"Most demolition projects I’m involved with are pulling down factories and that makes me really sad\" \n“But I wish there was more encouragement of industry – and it’s not fair to pin it just on Leicester, it’s a problem everywhere. \n“I wish industry would be encouraged on all levels. I love industry, and heavy industry, but nobody wants it or encourages it, yet, ultimately, we need it. \n“But most demolition projects I’m involved with is pulling down factories and that makes me really sad. Industry is fabulous and it should be prized.” \nHe said AR Demolition is also called in to help with emergencies, like fires and gas explosions, which are “often difficult and emotional to deal with”. \nIn one incident it was called in to clean up after a kebab shop exploded in Braunstone Gate – when his team were shocked to discover a dead body in the rubble. \nIn another, in the aftermath of a gas explosion in Birstall, they worked with residents who had lost homes, possessions and even loved ones. \nLooking to the future of the business, Leicester and the UK, Richard revealed he voted with the majority for Brexit. \nBut he said it was only after doing his own research and not rooted in numerous political claims. Bringing down the Belgrave Flyover was a huge job for AR Demolition (Image: Mike Sewell) \nAs well as studying the impact it could have on his industry, he admitted that, while it sounds a little strange, the UK’s overwhelming population of bats also played a key part in his decision. \nRichard said: “The one thing that delays almost everyone of my projects is the presence of bats and a huge expense is spent on protecting them – I’m talking thousands per project, and therefore, probably millions as a nation. \n“I’m not against protecting them but I asked an ecologist on one project why we had to protect the bats so much. His initial reply was that they were endangered. \n“But when I said, ‘they can’t be that endangered – they are on every project I do’, he admitted there were too many bats in the UK. \n“But as Europe hadn’t got as many – because they didn’t follow the rules on protecting them – he said, to keep up the European population, the UK had to look after all its bats. \n“If the European Union couldn’t uphold a law to look after the shortage of bats, I thought how the hell can I rely on them to make a sensible decision? AR Demolition recently brought down the Moorlands Stadium in Derby \nRichard, like the majority of the country, voted in the referendum to leave the European Union. \nHe said: “Have we done the right thing with Brexit? I don’t know, and I don’t know what it’s going to do to the economy. \n“But my business grew at its biggest rate during the recession of 2007-2008. So I think we need to look at the positives rather than fixating on the negatives. \n“When it comes to business I’m a simple creature. Read More Belgrave Gate revamp: Pictures of how £2m vision will look \n“We’ve got a lot of marvellous things to sell, like Land Rovers and Jaguars, and I don’t think people, regardless of where they live, will stop buying them, unless they can get the same, or an improved product, and a better price elsewhere. \n“I buy lots of machinery from Germany, and elsewhere in Europe, and I won’t stop buying it from them, unless someone else makes anything better. \n“Will we stop buying French wine, or German cars? No. \n“People talk us down, but we are growing and we have the best engineers in the world. And I think we’ll still have that success going forward. We’ve made our decision as a country, so people should grasp it and get on with it.” \nRunning a multi-million pound venture leaves little spare time for Richard and Andrew. \nBut when they do get some, they relax by getting behind the wheel of the 1912 McLaren traction engine they’re restoring. \nIf you frequent the pubs in the Market Bosworth area, you might see it parked up outside. Read More Mayor Peter Soulsby praised for 'reclaiming Leicester from traffic' - but has he? \nHe is also spending one day a week at Wolverhampton University studying for a degree he helped create at foundation and BA level. \nIt’s given him a welcome chance to help influence the designers of tomorrow to right the wrongs he sees being made in modern housing construction. Read More Readers solve park plinth puzzle \n“If I was to demolish a Tudor house I could recycle 99 per cent of it. \n“But I would struggle to recycle more than 60 per cent of a modern house. So something’s gone wrong there for me. \n“They may run on a thimble of energy and be efficient but it’s not sustainable development in the sense that at the end of a short life span it can’t all be recycled and would therefore end up in landfill.” Like us on Facebook ", "external_links": [], "published": "2018-02-24T12:54:00.000+02:00", "crawled": "2018-02-24T13:07:16.004+02:00", "highlightTitle": ""}