{"organizations": [], "uuid": "16b5a399441e9ed880f051c8de0f5e9e8568529a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article1263491.ece/ALTERNATES/s1200/SWNS_LEICESTER_EXPLOSION26-22.jpg", "site_section": "", "section_title": "", "url": "https://www.leicestermercury.co.uk/news/leicester-news/explosion-leicester-1262788", "country": "GB", "domain_rank": 48128, "title": "Leicester explosion: Four dead after explosion in Hinckley Road - updates - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.535, "site_type": "news", "published": "2018-02-26T14:26:00.000+02:00", "replies_count": 0, "uuid": "16b5a399441e9ed880f051c8de0f5e9e8568529a"}, "author": "Linda Steelyard", "url": "https://www.leicestermercury.co.uk/news/leicester-news/explosion-leicester-1262788", "ord_in_thread": 0, "title": "Leicester explosion: Four dead after explosion in Hinckley Road - updates - Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "helen knott", "sentiment": "none"}], "locations": [{"name": "hinckley road", "sentiment": "none"}, {"name": "leicester mercury 'leicester", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}], "organizations": [{"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KEY EVENT Public meeting to be held tonight \nThe emergency services and Leicester City Council are holding a public meeting for residents and businesses this evening following the explosion and fire in Hinckley Road last night. \nA statement released by Leicestershire Police said: “The purpose of the meeting is to inform residents about how the various agencies are responding to the incident in Hinckley Road – in which five people lost their lives - and to provide support and advice and information to people living and working near the scene of the explosion.” \nThe meeting is being held at Dovelands School, in Hinckley Road, and starts at 7.15pm. \nMore information to follow. 15:54 Flowers left at scene \nOur reporter at the scene, Ciaran Fagan, sent over this photo from the scene in Hinckley Road. \nIt shows flowers left near the scene of the explosion, just before the police cordon. \nThe identities of the victims have not yet been confirmed. Flowers at the scene of Hinckley Road explosion 15:26 \nPolice in the West End of Leicester have tweeted out thanks following the explosion. \nWestcotes Cops has thanked members of the community who helped following the blast. \nThey have also thanked everyone who kept the emergency services warm with offers of hot drinks. 15:24 Road remains closed \nHinckley Road remains closed as emergency services continue to deal with the aftermath of the explosion. \nEarlier today, Leicestershire Police couldn’t say how long the road will be closed for. 15:02 Praise for fire response \nA Leicester firefighter has said the reaction of his organisation to the explosion has made him proud. \nAndrew Brodie, assistant chief fire officer at Leicestershire Fire and Rescue Service, tweeted this afternoon after receiving praise from Leicester MP Liz Kendall. \nHe said: “Just off the phone to @ leicesterliz MP who passed on her heartfelt thanks and admiration for the @ LeicsFireRescue response to Hinckley Road. “Some days make you even prouder than normal to be part of such a fantastic organisation and sector. Today is one of those days.” 14:55 'Uncertainty' in Polish community \nThere is uncertainty in the Polish community following the explosion, which destroyed a Polish shop. \nBarbara Czyznikowska, chair of Project Polska in Leicester, said: “There’s uncertainty within the community. This is an explosion, we don’t want to speculate, we don’t want to create any unnecessary drama. \n“We are just keeping our eyes on it closely.” \nShe added that as far as she was aware no one from the Polish community had been reported missing. \nRead more here: https://www.leicestermercury.co.uk/news/leicester-news/chair-leicesters-project-polska-speaks-1265303 14:27 'No link to terrorism' emphasised again \nSuperintendent Shane O’Neill again reassured people that no link to terrorism has been discovered, as rumours to the contrary continue to circulate on social media. \n“Although the cause of the explosion is not yet known, there is no evidence that this is linked to terrorism,” he said. \nMeanwhile, the rescue work at the scene of the Polish shop in Hinckley Road has been temporarily suspended due to the structural integrity of a neighbouring building. \nThe search and rescue work will resume shortly. 14:24 Establishing cause of blast could take days \nMr Cane added: “It may be some days yet before we will be able to establish the probable cause of the explosion.” \nLeicester City Council has provided a temporary rest centre at St Anne’s Church, in Letchworth Road. \nA spokesperson for the police said: “The city council have experts on hand at the church to help those affected and anyone needing help or further information should make their way there.” 14:24 Search for missing people continues at blast site \nSuperintendent Shane O’Neill, of Leicestershire Police, said: “We know the explosion and subsequent fire will have caused considerable concern to residents and business owners in the area and we would like to thank people for their support and patience while teams continue with their work at the scene. \n“There are now five confirmed fatalities and a number of people still undergoing treatment in hospital. \n“The building consisted of a shop premises on the ground level and a two-storey flat above it. We believe there may be people who have not yet been accounted for and rescue efforts continue in order to locate any further casualties.” 14:19 Pockets of fire are still burning \nMatt Cane, group manager for Leicestershire Fire and Rescue Service, said: “Crews have worked through the night, alongside Police, East Midlands Ambulance Service and other partner agencies, tackling the fire and searching the scene in order to locate any further survivors or casualties. \nThere are still pockets of fire in the basement area of the building. We have a significant number of specialist search and rescue teams who are supported by two search dogs, and this level of resourcing is likely to be in place throughout the day.” 14:15 KEY EVENT Death toll rises - 5 confirmed dead \nVery sad news this afternoon. Five people are now known to have died, and five are in hospital. \nA spokesperson for Leicestershire Police said: “Sadly, in the last few hours, the number of people found dead in the collapsed building has risen to five.” \nHere is the full update. 13:21 Scene is being screened off with white sheets \nThe scene is now being screened off with large, white tarpaulins which are running the length of the road in front of the shops, between the outbound and inbound lanes, screening the site off from view. \nOur reporter at the scene, Ciaran Fagan, said: “It is quite a contrast to the scene last night. It is very quiet. \n“There’s a handful of members of the public and fewer emergency services vehicles. \n“Most notably absent are the ambulances that were here last night.” 13:15 Where in Leicester was the explosion? Aerial view of the scene of an explosion (Image: © SWNS.com) \nSome national news outlets have described the explosion as being in the ‘city centre’ but the site is actually slightly away from the main hub of Leicester. \nClick here to see exactly where the incident occurred. 13:14 'We heard a little boy crying and managed to pull him out' \nTony Hartley, who lives around 50 yards away from the blast site, told the Press Association: “Me and a friend lifted up a steel girder with about five other blokes and removed a bloke from underneath it. \n“We then turned round, saw rubble and heard a little boy crying. There was me and another bloke sifting through the rubble and we managed to pull the little boy out.” \nMr Hartley, 33, said the boy, thought to be aged between 10 and 13, was able to walk after being freed. \nLee Blankley, who lives in nearby Minehead Road, said his bed shook and “felt like it was going in the air” as the blast occurred. \n“Then I had a phone call straight away from a neighbour,” he said. “She was screaming. She had gone in shock. I ran down to the top of the street to see if I could help but there were already loads of people there.” 13:04 Crowdfunding page set up for victims \nA fundraising page has been launched for the victims of the Leicester explosion . \nRobyn Elms, who lives a few streets away from the site of the blast, has started the fundraiser hoping to raise at least £2,000. \nShe said on the page: “The local community have been shocked by this tragedy and on Sunday many people in the area tried to help as much as they could before the emergency services arrived. \n“I have decided to set up this Just Giving page to raise funds for the families of the victims of the Hinckley Road Explosion and also for the individuals who have been badly injured by the explosion and are currently being treated in hospital.” \nYou can find the full story, and details of the appeal, here. 12:48 KEY EVENT Aerial photos show shocking extent of damage \nThese shocking aerial pictures show the devastation caused by the blast. Just the side and rear walls of the building remain standing. The rest of the building is gone. 12:41 What we know so far \nHere’s the latest summary of what we know so far about the tragedy. 12:34 City flag lowered as mark of respect \nLeicester City Council has lowered its flag this morning following the explosion. \nThe council has announced that the flag above City Hall has been lowered to half mast as a mark of respect. \nOn Twitter, the council said: “We’ve lowered our flag above City Hall to half mast as a mark of respect for everyone affected by last night’s explosion in Hinckley Road, Leicester.” \nLeicestershire Police has confirmed that four people have been killed in the incident and four people remain in hospital, one in a serious condition. 12:26 'Leicester is a great city with an awesome community' \nTwitter users have praised the community spirit on show. \nHelen Knott posted: “You know what’s brilliant? Watching the Facebook safety check site and seeing all those lovely people offering rooms, baby supplies, food, transport and more to anyone affected by the Leicester explosion. \nLeicester is a great city with an awesome community.” 12:21 Facebook activates 'crisis response' function after tragedy \nFacebook has activated its crisis response function in the wake of last night’s tragedy. \nThis allows users in the area to let friends and family know they are safe after the blast, which has claimed at least four lives. \nResidents living near to the incident, in Hinckley Road, also used the Facebook page to offer food and drink to the emergency services. \nClothing, shelter, food and baby supplies were offered to the people forced to leave their homes, after the explosion and flames reduced a shop and flats above it to rubble. \nA Snapchat group is also said to have been set up to offer help to those affected and the teams involved in the emergency response. 12:07 Latest footage from the scene \nHere is the latest footage from the scene of the explosion. The area remains cordoned off and the road closed. Police have yet to indicate when the road will reopen. \nFor everything we know so far about the explosion, click here. 11:55 People scream in horror after blast - video \nThis footage shows the scene of the blast just minutes after the explosion. \nHuge flames can be seen licking above the roofline of neighbouring buildings, and people can be heard screaming in horror at what is unfolding before them. 11:48 'It's very sad' \nThere was sympathy for the victims of the blast at Polish Taste, a supermarket further down Hinckley Road, which has been open for about four years. \nMarlena Kisprzak, who works there, said: “We heard it was another Polish shop but we don’t know anyone there. \n“It’s very sad. It’s not good to hear about things like this happening.” 11:39 'The ceiling in the shop next to me collapsed' Savannah George, 17, was working next door at TJs Takeaway with her boss when the blast occurred on Hinckley Road \nA teenager who was working in TJs takeaway next door to a shop which was reduced to rubble in the explosion explained how the ceiling collapsed on top of her. \nSavannah George, 17, was on duty with her boss when the blast occurred at a convenience store in Western Park at about 7pm. \nSavannah told Mirror Online: \nI just took a phone order and put it up with the others to be made, and the next thing there was a massive explosion. \nI just saw a load of rubble coming down. The ceiling in the shop next to me collapsed. If I was 50cm to the left, the rubble would have fallen on me. \nThe takeaway boxes flew off the wall from the force and the ceiling in our store partially collapsed. 11:38 Jeremy Corbyn asks for 'pause' for victims, praises emergency services \nLabour leader Jeremy Corbyn paid tribute to those killed in the Hinckley Road explosion before delivering his key Brexit speech this morning. \nBefore outlining his party’s approach to Brexit at a speech in Coventry, he said: “I think we should pause for a moment and send our condolences to those who have lost their lives in Leicester last night.” Jeremy Corbyn \nMr Corbyn had earlier praised the efforts of the emergency crews working on scene. \nHe said in a tweet: “My thoughts are with the families of the four people who died and those injured in yesterday’s explosion in Leicester. \n“Thank you to the emergency services who are still on the scene and hospital staff who are working to save lives.” 11:28 How the tragic event unfolded \nWe have put together a timeline of the tragic events of the past 16 hours. Hinckley Road fire explosion (Image: All images are strictly copyright of REDPIX unless otherwise stated.) More On ", "external_links": [], "published": "2018-02-26T14:26:00.000+02:00", "crawled": "2018-02-26T14:35:40.013+02:00", "highlightTitle": ""}