{"organizations": [], "uuid": "c178dad9871c305aa4cd4bf73c08e90a9413737e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14275197.ece/ALTERNATES/s1200/john.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/sir-john-hall-tells-theresa-14275160", "country": "GB", "domain_rank": 21960, "title": "Sir John Hall tells Theresa May to show more leadership over Brexit talks", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-02-11T16:23:00.000+02:00", "replies_count": 0, "uuid": "c178dad9871c305aa4cd4bf73c08e90a9413737e"}, "author": "Mike Kelly", "url": "https://www.chroniclelive.co.uk/news/north-east-news/sir-john-hall-tells-theresa-14275160", "ord_in_thread": 0, "title": "Sir John Hall tells Theresa May to show more leadership over Brexit talks", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "john hall", "sentiment": "negative"}, {"name": "michel", "sentiment": "none"}, {"name": "john", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "tory", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Sir John Hall tells Theresa May to show more leadership over Brexit talks The ex-Newcastle United owner and Tory party donor said it could lose to Labour if another snap election was held Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nLeading North East businessman and Tory party donor Sir John Hall has spoken out about Brexit negotiations and Theresa May’s leadership qualities. \nIn a hard-hitting interview, he called on Mrs May and her Government to be stronger in EU talks in which he says the UK appears to be compromising itself too much. \nHe said: “We’ve got our pride. We seem to be giving a lot away with not much in return. I’m getting frustrated that we cannot get a deal on the table.” Sir John Hall (Image: newcastle chronicle) \nSir John added: “As a leader you have to show leadership qualities. It’s time to stand up and take the bull by the horns.” \nHe was scathing about the attitude of EU negotiators, led by Michel Barnier, towards the UK. \n“When I hear what the EU is saying I sense they are trying to screw us,” he said. “I was a very strong ‘remainer’. But the country has made its decision.” \nSir John, 84, also accused the EU of making an example of the UK as a warning to other nations. Theresa May (Image: Getty Images Europe) \n“They’ve got to keep all the eastern European countries in line. It could lead to the break up of the EU if we get a good deal now.” \nThe former Newcastle United owner and the man behind the Gateshead Metrocentre was a firm favourite of Margaret Thatcher. \nHe has reportedly donated more than £500,000 to the Conservatives as well as handing over £25,000 to finance its campaign at last year’s snap general election. Read More Sir John Hall on why he sold Newcastle United to Mike Ashley - and why he hopes Magpies owner stays \nHe said he fears for Tory chances if Mrs May is forced out and another snap election called the party could be “decimated”. \n“We’re four points ahead at the polls which I think is amazing. But there is a danger we could lose that election if we do not unify ourself.” \nSir John expressed sympathy for the predicament Mrs May finds herself in, having to deal with a divided party while carrying out difficult Brexit negotiations. Read More Sir John Hall: 'The only time I fell out with Freddy was when we sold to Mike Ashley' \nAnd, without wanting to name names, he was critical of those plotting to remove her. \nHowever he reiterated his call for her to be strong and walk away if no deal was on the table. \nLast week, according to post-Brexit impact assessment papers, the North East would be particularly hard hit by a ‘no deal’ result with a reported 16% reduction in its GDP. Read More", "external_links": [], "published": "2018-02-11T16:23:00.000+02:00", "crawled": "2018-02-11T17:28:04.097+02:00", "highlightTitle": ""}