{"organizations": [], "uuid": "ef322cb9957c754d7e520de01d9f8b0b837fb22c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14986454.ece/ALTERNATES/s1200/0_Interest-rates.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/risk-no-deal-brexit-uncomfortably-14986392", "country": "GB", "domain_rank": 21960, "title": "Risk of no-deal Brexit \"uncomfortably high\", says Bank of England governor", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-08-03T13:00:00.000+03:00", "replies_count": 0, "uuid": "ef322cb9957c754d7e520de01d9f8b0b837fb22c"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-news/risk-no-deal-brexit-uncomfortably-14986392", "ord_in_thread": 0, "title": "Risk of no-deal Brexit \"uncomfortably high\", says Bank of England governor", "locations": [], "entities": {"persons": [{"name": "mark carney", "sentiment": "negative"}, {"name": "emmanuel macron", "sentiment": "none"}, {"name": "fraser", "sentiment": "none"}, {"name": "carney", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "bank of england", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "bank of england governor", "sentiment": "none"}, {"name": "bbc radio", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Bank of England Governor Mark Carney speaks during the central bank's quarterly inflation report press conference in the City of London (Image: PA) Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nMark Carney has warned that the possibility of a no-deal Brexit is “uncomfortably high” and will lead to higher prices.\nThe Bank of England Governor said both the UK and EU should “do all things to avoid” a no-deal scenario but added that the country’s financial system is in a position to be able to “withstand a shock” which could result from the UK leaving the EU without an agreement.\nMr Carney’s comments came ahead of Mrs May meeting French President Emmanuel Macron at his summer retreat, where she is hoping to win over the French leader, one of Europe’s key powerbrokers. Read More House of Fraser's future in doubt as investor pulls out\nMr Carney, appearing on BBC Radio 4’s Today programme, said: “I think the possibility of a no deal is uncomfortably high at this point.”\nAsked if no deal would be a disaster, Mr Carney said: “It is highly undesirable. Parties should do all things to avoid it.”\nPushed on what no deal would mean for people, Mr Carney said “disruption to trade as we know it” before adding: “As a consequence of that, a disruption to the level of economic activity, higher prices for a period of time.\n“Our job at the Bank of England is to make sure those issues don’t happen in the financial system so that people will have things to worry about in a no-deal Brexit , which is still a relatively unlikely possibility but it is a possibility, but what we don’t want to have is people worrying about their money in the bank, whether or not they can get a loan from the bank - whether for a mortgage or for a business idea - and we have put the banks through the wringer well in advance of this to make sure they have the capital.”\nMr Carney, pressed on whether the preparations were to guard against a run on the bank, said it was the “exact opposite”, to ensure the banks can lend to the economy to “advance not retreat”.\nAsked if he believed this situation could emerge, Mr Carney replied: “No, no, no, no, no, no, no - we won’t be in that situation, we will not be in that situation. Read More North transport needs £100bn investment, MPs tell Government\n“The UK financial system has tripled the amount of capital they had over the course of the last several years, they have increased the amount of liquidity - the money they have on a day-to-day basis - by 10 times over the course of the last several years.\n“The reason they have done that is to be in a position to be able to withstand a shock, wherever the shock comes from - it could come from China, it could come from abroad, it could come from a no-deal Brexit.\n“We have meticulously gone through the types of risk associated with a no-deal Brexit to make sure the institutions are in a position.”\nMr Carney later said the financial system will be ready for that “undesirable and still unlikely possibility”, adding that it was run through a “stress test” scenario of house and commercial real estate prices decreasing by a third, interest rates going up by almost four percentage points, unemployment increasing to 9% and the economy going into a 4% recession.\nHe reiterated that this was not a prediction of what could happen if there was no Brexit deal, but to provide an idea of what the system could withstand.\nMr Carney said: “We have been planning for very difficult circumstances and the banks are ready.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-08-03T13:00:00.000+03:00", "crawled": "2018-08-04T02:37:25.007+03:00", "highlightTitle": ""}