{"organizations": [], "uuid": "2722d3837d9e23220df9a2739e60fc82f7f2bfcc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15065627.ece/ALTERNATES/s1200/0_North-PI-Clubs-offices-on-Newcastles-quayside.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/sunderland-marine-progresses-strategy-review-15065545", "country": "GB", "domain_rank": 21960, "title": "Sunderland Marine progresses with strategy review but premiums fall by $40m", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-08-23T20:00:00.000+03:00", "replies_count": 0, "uuid": "2722d3837d9e23220df9a2739e60fc82f7f2bfcc"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/sunderland-marine-progresses-strategy-review-15065545", "ord_in_thread": 0, "title": "Sunderland Marine progresses with strategy review but premiums fall by $40m", "locations": [], "entities": {"persons": [], "locations": [{"name": "north america", "sentiment": "none"}], "organizations": [{"name": "sunderland marine", "sentiment": "negative"}, {"name": "business sunderland marine", "sentiment": "negative"}, {"name": "sunderland marine insurance company", "sentiment": "none"}, {"name": "newcastle’s north p&i", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Sunderland Marine progresses with strategy review but premiums fall by $40m The marine insurance firm is in the middle of a three year review designed to streamline the business Share North P&I acquired Sunderland Marine in 2015 (Image: Unknown) Get business updates directly to your inbox Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nA North East firm that insures ships against damage to their vessels and machinery has seen its revenue fall by $41.6m (£32.3m) as the firm makes moves to focus on its core business.\nSunderland Marine Insurance Company saw its total insurance premium revenue fall from $102.5m to $60.9m for the year ending 20 February 2018. The reduction in revenue occurred as the company focused on its core markets and pulled away from some regions, such as North America.\nThe firm, which merged with Newcastle’s North P&I to form one of the biggest insurers of its kind in the world, is in the midst of a three-year restructure designed to make sure the business can continue to “deliver long-term financial stability and security”.\nThe review has three main objectives which are to focus on its core business, reduce complexity and reduce its exposure to non-core business. Read More\nSunderland Marine has made progress in achieving its restructure targets. The most noticeable change was the $1.6m profit the firm made on its non-core underwriting during the year. During the previous year the firm made a $10.8m loss.\nThe company also increased its total surplus from $72.2m to $78.2m.\nHowever, profit from Sunderland Marine’s core business fell from $4.8m to just $2m.\nA North P&I spokesperson said: “In line with a number of other clubs, we have diversified our product offering into the fixed commercial sector. To this end, we merged with the specialist fishing vessel, small craft and aquaculture insurance company, Sunderland Marine (SMI), in 2014.\n“This undertaking was intended to generate a new income stream for the benefit of the mutual membership, and as such it presents an opportunity to diversify away from the very competitive mutual P&I market.\n“We are in the process of re-focussing the SMI business on its core strengths and reducing its exposure in a number of under-performing areas. This has resulted in a short-term dip in revenues but in the longer term will deliver sustainable long-term returns on capital for the benefit of our mutual members.” Read More Meet the two men running the biggest firm in Newcastle that you've never heard of\nIn the accounts Sunderland Marine’s senior management reiterated its concerns over Brexit, which it said could lead to “a number of changes to the company’s risk profile”.\nTo combat this the North P&I group is setting up a base in Ireland to allow it to continue to operate in the EU.\nThe firm said: “The most prominent risk is the potential loss of the UK’s passporting rights which enable the company to write business in EU states without the need for separate licenses.\n“The group is progressing with the establishment of an insurance entity in Ireland, which will serve the group’s members and policy holders including EU business currently written by the company.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-08-23T20:00:00.000+03:00", "crawled": "2018-08-24T08:27:02.015+03:00", "highlightTitle": ""}