{"organizations": [], "uuid": "cc55162632b4042347ccecbad77e5746a26545f3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article12694202.ece/ALTERNATES/s1200/MPs-Debate-The-Brexit-Bill-In-The-House-Of-Commons.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15067406", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Chancellor accused of launching another 'dodgy project fear' over Brexit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-08-24T10:36:00.000+03:00", "replies_count": 0, "uuid": "cc55162632b4042347ccecbad77e5746a26545f3"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15067406", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Chancellor accused of launching another 'dodgy project fear' over Brexit", "locations": [], "entities": {"persons": [{"name": "dominic raab", "sentiment": "none"}, {"name": "jonathan walker", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "north east england", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "brexit coreena ford", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "chamber of commerce", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Teesport operator PD Ports is set for expansion after securing a £90m funding package .\nThe business has sealed the funding from Lloyds Bank, which said the deal demonstrates its continued commitment to developing key infrastructure projects in the North East.\nThe package will be used by the Middlesbrough firm to support an ongoing capital expenditure programme to expand and develop its ports and logistics assets, which will build upon the significant investment in Teesport in recent years.\nPD Ports, one of the country’s largest port operators, owns and operates Teesport, which processed 500,000 TEUs (Twenty-Foot Equivalent Units) in 2017 and handles approximately 4,100 vessels each year.\nThe announcement comes two weeks after the company unveiled hopes to boost the facility with a launch of new direct routes from two European destinations. Aerial shot of Teesport (Image: Handout) 9.00 Coreena Ford Petrofac to take £43m on North Sea disposals\nPetrofac has warned that it will take a $55m (£43m) hit on the sale of its shares in a project in the North Sea.\nThe energy firm said on Friday that it would offload its 20% stake in the Greater Stella area development and its 25% interest in the FPF1 floating rig, both in the North Sea.\nEnergy firm Ithica will take on the assets, paying up to $292m (£227m) in the process. Under the disposal agreement, Ithaca will pay $145m (£113m) on completion and a further $120m (£93m) between 2020 and 2023. The remainder will be paid depending on performance.\nBut Petrofac estimates that the transaction will result in an impairment charge of $55m (£43m). 8.56 Coreena Ford Sunderland Marine progresses with strategy review but premiums fall by $40m\nA North East firm that insures ships against damage to their vessels and machinery has seen its revenue fall by $41.6m (£32.3m) as the firm makes moves to focus on its core business.\nSunderland Marine Insurance Company saw its total insurance premium revenue fall from $102.5m to $60.9m for the year ending 20 February 2018. The reduction in revenue occurred as the company focused on its core markets and pulled away from some regions, such as North America.\nThe firm, which merged with Newcastle’s North P&I to form one of the biggest insurers of its kind in the world, is in the midst of a three-year restructure designed to make sure the business can continue to “deliver long-term financial stability and security”.\nThe review has three main objectives which are to focus on its core business, reduce complexity and reduce its exposure to non-core business.\nSunderland Marine has made progress in achieving its restructure targets. The most noticeable change was the $1.6m profit the firm made on its non-core underwriting during the year. During the previous year the firm made a $10.8m loss.\nThe company also increased its total surplus from $72.2m to $78.2m. North P&I acquired Sunderland Marine in 2015 (Image: Unknown) 8.50 Coreena Ford Air Partner kicks off search for new auditor\nAir Partner has said a competitive process to appoint new external auditors is under way after the private jet firm discovered a £3.3 million accounting error earlier this year.\nThe group said the tender will be awarded in the second half of the year with an appointment expected in “sufficient time” for the annual audit.\nIts interim review of the first half’s financial results will continue to be undertaken by Deloitte, which was the auditor in charge when the error occurred.\nAir Partner said:\nA competitive tender process is under way to appoint new external auditors, which will be completed over the second half with an appointment expected in sufficient time for the new auditors to undertake any preparatory systems and controls assessments deemed necessary prior to commencement of the year end audit.\nThe news comes after Air Partner’s shares collapsed in April when it announced the accounting error, which dates back seven years. It occurred when some invoiced money was put through as deferred income rather than being dealt with directly. However, the firm later told shareholders that its accounting woes would not cost it more than £4 million.\nMeanwhile, Air Partner said it traded well over the first half of the year, with underlying pre-tax profit in line with expectations and with the same period last year. 8.47 Coreena Ford Electra sale off but TGI Friday's could still change hands\nPrivate equity firm Electra has ended its formal sale process after failing to drum up interest in a takeover, but assets including restaurant group TGI Friday’s could still change hands.\nThe company, majority owned by Edward Bramson’s Sherborne, put itself up for sale in May. But, on Friday, the firm said “no firm interest has been received in acquiring the company”.\n“As such the board today confirms that it has closed the formal sale process and terminated discussions with interested parties regarding potential acquisition of the company,” Electra said.\nHowever, the firm added that it has received interest from buyers in acquiring each of its portfolio assets, one of which includes TGI Friday’s.\nElectra also owns Hotter Shoes and Photobox Group, which is the firm behind Moonpig.\nDiscussions with interested parties continues, Electra said, with the outcome to be announced by the end of October. TGI Friday's in Newcastle (Image: Newcastle Chronicle) 8.42 Coreena Ford The cost of a 'no-deal' Brexit revealed - higher prices for shoppers and holidaymakers\nShoppers and holidaymakers will face higher prices if the UK leaves the EU without a deal , the Government says.\nConsumers shopping in the EU or buying online from an EU-based firm could be hit with surprise charges on their purchases.\nThe warning was included in papers released by the Government to prepare the country for Brexit, which is due to take place on March 29 next year.\nBrexit Secretary Dominic Raab said he was confident of agreeing a deal with the EU - but the UK was prepared to go ahead without one if needed.\nPharmaceutical companies were asked to stockpile “six weeks supply of medicines in the UK - on top of their own normal stock levels”.\nAnd businesses that export to the EU, which include major North East employers, were encouraged to start spending money on logistics software to prepare for new trading regulations.\nJonathan Walker, assistant director at North East England Chamber of Commerce, said: “Businesses have been calling for clarity on how to prepare for Brexit for a long time and while it is disappointing these notices have not been available before now, they are a step forward.\n“The information released illustrates clearly if we leave the EU with no deal, the significant burden in terms of administration that will fall on businesses. It also indicates the importance of getting a good deal rather than relying on contingency planning.” A plane leaving Newcastle Airport (Image: PA) 8.35 KEY EVENT Chancellor accused of launching another 'dodgy project fear'\nPhilip Hammond faced claims of launching a “dodgy project fear” as Tory tensions over Brexit erupted after the Chancellor warned no deal could cause major economic damage.\nBrexit-backing Tories reacted furiously after Mr Hammond pointed to disputed provisional analysis, released earlier this year, which claimed GDP could fall and borrowing could be around £80 billion a year higher by 2033/34 under a scenario in which Britain resorted to World Trade Organisation (WTO) terms due to no agreement with the EU.\nMr Hammond added this initial January analysis was undergoing a “process of refinement” ahead of a parliamentary vote on any deal, noting scenarios which have higher barriers to trade with the EU are expected to have a “more damaging effect” on the economy and public finances.\nHe also defended the Government’s preferred approach, which was outlined in a white paper following a Cabinet summit at Chequers, by saying the economic and fiscal impacts of this would be “substantially better” than no deal.\nEurosceptic Tories have railed against the Government’s proposals, which include a “common rulebook” with the EU on goods, amid fears it could restrict the UK’s ability to do trade deals.\nMr Hammond’s comments in a letter to Conservative MP Nicky Morgan, chairwoman of the Treasury Select Committee, emerged hours after Brexit Secretary Dominic Raab attempted to play down the likelihood of a no-deal Brexit while outlining the impact of such a scenario via a series of technical papers. Mr Raab also cited the risks as “potential short-term disruption” rather than longer-term, contrary to what Mr Hammond outlined.\nTory MP Marcus Fysh, writing on Twitter, referred to the Treasury’s previous “dubious” forecasts before adding that the Chancellor seemed “determined to wheel them out again for yet another instalment of dodgy project fear”.\nJacob Rees-Mogg, leader of the pro-Brexit European Research Group of Tory MPs, added on BBC Two’s Newsnight: “I think a free trade deal can be achieved, but that leaving on WTO terms is not as absurdly frightening as the Chancellor of the Exchequer thinks it may be.”\nHe also said: “The Treasury’s Brexit panic means you can no longer trust the Treasury’s forecasts.” Chanceller Phillip Hammond (Image: Getty Images Europe) More On", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/", "https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/15067406;"], "published": "2018-08-24T10:36:00.000+03:00", "crawled": "2018-08-24T10:48:27.010+03:00", "highlightTitle": ""}