{"organizations": [], "uuid": "999affe46fa655065b48d1e408f67e23c9eaa37a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14872911.ece/ALTERNATES/s1200/0_Brexit.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/north-east-councils-not-carrying-14989928", "country": "GB", "domain_rank": 21960, "title": "North East councils NOT carrying out any Brexit impact studies", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-08-05T07:00:00.000+03:00", "replies_count": 0, "uuid": "999affe46fa655065b48d1e408f67e23c9eaa37a"}, "author": "Sean Seddon", "url": "https://www.chroniclelive.co.uk/news/north-east-news/north-east-councils-not-carrying-14989928", "ord_in_thread": 0, "title": "North East councils NOT carrying out any Brexit impact studies", "locations": [], "entities": {"persons": [{"name": "jude kirton-darling", "sentiment": "none"}, {"name": "joyce mccarty", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "freedom of information", "sentiment": "negative"}, {"name": "newcastle city council", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "sky news", "sentiment": "none"}, {"name": "north east local economic enterprise", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News North East councils NOT carrying out any Brexit impact studies Freedom of Information requests have revealed local authorities aren't carrying out detailed assessments about the impact of Brexit Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nBrexit is just eight months away but North East councils aren’t doing any studies about how it might impact the region.\nEarlier this week, Sky News reported some councils have carried out detailed assessments of how they could be affected by the UK’s departure from the European Union.\nBut Freedom of Information requests have revealed no such studies are being carried out in the North East.\nNewcastle City Council’s deputy leader Joyce McCarty and MEP Jude Kirton-Darling have claimed a lack of clarity from central Government has made it impossible for local authorities to plan.\nWhile North East councils have contributed to a report by the North East Local Economic Enterprise looking at the relationship between the EU and the region, the FOI responses show no further detailed assessments are planned. The EU flag and a Union Jack (Image: PA)\nThe only substantial piece of research currently being compiled is a study into how the rural economy might be affected which has been commissioned by Northumberland County Counci l.\nExplaining why no assessments are being carried out, Newcastle’s deputy leader Joyce McCarty said: “ Right now many councils are unable to plan for the future as a result of the Government’s Brexit chaos.\n“While some councils obviously have Brexit-specific issues in their area, no one really knows what exit deal the Government will finally manage, and what the impact of this will be.\n“To make matters worse, the Government is spending in the region of £2bn to make Whitehall ready for Brexit but none of that money has gone to help local authorities prepare for Brexit.\n“Cities such as Newcastle face an uncertain future as Brexit approaches as a direct result of the Government’s failure to set out a clear path.\n“Clearly when Brexit does arrive we will have to be ready for the new era.\n“A key feature of the new political landscape will be in ensuring the millions of pounds in EU funding which previously supported regions such as our is replaced and devolved out of Whitehall.” Read More Andrea Leadsom: 'Brexit will be a success - and North East could vote Tory'\nSunderland City Council, whose dependence on Nissan for jobs makes them more exposed to the outcome of Brexit talks, are, according to a spokesperson, “continuing to monitor Brexit and will look to its implications when the final Brexit deal and arrangements are known”.\nGateshead Council, North Tyneside Council , South Tyneside Council and Durham County Council have not carried out an impact assessment and are not in the process of doing so.\nJude Kirton-Darling MEP said: “In-depth Brexit impact assessments – especially at local and regional level – are important and it is useful for Councils to plan as much as possible.\n“However, why are local authorities expected to conduct the research without being properly resourced to do so?\n“North East councils are cash strapped as it is, having been hammered by Tory cuts for years, and the work involved in analysing the effect of Brexit on our region is not an easy feat.” Read More Risk of no-deal Brexit \"uncomfortably high\", says Bank of England governor\nA Government spokesperson said: “The Government remains confident that we will secure a positive agreement with the EU, but is working closely and meeting regularly with local government to plan for Brexit under all scenarios.\n“A Brexit Ministerial Local Government Delivery Board chaired by the Communities Secretary has been established and will meet regularly to help coordinate this activity.\n“The Board held its inaugural meeting last month enabling council leaders to engage with Ministers directly over domestic Brexit preparations.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-08-05T07:00:00.000+03:00", "crawled": "2018-08-05T09:51:32.003+03:00", "highlightTitle": ""}