{"organizations": [], "uuid": "f02ccc7848f6fb634d7f7f3a58243b3f4ec7ff32", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1916283.ece/ALTERNATES/s1200/0_actress-2868705_1280.jpg", "site_section": "https://www.devonlive.com/rss.xml", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/devon-news/funniest-jokes-years-edinburgh-fringe-1916286", "country": "US", "title": "Funniest jokes from this year's Edinburgh Fringe revealed", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-08-20T09:38:00.000+03:00", "replies_count": 0, "uuid": "f02ccc7848f6fb634d7f7f3a58243b3f4ec7ff32"}, "author": "Neil Shaw", "url": "https://www.devonlive.com/news/devon-news/funniest-jokes-years-edinburgh-fringe-1916286", "ord_in_thread": 0, "title": "Funniest jokes from this year's Edinburgh Fringe revealed", "locations": [], "entities": {"persons": [{"name": "adam rowe", "sentiment": "none"}, {"name": "neil shaw", "sentiment": "none"}, {"name": "dave", "sentiment": "none"}, {"name": "rowe", "sentiment": "none"}, {"name": "devonlive", "sentiment": "none"}], "locations": [{"name": "quaywest", "sentiment": "none"}, {"name": "jobcentre", "sentiment": "none"}], "organizations": [{"name": "edinburgh fringe", "sentiment": "none"}, {"name": "liverpool", "sentiment": "none"}, {"name": "digital", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Funniest jokes from this year's Edinburgh Fringe revealed \"I had a job drilling holes for water - it was well boring\" Share Neil Shaw Head of Digital, live and trending for PlymouthLive, DevonLive and CornwallLive 07:38, 20 AUG 2018 Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nA joke about the irony of being fired from a Jobcentre has been named the funniest of the Edinburgh Festival Fringe.\nAdam Rowe won the 11th annual award for Dave's Funniest Joke Of The Fringe with the line: \"Working at the Jobcentre has to be a tense job - knowing that if you get fired, you still have to come in the next day.\"\nThe joke from Rowe's show Undeniable won with 41% of a public vote on a shortlist of gags picked by comedy critics.\nFormer bartender Rowe began doing stand-up in 2010 and has previously been crowned Liverpool Comedian of the Year. Read More YouTuber breaks into Quaywest waterpark in middle of the night - and park bosses are fuming\nOn winning the award, Rowe told the Press Association: \"I thought my agent was lying. He rang me and told me I couldn't tell anyone for a week which has been almost impossible.\n\"I'm massively taken aback by it, I've never seen myself as being in the running for things like this.\n\"It's a massive honour and a genuinely huge surprise.\"\nExplaining how he came up with the punchline, Rowe said: \"I actually wrote it when I was on stage when I was hosting a gig in Liverpool.\n\"It was a bit of crowd work that stayed with me. I was doing the usual compering thing, asking people what they do for a living. Read More Boy, 11, nearly dies playing 'Chokehold' game - 10 years after his aunt was strangled\n\"A guy said he worked in the Jobcentre and I said the joke that has now won the award.\n\"Because it got such a nice reaction on the night I thought I had to do something with it as a line.\n\"I didn't expect to be winning an award for what was essentially a brain fart!\"\nPrevious winners of the award include Tim Vine, Stewart Francis and Zoe Lyons.\nMaths student Ken Cheng won last year's prize with the line: \"I'm not a fan of the new pound coin, but then again, I hate all change.\"\nThe award, which was voted on by 2,000 people, lists jokes anonymously to avoid any bias towards well-known comedians. Read More Amazing footage shows sharks swimming off the Plymouth coast\nDave channel director Luke Hales said: \"This year, the news agenda and every day British idiosyncrasies have provided some wonderful opportunities for comedians to use their creative and comic genius in giving us all a giggle.\n\"As ever, we have enjoyed some quite brilliant one-liners and are delighted to crown Adam Rowe as the recipient of this year's Dave's Funniest Joke of the Fringe Award.\" Top 10 jokes from the Edinburgh Festival Fringe 2018\n1. \"Working at the JobCentre has to be a tense job - knowing that if you get fired, you still have to come in the next day\" - Adam Rowe\n2. \"I had a job drilling holes for water - it was well boring\" - Leo Kearse Read More Giant gorilla moved after locals say it was staring into homes – but now they look at its bum\n3. \"I took out a loan to pay for an exorcism. If I don't pay it back, I'm going to get repossessed\" - Olaf Falafel\n4. \"In my last relationship, I hated being treated like a piece of meat. She was a vegan and refused to touch me\" - Daniel Audritt\n5. \"What do colour blind people do when they are told to eat their greens?\" - Flo and Joan\n6. \"I've got a new job collecting all the jumpers left in the park at the weekends, but it's not easy. They keep moving the goalposts\" - Darren Walsh\n7. \"Trump said he'd build a wall but he hasn't even picked up a brick. He's just another middle-aged man failing on a DIY project\" - Justin Moorhouse Read More\n8= \"I lost a friend after we had an argument about the Tardis. I thought it was a little thing, but it seemed much bigger once we got into it\" - Adele Cliff\n8= \"Why are they calling it Brexit and not The Great British Break Off?\" - Alex Edelman\n10. \"I think love is like central heating. You turn it on before guests arrive and pretend it's like this all the time\" - Laura Lexx Like us on Facebook ", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-08-20T09:38:00.000+03:00", "crawled": "2018-08-20T09:56:06.023+03:00", "highlightTitle": ""}