{"organizations": [], "uuid": "e9e20ea1c59ae0d985d2b0a5e06f64d68c84f5ff", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1799155.ece/ALTERNATES/s1200/0_Untitled-3.jpg", "site_section": "https://www.devonlive.com/rss.xml", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/news-opinion/antisemitism-islamophobia-rows-show-current-1900120", "country": "US", "title": "Antisemitism and islamophobia rows show the current sorry state of British politics", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-08-15T14:19:00.000+03:00", "replies_count": 0, "uuid": "e9e20ea1c59ae0d985d2b0a5e06f64d68c84f5ff"}, "author": "Ben Bradshaw", "url": "https://www.devonlive.com/news/news-opinion/antisemitism-islamophobia-rows-show-current-1900120", "ord_in_thread": 0, "title": "Antisemitism and islamophobia rows show the current sorry state of British politics", "locations": [], "entities": {"persons": [{"name": "ben", "sentiment": "none"}, {"name": "ben bradshaw", "sentiment": "none"}, {"name": "bradshaw", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}], "organizations": [{"name": "news", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News opinion Antisemitism and islamophobia rows show the current sorry state of British politics Ben Bradshaw MP says when the country faces unprecedented peace-time challenges, Labour and the Conservatives have been mired in controversies about antisemitism and islamophobia. Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox Subscribe Could not subscribe, try again later Invalid Email\nBEN BRADSHAW IS THE LABOUR MP FOR EXETER AND HAS BEEN SINCE 1997\nIt is a sad indictment of the current sorry state of British politics that at a time when the country faces unprecedented peace-time challenges and is crying out for effective leadership, our two main political parties have spent much of the summer mired in controversies about antisemitism and islamophobia.\nOur NHS and social care are on their knees, we have a worsening housing crisis, UK productivity is now officially the worst in the group of richest nations and growing fears of a hard or no-deal Brexit have sent the pound to new lows, while Ministers talking blithely of shortages of food, medicines and energy and of unrest on the streets. Ben Bradshaw MP\nMy own party’s antisemitism problems have been dragging on now for far too long. Read More We are running out of time to solve Britain’s self-inflicted Brexit crisis\nIt is inexplicable to most decent Labour members and voters that the Labour Party, the party of equality and anti-racism, can have allowed such a damaging row to carry on for more than two years. Scores of official complaints of antisemitism are waiting to be resolved.\nThe Party’s ruling National Executive Committee is still quibbling about adopting the internationally recognised definition of antisemitism drawn up by the International Holocaust Remembrance Alliance (IHRA). It’s not the definition itself that appears to be the problem, but one or more of the examples that are used by the IHRA to illustrate it.\nSome members of the NEC seem to think adopting these could constrain legitimate criticism of Israel and its Government’s actions. Well, as someone who has long campaigned for Palestine and Palestinian rights and has always been a trenchant critic of Israeli policy, I see nothing in the full IHRA definition, with all its examples, that would constrain such criticism. Read More Effective flood defences should be a vital part of this country’s infrastructure\nWhat’s more, this needless row risks actually damaging the Palestinian cause, by allowing critics to conflate wrongly support for Palestine with antisemitism. Now that three of the biggest trade unions have called on the NEC to adopt the IHRA definition and all its examples in full, I hope the NEC listens and puts this issue behind us, so we can get on doing the job we’re supposed to be doing - opposing this Conservative Government.\nBut the Tories themselves can’t gloat. The Boris Johnson burqa affair has highlighted the nasty strain of islamophobia in their membership, which has led to a number of Party members, including councillors being suspended or expelled. The most despicable thing about Johnson’s intervention, is he knew exactly what he was doing and it led to a direct spike in attacks on Muslim women in Britain. Boris Johnson\nTell Mama, the organisation which records hate crimes recorded a direct link between an upsurge in incidents targeting Muslim women and Johnson’s comments. And the reason for Johnson’s timing? To curry favour with the tiny, shrinking and increasingly right-wing Tory membership in advance of a leadership challenge. Read More\nBritain deserves better than this. The temptation for many people will be to tune out and disengage from politics. In fact, there’s never been a more important time to be involved. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-08-15T14:19:00.000+03:00", "crawled": "2018-08-15T14:55:28.016+03:00", "highlightTitle": ""}