{"organizations": [], "uuid": "eb0530700f03d65a0c4c8a2749e0df803a64b62d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14872911.ece/ALTERNATES/s1200/0_Brexit.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/its-time-politicians-puts-peoples-15077686", "country": "GB", "domain_rank": 21960, "title": "'It's time our politicians puts people's livelihoods before ideology' Sarah Glendinning CBI", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-08-28T07:00:00.000+03:00", "replies_count": 0, "uuid": "eb0530700f03d65a0c4c8a2749e0df803a64b62d"}, "author": "chroniclelive.co.uk", "url": "https://www.chroniclelive.co.uk/business/business-news/its-time-politicians-puts-peoples-15077686", "ord_in_thread": 0, "title": "'It's time our politicians puts people's livelihoods before ideology' Sarah Glendinning CBI", "locations": [], "entities": {"persons": [{"name": "sarah glendinning", "sentiment": "negative"}, {"name": "sarah glendin", "sentiment": "negative"}, {"name": "jack", "sentiment": "none"}], "locations": [{"name": "westminster", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "chequers", "sentiment": "none"}], "organizations": [{"name": "cbi business", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "cbi", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business opinion 'It's time our politicians puts people's livelihoods before ideology' Sarah Glendinning CBI The regional director for the CBI analyses how a ‘no deal’ Brexit would have major repercussions for the Continent and UK alike Share The EU flag and a Union Jack (Image: PA) Get business updates directly to your inbox Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nWith the summer holiday season in full swing you might expect that the downtime in Westminster and Brussels would see everyone take a breather from Brexit , hitting the pause button on what has felt increasingly like a war of words in recent months.\nIt is not working out like that – and with good reason. It’s clear that the noise won’t die down this side of what may prove the decisive EU summit in October.\nSome Cabinet Ministers are spending parts of their summer travelling European capitals to sell the Chequers plan, to start the conversation – and to warn of the scorched earth outcome of a ‘no deal’ Brexit.\nFrom talk of stockpiling food and medicines to falling off the cliff-edge by accident, the warnings are bleak.\nAnd it’s not just politicians: the Police, the NHS, Britain’s farmers and many other voices have spoken of their ‘no deal’ anxieties and what the implications would be.\nWhile firms welcomed the pragmatic steps forward set out in the UK Government’s Brexit plans, businesses across all of Europe now desperately want to see a true spirit of compromise from both sides. Sarah Glendinning, director, CBI North East\nThe reality of what ‘no deal’ would mean is dawning for more and more businesses every day and many are already implementing contingency plans – shifting supply chains, moving jobs and raising prices. This is millions of pounds that could be better spent investing in their businesses.\nMake no mistake, a ‘no deal’ outcome would be immensely damaging for the EU, not just the UK. It’s vital that Europe’s leaders are alive to this fact and put people and prosperity ahead of tired dogma.\nIf we fail to reach agreement on goods, customs delays will see traffic jams stretching for miles, not just at the ports of Dover and Holyhead, but also Antwerp and Rotterdam among others. Almost all trade flowing through the port of Calais and nearly half that goes through Zeebrugge, ends up on the UK’s shores.\nOn services, whether it is financial, creative or technical, cross-border trade in these industries benefit both sides of the Channel. Between 2011 and 2016 alone, EU firms accessed 400bn EUR of global capital through the City of London, while UK insurance firms provide over 30 million contracts to EU customers. Read More Deloitte pledge North East investment in people after recording revenue rise to £3.58bn\nOverall, a ‘no deal’ would have major repercussions for the Continent and UK alike – jobs will be lost. Research from Belgium suggests more than a million jobs in Europe are at risk should this play out. The Republic of Ireland is the member state most exposed with its geographical and historical ties to the UK – one study suggesting a potential loss of around 4% of its GDP in the event of ‘no deal’.\nSome may caricature these warnings of ‘no deal’ as scare-mongering - that everything will be alright on the night. That just won’t wash anymore. Arguments must be made on facts and evidence at such a critical time in this country’s history.\nDropping out and operating solely under World Trade Organisation rules with the EU would make us the only major economy to do so. The idea that the UK would switch seamlessly to such an arrangement, ignoring the economic, political and legal ramifications, is pie-in-the-sky thinking. Read More\nThe UK must be pragmatic and compromise, but we also need more urgency and greater flexibility now from Europe’s leaders.\nSo, what must be done to keep the show on the road?\nFirstly, finalising a Withdrawal Agreement that resolves the unique challenges Northern Ireland faces in all of this. Secondly, we need pen put to paper on a jobs-first transition period to provide breathing space and more certainty for businesses of all sizes, in all European countries. And finally, a model that puts people’s livelihoods before ideology. That’s what our politicians are elected to do.\nSarah Gledinning, CBI", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-08-28T07:00:00.000+03:00", "crawled": "2018-08-28T07:35:16.003+03:00", "highlightTitle": ""}