{"organizations": [], "uuid": "bdc166b91bea471803877acf07e0adab781218eb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1876062.ece/ALTERNATES/s1200/0_Exmouth-big-wheel-1.jpg", "site_section": "", "section_title": "", "url": "https://www.devonlive.com/news/devon-news/changing-face-exmouth-seafront-those-1935708", "country": "US", "title": "The changing face of Exmouth seafront - and why those behind it think that if it doesn’t evolve the town will end up extinct like the dinosaurs - Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-08-26T03:00:00.000+03:00", "replies_count": 0, "uuid": "bdc166b91bea471803877acf07e0adab781218eb"}, "author": "Daniel Clark", "url": "https://www.devonlive.com/news/devon-news/changing-face-exmouth-seafront-those-1935708", "ord_in_thread": 0, "title": "The changing face of Exmouth seafront - and why those behind it think that if it doesn’t evolve the town will end up extinct like the dinosaurs - Devon Live", "locations": [], "entities": {"persons": [{"name": "richard cohen", "sentiment": "none"}, {"name": "wayne hemingway", "sentiment": "none"}], "locations": [{"name": "exeter but east devon", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}], "organizations": [{"name": "district council", "sentiment": "none"}, {"name": "eddc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Breaking in Exeter\nBut East Devon District Council say that changes to the seafront had to be made – and Wayne Hemingway, of HemingwayDesign, has said Exmouth has a bright future – but if the town doesn’t evolve it could go the way of the dinosaurs.\nRichard Cohen, EDDC’s Deputy Chief Executive, said that tourism in the town took a hit in recent years, dropping from around 800,000 visitors in 2004 to 500,000 in 2014, the latest available figures, and that the average visitor spend in Exmouth is half the average of other Devon towns.\n“Obviously, that was a big knock to the town and not ideal for a tourist town,” he said. “So we had to look at what we could do to try and revive the economy and attract more investment into the town without losing all that is good about Exmouth. Read More\n“There are miles of beautiful golden sands and that hasn’t and won’t change. But all seaside towns need to evolve over time and not to be fearful of change.” The new Queen's Drive Space on Exmouth seafront (Image: EDDC)\nHe added: “The population of Exmouth since the war has doubled but the infrastructure improvements haven’t followed and there has been an expectation that change was needed. There has been an organic change that has taken place around Exmouth’s watersports, so it made sense to make that part of the offer. Read More Design company 'guarantee' public views on Exmouth seafront will be listened to\n“But as well as evolving to fit new needs, we need to respect the tradition of the seafront. For the last two summers, we have had the observation wheel. That is something that is traditional, but with a twist of something new.” The big wheel on Exmouth seafront\nOne of the most controversial changes was the closure of the Fun Park. This summer, on the site, there has been a new Jurassic-themed free play area, an events space for theatre, music and live screenings and a Taste of the West food village.\nMr Cohen said that anecdotally the evidence is that the play space has been popular and a success, although admitted that not everything has worked and that lessons need to be learned for next summer when once again there will be temporary attractions on the seafront.\nHe said: “We will be taking advice and talking to the traders, but the play area will be around next year and remain open all year round. It makes sense and delivers something new but respects the existing seafront. We have been looking at the feedback that we have been getting and some of the events that we have put on have worked better than others, but the play area seems to be the kind of thing that is bang on for the seafront.” Read More\nMr Hemingway and his design company have been brought in by the council to imagine what will be the eventual long-term future for the Queen’s Drive site and a consultation has begun, with them asking for your views. The new dinosaur-themed play park on Queen's Drive on Exmouth seafront (Image: Daniel Clark)\nHe said: “It is vital that people respond to this, but so far, the responses have been a little bit unbalanced as there was been a lack of responses from the 15-34 age groups. It is their future so we need to hear their views, and it is a time bomb for any seaside town if they don’t retain or interest its young people.\n“We are there to listen to what you have to say – and despite what some people may think – so are the council.”\nHe admits that he didn’t intimately know what Exmouth was like 10 years ago, but said: “For a long time, Exmouth has been pretty one dimensional it what it offers so it needs to change.” Read More Supermodel attacks agents for failing to protect women from abuse\nHe continued: “Exmouth seafront is a joy, but whatever goes there, it needs to be legible, as for a long time, it hasn’t been. We need to get people to go all across the seafront, and I think the pop-up attractions this year are a start of travel in that direction.\n“But it is not for us to say what we think should happen. We will be listening to what you have to then we will make a judgment on what ideas are suitable for Exmouth. We want to contribute to a better future for Exmouth and we are not having to unpick a huge amount of things that need a massive amount of change. The Exmouth seafront site\n“There are things that are quintessentially Exmouth, like the beach, that we need to keep, but there are things that need to change. Exmouth, like most seaside towns, has been slow to respond and evolve to the changes and what the younger generation want. They expect a certain standard of quality and these are people, unlike my generation, who think holidays to Benidorm or Malaga are just a bit crass.\n“If places don’t evolve then they will end up going the way of the dinosaurs, but a need to evolve doesn’t mean big glass buildings and developments everywhere. Exmouth has a bright future, as all seaside towns can, but there has to be evolution.” Read More Lifeboat rescues exhausted sailor from three-metre waves and near gale force winds\nNick Hookway, the spokesman for campaign group Save Exmouth Seafront, also thinks the seafront has a bright future – but not in the hands of the district council.\nHe said: “I still haven’t managed to work out the council’s plan for the site, but they have the support of the residents for what they are doing.”\nTwice there has been a poll of residents, and twice they have voted against the major redevelopment plans, he said, adding that people don’t feel listened to. Floral tributes laid inside the swan at Exmouth Fun Park\nHe added: \"The loss of the amusement arcade and the Fun Park is something that people are very upset about, and what concerns us is that there is a real lack of a business plan. They have closed the Fun Park and the other businesses that brought in a few pounds through business rates and rents and replaced them with free attractions that aren’t bringing in anything.”\nMr Hookway said that in the grand old British tradition, Exmouth attracts visitors when the weather is good, but when it is wet and windy, people go elsewhere.\nHe said: “What attracts people to the seafront is the lovely long beach. When the sun is out, it is packed and people enjoy the fresh air. But when it is wet and windy, people go elsewhere. There are generations of people who come to Exmouth who want to enjoy the outside and to let their children play in the fresh air. Parents know about the Ocean centre and the soft play that it has, but they don’t want to use it, so it has become a bit of a white elephant for the council.” Ocean Blue in Exmouth is for sale\nMr Cohen though said the Ocean is an all-weather attraction and provides a different offer for the town for when the sun is not shining. Read More 'Poor relation' Paignton's town centre regeneration could be scrapped\nMr Hookway added: “The temporary attractions in place this summer have shown that play facilities on the seafront are essential. But they are only a third of the size of what was there before, and I’m not sure it would have been as successful if it was a very hot summer, so they have got lucky with the weather. Some of the food and drink offering have been very expensive and the space at the back with the big screen has been a total waste and not properly used at all.\n“There has been an air of dereliction around the seafront due to all the closures that have taken place and we have picked up a huge amount of support over the last 18 months from people who don’t agree with the council and who don’t feel that their views were listened to. We are urging people to take part in the consultation and put their views across.”\nHe added that SES have submitted proposals for The Exmouth Egg’ as their idea for the redevelopment. It could include a biome, similar to that used in the Eden Project, as well as play space, a viewing tower, a fitness area, and an ecology zone as their proposal to replace the closed Fun Park Exmouth Fun Park\nA year on from the closure of the Fun Park, Mr Cohen said that he was happy that the council made the right decision to close it. Read More Children's social care in Torbay still inadequate after two years, new report says\nHe said: “We understand that to close an established leisure operator is not something that we want to do lightly, but it was important to move forward and make the change. It definitely has not undermined Exmouth seafront and the offer it has and it was time for a fresh look.\n“Visitor numbers to the town were falling and the average visitor spend in Exmouth was half the average in Devon. This shortfall showed that there needed to be other things to do in the town.\n“Towns needs to evolve over time and not to be fearful of change. The Premier Inn, for instance, has brought people into the area. There were initial concerns from the Chamber of Commerce that it would take trade away from the B&Bs and hotels, but that hasn’t happened. A national chain in the town has only been a good thing. Even if it isn’t full every night, it has brought 40 jobs, 60 rooms and hundreds of thousands of pounds into the town that wasn’t there before. Exmouth Premier Inn\n“Wayne Hemingway and his team have made changes to other seaside resorts and are casting things over at the moment with a fresh eye. I am sure they will come out with some challenging ideas, but it is exciting to see what they and the people say they want.\n“Exmouth has been referred to as the Brighton of Exeter. It is ambitious claim, but it can be achieved I would like to think that Exmouth can compete with other locations and compete well, but it is not just a seaside resort but a town that has a life of its own.\n“Things in Exmouth are pretty positive, but we do need to look at what more we can do to make it better.” Read More Fishing industry Brexit enquiry warns of 'betrayal' amid sales fears\nWHAT HAPPENS NEXT\nPhase one is the realignment of the Queen's Drive road and the build a new 250 space car park. The build of the new road and the car park will begin on September 4, 2018 The new road and the car park is hoped to be completed and opened by Spring 2019 Exmouth seafront Queen's Drive development site Phase two is the watersports centre Plans for the watersports centre were approved by the development management committee in June 2018 Building work on the new watersports centre will begin in the winter 2019 The watersports centre would be complete by the end of 2020 at the latest New artist impression of the Grenadier watersports centre plan for Exmouth seafront Phase three is the rest of Queen's Drive Consultation is currently being held for the public to be able to give their ideas on the mix of leisure attractions East Devon District Council will then select their partners to invest in delivering the chosen vision for Exmouth's seafront Consultation will then happen on the detailed proposals that the developers put forward for the mixed leisure attractions. A second chance for consultation will be held when the proposals are formally submitted to East Devon District Council to consider. Plans would then be considered by the development management committee If approved, building work on a mix of attractions would begin A mix of leisure attractions would then open Do you have a story to share or for us to investigate?\nGet in touch using or call 07775 030856 or tweet me @HEDanielClark\nWant more news?\nFor Devon news, find Devon Live's Facebook page here and Twitter here , or visit our homepage at www.devonlive.com Like us on Facebook", "external_links": [], "published": "2018-08-26T03:00:00.000+03:00", "crawled": "2018-08-26T08:04:01.015+03:00", "highlightTitle": ""}