{"organizations": [], "uuid": "3ba6968fccba775b77e2f73bc2896dc4efe49bc2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15060925.ece/ALTERNATES/s1200/0_CFR_NJL_220818ferguson_04.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15062091", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Northumberland whisky distillery and visitor centre plans revealed", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-08-23T10:30:00.000+03:00", "replies_count": 0, "uuid": "3ba6968fccba775b77e2f73bc2896dc4efe49bc2"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15062091", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Northumberland whisky distillery and visitor centre plans revealed", "locations": [], "entities": {"persons": [], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "cologne", "sentiment": "none"}], "organizations": [{"name": "coreena ford gamescom", "sentiment": "negative"}, {"name": "nvidia", "sentiment": "none"}, {"name": "pubg", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford Gamescom opens with Fornite rivals\nEurope’s largest video games convention has opened to the public, with a full release for Fortnite rival PlayerUnknown’s Battlegrounds (PUBG) among the main attractions.\nAhead of the opening of Gamescom, it was confirmed the battle royale game will leave Xbox’s Game Preview programme in September and become a full release on the console - bringing new features and maps to players on the console for the first time.\nNext-generation graphics for future video games are also being previewed at the event by hardware firm Nvidia, who have unveiled new processing units that more realistically mimic the behaviour of light and shadows in games.\nThe firm said its new RTX series would herald the biggest jump in visuals in a decade and was the “holy grail of computer graphics”.\nGamescom welcomes more than 300,000 visitors to its convention in Cologne each year, where video game developers, console makers and gaming accessory firms preview their latest products to the public. A steward wears a super ultra wide videoscreen on his head to guide visitors at 2018 Gamescom 9.18 KEY EVENT Ryanair and pilots' union reach agreement\nAn agreement has been reached in talks between Ryanair and pilots’ union Forsa following a 22-hour negotiation session, the union has said. Talks had been continuing to try to resolve the long-running dispute between the budget airline and Forsa.\nThe proposed agreement will now be put to a ballot of members.\nIn a statement Forsa said: “Following a 22-hour negotiating session, which began on Wednesday morning and concluded Thursday morning, agreement has been reached between Forsa and Ryanair in the pilots’ dispute.\n“The proposed agreement will now go to ballot, with a recommendation for acceptance from Forsa and its Ryanair pilot representatives.\n“The union has been asked by facilitator Kieran Mulvey to make no public comment while the ballot is conducted.” A Ryanair plane (Image: newcastle chronicle) 9.15 Coreena Ford Fund manager injects £1m into local businesses through regional funds\nThe firm behind two major North East funds has invested more than £1m in local businesses in just a few months.\nNEL Fund Managers is one of the only investment houses to be awarded two of the five funds that make up the £120m North East Investment Fund.\nAfter being given responsibility for the Small Loan Fund and the Growth Capital Fund back in April, the company has invested more than £1m in the region’s firms.\nThe milestone was passed when NEL invested £10,000 in Bedlington-based JNCS Business Services, through the Small Loan Fund.\nThe cash is being used by JNCS to improve its manufacturing process around the TorqTag device, which improves safety within the oil, gas and power industries.\nDr Yvonne Gale, chief executive at NEL Fund Managers, says: “We’re pleased with the volume of enquiries that have come in so far around investments from both these new funds, and to have got past the million pound mark within just a few months of their launch. Dr Yvonne Gale, chief executive at NEL Fund Managers (Image: CREST PHOTOGRAPHY) 9.12 Coreena Ford OneSavings Bank raises guidance as profits rise\nOneSavings Bank has reported rising interim profits and upped full year guidance, brushing aside the Government’s crackdown on its core buy-to-let market. The challenger bank saw pre-tax profits rise 17% to £91.8 million in the six months to June 30, while its loan book swelled 11% to £8.1 billion.\nGross new organic lending rose 17% to £1.4 billion.\nOneSavings now expects to deliver net loan book growth in the “high-teens” in 2018, up from an earlier projection of the mid-teens.\nIt comes despite the Government reducing tax relief for buy-to-let landlords, and banks having to tighten lending criteria.\nThe lender said that while this had dampened industry-wide demand for new purchase mortgages, this was partially offset by an increase in demand for remortgages.\nBoss Andy Golding added:\nWe focus on the professional buy-to-let market where trends remain positive.\nDemand for five-year fixed-rate products has risen noticeably across the market with competition continuing to increase, however we continue to see good opportunities for growth and our InterBay commercial business continues to flourish.\nOneSavings’ net interest margin - the difference between the interest received from borrowers and the amount paid out on deposits- fell from 3.24% to 3.01% The lender put this down to lower yields on its mortgages amid strong competition. (Image: PA) Coreena Ford One in five small businesses in the North East fear they will go bust\nOne in five small businesses in the North East fear they will collapse - the highest rate in the UK.\nFigures from Hitachi Capital’s Business Barometer found that over the last three months the number of North East businesses predicting they would struggle to survive rose from just 3% to a staggering 20%.\nThe percentage was the highest in the country and far outstripped concerns in Wales, which had the next highest rate at 14%. In London, 13% of firms said they were concerned about their future, while one in ten in the North West said they might struggle to survive.\nHitachi Capital’s Business Barometer tracks small business confidence every quarter. Over the last two years confidence has remained consistent at around 4-5%. However this quarter the figure has doubled nationally to around 10%.\nThe figures suggest that uncertainty and political infighting around Brexit is causing lasting damage to the small business community, with the North East feeling the brunt of the changes. Part of the Newcastle City Centre skyline, including Grey's Monument (centre) (Image: Newcastle Journal) 8.55 What's the FTSE latest?\nThe FTSE-100 index at 8:15am was up 0.98 at 7575.22.\nShares in Fulham Shore rose 8% in morning trading, following the announcement it is targeting further expansion.\nThe pound at 8am was 1.2874 dollars compared to 1.2910 dollars at the previous close. The euro at 8am was 0.8984 pounds compared to 0.8984 pounds at the previous close. London Stock Exchange (Image: PA) 8.50 Coreena Ford Saudis play down Aramco float cancellation\nSaudi Arabia has insisted it “remains committed” to a two trillion US dollar (£1.5tn) stock market listing of oil giant Saudi Aramco, despite reports suggesting it has been abandoned.\nThe country’s energy minister Khalid al-Falih issued a statement saying:\nThe Government remains committed to the IPO of Saudi Aramco at a time of its own choosing when conditions are optimum.\nTiming will depend on multiple factors, including favourable market conditions, and a downstream acquisition which the company will pursue in the next few months, as directed by its board of directors.\nIt came after several reports claimed that the initial public offering of the state-run oil giant had been canned.\nThe listing, which would have been the biggest IPO in history, has been beset with delays.\nIt was expected to take place in the second-half of 2018 but in March, Mr al-Falih delayed the IPO to the second quarter of 2019. Aramco has reportedly shifted its attention to a proposed acquisition of a stake in petrochemical firm Saudi Basic Industries Corp (SABIC).\nThe oil titan had become the subject of a global charm offensive since it began mulling plans to list 5% of its shares.\nCity regulators had gone to great lengths to lure Aramco to London for the flotation, and courted controversy along the way.\nThe Financial Conduct Authority went as far as to create a new category that allows sovereign-controlled companies to sidestep some of the requirements for premium listings on the London Stock Exchange. 8.45 Coreena Ford Franco Manca pizza chain considers grabbing a slice of stores axed by rivals\nThe owner of the Franco Manca pizza chain is looking to take advantage of the woes in the sector as it revealed plans for further expansion as struggling rivals axe eateries.\nFulham Shore, which also owns The Real Greek restaurants, said it was considering opportunities for new restaurants as a raft of properties have come on to the market following high-profile troubles in the casual dining sector.\nThere has been a string of recent emergency restructurings for the likes of burger chain Byron, Prezzo, Jamie Oliver’s Italian outlets and Carluccio’s, and a swathe of restaurants have closed.\nBut Fulham Shore chairman David Page said the group was bucking the trend, with aims to expand further after seeing “encouraging” revenue growth for both its chains in the first 21 weeks of its financial year.\nAhead of the group’s annual shareholder meeting on Thursday, Mr Page said: “We are seeing more properties coming to the market as a result of the current conditions in the wider retail and dining out sectors. “We will continue to assess these opportunities and respond accordingly.”\nIt is already close to completing on a number of new sites for the current and coming financial year, having already opened two Franco Manca pizzerias so far in its financial year, in Bath and Cambridge. Teenagers Taking Pizza Slices at Restaurant 8.35 Reaction to Ad Gefrin Distillery plans\nLocal feedback on the plans has been extremely positive so far.\nJude Leitch, Director of Northumberland Tourism said:\nThe Ad Gefrin development is extremely exciting for North Northumberland and the county as a whole. The benefits that tourism provides for our economy are significant, with £686m spent by tourists in Northumberland during 2017, an increase of 8.5% on the previous year.\nOur long term aim is to encourage visitors to explore all parts of our beautiful county, including our rural upland areas, and this development will encourage this to happen, providing a focal point for visitors throughout the year, creating significant numbers of new jobs and ensuring the continuation of vibrant and thriving local communities within Wooler and the surrounding area.\nLeader of Northumberland County Council, coun Peter Jackson, added:\nThis is a really exciting project which has the full support of the County Council.\nNot only has it the potential to provide a positive future for Wooler but it will be significant as an attraction for visitors to the whole of North Northumberland and I am particularly pleased that it will act as a showcase for the deep cultural past of our county which goes back hundreds of years. I am convinced that the whole county will be proud of this project. The Former Redpath's Yard which is set to be transformed into the Ad Gefrin distillery and visitor centre 8.30 KEY EVENT Multimillion-pound distillery and visitor centre plans unveiled\nA multimillion-pound distillery and visitor centre is set to become a major Northumberland tourist attraction while also creating 50 jobs.\nThe former Redpath’s Yard in Wooler is set to be transformed into a distillery making Northumberland’s very first single malt whisky, attracting tourists to the remote corner of North Northumberland while also tapping into the growing global whisky market.\nPlans for the Ad Gefrin Distillery are being spearheaded by the Ferguson family, owners of national haulage firm Fergusons as well as many other North East firms going back over four generations.\nAlan and Eileen Ferguson revealed the whole family is involved in the proposals which have been devised to reinvigorate the local economy, help to retain young people in its workforce and regenerate a site which has lain empty for more than two decades.\nAnd they want the whole community to get involved in the project, by sharing memories of the site to help create a historical document of the area within the visitor centre.\nAlan Ferguson OBE, a former president of the North East Chamber of Commerce, said: “This is a very bold undertaking for our entire family, involving my wife Eileen, our five children and myself.\n“Our ultimate aim is to develop a unique single malt whisky and a major attraction, as well as opening a new chapter in the cultural developments and traditions of Glendale.” The Ferguson Family in the shadow of Ad Gefrin (Yeavering Hill) (Image: Glendale PR) More On", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/15062091;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-08-23T10:30:00.000+03:00", "crawled": "2018-08-23T13:29:29.019+03:00", "highlightTitle": ""}