{"organizations": [], "uuid": "7015600c32c3499479f060319f12f885a87d36d3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15077708.ece/ALTERNATES/s1200/0_CFR_NJL_300916digital_01.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/government-urged-support-north-east-15077692", "country": "GB", "domain_rank": 21960, "title": "Government urged to support North East creative industries post Brexit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-08-27T15:00:00.000+03:00", "replies_count": 0, "uuid": "7015600c32c3499479f060319f12f885a87d36d3"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/government-urged-support-north-east-15077692", "ord_in_thread": 0, "title": "Government urged to support North East creative industries post Brexit", "locations": [], "entities": {"persons": [{"name": "jim", "sentiment": "negative"}, {"name": "mawdsley", "sentiment": "none"}, {"name": "jim mawdsley", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "brexit industry", "sentiment": "negative"}, {"name": "brexit business government", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "digital union", "sentiment": "none"}, {"name": "newcastle united", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Government urged to support North East creative industries post Brexit Industry expert Jim Mawdsley has warned that the Government will have to provide more support when EU funding comes to a halt Share Jim Mawdsley, CEO of Generator, speaks at the Digital Union event (Image: Digital Union) Get business updates directly to your inbox Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nThe head of an influential business network has called for the Government to provide more support for North East creative firms after Brexit.\nJim Mawdsley, CEO of Generator, which runs the Digital Union network, has warned that the region’s creative sector could suffer when EU funding comes to an end after Brexit .\nMr Mawdsley said: “Generator and Digital Union have done a great deal over the years to support the creative digital sector, but this support could be under threat following the decision to leave the EU. Read More UK's biggest payday lender and former Newcastle United sponsor Wonga reportedly close to collapse\n“We have enjoyed significant support in terms of European Regional Development Funding since 2010 and all of this has been invested in supporting and growing businesses in the sector through a wide range of interventions from encouraging young entrepreneurs to start businesses right through to our Digital Scale Up programme.\n“If the Government doesn’t replace this funding in the future then we may only be able to help those who are currently in a position to pay for support which would certainly damage the future growth of the sector.”\nHis comments come after Government figures revealed that the economic impact of the North East’s creative, gambling and sport industries fell by 5% during 2015 and 2016. Generator CEO, Jim Mawdsley (Image: Handout)\nThe creative industry, gambling and sport - known collectively as DCMS sectors - contributed £3.8bn to the North East economy during 2016. But the figure was down from a record high of £4bn during the previous year.\nDCMS sectors include creative industries, the digital sector, gambling, sport, and telecoms firms.\nThe largest DCMS sector in the North East was the digital economy, which brought in £2.5bn during 2016. This figure includes turnover generated by companies that make wholesale electronics and computers, computer programmers, software firms, and consultants.\nTelecommunications generated £1.6bn, while the creative industries accounted for £983m.\nGambling contributed £583m while sport brought in £304m to the North East economy.\nAcross the whole of the UK, the North East was the only region to see its DCMS sector decline across the year. Read More Newcastle marine insurer opens New York office to cater for American market\nMr Mawdsley added: “The fall in the amount these sectors contribute to the North East economy does come as a surprise to me but there are many different reports looking at various sectors in a different light.\n“For example, if you look at the past two Tech Nation reports which look at the GVA contribution of the digital and tech sector in the region - Middlesbrough, Sunderland and Newcastle-Gateshead - have all grown year on year with Newcastle-Gateshead showing a 30% increase from £1bn to £1.3bn over a 12-month period.\n“If you look at the gambling end of the gaming sector, we have three outstanding home-grown companies that are all expanding rapidly.\n“These include Bede Gaming in Newcastle, Double Eleven in Middlesbrough and tombola in Sunderland, which has just added new premises and is looking to push its staff to 400 as part of fulfilling its strategy to double its turnover by 2020.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-08-27T15:00:00.000+03:00", "crawled": "2018-08-27T16:44:18.000+03:00", "highlightTitle": ""}