{"organizations": [], "uuid": "ccafbee67347202b982e055ffcc4eb02bb75a600", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1942532.ece/ALTERNATES/s1200/0_dfggffdJPG.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/devon-news/im-celeb-2018-line-up-1942312", "country": "GB", "title": "Who will top Toff? I'm A Celebrity 2018 line-up rumours revealed", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-08-27T19:49:00.000+03:00", "replies_count": 0, "uuid": "ccafbee67347202b982e055ffcc4eb02bb75a600"}, "author": "Alex Richards", "url": "https://www.devonlive.com/news/devon-news/im-celeb-2018-line-up-1942312", "ord_in_thread": 0, "title": "Who will top Toff? I'm A Celebrity 2018 line-up rumours revealed", "locations": [], "entities": {"persons": [{"name": "lisa armstrong", "sentiment": "none"}, {"name": "mcpartlin", "sentiment": "none"}, {"name": "dani dyer", "sentiment": "none"}, {"name": "declan donnelly", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "danny dyer danny dyer", "sentiment": "none"}, {"name": "anne-marie corbett", "sentiment": "none"}, {"name": "jack fincham", "sentiment": "none"}, {"name": "holly willoughby", "sentiment": "none"}], "locations": [{"name": "georgia", "sentiment": "none"}], "organizations": [{"name": "iac", "sentiment": "none"}, {"name": "mirror online", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now\nIt's only a matter of weeks before I'm A Celebrity... Get Me Out Of Here! returns for its 2018 series.\nAnd that means it's almost year since Devon's Georgia 'Toff' Toffolo took the jungle crown.\nLast week it was revealed that Holly Willoughby will host alongside Declan Donnelly - as a stand-in for Ant McPartlin.\nAnt pulled out of the presenting gig - the first time in 16 years - saying he wants to focus on his sobriety after receiving treatment for his drink and drug addictions, being convicted of drink-driving, splitting from wife Lisa Armstrong and moving on with their ex-PA Anne-Marie Corbett.\nSo with a brand new presenting duo, Mirror Online unveils who is rumoured to be in the IAC line-up of 2018 I'm A Celeb 2018 rumoured line-up Danny Dyer Danny Dyer\nWith his eldest daughter Dani Dyer proving her reality TV credentials by winning this year's Love Island alongside beau Jack Fincham, the EastEnders geezer may be considering the best way to win back the Dyer crown.\nDuring his now-infamous appearance on Good Evening Britain back in June, Danny, 41, admitted he loves all forms of reality telly .\n\"It is an instant thing at the moment and it is a career... why not try and do something like this Love Island - everyone's talking about it and she [Dany] can earn loads of money and crack right on,\" he pointed out. Read More Ant replaced as I'm A Celebrity...Get Me Out Of Here gets new host\n\"It is a career - you can earn loads of dough and get loved and adored for it.\"\nIt wouldn't be the first time Danny's done reality - the Mick Carter actor also appeared in the BBC's Who Do You Think You Are? and found out he's actually related to Edward III. Nigel Farage Nigel Farage\nBrexit fanatic Nige has been rumoured for the Jungle for the last two years running - reportedly turning down a £1million opportunity in 2016.\nBut the speculation has increased once again after the former UKIP leader refused to rule out a stint Down Under during a chat with GMB temporary host Jeremy KYle.\n\"It is rumoured that - come tax payment time - I'm A Celebrity... Get Me Out of Here!, you're number one on the wish list,\" Jezza pointed out.\n\"How much would it take? Half a million, a million, what?\" Read More\nFarage brayed and said: \"I'm not for sale at the moment. Once we're a free independent country charting our own course and I'm completely out of the grubby world of politics, who knows what I might do?\"\nCan you even imagine? Lucy Fallon\nThe Coronation Street darling has had a year of hell with her character Bethany Platt's abusive relationship - but she could soon be swapping the cobbled streets for kangeroo testicles.\n\"I think I'd be good at the Jungle. I like to challenge myself and that's the most challenging show you can do,\" said the 22-year-old actress when asked about going on IAC .\nSeems like a pretty big hint to us. Kieran Hayler\nFresh from his miserable marriage to Katie Price - which saw him cheat on her with her best friend Jane Pountney and their kids' nanny Nikki Brown - Kieran could well be doing the show that she's done twice.\nThe Jungle, of course, is where Katie first met Peter Andre, so it would be interesting to see Kieran follow in her footsteps and maybe even find love himself.\nThe 30-year-old stripper-turned-dad of two was said to be negotiating a hefty fee with I'm A Celeb bosses in the wake of his marriage breakdown - and no doubt they'd be keen for him to spill all the gory details about life with the Pricey. Read More LazyTown actor Stefan Karl Stefansson dies aged 43 following cancer battle\n\"Kieran wants a big money deal and has told his mates he won't be doing it for a pittance. Now he's getting buff again too he's been saying it's because he wants to look his best in the jungle,\" said a source.\n\"He knows Katie would be furious if he went in and that she'd probably be voting for him to do the worst tasks. But he wants to show the public he's a real bloke and isn't scared of challenges.\" Olivia Attwood\nThe acid-tongued Love Island 2017 babe hasn't been out of the spotlight since missing out on the £50,000 cash prize - first scoring her own ITV spin-off show with Chris Hughes before their spiky relationship crashed and burned.\nAnd she's set to appear on this autumn's Celebs Go Dating - although as Mirror Online exclusively revealed in August, Olivia had been spotted on a secret date with her footballer ex , Bradley Dack. Read More\nAwkwardly, she'd already told Go Dating bosses she was very much the single pringle.\nCould this be her chance to start anew in the Jungle? Nick Knowles Nick Knowles during DIY SOS filming in Torquay (Image: Andy Styles)\nThe DIY SOS host is said to be considering a six-figure offer from I'm A Celeb chiefs in the wake of his eye-opening love life, which saw him split from wife Jessica Rose Moor, take up with Corrie star Gemma Oaten, dump her then move on to Rebecca Kearns - 30 years his junior - before ditching her , too.\n\"Women love him, men respect him – and it'd be interesting to see if he's as practical in the camp as he is on a building site,\" a source told the Sun.\n\"He's been offered the show a few times before, but this year they really want him on it so they're bending over backwards and offering him big money.\" Christine McGuinness\nGlamorous model Christine, wife of Take Me Out comedian Paddy McGuinness - and mother to their autistic twins Penelope and Leo and toddler daughter Felicity - has had a tough year.\nBack in January, their marriage was rocked by cheating claims when pictures of Paddy on a night out with All Saints singer Nicole Appleton emerged - both parties strongly denied the rumours.\nChristine, 30, later told Loose Women it had been \"difficult recently\", hinting at marriage problems.\nAnd she told friends he'd \"lied\" to her about the night out , admitting she was worried about their relationship. Read More Jim Davidson slams Westcountry venue after no one shows up to see his show\nPaddy also opened up about life at home in an emotional interview , sobbing: \"It's very, very, very, very difficult, you know any parent with ­children with any kind of special needs is very difficult.\n\"I can count on one hand the amount of times we've been on a night out together, because you can't just have a babysitter.\"\nAnd a telly insider told the Sunday Mirror that any hint of Christine and Paddy's marital woes would be a ratings hit .\n\"Christine is one in-demand lady right now,\" said the source in March.\n\"She's had a lot of interest since her relationship drama and I'm A Celeb know she could be a ratings winner. She has a lot to talk about and is not afraid to embrace a new challenge.\" Malique Thompson-Dwyer\nEvery I'm A Celeb series needs its man candy, so step right up Hollyoaks hunk Malique.\nThe 20-year-old actor, who plays Prince McQueen in the Channel 4 soap, is rumoured to have caught producers' eye when he bagged the Best On-Screen Partnership gong at the British Soap Awards this summer.\n\"Jungle producers were keen to snap up a young star with a fresh following to tune into the show,\" a source told the Sun.\n\"Malique is over the moon about the gig and has been hitting up the gym already to make sure his body is as buff as possible by the time he goes to Oz.\" Emily Atack\nInbetweeners actress Emily - who is related to Paul McCartney through her granny - was rumoured to be part of the IAC line-up earlier this summer, after reportedly going into talks with ITV.\n\"She is fed up of doing indie movies and wants some stability in the UK with a big telly gig with lots of coverage,\" a source told the Sun.\n\"She knows being on the show will massively up her profile and hopes it will be a major turning point for her career. Read More\n\"Bosses are thrilled she is on board because she's absolutely stunning.\" Ronnie O'Sullivan\nSnooker legend Ronnie could be the next sportsman to jet over to Oz after admitting last year he'd love to go into the Jungle.\n\"I would, a million per cent, I'd do anything now, I would love it,\" he said when asked if he'd like to follow in the footsteps of Steve Davis and Jimmy White.\n\"I'm up for it. I used to think, 'no, I couldn't do that, I've got to be a pure snooker player,' but you get to a stage when you think, 'This is painful and that's all fun, a good laugh'.\"\nHe added: \"Why not? Let's have a bit of the jungle. They'll think I'm a gorilla when they look at me and I take my T-shirt off.\n\"I couldn't have done that trial last night, though, with the snakes. I'm gonna get trained for it, get used to the snakes.\" Jamie Laing Jamie Laing on Bake-Off\nMade In Chelsea star Jamie is no stranger to reality TV - he's spent the last seven years playing up to the cameras alongside best mate (and I'm A Celeb failed contestant) Spencer Matthews.\nThe Chelsea lot have some success when it comes to the Jungle, with Georgia 'Toff' Toffolo scooping the crown in 2017.\nJamie's said to have been in talks with producers after wowing him with his Extra Camp appearance last year.\n\"Producers love that he has got a TV following and online fans with his own YouTube channel, as they are trying to snap up a younger audience,\" said a show insider.\n\"He's a cheeky chappie and no doubt the public will fall in love with him like they did Toff.\" Rosie Marcel Rosie Marcel on Holby City\nThis Holby City star may well be swapping her scrubs for cargo shorts if the rumours are true - she's already met with producers to discuss going into the Jungle.\nSpeaking about it on Loose Women in August , Rosie said: \"I have, I've been... I've had a couple of meetings. I have spoken to them, it is something I would love to do actually. I think for me it would be an amazing challenge.\"\nBut when asked if that was a solid confirmation, Rosie backtracked: \"I don't know. Who knows?\" Aaron Chalmers\nGeordie Shore star Aaron - who's since turned his hand to MMA fighting - hasn't ruled out a stint Down Under, although there's one major fear holding him back.\n\"I wouldn't do your Geordie Shores and stuff again,\" he admitted.\n\"Drinking and training is totally impossible. It's two totally different worlds. Read More Who needs A levels? The Devon millionaires who succeeded anyway\n\"I'd love to do the Jungle but I'm petrified of spiders. There was one in the house the other day and I just ran away.\"\nBut, he said, he's still up for testing himself, adding: \"I'm a team player and I'd have to do the challenges.\"\nHis Geordie Shore co-star Vicky Pattison reigned over the jungle in 2015 - so could another canny lad take the crown? Brendan Cole\nAfter getting brutally dumped from the BBC, former Strictly Come Dancing professional Brendan has a gaping hole in his autumn schedule.\n\"Doors come along and you open them and you choose to walk a different path,\" he told the Daily Star.\n\"I have never had from July 31 until Christmas off. I have never been able to take on any other responsibilities, not even the odd corporate job because your time is devoted to Strictly.\n\"Now that time is all of a sudden free, all of the things I wanted to do is now available.\"\nHe wouldn't be the first Strictly pro pitting his foxtrot against the snakes and spiders - both Vincent Simone and Ola Jordan have done I'm A Celeb in the past. Catherine Tyldesley Catherine Tyldesley\nCoronation Street's Catherine dropped a bit of a hint when she mentioned she'd like to spend more time Down Under visiting her family - sparking claims she'd signed on the Jungle's dotted line.\n\"Rumours over her next career move went into overdrive after she spoke about her relatives in Australia and her desire to spend some time there, and we think it's all building up to a perfect match with a stint in the jungle,\" said a spokesman for bookmakers Coral.\nShe's yet to confirm or deny a spot on the show - but was previously ruled out of going on Strictly. Monica Lewinsky\nThe notorious White House intern-turned-bestselling author and activist was rumoured as one of the biggest names ITV bosses could have secured for this year's line-up.\nBut 45-year-old Monica has ruled herself out - claiming she's not famous enough.\n\"PSSST!! cuz i’ve now heard from 7 friends in the UK on this... NOT doing i’m a celebrity get me out of here,\" she tweeted on August 27.\n\"Not had any discussions, nor authorized anyone to have discussions on my behalf. no offence to the show... not my thing! (also... not a celebrity!).\" Faye Brookes, Shayne Ward and Katie McGlynn\nFollowing Jennie McAlpine's success on the show last year, her Corrie castmates are said to be desperate to grab a spot in this year's line-up.\nFaye, who plays Kate Connor in the ITV soap, is rumoured to be keen, although she'll have to leave behind boyfriend Gareth Gates to fly to Oz.\nSinead Tinker star Katie is also throwing her hat in the ring, while Shayne's role as the tragic Aidan Connor has widened his appeal hugely this year. Read More", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-08-27T19:49:00.000+03:00", "crawled": "2018-08-27T19:59:22.004+03:00", "highlightTitle": ""}