{"organizations": [], "uuid": "9e95a9c89543a28b8b15373e879c1415c60bc868", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1877658.ece/ALTERNATES/s1200/0_18983393-1.jpg", "site_section": "", "section_title": "", "url": "https://www.devonlive.com/news/uk-world-news/525million-mansion-1350-1877671", "country": "US", "title": "Get a £5.25million mansion for £13.50 - Cornwall Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-08-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "9e95a9c89543a28b8b15373e879c1415c60bc868"}, "author": "Neil Shaw", "url": "https://www.devonlive.com/news/uk-world-news/525million-mansion-1350-1877671", "ord_in_thread": 0, "title": "Get a £5.25million mansion for £13.50 - Cornwall Live", "locations": [], "entities": {"persons": [{"name": "share nei", "sentiment": "none"}, {"name": "melanie walsh", "sentiment": "none"}, {"name": "nigel", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "shaw head of digital", "sentiment": "none"}, {"name": "dancers hill house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get a £5.25million mansion for £13.50 The grade II listed Georgian property could be yours Share Neil Shaw Head of Digital, live and trending for PlymouthLive, DevonLive and CornwallLive 08:07, 9 AUG 2018 Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nA couple have decided to raffle off their luxury six-bedroom mansion worth more than £5.25 million after failing to sell it in nine months.\nDancers Hill House is a Georgian grade II listed property which is spread across more than 7,500 square foot of land just inside the M25 on the edge of north London.\nIt features six bedrooms and bathrooms, two lounges, a cinema room, a gym, a wine room, plus four acres of grounds, including a one and a half acre lake stocked with more than 2,000 fish.\nCurrent owners Nigel and Melanie Walsh said a difficult property market, Brexit and Stamp Duty were hurdles to achieving a sale, so after nine months decided to adopt a creative approach.\nRaffling off the property at £13.50 a ticket after being inspired by similar competitions, Ms Walsh, 65, said it is a \"grand old house in lovely surroundings\".\nThe cinema room in Dancers Hill House near Barnet, north London, which is being raffled off \"It is time to move on, and it will be heart wrenching because this is a part of me... it has been a joy, we have had some great fun,\" she told the Press Association.\n\"There is just the two of us now - 7,500 square feet for two people - I mean it is funny, but it is crazy, we just don't fill it anymore,\" she said.\n\"I just got the feeling the house needed a new family, a new chapter. It has had a fantastic life.\"\nThe mother-of-three said when they bought the house in November 1992, it was in the \"most derelict state\" and required a lot of work before they moved in in July 1993.\nLocated just 14 miles from central London, it is within easy access of the capital's major airports and has been recently renovated.\nMs Walsh said the property has appeared in the children's television show ChuckleVision, and the 1999 adaptation of Great Expectations was also filmed there.\nAnd in its former lifetime, it has also been used as a school and by the Army as Camp 33 to house Italian prisoners of war in the grounds.\nThe couple, who have been married for 42 years, have also held birthdays, family gatherings and even their son's wedding at their property.\nAsked who she would like to win the competition, Ms Walsh said: \"Someone who will love it as much as we have.\n\"The people who are buying tickets and entering, I hope and I really mean this sincerely, that they are looking forward to winning Dancers Hill House.\n\"I would like to see it go to a family who are going to cherish it and have as much fun as we have, and I hope we succeed.\"\nThose entering the competition have to answer a question and then purchase their ticket.\nThe draw will be done at random, with the closing date for the competition on December 16 this year, or earlier if all the 600,000 tickets are sold.\nFor more information and to take part visit www.windancershillhouse.com Like us on Facebook ", "external_links": [], "published": "2018-08-09T03:00:00.000+03:00", "crawled": "2018-08-09T10:17:56.012+03:00", "highlightTitle": ""}