{"organizations": [], "uuid": "b08fff013791fa42e284b62e558914ecbfc1a9c1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15014742.ece/ALTERNATES/s1200/0_CFR_NJL_040518hoults_06JPG.jpg", "site_section": "http://www.thejournal.co.uk/business/?service=rss", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/newcastle-rockn-roll-cobbler-who-15014568", "country": "GB", "domain_rank": 21960, "title": "The Newcastle 'rock'n roll cobbler' who is set for global expansion", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-08-10T17:06:00.000+03:00", "replies_count": 0, "uuid": "b08fff013791fa42e284b62e558914ecbfc1a9c1"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/newcastle-rockn-roll-cobbler-who-15014568", "ord_in_thread": 0, "title": "The Newcastle 'rock'n roll cobbler' who is set for global expansion", "locations": [], "entities": {"persons": [{"name": "terry de havilland kitt", "sentiment": "negative"}, {"name": "david bowie", "sentiment": "none"}, {"name": "david m. be", "sentiment": "none"}, {"name": "darren spurling", "sentiment": "none"}, {"name": "terry de havilland", "sentiment": "none"}, {"name": "marianne faithfull", "sentiment": "none"}, {"name": "terry", "sentiment": "none"}, {"name": "kate moss", "sentiment": "none"}, {"name": "bianca jagger", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "zeppelin", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business The Newcastle 'rock'n roll cobbler' who is set for global expansion Terry De Havilland kitted out the likes of David Bowie and Marianne Faithfull in the 70s and the firm is now run by his nephew in Newcastle Share Darren Spurling, MD of Terry de Havilland (Image: Hoults Yard) Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nA world-famous shoemaker brand which relocated to Newcastle is poised to launch a global export drive.\nTerry de Havilland was known as the “rock’n’roll cobbler” in the 1970s when he kitted out stars of the Swinging London scene including Marianne Faithfull, Led Zeppelin, Bianca Jagger and David Bowie.\nThe firm is now run by Darren Spurling, a nephew of the designer, who bought the company from its founder two years ago having been a part-owner for several years – and he has ambitious plans for expansion.\nThe shoes are designed in the region, remaining faithful to original styles, and are manufactured in Spain. Kate Moss wearing Terry de Havilland shoes (Image: David M. Benett)\nThey have also retained their popularity with clients including Cheryl, Kate Moss, Cher and the costume designers for Mamma Mia 2\nMr Spurling, a former board director of Black Leisure Group and also a director of sports brand O’ Neill, has lived in the North East for the last 20 years and relocated the business to Newcastle’s Hoults Yard last year after closing its London showroom and buying the firmer Nike warehouse in Washington.\nHe said: “I have always seen the huge potential of Terry’s iconic, signature style shoes and the opportunity to sell them to the rest of the world. We are now focussing much more on our online sales.\n“As part of this marketing strategy we will have a Christmas pop-up shoe shop in London’s Selfridges and a presence at London, Milan, New York and Paris fashion weeks.\n“Today, it is very easy to start a brand and there are thousands of them.\n“We have the unique advantage as we have a tremendous back catalogue and so much heritage as part of our company profile. We like to stretch our original designs to update them but keep the original spirit.” Cheryl wearing Terry de Havilland shoes\nThe online marketing has already paid dividends with turnover doubling in the last 12 months. Future trends being developed include the winter trend of 1970’s brown and metallic, emerald green, black and reds.\nAmong the brand’s claim to fames are Angelia Jolie’s footwear for Tomb Raider, Kylie Minogue’s shoes for Madame Tussauds, Rita Ora, Paloma Faith and Chery Cole. The firm’s shoes were also part of a new world record when they provided high heel roller skates for the fastest 100 metre run in heels.\nTerry de Havilland shoes may be manufactured in Spain but Mr Spurling is ambivalent about Brexit.\nHe said: “Like a lot of people I didn’t expect the leave vote and overnight our prices for imports went up by 25%, however the up side is that as a result of our shoes being less expensive, we now have a much stronger Italian customer base.\n“Our customers are not worried about Brexit but our supplier is concerned that they will lose business from us and other UK firms, after leaving the EU.\n“With regard to the future it is important we keep supply under demand. The high end fashion industry does not work well if there are too many of its products out there being sold for reduced rates.\n“I can’t make cheap shoes. We need to have the right leathers and skins to produce the colours and styles our clients want. The most expensive shoes we make at present are £800 python skin five tier wedges, which will last for years.”\nThe Terry de Havilland company joined the North East Chamber of Commerce to get support for international sales and Mr Spurling is a keen supporter of its campaigns to improve rail links to London.\nHe added: “We don’t need faster trains necessarily but we do need them to be more efficient and cheaper.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-08-10T17:06:00.000+03:00", "crawled": "2018-08-10T17:41:42.001+03:00", "highlightTitle": ""}