{"organizations": [], "uuid": "1bb899ccff857e2a30b650dd432de2cdad374208", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15070836.ece/ALTERNATES/s1200/0_GPY_BEM_110718airportstock_021JPG.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/frankie--bennys-owner-post-15069896", "country": "GB", "domain_rank": 21960, "title": "Frankie & Benny's owner to post sales fall as extreme weather takes its toll", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-08-26T13:00:00.000+03:00", "replies_count": 0, "uuid": "1bb899ccff857e2a30b650dd432de2cdad374208"}, "author": "Agency Staff", "url": "https://www.chroniclelive.co.uk/business/business-news/frankie--bennys-owner-post-15069896", "ord_in_thread": 0, "title": "Frankie & Benny's owner to post sales fall as extreme weather takes its toll", "locations": [], "entities": {"persons": [{"name": "frankie", "sentiment": "negative"}, {"name": "benny", "sentiment": "negative"}, {"name": "joe", "sentiment": "none"}, {"name": "tim barrett", "sentiment": "none"}], "locations": [{"name": "numis", "sentiment": "none"}, {"name": "chiquito", "sentiment": "none"}], "organizations": [{"name": "restaurant group", "sentiment": "negative"}, {"name": "frankie & benny", "sentiment": "negative"}, {"name": "the restaurant group", "sentiment": "none"}, {"name": "numis", "sentiment": "none"}, {"name": "invalid email frankie & benny", "sentiment": "none"}, {"name": "birmingham mail", "sentiment": "none"}, {"name": "city", "sentiment": "none"}, {"name": "garfunkel", "sentiment": "none"}, {"name": "chiquito", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Frankie & Benny's owner to post sales fall as extreme weather takes its toll The Restaurant Group has been impacted by this year's weather, both hot and cold Share Frankie & Benny's (Image: Birmingham Mail) Get business updates directly to your inbox Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nFrankie & Benny’s owner The Restaurant Group is set to report another fall in sales this week after the firm was hit by this year’s extreme weather, both hot and cold.\nAnalysts at City broker Numis forecast that the company - which also owns Garfunkel’s, Joe’s Kitchen and Chiquito - will post a 4% decline in like-for-like sales in the first half.\nIt has also pencilled in a fall in adjusted earnings for the period, from £26.5 million to £20.5 million.\nTim Barrett, of Numis, said: “Analysis of The Restaurant Group’s volume recovery will be complicated by market softness associated with recent external factors.\n“The World Cup and recent heatwave have been unhelpful for the restaurant market.” You might have eaten Mexican food at Chiquito restaurant and bar at the Metrocentre\nThe group warned earlier this year that sales had been chilled by the wintry weather in the first quarter as the casual dining sector also continues to suffer from a slowdown in consumer spending.\nThe results come at an increasingly challenging time for the eating-out sector.\nBurger chain Byron, Jamie’s Italian and Prezzo have all undertaken company voluntary arrangements this year, which saw hundreds of jobs lost and restaurants closed down.\nGaucho has also fallen into administration. Read More Sports Direct's £31.6m purchase of prime Newcastle property is region's biggest retail deal\nSoaring costs linked to the Brexit-hit pound, the resultant collapse in consumer confidence and rising business rates have combined to hammer the sector, with more pain forecast.\nChief executive Andy McCue is overseeing a turnaround at the Restaurant Group, which has seen a revamp of pricing, food quality and marketing, as well as restaurant closures. Frankie and Benny's in Trinity Square, Gateshead\nGraham Spooner, investment research analyst at The Share Centre, said: “Management have focused on the competitiveness of its brands, an improved customer experience, growing the pubs and concessions business, cutting costs and creating a leaner and more focused organisation.\n“Investors will be focusing on costs and the effect of the World Cup and extreme weather.”\nThe company has closed 26 out of a planned 41 outlets so far this year and Mr Barrett said he is comfortable with the pace of change. Read More Taco Bell plans Newcastle restaurant to open until 4am every day\nHe added: “We remain comfortable that management has taken the right steps to reposition the business, particularly committing capital to the higher growth concession and pub restaurants markets.\n“Other factors to watch include progress in exiting closed sites, the strategic push into delivery and an update on cost pressures.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-08-26T13:00:00.000+03:00", "crawled": "2018-08-26T17:20:32.000+03:00", "highlightTitle": ""}