{"organizations": [], "uuid": "188b23d501c1d48aa06df5efae4406d0af7c0da1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1849548.ece/ALTERNATES/s1200/0_Nicholas-Johnston.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/devon-news/bantham-beach-future-anti-johnston-1850665", "country": "GB", "title": "Bantham Beach, the future and the 'anti-Johnston' hate campaign", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-08-01T17:42:00.000+03:00", "replies_count": 0, "uuid": "188b23d501c1d48aa06df5efae4406d0af7c0da1"}, "author": "Keith Rossiter", "url": "https://www.devonlive.com/news/devon-news/bantham-beach-future-anti-johnston-1850665", "ord_in_thread": 0, "title": "Bantham Beach, the future and the 'anti-Johnston' hate campaign", "locations": [], "entities": {"persons": [{"name": "nicholas johnston", "sentiment": "none"}, {"name": "johnston", "sentiment": "none"}], "locations": [{"name": "bantham beach", "sentiment": "none"}, {"name": "kingsbridge", "sentiment": "none"}, {"name": "bantham around", "sentiment": "none"}, {"name": "jenkins quay", "sentiment": "none"}, {"name": "avon", "sentiment": "none"}], "organizations": [{"name": "pink salmon house", "sentiment": "none"}, {"name": "evans estates", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Kingsbridge news\nOne claim was that he would close the car park and restrict access to the beach. “Where did that come from?” he asks. “Why would we do that and how would it ever be helpful to the estate?”\nSince taking over, he has had the village front doors repainted, and the picturesque boathouse, the Pink Salmon House at Jenkins Quay on the Avon estuary, has been renovated. Clients on the estate’s expanded pheasant shoot now dine there, and Mr Johnston uses it for village meetings.\nMr Johnston says the estate was neglected under its previous ownership, Evans Estates. “You’ve got examples of what goes wrong when there’s not a plan, and when there’s no investment,” he said. Nicholas Johnston at Pink Salmon House on the estuary at Bantham\nAround £100,000 a year is being spent on the estate, he says. But it’s a business. “If you are having to find additional sums of money from outside the business, then something has to give,” he said. “So we need to gradually get to a point where the estate is sustainable and self-sufficient. Read More Police 'duped' by man, 21, who escaped in handcuffs after saying he felt sick\n“That was always a problem for Evans Estates. There was always the danger that a further piece of the estate had to be sold. That did happen over a long period of time until there was hardly enough left for it to be sold as an estate.\n“If it had continued it would have been a break-up job, virtually. So we have bought back several bits, including the house that I live in, and one or two other bits of land or property, to try to make sure we keep the estate holistic and give it a self-sufficient form.\n“There will, I am sure, be some tough decisions along the way. There will be opportunities where small scale development does exist. We’ll have to consider what we do if opportunities present themselves to do slightly more in terms of recreational or tourism-led opportunities.” Read More Watch as mum and daughter are rescued after being cut off by the tide\nThe most visible change happened this week when they brought in a team of heavy horses to haul rollers over the bracken that has claimed what should have been a dune conservation area. With the help of countryside stewardship cash and the approval of Natural England, the harm is now being reversed. Work Horses at Bantham Beach , Devon help with the overall Conservation of the area flattening Bracken.\nMr Johnston denies he ever said, back in 2014, that there would be “no development” at Bantham.\n“My actual quote was not, ‘There will be no development’, which is what groups like Save Bantham have fixated upon,” he said. “My quote was actually more directed to development around the beach and the estuary.\n“I have said many times, and I will reiterate, that in my custodianship of the estate, there will be no development on the beach or on the estuary. Bantham Beach in South Devon\nMr Johnston raised the ire of opponents when he published proposals last year to build 21 houses, an underground car park and a beach club.\nHe insists that he was asked to do some “blue skies thinking” by the committee drafting the Thurlestone parish neighbourhood plan. The plan has now been approved by a local referendum and, if accepted by the Government, will be adopted as the planning framework for the area.\nThings to do in Devon with children\nMr Johnston says he supports the neighbourhood plan, which would prevent new housing being sold as second homes or holiday homes.\nHe says: “I still maintain that there are certain problems we were trying to tackle, which still present themselves as problems to the community.”\nThose include parking for village residents and mooring holders on the estuary, and more small-scale housing for local people.\nThe idea of a beach club was always “highly unlikely”, but “please don’t think that there aren’t some families who don’t come up to me and go, ‘Gosh, it’s a pity nothing ever happened with that beach club idea. It’s just what a community like ours would benefit from’.” Bantham Beach across the headland and up the estuary\nHe says he will “always try to prioritise the opportunity for rural jobs. When I bought the estate Ryan Hooper [estate manager] was the only full-time member of staff.\n“Now we are probably at seven full-time members of staff and a much wider community of seasonal staff with the Gastrobus, the surf school, the other businesses in the village – the Sloop and the shop – are more stable.\n“We have given a whole selection of by and large local families a great deal more solidity and stability.\n“At a time of Brexit and uncertainty I think we should be credited for acts like that. They’re not acts of charity – they’re acts of a business looking to have a proper long-term good quality team of committed employees.\n“There aren’t that many opportunities for rural families to live and work in an environment like this. I’m very proud of that.” Read More Flowers and tributes left at Exeter Tesco after man dies in tragic attack\nEstate manager Ryan Hooper says the previous owners were also “beleaguered and hated. We took so much stick. I had a really hard time. I had hate mail and my life was hell for quite some time.”\n“Now we have a really good relationship with members of the community, the sailing club, the Aune Conservation Association.” Bantham is a favourite holiday spot for tycoon Richard Branson.\nMr Johnston may have fond childhood memories of holidays in Devon, but he is quite clear that the estate is a business. With changes in farm subsidy payments likely after Brexit, he believes the business will need to do more to remain sustainable.\n“I don’t think it will look a great deal different in ten years than it does now. People will come back in not just ten years, but 50 years, and find the beach and estuary looking very much as they do now. I will not be the guy who develops that in the way the National Trust might have done.\n“What it’s not is this wholesale change concept. It hasn’t happened in four years and it won’t happen in ten years.” Like us on Facebook", "external_links": [], "published": "2018-08-01T17:42:00.000+03:00", "crawled": "2018-08-01T18:05:23.010+03:00", "highlightTitle": ""}