{"organizations": [], "uuid": "615cffac454bafe59695516a5033f910cad9bbc3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1877695.ece/ALTERNATES/s1200/2_MAIN-Mums-warning-as-son-11-nearly-dies-playing-dangerous-chokehold-game-10-years-after-his-aunt-w-1.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/devon-news/boy-11-nearly-dies-playing-1877615", "country": "GB", "title": "Boy, 11, nearly dies playing 'Chokehold' game - 10 years after his aunt was strangled", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-08-09T11:51:00.000+03:00", "replies_count": 0, "uuid": "615cffac454bafe59695516a5033f910cad9bbc3"}, "author": "Jamie Hawkins", "url": "https://www.devonlive.com/news/devon-news/boy-11-nearly-dies-playing-1877615", "ord_in_thread": 0, "title": "Boy, 11, nearly dies playing 'Chokehold' game - 10 years after his aunt was strangled", "locations": [], "entities": {"persons": [{"name": "mason", "sentiment": "none"}, {"name": "rosie brown", "sentiment": "none"}, {"name": "clare brown", "sentiment": "none"}, {"name": "rosie", "sentiment": "none"}, {"name": "mirrorpix) \"mason", "sentiment": "none"}], "locations": [{"name": "miles platting", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}], "organizations": [{"name": "mirrorpix) mason", "sentiment": "none"}, {"name": "mason brown", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "\nAn 11-year-old boy almost died playing a dangerous 'Chokehold' game.\nMason had been playing a so-called games known as Chokehold with friends when he lost conciousness and fell face-first onto a concrete floor last week.\nNow, his distressed mum Rosie Brown, 34, has issued a desperate warning to other parents, The Mirror reports.\nThe incident happened ten years after his 25-year-old aunt was strangled to death. The schoolboy had been playing a so-called game known as Chokehold (Image: Mirrorpix)\nMason escaped the dangerous prank with concussion, cuts and bruises, but mum Rosie says: \"I could have been burying my child.\"\nHer sister-in-law, Clare Brown, was found dead in her own home in Miles Platting, Manchester, in 2008. Read More Most South West voters want second Brexit referendum\nRosie, a mum-of-seven, discovered her son had collapsed when a parent contacted her on social media. Mason Brown suffered cuts, bruises and concussion, but his mum says it could have been worse (Image: Mirrorpix)\n\"Mason was out playing with his friends and I got a Facebook call from a mum saying he had passed out,\" Rosie says.\n\"She said he had been dropped by the boy holding him because he was a dead weight, and smashed his face on the ground.\n\"I sent his dad round to get him but he called back and said 'you'll need to get dressed, we're going to A&E.\" Mason's aunt Clare was found dead in her own home in Miles Platting, Manchester (Image: Mirrorpix)\nMason had been playing Chokehold when he lost conciousness.\nThe main 'rule' of the popular craze is for one opponent to get another in a headlock until they feel as though they are about to pass out.\nIf the person being suffocated \"taps out\", he or she loses the game. Read More Shopping trolleys in the river removed by \"disgusted\" teens in Tiverton\n\"At the point of passing out your brain starts to be starved of oxygen which can ultimately result brain injury or death,\" Rosie says.\n\"Mason has had a lucky escape with cuts, bruises and slight concussion, but it could have been so much worse - I could have been burying my child. Clare with her daughter Chloe before she was killed (Image: Mirrorpix)\n\"What's worse is my sister-in-law Clare was murdered 10 years ago in her own home. She was strangled to death.\n\"So to find out this happened...well, it just isn't right.\n\"Thinking of Mason in that state is too close to home.\n\"We are still a family in mourning and Mason knows what happened to her. We have talked to him about it and made him aware.\"\nIn 2008, Clare Marie Brown was found dead in her bedroom by her brother Michael - Mason's dad - after her family became concerned they had not heard from her. Clare with her daughter Chloe before she was killed (Image: Mirrorpix)\nHer former boyfriend, Stuart Lawrie, from Gorton, stood trial for her murder, but was acquitted in November that year. Read More Anger after councillor calls Cullompton residents racist\nShe left behind two young children and no one has ever been brought to justice over her brutal death.\nRosie says Chokehold often starts out as wrestling and, as a mum of seven boys, she knows this looks like harmless fun.\n\"It ends up going too far,\" she says.\n\"These are lives they are messing with. It's not a joke. And it won't surprise me if he does it again.\n\"The first thing he said when we left the hospital was 'oh, now that boy is going to tell everyone he made me pass out'.\" Read More", "external_links": ["http://www.mirror.co.uk/all-about/facebook", "https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}", "https://www.mirror.co.uk/news/uk-news/mums-warning-son-11-nearly-13028455#ICID=ios_TMNewsApp_AppShare_Click_Other"], "published": "2018-08-09T11:51:00.000+03:00", "crawled": "2018-08-09T12:01:07.000+03:00", "highlightTitle": ""}