{"organizations": [], "uuid": "c2ce320374e31a2e326c9f3700d91dea618f21ad", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.plymouthherald.co.uk/incoming/article1904922.ece/ALTERNATES/s1200/0_Car-sim-1-1.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/uk-world-news/80-per-cent-older-drivers-1904840", "country": "GB", "title": "80 per cent of older drivers 'likely to crash if distracted on rural roads'", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-08-16T14:23:00.000+03:00", "replies_count": 0, "uuid": "c2ce320374e31a2e326c9f3700d91dea618f21ad"}, "author": "Max Channon", "url": "https://www.devonlive.com/news/uk-world-news/80-per-cent-older-drivers-1904840", "ord_in_thread": 0, "title": "80 per cent of older drivers 'likely to crash if distracted on rural roads'", "locations": [], "entities": {"persons": [{"name": "deborah archer", "sentiment": "none"}], "locations": [{"name": "paignton", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "south devon", "sentiment": "none"}], "organizations": [{"name": "plymouth", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "80 per cent of older drivers 'likely to crash if distracted on rural roads' Study conducted after Plymouth and South Devon assistant coroner calls for mandatory testing of drivers Share The simulator which discovered elderly drivers are likely to crash if distracted Get Daily updates directly to your inbox Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nAlmost 80 per cent of elderly motorists lost control of their cars and crashed off the road when 'distracted' while driving , a new study has found.\nAnd 15 per cent of OAPs swerved into oncoming traffic when asked to ‘multi-task' behind the wheel.\nThe study comes after Deborah Archer, the assistant coroner for Plymouth and South Devon, called for the mandatory testing of drivers aged 80 and older , following a tragic car crash which killed a pedestrian in Paignton.\nNow, scientists in Germany have pitted younger drivers - aged between 20 and 30 years old - against older drivers - 65-75 years old - in a controlled computer simulation. Participants were tasked with driving a virtual reality VW Golf for 25 miles along a realistic, winding rural road. The simulator which discovered elderly drivers are likely to crash if distracted\nBut when distractions designed to mirror real-life scenarios - such as inputting numbers on a keypad to replicate a mobile phone or sat-nav - were introduced, the difference between the two groups were stark.\nThe vast majority of older drivers - 78 per cent - ‘veered off the road’ and touched the kerb, compared with just 40 per cent in the younger group. Read More 'Life hacking' Brits are using their dishwashers to cook salmon\nMeanwhile none of the younger group - 0 per cent - meandered across the white line into onrushing traffic, compared with 15 per cent of the older group.\nNow lead researcher Konstantin Wechsler, of the Institute of Physiology and Anatomy at the German Sport University Cologne, says the study has important implications when it comes to accident prevention.\nAnd UK motoring expert Ranjen Gohri, of leading breakdown firm 24|7 Vehicle rescue, says it once again highlights the stark dangers of a lapse in concentration behind the wheel. The simulator which discovered elderly drivers are likely to crash if distracted\nWriting in the journal Frontiers in Psychology , Mr Wechsler said: \"Older participants drove more slowly, more laterally and more variably than young ones, and this age difference was accentuated in the multitask-condition, particularly if the loading task took participants’ gaze and attention away from the road. Read More Brexit 'no deal' could be 'catastrophic' for NHS and healthcare\n“Our findings indicate that multitasking deteriorates in older age not only in typical laboratory paradigms, but also in paradigms that require orchestration of dual-tasking and task switching. They also indicate that older drivers are at a higher risk of causing an accident when they engage in a task that takes gaze and attention away from the road.\"\nThe study involved 124 participants who were regular drivers, in good physical and mental health and with good eyesight.\nWhile seated in a simulated car, they were asked to follow another vehicle in front for around 25 minutes. During the journey distractions were introduced by the researchers - including braking tasks, being asked questions through a headset, or being given a three-digit number to type into a keyboard. Each participant completed four different sessions on separate days.\nMr Wechsler said: “Our finding could be of substantial relevance for the driving safety of older persons since activities similar to task ‘type’ are quite common in driving: drivers often operate radios, navigation systems and other dashboard instruments, open and close windows, adjust side and rear mirrors, and on longer trips may even reach for drinks and food located elsewhere in the car cabin.\" Motoring commentator Mr Gohri welcomed the study. Read More Monkey Dust users 'smell of prawns and act like The Hulk' in UK cannibal drug epidemic\nHe said: \"Long-established research has shown that the human ability to multi task declines with age.\n“It's important to stress that this research does not say that older drivers are 'worse' drivers than younger people, and statistically they are not. But it does point to them suffering a reduction in their ability to perform two unexpected tasks at the same time and to switch easily between tasks.\n“And it reinforces the message that any distractions while driving can be seriously detrimental to concentration and performance, particularly when it comes to operating gadgets.”\nMr Gohri also suggests concerned Brits should, however, embrace new car monitoring and tracking technology. Emerging gadgets are able to record sudden and erratic swerving, acceleration and braking, feeding the data back to the concerned party and potentially highlighting dangerous behaviour before a serious accident.\nMr Gohri, who's 24|7 Vehicle Rescue firm has just unveiled a new tracker called ‘CARLO', says: “What these gadgets do is offer the ability to see how a car is being driven and what can be done better to make the driving experience safer. Read More The weird UK driving laws that could cost you your licence\n\"They can also highlight dangerous mechanical issues before they become a danger on the road. “When fitted to either cars being driven by those who’ve just passed their test, or those in their later years, such trackers can potentially give peace of mind to family members - or flag potentially worrying behaviours behind the wheel.”\nThe study comes after a UK coroner recently called for older motorists to be re-tested by the Driver and Vehicle Licensing Agency (DVLA) later in life, as opposed to the current system of 'self-reporting'.\nIn September last year the RAC also reported how the number of people killed on Britain's roads had reached a five year high - some 1,792 deaths in 2016, up 4 per cent on the previous year and the most since 2011. Evelyn Fisher was killed after the collision in the centre of Paignton\nDeborah Archer, the assistant coroner for Plymouth and south Devon, wrote a letter to the Government calling for the mandatory testing of drivers aged 80 and older. Read More\nThe Prime Minister has voiced her and MPs' sympathy with the family of Paignton woman killed when an elderly driver veered off the road on to the pavement where she was walking. Read More Prime Minister's sympathy for family of Paignton woman killed in OAP driver crash\nTheresa May said the whole House had sympathy for the family of Evelyn Fisher who was killed in the crash. Driver William Sherlock, 90, was due to stand trial at Exeter Crown Court but the case was shelved because he is too old and infirm to attend court. Older drivers could face new tests after tragic car crash killed woman\nOlder drivers across the country could face tougher driving tests as a result of an 'absolute tragedy' which claimed the life of a Paignton woman. William Sherlock was 88 years old and, an inquest heard, probably suffering from undiagnosed dementia when his car mounted the pavement and killed pedestrian Evelyn Fisher in the middle of town on a busy Saturday afternoon.\nCharges against him of causing death by dangerous driving were dropped when he was deemed unfit to face a trial, and he has voluntarily surrendered his driving licence. Now a coroner has called on the Department of Transport to tighten up the rules on elderly drivers as a result. Read More UK Families with different surnames told to bring extra documents to airport\nSpeaking at the inquest in Plymouth into Ms Fisher's death, coroner Deborah Archer said she would use her powers to call for a review of the policy of people 'self-reporting' medical issues to the DVLA. She also said there should be more regular mandatory testing of drivers aged over 80.\nShe said: \"I appreciate that this is nothing for the family (of Ms Fisher) but it is the best I can do to try to make sure some good comes out of this terrible incident.\"\nDescribing Ms Fisher's death as 'an absolute tragedy', Ms Archer said Mr Sherlock had mounted the pavement in Hyde Road and struck Ms Fisher. She had suffered 'catastrophic' head injuries and did not regain consciousness. She died in hospital the following day. Read More Council fines white van man £300 for having lunch wrappers in his vehicle\nTests showed that Mr Sherlock had not suffered any kind of medical episode at the time of the crash, but a neurological expert said he believed he had been in the early stages of undiagnosed dementia at the time of the crash on April 2 2016.\nHad his dementia been diagnosed, she said, Mr Sherlock would have had to have his case assessed by the DVLA.\nThe crash happened outside the Big Baguette sandwich shop as Ms Fisher, who lived in Princes Street, walked to work at the Preston Conservative Club after going into Paignton to buy a birthday present for a friend. The shopfront was badly damaged in the crash.\nIn a statement read to the court, her daughter Andrea Vella said her mother's death had left her feeling 'empty' and 'heartbroken'. \"Mum was a big part of my life,\" she said. \"We could depend on each other.\n\"I feel so alone without her. She was the best mum. We have had an extra 20 years of life together taken away from us. I believe that she didn't just die - she was killed. I hope the driver feels remorse so that I can forgive him.\" (Image: Gerard Cotton)\nMPC Nigel Cox read statements describing the scene of the crash. Mr Sherlock's Vauxhall Corsa had no mechanical defects, he said. A breath test on Mr Sherlock was negative, and he was not using a mobile phone.\nA report from PC Simon Bishop said it initially appeared that Mr Sherlock had been distracted by something after overtaking a cyclist before veering across the road. Mr Sherlock had said he had reached up to the car's sun visor, aggravating an old injury in his arm. Read More One-in-five children don't know apples grow on trees\nThe car then went through a 'gentle right-hand arc' and mounted the pavement doing 22mph, police said. Ms Fisher did not have time to get out of the way.\nThree medical experts examined Mr Sherlock to work out if he was fit to face trial. All said he was not.\nIn his report, Dr Howard Faulkner said that Mr Sherlock had suffered 'vacant episodes' and 'partial seizures' as a result of his dementia, and said dementia 'increases the risk of accidents due to poor judgement'.\nIn his opinion, he said, Mr Sherlock was not aware of his actions at the time of accident, and gave a confused account afterwards.\nDr Faulkner's report, read to the inquest by the coroner, went on: \"He had never been advised to stop driving, but in my opinion he was in the early stages of undiagnosed dementia at the time.\"\nThe coroner returned a narrative conclusion at the end of the hearing, meaning the hearing simply recorded the factual circumstances of the death. Read More If your child goes missing this is what you must do in first five minutes\nAfterwards Michael Cole, Ms Fisher's partner, said she would be 'sorely missed' by him, her family and her many friends. \"She was a wonderful person,\" he said.\nPolice investigating officer MPC Cox also called for families to monitor elderly drivers. He said: \"We would ask anyone who is elderly to look at themselves, or at family members who may be at that stage of their driving where they need to think seriously about what they are doing.\n\"It's a really difficult thing to do, but it's a message we need to get out.\" Like us on Facebook ", "external_links": ["https://www.plymouthherald.co.uk/news/older-drivers-could-face-new-1140115", "https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}", "https://www.frontiersin.org/articles/10.3389/fpsyg.2018.00910/full"], "published": "2018-08-16T14:23:00.000+03:00", "crawled": "2018-08-16T14:40:33.008+03:00", "highlightTitle": ""}