{"organizations": [], "uuid": "6140131831a6519a253ec83a3c3d8ba18d27b8b3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13902119.ece/ALTERNATES/s1200/IBP_NEC_120314greys_02JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/one-five-small-businesses-north-15060531", "country": "GB", "domain_rank": 21960, "title": "One in five small businesses in the North East fear they will go bust", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-08-22T20:00:00.000+03:00", "replies_count": 0, "uuid": "6140131831a6519a253ec83a3c3d8ba18d27b8b3"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/one-five-small-businesses-north-15060531", "ord_in_thread": 0, "title": "One in five small businesses in the North East fear they will go bust", "locations": [], "entities": {"persons": [], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "north west", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "wales", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "newcastle city centre", "sentiment": "none"}], "organizations": [{"name": "hitachi capital’s business barometer", "sentiment": "none"}, {"name": "newcastle journal", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business One in five small businesses in the North East fear they will go bust The North East has the highest percentage of firms in the country that are worried they will close Share Part of the Newcastle City Centre skyline (Image: Newcastle Journal) Get business updates directly to your inbox Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nOne in five small businesses in the North East fear they will collapse - the highest rate in the UK.\nFigures from Hitachi Capital’s Business Barometer found that over the last three months the number of North East businesses predicting they would struggle to survive rose from just 3% to a staggering 20%.\nThe percentage was the highest in the country and far outstripped concerns in Wales, which had the next highest rate at 14%. In London, 13% of firms said they were concerned about their future, while one in ten in the North West said they might struggle to survive.\nHitachi Capital’s Business Barometer tracks small business confidence every quarter. Over the last two years confidence has remained consistent at around 4-5%. However this quarter the figure has doubled nationally to around 10%.\nThe figures suggest that uncertainty and political infighting around Brexit is causing lasting damage to the small business community, with the North East feeling the brunt of the changes. Read More American-style 'freakshakes' firm where customers are queuing for hours\nGavin Wraith-Carter, managing director at Hitachi Capital Business Finance, said: “For the last year, our research has shown that the small business community has seen political and economic change as an opportunity. Many have looked to expand into markets beyond the UK and create jobs in the communities where they do business.\n“Our latest findings, though, suggest the protracted nature of Brexit negotiations may now be taking its toll.\n“It’s also clear from our latest research that small businesses are focusing heavily on the financial health of their business – whether this be improving cash flow, getting tougher on late payment or looking for better ways to secure finance. The key thing is that they shouldn’t leave it too late.”\nThe report also found that those operating in the retail and hospitality sector were the most fearful about whether their business could survive. It follows on from last week’s predictions that 10,000 retail stores will shut this year, with half the closures expected to be independent shops. Read More North East food and drink exports soar by £250m over the last year\nResearch by insolvency and restructuring trade body R3 has also found that the majority or regional companies are experiencing at least one sign of business distress.\nThe most common sign of distress is the late payment of invoices, with more than a quarter of regional firms saying they were owed money on invoices that were at least 30 days past their due date.\nMaking redundancies was the next most common sign of distress, followed by decreasing sales volumes. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-08-22T20:00:00.000+03:00", "crawled": "2018-08-22T20:50:28.010+03:00", "highlightTitle": ""}