{"organizations": [], "uuid": "051438b873ce9210ed74752217343da6a72c5ab8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15087360.ece/ALTERNATES/s1200/0_PAS_STO_070618housing_002JPG.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/16000-fewer-jobs-237bn-worse-15087279", "country": "GB", "domain_rank": 21960, "title": "16,000 fewer jobs and £2.37bn worse off: The bleak 'housing crisis' facing the North", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-08-30T07:00:00.000+03:00", "replies_count": 0, "uuid": "051438b873ce9210ed74752217343da6a72c5ab8"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/16000-fewer-jobs-237bn-worse-15087279", "ord_in_thread": 0, "title": "16,000 fewer jobs and £2.37bn worse off: The bleak 'housing crisis' facing the North", "locations": [], "entities": {"persons": [{"name": "carol matthews", "sentiment": "none"}], "locations": [{"name": "north", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nThe Government’s housing plans could hold back economic growth across the North for a generation, housing associations have warned.\nThe North will miss out on tens of thousands of new homes and jobs as a result of a system that favours housebuilding in the south of the country, they claim,\nCarol Matthews, chair of Homes for the North, said: “The way future housing need is planned for fails to recognise future growth prospects of cities across the North. This needs to be addressed immediately.\n“Failure to do so will hold the North back – and it is the next generation who will pay the price.” Read More House prices in Newcastle just 3% higher than they were before financial crash ten years ago\nThe problem lies with the way the Government calculates where new homes are needed, says Homes for the North, which represents 18 major housing associations.\nThe group says the methodology predicts how many homes an area needs using old data drawn from historical economic growth projections. A housing estate\nIt means that growing, thriving cities and local authorities are expected to ignore how many workers are expected to move to the area and instead build homes using household projections put together during a period of sluggish economic growth.\nResearch, undertaken by planning and development consultancy Lichfields, found that 13,340 fewer homes a year will be built in the North as a result of the methodology.\nThere will be 16,000 fewer construction jobs, the region would lose £2.37bn in economic output and there will be £19m less in council tax revenue, the research claims. An aerial view of the River Tyne and bridges (Image: PA)\nMs Matthews said: “As our great northern cities continue to thrive both economically and culturally increasing numbers of people are moving to places such as Manchester, Leeds and Newcastle.\n“One of the main attractions - especially for younger people - is the availability and affordability of homes.\n“In the next ten years, the North will need 500,000 new homes to keep up current demand. Yet Government policy isn’t geared up for this.” Read More\nA spokesman for the Ministry of Housing, Communities and Local Government said: “Our new approach is not a target, and we want to see ambitious northern councils building far more homes.\n“We want to see the north thrive with thousands more homes, jobs and better transport links.”\nJohn Healey, Labour’s Shadow Housing Minister, said: “Ministers’ flawed housing targets are a cap on northern aspiration. Ambitious northern areas want to build for the future, but changes set to be made by Ministers will make it harder for them to do that. Read More Higher prices for shoppers and holidaymakers: The cost of a 'no-deal' Brexit revealed\n“The housing crisis is a national crisis. Home ownership has fallen in every region since 2010, and there is visibly rising homelessness in almost every town and city in the country.\n“The Chancellor should use the next Budget to reverse the deep cuts in housing investment made since 2010 and back northern areas to build.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-08-30T07:00:00.000+03:00", "crawled": "2018-08-30T08:07:04.010+03:00", "highlightTitle": ""}