{"organizations": [], "uuid": "05b599f3c937a33bda64f638ec240beeee2801ce", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15042001.ece/ALTERNATES/s1200/0_CFR_NJL_150818sports_01.jpg", "site_section": "http://www.thejournal.co.uk/business/?service=rss", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/mike-ashley-sports-direct-flannels-15041961", "country": "GB", "domain_rank": 21960, "title": "Sports Direct's £31.6m purchase of prime Newcastle property is region's biggest retail deal", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-08-17T14:13:00.000+03:00", "replies_count": 0, "uuid": "05b599f3c937a33bda64f638ec240beeee2801ce"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/mike-ashley-sports-direct-flannels-15041961", "ord_in_thread": 0, "title": "Sports Direct's £31.6m purchase of prime Newcastle property is region's biggest retail deal", "locations": [], "entities": {"persons": [{"name": "mike ashley", "sentiment": "none"}, {"name": "clas ohlson", "sentiment": "none"}], "locations": [{"name": "northumberland street", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "royal mail post office", "sentiment": "none"}, {"name": "astle united", "sentiment": "none"}, {"name": "coreena ford", "sentiment": "none"}, {"name": "aberdeen standard investments", "sentiment": "none"}, {"name": "newcastle united", "sentiment": "none"}, {"name": "h&m", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Sports Direct's £31.6m purchase of prime Newcastle property is region's biggest retail deal The Newcastle United owner's business is also planning changes at its existing Newcastle store Share The building on Northumberland Street bought for £31.6m by Sports Direct (Image: Coreena Ford) Get business updates directly to your inbox Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nSports Direct’s £31.6m purchase of a building on Newcastle’s main shopping street has helped to lift the region’s property deal volumes by 179% in a year.\nThe company led by Newcastle United Mike Ashley made the surprise purchase of the 90,000sqft building at 36-40 Northumberland Street in April, buying it from Aberdeen Standard Investments – owners of the Monument Mall and the adjoining building where Sports Direct’s Newcastle store is based.\nThe building is home to H&M and WHSmith, which also houses a Royal Mail Post Office – but the whole of the basement has lain empty fot the last year following the departure of Swedish retailer Clas Ohlson.\nThe property deal was the biggest retail acquisition recorded in the North East in the second quarter of the year, which saw £234m of commercial property assets change hands, a rise of\n34% on the first quarter and 179% year-on-year, according to the latest UK Investment Transactions (UKIT) report from Lambert Smith Hampton (LSH). Mike Ashley (Image: PA)\nThe deal value is £900,000 short of the original £32.5m property agents Jackson Criss had been instructed to seek, according to its marketing materials.\nWhether the purchase signals plans by the retailer – which also owns the upmarket Flannels brand – to open up in the building have yet to be disclosed.\nHowever, there could be scope in the future for a new Sports Direct or Flannels store to be developed, despite the fact two of the tenants have gone through lease renewals.\nMarketing materials show the building pulls in £1.825m in rent each year – £600,000 from WHSMith, £790,000 from H&M and £435,000 from Clas Ohlson, which is tied into a 15-year lease which started in May 2011.\nH&M signed a 15-year lease in 2013 but WHSMith’s current lease expires in September 2020, potentially creating an opportunity for Sports Direct.\nRegardless of the firm’s plans for the new building, Sports Direct is planning on making changes to its existing store at 15-21 Northumberland Street, according to a building control notice submitted to Newcastle City Council.\nThe notice tells city planners of “proposed refurbishment and alterations to existing retail premises (including any associated drainage works and modifications to services.”\nThe £31.6m deal was one of 14 commercial property deals chalked up across the North East during the quarter, down on the first three months of 2018 but up 15% year-on-year.\nThe Industrial sector was a big performer for the region, with £131m of assets transacted, accounting for a 54% share of volume. Read More Is Mike Ashley thinking of merging Debenhams and House of Fraser?\nHowever, this was underpinned by Tritax Big Box REIT’s forward funding of a new 1.5m sq ft logistics fulfilment centre at Link 66 in Darlington, for £121m.\nAmazon is the global retailer understood to be the billionaire business heading to the site, following the June announcement of the land deal.\nAt £59m, the retail sector accounted for 24% of total investment volume and continuing interest in the student accommodation market resulted in three deals.\nMajor deals included IPIM Singapore’s £19.5m purchase of Mansion Tyne, a 379-bed student accommodation building on Howard Street, Newcastle, while Kout Advisory Ltd paid out £10.4m for student housing scheme Albert Place from Crosslane Student Living.\nThe office sector saw activity fall back significantly during Q2, accounting for less than 5% of total investment volume. LSH’s £10m purchase of Rotterdam House in Newcastle on behalf of UKRO, and £3m purchase of Eagle Star House in Gosforth on behalf of Lok Developments were among largest reported transactions. Read More Newcastle's shipping container village Stack WILL open this week - and it's good news for punters\nPrinces Park in Team Valley, meanwhile, changed hands for £7.5m, with Shell Pensions Trust becoming the new owners.\nLuke Symonds, capital markets at LSH, said: “At £262m, the North East recorded its highest volume since Q3 2013 while, just down the road, total investment volume of £523m in Yorkshire and the Humber was the highest since Q3 2015.\n“Across the UK, Q2 was another very active quarter for industrial portfolios, with £723m transacting across 17 deals up 40% on the five-year quarterly average.\n“Looking ahead, although concerns persist around the uncertainty of Brexit and high profile CVAs in the retail sector, there is plenty of cause for optimism. Our outlook suggests that regional offices may become the sector of choice for savvy and flexible investors seeking good returns.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-08-17T14:13:00.000+03:00", "crawled": "2018-08-18T15:46:21.025+03:00", "highlightTitle": ""}