{"organizations": [], "uuid": "c6a8c7f2e0fbc1ceb52394bddd6ffd9729d55ed4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15092898.ece/ALTERNATES/s1200/0_Frank-Field-resigns-Labour-whip.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/labour-mp-frank-field-resigns-15092820", "country": "GB", "domain_rank": 21960, "title": "Labour MP Frank Field resigns and warns: 'We are seen as a racist party'", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-08-30T20:00:00.000+03:00", "replies_count": 0, "uuid": "c6a8c7f2e0fbc1ceb52394bddd6ffd9729d55ed4"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/labour-mp-frank-field-resigns-15092820", "ord_in_thread": 0, "title": "Labour MP Frank Field resigns and warns: 'We are seen as a racist party'", "locations": [], "entities": {"persons": [{"name": "frank field", "sentiment": "negative"}, {"name": "birkenhead", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "field", "sentiment": "none"}, {"name": "mr field", "sentiment": "none"}, {"name": "nick brown", "sentiment": "none"}], "locations": [{"name": "merseyside", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "negative"}, {"name": "house of commons", "sentiment": "none"}, {"name": "condemning labour", "sentiment": "none"}, {"name": "invalid email labour", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Labour MP Frank Field, who has resigned as a Labour MP (Image: PA) Get daily updates directly to your inbox Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nLabour MP Frank Field has resigned as a Labour MP and will sit in Parliament as an independent, after warning: “We are increasingly seen as a racist party”.\nCondemning Labour leader Jeremy Corbyn , he warned of “Labour’s leadership becoming a force for anti-Semitism in British politics”.\nMr Field, who has represented Birkenhead in Merseyside for almost 40 years, made the comments in a letter to party chief whip and Newcastle MP Nick Brown. Read More 16,000 fewer jobs and £2.37bn worse off: The bleak 'housing crisis' facing the North\nHe also said: “A culture of intolerance, nastiness and intimidation now reigns in too many parts of the party”.\nIt means he has resigned the Labour whip in Parliament, but he remains a member of the Labour Party and stays on as an MP. Mr Field also said he hopes to rejoin the Labour group in the House of Commons - but only after “great changes in the leadership’s stance on the issues outlined in this letter”. Jeremy Corbyn (Image: PA)\nHowever, Labour sources suggested the decision could lead to him being expelled from the Labour Party too.\nMr Field, who backed leaving the EU in the 2016 referendum, is often seen as being on the right of the Labour Party.\nBut he was urged to think again about quitting by left-winger Ronnie Campbell, MP for Blyth Valley, who is a staunch supporter of Mr Corbyn.\nMr Campbell said: “Im sorry to hear this. I always got on well with Frank. I hope it’s not long before he gets back in.”\nHe highlighted Mr Field’s work over decades calling for improvements to the benefits and pensions systems in order to reduce poverty.\n“We are on different wings of the party but he’s done good things to help the poor and he still has a lot to offer.” Ronnie Campbell MP (Image: Newcastle Chronicle)\nMr Campbell said Labour had to fight anti-Semitism within the party. He added: “There are hotheads like that in every party. We have to fight them.”\nMr Field, a former minister for welfare reform, had faced criticism from some party members for his voting record on key Government Brexit legislation.\nEarlier this year he was one of four Labour MPs who voted with the Government to prevent Britain joining a post-EU customs union, on the grounds that working-class voters “gave politicians a clear instruction to take the country out of the EU”.\nIn his letter, Mr Field said: “I am resigning the whip for two principal reasons.\n“The first centres on the latest example of Labour’s leadership becoming a force for anti-Semitism in British politics.\n“The latest example, from last week, comes after a series of attempts by Jeremy to deny the past statements and actions by him were anti-Semitic.\n“Britain fought the Second World War to banish these views from our politics, but that superhuman effort and success is now under huge and sustained internal attack.\n“The leadership is doing nothing substantive to address this erosion of our core values.\n“It saddens me to say that we are increasingly seen as a racist party. This issue alone compels me to resign the whip.”\nMr Field also raised concern about the “thuggish conduct” of some members in his local party and the lack of action against them. Read More Newcastle MP who boycotted St James' Park over Wonga row welcomes firm's potential collapse\nA Labour source told the Press Association: “Frank has been looking for an excuse to resign for some time.”\nThey added that it was not possible to resign as a Labour MP and remain a member of the Labour Party.\nMr Field is understood to be having a meeting with Labour chief whip Nick Brown on Friday to discuss the matter further.\nA Jeremy Corbyn spokesperson said: “Jeremy Corbyn thanks Frank Field for his service to the Labour Party”.\nLabour deputy leader Tom Watson described the resignation as a “serious loss”.\nHe said: “This is a serious loss to the party and I deeply regret Frank’s decision. It reflects both the deep divisions in the party and the sense of drift engulfing us.\n“It is a major wake up call. We cannot afford to lose people of such weight and stature.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-08-30T20:00:00.000+03:00", "crawled": "2018-08-30T21:45:07.000+03:00", "highlightTitle": ""}