{"organizations": [], "uuid": "4862caf3f7676d6384f6c0fc6c8c0fc4ff30576d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14771393.ece/ALTERNATES/s1200/County-Hall-2.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/labour-councillor-hits-out-threatening-14996984", "country": "GB", "domain_rank": 21960, "title": "Labour councillor hits out at 'threatening and malicious' email implying false election promises", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-08-06T18:05:00.000+03:00", "replies_count": 0, "uuid": "4862caf3f7676d6384f6c0fc6c8c0fc4ff30576d"}, "author": "Hannah Graham", "url": "https://www.chroniclelive.co.uk/news/north-east-news/labour-councillor-hits-out-threatening-14996984", "ord_in_thread": 0, "title": "Labour councillor hits out at 'threatening and malicious' email implying false election promises", "locations": [], "entities": {"persons": [{"name": "grant davey", "sentiment": "none"}], "locations": [{"name": "northumberland", "sentiment": "none"}, {"name": "morpeth", "sentiment": "none"}], "organizations": [{"name": "news labour", "sentiment": "negative"}, {"name": "northumberland county council", "sentiment": "none"}, {"name": "northumberland labour", "sentiment": "none"}, {"name": "arch", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Labour councillor hits out at 'threatening and malicious' email implying false election promises The Northumberland Labour group alleges fake emails have been sent out to \"undermine their reputation\" by using \"lies and deception\" Share Northumberland County Council headquarters in Morpeth (Image: Copyright Unknown) Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nThe Northumberland Labour leader alleges “fake” emails were sent to Labour councillors, purporting to be from an activist associated with the local party.\nCouncillor Grant Davey labelled the messages, which implied dishonesty on the part of councillors seeking election, “threatening and malicious”.\nPolice say they’re investigating a complaint of harassment in connection to the emails.\nOne such email, seen by ChronicleLive, threatened “serious consequences” for councillors who criticised the former Labour administration over its handling of Northumberland development company Arch.\nIt implied councillors had lied to win elections - but the local Labour leader insists the message is not accurate and did not come from his party. Coun Grant Davey, the Labour leader (Image: Copyright Unknown)\nRevelations about lavish spending on hospitality and credit cards at the soon-to-be scrapped development company have emerged since the Conservative administration took over the council, promising to replace it with the new Advance Northumberland. However, Labour have argued the probe has become a “witch hunt” and questioned whether an often-referenced referral to Northumbria Police will ever become a full-blown criminal enquiry. It’s understood the police have been “working with” the council to establish whether there is a suspicion of criminal offences at Arch, but have not yet announced a criminal investigation.\nThe email opens “Dear comrade” and accuses a member said to have shared an article from an anti-Labour Facebook site of “bringing shame upon yourselves and the party”. Read More Northumberland Labour defends Arch for housing convicted fraudster in taxpayer-funded house with car\nIt said: “In respect of the press stories relating to Arch I would like to remind all councillors that a number of you owe your positions to the PR campaign we oversaw during the regulated period of last year’s council election campaign. Although the promises weren’t necessarily costed in respect of a business plan we would have found a way to deflect their non-delivery against national circumstances.”\nIt claims that “quick thinking and hastily constructed spending commitments” are the reasons some councillors are “receiving your councillors’ allowances right now”.\nAnother two emails from the same address were sent to individual councillors, seeming to ask for information relating to ongoing planning cases. It’s not known exactly how many councillors received such messages.\nThe emails appeared to come from former Arch contractor Graham Harper. Mr Harper attracted national attention last week after a Times article highlighted an “extremely generous” package offered to him while working for Arch under the previous administration, which included access to a house and a car.\nThough not a Labour councillor, Mr Harper is associated with the Labour group as an activist.\nHowever, he says he did not send the emails, and has never used the email address which they came from. He said he was “very concerned” about emails “seeking to gain information and sow disinformation” using his name. He called on the council to act to “protect its members” over the alleged fake emails.\nCoun Davey said: “The tone and content of the fake email is both threatening and malicious and the action is likely to be a criminal act. It is a shocking escalation of a long running and concerted campaign to undermine the reputation of Arch and the council through the use of nothing more than lies and deception.” Read More North East councils NOT carrying out any Brexit impact studies\nA Northumbria Police spokesperson said it had received a report of suspected harassment, and that “inquires into the matter are ongoing”.\nA spokesperson for Northumberland County Council said: “The email originates from outside of the county council and because of this, the council has no control over the email account, its content, or any other external email accounts.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-08-06T18:05:00.000+03:00", "crawled": "2018-08-06T18:58:22.018+03:00", "highlightTitle": ""}