{"organizations": [], "uuid": "c22ea6f8d2dd5f69a1ac25b84b33b07a13a7a882", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14852995.ece/ALTERNATES/s1200/2_JS156326181.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14988462", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: House of Fraser rescue deal boost as it settles challenge from landlords", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-08-06T10:05:00.000+03:00", "replies_count": 0, "uuid": "c22ea6f8d2dd5f69a1ac25b84b33b07a13a7a882"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14988462", "ord_in_thread": 0, "title": "Business Breakfast LIVE: House of Fraser rescue deal boost as it settles challenge from landlords", "locations": [], "entities": {"persons": [], "locations": [{"name": "uk", "sentiment": "none"}], "organizations": [{"name": "coreena ford amazon uk", "sentiment": "negative"}, {"name": "house of fraser", "sentiment": "negative"}, {"name": "companies house", "sentiment": "none"}, {"name": "amazon uk", "sentiment": "none"}, {"name": "amazon uk services limited", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford Amazon UK’s corporate tax bill sparks calls for re-think on business rates\nCalls for a re-think on the ways businesses are taxed have intensified after it was revealed Amazon UK’s corporate tax bill fell by £2.8m last year despite profits nearly trebling .\nThe online retail giant’s UK bill came in at £4.6m last year, down from £7.4m a year earlier, Amazon UK Services Limited accounts show.\nBut the company only paid £1.7m in tax after deferring £2.9m of that total. That was despite pre-tax profits jumping to £72.4m from £24.3m in 2016, according to figures filed to Companies House.\nAmazon said that it pays “all taxes required in the UK and every country where we operate” but the reduced bill has highlighted what many feel is the unfairness between online and traditional bricks-and-mortar retailers.\nThis week has seen separate figures which show that online retail has seen sales up 16.8% year on year during the first half while the UK high street reported six consecutive months of negative growth.\nThe threat to the future of House of Fraser has also shown the challenges facing the retail sector, which Next chairman Lord Wolfson this week said was being fuelled by the current business rates system.\nMartin McTague, policy chairman at the Federation of Small Businesses (FSB), said: “The rise of online shopping has undoubtedly caused many challenges for small businesses. Most small firms are moving with the times though, and online sales are often a natural complement to high street shops.\n“Small businesses are at the heart of their communities, providing a hub for people to shop, meet and socialise. That’s not something a retailer operating exclusively online is going to give you.\n“We need to rebalance the taxation system.” Amazon UK’s corporate tax bill fell by £2.8m last year despite profits nearly trebling (Image: PA) 8.50 Coreena Ford Holland & Barrett eyes up foreign acquisitions under new owner\nHolland & Barrett is targeting sales of £2 billion under its new ownership and is eyeing up foreign acquisitions to fuel its ambitious growth plans.\nThe health food chain was bought by L1 Retail, a retail investment fund controlled by Russian billionaire Mikhail Fridman, for £1.74bn last year.\nPeter Aldis, who has been chief executive of Holland & Barrett for close to 10 years, said the board was currently hashing out a strategy with its new owners. “When we come up with a strategy and the plans, which we’re working on, the sort of broad goal is that we’d like to see that trebling of the business, with £2 billion worth of revenue, in a 10-year window,” he said.\n“And we’re one year in, by the way - so that will now be a nine-year window.\n“So they are pushing hard, like most good owners do, to do the right thing, and the beauty about that is they are willing to invest money to achieve it.”\nTo expand internationally, Mr Aldis expects Holland & Barrett will acquire some businesses, but the retailer will continue to grow organically in the UK. “Internationally, we ultimately see the business being bigger outside the UK than within the UK and that is not the case today,” he said.\n“So we have small businesses in China, in the Middle East, and we want to make sure we are creating plans to enable them to grow.”\nHe said that opening physical stores could be a challenge in some countries, but that in those cases the brand could be introduced online instead. Holland and Barrett store Coreena Ford Newcastle business accelerator opens its doors for start-ups and older firms\nA successful business accelerator is gearing up to take in its second cohort of firms after a change of ownership.\nThe NatWest Entrepreneur Accelerator programme has taken over the former E-Spark programme on Newcastle’s Quayside which helped launch a number of successful firms in the region, including baby yoga franchise Kalma Baby, milkshake manufacturer Canny, and sports company the Futsal Partnership.\nThe accelerator is now run by NatWest, which has vowed to continue to support entrepreneurs looking to scale-up their operations.\nAdam Barrass, entrepreneur development manager at NatWest, said: “The programme used to be E-Spark powered by NatWest, but in March E-spark decided to go off and do their own piece separately. It was an amicable decision and we saw the hubs as a great proposition and we brought them in-house to take them from good to great.\n“The bank has 12 hubs and fundamentally the programme and the ethos are exactly the same. It is the UK’s largest fully funded business accelerator programme and the focus is on businesses looking to scale up and grow.”\nThe NatWest scheme differs from E-Spark in that it operates two programmes; the main six month accelerator and an eight-week pre-accelerator for firms that do not need as much support in their early stages. Adam Barrass, entrepreneur development manager at NatWest (Image: Staff) 8.41 Coreena Ford Regus owner IWG's shares tumble as takeover talks come to an end\nShares in IWG -the owner of workspace provider Regus - plunged this morning after it said it will not continue talks with a number of private equity firms which were looking to buy the company.\nThe serviced office provider has walked away from discussions with Starwood, Terra Firma and TDR, saying that none of them could deliver a deal at the right price.\nWhen the stock market opened, IWG’s shares fell by 23% or 68.7p to 231.3p.\nIn a statement, IWG said: “The board remains confident in the long-term value of and opportunities for IWG.\n“It is the global leader in the co-working and flexible workspace sector, a market that is experiencing its most exciting stage of growth in over 30 years as increasing numbers of companies look to capture the strategic and financial advantages of flexible working.”\nThe group also released its half-year results, which showed IWG’s profits were knocked by weakness in the UK market, which the firm said would be short lived.\nIWG’s revenue rose 7.1% to £1.2bn in the six months ended June 30. However, operating profit fell 29% to £60m as IWG took a hit on its UK business and invested in new staff, marketing and its continued growth. The London-listed group has serviced offices in around 120 countries, and operates brands including Regus, Open Office and Signature. 8.38 Coreena Ford Durham Cathedral joins trade mission to China to promote the World Heritage Site\nDurham Cathedral is targeting the lucrative Far Eastern tourist market after joining a trade delegation to China to promote the World Heritage Site.\nThe cathedral, which houses the Shrine of St Cuthbert and the Treasures of St Cuthbert in the new Open Treasure exhibition experience, took part in the Destination Britain China trade mission hosted by VisitBritain.\nThe event served up an introduction with more than 100 tour operators and travel intermediaries from across China and Hong Kong, with business-to-business meetings and networking over three days.\nThe cathedral’s representative also added two-day meetings with major tour operators in their China offices.\nThe purpose was to present packages to visit Durham Cathedral, including extending the stay overnight to enjoy the amenities that Durham City has to offer.\nDurham Cathedral received support from the European Regional Development Fund, delivered by the Department for International Trade, to help fund the visit. Ruth Robson and Chinese visitors to Durham Cathedral (Image: Kevin Gibson Photography Ltd) 8.29 New commission set up to examine impact of automation on workers\nA new commission has been set up to examine the impact of automation on employment.\nSenior Labour MP Yvette Cooper will chair the commission which will examine how to create and protect good quality jobs and support workers through the process of rapid technological change.\nThe panel, set up by the Community union and the Fabian Society, will report in 2020.\nThe scale of the challenge was underlined by a poll which indicated that more than a fifth of workers feared their job would be rendered obsolete in the next decade.\nThe poll suggested that workers were generally positive about their own ability to cope with change - 73% are confident they will be able to adapt and update their skills if new technology affects their job and 53% suggested they were were optimistic about their future working lives and job prospects when thinking about the changes in technology in the workplace by 2028.\nHowever, 22% agreed they were worried their current job may not be needed by 2028 and 36% thought their role would change for the worse.\nOnly 9% of workers think that the UK government is taking steps to prepare them for new workplace technologies; only 16% employees with a trade union in their workplace think that their unions are taking steps to help ensure that new technologies improve their working life.\nRoy Rickhuss, general secretary of Community, said: “These figures should serve as a wake-up call for all trade unions. The vast majority of workers in unionised workplaces do not believe we are supporting them to cope with technological change. Automation cannot simply be opposed, rather it should be made to work in the interests of working people.”\nFormer work and pensions secretary Ms Cooper said:\nThe digital revolution means technology and jobs are changing faster than ever.\nThis survey of workers found that almost a quarter of workers are worried that their job will no longer be needed.\nAnd whilst it found that most people are optimistic that they will be able to change and update their skills, they also say they are not getting any help or support to train or adapt from the government, their employer or a trade union.\nIt is vital that action is taken now to ensure changing technology doesn’t widen inequality and to make sure all workers feel the benefits.\nTechnology can have great benefits as well as create new challenges. Almost half of those surveyed said they thought their job would improve with new technology, however nearly a quarter were worried that their job would go altogether.\nIt’s vital that action is taken now to make sure technology creates new better jobs and that all workers benefit from new technology. Robots on a production line (Image: PA) 8:20 KEY EVENT Fresh bid to bring champagne bar to Newcastle Central Station\nA renewed bid to open a champagne bar and real ale retreat in Newcastle Central Station has been launched .\nThe team behind Stack Newcastle and Hadrian’s Tipi first announced their proposals last year, initially hoping to take on half of the glazed entrance to the station and transform it into a haven for both locals and visitors to the area.\nThose initial plans were scaled down significantly after conservationists raised concerns that the scheme would detract from the look of the Grade I-listed porte-cochère.\nDanieli Holdings, which also runs care and security businesses, changed the proposals to make use of just two vacant retail pods based on one side of the portico area, with the champagne bar – potentially called Bubbles – and Real Ale Retreat serving drinks and food to people within the grand entrance.\nThe scheme was originally knocked back by planners, but the firm has now made a listed building application to bring the scheme back to the planning table. Coreena Ford HSBC Banks increased profits amid launch of new strategy\nHSBC has boosted its profits as it pushes ahead with the strategy put in place by new chief executive John Flint.\nThe lender has reported pre-tax profit of $10.7bn (£8.2bn) for the half-year ended June 30, up from $10.2bn (£7.9bn) for the same period in 2017.\nAdjusted pre-tax profits fell from $12.4bn (£9.6bn) to $12.1bn (£9.3bn), which HSBC said was due to hiring more staff and expanding its digital network.\nThe bank’s revenue for the period was $27.3bn (£21bn), up 4.2% year on year from $26.2bn (£20.2bn).\nHSBC also announced that Jonathan Symonds, who is currently chairman of HSBC Bank, will become deputy group chairman of HSBC Holdings.\nMr Flint, HSBC’s group chief executive, said: “HSBC is a strong business with a number of clear commercial advantages. “In particular, we are a leading international bank with a network that gives us unparalleled access to high-growth markets, particularly in Asia and the Middle East.”\nHSBC said in June that it was aiming to simplify its business, while also investing billions in technology under Mr Flint, who was appointed chief executive earlier this year. The lender released an eight-point plan, saying it will look to boost growth across its Asia business, complete the ring-fencing of its UK bank, boost its share of the mortgage market and improve customer service.\nMark Tucker, HSBC’s group chairman, said: “We have created a strategy that builds on past achievements to improve the group’s competitiveness and increase value for shareholders.\n“It focuses on areas where HSBC is already strong, but which also hold the greatest capacity for revenue growth and value creation.”\nJasper Lawler, head of research at London Capital Group, said the results from HSBC, Europe’s biggest bank, made for a positive start to the week for European markets. A sign outside a HSBC branch (Image: Joe Giddens/PA Wire) 8:10 Tesco partnership with Carrefour to launch in October\nTesco has said its strategic partnership with France’s Carrefour will become operational in October.\nThe UK supermarket has now formally entered into its strategic alliance with Carrefour, under an arrangement that has been set out for a three-year period. In a statement, Tesco said the relationship will cover global suppliers, and will allow for the joint purchasing of own-brand goods and store equipment such as trolleys, fixtures and cleaning supplies.\nTesco first announced the deal in July, saying it would improve the quality and choice of products available to its customers. The supermarket is also aiming to lower prices on the back of the deal as it fends off competition from the likes of Aldi and Lidl. The move came after Sainsbury’s promised lower prices on a range of everyday items as part of its planned £12 billion merger with rival Asda. However, French regulators are probing the Tesco-Carrefour relationship to understand what impact it could have on suppliers. The Autorite de la Concurrence said it was looking into the competitive impact of the purchasing agreement to assess its effect on the food sector, both for suppliers and consumers. The regulator is also investigating similar alliances between France’s Auchan, Casino, Schiever, and Germany’s Metro, and Carrefour and Systeme U. The probe has been set up because a new wave of agreements between grocers are larger in scale than the deals signed previously. Moody’s credit ratings agency has also said that grocery tie-ups will squeeze suppliers. The agency said lower purchasing costs would ultimately lead to lower revenue for suppliers across the board, even if the supermarkets offer to buy in larger volumes as part of new agreements. Tesco at Kingston Park in Newcastle 8:05 KEY EVENT House of Fraser settles challenge from landlords to boost rescue hopes\nHouse of Fraser has settled a legal challenge from landlords over plans to close 31 of its 59 stores - including two in the North East - next year.\nThe agreement, the terms of which are confidential, removes one obstacle as the troubled department store seeks a rescue deal.\nThe company’s store closure programme was announced in June but was thrown off course when landlords issued a legal challenge, saying they were unfairly prejudiced by the process.\nCreditors for House of Fraser approved the company voluntary arrangement (CVA), but landlords had started legal action filed in Scottish courts.\nA spokesperson for the Joint Supervisors of the House of Fraser CVAs said: “The Joint Supervisors can confirm that there has been a settlement to the legal challenge to the House of Fraser CVAs.\n“This commercial settlement has been reached to avoid the costs of litigation, and allows the companies to continue its investment process without the CVAs being subject to the risk of further legal proceedings.”\nNewcastle United owner Mike Ashley, who has an 11% stake in the retailer, has previously been widely tipped as the most likely person to rescue the group.\nThe firm plans 31 store closures around the UK through the Company Voluntary Arrangement (CVA), which will also allow it to secure rent reductions on its remaining shops.\nClosures will affect up to 2,000 House of Fraser staff and a further 4,000 across brands and concessions. Its stores in Middlesbrough and Darlington are among those that will shut.\nHouse of Fraser is one of a number of high street stores to seek controversial CVAs amid a rise in closures and failures.\nRetailers have been hammered by Brexit-fuelled inflation, soaring business rates and falling consumer confidence. Toys R Us and Maplin collapsed earlier this year, while the likes of Prezzo, Byron and Jamie’s Italian have shut restaurants and culled hundreds of jobs. House of Fraser, Linthorpe Road, Middlesbrough. More On", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/14988462;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-08-06T10:05:00.000+03:00", "crawled": "2018-08-06T11:31:02.000+03:00", "highlightTitle": ""}