{"organizations": [], "uuid": "a6b6d3975e1f50512a7345adf32702c72d684dbd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article11555621.ece/ALTERNATES/s1200/0_JS91195470.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/north-east-changes-mind-brexit-15060105", "country": "GB", "domain_rank": 21960, "title": "The North East changes its mind about Brexit as new poll shows voters are split 50/50", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-08-23T02:01:00.000+03:00", "replies_count": 0, "uuid": "a6b6d3975e1f50512a7345adf32702c72d684dbd"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/north-east-changes-mind-brexit-15060105", "ord_in_thread": 0, "title": "The North East changes its mind about Brexit as new poll shows voters are split 50/50", "locations": [], "entities": {"persons": [{"name": "north eas", "sentiment": "negative"}, {"name": "brexit", "sentiment": "negative"}, {"name": "stefan rousseau/pa wire", "sentiment": "none"}, {"name": "boris johnson", "sentiment": "none"}, {"name": "yougov", "sentiment": "none"}, {"name": "peter kellner", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News The North East changes its mind about Brexit as new poll shows voters are split 50/50 North East voters backed Brexit in 2016 but new polling shows 50% now want to stay in the EU Share Former Mayor of London Boris Johnson with the Vote Leave campaign bus (Image: Stefan Rousseau/PA Wire) Get daily updates directly to your inbox Subscribe Could not subscribe, try again later Invalid Email\nThe North East is no longer backing Brexit, according to a new opinion poll.\nThe region that voted overwhelmingly for Brexit in 2016 is split 50/50 on whether to leave or stay in the EU , according to new polling by YouGov.\nAnd more people would back a fresh referendum on Brexit than oppose holding a vote.\nIt marks a turnaround from the referendum two years ago, when 58% of North East voters backed Brexit.\nPolling expert Peter Kellner, a former president of YouGov, said: “On the night of the Brexit referendum two years ago, the early results from the North East showed the strength of Leave support, especially in Labour’s northern heartlands.\n“YouGov’s new survey shows that a public vote today would produce a very different result. Instead of the crushing 16-point victory for the Leave campaign two years ago, the two sides are running neck-and-neck, with both on 50 per cent.”\nThe polling was commissioned by the People’s Vote campaign, which is calling for a referendum on whether or not to support the deal agreed between the EU and the UK, which would include the option of staying the EU, It also wants a referendum on whether to press ahead with Brexit if there is no deal at all. Read More Brexit could damage access to NHS services 'for decades to come'\nThe findings were revealed as the campaign published a detailed impact study on how Brexit would affect the North East. It says the region would lose 10% of economic output over the next decade under a “no deal” scenario, meaning every man, woman and child in the North East would be £3,000 a year worse off.\nThe Government says it intends to agree a deal with the EU, but is also making plans to leave without a deal if no agreement can be reached.\nBuilding on the success of the People’s Vote march in London in June, hundreds of people will come together in a rally at the Assembly Rooms in Newcastle on Saturday 25 August in order to back calls for a “People’s Vote”.\nYouGov found that 42% of North East voters would vote to leave the EU if a referendum was held tomorrow, and 42% would vote to stay in. If people who said they did not know or would not vote at all are excluded then voters are split 50/50 between staying in and leaving.\nThe disappearance of the Leave campaign’s 16-point margin of victory appears to have been driven by younger voters with those aged under 50 dividing two-to-one for staying in the European Union while voters over 50 are still two-to-one in favour of Brexit.\nThe survey also found that 40% of North East voters would support a public vote on the outcome of negotiations with the European Union about Brexit, with 35% opposed and 15% saying they don’t know.\nThe findings of the poll is being seized upon by Labour MPs in the region who say they want their party leadership to reflect better the views of members and voters. Read More Children from wealthy families go to better schools, new research shows\nIn the North East, Labour supporters now want to stay in the EU by almost three-to-one – 73% to 27% once “don’t knows” are taken out. A similar proportion of Labour supporters, 57% to 21% want a People’s Vote on Brexit, with a further 23% saying they “don’t know”.\nPhil Wilson, Labour MP for Sedgefield, said: “Brexit is the greatest issue facing the country since the Second World War and it is only right that the British people are given the opportunity to test their original decision to Leave the EU in light of the facts we now know that we didn’t know then. That is why I believe people should have a right to a final vote on the final deal, whatever it is.\n“I know the North East voted for Brexit, but attitudes and minds are starting to change. Democracy did not end on June 23rd 2016. And today we can see attitudes are changing. I believe Brexit is a moral issue for politicians.\n“Those who believe Brexit will be a disaster for the UK can no longer remain silent. It’s time to speak up for a People’s Vote on the final deal.”\nPeter Kellner said: “The swing in the North East is higher than the national average; and there is a clear reason for this. The region is more strongly Labour than any other: the party has 26 of the North East’s 29 MPs. And while the views of the relatively small number of Conservative voters towards Brexit are virtually unchanged, Labour voters have moved from 59% to 68% Remain.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-08-23T02:01:00.000+03:00", "crawled": "2018-08-23T02:36:43.074+03:00", "highlightTitle": ""}