{"organizations": [], "uuid": "1d624311b534295956d826ca6a7d4eb2ba214c8a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article1924880.ece/ALTERNATES/s1200/0_Wetherspoons-main.jpg", "site_section": "http://www.westernmorningnews.co.uk/editorschoices.rss", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/devon-news/wetherspoons-banning-dogs-devon-pubs-1924557", "country": "GB", "title": "Wetherspoons is banning dogs from its Devon pubs AND beer gardens - and customers are furious", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-08-22T13:51:00.000+03:00", "replies_count": 0, "uuid": "1d624311b534295956d826ca6a7d4eb2ba214c8a"}, "author": "Joel Cooper", "url": "https://www.devonlive.com/news/devon-news/wetherspoons-banning-dogs-devon-pubs-1924557", "ord_in_thread": 0, "title": "Wetherspoons is banning dogs from its Devon pubs AND beer gardens - and customers are furious", "locations": [], "entities": {"persons": [{"name": "richard hopkins", "sentiment": "none"}, {"name": "collingwood", "sentiment": "none"}, {"name": "wetherspoons", "sentiment": "none"}, {"name": "jayne lewis", "sentiment": "none"}], "locations": [{"name": "devon", "sentiment": "none"}, {"name": "newton abbot the talk of the town", "sentiment": "none"}], "organizations": [{"name": "white hart hotel", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The Richard Hopkins, Newton Abbot The Talk of the Town, Paignton The White Hart Hotel, Okehampton The Admiral Collingwood, Ilfracombe The Gog and Magog, Plymouth The Union Rooms, Plymouth What are people saying about the ban?\nIlfracombe resident and Wetherspoons customer Jayne Lewis posted a picture of the notice at the Admiral Collingwood branch to Facebook, saying she was \"disappointed and annoyed\" by the decision.\nShe said: \"We regularly take our dog there and enjoy a drink outside. Our dog is no problem and happily sits beside our table.\n\"I’m not sure if we will carry on using spoons so much as we will usually take Flo with us.\nAnd her post in the Gossip Around Ilfracombe Facebook page attracted many similar comments.\nOne said: \"Not only do well behaved dogs have to sit outside while “well behaved children“ climb all over the walls making our dogs bark and misbehave, we now have to sit in the cold and rain. Read More 'You're making life hell in this village': Anger as dog walkers steal second sign in two days from Devon beach\n\"I’ve used Wetherspoons since the day it opened, sorry your done with my money.\"\nAnother said: \"I like how Spoons treated this problem very seriously and waited till the grockles (tourists) leave before enforcing it! If it’s an issue surely it should be in effect immediately.\"\nOne person said: \"Complete madness! What are they thinking? So many local people and tourists have dogs. This is beyond words.\" poll loading Will you stop going to Wetherspoons when they ban dogs? 0+ VOTES SO FAR Yes, I used to enjoy taking my dog there and there's no good reason for this ban No, I think it's good that they have banned them - a pub and restaurant is not the place for a dog Frankly my dear, I don't give a damn\nAnother added: \"I don't think this is good news.\"\nA visitor to Ilfracombe said: \"As a holiday maker to Ilfracombe and the surrounding areas, I can’t leave my dog “at home”, it’s his holiday too dammit.\"\nBut some people saw it as good news - for a variety of reasons.\nOne said: \"Its great news, another good reason to use local pubs.\"\nAnother said: \"Dog owners could always go and spend their money in one of our pubs that does allow dogs I suppose. Read More Wetherspoons' boss Tim Martin on his favourite Exeter pubs, the best ‘spoons, students, Brexit and pink gin\nSomeone else commented: \"Not sure what the fuss is about. I like to drink and I also have a dog. A bar restaurant isn’t the place for a dog.\"\nAnother said: \"I like to go for a drink in places that don't let dogs in, I also like places where they don't let children in.\n\"I also like that places that let dogs in and I also like places where they let children in.\n\"Thank God there is a choice. Just go where you feel comfortable, it's not a necessity to go in a pub or restaurant it's a choice, dear me! Like us on Facebook ", "external_links": ["https://mab.data.tm-awx.com/rhs&quot;,&quot;lazyLoadHTML&quot;:&quot;true&quot;,&quot;modularCss&quot;:&quot;true&quot;,&quot;swipeNavigation&quot;:&quot;true&quot;}}}"], "published": "2018-08-22T13:51:00.000+03:00", "crawled": "2018-08-22T14:35:56.036+03:00", "highlightTitle": ""}