{"organizations": [], "uuid": "a32a14cb90ade172325ec486b56bff5f38153c99", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article10396502.ece/ALTERNATES/s1200/JS68721045.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/brexit-papers-barry-gardiner-deal-15064603", "country": "GB", "domain_rank": 21960, "title": "Higher prices for shoppers and holidaymakers: The cost of a 'no-deal' Brexit revealed", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-08-23T16:45:00.000+03:00", "replies_count": 0, "uuid": "a32a14cb90ade172325ec486b56bff5f38153c99"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/brexit-papers-barry-gardiner-deal-15064603", "ord_in_thread": 0, "title": "Higher prices for shoppers and holidaymakers: The cost of a 'no-deal' Brexit revealed", "locations": [], "entities": {"persons": [{"name": "dominic raab", "sentiment": "none"}, {"name": "onwurah", "sentiment": "none"}, {"name": "chi onwurah", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "newcastle airport", "sentiment": "none"}, {"name": "newcastle central", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nShoppers and holidaymakers will face higher prices if the UK leaves the EU without a deal, the Government says.\nConsumers shopping in the EU or buying online from an EU-based firm could be hit with surprise charges on their purchases.\nThe warning was included in papers released by the Government to prepare the country for Brexit, which is due to take place on March 29 next year.\nBrexit Secretary Dominic Raab said he was confident of agreeing a deal with the EU - but the UK was prepared to go ahead without one if needed. A plane leaving Newcastle Airport (Image: Owen Humphreys/PA Wire)\nHe insisted: “I’m still confident a good deal is within our sights.”\nBut Labour politicians, including Newcastle Central MP Chi Onwurah , said that if the UK was faced with a ‘no deal’ Brexit then there would be a case for holding a second referendum on leaving.\nMs Onwurah said: “Faced with such an economic wrecking ball from this Government we need to keep all options on the table.”\nThe Government papers also warn that UK citizens living in Europe face the possibility of losing access to their pension income and other financial services. Chi Onwurah speaking at the Regional Labour conference at Newcastle University (Image: Newcastle Chronicle)\nPharmaceutical companies were asked to stockpile “six weeks supply of medicines in the UK - on top of their own normal stock levels”.\nAnd businesses that export to the EU, which include major North East employers, were encouraged to start spending money on logistics software to prepare for new trading regulations.\nJonathan Walker, assistant director at North East England Chamber of Commerce, said: “Businesses have been calling for clarity on how to prepare for Brexit for a long time and while it is disappointing these notices have not been available before now, they are a step forward. Read More", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-08-23T16:45:00.000+03:00", "crawled": "2018-08-23T18:23:12.002+03:00", "highlightTitle": ""}