{"organizations": [], "uuid": "7d8a334b4f99370cd6eb224816d3a58a3e850ab0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.cornwalllive.com/incoming/article1633734.ece/ALTERNATES/s1200/1_MONEY-Visa-071761.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/devon-news/hit-shock-credit-debit-card-1929803", "country": "GB", "title": "We will be hit with shock credit and debit card charges after Brexit", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-08-23T14:30:00.000+03:00", "replies_count": 0, "uuid": "7d8a334b4f99370cd6eb224816d3a58a3e850ab0"}, "author": "Neil Shaw", "url": "https://www.devonlive.com/news/devon-news/hit-shock-credit-debit-card-1929803", "ord_in_thread": 0, "title": "We will be hit with shock credit and debit card charges after Brexit", "locations": [], "entities": {"persons": [{"name": "neil shaw", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "digital", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "We will be hit with shock credit and debit card charges after Brexit The Government revealed the latest bad Brexit news today Share Neil Shaw Head of Digital, live and trending for PlymouthLive, DevonLive and CornwallLive 12:30, 23 AUG 2018 Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nBritons visiting the EU could be slapped with millions of pounds in surprise credit and debit card charges in the event of a no-deal Brexit, the Government has warned.\nA technical paper released on Thursday laid bare the risks facing UK banking and payments customers if the Government fails to clinch a trade agreement that covers financial services.\nIn the case of a no-deal Brexit, UK-based payment service providers would lose direct access to the EU's payment infrastructure.\nCustomers, including businesses using providers to process payments in euros, could also \"face increased costs and slower processing times for euro transactions\", the Government paper warned. Read More Wetherspoons is banning dogs from its Devon pubs AND beer gardens - and customers are furious\n\"The cost of card payments between the UK and EU will likely increase, and these cross-border payments will no longer be covered by the surcharging ban,\" it added.\nThe ban prevents businesses from charging customers for paying by the likes of PayPal or debit or credit cards, which Treasury earlier this year characterised as \"rip-off fees\".\nConsumers shopping in the EU or buying online from an EU company with a UK card, could be hit with surprise charges on their purchases, with some retailers charging more than the cost of processing payments.\nThe Treasury estimated that surcharging cost Britons around £166 million in 2015.\nThe EU surcharge ban came into force in January. Read More Laura Ashley to close stores as profits nosedive\nThe Government said it is looking to align domestic law around payments with rules already set up in the EU in hopes of remaining a member of the Single Euro Payments Area.\nHowever, that would only ensure that \"lower value euro transactions are processed in the same amount of time as they are today\", meaning larger payments may still face delays.\nThe technical paper also echoed warnings from the Bank of England which earlier this summer said the EU needed to do more to prevent Brexit causing havoc in financial markets.\nThe Government said clients across the European Economic Area would no longer be able to use the services of UK-based investment banks, while cross-border contracts may no longer be valid.\nIt puts a key industry at risk, with financial services having contributed more than a quarter of the UK's services exports to the EU, accounting for £27 billion out of £90 billion in 2016. Read More Nigel Farage is coming to Devon\nA number of banks have made efforts to secure licences and offices in EU financial hubs to continue serving clients on the continent.\nSimon Lewis, chief executive of the Association for Financial Markets in Europe (AFME), said: \"The consequences of a no-deal Brexit scenario could mean prolonged disruption to the smooth functioning of Europe's capital markets, which would affect investors, borrowers and savers across Europe and beyond.\n\"The financial services industry is keen to see both negotiating parties agree on a deal which locks in an agreement on a transition period and the future trading relationship in order to minimise the risks to financial stability.\" Like us on Facebook ", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-08-23T14:30:00.000+03:00", "crawled": "2018-08-23T15:37:56.000+03:00", "highlightTitle": ""}