{"organizations": [], "uuid": "3e5c3601184303a970667f2bfb10c04c0da301e6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14767292.ece/ALTERNATES/s1200/TMP_NEC_250318AntiBrexitRally14JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/you-changed-your-mind-brexit-15025046", "country": "GB", "domain_rank": 21960, "title": "Have you changed your mind about Brexit? An MP wants to know if you regret your decision", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-08-14T07:00:00.000+03:00", "replies_count": 0, "uuid": "3e5c3601184303a970667f2bfb10c04c0da301e6"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/you-changed-your-mind-brexit-15025046", "ord_in_thread": 0, "title": "Have you changed your mind about Brexit? An MP wants to know if you regret your decision", "locations": [], "entities": {"persons": [{"name": "sharon", "sentiment": "negative"}, {"name": "brexit", "sentiment": "neutral"}, {"name": "hodgson", "sentiment": "none"}, {"name": "sharon hodgson", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "house of commons", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "newcastle chron", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Have you changed your mind about Brexit? An MP wants to know if you regret your decision Sharon Hodgson's constituents in Washington and Sunderland voted for Brexit - but two years later she's asking if they want it to go ahead Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox Subscribe Could not subscribe, try again later Invalid Email\nA North East MP is asking voters whether they have changed their mind about Brexit.\nVoters in Washington and Sunderland backed Brexit in the 2016 referendum, but Sharon Hodgson said she wanted to know what constituents thought as the UK approaches “a key moment in this process”.\nAlong with other MPs, she will take part in a House of Commons vote on whether or not to accept the deal agreed between the EU and the UK at some point before Brexit is due to take place, on March 29 next year.\nIt was originally due in October, but now appears likely to be delayed until later in the year, or early in 2018. An anti Brexit rally at the Monument attended by a large crowd (Image: Newcastle Chronicle)\nLabour activists are also likely to hold a debate on whether the party should back a second referendum on Brexit - described as a “People’s Vote” by supporters - at the party’s conference in Liverpool next month.\nSome MPs, including Sedgefield’s Phil Wilson, Redcar’s Anna Turley, Stockton South’s Paul Williams , Newcastle North’s Catherine McKinnell and Bridget Phillipson from Houghton and Sunderland South, have already backed a new referendum, but Ms Hodgson is not among them.\nHer online survey asks constituents how they voted in 2016, and how they would vote today.\nAnd it asks: “For any exit deal to be ratified, Parliament must first vote in favour of it. Do you believe that the electorate should also have to approve a deal before it can be ratified?”\nThe survey also asks voters whether they believe Brexit should go ahead if the UK fails to agree any deal with the EU. MP Sharon Hodgson (Image: Newcastle Chronicle)\nMs Hodgson said: “As many people will know, I campaigned and voted to remain in the EU. However, I recognise that a majority of people voted to leave, and ultimately I respect the result of the referendum.\n“I therefore want to hear from as many people as possible in order to ensure that I am representing my constituents in the best way possible.”\nShe added: “The Government has a responsibility to deliver a deal that works for everyone, and if they are unable to do so, I want to hear what my constituents think should happen next.” Read More", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-08-14T07:00:00.000+03:00", "crawled": "2018-08-14T07:20:56.121+03:00", "highlightTitle": ""}