{"organizations": [], "uuid": "10ddc3e771fc5e5a7ea353b515a35fd3517f8e10", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14597670.ece/ALTERNATES/s1200/IBP_NEC_050717hospital_protest_06JPG.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/campaign-group-given-green-light-15058058", "country": "GB", "domain_rank": 21960, "title": "Campaign group given green light for legal challenge to save South Tyneside Hospital services", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-08-22T10:35:00.000+03:00", "replies_count": 0, "uuid": "10ddc3e771fc5e5a7ea353b515a35fd3517f8e10"}, "author": "Katie Dickinson", "url": "https://www.chroniclelive.co.uk/news/north-east-news/campaign-group-given-green-light-15058058", "ord_in_thread": 0, "title": "Campaign group given green light for legal challenge to save South Tyneside Hospital services", "locations": [], "entities": {"persons": [{"name": "saffman", "sentiment": "none"}, {"name": "irwin mitchell", "sentiment": "none"}], "locations": [{"name": "south tyneside hospital", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "south tyneside", "sentiment": "none"}], "organizations": [{"name": "south tyneside hospital services news campaign", "sentiment": "negative"}, {"name": "nhs south tyneside ccg", "sentiment": "none"}, {"name": "high court", "sentiment": "none"}, {"name": "nhs sunderland ccg", "sentiment": "none"}, {"name": "save south tyneside hospital campaign group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Campaign group given green light for legal challenge to save South Tyneside Hospital services Lawyers are pursuing a judicial review into cuts to services at South Tyneside Hospital following a plea from campaigners Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nA campaign group has been given the green light to pursue a legal challenge to cuts at South Tyneside Hospital.\nLawyers from Irwin Mitchell had written to NHS Sunderland CCG and NHS South Tyneside CCG urging them to overturn the decision to move maternity, women’s healthcare, paediatric and stroke services away from South Tyneside to Sunderland, or potentially face a judicial review in the High Court.\nNow, the High Court has confirmed that Irwin Mitchell, acting on behalf of the Save South Tyneside Hospital Campaign Group, can proceed with its legal action after the two CCGs did not agree to reverse their decision.\nGranting permission, His Honour Judge Saffman said he believed the grounds put forward by lawyers at Irwin Mitchell were “sufficiently arguable such as to justify the granting of permission”. Demo outside Hebburn Central by the Save South Tyneside Hospital Campaign (Image: newcastle chronicle)\nYogi Amin, a partner and head of public law and human rights at Irwin Mitchell, said: “Following our instruction by the South Tyneside Hospital Campaign Group, we argued that there were grounds for a judicial review of the decision taken by NHS managers at South Tyneside CCG and NHS Sunderland CCG .\n“Unfortunately South Tyneside CCG and NHS Sunderland CCG have not shown a willingness to reconsider the decision, therefore we welcome the High Court’s decision to grant permission to pursue a judicial review. This is the next step in the legal case to save the local NHS hospital services.”\nFollowing a review by the South Tyneside NHS Foundation Trust and City Hospitals Sunderland NHS Foundation Trust, a public consultation was held into changes of three key services at South Tyneside Hospital. The consultation closed on October 15 last year.\nA decision was taken in February this year by NHS Sunderland CCG and NHS South Tyneside CCG to approve the proposals put forward by the two NHS trusts. Read More Cramlington hospital reassures patients and staff on fire safety as hoses are laid outside building\nThe three services included in the public consultation were urgent and emergency paediatrics, stroke services and maternity and women’s healthcare.\nRoger Nettleship, a spokesperson for the Save South Tyneside Hospital Campaign Group, said: “Our stand is to safeguard the future of South Tyneside Hospital and its acute and emergency services. Families are very concerned about their vital NHS children and women’s health hospital services.\n“We believe that the proposed changes will be a potential disaster for the people of South Tyneside and Sunderland.”\nNo date has yet been set for the hearing.\nHelen Smith, a public law specialist at Irwin Mitchell’s Newcastle office, added: “Our clients believe the proposals to transfer the NHS services to Sunderland were based on a flawed assessment of the impact on patients and that the criteria to assess the cost of this was also flawed.”\nMatt Brown, director of operations at South Tyneside CCG, said: “These critical changes have been about taking steps to protect services that are exceptionally vulnerable because of a severe shortage of skilled medical and nursing staff. Campaigners to save services at South Tyneside Hospital protest in Jarrow (Image: Newcastle Chronicle)\n“These are highly important services for our patients and the CCGs took their decision making extremely seriously, based on clear clinical evidence.\n“The local NHS has set out clearly the fragility of these services and we are deeply concerned about the additional delay that this legal process will bring, preventing us from making the vital changes that are needed for our patients.\n“The trust has provided repeated reassurance that South Tyneside Hospital has a strong and vibrant future, serving local residents.\n“These changes to services are about ensuring our services are appropriately staffed by the right numbers of skilled medical and nursing staff, so that we can provide the best possible care to local people. Read More Brexit could damage access to NHS services 'for decades to come'\n“We are confident in our open and transparent public consultation process which has been awarded a certificate of ‘Best Practice’ from the independent Consultation Institute.\n“We will continue to openly engage with staff, patients, stakeholders and elected members over the coming months as we work together to develop future plans for the best possible local hospital services. We are absolutely committed to securing the very best care for the people we serve, the residents of South Tyneside and Sunderland.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-08-22T10:35:00.000+03:00", "crawled": "2018-08-22T14:25:27.032+03:00", "highlightTitle": ""}