{"organizations": [], "uuid": "d202ea64a2fa25f8fc5ca320d036e789be83b8b2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1754899.ece/ALTERNATES/s1200/1200px-Official_portrait_of_Neil_Parish_crop_2.jpg", "site_section": "", "section_title": "", "url": "https://www.devonlive.com/news/news-opinion/nowhere-impact-eu-membership-been-1865271", "country": "US", "title": "Nowhere has the impact of EU membership been felt more than in our coastal towns and villages - Neil Parish - Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.975, "site_type": "news", "published": "2018-08-06T03:00:00.000+03:00", "replies_count": 0, "uuid": "d202ea64a2fa25f8fc5ca320d036e789be83b8b2"}, "author": "Neil Parish", "url": "https://www.devonlive.com/news/news-opinion/nowhere-impact-eu-membership-been-1865271", "ord_in_thread": 0, "title": "Nowhere has the impact of EU membership been felt more than in our coastal towns and villages - Neil Parish - Devon Live", "locations": [], "entities": {"persons": [], "locations": [{"name": "neil parish", "sentiment": "none"}, {"name": "tiverton", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "devon live news", "sentiment": "none"}, {"name": "environment food and rural affairs select committee", "sentiment": "none"}, {"name": "committee", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News opinion Nowhere has the impact of EU membership been felt more than in our coastal towns and villages Neil Parish MP says that delays at border inspection posts would lead to increased business costs, and pose a serious threat to our perishable goods industries. Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email\nNEIL PARISH IS THE CONSERVATIVE MP FOR TIVERTON AND HONITON AND HAS BEEN SINCE 2010\nAs we all know, the government recently published its Brexit White Paper. It proposes our future relationship with the EU – and will be the basis of upcoming talks. In its current form, the Brexit White Paper offers us an opportunity to continue our close relationship with the EU, whilst striking trade deals with other countries around the world.\nIt is my role, as Chair of the Environment Food and Rural Affairs Select Committee, to scrutinise the effect of the government’s proposals on these key policy areas. Neil Parish MP\nWhen my Committee produced our report into ‘Brexit: Trade in Food’ earlier this year, we found that any change in trade arrangements would have serious implications for the smooth movement of goods between the UK and the EU. In particular, we found delays at border inspection posts would lead to increased business costs, and pose a serious threat to our perishable goods industries. Read More Too often there is a conflict between modern life and historical preservation\nInstead, the Chequers Agreement will allow our agri-food businesses frictionless trade through a Common Rule Book. A new UK-EU free trade area on goods also means maintaining the highest standards in regulations on everything from food safety to animal welfare, whilst preserving access to each other’s markets. This is vital for our rural economy, as 70 per cent of our agri-food imports come from the EU. Furthermore, we export £11 billion worth of agriculture, fisheries and food products to EU markets each year. At the same time, we will be outside the Customs Union and able to do more trade deals with growth markets, so our farmers and agri-food businesses can thrive. Neil Parish MP\nImportantly, though, we are leaving the Common Agricultural Policy (CAP). Currently, the EU currently spends approximately 40 percent of its budget, around €60 billion, on the CAP. As we leave the EU, this offers us a significant opportunity to design new, better and more efficient farming policies for delivering sustainable and productive farming, land management and rural communities like ours.\nThe Brexit White Paper gives us another opportunity, as it makes clear we will be leaving the Common Fisheries Policy. By December 2020, we will be negotiating for our fisheries as an independent coastal state outside the CFP. This gives us the chance to regenerate our coastal towns with jobs and industry. Read More Community transport is absolutely essential for so many people\nNowhere has the impact of EU membership been felt more than in our coastal towns and villages. Whilst UK vessels land 90,000 tonnes of fish caught in EU waters, 760,000 tonnes of fish are caught by EU vessels in UK waters.\nThat’s why I’ve been pushing the Environment Secretary and the Prime Minister hard on this issue. In its current form, the Brexit White Paper enables us to take back control of our waters and negotiate as an independent coastal state. I was delighted, then, when the Prime Minister confirmed to me at Liaison Committee this month, that fishing negotiations will be separate to negotiations about our future economic partnership. Unlike before, our fish cannot be traded away in the small hours of a smoky Brussels negotiating room. Read More We are running out of time to solve Britain’s self-inflicted Brexit crisis\nWhat I want is a good deal with our friends, allies and business partners in the EU. As it stands, the Brexit White Paper enables us to continue trading goods with the EU, including agri-food products, whilst allowing us to freely negotiate free trade arrangements with non-member states. Our exceptionally high standards will not only be maintained, but we can begin the drive to make them even higher than before. The Common Rule Book provides the certainty so many farmers have needed recently and allows us to protect trade with the EU. Read More Chequers proposal falls short of a clean, free-trading Brexit in which UK takes back control\nThe Prime Minister has a tough job trying to get a deal we can all support. In its current form, this is a fine balance that she has just about struck. The most important thing is that we have a say over our farming and fishing policies, whilst maintaining an important and integrated supply chain. I am pleased with the priority which has been given to our agri-food business - and the opportunities we will have outside the CAP and the CFP. Neil Parish MP\nThe EU should realise that any weakening would not be acceptable and risk a no-deal scenario. Let’s hope they take it seriously. But given the comments of the EU’s chief negotiator, I’m not hopeful. It would be unwise for the EU to take away the assurances this White Paper offers so many UK sectors. The PM must take a tough stance. Like us on Facebook", "external_links": [], "published": "2018-08-06T03:00:00.000+03:00", "crawled": "2018-08-06T12:41:23.045+03:00", "highlightTitle": ""}