{"organizations": [], "uuid": "065948b76894fe7ed8daf0acc1c0c305669a6d12", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1505316.ece/ALTERNATES/s1200/480.jpg", "site_section": "https://www.devonlive.com/rss.xml", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/devon-news/could-57000-new-homes-exeter-1948541", "country": "US", "title": "There could be 57,000 new homes in the Exeter area by 2040", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-08-29T19:54:00.000+03:00", "replies_count": 0, "uuid": "065948b76894fe7ed8daf0acc1c0c305669a6d12"}, "author": "Daniel Clark", "url": "https://www.devonlive.com/news/devon-news/could-57000-new-homes-exeter-1948541", "ord_in_thread": 0, "title": "There could be 57,000 new homes in the Exeter area by 2040", "locations": [], "entities": {"persons": [{"name": "daniel clark", "sentiment": "none"}], "locations": [{"name": "exeter", "sentiment": "none"}, {"name": "mid devon", "sentiment": "none"}, {"name": "greater exeter strategic plan", "sentiment": "none"}, {"name": "exeter city", "sentiment": "none"}, {"name": "teignbridge", "sentiment": "none"}, {"name": "east devon", "sentiment": "none"}], "organizations": [{"name": "greater exeter area", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News There could be 57,000 new homes in the Exeter area by 2040 The figure is revealed in the all-important Greater Exeter Strategic Plan (GESP) which lays down the amount of development we will see in the next two decades - and it also includes a major new sports and concert venue Share Daniel Clark Local Democracy Reporter 17:54, 29 AUG 2018 Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nA major sports and concert venue, new park-and-ride sites, improvements to rail, bus and road routes, and 57,000 new homes by 2040 are all part of a Strategic Vision for the Greater Exeter Area.\nEast Devon, Exeter City, Mid Devon and Teignbridge councils are currently preparing the Greater Exeter Strategic Plan to cover strategic matters for their area.\nConsultation on the vision is about to start to decide specific issues in October, with the aim to prepare a draft plan for consultation in the summer of 2019 after the local elections. The Greater Area Exeter Plan\nThe consultation document includes the new vision for the area, explains what the Government has said the housing need is, asks people what the most important infrastructure projects they need to invest in are and includes the main points for a transport strategy for the area. Read More\nTRANSPORT\nTo improve transport around Exeter, the strategy proposals include: trains every 30 minutes, buses every 15 minutes and high-quality cycle routes between Exeter and key towns improve the M5 gateway, A30, A38, A303, A380 & junctions on A35/A361 double the number of car parking spaces serving Exeter in park-and-ride sites on all main corridors a comprehensive network of walking and cycling routes a new integrated product which combines sustainable travel modes into a single subscription travel service a modern, reliable and low carbon network of urban bus routes Read More Family pay tributes to 'loyal' and 'funniest' dad who tragically died in bank holiday crash\nINFRASTRUCTURE\nSince 2013, more than £320m has been spent on a range of large scale infrastructure projects in the area, including the South Devon Highway, the Exeter Flood Defence scheme and the Cranbrook education campus. South Devon Highway\nAround £135m of schemes are currently in the pipeline, including Exeter bus station, the upgrading of the A382 and Marsh Barton railway station.\nBut extra large-scale infrastructure that the area needs is likely to cost more than £1billion, the vision says, and will be determined to a large extent by future development sites in the plan that have not been determined. It may include: new primary and secondary schools relief to major junctions on the M5 improvements to the A30/A303 improvements to walking and cycling routes improvements to rail and bus routes healthcare facilities Read More \"A credit to themselves and a credit to the club\" says Matt Taylor on Exeter City's outstanding support at Fulham\nHOUSING\nFor the GESP area, 2,600 homes a year are needed, meaning over the 20 years of the plan to 2040, around 57,200 new homes will be built.\nThe vision says: “Meeting the need for homes and jobs is challenging and we will need to put more detailed thought into the infrastructure implications. However, we know that there are going to be some key areas and projects where investment is needed, irrespective of where the new homes and jobs are going.\n“The Councils agree that homes and infrastructure are key issues which the GESP can deal with. As far as is possible, Councils would like to ensure both homes and infrastructure are planned together to provide high quality development.” Greater Exeter Strategic Plan October 2018 document Read More Plymouth City Council becomes first to issue Brexit legal challenge to Government\nSPORTS ARENA AND CONCERT VENUE\nIn previous discussions regarding the GESP, the Deputy Leader of East Devon District Council has put forward the idea of developing a regionally or nationally significant sports arena and concert venue within the GESP area.\nThe consultation does not specifically refer to this concept as work in understanding the need for such a facility and how it could be delivered are at an early stage as it is focusesd at high level issues and does not talk in any detail about specific proposals.\nIt is however considered that the consultation asks about public aspirations for the delivery of infrastructure thus enabling respondents to raise the opportunity for such a facility and make suggestions for what it would be. Read More French fishermen 'petrol bomb' Devon fishing boats in scallop wars\nWHAT COMES NEXT?\nCouncillors at each of the four councils will be asked to grant authority to consult on the Greater Exeter Strategic Plan consultation document at upcoming meetings.\nIt will go before East Devon District Council’s Strategic Planning Committee on Tuesday, September 4, where the committee are recommended to consider whether the proposed Greater Exeter Strategic Plan consultation document “Our New Vision and How We Make It Real” meets their vision for the Greater Exeter Strategic Plan and adequately addresses the associated infrastructure needs including previously indicated aspirations for a sports arena and concert venue.\nTeignbridge District Council’s executive, who meet earlier that day, are only being recommended to agree the report in the basis for public consultation. No reference to a sports arena or concert venue is mentioned in the agenda papers for its meeting. The Roundfield area of Ide\nIronically though, the item next on the agenda for their meeting is to officially make the Ide Neighbourhood Plan – which in doing so would preclude the Roundfield site beside the A30/A377 interchange being used to create a 566 parking space park-and-ride on the site to reduce the traffic levels along Alphington Road in Exeter, as had been hoped by Devon County Council, Exeter City Council and Teignbridge. Read More\nMid Devon and Exeter City Councils have not yet announced dates for when the report will go before their committees for approval.\nIf approved, consultation will be held between October 5 and November 30.\nDo you have a story to share or for us to investigate?\nGet in touch using or call 07775 030856 or tweet me @HEDanielClark\nWant more news?\nFor Devon news, find Devon Live's Facebook page here and Twitter here , or visit our homepage at www.devonlive.com Like us on Facebook", "external_links": ["https://twitter.com/HEDanielClark", "https://twitter.com/DevonLiveNews", "https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}", "https://www.facebook.com/devonlivenews/"], "published": "2018-08-29T19:54:00.000+03:00", "crawled": "2018-08-29T20:11:41.009+03:00", "highlightTitle": ""}