{"organizations": [], "uuid": "9cf7b5249b162ed91b44e1fcd922e589b14fb994", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1852378.ece/ALTERNATES/s1200/0_18941233-1.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/devon-news/bank-england-set-raise-interest-1852375", "country": "GB", "title": "Bank of England set to raise interest rates", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-08-02T10:53:00.000+03:00", "replies_count": 0, "uuid": "9cf7b5249b162ed91b44e1fcd922e589b14fb994"}, "author": "Neil Shaw", "url": "https://www.devonlive.com/news/devon-news/bank-england-set-raise-interest-1852375", "ord_in_thread": 0, "title": "Bank of England set to raise interest rates", "locations": [], "entities": {"persons": [{"name": "george brown", "sentiment": "none"}, {"name": "jon cunliffe", "sentiment": "none"}], "locations": [], "organizations": [{"name": "bank of england", "sentiment": "none"}, {"name": "mpc", "sentiment": "none"}, {"name": "bank", "sentiment": "none"}, {"name": "investec", "sentiment": "none"}, {"name": "digital", "sentiment": "none"}, {"name": "monetary policy committee", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Bank of England set to raise interest rates The move would see rates reach their highest level since March 2009 Share Neil Shaw Head of Digital, live and trending for PlymouthLive, DevonLive and CornwallLive 08:53, 2 AUG 2018 Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nThe Bank of England is expected to hike interest rates to their highest level for almost a decade on Thursday.\nMembers of nine-strong Monetary Policy Committee (MPC) are predicted to increase rates from 0.5% to 0.75% in what would mark only the second rise since the financial crisis struck, following last November's quarter point hike.\nThe move would see rates reach their highest level since March 2009, when they were slashed from 1% to the emergency low of 0.5% in an effort to contain the fall-out from the financial crisis.\nInvestec economist George Brown said he is \"fairly confident\" the Bank will move to raise rates and is pencilling in an 8-1 vote in favour, with Sir Jon Cunliffe the only dissenter. Read More Plymouth top for having the most people who can't pay their debts\nMr Brown believes the economy has performed in line with the Bank's last forecasts in May, when it backed off from a widely anticipated hike to wait and see how the economy recovered after a weather-hit start to the year.\nThe Bank also edged a step closer to pressing the button in June when its chief economist Andy Haldane joined two fellow policymakers in calling for a rise.\nHoward Young at the EY Item Club believes the vote may be less definitive, given that inflation figures recently came in lower than expected - unchanged at 2.4% in June, while wage growth has also been weak.\nIt has become an even closer call after survey figures on Wednesday signalled a weaker performance from the manufacturing sector in July, according to Mr Archer, but he said this is \"unlikely to deter\" the MPC from raising rates. Read More What went wrong for the Exeter Pound?\nHe said: \"We believe that the odds still favour the Bank of England lifting interest rate from 0.50% to 0.75% on Thursday after the August MPC meeting - most likely following a split vote.\"\nHe added: \"With interest rates down at 0.50%, the Bank of England would clearly likely to gradually normalise monetary policy given that it is essentially an emergency low rate.\n\"Furthermore, inflation remains above target and the labour market looks relatively tight with the MPC considering that there is little slack left in the economy.\"\nThe decision to raise rates would come as a blow to some borrowers on variable rate mortgages, but would offer relief to savers who have seen paltry returns on deposits since rates have languished at 0.5% or below since 2009. Read More What your car says about you (BMW haters should look away now)\nIt is thought the Bank's latest set of forecasts in the accompanying inflation report will reinforce the case for a rise, with many economists expecting growth to have recovered to 0.4% in the second quarter after slowing to 0.2% in the previous three months.\nThe Bank had already predicted in May that this would be the case and its latest set of forecasts are set to confirm its outlook for the year ahead.\nBut the Bank is likely to increase its inflation forecasts, with a weaker pound and higher oil and energy prices pushing up the outlook and further justifying the need for a rise. Read More What you need to know about Exeter's FOUR planned retail parks\nThe Bank's last move to raise rates in November from 0.25% to 0.5% was the first such move for more than 10 years, but merely reversed the cut made in the aftermath of the Brexit vote.\nMr Brown believes if it does raise rates again on Thursday, it will be the only increase in 2018.\nBut he predicts a quarter point rise every six months until rates reach 1.5% in 2020.\n\"We think the bank wants to raise rates in a gradual way and that would be consistent with the next one in February,\" he said. Like us on Facebook ", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-08-02T10:53:00.000+03:00", "crawled": "2018-08-02T12:25:15.022+03:00", "highlightTitle": ""}