{"organizations": [], "uuid": "0510d520fe17ace7abe7128e2b61f143f7b32829", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14579662.ece/ALTERNATES/s1200/Panto-photo-call-for-Aladdin-Darlington-Civic-Theatre.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/barry-elliott-chucle-brothers-died-14992064", "country": "GB", "domain_rank": 21960, "title": "Barry Chuckle dead at 73: Brother pays tribute to 'very best friend'", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-08-05T11:25:00.000+03:00", "replies_count": 0, "uuid": "0510d520fe17ace7abe7128e2b61f143f7b32829"}, "author": "James Moore", "url": "https://www.chroniclelive.co.uk/news/barry-elliott-chucle-brothers-died-14992064", "ord_in_thread": 0, "title": "Barry Chuckle dead at 73: Brother pays tribute to 'very best friend'", "locations": [], "entities": {"persons": [{"name": "barry chuckle", "sentiment": "negative"}, {"name": "ann", "sentiment": "none"}, {"name": "phil dale", "sentiment": "none"}, {"name": "barry", "sentiment": "none"}, {"name": "barry elliot", "sentiment": "none"}, {"name": "paul", "sentiment": "none"}], "locations": [{"name": "south yorkshire", "sentiment": "none"}, {"name": "rotherham", "sentiment": "none"}], "organizations": [{"name": "press association", "sentiment": "none"}, {"name": "daily mirror", "sentiment": "none"}, {"name": "chuckle brothers", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nVeteran entertainer Barry Chuckle, one half of famous comedy duo the Chuckle Brothers, has died at the age of 73, his manager said.\nManager Phil Dale said in a statement: \"It is with great sadness that the family announce that Barry passed away peacefully at his home surrounded by his wife Ann and all his family.\"\nHe added: \"The family would like to express their thanks to the many people who have been fans of the Chuckle Brothers and they know that they will share in part the great, great loss they feel.\" Paul and Barry Elliot, AKA the Chuckle Brothers (Image: Daily Mirror)\nHis comedy partner Paul said: \"I've not just lost my brother, I've lost my theatrical partner of many, many years and my very best friend.\"\nWith his brother Paul, born in Rotherham, South Yorkshire, he began his comedy career on ITV talent shows Opportunity Knocks in 1967 and New Faces in 1974. Read More\nThe pair, whose real surname is Elliott, first broke onto the BBC in 1985 with the show Chuckle Hounds, which was aimed at pre-school children and saw the comedy duo dressed as dogs.\nBut they found fame with ChuckleVision, which became known for the brothers' catchphrase 'To Me To You'.\nThe statement said that \"there will be no further comment at the moment and it would be much appreciated if the privacy of Barry's family is respected at this most difficult time\" adding that the star \"leaves 50 years of laughter as his legacy which is something very special\". Read More The cost of your holiday is set to rise as Brexit drives up prices\nThe stars had recently filmed a new series titled Chuckle Time for Channel 5.\nThe programme saw the brothers perform comedy sketches and introduce humorous online videos from members of the public.\nThe star, whose real name is Barry Elliott, had not been well towards the end of the filming and summer work was cancelled whilst he rested at his doctor's request. Not long after this, his health deteriorated.\nMany tributes were made on social media on Sunday morning.\nLabour MP Angela Rayner said: \"So sorry to hear of the death of Barry Chuckle aged 73 this morning.\n\"A great entertainer who has been making people laugh for so long. Our family loved his act with his brother, R.I.P. Barry.\"\nReferencing one of the Chuckle Brothers' famous catchphrases, former England rugby union international and broadcaster Brian Moore wrote: \"'To me; to me.' Doesn't really work does it. RIP Barry Chuckle.\" Read More", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-08-05T11:25:00.000+03:00", "crawled": "2018-08-05T11:37:44.075+03:00", "highlightTitle": ""}