{"organizations": [], "uuid": "487b1abfdbb2979e954cac9ce897422e9df709ec", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/health/article1223947.ece/ALTERNATES/s1200/Sarah-Wollaston-2.jpg", "site_section": "https://www.devonlive.com/rss.xml", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/devon-news/changed-mind-over-brexit-sarah-1917448", "country": "US", "title": "Why I changed my mind over Brexit - Sarah Wollaston", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-08-20T14:38:00.000+03:00", "replies_count": 0, "uuid": "487b1abfdbb2979e954cac9ce897422e9df709ec"}, "author": "Keith Rossiter", "url": "https://www.devonlive.com/news/devon-news/changed-mind-over-brexit-sarah-1917448", "ord_in_thread": 0, "title": "Why I changed my mind over Brexit - Sarah Wollaston", "locations": [], "entities": {"persons": [{"name": "sarah wollaston click", "sentiment": "none"}, {"name": "david cameron", "sentiment": "none"}, {"name": "dr wollaston", "sentiment": "none"}, {"name": "sarah wollaston dr wollaston", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "sarah wollaston", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "totnes", "sentiment": "none"}], "organizations": [{"name": "commons health select committee", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nVoters were misled by deliberate untruths during the EU referendum and must be given a say on the final deal, Devon MP Sarah Wollaston says.\nDr Wollaston, who famously changed her mind during the 2016 campaign, has now become a leading campaigner opposing a “hard” Brexit.\n“I was what you might call a soft Eurosceptic,” the Totnes MP said. “A lot of that was about the way the EU treated former Prime Minister David Cameron when he asked for fairly modest changes that would have been in the interests of the EU as well as the UK.\n“During the campaign it became clear to me that there would be such huge unintended consequences as a result of us leaving.” Totnes MP Sarah Wollaston\nDr Wollaston chairs the influential Commons Health Select Committee, and said she was persuaded by evidence from the life sciences industry and from patient groups about the scale of the impact on the health service.\nBut some voters were taken in by “frankly untrue” advertising by the Leave campaign – most notably the claim that Brexit would deliver a £350 million-a-week dividend to spend on the NHS. The Government has since made it clear that extra NHS spending will have to be paid for through higher taxes. Read More Funniest jokes from this year's Edinburgh Fringe revealed\n“I had people in the Leave campaign saying they knew it was wrong but it didn’t matter because using a big number would mean that people would just remember the big number,” Dr Wollaston said.\n“And the more people disputed it, all that would happen would be that more people would remember the big number.”\nAfterwards, surveys showed that the single biggest thing the pubic recalled, it was the £350 million for the NHS, “even though the Leave campaign knew it was false. It was quite deliberate targeting, disinformation from people who should have known better.\n“We now know there won’t be a Brexit dividend for the NHS – there will be a Brexit penalty.” The EU referendum Leave campaign bus in Cornwall in 2016\nThe Leave campaign also played on fears of immigration – even after the murder of Yorkshire MP Jo Cox a week before the referendum by Thomas Mair, who had links to right-wing political groups.\n“If you look at the targeted Facebook ads sent out immediately after the murder, I think anyone would feel that was distasteful,” Dr Wollaston says. “They were deliberately playing on people’s fears of mass immigration from the Middle East via Turkey.”\nOne Leave campaign ad suggested that Turkey was about to join the EU with an image showing a large red arrow sweeping across Europe from the Middle East to Britain. Read More One place has been Googling Brexit more than anywhere else - and it's in Devon\nIronically, leading Leave campaigner Boris Johnson has Turkish ancestry and, three months after the referendum, when he was Foreign Secretary, announced that Britain would support Turkey's bid to join the EU – a move opposed by most EU member countries.\n“The Trumpification of our politics is very worrying. Playing to people’s fears and whipping those up has consequences. I have seen the impact of a very negative, xenophobic campaign in my surgeries. People from EU countries no longer feel welcome here.\n“There is nothing sadder than meeting nurses from EU countries who have worked here for years and they are in tears because they feel no longer welcome.\n“There has been a collapse in applications from EU nurses to work in the NHS.” Brexit sceptics call for a people's vote\nDr Wollaston is backing a “people’s vote” so the public can give their “informed consent”.\n“Everybody knew what ‘In’ meant, but nobody knew what ‘Out’ meant,” she said.\n“It looks as though we are heading towards the cliff and no deal, which would be the most harmful of all the options.\n“It would be a bit like asking someone to consent to an operation two years in advance without them knowing whether they will have two toes removed or their whole leg. Read More Cheese and onion crisp shortage thanks to weather and Brexit\n“People have a right to make risky decisions if they feel that the outcome of the surgery is going to be better for them in the long run. That’s an important principle of medicine.\n“But if people don’t know what the actual form of Brexit will be it’s very difficult for them to weigh up all the risks and benefits.\n“I don’t think we have anything to fear from a second referendum now. It’s not about blocking Brexit; it’s about saying to people: I think you have the right to give informed consent now that we are very close to the final point and we’ve given a chance for negotiations to take place.\n“Polls say there’s a very clear demand from people to have a final say. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now\n“Everybody has the right to change their minds. Brexiteers have nothing to fear if they are confident of their position.”\nShe said the parliamentary European Research Group, headed up by hardliner Jacob Rees-Mogg, tabled two amendments specifically aimed at scuppering Theresa May’s so-called Chequers deal, the closest Britain has come to an agreed negotiating position.\n“So we are sleepwalking towards the edge of a cliff and we might find ourselves crashing out by accident. It might not be what anyone wants.”\n“Unfortunately the promises made during the referendum campaign that we would have bespoke deal look increasingly unlikely.\n“There is time to pause once we know what the final terms are and check with the public that we have their consent.\n“This is the biggest constitutional change in my lifetime. It isn’t right that we proceed without informed consent.” Nigel Farage celebrates\nShe said it would be anti-democratic not to ask people for informed consent. Voters have the right to say the potential benefits outweigh the risks – or to say, “I don’t feel the benefits outweigh the risks and I would rather stay as we are.”\n“Sometimes there’s a view expressed that the 48% who voted Remain should not have any say at all. I hear things like, ‘You lost, get over it’,” Dr Wollaston said. “I don’t agree with that. Everyone should have a say.\n“If you take the 48% who voted Remain, and add a significant number of ‘soft’ Leavers who actually wanted to continue to have significant links with the EU. A lot of people talked to me about wanting to be in a single market. They just didn’t want the political union. Read More The six biggest threats to our economy and jobs\n“Some people say to me, ‘I voted to get out immediately, get out completely’. I accept that there are some people who would like to see us leave with no transition and no deal, but I don’t believe they are in the majority.”\nShe said much would depend on what happens at the Labour Party conference in the autumn. “If Jeremy Corbyn backs the people’s vote campaign, there will be a majority in Parliament. Labour leader Jeremy Corbyn speaking after Prime Minister Theresa May made a statement to MPs (Image: PA Wire)\n“Corbyn has managed to present an image to young people that he is on their side. I would like to see him supporting that with his vote.\n“There are a great many Conservatives who are opposed to a walk-away Brexit. They need to be prepared to say so in public.\n“Should any Government knowingly lead us into an extended period of economic pain and discomfort without knowing they have the consent of the public?” Read More South West sees largest drop in house prices - but parts of Devon are bucking trend\nThe Brexit hardliner and North Somerset MP Jacob Rees-Mogg said last month: “We won’t know the full economic consequences for a very long time. The overwhelming opportunity for Brexit is over the next 50 years.”\nDr Wollaston said: “I won’t be around then. We are not talking about a few weeks of turbulence.” First set of A400M wings, produced by Airbus UK at Filton, being loaded onto the Airbus A300-600ST super transporter aircraft, known as the Beluga, for onward transportation to the A400M final assembly line in Seville, Spain.\nShe warned that the impact goes beyond the NHS.\n“We have all become very used to the fact that we can travel in Europe without worrying about health insurance. If we leave on March 29 next year – particularly if there’s no ongoing cooperation arrangements – people with pre-existing medical conditions will find it much more difficult, and some of them will find themselves uninsurable, as they would be now if they wanted to travel to the United States.”\nBig corporations such as Airbus have made it clear that Brexit will have a damaging impact. But small businesses in Dr Wollaston’s constituency – including the region’s many language schools, and the local residents who provide accommodation for European students – also expect to feel the pinch. Read More Devon MP Geoffrey Cox is the new Attorney General after Cabinet reshuffle\nDr Wollaston warned that the South West’s big fishing industry could also suffer, in spite of the enthusiasm among fishermen for being free of the Common Fisheries Policy.\n“A significant amount of their exports go to the EU, and if they have long delays at borders that will be harmed.\n“We have already seen the fishermen’s interests traded away in the proposed transition arrangements and there’s a lot of uncertainty about whether that will happen again.” Fishing boats in Brixham harbour (Image: Keith Rossiter)\n“If you look at just the cost of contingency plans for the NHS. We’re already hearing about the need for stockpiling – and that’s for drugs that can be stockpiled. Some need refrigerating to be stored. This is very expensive. The costs of drugs to the NHS will rise significantly.\nShe said it became clear that the entire NHS supply chain was at risk, and not just for medicines, but for medical devices and products such as blood plasma, which is imported from the EU.\nEvery year 700,000 tests are carried out using radioactive isotopes, none of them made in the UK.\n“We don’t make a single drop of insulin for diabetics in Britain. Read More NHS stockpiling medicine ahead of Brexit\n“The cost of preparing for Brexit in terms of infrastructure at our borders is enormous. I don’t think at the moment people have been fully informed about the extra costs.\n“Two years from now, if we have no deal and people come to my surgery unable to access some medicines they rely on, I want to be able to look them in the eye and tell them I did my best to ensure that we had a people’s vote.”\nDr Wollaston said the Remain campaign did not do enough to promote the positive side of the EU. Many people who remembered war in Europe – like her 83-year-old father – see the benefits of peace the EU has brought to the Continent. Second World War graves at Higher Cemetery, Exeter (Image: Ed Oldfield)\n“Many people are becoming aware of the positive case for Europe – in particular for young people and their ability to travel and work freely, which I think would be a great loss.\n“But we went up against a campaign that was able to draw on many of the tactics used by the Trump campaign that was appealing to people’s fears.\n“Some of the Remain campaign material was over the top as well. It allowed them to be written off as ‘project fear’. But I think some of that will turn out to be true if we have a hard Brexit.\n“But I get very cross with people who say Leave voters were stupid. You don’t change people’s hearts and minds by telling them they are stupid. People voted the way they did for a variety of reasons.” Read More The 50 biggest businesses in Devon - revealed\n“We need to take account of people’s views about the impact of immigration.\n“People say to me, ‘We haven’t seen rising unemployment’. But we haven’t left yet. But what we have already seen is the impact on our currency, and people will notice that when they go on holiday. And it got considerably worse this week as fears of a no-deal Brexit rose.”\n“People have made a fuss about the EU being unhelpful. But their point would be that if you are 27 remaining members of the club and the 28 decides to leave, it doesn’t place an obligation on you to change your rules.\n“The irony of all this is that just as we leave they may change their rules on immigration, which was a key driver of the Leave vote.” Prime Minister Theresa May makes a statement to MPs in the House of Commons (Image: PA Wire)\nDr Wollaston said Theresa May was very likely to face a Right-wing challenge to her leadership this autumn, and her parliamentary colleague Dominic Grieve has said he would not remain as a Conservative MP is Boris Johnson becomes Prime Minister. But Dr Wollaston said: “There’s not a vacancy.\n“The threat to the Prime Minister isn’t from people like me. It has always come from the Right-wingers in the ERG, who are constantly threatening to send their letters in to the 1922 Committee.\n“I’m surprised to hear people saying I’m being disloyal. I’m not at all. It’s really regrettable that they [the Right-wingers in the party] continue to do this.\n“The ERG should stop undermining the prospects of reaching a negotiated settlement.” Read More Half of us want a second Brexit referendum\nDr Wollaston spoke at last weekend’s rally in Bristol to call for a People's Vote. “I hope people will sign the petition at www.peoples-vote.uk,” she said.\n“I sense very strongly that the public mood is changing as people see just how much they will lose. A feeling that they weren’t given all the facts.\n“People have a right to change their mind, just as I did. Like us on Facebook ", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-08-20T14:38:00.000+03:00", "crawled": "2018-08-20T15:33:06.021+03:00", "highlightTitle": ""}