{"organizations": [], "uuid": "05eaa9429c2d553bb3ebeb75a60c1b4a4ff9f9a3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article1868175.ece/ALTERNATES/s1200/3_TP_TEM_060818Norton_07.jpg", "site_section": "", "section_title": "", "url": "https://www.leicestermercury.co.uk/news/business/norton-motorcycles-looking-recruits-100-1868169", "country": "GB", "domain_rank": 48128, "title": "Norton Motorcycles looking for recruits for 100 new jobs - Leicestershire Live", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.982, "site_type": "news", "published": "2018-08-06T03:00:00.000+03:00", "replies_count": 0, "uuid": "05eaa9429c2d553bb3ebeb75a60c1b4a4ff9f9a3"}, "author": "Ian Strachan", "url": "https://www.leicestermercury.co.uk/news/business/norton-motorcycles-looking-recruits-100-1868169", "ord_in_thread": 0, "title": "Norton Motorcycles looking for recruits for 100 new jobs - Leicestershire Live", "locations": [], "entities": {"persons": [{"name": "stuart garner", "sentiment": "none"}, {"name": "norton", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "east midlands airport", "sentiment": "none"}, {"name": "castle donington", "sentiment": "none"}, {"name": "donington hall", "sentiment": "none"}], "organizations": [{"name": "leicestershire live norton motorcycles", "sentiment": "negative"}, {"name": "norton motorcycles", "sentiment": "negative"}, {"name": "share norton", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Norton Motorcycles looking for recruits for 100 new jobs Donington bike manufacturer also expanding factory to provide new production line for latest models, and increased volumes Share Norton owner Stuart Garner on the set of the Bond film Spectre, which featured one of his bikes Get Business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nLeicestershire-based Norton Motorcycles has embarked on a major expansion programme which will see a new factory extension and up to 100 new jobs over the coming months.\nThe expansion comes on the back of increased sales around the world and the success of Norton's newly-launch V4 model which has been received enthusiastically by motorcycle enthusiasts in the UK and overseas.\nThe current staff figure is 120.\nNorton is recruiting designers, CAD engineers, purchasing professionals and prosecution operators to work at its factory in the grounds of Donington Hall, close to East Midlands Airport. The Norton production facility in Castle Donington\nIn addition, Norton is expanding its successful apprenticeship scheme.\nThe company is also adding a 12,000 sq ft extension to its existing 45,000 sq ft production facility.\nThe new manufacturing space will allow for a new production line for Norton's latest models, and increased volumes.\nNorton chief executive and owner Stuart Garner said the skills they were looking for were in short supply, but Norton liked to train and develop its own staff.\nHe said: “All of our bikes are hand built, with engines, wheels and sub assemblies also built in our factory using 83 per cent UK-sourced components. Nortons latest product - the V4 SS\n“The environment here is very different to a mass-manufacture production line, so we like to think it is a great environment for people with the right enthusiasm and application.”\nMore than 80 per cent of Norton's production goes overseas, with growing demand for its bikes in the United States, Australia, Japan and markets across Europe and Asia. Norton has established a joint venture to build bikes in Pune, India, which will allow it to sell machines into South East Asian markets, escaping punishing import tariffs.\nThe Pune factory will be supplied with components and sub-assemblies from the Donington facility.\nNorton is seeing considerable success with its newly-launched V4 model, adding to the existing range of the iconic Norton Commando and the Dominator.\nThe 200mph V4 is less traditional than previous Norton models, with an updated look and a 1,200cc engine and several technological advances. The Norton production facility in Castle Donington\nMr Garner said he was also not concerned about the impact of Brexit.\nHe said: “As long as we are building products that the world wants to buy then we will thrive.\n“Most of our trade is outside of the EU in any case, so I see no reason why we shouldn't succeed.”\nStuart Garner bought the Norton brand from its US owners in 2008.\n“Production began at its Donington Hall headquarters in 2013, moving from a facility at nearby Donington Park. Like us on Facebook ", "external_links": [], "published": "2018-08-06T03:00:00.000+03:00", "crawled": "2018-08-06T23:09:25.036+03:00", "highlightTitle": ""}