{"organizations": [], "uuid": "0b62c035f6edba04bede67dfbd8b261a31e233f0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article12711311.ece/ALTERNATES/s1200/Computer-hacker-stealing-information-with-laptop.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/five-times-more-fraud-cases-15043466", "country": "GB", "domain_rank": 21960, "title": "Five times more fraud cases appear in North East courts in first half of 2018", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-08-17T18:38:00.000+03:00", "replies_count": 0, "uuid": "0b62c035f6edba04bede67dfbd8b261a31e233f0"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/five-times-more-fraud-cases-15043466", "ord_in_thread": 0, "title": "Five times more fraud cases appear in North East courts in first half of 2018", "locations": [], "entities": {"persons": [], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "invalid email north east", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Five times more fraud cases appear in North East courts in first half of 2018 Fraud cases totalling £10.2m appeared in courts as criminals targeted businesses, banks and the Government Share Hooded computer hacker (Image: iStockphoto) Get business updates directly to your inbox Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nNorth East businesses are battling a huge surge in fraudulent activity, with more than £10m of alleged fraud cases being heard by the region’s courts.\nThe number of fraud cases ending up in North East courts jumped from just three in the first half of 2017, to 16 during the first six months of 2018. The total value of the cases also skyrocketed from £700,000 to £10.2m.\nThe alleged criminals targeted businesses and banks, with defendants being charged with a range of crimes including embezzlement, tax fraud, and expense and payroll fraud.\nThe biggest case to reach the North East courts was valued at £3.6m, and ended with five men being sent to jail for smuggling more than 12m cigarettes into the region. The gang hid the cigarettes in wooden cable drum discs.\nThree senior members of staff at Team Wearside in Sunderland were also jailed for defrauding the organisation of more than £450,000. The fraud contributed to the closure of Team Wearside and the loss of 23 jobs.\nKPMG released the figures as part of its Fraud Barometer, which found that professional criminals were defendants in 50% of the cases.\nCommenting on the figures, James Maycock, forensic director at KPMG said: “On the back of a year with the highest level of alleged fraud in three decades, 2018 appears to be continuing the trend and we can expect this year to be another 12 months of large numbers of fraud cases coming to court. Read More £100m Durham University contract goes to building giant with worst record for paying invoices\n“There are certain types of fraud that have dominated the fraud landscape over the past three decades, including the rise of the professionally organised gang who run criminal operations very much like a business. The main victims have been governments through attacks on the tax system, banks through loans and mortgages obtained via deception, and investors enticed by the promise of tantalising returns.\n“Interwoven with the story is the increasing use of technology and cross-border activity that has impacted on fraud just as it has on our everyday lives. Businesses, public sector and consumers need to continue to be vigilant and on guard to fraud threats in these ever-changing environments.”\nA gang in Teesside Crown Court were also jailed after they targeted wealthy bank customers and stole tens of thousands of pounds after posing as customers.\nIn a separate case a computer hacker from Teesside was jailed after stealing almost £100,000 from a bank. The cyber criminal made use of a software loophole. Read More Gateshead firm that gives staff December off tops UK rankings for work-life balance\nExperts at KPMG also warned that businesses faced an increased risk of fraud after Brexit, as criminals would seek to exploit new customs arrangements.\nMr Maycock added: “How Brexit will impact fraud levels is yet to be seen, but new systems and new landscapes, such as new tax and customs arrangements, have in the past opened lucrative loop holes ripe for the picking from unscrupulous criminal gangs and businesses looking to improperly cut their costs.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-08-17T18:38:00.000+03:00", "crawled": "2018-08-17T21:55:18.008+03:00", "highlightTitle": ""}