{"organizations": [], "uuid": "a0cbb5b6c8150aa3b74c155075c3cacdc660d1bd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14281325.ece/ALTERNATES/s1200/Unhappy-couple-with-documents-at-home.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/workers-north-east-worse-were-15060104", "country": "GB", "domain_rank": 21960, "title": "Workers in the North East are WORSE off than they were ten years ago", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-08-22T18:00:00.000+03:00", "replies_count": 0, "uuid": "a0cbb5b6c8150aa3b74c155075c3cacdc660d1bd"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/workers-north-east-worse-were-15060104", "ord_in_thread": 0, "title": "Workers in the North East are WORSE off than they were ten years ago", "locations": [], "entities": {"persons": [], "locations": [{"name": "north east", "sentiment": "none"}], "organizations": [{"name": "news workers", "sentiment": "negative"}, {"name": "resolution foundation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Workers in the North East are WORSE off than they were ten years ago Despite a jobs boom, a report by think tank Resolution Foundation found wages have actually fallen in real terms Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily Thank you for subscribing! Could\nNorth East workers are an average of £8-a-week worse off than they were ten years ago, a new report has warned.\nThink tank the Resolution Foundation warned that wages had fallen in real terms despite a jobs boom.\nAlthough wages have risen, the rise has not kept up with inflation. It means wages have actually fallen by 2% in real terms.\nAt the same time, the employment rate in the North East has risen from 66% of the population in 2010 to 71.1% now.\nThe analysis shows that as well as benefitting lower income households, employment growth over the last decade has particularly helped those who have traditionally struggled to find work such as people from ethnic minority communities, people who few qualifications and people with disabilities. A picture of a couple with documents at home (Image: Getty Images/iStockphoto)\nBut many disadvantaged groups still face significant “employment gaps” compared to the rest of the population, the think tank says.\nStephen Clarke, senior economic analyst at the Resolution Foundation, said: “Britain has experienced a huge living standards slump but its incredible employment record has provided a much-needed bright spark amidst the gloom of the pay squeeze.\n“We have avoided the unemployment highs of previous recessions and seen employment reach record levels, with over two million more people in work compared to a decade ago.\n“But even better than the scale of Britain’s employment growth is who is getting those jobs. Lower income families have accounted for the majority of Britain’s jobs growth, showing that pushing for full employment can boost living standards.\n“But while employment is at a record high, Britain is still some way off full employment and too much work remains low paid and insecure.\n“With fewer than half of people with a disability or ill-health currently in work, targeted support for these groups holds the key to achieving further employment progress. (Image: PA)\n“Steps to provide advance notice of shifts and a right to a regular contract for those working regular hours on a zero hour contract would also help those in work who have precious little job security.”\nNationwide, the figures show pay has fallen by £13-a-week. The drop is highest in London, where wages are also highest. Read More Brexit could damage access to NHS services 'for decades to come'\nJohn McDonnell MP, Labour’s Shadow Chancellor, said: “These figures show the disastrous impact of nearly a decade of austerity on earnings, with workers in the UK losing out under Tory rule.\n“The findings are a stark example of how brutal Tory pay restraint and austerity has led to a crisis in living standards for families.”\nA Government spokesperson said: “We have seen more people in work than ever before and the National Living Wage has helped to deliver the fastest earnings boost for the lowest paid in 20 years.\n“Through our Good Work plan we are going further to give millions of workers major new rights and protections, including increased financial security for workers on flexible contracts with a new right to request a more stable contract.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-08-22T18:00:00.000+03:00", "crawled": "2018-08-23T02:36:43.084+03:00", "highlightTitle": ""}