{"organizations": [], "uuid": "28ff148652aac286dd1266bc451799d5cca4a839", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1924021.ece/ALTERNATES/s1200/0_Nigel-FarageJPG.jpg", "site_section": "http://www.westernmorningnews.co.uk/editorschoices.rss", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/devon-news/nigel-farage-coming-devon-1924016", "country": "GB", "title": "Nigel Farage is coming to Devon", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-08-22T09:39:00.000+03:00", "replies_count": 0, "uuid": "28ff148652aac286dd1266bc451799d5cca4a839"}, "author": "Jamie Hawkins", "url": "https://www.devonlive.com/news/devon-news/nigel-farage-coming-devon-1924016", "ord_in_thread": 0, "title": "Nigel Farage is coming to Devon", "locations": [], "entities": {"persons": [{"name": "devon nigel farage", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "nigel farage", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "donald j trump", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "mississippi", "sentiment": "none"}, {"name": "exmouth pavilion", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "exmouth ocean", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "ukip", "sentiment": "none"}, {"name": "independence party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Nigel Farage is coming to Devon The former UKIP leader is hosting an event in Exmouth Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox Subscribe Could not subscribe, try again later Invalid Email\nFormer UKIP leader Nigel Farage is hosting an event in Devon later this year.\n‘An audience with Nigel Farage’ will take place in Exmouth in November, which will see the politician talk about his life and career, as well as a Q&A session with the audience.\nThe event will happen at the Exmouth Ocean suite, with tickets costing up to £45.\nDetails about the evening on the Exmouth Pavilion site reads:\n“Nigel Farage is a British politician, broadcaster and political analyst who was the co-founder in 1993 and leader of the UK Independence Party (UKIP) from 2006 to 2016. “Farage was a leading figure in the campaign to leave the EU and is considered by many to be one of the prominent architects of Brexit. This gained him the name “Mr Brexit” by the then candidate to the US presidency Donald J Trump whom he came to support at a Mississippi rally in 2016. Nigel Farage was one of the very few that predicted that Donald Trump would win the presidential elections. Nigel Farage submitted Stationery chain to close branches and ask for three year break on rent “He has since provided political analysis for both the main Fox News channel and its sister channel Fox Business Network. Farage is also hosting The Nigel Farage show on the British radio station LBC and launched “Farage against the Machine” podcast to be found on Itunes early 2018. He is a regular contributor to the Daily Telegraph and the author of several books. “Throughout this evening Nigel will be talking frankly and humorously about his life, from childhood and throughout his career both as businessman and politician. There will also be a question and answer session. “PLEASE NOTE: This is An Audience With, and NOT a political rally.”\nIt happens on Friday, November 16, and tickets can be purchased here .\nFarage recently appeared on Good Morning Britain, where he was involved in a heated exchange with presenter Kate Garraway over Brexit.\nHe began the discussion to explain how dissatisfied he was with how Brexit procedures were going, The Express reports. Read More LazyTown actor Stefan Karl Stefansson dies aged 43 following cancer battle\nHe said: “I’ve watched a Prime Minister who stands up and says ‘Brexit means Brexit, we’re taking back control of our borders’ and does the opposite.”\nBut Garraway was determined to take Farage to task over his role in the Brexit campaigns, referencing the campaign bus which said £350 million could be given to the NHS if Britain left the European Union.\n“There still doesn’t seem an obvious solution and the things people got excited about, I know that you never said that,” Garraway began.\nHowever, Farage began to speak over the presenter, prompting her to say: “Hang on, Nigel.“\nBut Farage continued: “What about being free?”\n“Wait, you’ve got to answer a question,” Garraway insisted.\n“You said that, you might not have actually said that but you didn’t deny it when it went round.”\nFarage clearly wasn’t pleased with the line of questioning, as he exclaimed: “Don’t trivialise this.”\nBut Garraway pressed the issue: “Do you have any answers to the solution?”\nFarage insisted: “We had a referendum, we voted for something and our politicians should deliver this.” Like us on Facebook ", "external_links": ["https://www.ledleisure.co.uk/exmouth-pavilion/book-now/nigel-farage", "https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}", "https://www.express.co.uk/showbiz/tv-radio/1006178/ITV-Good-Morning-Britain-Nigel-Farage-Brexit-Kate-Garraway-Jeremy-Kyle-GMB-watch"], "published": "2018-08-22T09:39:00.000+03:00", "crawled": "2018-08-22T10:01:15.005+03:00", "highlightTitle": ""}