{"organizations": [], "uuid": "3409f097cc68f9767c10ca39faf44bd502c1925a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15052157.ece/ALTERNATES/s1200/0_Lost-Voice-Guy.jpg", "site_section": "http://www.chroniclelive.co.uk/whats-on/?service=rss", "section_title": "ChronicleLive - What's On", "url": "https://www.chroniclelive.co.uk/whats-on/comedy-news/funniest-joke-edinburgh-fringe-festival-15051781", "country": "GB", "domain_rank": 21960, "title": "Funniest joke of Edinburgh Fringe Festival revealed - but was Lost Voice Guy's better?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-08-20T20:00:00.000+03:00", "replies_count": 0, "uuid": "3409f097cc68f9767c10ca39faf44bd502c1925a"}, "author": "nechronicle", "url": "https://www.chroniclelive.co.uk/whats-on/comedy-news/funniest-joke-edinburgh-fringe-festival-15051781", "ord_in_thread": 0, "title": "Funniest joke of Edinburgh Fringe Festival revealed - but was Lost Voice Guy's better?", "locations": [], "entities": {"persons": [{"name": "adam rowe", "sentiment": "none"}, {"name": "dave", "sentiment": "none"}, {"name": "rowe", "sentiment": "none"}, {"name": "geordie stand-up lee ridley", "sentiment": "none"}], "locations": [{"name": "jobcentre", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "edinburgh", "sentiment": "none"}], "organizations": [{"name": "lost voice guy", "sentiment": "none"}, {"name": "liverpool", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now Get what's on updates directly to your inbox Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nHe won Britain’s Got Talent - but Lost Voice Guy failed to win a top prize at the Edinburgh Fringe Festival.\nOne of Geordie stand-up Lee Ridley’s gags was voted among the best of the fest.\nBut he was pipped to Dave’s Funniest Joke of the Fringe prize by Liverpool funny man Adam Rowe.\nThe Scouser tickled voters with this one-liner, delivered while interacting with a member of the crowd at his Undeniable show.\n“Working at the Jobcentre has to be a tense job - knowing that if you get fired, you still have to come in the next day,” quipped Rowe. Comedian Adam Rowe, who has won the 11th annual award for Dave's Funniest Joke Of The Fringe in Edinburgh (Image: PA)\nThat won 41% of the public vote.\nHowever, Lost Voice Guy’s joke has still been listed among the top 50 jokes at the Scottish arts festival.\nHe left crowds in hysterics with this gag - “When I realised I’d never be able to talk again I was speechless.”\nBoth gags won praise, with the Liverpudlian telling the BBC he was surprised to win the 11th annual award for what he said was a “brain fart”. Lost Voice Guy, winner of Britain's Got Talent (Image: Steve Ullathorne)\nHere are the other best gas of the festival\n“I had a job drilling holes for water - it was well boring” - Leo Kearse\n“I took out a loan to pay for an exorcism. If I don’t pay it back, I’m going to get repossessed” - Olaf Falafel\n“In my last relationship, I hated being treated like a piece of meat. She was a vegan and refused to touch me” - Daniel Audritt\n“What do colour blind people do when they are told to eat their greens?” - Flo and Joan\n“I’ve got a new job collecting all the jumpers left in the park at the weekends, but it’s not easy. They keep moving the goalposts” - Darren Walsh\n“Trump said he’d build a wall but he hasn’t even picked up a brick. He’s just another middle-aged man failing on a DIY project” - Justin Moorhouse\n“I lost a friend after we had an argument about the Tardis. I thought it was a little thing, but it seemed much bigger once we got into it” - Adele Cliff Read More Who is Lost Voice Guy? The rise to fame of the comedian who won Britain's Got Talent\n“Why are they calling it Brexit and not The Great British Break Off?” - Alex Edelman\n“I think love is like central heating. You turn it on before guests arrive and pretend it’s like this all the time” - Laura Lexx Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-08-20T20:00:00.000+03:00", "crawled": "2018-08-21T00:42:12.002+03:00", "highlightTitle": ""}