{"organizations": [], "uuid": "29c6c44eb0a8e78549578bd0a2e67a05dd2b721c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14106342.ece/ALTERNATES/s1200/Brexit.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/chamber-urges-north-east-businesses-14968315", "country": "GB", "domain_rank": 21960, "title": "Chamber urges North East businesses to give Brexit feedback in new survey", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-30T14:09:00.000+03:00", "replies_count": 0, "uuid": "29c6c44eb0a8e78549578bd0a2e67a05dd2b721c"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/chamber-urges-north-east-businesses-14968315", "ord_in_thread": 0, "title": "Chamber urges North East businesses to give Brexit feedback in new survey", "locations": [], "entities": {"persons": [{"name": "james ramsbotham", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "business chamber", "sentiment": "negative"}, {"name": "brexit", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "north east england chamber of commerce", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Chamber urges North East businesses to give Brexit feedback in new survey Firms are asked how prepared they are to operate outside the EU in the survey, which will be sent to Government Share EU and Union flags (Image: PA) Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nThe region’s largest business organisation is urging firms to make their views known on the country’s Brexit preparations.\nThe North East England Chamber of Commerce has launched a survey to gather views on how ready North East businesses feel they are for Brexit, which will be sent to the Government later this year.\nThe survey asks what effect Brexit is likely to have on their business and how prepared they are for operating their business outside the EU. It is also seeking views on which elements of Brexit could affect a business most from a change in VAT, access to EU workforce or potential difficulties to trading arrangements.\nEarlier in the summer, Chamber chief executive James Ramsbotham said many firms in the region were “exasperated” with the lack of progress towards a Brexit deal and said that it was becoming impossible for firms to plan for the future. James Ramsbotham, North East England Chmaber of Commerce (Image: Handout)\nThe Chamber later welcomed the Chequers statement on future trading with the EU, though it still asked for more clarity on a number of issues affecting companies in the region.\nLaunching the new survey, Mr Ramsbotham said: “We believe it is imperative that the Government is made aware, and takes note of, the issues of concern and possible impact on business as they prepare for Brexit.\n“Our survey of members will demonstrate clearly opinions of a wide section of North East members from SMEs to larger multi-nationals.”\nThe survey will close mid-September and the results will be released in late September and included in a submission to the Government. A link to the survey is available online or by emailing . Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-07-30T14:09:00.000+03:00", "crawled": "2018-08-01T04:37:43.045+03:00", "highlightTitle": ""}