{"organizations": [], "uuid": "cd17de25e6f44dd48fbebbcb14cbd14ea3174b59", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1917920.ece/ALTERNATES/s1200/0_480.jpg", "site_section": "http://www.westernmorningnews.co.uk/editorschoices.rss", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/devon-news/stunning-dartmouth-museum-glass-extension-1917926", "country": "GB", "title": "Stunning Dartmouth Museum glass extension plan revealed", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-08-20T15:45:00.000+03:00", "replies_count": 0, "uuid": "cd17de25e6f44dd48fbebbcb14cbd14ea3174b59"}, "author": "Daniel Clark", "url": "https://www.devonlive.com/news/devon-news/stunning-dartmouth-museum-glass-extension-1917926", "ord_in_thread": 0, "title": "Stunning Dartmouth Museum glass extension plan revealed", "locations": [], "entities": {"persons": [{"name": "daniel clark", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "duke street", "sentiment": "none"}], "organizations": [{"name": "dartmouth museum", "sentiment": "none"}, {"name": "news stunning dartmouth museum", "sentiment": "none"}, {"name": "dartmouth museum thank", "sentiment": "none"}, {"name": "dartmouth museum read more documents", "sentiment": "none"}, {"name": "south hams district council", "sentiment": "none"}, {"name": "bbh", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Stunning Dartmouth Museum glass extension plan revealed It could contain a replica of the Mayflower for the 400th anniversary of the Pilgrim fathers landing in America Share Daniel Clark Local Democracy Reporter 13:45, 20 AUG 2018 Stunning 3D visualization of the expansion plans for Dartmouth Museum Thank you for subscribing!\nExpansion plans for Dartmouth Museum have been revealed. A first-floor extension to the museum in Duke Street would have a stunning new gallery for the Mayflower 400 replica.\nThe replica of the Mayflower ship is being constructed in America to commemorate the 400th anniversary of the vessel which took the Pilgrim brothers landing in America to pave the way for the founding of the United States.\nIf the plans are approved by South Hams District Council, it will give the museum more display space ahead of the Mayflower 400 celebrations in 2020, but they say that the successful museum already needs to expand. Stunning 3D visualization of the expansion plans for Dartmouth Museum Read More\nDocuments submitted to planners by BBH Architects on behalf of the museum say that the extension will have a flat roof with a glass facade and will be accessed through a door created through a bay window at the museum. The rear of the museum as it is today (Image: Google)\nThey add: “The development will also incorporate a glass box to provide natural light and a viewing gallery, giving views of the visitor centre in Royal Avenue Gardens and the Flavel Arts Centre.\n“The new gallery space created will be a much needed extension to the successful museum and will allow expansion of their historical displays, as well as being a focal point in an area which needs regeneration.” Read More Why I changed my mind over Brexit - Sarah Wollaston\nThe building was Grade I-listed in September 1949, and Historic England have backed the plans, saying that they are happy that the proposed extension will form an interesting addition to an important historic building, as well as enlivening the appearance of a street whose historic buildings have been somewhat compromised by utilitarian modern additions and the predominance of parked vehicles. 3D visualization of the expansion plans for Dartmouth Museum\nThe proposals had previously gone before the town council who said that they were happy for a planning application to be submitted. Read More", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-08-20T15:45:00.000+03:00", "crawled": "2018-08-20T16:01:57.004+03:00", "highlightTitle": ""}