{"organizations": [], "uuid": "4fa15e7b2d107227e71abc0ac16cbaae714f628f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1749621.ece/ALTERNATES/s1200/31957447JPG.jpg", "site_section": "", "section_title": "", "url": "https://www.devonlive.com/news/devon-news/earl-devon-submits-seven-planning-1878942", "country": "US", "title": "Earl of Devon submits seven planning applications for Powderham Castle - Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-08-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "4fa15e7b2d107227e71abc0ac16cbaae714f628f"}, "author": "Daniel Clark", "url": "https://www.devonlive.com/news/devon-news/earl-devon-submits-seven-planning-1878942", "ord_in_thread": 0, "title": "Earl of Devon submits seven planning applications for Powderham Castle - Devon Live", "locations": [], "entities": {"persons": [{"name": "earl of devon", "sentiment": "none"}, {"name": "charlie courtenay", "sentiment": "none"}, {"name": "daniel clark", "sentiment": "none"}], "locations": [{"name": "devon", "sentiment": "none"}, {"name": "kenton", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}], "organizations": [{"name": "teignbridge district council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Earl of Devon submits seven planning applications for Powderham Castle The castle on the edge of Exeter where the Radio 1 Big Weekend was held wants to improve the entrance and car parking Share Daniel Clark Local Democracy Reporter 12:05, 9 AUG 2018 Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Thank you for subscribing!\nThe Earl of Devon has submitted seven planning applications to improve the access to and facilities for visitors to his Powderham Castle home.\nThe separate planning and listed building consents have been submitted to Teignbridge District Council for land at the castle in Kenton, the home of Radio 1’s Big Weekend in 2016.\nThe plans would improve facilities for visitors with a new welcome building, replace the existing grass car park with an all-weather use, increase capacity, car park, and widen the access and the driveway to the castle to control the flow of traffic. The Earl of Devon, Charlie Courtenay The seven applications are: Re-arrangement of the entrance to allow two-way access and to widen the drive alongside the Country Stores. Resurfacing of the main car park To add new lighting and power points to the visitor car park A new welcome building in the main car park that will operate as a ticketing hub, reception and information centre Addition of new gates and fencing on the drive alongside the main car park A new covered shelter and pergola structure in the walled garden to improve the facilities Refurbishment of the existing toilets in the castle courtyard Visit Powderham Castle all year round with a season ticket\nDocuments submitted by The Earl of Devon, Charlie Courtenay, who has recently become a member of the House of Lords, say: “The castle and estate has been open to the public for over 60 years and this heritage attraction attracts approximately 35,000 visitors each summer. However, viability has been challenging due to a lack of infrastructure investment since the 1990s, together with seasons and spatial limitations.\n“We wish to make a number of infrastructure improvements that will provide improved facilities for visitors and correspondingly allow visitor numbers to grow and support the viability of the attraction, which will in turn support the long term future of the castle and the estate.” Powderham Castle\nThe plans for part of a grant application that has been made to the Rural Development Programme for England.\nHowever, fears over Brexit as the RDPE is part funded by the European Union mean that Powderham Castle must submit their application for grant funding by September 30, accompanied by full planning permissions and listed building consent.\nTeignbridge District Council has two planning meetings scheduled before September 30, if the application did need to go before councillors. Read More Things to do in Devon with children\nLord Courtenay added: “The project will widen and improve access from the A379 to improve safety, reduce and disturbance to the existing narrow historic Castle entrance, permit two-way traffic and allow unimpeded bus and lorry access to the attraction. Access to the Powderham estate has always been problematic but this will improve safety by widening the entrance and the driveway to properly accommodate two-way traffic and a new 2m wide pavement for pedestrians will be provided.\n“Surfacing Powderham’s seasonal and often waterlogged, grass visitor car park, with a permeable stone will allow all-weather use, increase capacity and an extended opening season, and infrastructure for temporary lighting within the car park, as well as additional fencing and gates to control the flow of traffic and pedestrians will improve safety and security.\n“A new welcome centre will be an upgrade from the current small hut and will provide a ticketing hub, a reception, information services, basic refreshments and better staff facilities. It will provide many essential service for visitors that are not currently conveniently found on the estate.” A sketch of the Welcome Building for Powderham Castle\nThe seven applications form an essential part of a full grant application made to the Rural Development Programme for England, Lord Courtenay added, as it is deemed that further investment in Powderham’s tourism infrastructure would continue to act as a ‘growth pole’ for the local economy.\nBut, the statement adds: “Powderham is working to an absolute grant submission deadline of September 30 and it must be supported by the necessary planning permission and listed building consents. The deadline is exacerbated further by the UK’s departure from the EU (which provides funding for the RDPE) and the current uncertainty surrounding the future of such initiatives.”\nTeignbridge District Council planners will make the decision on the applications – with a current target date of October 1 listed on their planning portal. Like us on Facebook", "external_links": [], "published": "2018-08-09T03:00:00.000+03:00", "crawled": "2018-08-09T14:18:16.013+03:00", "highlightTitle": ""}