{"organizations": [], "uuid": "54cd7b87e6c741a8523122be5ce854206a860d4e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15069245.ece/ALTERNATES/s1200/0_Joseph-Anderson-has-embarked-on-a-five-year-business-plan-to-increase-his-flock-of-sheep.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/farming/morpeth-farmer-increases-lambing-stock-15069142", "country": "GB", "domain_rank": 21960, "title": "Morpeth farmer increases lambing stock by 40% after rolling out five-year plan", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-08-24T16:17:00.000+03:00", "replies_count": 0, "uuid": "54cd7b87e6c741a8523122be5ce854206a860d4e"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/farming/morpeth-farmer-increases-lambing-stock-15069142", "ord_in_thread": 0, "title": "Morpeth farmer increases lambing stock by 40% after rolling out five-year plan", "locations": [], "entities": {"persons": [{"name": "joseph anderson", "sentiment": "negative"}, {"name": "anderson aberfield", "sentiment": "none"}, {"name": "anderson", "sentiment": "none"}], "locations": [{"name": "fairnley", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}], "organizations": [{"name": "unk", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Joseph Anderson has embarked on a five-year business plan to increase his flock of sheep (Image: Unknown) Get business updates directly to your inbox Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nA Northumberland sheep farmer is on track to increase his outdoor lambing flock by 40% to 2,000 ewes after engaging in a five-year business strategy.\nJoseph Anderson began future proofing his farm at Fairnley, Cambo , four years ago and is now expecting his sheep flock to increase in size to 2,000 ewes and 600 followers.\nThe large increase to his flock numbers has occurred after he introduced rotational grazing together with higher performing Innovis genetics.\nHe also cut back his herd of suckler cows from 200 to just 40.\nExplaining the changes at his farm, Mr Anderson said: “We agreed a five-year business strategy solely dedicated to sheep and one that would be resilient to fewer and fewer payments by pushing ewe numbers that could be managed by one person and increasing our options by developing a self-replacing whitefaced flock. Anderson Aberfield Mule shearling ewes with Highlander cross lambs at foot (Image: Unknown)\n“Since then, we have almost completed phasing out our traditional Northumberland Blackface and Mule ewes with the Aberfield Mule and Highlander Aberfield Mule, together with a ‘B’ flock of Primera cross.\n“The result; we are breeding smaller replacements - an average 65kg mature weight.\n“That’s 20kgs less than the average Mule enabling us to increase stocking by 50%. They also have better conformation and denser wool, and a higher value wether lamb.”\nMr Anderson is the fourth generation of his family to farm Fairnley and his practices have demonstrated that he is open to change.\nThe trait runs in the family as his grandfather, Jack, was instrumental in developing the North of England Mule after the Second World War.\nMr Anderson said: “The Mule did the job, she added value by producing more lambs. Anderson Northumberland Blackface ewes with Aberfield Mule lambs at foot (Image: Unknown)\n“However, times are fast changing. Horned ewes have their place, yet I struggle to see their long-term future on this sort of LFA unit when the options are very limited.\n“Also, nowadays I think it’s important to invest in sheep that come with an evidence base – I need to know what I’m buying.”\nMr Anderson is also considering increasing his production efficiency by selling off his entire crop of weaned wethers straight off their dams as stores at 90 days of age.\nDoing so would free up more grass enabling the farm to stock more ewes.\nThe business has taken a cashflow hit as a result of retaining all of the Aberfield Mule gimmers over the last two years, as the farm traditionally derived a lot of its income from selling Mule gimmers.\nHowever, Mr Anderson is glad that he rolled out the five-year strategy long before the Brexit referendum.\nHe said: “It means we have had a head start to continue to fine tune the unit’s efficiency before the impact of reduced payments begins to bite.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-08-24T16:17:00.000+03:00", "crawled": "2018-08-24T22:52:56.000+03:00", "highlightTitle": ""}