{"organizations": [], "uuid": "dfd21b527275a42a822f1edffc9c6e2b3369a0f9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15073655.ece/ALTERNATES/s1200/0_Peoples-Vote.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/brexit-called-britains-biggest-economic-15073596", "country": "GB", "domain_rank": 21960, "title": "Brexit called Britain's 'biggest economic and social disaster' at Newcastle rally", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-08-25T19:36:00.000+03:00", "replies_count": 0, "uuid": "dfd21b527275a42a822f1edffc9c6e2b3369a0f9"}, "author": "Katie Collings", "url": "https://www.chroniclelive.co.uk/news/north-east-news/brexit-called-britains-biggest-economic-15073596", "ord_in_thread": 0, "title": "Brexit called Britain's 'biggest economic and social disaster' at Newcastle rally", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "negative"}, {"name": "anna turley", "sentiment": "none"}, {"name": "vince cable", "sentiment": "none"}, {"name": "phil wilson", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "sedgefield", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}], "organizations": [{"name": "news brexit", "sentiment": "negative"}, {"name": "newcastle", "sentiment": "negative"}, {"name": "liberal democrats vince cable", "sentiment": "none"}, {"name": "sedgefield", "sentiment": "none"}, {"name": "redcar", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Brexit called Britain's 'biggest economic and social disaster' at Newcastle rally Liberal Democrat leader Vince Cable and Redcar MP Anna Turley were among those who gave impassioned speeches to hundreds of protesters Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nHundreds of passionate protesters gathered in Newcastle on Saturday to demand a “People’s Vote” on the Brexit deal.\nLeader of the Liberal Democrats Vince Cable and Redcar MP Anna Turley were among several speakers who attended the event to call for a referendum on the final Brexit deal agreed between the EU and the UK - if there is one.\nRepresentatives from industries likely to be affected by Brexit such as NHS staff and teachers also spoke at the rally at the Assembly Rooms in the city centre. Phil Wilson, MP for Sedgefield, gives a speech at a People's Vote campaign in The Assembly Rooms, Newcastle (Image: Staff)\nSedgefield MP Phil Wilson, compèring the rally, called Brexit the “biggest issue facing the country since the Second World War” and claimed that people were starting to realise the consequences of leaving.\nHe also slammed the “myths, lies and deceit” from Tory MPs such as Jacob Rees Mogg, Boris Johnson and Michael Gove.\nEnding his opening speech to the cheering crowds, he said: “Democracy did not end on June the 23rd 2016. Supporters of the People's Vote campaign gather at The Assembly Rooms, Newcastle, to watch speeches by politicians in eluding Vince Cable (Image: Staff)\n“People should make the decision on whether they want to be poor for generations to come.\n“I know where I stand.”\nVince Cable took to the stage and warned that the North East was in the “frontline” when it came to the fall-out of leaving the EU.\nHe said: “I came into the city a few minutes ago past the Centre for Life, great scientific research is done in this city yet it’s scientific research that will be crucified by the break-up of the cooperation with the EU.” Vince Cable gives a speech at a People's Vote campaign in The Assembly Rooms, Newcastle (Image: Staff)\nThe Twickenham MP added: “We’ve got to win the argument now for having the people’s vote. Some people will say it’s all in vain. It’s not too late, there is still time.\n“The biggest lesson we need to learn is that very often a whole generation imposes it’s preferences on young people. So what we want to see if we get this People’s Vote is that 16 and 17-year-olds get voting.\n“This is a campaign we are winning. We can win and we will win.”\nThe most rousing speech came from Redcar’s Labour Co-operative MP Anna Turley who called Brexit the “biggest economic and social disaster we’ve faced in Britain in our lifetime”. Redcar MP Anna Turley at the People's Vote rally in Newcastle (Image: newcastle chronicle)\nShe added: “The North East is going to suffer the most, we are right on the precipice and the time to resist is now.”\nMs Turley said she understood that the region had overwhelmingly voted to leave “out of frustration and a desire for change”.\n“We knew we were suffering, but I’m afraid we chose the wrong medicine,” she said.\nSaying she voted to trigger Article 50 believing the Government could secure a good deal, she added: “Of course we see it’s the posh boys running the show again. Supporters of the People's Vote campaign gather at The Assembly Rooms, Newcastle (Image: Staff)\n“Jacob Rees Mogg, Nigel Farage, Boris Johnson; They don’t understand this region. No one here voted for them.”\nShe concluded: “Look around you today. You are not alone. You are making your voices heard, you do have power.\n“Together we can get the People’s Vote and stop the madness of a hard Tory Brexit.”\nSpeaking to ChronicleLive after his speech, Vince Cable said: “People, particularly in the North East, are beginning to realise how disastrous Brexit will be.\n“Companies like Nissan are tied up in Red Tape, they won’t survive for very long.\n“I can’t criticise people who voted to leave. They were fed up and wanted change but Brexit is not the way to do it.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-08-25T19:36:00.000+03:00", "crawled": "2018-08-25T23:16:08.005+03:00", "highlightTitle": ""}