{"organizations": [], "uuid": "1407c6516b1b730453126bd8418d95f51fac4075", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15083543.ece/ALTERNATES/s1200/0_BLR_MGA_030217mgahelicopter_06.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/learner-pilots-grounded-newcastle-flight-15083087", "country": "GB", "domain_rank": 21960, "title": "Learner pilots grounded as Newcastle flight training school goes into liquidation", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-08-28T18:00:00.000+03:00", "replies_count": 0, "uuid": "1407c6516b1b730453126bd8418d95f51fac4075"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/learner-pilots-grounded-newcastle-flight-15083087", "ord_in_thread": 0, "title": "Learner pilots grounded as Newcastle flight training school goes into liquidation", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Business Learner pilots grounded as Newcastle flight training school goes into liquidation PTT Aviation is going into voluntary liquidation two years after taking over schools at both Newcastle and Durham Tees Valley airports Share The flight school at Durham Tees Valley Airport (Image: Collect Unknown)\nLearner pilots have been grounded at Newcastle and Durham Tees Valley airports after directors at training firm PTT Aviation decided to liquidate the business.\nPilot training and testing specialist PTT Aviation acquired flight training organisations at Newcastle and Durham Tees Valley airports back in 2016 for an undisclosed sum, also buying out the training facility at Leeds Bradford Airport.\nAt the time of the sale, the firm resulted in the firm having a fleet of 30 aircraft and helicopters across the North and around 50 staff. Read More This entrepreneurial mother quit a top level job to launch a successful artistic venture\nNow, however, it has emerged that the firm is preparing to enter liquidation.\nA phone message on PTT Aviation tells callers: “The company has reluctantly taken the decision to place the company in creditors voluntary liquidation.\n“The date of liquidation will be September 3 2018.”\nThe message also directs anyone with questions to contact insolvency company Clark Business Recovery.\nThe firm’s planes at Leeds Bradford Airport have also been grounded and are unable to leave the airport\nLeeds insolvency specialist Clark Business Recovery has been brought in to act as the firm’s liquidators.\nThe firm did not comment but confirmed that PTT would enter liquidation next week.\nThe aviation school’s website has been suspended.\nIt is unknown whether a buyer will be sought for the company or whether its assets will be sold off. It is also not known how many staff are affected.\nThe Newcastle flying school was originally launched in 1925 at Cramlington Airfield by a group of First World War pilots who wanted to continue flying. Read More Government urged to support North East creative industries post Brexit\nThey formed Northumbria Flying School, which moved to a new base at Newcastle airport in 1935.\nSince then, hundreds of trainee pilots have received training at the airport, learning basic flight training to gain private flying licences as well as getting the opportunity to learn more advanced skills to go into commercial careers within the flight industry. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-08-28T18:00:00.000+03:00", "crawled": "2018-08-29T05:10:10.668+03:00", "highlightTitle": ""}