{"organizations": [], "uuid": "a950dcdf910a13131bece6b322c73130ac4aa2a6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14978563.ece/ALTERNATES/s1200/0_KMR_MGA_100614quorn_01.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/quorn-owner-smashes-200m-turnover-14978381", "country": "GB", "domain_rank": 21960, "title": "Quorn owner smashes £200m turnover mark as firm focuses on marketing", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-08-01T17:13:00.000+03:00", "replies_count": 0, "uuid": "a950dcdf910a13131bece6b322c73130ac4aa2a6"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/quorn-owner-smashes-200m-turnover-14978381", "ord_in_thread": 0, "title": "Quorn owner smashes £200m turnover mark as firm focuses on marketing", "locations": [], "entities": {"persons": [{"name": "mo farah", "sentiment": "none"}, {"name": "stokesley", "sentiment": "none"}, {"name": "james harvey", "sentiment": "none"}, {"name": "marlow", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}], "organizations": [{"name": "marlow foods", "sentiment": "negative"}, {"name": "cauldron foods", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Quorn owner smashes £200m turnover mark as firm focuses on marketing Marlow Foods owns vegetarian food brands Quorn and Cauldron Foods Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nThe owner of vegetarian food company Quorn has added almost £30m to its turnover after upping its marketing activity.\nStokesley’s Marlow Foods - which owns the Quorn and Cauldron Foods brands - saw its turnover jump 16.2% from £176.1m to £204.6m for the year ending December 2017.\nThe company said the huge increase in its revenues was largely due to it investing in marketing. The company is best known for its TV ad campaigns featuring double Olympic gold medal winner Mo Farah.\nIn Marlow’s accounts, chief financial officer James Harvey said: “The group delivered a strong performance with turnover at £204.6m. Sales growth was 16.2%.\n“Sales in the UK continued to perform well with growth being driven through increased investment in consumer and customer marketing activities. Sales in overseas markets were also strong especially in the USA, Nordics, Australia and Germany.”\nThe UK continues to be Marlow Foods’ biggest market, making up three quarters of the firm’s revenue. UK sales grew from £136.7m to £152.4m during the year. Overseas sales continued to increase with European sales jumping 33% to £31.9m, while revenue from the rest of the world increased from £15.3m to £20.4m. Read More Head of Steam owner launches new nano brewery and bar to concoct new beers\nWhile the company continued to grow overseas, it emphasised that it would not halt its investment plans due to Brexit.\nMr Harvey said: “The uncertainty of Brexit negotiations makes it difficult to assess the future impact over future trade in Europe, however, we continue to review the situation and we do not plan to limit out planned investment to grow our international business.”\nQuorn recently revealed it was creating hundreds of jobs in Teesside over the next five years as part of plans to create a new £7m headquarters in Stokesley. The develop is being carried out to create a “high tech powerhouse” for the global brand in the North East. Read More New sky lounge and garden as Vermont Hotel launches mission to become city's top destination\nHowever, Mr Harvey added that the group had suffered increased costs due to “exposure to foreign currencies” and “commodity price fluctuation”.\nDespite the increased costs the group’s operating profit increased by 27% to £31.9m. Profit after tax also grew to £20.4m.\nMarlow Foods also increased its headcount from 657 members of staff to 703 in 2017. More jobs have been added after the accounts period, with staff numbers now standing at around 750. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-08-01T17:13:00.000+03:00", "crawled": "2018-08-01T17:37:55.013+03:00", "highlightTitle": ""}