{"organizations": [], "uuid": "44ceee78b96bb710c0a8f5e7f63d36ee202054af", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/whats-on/whats-on-news/article1852097.ece/ALTERNATES/s1200/0_IMG_5440JPG.jpg", "site_section": "http://www.middevongazette.co.uk/theatre-news.rss", "section_title": "Devon Live - What's On News", "url": "https://www.devonlive.com/whats-on/whats-on-news/crowds-enjoy-family-feast-chagstock-1852092", "country": "GB", "title": "Crowds enjoy a family feast as Chagstock festival returns", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-08-02T01:29:00.000+03:00", "replies_count": 0, "uuid": "44ceee78b96bb710c0a8f5e7f63d36ee202054af"}, "author": "devonlive", "url": "https://www.devonlive.com/whats-on/whats-on-news/crowds-enjoy-family-feast-chagstock-1852092", "ord_in_thread": 0, "title": "Crowds enjoy a family feast as Chagstock festival returns", "locations": [], "entities": {"persons": [{"name": "googlin", "sentiment": "none"}, {"name": "hunter", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "imelda may", "sentiment": "none"}, {"name": "jessie jones", "sentiment": "none"}], "locations": [], "organizations": [{"name": "buzzcocks", "sentiment": "none"}, {"name": "si ford", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Crowds enjoy a family feast as Chagstock festival returns Music to please everyone says reviewer and festival goer Jessie Jones Share Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nDevon’ favourite family festival returned again this year to Whiddon Down As always the festival organiser, Si Ford, somehow manages to provide musical feasts to please everyone, no matter what their taste. This year was no exception the Buzzcocks on Friday to the mellow, musical delight that was Imelda May on the Saturday, combined with sumptuous guitar playing, rocking and performances from all those who took to the stage. Each year you think it can’t get better and each year it does.\nThe weather that greeted the festival goers was glorious encouraging all who were there to strut their stuff to The Correspondents, rock out to the amazing Hunter and the Bear, before an unexpected downpour did little to the enthusiasm of those who moshed away to the Buzzcocks at the end of the first day. Read More One place has been Googling Brexit more than anywhere else - and it's in Devon\nAmazing acts came thick and fast on Saturday and there wasn’t any respite as one great act followed another, many of those being little known but have gathered a new following. The list is long but some of the highlights belonged on the Marquee stage, thank you Chay Snowdon, Huw Eddy & The Carnival, The Wood Burning Savages and The Hot Sprockets. However the day belonged to the final performance and nobody who was there can forget the amazing, poignant and emotional performance from the amazing Imelda May.\nDespite being a music festival Chagstock is plenty more besides. I can think of very few festivals where children are welcomed and encouraged. The family atmosphere is contagious and it comes as no surprise to find adults giving way at the front of the stage to allow children the opportunity to enjoy the bands at close range. Read More There are FOUR music festivals happening in Torbay this spring - here are the star-studded line-ups\nAt the top of the field you can find the food stalls, a village green area and a special area for kids of all ages to enjoy. Complete with making tent, climbing wall and other activities that can make a welcome change from the great music on offer.\nOne of the attractions of Chagstock is that the two main stages are staggered, so that no two bands are playing at the same time, as a result there is no excuse to miss your favourite band unless you are in the impressively large beer tent or playing at the top of the field. As with all festivals there are range of different food suppliers and the variety for the current year was exceptional.\nEach year the festival plays host to a theme, allowing everyone the opportunity to dress up. This years it was space and sci fi an idea that all embraced. The numerous aliens, jedi, and robots was almost enough but for the man who walked into the festival dressed as a solar system, on a blistering hot day, we can but salute you. Read More Stunning location, diverse line-up and brilliant bands as Chagstock returns for 2018\nIf you have not yet discovered this wonderful, family friendly festival then it comes highly recommended. So when it comes around next year give yourself and your family a treat and head off to the best festival in the South West Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-08-02T01:29:00.000+03:00", "crawled": "2018-08-02T01:36:27.007+03:00", "highlightTitle": ""}