{"organizations": [], "uuid": "535aebf791bed9affa9d8cc65dd944729f8dfe50", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/special-features/article1884806.ece/ALTERNATES/s1200/0_wiba-logoJPG.jpg", "site_section": "http://www.leicestermercury.co.uk/rss.xml", "section_title": "Leicestershire Live - frontpage", "url": "https://www.leicestermercury.co.uk/special-features/sponsor-delighted-involved-women-business-1884667", "country": "GB", "domain_rank": 48128, "title": "Sponsor 'delighted to be involved with Women in Business Awards'", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-08-10T17:25:00.000+03:00", "replies_count": 0, "uuid": "535aebf791bed9affa9d8cc65dd944729f8dfe50"}, "author": "Russ Taylerson", "url": "https://www.leicestermercury.co.uk/special-features/sponsor-delighted-involved-women-business-1884667", "ord_in_thread": 0, "title": "Sponsor 'delighted to be involved with Women in Business Awards'", "locations": [], "entities": {"persons": [{"name": "russ taylerson", "sentiment": "none"}, {"name": "rob bunting", "sentiment": "none"}, {"name": "elizabeth robson", "sentiment": "none"}, {"name": "richard todd", "sentiment": "none"}, {"name": "arnold", "sentiment": "none"}], "locations": [{"name": "rutland", "sentiment": "none"}, {"name": "leicester mercury women", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}], "organizations": [{"name": "pole arnold", "sentiment": "none"}, {"name": "rothley wine estate", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Sponsor 'delighted to be involved with Women in Business Awards' Deadline for nominations approaching Russ Taylerson Commercial Editor, Reach East Midlands 15:25, 10 AUG 2018 Rob Bunting from Pole Arnold with Entrepreneur of the Year Award winner from 2017, Elizabeth Robson from Rothley Wine Estate (Image: 2017 Matt Short Photography) Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nWith the deadline for nominations approaching, we are highlighting each of the categories at the Leicester Mercury Women in Business Awards.\nThe awards celebrate the achievements of outstanding female entrepreneurs and businesswomen in Leicester, Leicestershire and Rutland.\nThe Entrepreneur of the Year Award is one of the most keenly sought after awards.\nIt is once again being sponsored by Narborough-based financial management firm Pole Arnold.\nRichard Todd, director of Pole Arnold, said: “We are delighted to be involved in the Leicester Mercury Women in Business Awards 2018.\n\"Over half of our team are female, which include our three senior managers as well as a senior adviser, and we feel privileged to be sponsoring the Entrepreneur of the Year Award.\n\"We have first-hand experience of the women within our team’s entrepreneurial contribution to our own business. Team work is essential in our business and if asked I would like to think that all of the women working for us feel that they are encouraged to bring entrepreneurial skills to their work. Read More It's time to nominate the outstanding achievements of Women in Business 2018\n“There are plenty of female role models in the entrepreneur space although it appears we still seem to have some way to go before reaching equilibrium. Clearly there will be plenty of challenges for female entrepreneurs as our Brexit negotiations progress.\n\"It was clear from the high quality of entries last year that there are many entrepreneurial women in Leicestershire and we are looking forward to meeting this year’s Entrepreneur of the Year candidates. Good luck to all the nominees.”\nThe Leicester Mercury is hosting the awards in partnership with BHIB insurance brokers.\nThe winners of the Leicester Mercury Women in Business Awards will be announced at a glamorous event at the Leicester Tigers’ stadium on September 27. The awards will consist of a red carpet drinks reception, followed by a three-course dinner and then the awards presentation.\nThere are 12 awards up for grabs, including the Entrepreneur of the Year prize.\nYou can nominate an individual or business, simply by logging onto women in business and clicking the link to nominate.\nFor further information regarding the awards or an opportunity to purchase a table, please contact Richard Edwards on 0115 905 1913. Categories for this year’s awards Entrepreneur of the Year Sole Trader of the Year Business Innovation Award Small Business of the Year, Rising Star Female Apprentice of the Year New Business of the Year Inspirational Woman of the Year Women in the Public Sector Lifetime Achievement Award", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/leicestermercury/subscriptions/&quot;}"], "published": "2018-08-10T17:25:00.000+03:00", "crawled": "2018-08-10T18:42:45.086+03:00", "highlightTitle": ""}