{"organizations": [], "uuid": "a3af3da502d364797d9e1d60de5e196077cd5b4d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1475033.ece/ALTERNATES/s1200/1.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/devon-news/exeter-being-asked-support-peoples-1922646", "country": "GB", "title": "Exeter being asked to support a People's Vote on the final Brexit deal", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-08-21T18:29:00.000+03:00", "replies_count": 0, "uuid": "a3af3da502d364797d9e1d60de5e196077cd5b4d"}, "author": "Daniel Clark", "url": "https://www.devonlive.com/news/devon-news/exeter-being-asked-support-peoples-1922646", "ord_in_thread": 0, "title": "Exeter being asked to support a People's Vote on the final Brexit deal", "locations": [], "entities": {"persons": [{"name": "cllr musgrave", "sentiment": "none"}, {"name": "ben bradshaw", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "daniel clark", "sentiment": "none"}, {"name": "cllr chris musgrave", "sentiment": "none"}], "locations": [{"name": "exeter", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}], "organizations": [{"name": "brexit", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "exeter city council", "sentiment": "none"}, {"name": "city council", "sentiment": "none"}, {"name": "green party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Exeter being asked to support a People's Vote on the final Brexit deal A motion is being put to Exeter City Council Share Daniel Clark Local Democracy Reporter 16:29, 21 AUG 2018 Get Daily updates directly to your inbox Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nThe Green Party in Exeter is backing a ‘People’s Vote’ on the final Brexit deal – and will urge Exeter City Council to do the same.\nCllr Chris Musgrave, the Green Party councillor for the Alphington ward, will put forward a motion to the next full council meeting asking the City Council to express support publicly for a People’s Vote on the final terms of any Brexit deal,\nA letter would then be written to local MP, Ben Bradshaw, who is backing a People’s Vote, and the Prime Minister, Theresa May, informing them of Exeter City Council’s decision to support a vote.\nMore than half of Exeter residents who voted in the EU referendum, 55 per cent, voted to remain in the EU. Read More Council news\nCllr Musgrave said: “The EU referendum should be seen as the beginning of a democratic process, not the end of one. In light of the changing mood of people across the region and the strong support for EU membership in Exeter by residents and businesses I hope councillors will agree it’s time to back a People’s Vote.\n“The serious breaches of electoral law by the Leave campaign also strengthens the case for such a poll and casts doubt on the legitimacy of the result of the 2016 EU referendum.\n“For many people, the economic, environmental and social impacts of Brexit have only become apparent since the referendum. It is clear we need a final say on our membership of the EU once we know exactly what the alternative to EU membership will look like.”\nThe motion, which has been seconded by Liberal Democrat councillor Kevin Mitchell, says: This Council notes: 55 per cent of Exeter residents who voted in the EU referendum voted to remain in the EU Exeter has a greater share of exports to the EU than any other city in the UK (70 per cent of exports from the city are destined for EU countries). A recent Local Business Survey showed that confidence among SMEs in the West of England in the government to deliver a Brexit that works for business is on the wane, with only 11.69 per cent of 230 businesses polled being confident or very confident that there will be a good deal Polling in July 2018 found that 71 per cent of British people disapprove of how the Brexit negotiations are being handled Polling in August 2018 found that voters in the South West of England back a second referendum on the Brexit deal by a margin of 42 per cent to 35 per cent. This Council believes: That the EU referendum on June 23, 2016 should be considered the beginning of a democratic process, not the end of one. That the conclusion by the Electoral Commission that the Leave campaign committed serious offences by breaking electoral law casts doubt on the legitimacy of the result of the 2016 referendum. That new information on the way the referendum campaign was conducted and the economic, environmental and social impacts of Brexit, which have come to light since the referendum, may have altered some voters’ preferences regarding desired outcomes of the Brexit negotiations. That giving the British people a final say on the Brexit negotiations will help to rebuild trust and engagement in the political process. This Council resolves: To express our support publicly for a People’s Vote on the final terms of any Brexit deal. To write to our local MP, Ben Bradshaw, and the Prime Minister, Theresa May, informing them that Exeter City Council has passed this motion in support of a People’s Vote.\nThe next full Exeter City Council meeting is currently scheduled for Tuesday, October 16.\nDo you have a story to share or for us to investigate?\nGet in touch using or call 07775 030856 or tweet me @HEDanielClark\nWant more news?\nFor Devon news, find Devon Live's Facebook page here and Twitter here , or visit our homepage at www.devonlive.com Like us on Facebook", "external_links": ["https://twitter.com/HEDanielClark", "https://twitter.com/DevonLiveNews", "https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}", "https://www.facebook.com/devonlivenews/"], "published": "2018-08-21T18:29:00.000+03:00", "crawled": "2018-08-21T18:52:50.000+03:00", "highlightTitle": ""}