{"organizations": [], "uuid": "051775a33508000231e103df097d998e8401df25", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14746993.ece/ALTERNATES/s1200/0_Uber-licence.jpg", "site_section": "http://www.thejournal.co.uk/business/?service=rss", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15080040", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast RECAP: Uber teams up with Toyota in $500m self-driving car deal", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-08-28T10:30:00.000+03:00", "replies_count": 0, "uuid": "051775a33508000231e103df097d998e8401df25"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15080040", "ord_in_thread": 0, "title": "Business Breakfast RECAP: Uber teams up with Toyota in $500m self-driving car deal", "locations": [], "entities": {"persons": [{"name": "jonathon manning hairdressers", "sentiment": "negative"}, {"name": "gerrard", "sentiment": "none"}], "locations": [], "organizations": [{"name": "toyota", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning Hairdressers and hospitality firms urged to hire victims of modern slavery\nFirms in hospitality, hairdressing and social care are being urged to offer jobs to the victims of modern slavery.A programme launched by the Co-op is already being supported by businesses across sectors of the economy, providing employment for those rescued from slavery.Bright Future, devised by the Co-op in conjunction with charity City Hearts, offers victims a four-week paid work placement leading to an interview.Paul Gerrard, director of campaigns at the Co-op, said:\nVictims of this wicked crime come from a wide range of backgrounds and offer a vast variety of skills and experiences.\nIt is essential that the programme offers jobs across the complete spectrum so the maximum number of victims can be supported with the dignity of paid, freely chosen employment.\nWithout this, there is a real chance that they could fall back into the hands of those who have exploited them and for the terrible, unspeakable cycle of enslavement to begin again.\nMany candidates said they would prefer a job in a hotel or restaurant, social and child care or hairdressing and beauty. Co-op is launching a programme to help those affected by modern slavery get into work (Image: PA) 9:13 Jonathon Manning Deloitte pledge North East investment in people after recording revenue rise to £3.58bn\nBusiness advisory firm Deloitte said it will continue investing in its North East base after marking an eighth year of revenue growth in a row.\nOn a national level the company’s revenue rose by 5.9% in the year ended May 31 2018, from £3.38bn to £3.58bn, with almost all of its divisions chalking up increases.\nIts audit and risk advisory division grew by 10.2% to £1.027bn, consulting increased by 1.7% to £873m, and tax saw its revenue rise by 5.8% to £732m.\nFinancial advisory remained at £459m.\nDeloitte’s 700-strong Yorkshire & North East practice, which encompasses Newcastle and Leeds, said it saw another year of strong revenue growth and that the current year has also had a solid start.\nStuart Cottee, who was appointed practice senior partner in January, said:\nOur growth this year was underpinned by continued investment in our people, a large number of new client wins across our service lines, as well as being boosted by the buoyant M&A market.\nConsistent with the performance of Deloitte nationally, our Yorkshire & North East practice has performed strongly, with particularly good results achieved by our global employer services, forensic and restructuring services businesses, which all achieved growth in excess of 20%.\nOur transactions business has also been very busy, and this has continued since our year-end, with strong growth in our transaction Services, m&a tax, debt advisory and financial advisory businesses.\nOf particular note last year, we provided corporate finance advisory, debt advisory and tax advisory services as part of the deal which saw LDC investing £31.8m for a significant minority shareholding in Newcastle-based NBS. Stephen Hall, office senior partner for Deloitte in Newcastle (Image: Deloitte) 9:07 Jonathon Manning Bunzl enters Norway and hints at further takeovers\nFTSE 100 firm Bunzl has made its first foray into the Norwegian market after snapping up a local catering supplies firm, and said further takeovers are on the cards after logging an 8% jump in profits.The outsourcing and distribution firm announced on Tuesday that it had acquired Oslo-based Enor, which supplies light catering equipment to hotels, restaurants, hospitals and fast food chains.The terms of the deal were not disclosed, but Bunzl said Enor logged £27m in revenue in the year to December 31 2017.Frank van Zanten, Bunzl’s chief executive, said:\nThe acquisition of the Enor group is an exciting development for Bunzl as it represents our first acquisition in Norway and means that we now have operations in 31 countries globally.\nThe business has a leading position in the catering equipment market and further extends our business in Scandinavia where we already have a strong presence in Denmark.\nThe news came as Bunzl released its half-year results, having logged a 5% rise in half-year revenues to £4.3bn.Sales were helped by recent acquisitions but partly offset by the disposals of two businesses in the UK and France.Pre-tax profits for the half year to June 30 rose 8% to £197.3m, up from £181.9m during the same period last year.Mr van Zanten said new takeovers were now on the cards.He said:\nLooking forward to the rest of the year, the board is confident that the prospects for the group are positive and that the company will continue to develop the business and build shareholder value through a combination of organic growth and further acquisitions as the year progresses. Bunzl premises KEY EVENT Government urged to support North East creative industries post Brexit\nThe head of an influential business network has called for the Government to provide more support for North East creative firms after Brexit.\nJim Mawdsley, CEO of Generator, which runs the Digital Union network, has warned that the region’s creative sector could suffer when EU funding comes to an end after Brexit.\nMr Mawdsley said:\nGenerator and Digital Union have done a great deal over the years to support the creative digital sector, but this support could be under threat following the decision to leave the EU.\nWe have enjoyed significant support in terms of European Regional Development Funding since 2010 and all of this has been invested in supporting and growing businesses in the sector through a wide range of interventions from encouraging young entrepreneurs to start businesses right through to our Digital Scale Up programme.\nIf the Government doesn’t replace this funding in the future then we may only be able to help those who are currently in a position to pay for support which would certainly damage the future growth of the sector.\nHis comments come after Government figures revealed that the economic impact of the North East’s creative, gambling and sport industries fell by 5% during 2015 and 2016.\nThe creative industry, gambling and sport - known collectively as DCMS sectors - contributed £3.8bn to the North East economy during 2016. But the figure was down from a record high of £4bn during the previous year. Jim Mawdsley, CEO of Generator, speaks at the Digital Union event (Image: Digital Union) 8:55 KEY EVENT Loyal home insurance customers hit with excessive premiums, says Which?\nLoyal home insurance customers can find themselves paying a £75-per-year loyalty penalty for sticking with the same provider, Which? has found.The consumer group found customers with combined buildings and contents policies owned for longer than a year were paying, on average, £75 more annually than new customers.On average, existing customers were paying £270 per year for a combined policy, while new customers were paying £195, it found.The loyalty penalty was found to balloon over time.Customers who had been with the same insurer for over 20 years paid around double the amount of what new customers paid.For combined insurance, the average premium paid for a policy 20 or more years old was £396 per year, compared with the £195-per-year average for new customers.Seven in 10 (69%) of those surveyed had been with their insurer for longer than a year.\nHarry Rose, Which? money editor, said:\nIt is unacceptable that longstanding policyholders are taken for granted by insurance providers and hit by these excessive premiums.\nCustomers who prefer to stay with one provider are at risk of being exploited by these vastly overpriced premiums when little has changed in the service they receive.\nInsurers must make sure existing customers remain a priority, and are not sidelined by the push to attract new business.\nOver 7,000 people with a home insurance policy were surveyed.\nA spokesman for the Association of British Insurers (ABI) said:\nWe recognise that the insurance market is not working as well as it should for many longstanding customers.\nWe want everyone to get the best deal in a competitive market, which is why we have launched an industry initiative to help those customers who do not shop around.\nThis will include insurers reviewing the policies of customers who have been on their books for five or more years to ensure they are getting the best deal for their needs. Canceling your home insurance could save you money (Image: PA) 8:50 Jonathon Manning Newcastle marine insurer opens New York office to cater for American market\nNewcastle marine insurer North P&I Club has revealed it has opened a new office in New York .\nThe global marine insurance firm is headquartered on Newcastle’s quayside and employs around 300 people. But the company has now opened its first base in New York to represent its interests across North America.\nThe New York office will be headed up by Ian Duthie, who has joined the club from insurance broker Marsh.\nThe office will work closely with existing underwriting, claims and loss prevention teams in Newcastle to develop relationships with brokers and shipowners across the Americas.\nPaul Jennings, chief executive officer of North P&I Club, emphasised the significance of the North American market to the Club.\nHe said:\nWe are delighted to welcome Ian to the Club. His wide ranging experience and expertise in the North American market will be a very strong addition to North’s global team and demonstrate our commitment to this important region. North P&I Club's offices on Newcastle's quayside (Image: Unknown) 8:45 Jonathon Manning Young people fear they will still be in debt at 40\nMore than one in three young people fear they will still be in debt by the time they are 40, a new study reveals.\nResearch by the Young Women’s Trust found that debt levels are getting worse.\nA survey of more than 4,000 young people by the charity found that one in five are in debt all the time, a quarter have worse debt levels now than last year and 36% do not think they will be out of debt any time soon.Young women are more likely to be in a difficult financial situation than men, with 40% struggling to make their cash last to the end of the month, compared to 29% of young men.\nYoung Women’s Trust chief executive Dr Carole Easton said:\nYoung women remain more likely to be out of work, on low pay or in insecure work, which makes it hard to make ends meet.\nIt’s therefore no wonder that they are more likely to be in debt and see little hope of escaping that in future.\nYoung Women’s Trust is asking the Government to give young women the right skills and support to find jobs, ensure decent and flexible jobs are available, and extend the National Living Wage to under-25s, so they are paid the same amount for the same work.\nA Government spokesman said:\nThe best way for people improve their finances is through employment and young people are entering the best jobs market in a decade.\nSince 2010, youth unemployment has fallen by over 45%, giving 130,000 more young people a job, and a future, and the proportion of young people unemployed and not in full-time education is now at a record low of 4.7%.\nAlongside this, the Government’s National Living Wage has helped to deliver the fastest earnings boost for the lowest paid in 20 years.\nAnyone concerned about their finances can contact the Money Advice Service for free, impartial advice. One in three young people believe they will still be in debt when they are 40 (Image: PA) 8:41", "external_links": ["http://reg-cms4.manchestereveningnews.co.uk:8080/live-center/lc/#/edit/event/15080040", "https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/15080040;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-08-28T10:30:00.000+03:00", "crawled": "2018-08-28T14:45:29.031+03:00", "highlightTitle": ""}