{"organizations": [], "uuid": "2f42c73f6f6d7dadefba1b90b029cbd6e07d8d08", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15055596.ece/ALTERNATES/s1200/0_Drought-Summit.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/farming/nfu-warns-dry-weather-needs-15055458", "country": "GB", "domain_rank": 21960, "title": "NFU warns that dry weather needs to be a factor in Government's new agriculture policy", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-08-21T15:29:00.000+03:00", "replies_count": 0, "uuid": "2f42c73f6f6d7dadefba1b90b029cbd6e07d8d08"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/farming/nfu-warns-dry-weather-needs-15055458", "ord_in_thread": 0, "title": "NFU warns that dry weather needs to be a factor in Government's new agriculture policy", "locations": [], "entities": {"persons": [], "locations": [{"name": "uk", "sentiment": "none"}], "organizations": [{"name": "nfu", "sentiment": "negative"}, {"name": "fodder bank", "sentiment": "none"}, {"name": "national farmers union", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business NFU warns that dry weather needs to be a factor in Government's new agriculture policy The NFU has sent a briefing to MPs stating that new policies need to include measures to combat market volatility Share Combine harvester at work in a field (Image: PA)\nThe National Farmers Union (NFU) is warning MPs that they must plan for volatile conditions such as the recent dry weather when devising the UK’s new agriculture policy.\nFollowing an extremely cold and wet winter, many regions experienced no rainfall between May and August, with other areas experiencing less than 5% of the average summer rainfall. Temperatures have also been high, exceeding 30C on some days.\nIn a briefing being circulated to MPs the NFU warned that the recent dry weather had created major problems for farmers across a number of sectors.\nThose with livestock have been forced to dip into their autumn and winter feed supplies after grass become scorched and burnt. The situation become so bad that the NFU has also been forced to relaunch its Fodder Bank to help members find feed and livestock bedding for their animals.\nIn the briefing the NFU said: “The extended period of dry weather has placed additional pressures on farmers. A lack of rainfall has meant poor grass growth for livestock and dairy farmers, and some arable farmers will have seen no recordable rainfall at a critical time for their crops. Read More How to avoid the North East falling behind in a two-speed England\n“In developing any new domestic agriculture policy, the Government must recognise the unique exposure to volatility and market failure faced by farmers.”\n“As we move towards a new domestic agricultural policy, it is vital that market failure and volatility are treated as seriously by the Government as delivering for the environment and improving productivity. The Agriculture Bill must include tools to help farmers manage volatility.”\nPost-Brexit, the Government has said it plans to replace EU subsidies with “public good” payments for a range of services, such as boosting access to the countryside or planting wildflowers.\nHowever, the NFU also said it was “extremely concerned” about the Rural Payments Agency (RPA), which is responsible for administering financial support to farmers.\nThe union said it was aware of farmers who had not received their payments from as far back as 2015, and called for the Government to accelerate its time lines for making these payments to its members as a “matter of urgency”. Read More Farm subsidies will be replaced by 'public good' payments after Brexit, Government says\nThe NFU added: “In addition to ensuring that farmers receive their 2018 payments in a timely manner, we are also asking for the RPA to plan for bridging payments as an option for those farmers who are unpaid by the end of December 2018.\n“We know that elsewhere in the EU authorities have already announced their intention to make advance payments or bridging loans because of the extreme weather.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-08-21T15:29:00.000+03:00", "crawled": "2018-08-21T17:08:46.004+03:00", "highlightTitle": ""}