{"organizations": [], "uuid": "59dd68f1a80527af487c407bdc5bc30378343623", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article1922932.ece/ALTERNATES/s1200/0_andrewmcgarryJPG.jpg", "site_section": "http://www.devonlive.com/rss.xml", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/devon-news/twitter-dispute-led-big-issue-1922852", "country": "US", "title": "Twitter dispute led to Big Issue vendor being banned from selling magazine", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-08-21T21:20:00.000+03:00", "replies_count": 0, "uuid": "59dd68f1a80527af487c407bdc5bc30378343623"}, "author": "Edward Oldfield", "url": "https://www.devonlive.com/news/devon-news/twitter-dispute-led-big-issue-1922852", "ord_in_thread": 0, "title": "Twitter dispute led to Big Issue vendor being banned from selling magazine", "locations": [], "entities": {"persons": [{"name": "andrew mcgarry", "sentiment": "none"}, {"name": "ben bradshaw", "sentiment": "none"}, {"name": "mcgarry", "sentiment": "none"}], "locations": [{"name": "exeter", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "exeter labour", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Twitter dispute led to Big Issue vendor being banned from selling magazine Andrew McGarry is now out of work after bosses took action over a Tweet Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nOne of Exeter’s best-known Big Issue vendors has been banned indefinitely from selling the magazine after a dispute with management over a Tweet.\nAndrew McGarry, 52, was suspended after he boycotted a publicity event when Exeter Labour MP Ben Bradshaw became a Big Issue seller for a day.\nThe magazine said his suspension was not related to the boycott, but was due to him breaking vendor rules.\nAfter a week off, Mr McGarry said he was told at a meeting on Monday that he is now banned from being a vendor for the magazine anywhere in the UK.\nIt emerged that the issue related to a tweet sent by him while he was suspended featuring a member of Big Issue staff who was later allegedly threatened. The tweet was removed by Twitter following a complaint.\nMr McGarry, who has been able to pay rent on a room using proceeds raised from selling the Big Issue, is now looking for another job.\nHe said he knew nothing about the incident involving the staff member until it was raised at the meeting. Read More Exeter being asked to support a People's Vote on the final Brexit deal\nMr McGarry has been a seller in the city for two years and raised money for the homeless. He has featured several times in the magazine, including when he was invited to Parliament to represent vendors. Big Issue seller Andrew McGarry, right, hands over a cheque for £150 to the Revd Christopher Durrant of St David's Church\nHe said: “I have been working for the Big Issue for years, I thought, they can’t take it away from me over one mistake.\n“It is going to make my life a living hell. My emotions are all over the place. I apologised to everyone involved, but it was obviously not good enough.”\nMr McGarry said he was called to a meeting at the Rum and Crab Shack in Exeter, where he was told that he would not be able to sell the magazine now or in the near future. Read More Pilot suffers 'life-changing injuries' in dramatic plane crash on Devon and Dorset border The fire forced Big Issue seller Andrew McGarry to move from his regular pitch on the edge of Cathedral Yard (Image: Rom Preston-Ellis)\nHe said the main reason given to him was that he tweeted a photograph of himself with a member of Big Issue staff, which allegedly put the person’s safety at risk and they were later threatened.\nMr McGarry said the incident with the Ben Bradshaw sell off event was also raised during the meeting, and said he was told that the magazine was unhappy with an article published by the Mail Online about his suspension.\nMr McGarry said the outcome of the suspension was given to him by Peter Bird, National Distribution Director of the magazine. Andrew McGarry after he was banned from selling the Big Issue in Exeter\nHe said he had spoken to Mr Bradshaw to apologise and explain his reasons. They had had a good conversation about homelessness issues.\nHe added that he had no problem with Mr Bradshaw, but boycotted the Big Issue PR event the MP was involved in to make a statement that there should be more people in the House of Commons addressing the issues around homelessness.\n\"I just wanted to to make a statement on behalf of all the homeless in the UK,” said Mr McGarry. Read More", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-08-21T21:20:00.000+03:00", "crawled": "2018-08-21T21:38:54.003+03:00", "highlightTitle": ""}