{"organizations": [], "uuid": "5a184f4646db5315363f384ace5ef3357168705d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.plymouthherald.co.uk/news/business/article1921957.ece/ALTERNATES/s1200/2_staples-changes.jpg", "site_section": "", "section_title": "", "url": "https://www.devonlive.com/news/business/whats-future-retail-parks-exeter-1935070", "country": "US", "title": "What's the future for retail parks in Exeter and Devon? - Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-08-26T03:00:00.000+03:00", "replies_count": 0, "uuid": "5a184f4646db5315363f384ace5ef3357168705d"}, "author": "Hannah Finch", "url": "https://www.devonlive.com/news/business/whats-future-retail-parks-exeter-1935070", "ord_in_thread": 0, "title": "What's the future for retail parks in Exeter and Devon? - Devon Live", "locations": [], "entities": {"persons": [{"name": "devon", "sentiment": "none"}, {"name": "marsh barton", "sentiment": "none"}], "locations": [{"name": "exeter", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "exeter retail park", "sentiment": "none"}], "organizations": [{"name": "office outlet", "sentiment": "none"}, {"name": "colliers international", "sentiment": "none"}, {"name": "homebase", "sentiment": "none"}, {"name": "mothercare", "sentiment": "none"}, {"name": "carphone warehouse", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News What's the future for retail parks in Exeter and Devon? Big name brands that have been a staple of retail parks have taken a battering this year - so what's the future for out-of-town shopping? Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nWith out-of-town stalwarts Office Outlet , Homebase and Mothercare all announcing store closures, what does that mean for the future of retail parks in Devon?\nIf Office Outlet, formerly known as Staples, decides to shut in Exeter, it will mean there will be three units out of nine left empty at Exeter Retail Park on the edge of Marsh Barton.\nAnd Carphone Warehouse , which has a store on the park, has announced plans to close outlets amid falling profits, though no specific locations have been confirmed. Exeter Retail Park\nBut despite the blank shop fronts, real estate experts at Colliers International say that retail parks are still holding their own.\nAnd we could see less electronics and white goods and more leisure activities like gyms and climbing walls, coffee shops and clothes shops instead.\nNick Turk, director covering out-of-town retail parks in the South West, said “Shoppers are not only looking for value for money nowadays. They are looking for value for time, and quality of experience in an environment that is enjoyable and not stressful.\n“Retail parks provide this through the convenience of plentiful free parking in landscaped settings featuring a combination of retail and food outlets.\n“If anything, retail parks have benefitted from online shopping because they are ideal for ‘Click and Collect’, and shoppers who visit them to pick up online purchases often combine the trip with shopping in stores for other items and may indulge in some discretionary spending to the benefit of the retailers on a park.”he said. Retail woes: the stores affected by the shopping crisis\nThe UK's retail sector is quaking as inflation and taxes mount and consumer spending slips. Plymouth is not immune. These are the firms that have caught a cold, or are beyond life support, so far in 2018:\nToys R Us - The advertising jingle sang of toys in their millions, all under one roof, but the huge outlet in Western Approach is now empty as the toy store chain became the first big casualty of the UK's retail meltdown. All Toys R Us stores nationwide are now closed or closing.\nBargain Booze - The off-licence chain Bargain Booze went into administration in April 2018 following a warning that earnings would be £5.2million less than expected. The chain, which has five outlets in Plymouth and another in Saltash, warned earnings for this financial year would be “below current market expectations”. But administrators were able offload the retail division to food wholesaler Bestway in a £7million deal.\nDebenhams - Beleaguered Debenhams could shut floors in its Plymouth department store as it looks at solutions to the retail meltdown which has seen its pre-tax profits slump by 84 per cent and insurers cut back on suppliers' credit cover. The chain is understood to be looking to downsize at least 30 stores blaming “profound change” in shopping habits for woes.\nHouse of Fraser - Troubled department store chain House of Fraser has announced it will shut 31 stores - including the flagship Plymouth branch in the city centre. When a Company Voluntary Agreement was accepted by creditors on June 22, 2018, it will meant 6,000 staff are set to lose their jobs due to the store closures which will leave just 18 outlets still trading. The company made a £43.9million loss in 2017 – blaming Brexit, terrorist attacks and increased online competition. Figures released as part of a takeover by the Chinese owner of Hamleys, showed the retailer's sales fell from £840.9million to £787.8million in 2017 – a drop of 6.3 per cent.\nNew Look - The budget retailer has had to weighs up “options” amid dismal sales figures and in April 2018 announced it could close 100 stores putting 1,500 jobs at ris. Private equity-owned Poundworld, which has a huge Plymouth store in New George Street, said it is considering its future as speculation mounts that it will opt to restructure the business.\nMarks & Spencer - Retail bellwether Marks & Spencer, which has a huge store in Plymouth city centre, is closing 100 of its biggest stores, about a third of all those selling clothes and homeware, by 2022 after it reported a 62.1 per cent fall in pre-tax profit to £66.8million in the year to March 31, 2018.\nMothercare - The baby and maternity products chain issued a profits warning after like-for-like sales fell by 7.2 per cent during the 12 weeks to December 30, 2017. Mothercare has now decided to move out of Drake Circus mall, but will relocate to a unit more than double the size at the under-construction Plymouth Gateway Retail Park at Marsh Mills. The retailer is looking to shut anything up to more than 50 stores and its March 2018 trading update revealed total UK sales were down 5.6 per cent in the 12 weeks to March 24, compared with the same period in 2017.\nCarpetright - Carpet and furniture giant Carpetright issued its second profit warning of 2018 and is entering talks with lenders. The firm, which has two huge Plymouth outlets, has warned it is set to disclose a full-year loss. In March 2018 it shut three Devon stores, but kept the two in Plymouth open.\nMaplin - Electrical goods retailer Maplin collapsed into administration in February 2018 putting jobs at risk. The company, which employed 2,500 people in the UK and had a large store in Plymouth’s Cornwall Street, said the capital needed to prop up the business – and shield it against tough trading conditions – had proved “impossible to raise”. The store had a huge closing down sale in April 2018 and finally shut in Plymouth in on June 11. All stores in the group are expected to be shut by July.\nPoundworld - The budget retailer went into administration in June 2018 after revealing dismal sales figures, putting 5,100 jobs at risk. Private equity-owned Poundworld shut its huge Plymouth store in New George Street in July 2018 after staging a \"closing down sale\".\nLaura Ashley - Womenswear and home furnishings retailer Laura Ashley is to close stores after seeing annual profits plummet to just £100,000. The group – which owns 160 stores across the UK including in Plymouth, Exeter, Barnstaple and Truro – saw statutory pre-tax profits fall from £6.3million a year earlier as retail like-for-like sales slid 0.4 per cent amid “difficult” trading conditions..\nH&M - Fashion giant H&M has said it is braced for further sales falls across its stores in 2018, including its Plymouth outlet in Drake Circus Shopping Centre.\nPoundstretcher - Credit insurers aretightening terms for suppliers to Poundstretcher, a move which is generally seen as an indicator of concerns a retailer is about to go bust. Poundstretcher, which has a huge outlet at Plymouth’s Friary Retail Park, in Exeter Street, saw a £3.4million profit turn into a £3.5million loss in 2017.\nMoss Bros - In March 2018 Moss Bros saw share values plunge 23 per cent after announcing profits for the 2017/18 financial year would be “materially lower” than expected. The clothing chain, which has a large outlet on New George Street, blamed stock shortages, tepid demand for suit hire and lower consumer confidence. But by May 2018 the chain was reporting improved trading though warned of a \"fragile consumer environment\".\nGame Digital - Profits at Game, which has two stores in Plymouth city centre, nosedived by more than a quarter – amid a tough market for consoles – leaving the retailer looking to revive its fortunes through the fast-rising e-sports sector.\nHomebase - There are fears Homebase stores throughout the South West could be dragged into a second wave of closures that could see up to 40 of the DIY outlets shut – putting hundreds of jobs at risk. The DIY chain, which has 21 outles in the West Country including Plymouth, is sounding out advisers for a potential Company Voluntary Agreement (CVA), having already closed 17 outlets.\nTopshop, Topman, Dorothy Perkins, Burton, Evans and Wallis - In May 2018 Sir Philip Green's Arcadia Group reported profits dipped by 42 per cent from £215.2million to £124.1million and sales fell 5.6 per cent in the year to August 26, 2017, sliding from £2.01billion to £1.91billion.\nSports Direct - Bargain tracksuit and trainer retailer Sports Direct blamed an £85million hit from its stake in Debenhams for dragging full-year profits down 72.5 per cent. The chain, which has a huge outlet in New George Street, Plymouth, said pre-tax profits plunged to £77.5million in the year to April 29, 2018 – from £281.6million a year earlier.\nMcColl's - Convenience store operator McColl’s has seen pre-tax profits nearly halve to £2.3 million in just six months during one of the “most challenging” period in the chain’s history. The firm, which has more than 10 outlets in the Plymouth area, saw its surplus drop from £4.5 million during the same period last year. The company blamed the decline, for the 26 weeks to May 27, 2018, in part on the collapse of wholesaler Palmer & Harvey, which disrupted its supply chain. It also impacted McColl’s like-for-like sales which fell 2.7 per cent in the first half of the year.\nSaltrock Surfwear - The Plymouth and Exeter branches of the fashion chain were among five that closed, with 29 staff losing their jobs, after the firm went into administration and was instantly taken over by the national Crew Clothing Co Group. Saltrock was started in the 1980s but taken over by Plymouth Argyle's departing chairman James Brent's company in 2012.\nThere is still massive interest for retail parks in Exeter. Read More The reasons why everyone suddenly wants to open retail parks in this part of Exeter\nFour retail park schemes have been proposed in and around Sowton in a bid to cash in on the population explosion brought by the new town of Cranbrook and the Exeter and East Devon Growth Point. Though one of those schemes has now been turned down . Where plans for the four retail parks at Sowton are located\nMr Turk said that vacancy rates on retail parks are at the lowest in nearly 20 years, with most empty units being filled quickly.\nHe said: ““A number of high-profile retailers have suffered major difficulties this year. It is worth bearing in mind, however, that the difficulties that some of these retailers faced resulted from fundamental problems, such as a failure to engage with ecommerce, the amassing of significant debts following purchases by private equity companies or poor management. The market for retail parks remains popular with shoppers despite the on-going threat of internet shopping.\"\nPart of the reason is because out-of-town shops are less about white goods and electronics and more about leisure, fashion and food. Alphington Park Exeter\nBut mid-market brands like Chiquito and Frankie and Benny’s on the Alphington Park have also taken a hit this year. Read More Restaurants pull out of prime slot alongside Exeter's new SECOND Nando's\nHowever, retail parks are attracting both overseas and UK investors because they offered attractive yields and returns, and are regarded as a safe investments in politically and economically uncertain times.\nMr Turk said: “The only real problem is that there is a lack of retail parks available to meet this demand from investors as well as the general perception that retailing is suffering from competition from the internet.\" Torbay Council's Wren Park retail centre (Image: Google)\nThat’s why Torbay Council bought Wren Park retail park in Torquay for a figure of around £20million in 2017 .\nSince then, it has also borrowed money to invest in a £31 million distribution depot in Kent, £27 million for a supermarket in Dorset, £21 million in commercial premises in Oxfordshire, and £17 million in offices in Devon.\nThe council hopes the investments will help plug its continuing funding gap, estimated to be £5.5 million in the 2109/20 financial year, and £5.4 million and £3.8 million in each of the following two years.\nAround 41% of South West shoppers said they found shopping at a large out-of-town shopping centre appealing, according to YouGov research, carried out as part of the Colliers International 2018 Midsummer Retail Report.\nBut online rivals who don’t currently have the same business rates and tax burden are eating into profits.\nNew figures from the Office for National Statistics (ONS) reveal spending online has reached a record high with nearly £1 in every £5 now being spent online.\nThe online shopping phenomenon has led calls from traditional bricks-and-mortar retailers for a tax on internet rivals and reforms of business rates to level the playing field.\nJohn Endacott, Head of Tax at PKF Francis Clark in Exeter said: “There are arguments in favour of an online transaction tax. The growth of online sales means higher recycling and refuse costs for local councils without a contribution from business rates. Delivery couriers used by online companies will also pay national insurance at lower rates than shop workers.” Like us on Facebook", "external_links": [], "published": "2018-08-26T03:00:00.000+03:00", "crawled": "2018-08-26T08:03:58.002+03:00", "highlightTitle": ""}