{"organizations": [], "uuid": "1aaa02275985e4da4e62f850afaf795a42f33354", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article1866589.ece/ALTERNATES/s1200/0_Walkers-Leicester_edit.png", "site_section": "", "section_title": "", "url": "https://www.leicestermercury.co.uk/news/leicester-news/advertising-van-circling-walkers-crisps-1866499", "country": "GB", "domain_rank": 48128, "title": "Advertising van circling Walkers Crisps factory calling on company to ditch plastic packets - Leicestershire Live", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-08-06T03:00:00.000+03:00", "replies_count": 0, "uuid": "1aaa02275985e4da4e62f850afaf795a42f33354"}, "author": "Dan Martin", "url": "https://www.leicestermercury.co.uk/news/leicester-news/advertising-van-circling-walkers-crisps-1866499", "ord_in_thread": 0, "title": "Advertising van circling Walkers Crisps factory calling on company to ditch plastic packets - Leicestershire Live", "locations": [], "entities": {"persons": [{"name": "gerard batten", "sentiment": "none"}], "locations": [{"name": "beaumont leys", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}], "organizations": [{"name": "leicestershire live advertising", "sentiment": "negative"}, {"name": "walkers crisps", "sentiment": "negative"}, {"name": "walkers walkers", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}, {"name": "walkers crisps factory", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Advertising van circling Walkers Crisps factory calling on company to ditch plastic packets The firm's 2025 target for 100 per cent recyclable packaging has been called 'woefully inadequate' Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nAn advertising van is circling the Walkers Crisps Factory in Leicester today as part of a bid to get the firm to stop using plastic packets.\nCampaign group 38 Degrees has organised for the vehicle to display a large poster at the Beaumont Leys plant after nearly 300,000 signed an online petition urging the company to switch to using a more environmentally friendly type of packaging.\nIt hopes to reduce the amount of plastic litter on the UK’s streets. The 38 Degrees advertising van outside Walkers\nWalkers has committed to making all of its packets biodegradable, recyclable or compostable by 2025 but 38 Degrees says that timescale is ‘woefully inadequate.' Read More UKIP leader Gerard Batten wants people to boycott Walkers Crisps after Gary Lineker Brexit row\nThe organisation has accused the business – the biggest crisp manufacturer in the country – of not playing its part in tackling the problem quickly enough. The campaigners claim Walkers produce more than 7,000 crisp packets a minute and have calculated it will produce an additional 28 billion plastic crisp packets by 2025 adding to the waste and pollution. (Image: Peter Fothergill) The petition , started by Geraint Ashcroft from Cardiff, asks Walkers to stop using plastic packaging in their crisp packets.\nMr Ashcroft and campaigners from 38 Degrees will meet senior executives at Pepsico, the parent company of Walkers, tomorrow to demand they do more to reduce plastic waste. poll loading Should Walkers be doing more to reduce the plastic it uses? 0+ VOTES SO FAR Yes, it's contributing to a massive problem No, it's made a promise so let it keep it 38 Degrees campaign manager 38 Degrees Laura Greenwood said:\n“Our members chipped in to pay for this mobile billboard because they want to send a message to Walkers' bosses, telling them to ditch the plastic in their packaging.\n“There’s huge public concern about the amount of plastic being produced, and that means it’s crunch time for Walkers to decide if they will listen to their customers.\n“Their promise to deal with plastic crisp packets by 2025 is woefully inadequate. “By that time, they will have produced a breathtaking amount of plastic waste without paying a penny to clean it up. Walkers now need to listen to the great British public and ditch their plastic packaging now, instead of in seven years time.” Read More ", "external_links": [], "published": "2018-08-06T03:00:00.000+03:00", "crawled": "2018-08-06T17:32:35.043+03:00", "highlightTitle": ""}