{"organizations": [], "uuid": "da4d35abc5205fc47703c60f407978da61b8e21c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1877565.ece/ALTERNATES/s1200/0_europe-2069495_1280.jpg", "site_section": "", "section_title": "", "url": "https://www.devonlive.com/news/devon-news/most-south-west-voters-want-1877566", "country": "US", "title": "Most South West voters want second Brexit referendum - Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-08-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "da4d35abc5205fc47703c60f407978da61b8e21c"}, "author": "Neil Shaw", "url": "https://www.devonlive.com/news/devon-news/most-south-west-voters-want-1877566", "ord_in_thread": 0, "title": "Most South West voters want second Brexit referendum - Devon Live", "locations": [], "entities": {"persons": [{"name": "yougov", "sentiment": "none"}], "locations": [{"name": "devon live most south west", "sentiment": "none"}, {"name": "bristol", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "digital", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Most South West voters want second Brexit referendum A poll suggests a second vote in the region would vote remain instead of leave Share Neil Shaw Head of Digital, live and trending for PlymouthLive, DevonLive and CornwallLive 07:19, 9 AUG 2018\nVoters in the South West of England back a second referendum on the Brexit deal by a margin of 42% to 35%, according to a new poll.\nThe poll, for the People's Vote campaign, was released ahead of a day of action by the group across the region on Saturday, culminating in a rally in Bristol.\nAlthough the South West backed Leave in the 2016 referendum, the YouGov poll suggested voters have now switched to backing continued EU membership by a margin of 51% to 49%.\nSupport for a second referendum rises if the Government fails to secure a Brexit deal with the EU, with 47% backing a public vote in those circumstances and just 27% opposing. Read More Brexit could cost Plymouth and Exeter Universities millions in research funding\nThe People's Vote released a dossier claiming that the South West's economy is expected to shrink by 2% over the next 12 years if Brexit goes ahead, leaving each resident an average of £461 a year worse-off.\nMore than £700 million of EU funding for South West businesses and projects is at risk from Brexit, while products like the Cornish pasty, clotted cream and West Country cider could lose their protected status, said the group. poll loading Would you vote leave or remain in a second poll? 500+ VOTES SO FAR Leave Remain\nPeople's Vote organisers said they expected thousands to attend Saturday's rally to hear speakers including Conservative MP Sarah Wollaston, Liberal Democrat leader Sir Vince Cable, Labour's Stephen Doughty and Green Party MEP Molly Scott-Cato. Read More One place has been Googling Brexit more than anywhere else - and it's in Devon\nFormer YouGov president Peter Kellner said: \"This poll is the first significant test of public opinion in the South West on Brexit since the referendum and shows that attitudes are beginning to shift.\n\"Voters in the South West support a People's Vote on any final Brexit deal negotiated by the Government by a clear margin which rises much higher with the prospect of leaving the EU without any deal.\"\nAnd Labour's Exeter MP Ben Bradshaw highlighted findings that the party's voters in the region back EU membership by 76% to 24% and a second referendum by a margin of four to one. Read More Cheese and onion crisp shortage thanks to weather and Brexit\n\"My own party is in danger of letting down its voters and young people in particular,\" said Mr Bradshaw.\n\"I urge my colleagues who do not yet support a People's Vote to study this poll and ask themselves whether they came into politics to stand against the views of our supporters or do they want to join us in the South West in demanding our democratic voice is heard on Brexit?\"\n- YouGov questioned 1,012 adults in the South West between July 31 and August 7. Like us on Facebook", "external_links": [], "published": "2018-08-09T03:00:00.000+03:00", "crawled": "2018-08-09T09:27:55.010+03:00", "highlightTitle": ""}