{"organizations": [], "uuid": "e8a9d7e07d130287894d1a4228216d989598bae1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1923964.ece/ALTERNATES/s1200/3_staples-changes.jpg", "site_section": "http://www.westernmorningnews.co.uk/editorschoices.rss", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/devon-news/stationery-chain-close-branches-ask-1923967", "country": "GB", "title": "Stationery chain to close branches and ask for three year break on rent", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-08-22T08:50:00.000+03:00", "replies_count": 0, "uuid": "e8a9d7e07d130287894d1a4228216d989598bae1"}, "author": "Neil Shaw", "url": "https://www.devonlive.com/news/devon-news/stationery-chain-close-branches-ask-1923967", "ord_in_thread": 0, "title": "Stationery chain to close branches and ask for three year break on rent", "locations": [], "entities": {"persons": [{"name": "deloitte", "sentiment": "none"}], "locations": [{"name": "truro", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}], "organizations": [{"name": "hilco", "sentiment": "none"}, {"name": "office outlet", "sentiment": "none"}, {"name": "spencer office outlet", "sentiment": "none"}, {"name": "torquay", "sentiment": "none"}, {"name": "company voluntary arrangement", "sentiment": "none"}, {"name": "cornwall share neil shaw head of digital", "sentiment": "none"}, {"name": "cva", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Stationery chain to close branches and ask for three year break on rent The chain has four branches in Devon and Cornwall Share Neil Shaw Head of Digital, live and trending for PlymouthLive, DevonLive and CornwallLive 06:50, 22 AUG 2018 Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nThe stationery and office goods chain formerly known as Staples has announced plans to close branches and ask landlords to let it off paying rent for the next three years.\nOffice Outlet, which has branches in Plymouth, Exeter, Truro and Torquay will unveil a planned Company Voluntary Arrangement this week which will see it close some of its 96 branches and shrink others.\nThe move will mean the loss of around 50 jobs and will see the chain ask landlords to let it off paying rent at 20 branches.\nReducing rent is likely to also mean cutting the size of stores so landlords can rent to pother tenants. Read More Marks & Spencer\nOffice Outlet was bought as Staples by Hilco in 2016. Deloitte will now act as an advisor through the CVA process.\nThe CVA route is the same one already taken this year by Carpetright, Homebase, Mothercare, New Look and Prezzo. House of Fraser was set to launch a CVA before it was bought.\nChris Yates, Office Outlet’s chief executive, said: “Given the challenging UK retail environment and our over-spaced and over-rented UK store estate, we are having to take tough but necessary actions to reduce our fixed cost base and restore long-term profitability.\n“We have held constructive discussions with our key landlords and strategic partners and will now seek creditor approval on our CVA proposal. Read More Plymouth's and Exeter's Saltrock stores shut as Argyle supremo James Brent sells floundering chain\n“This will provide greater security for our staff, suppliers, landlords, customers and members.\n“This is a successful brand and we are confident the company will emerge in excellent shape from this process.”\nDaniel Butters, partner at Deloitte, said: “The retail trading environment in the UK remains extremely challenging, driven by weaker consumer confidence, the implications of Brexit and competition from online channels.\n“The CVA will provide a stable platform upon which management’s turnaround plan can be delivered.” Read More Full list of 42 Homebase store closures REVEALED What is a Company Voluntary Arrangement\nFinance.co.uk says A CVA or Company Voluntary Arrangement is a common business recovery procedure for insolvent companies. This particular insolvency procedure enables a company that has debt problems or that has become insolvent to come to a voluntary agreement with its business creditors to structure the repayment of all or some of its financial debts over a stipulated length of time. How Do CVAs Work?\nThe first part of a CVA is the approval process, which normally takes about 28 days, but in some cases can be up to three months.\nThe approval process begins with the creditors being asked to take a vote whether or not they wish to accept the proposal. This usually takes place at a special Creditors’ Meeting, although most votes are cast by proxy instead of the creditors being there in person. Seventy-five percent of unsecured creditors by value who vote must agree to it, as well as fifty percent of non-associated creditors, prior to any CVA being made binding. As a major creditor in the company insolvency, the insolvency practitioner must also approve the procedure. Read More Convenience store chain McColl's is latest dragged into retail crisis\nWhen the CVA is approved, the company will make a monthly payment from the continuing trade profits. A company also has the option of selling some of it’s assets to make these monthly payments. Under the purview of the appointed insolvency practitioner, the payments are then distributed to all the creditors, either on a monthly basis or as a lump sum. How a CVA Help You Manage Your Debt?\nBusiness debt advice commonly recommends CVAs for a variety of reasons. First, debt deferral reduces cash flow pressure so that your business is not overwhelmed by growing, unsustainable debt. It also offers a far more realistic repayment structure than other debt management programs so that you pay what the company can manage without straining its finances more than they already are. Read More Debenhams drags Sports Direct into retail meltdown\nCreditors are also more likely to prefer a CVA because it offers them a much better option for recouping costs than flat out business closure or liquidation of assets. Another way this helps you manage your debt is freezing all of them so that there is no additional interest accumulating like it would normally. And at the end of the term of the CVA, the remainder of debt that hasn’t been repaid is written off. What are the Pros and Cons of a CVA?\nThere are very many advantages to the Company Voluntary Advantage. The first advantage is that it’s a very flexible business recovery procedure, while still being formal and legally binding. It’s not indefinite, and it has a pre-defined agreed on timescale so that you have a clear path ahead. The business can continue its day to day operations and trade without having to change ownership, management, or lose its workforce. It costs far less than options like structured administration and liquidation. There is rarely any need to buy back or dispose of assets. The reduced strain of incoming cash flow and realistic payment timelines keeps unduly stress off the company.\nThe primary legal advantage is that it provides court protection to the business and places a moratorium on creditors raising further legal action. CVAs also offer the chance to reform and restructure the business — usually by removing unprofitable areas — while remaining under management’s control with very little intervention, if any. Read More Plymouth's Toys R Us bought by council as part of £30.5m sell-off\nThe main incentive for a company to choose to go down the Company Voluntary Arrangement channel is that it has a much greater prospect of salvaging the company. This has the dual benefit of saving jobs and also returning value to creditors and shareholders alike.\nThe only foreseeable disadvantages are the potential for possible liability and the chance that the entire procedure could take a very long time to be complete, which may not be desirable if you want to just abandon the company. Additionally, an insolvency practitioner could decline a Company Voluntary Arrangement if there has been a history of poor payment or lack of compliance. You Should Know…\nWhile a Company Voluntary Arrangement certainly creates a firm platform for rescuing a business in distress, it is immensely important to act as soon as possible. It is also important to note that all businesses and situations are different, and for individual cases it is always best to consult a business debt advice professional. Like us on Facebook ", "external_links": ["https://www.finance.co.uk/cva-company-voluntary-arrangements/", "https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-08-22T08:50:00.000+03:00", "crawled": "2018-08-22T10:01:16.028+03:00", "highlightTitle": ""}