{"organizations": [], "uuid": "594471288280b6753d9ae559c09bb6acf56a5ed2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article1899118.ece/ALTERNATES/s1200/0_HinkleyJPG.jpg", "site_section": "", "section_title": "", "url": "https://www.devonlive.com/news/devon-news/how-leps-catalyst-creating-means-1899124", "country": "US", "title": "How LEPs are catalyst in creating means for regional prosperity - Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-08-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "594471288280b6753d9ae559c09bb6acf56a5ed2"}, "author": "Guy Henderson", "url": "https://www.devonlive.com/news/devon-news/how-leps-catalyst-creating-means-1899124", "ord_in_thread": 0, "title": "How LEPs are catalyst in creating means for regional prosperity - Devon Live", "locations": [], "entities": {"persons": [{"name": "leps", "sentiment": "none"}], "locations": [{"name": "devon", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}, {"name": "somerset", "sentiment": "none"}], "organizations": [{"name": "hinkley point c", "sentiment": "none"}, {"name": "lep", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News How LEPs are catalyst in creating means for regional prosperity LEPs were set up to provide the infrastructure needed for the economy to begin recovering after the 2008 crash. Share Get Daily updates directly to your inbox Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nIF YOU asked 100 people what a local enterprise partnership (LEP) is, the chances are that only a handful would be able to tell you what it does.\nAnd yet if you work in the Westcountry, or drive around it, there are few major infrastructure projects which have not benefited from LEP funding in the past few years.\nLEPs were set up by the coalition government in 2011 as a replacement for regional development agencies, providing the infrastructure needed for the economy to begin recovering after the 2008 crash.\nNow the Heart of the South West LEP – which covers Somerset, Devon, Plymouth and Torbay – has a new chief executive who will be ensuring that Hinkley Point C, improvements to the rail network and upgrades to the M5 remain on track and benefit local residents. Read More Make it an awards night to remember\nDavid Ralph joins the LEP after five years at the D2N2 LEP, which covers Derbyshire and Nottinghamshire in the East Midlands.\nWe sat down with him at Cannington Court, a Grade I-listed 12th-century building which EDF is currently using as a residential training centre for Hinkley Point C.\nSo what exactly is the point of the LEP?\nHe said: “We’re fundamentally about raising prosperity in the area – so we are actively working on building the economy, and putting more money into people’s pockets through wages.\n“We want to improve skills, we want to improve the quality of the infrastructure, both broadband and transport. We will look to work with business to support them.”\nLEPs get their majority of their funding from the Government or the European Union – and they’ll still be able to spend the latter’s funding until the Brexit transition period is over.\nThe vast majority of what the LEP spends is capital funding – projects which are designed to deliver specific pieces of infrastructure, such as new roads, flood defences or helping to bring employment sites into operation.\nThe Heart of the South West LEP has an annual capital budget of £750 million.\nAll of which poses the question – why do we need another layer of government to distribute taxpayers’ money? Wouldn’t it be easier for the money to come either directly from the treasury or to be given to local councils? Read More It's a unanimous 'Yes' for new Brixham fishing jetty\nMr Ralph says the LEP was vital in “generating an economic plan” for areas under its umbrella, carrying on from where the regional development agencies had left off.\nHe added: “I think the real added value of LEPs is that they involve both the public and the private sector in developing solutions.\n“It’s the private sector who create the wealth. There are 78,000 businesses in Devon and Somerset, and the more they can engage in the solutions, the more likely we are of spending that money well.\n“We’re certainly not flinging money at things – one of my jobs is to really demonstrate a return on that investment.\n“A real focus is around making that we get value for money, and trying to make sure we deliver the right kinds of projects. We’re interested in projects that will transform the economy, and also once which will build steady growth.”\nThe LEP’s work covers a multitude of different areas, with Exeter seeing a significant focus on housing as opposed to Somerset’s growing nuclear presence.\nMr Ralph said the LEP’s nature was a recognition that some fundamental issues, such as transport and housing, “don’t stop at a county boundary”.\nHe said: “We certainly don’t advocate growth for growth’s sake – we’re very strong about prosperity for all. Read More Torbay Council in serious financial trouble and airshow could be scrapped\n“There is a massive housing shortage in this area, but our priority would be affordable housing. There is significant growth in housing and that will continue over the next 20 or 30 years.\n“One of the real problems about housing is that people are promised infrastructure and it never really arrives, so the congestion increases and people get frustrated by that.\n“In proper place-making, you’re looking to use technology, you’re looking to get the investment and infrastructure before the housing comes – and actually with our agreed strategic economic plan, we can start to plan a bit more effectively as an area about that challenge.”\nThe LEP has no say over where sites are designated for homes or business use – though it can offer comments in an informal manner to ensure that district and borough councils’ ambitions meet the needs of residents.\nThe organisation comes in when it comes to ensuring infrastructure comes on line when a new housing development or business park, for instance, are given the go-ahead.\nMr Ralph explained: “We have a pipeline of capital projects which relate to where the growth is going to take place, and we look to prioritise those.\n“We are trying to put the infrastructure in ahead of the housing or employment provision, so that we do reduce congestion and take that forward.”\nMr Ralph said the LEP would “always try to maximise the contribution from the private sector”, drawing down developer contributions so that public money could be used more efficiently.\nHe elaborated: “Largely we’ve focused on some of the employment sites and enterprise zones that could be an important contributor to the local economy.\n“We’ve done quite a lot of work with Hinkley Point around supporting skills provision and other areas of the supply chain, so that we’re maximising the economic asset which Hinkley clearly is.”\nLooking ahead, Mr Ralph said he wanted to ensure the Westcountry had the means to retain talent, rather than losing it in a brain drain to other parts of the UK.\nHe said: “We’ve set a really big ambition about doubling the size of the economy in this area over the next 30 years.\n“We want to see talented people start their own businesses on key sectors. It’s a great quality of life here – why wouldn’t you want to stay here if the work was available?” Like us on Facebook", "external_links": [], "published": "2018-08-15T03:00:00.000+03:00", "crawled": "2018-08-15T12:55:16.004+03:00", "highlightTitle": ""}