{"organizations": [], "uuid": "3791dadbc49c38da14887fbbf134e5fca1c91935", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14962580.ece/ALTERNATES/s1200/2_DMR_NEC_050516castle_10.jpg", "site_section": "http://www.thejournal.co.uk/business/?service=rss", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15035549", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast RECAP: Rail boss calls for 'fundamental overhaul' of the Britain's railway", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-08-16T10:00:00.000+03:00", "replies_count": 0, "uuid": "3791dadbc49c38da14887fbbf134e5fca1c91935"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15035549", "ord_in_thread": 0, "title": "Business Breakfast RECAP: Rail boss calls for 'fundamental overhaul' of the Britain's railway", "locations": [], "entities": {"persons": [{"name": "jonathon manning newcastle", "sentiment": "negative"}, {"name": "kieran dougan", "sentiment": "none"}, {"name": "dan young", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "kola", "sentiment": "none"}, {"name": "jesmond", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning Newcastle entrepreneurs launch new cola drink to tap into 'craft soda' market\nTwo lifelong friends who quit their careers to launch their own venture are now bottling success with a new drinks company .\nUntil the start of this year Dan Young was a marketing manager and Kieran Dougan was a chemical engineer, yet the two left their jobs to launch 40 Kola, an all-natural caffeine-infused version of a classic cola that they hope will take the growing ‘craft soda’ market by storm.\nThe pair, both 26, concocted their product in a kitchen in Jesmond after seeing the explosion in the US of the premium soda market.\nCraft soda’s market share is on the rise as growing numbers of consumers chose organic, local products for ethical reasons, shunning traditional fizzy drinks which can have higher sugar content and lengthy ingredient lists.\n40 Kola has been crafted from 11 all-natural ingredients and has a tangy, fruity taste and contains 40mg of caffeine – the equivalent of a double espresso.\nThe caffeine in the soft drink comes from the decaffeination process of decaf coffee beans, while the malt extract that gives its dark colouring is a bi-product of brewing processes. Once it’s made it is bottled in fully recyclable glass bottles.\nHaving only launched in March, the drink is already winning fans across the North East, with the likes of Gateshead’s Block & Bottle , Newcastle’s Mmm… and Glug…, By The River Brew Co and Ouseburn’s Arch2 all stocking the cola. The caffeine-infused cola drink Kola 40 (Image: Kola 40) 9:13 KEY EVENT Amazon mulls UK insurance comparison site\nReuters is reporting that Amazon is speaking to UK insurance firms to discuss whether they would contribute products to a new UK comparison site.\nReuters claims three industry executives told its reports that they had held talks with Amazon about launching the site.\nIt is unknown what insurance products Amazon intends to sell but the company could cause major disruption in the market. The Amazon logo (Image: Getty Images North America) 9:05 Petards Group wins £2.7m contract\nSoftware developer Petards Group has one a major contract with Bombardier Transportation.\nThe group will provide its eyeTrain software to the firm in a new contract worth more than £2.7m.\nThe deal has been signed as part of work to modify 35 West Midlands Trains. The trains will be modified to have Petards Automatic Selective Door Opening system “ASDO”, Driver Controlled Operation CCTV “DCO CCTV” and Automatic Passenger Counting “APC” systems installed.\nPetards is beginning engineering work on the products immediately and expects to deliver its first product in January 2019.\nPetards chairman Raschid Abdullah said:\nWe are delighted that Petards has been selected by Bombardier to work with them on this exciting project and supply our innovative ASDO, DCO CCTV and APC systems.\nThis new order adds to our already significant installed base and strengthens our position as the leader of on-train video and data solutions. Additionally it further bolsters the Group’s present order book for delivery in 2019 through to 2020. Petards' eyeTrain systems are to be installed in on Bombardier trains (Image: PA) 8:57 Jonathon Manning Sturgeon to address fishing industry summit on Brexit\nNicola Sturgeon will address a summit on the Brexit impact on Scotland’s fishing and seafood sector.The roundtable discussion in Edinburgh will include representatives from the fishing, processing and acquaculture industry as well as environmentalists, port authorities and people from the food and drink sector.\nConcerns about how Brexit will affect seafood exports will be on the agenda, as well as mitigation measures, and the future of fisheries management in Scotland.Rural Economy Secretary Fergus Ewing, who is also attending, said in advance of the summit:\nThe Scottish seafood sector has gone from strength to strength in recent years and is an important part of our economy - but the UK Government’s lack of clarity on how the industry will be affected by Brexit is putting the livelihoods of workers and communities at risk.\nWith seafood exports to the EU worth £725 million last year, the industry needs an assurance that it can continue to easily access EU markets.\nHe said the Brexit negotiations needs to address fears over increased trade barriers, customs delays, EU labour and funding, stressing the Scottish Government position that continuing membership of the customs union and single market would be the “least damaging” Brexit.Mr Ewing added:\nHowever, in the absence of any realistic UK Government position, this summit is an opportunity to hear the seafood sector’s concerns so we can push for more clarity - this will also help us shape our national discussions around the future of fisheries management in Scotland. First Minister Nicola Sturgeon (Image: Handout) 8:52 KEY EVENT County Durham scrapyard must be sold, orders competition watchdog\nThe country’s biggest scrap metal business has been ordered to sell one of its recycling yards in County Durham , after the competition watchdog found a previous deal could harm the automotive industry.\nEuropean Metal Recycling (EMR) has been told it must sell its yard at Seaham Harbour along with four other sites that the business acquired from Metal & Waste Recycling (MWR) last year.\nFollowing a six-month investigation, the Competition and Markets Authority found that the merger between EMR and MWR would lead to a “substantial lessening of competition”. EMR is the largest recycler of scrap metal in the UK, while MWR is the fourth largest.\nThe CMA found that the merger would have harmed car manufacturers in the North East and North West, which sell large volumes of scrap metal through tendered contracts.\nLesley Ainsworth, who led the inquiry at the CMA, said:\nHaving an efficient and competitive metal recycling industry is good for the environment and is important for both suppliers and waste metal customers, including those in the automotive and steel manufacturing industries.\nOver the course of our inquiry we surveyed, spoke to, or received comments from over 850 suppliers and customers. The evidence shows that EMR’s purchase of MWR is likely to harm competition in a number of areas and there is a material risk that prices for some suppliers and customers could worsen.\nTo ensure competition is maintained, we are requiring EMR to sell off some of the sites that it bought from MWR. Cars at a scrap yard (Image: Getty Images Europe) 8:45 Jonathon Manning Royal London books higher profits despite sluggish economic growth\nMutual life and pensions firm Royal London has reported a 9% rise in pre-tax profits, but it blamed sluggish economic growth and the end of the auto enrolment roll-out for tough conditions in the first half of the year.The business struggled to boost its life and pension sales, which fell by £1m to just over £6.077bn, over the six months to June 30.It said a rise in new business sales in personal pension and life assurance helped offset the drop in group pension sales as the auto enrolment launch started to come to a close.But the firm still gained 86,000 new entrants to its group pension schemes over the first half of the year.Royal London said it logged a 9% jump in pre-tax profits to £358m over the period, despite tough comparatives a year earlier when the company benefited from a one-off £30m boost after restructuring a reinsurance agreement.Funds under management rose £3bn to £117bn over the period.Royal London chief executive Phil Loney said:\nSluggish economic growth and the ending of the auto enrolment roll-out provided a challenging backdrop for pensions and investment companies in the first half of 2018. Money (Image: Chris Radburn/PA Wire) 8:37 Jonathon Manning Newcastle firm Tea Tang aims to improve people's mental wellbeing by brewing tea\nA new business has been launched in Newcastle that aims to improve people’s emotional wellbeing by teaching them to how to brew tea .\nLi Tang has set up Tea Tang to teach people how brewing traditional tea in the correct way can help them relief stress.\nTea Tang offers a range of services such as Tea tasting classes and sessions on how to correctly carry out a tea ceremony. Ms Tang believes that performing the ceremony can help people relax and improve their mental health.\nMs Tang said:\nI started my tea studio four months ago. We are looking to provide a new healthy life style.“Our programme is more focused on mental and emotional wellbeing, and we would like to promote it through our tea practices.\nAs well as the course, we provide a tea tasting session for beginners. They brew it, drink it, and taste it, to learn about the tea soup. It is a first impression to let them know about it.\nWe also carry out the rituals of the tea ceremony. That way that people can practice themselves.\nMs Tang believes that the process of learning how to carefully brew and prepare tea can help people improve their own self discipline and care. Li Tang runs classes that teach people how to correctly prepare tea (Image: Facebook) 8:30 KEY EVENT Filtronic sees turnover fall but celebrates steady operating profit\nNorth East tech firm Filtronic saw its turnover fall by £13.4m over the last 12 months, but the company has said it is happy its operating profits have remained steady.\nThe firm, which makes high frequency transmitters, has won a number of major contracts with clients in the defence sector over the last year. But its contract wins were not enough to stop turnover falling from £35.4m to £24m for the year ending May 2018.\nOperating profit at the firm saw a minor uplift from £1.7m to £1.8m. However, profit after tax fell from £3.1m to £1.2m.\nReg Gott, chairman, said:\nWe are pleased with the progress we have made along our strategic pathway and our focus on higher margin products and applications has further improved operating profitability over the past year. Our substantial investment in new products and technologies over the past two years has started to deliver on our objectives of broadening our customer base and expanding our product range. This remains a key strategic objective.\nWe are gaining increasing market recognition for our expertise in network access and mmWave engineering and we believe this positions us very well to take advantage of the huge opportunities that exist in the future development of 5G networks. Massive MIMO antennas utilise techniques that will be a key enabler of 5G and our recent contract win to engineer and supply these antennas to a major global OEM demonstrates our capability and credibility to take advantage of these opportunities as they arise. Filtronic's site at Newton Aycliffe 8:25 KEY EVENT Gateshead firm that gives staff December off tops UK rankings for work-life balance\nA Tyneside company which aims to give its staff all of December off has been named the UK’s top company for work-life balance .\nResearch by jobs site Glassdoor found that Gateshead energy management consultancy Northern Gas and Power was the highest-rated firm for work-life balance, based on feedback from staff working at more than 60,000 companies around the country.\nNorthern Gas and Power - which sponsored The Journal’s Best Places to Work awards earlier this year - sets an annual target that is divided into 11 equal amounts so that staff get December off if the figure has been hit by the end of November.\nIt also offers perks such as trips to Majorca and working in overseas offices to encourage staff.\nThe company had the UK’s highest rating from staff for work-life balance, with one employee saying:\nWorking at NGP has given me the opportunity to begin a fantastic career in a discipline I’m really passionate about.\nIn addition to giving me a high level of autonomy and a good level of mentoring, they also allow me the chance to grow and progress in my role.\nAmong other highly-rated companies that Northern Gas and Power beat in the survey were Capital One, the Bank of England, Purplebricks and Thomson Reuters.\nThe Glassdoor survey highlights the importance of offering a good work-life balance in recruiting and retaining staff.\nWhen asked what would make people more likely to apply for a job at a company, nearly half of UK workers/job seekers (48%) cited a convenient commute followed closely by offering a good work-life balance (47%). Northern Gas and Power team (Image: publicity pic) 8:20 Jonathon Manning B&Q's sales bounce back after poor weather stunted growth\nB&Q’s sales have bounced back after taking a hit due to torrid weather at the start of the year, but the DIY chain’s parent company has been held back by poor performance in France.B&Q owner Kingfisher has posted group sales of £3.26bn for the second quarter, representing like-for-like sales growth of 1.6%.Like-for-like sales were up by 4.2% across the UK and Ireland, but fell by 1% in France.Despite the company facing a “weak UK consumer backdrop”, B&Q’s sales rose 3.6%, while Screwfix’s sales climbed by 5.5%.DIY store Castorama was the drag on sales in France, with like-for-like sales dropping by 3.8% over the period.Kingfisher pinned the results in France on weaker footfall and the impact of a transformation plan under way in Castorama.Chief executive Veronique Laury said:\nWe started our transformation two-and-a-half years ago and are on track to deliver our strategic milestones for the third year in a row.\nIn the second quarter, I’m pleased that we grew our sales after the exceptionally harsh weather conditions in the first quarter.\nShe said Kingfisher was bringing forward new plans to help its results in France during the second half of the year.The results in the UK are a sharp turnaround from the first quarter, when the Beast from the East knocked B&Q’s revenues by 8.8%.The DIY chain recently announced that it was investing £100 million as part of plans to lower its prices.It has been cutting back on its promotional activity and is offering lower, everyday prices to its customers instead.B&Q’s sales bump comes shortly after rival Homebase announced plans to close 42 of its stores, with the likely loss of 1,500 jobs. B&Q Hermiston Retail Park, Consett (Image: newcastle chronicle) 8:15", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/15035549;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-08-16T10:00:00.000+03:00", "crawled": "2018-08-16T19:24:51.004+03:00", "highlightTitle": ""}