{"organizations": [], "uuid": "ffac9405ea01296a7832749a792e686f0cea1da7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14944571.ece/ALTERNATES/s1200/0_The-Kings-Fund-nursing-report.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/brexit-could-damage-access-nhs-15056255", "country": "GB", "domain_rank": 21960, "title": "Brexit could damage access to NHS services 'for decades to come'", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-08-21T18:00:00.000+03:00", "replies_count": 0, "uuid": "ffac9405ea01296a7832749a792e686f0cea1da7"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/brexit-could-damage-access-nhs-15056255", "ord_in_thread": 0, "title": "Brexit could damage access to NHS services 'for decades to come'", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "negative"}, {"name": "catherine mckinnell", "sentiment": "none"}, {"name": "chris hopson", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}], "organizations": [{"name": "nhs", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "newcastle north", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "nhs providers", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Brexit could damage access to NHS services 'for decades to come' Concern about threat of 'no-deal' Brexit as negotiations continue in run-up to leaving date Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox Subscribe Thank you for subscribing!\nA North East MP claims Brexit could damage the NHS “for generations to come” after hospitals warned they could run out of drugs.\nCatherine McKinnell, Labour MP for Newcastle North, said: “With very little time to spare, the Government still has its head in the sand and is woefully unprepared when it comes to the reality of Brexit.”\nNHS Providers, the group that represents NHS hospitals and ambulance services, said poor co-ordination by ministers and health service bosses meant the UK had failed to prepare for a no-deal Brexit.\nIn a leaked letter, NHS Providers chief executive Chris Hopson also warned that a “hard Brexit”, in which the UK leaves with some sort of deal but doesn’t take part in the EU’s trading institutions, would damage public health. Public sector staff are set for a pay rise (Image: PA)\nHe said: “From day one after the UK leaves the EU, the entire supply chain of pharmaceuticals could be adversely affected in the event of a no deal or hard Brexit.\n“Public health and disease control coordination could also suffer, and our efforts to reassure, retain and attract the European workforce on which the NHS relies could also be jeopardised.”\nAnd he warned: “The risk to public services is real and we need appropriate national contingency planning.”\nBrexit Secretary Dominic Raab is in Brussels for the latest round of negotiations with EU chief negotiator Michel Barnier, which a Downing Street spokesman said would be “resolving the few remaining withdrawal issues”. MP Catherine McKinnell (Image: Newcastle Chronicle)\nBookmakers Betway have cut the odds on the UK failing to agree a deal before we’re due to leave the EU, on March 29 2019. They’re offering odds of 8/11 on no deal, and evens that a deal will be agreed.\nMs Mckinnell said: “It is clear that however we leave the EU, it could significantly impact our lives - including our access to vital NHS services - for generations to come. That’s why British people deserve to have their say on the final Brexit deal, in a People’s Vote.” Read More Children from wealthy families go to better schools, new research shows\nLabour activists are likely to debate calls for a so-called People’s Vote - a second referendum on Brexit - at the party’s conference in Liverpool in September.\nLabour MPs backing the idea include Sedgefield MP Phil Wilson, Houghton and Sunderland South MP Bridget Phillipson , Redcar MP Anna Turley and Stockton South MP, Paul Williams. Labour Party's Bridget Phillipson (Image: PA)\nBut Labour Shadow Cabinet Minister Barry Gardiner warned there could be civil disobedience and social disruption if a second EU referendum is held.\nMr Gardiner, the shadow international trade secretary, told BBC Radio 4’s Today programme, said: “If people feel that the route to change is no longer a democratic route, then you look to social disruption, perhaps civil disobedience, in a different way.\n“This is playing with our democracy - it’s playing with the foundations of our country in a way that is really, really damaging.\n“We have to respect people’s vote in that referendum. We told them we would, we must do it.” Jeremy Hunt (Image: Roland Leon - Daily Mirror)\nForeign Secretary Jeremy Hunt has said the UK has faced “bigger challenges” than Brexit in the past and will “survive” the process.\nHe said: “We will find a way whatever the outcome to survive and prosper.” Read More\nAnd Liam Fox, the International Trade Secretary, said Britain has the potential to be a “21st century exporting superpower” after Brexit, as he published a strategy to increase exports as a proportion of UK GDP to 35%.\nNorth East business leaders welcomed the comments.\nJack Simpson, North East England Chamber of Commerce policy adviser said: “Following a Spring consultation with Chamber members, it is encouraging to see Government has listened to North East businesses, who highlighted the need for streamlined and tailored export support, improved signposting of new market opportunities, and development of peer to peer export support in the business community.\n“We now need to see clear and committed action from government to put words into action.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-08-21T18:00:00.000+03:00", "crawled": "2018-08-21T20:14:48.073+03:00", "highlightTitle": ""}