{"organizations": [], "uuid": "3d0ea23ce5ac3e8757ee8f92216de6b086c49c67", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14350077.ece/ALTERNATES/s1200/Brexit.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/nissan-warns-serious-implications-sunderland-15235351", "country": "GB", "domain_rank": 21960, "title": "Nissan warns of 'serious implications' for Sunderland plant over no-deal Brexit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-04T11:36:00.000+03:00", "replies_count": 0, "uuid": "3d0ea23ce5ac3e8757ee8f92216de6b086c49c67"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/nissan-warns-serious-implications-sunderland-15235351", "ord_in_thread": 0, "title": "Nissan warns of 'serious implications' for Sunderland plant over no-deal Brexit", "locations": [], "entities": {"persons": [], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "wearside", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}], "organizations": [{"name": "sunderland", "sentiment": "negative"}, {"name": "nissan", "sentiment": "negative"}, {"name": "invalid email nissan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The entrance to Nissan's plant at Washington (Image: nissan) Get business\nBusiness organisations and politicians say alarm bells are ringing after Nissan warned of “serious implications” for its Sunderland plant and the wider manufacturing industry amid a no-deal Brexit.\nThe Japanese juggernaut, which has grown to employ more than 6,000 people at its Wearside plant and more than 30,000 in its supply chain, has remained relatively tight-lipped since the June 2016 referendum result.\nYet alarm bells should now be sounding after the firm, operator of the UK’s largest car plant, released a statement highlighting its fears for the future, amid moves by the government to steps up planning for a so-called no-deal Brexit when the UK leaves the EU on March 29 next year.\nNissan uses its UK base to export to the EU and benefits from being able to trade freely, also importing vast volumes of components – around 85% of its needs now that those parts are no longer made in the UK – from the EU every day, without customs checks or extra tariffs, while Britain is a full member.\nThat will be in jeopardy in the event of a hard Brexit , the firm has warned. An aerial view of Sunderland's Nissan plant (Image: nissan)\nThe statement says: “Since 1986, the UK has been a production base for Nissan in Europe. Our British-based R&D and design teams support the development of products made in Sunderland, specifically for the European market.\n“Frictionless trade has enabled the growth that has seen our Sunderland plant become the biggest factory in the history of the UK car industry, exporting more than half of its production to the EU.\n“Today we are among those companies with major investments in the UK who are still waiting for clarity on what the future trading relationship between the UK and the EU will look like.\n“As a sudden change from those rules to the rules of the WTO will have serious implications for British industry, we urge UK and EU negotiators to work collaboratively towards an orderly balanced Brexit that will continue to encourage mutually beneficial trade.”\nIn February 2017 the firm unveiled a £37m press facility which it said was the plant’s most advanced piece, ringing in a new era of manufacturing while also representing Nissan’s long-term commitment to the North East plant.\nFour days later, however, the House of Commons international trade committee was warned by Nissan that WTO tariffs – which apply 4.5% tariffs to car parts and 10% to finished cars – would add £500m to the plant’s costs.\nNissan warns of 'serious implications' for Sunderland plant over no-deal Brexit\nDeputy Leader of Sunderland City Council , coun Michael Mordey said: “We understand and appreciate Nissan’s concerns, and share their desire for clarity on what is happening with Brexit.\n“Nissan is not alone in making comments about Brexit. Over the last few weeks we have seen similar warnings from a string of car makers and large businesses, especially with regard to continued free movement of components within the same industries.\n“What people may not realise is that a single automotive component can cross the international border between the UK and the rest of the EU several times before it finally becomes part of the finished motor car.\n“If each movement becomes subject to both a delay and a tariff being charged, that has serious implications for the cost of making each vehicle. Under a hard Brexit both delays and tariffs appear to be inevitable. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now\n“That is why it is important that the Government continues to negotiate a good deal for the country on leaving the EU, which can help secure the future of Nissan and the rest of the North East/UK automotive industry.”\nHoughton and Sunderland South MP Bridget Phillipson agreed, saying: “These latest warnings from Nissan will set alarm bells ringing across the North East. If the botched Brexit that’s being pushed by the Government leads to lost manufacturing jobs in my region or in other parts of the UK, it will not be forgiven or forgotten.\n“The Government cannot continue to play politics with people’s jobs and livelihoods. No-one voted for a Brexit deal that decimates our highly skilled automotive sector, or other manufacturing industries.\n“Warnings like these from major employers like Nissan only strengthen the case for a People’s Vote at the end of the Brexit process.” Bridget Phillipson (Image: PA)\nNissan’s warning comes as several multinational firms pull jobs and operations out of the UK, amid growing concern over the Government’s protracted negotiations and a no-deal scenario.\nPlanemaker Airbus warned in June it could quit the UK if Britain leaves without a trade deal, while several banks have moved staff and trading units to the EU.\nJapanese firms have been among the most vocal when expressing fears over Brexit, with Panasonic the latest to announce plans to shift its European headquarters out of the UK.\nIt is thought there are 879 Japanese companies employing 142,000 staff in Britain, including Honda and Nissan.\nNissan to axe 200 jobs across Europe - including roles in Sunderland\nJonathan Walker, assistant director of policy, North East England Chamber of Commerce said the Government must sit up and take notice.\nHe said: “The need to maintain free and frictionless trade with our nearest and biggest export market is essential to ensure the continued success of some of our most important industries and the jobs they create.\n“This warning comes as no surprise and adds further weight to concerns that have been voiced across the business community in recent months.\n“Time is running out for Government to sit up and take notice of those who know the most about international trade. Businesses need clarity and the two sides negotiating Brexit have to work together to get a deal with the utmost urgency.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-10-04T11:36:00.000+03:00", "crawled": "2018-10-04T13:07:37.014+03:00", "highlightTitle": ""}