{"organizations": [], "uuid": "b06230c6b985986d2d1b3cdb974b23118af98b92", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/sport/article2088705.ece/ALTERNATES/s1200/0_PiatekKrzysztof.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/sport/liverpool--tottenham-want-30m-2088763", "country": "GB", "title": "Liverpool & Tottenham want £30m Krzysztof Piatek, 'big six' chasing Jadon Sancho", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-09T12:17:00.000+03:00", "replies_count": 0, "uuid": "b06230c6b985986d2d1b3cdb974b23118af98b92"}, "author": "Stuart James", "url": "https://www.devonlive.com/sport/liverpool--tottenham-want-30m-2088763", "ord_in_thread": 0, "title": "Liverpool & Tottenham want £30m Krzysztof Piatek, 'big six' chasing Jadon Sancho", "locations": [], "entities": {"persons": [{"name": "jadon sancho transfer", "sentiment": "none"}, {"name": "krzysztof piatek", "sentiment": "none"}, {"name": "chelsea", "sentiment": "none"}, {"name": "piatek", "sentiment": "none"}], "locations": [{"name": "cracovia", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "poland", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}, {"name": "genoa", "sentiment": "none"}, {"name": "totteham hotspur", "sentiment": "none"}], "organizations": [{"name": "liverpool & tottenham", "sentiment": "none"}, {"name": "jadon sancho liverpool & tottenham", "sentiment": "none"}, {"name": "liverpool", "sentiment": "none"}, {"name": "barcelona", "sentiment": "none"}, {"name": "manchester city", "sentiment": "none"}, {"name": "premier league", "sentiment": "none"}, {"name": "invalid email liverpool", "sentiment": "none"}, {"name": "spurs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Liverpool & Tottenham want £30m Krzysztof Piatek, 'big six' chasing Jadon Sancho Transfer news and rumours from the Premier League Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nLiverpool and Totteham Hotspur look set to go head-to-head in the race to sign Polish goal machine Krzysztof Piatek this January.\nThe 23-year-old is enjoying a fine season in Serie A and has 13 goals in just eight appearances so far this campaign, which has alerted many of Europe's top clubs to his services.\nChelsea and Barcelona were both linked with the Polish international, but it now seems Premier League rivals Liverpool and Spurs have stepped up their interest, along with Manchester City.\nPiatek moved to Genoa from Cracovia for just £3.5m over the summer, after bagging 21 goals in 36 outings in Poland’s top flight last term, and has already proved to be a big hit in Italy.\nThe Premier League's top clubs have been put on red alert to the possibility of signing Jadon Sancho, who is currently with England after winning his first call-up to the national side.\nThe 18-year-old has been impressive form for his club, Borussia Dortmund, this season and scouts from Manchester United, Tottenham Hotspur, Liverpool, Chelsea and Arsenal have all been watching him in action this campaign.\nHowever, Dortmund are unwilling to sell unless they receive a mega-money bid and have slapped a £100 million price tag on the head of the former Manchester City youngster.\nSancho has already provided six assists this season, started in the Champions League and also started his first Bundesliga game this season in the 4-3 win over Augsburg on Saturday which saw Dortmund stay top.\nManchester United want £55m Mats Hummels, Leicester target £15m Liverpool defender\nManchester United are being linked with a shock move for Helsingborgs defender Andreas Granqvist, who has confirmed the Red Devils' interest in his services.\nThe 33-year-old was a star performer as Sweden reached the quarter-finals of the World Cup in the summer.\nUnited have been on the lookout for a centre half for some time, but manager Jose Mourinho's wish to bring one in has been blocked by chief executive Edward Woodward.\nAccording to Fotbolldirekt , though, United are determined to land the no-nonsense defender, whose leadership qualities have impressed Mourinho.\n“There is indeed interest… This time there is a kernel of truth (to the transfer rumours),” Granqvist told reporters on Sunday.\n“I am honoured that I am linked to such a large club, and if there is a concrete offer in January, then both the club and I will accept that, but that is currently not the case.”\nAnother player attracting interest from the Old Trafford giants s AFC Bournemouth's Nathan Ake.\nThe former Chelsea youngster has prospered since leaving Stamford Bridge and joining the Cherries for £20 million after a successful loan spell.\nAke worked with Mourinho at Chelsea and would fit the profile of the type of centre half the Portuguese is so keen to bring to Old Trafford.\nMourinho has lamented the inability of his defenders to bring the ball out of defence and Ake is certainly capable of doing just that. However, United would face competition from Tottenham for his signature and the Cherry would not come cheap with Bournemouth likely to command a significant fee for his services.\nThe Daily Star are reporting he would cost around £40 million. Midfielder Miguel Almiron of Atlanta United dribbles during the game against the New York Red Bulls at Bobby Dodd Stadium on March 5, 2017 in Atlanta, Georgia. (Photo by Mike Zarrilli/Getty Images)\nArsenal remain keen to sign Paraguayan international Miguel Almiron during the January transfer window, despite reports to the contrary.\nThe Gunners look set to land the 24-year-old midfielder for a fee of around £11 million, fending off interest from Atletico Madrid and Borussia Dortmund, according to Team Talk .\nThe Gunners' head of recruitment, Sven Mislintat, has been sanctioning the deal and hopes to have it concluded soon with Almiron then joining Arsenal when the MLS season concludes at the end of October.\nTransfer rules state that Almiron would not be eligible to ply until the window reopens in January, but by joining now, it would allow him to get up to speed and familiarise himself with his new team-mates.\nEx-England star and Premier League manager in Brexit donation, David Moyes is wanted back at Preston North End Genk's Aly Mbwana Samatta celebrates after scoring a goal during the UEFA Europa League first leg of the play off football match between Belgian team KRC Genk and Danish club Brondby IF, on August 23, 2018 in Genk. (Photo by BRUNO FAHY / BELGA / AFP) / Belgium OUT (Photo credit should read BRUNO FAHY/AFP/Getty Images)\nEverton are being linked with a move in January for striker Mbwana Samatta.\nThe 25-year-old Tanzanian international has scored eight goals in his first 11 games of the season for Belgian side Genk and that form has alerted clubs.\nPremier League rivals Brighton & Hove Albion have also expressed their interest in him, as have West Ham United and Burnley.\nSamatta began his career in African football and has 16 goals in 44 appearances at international level, according to HiTC .\nNewcastle United have struggled for goals this season and manager Rafa Benitez is lining up a £13 million bid for Galatasaray's Garry Rodriguez.\nThe Dutch-born, Cape Verde international interested Benitez back in the summer, but a move never materialised.\nNow, the Spanish boss is set to make another move for him, if he is given the funds by Newcastle owner Mike Ashley.\nRodrigues, 28, has scored three times in nine games, but has no assists, which is a stark contrast to last season when he had ten goals and 11 assists. Like us on Facebook", "external_links": ["https://www.teamtalk.com/news/arsenal-deal-for-paraguayan-midfielder-is-on-despite-denials", "https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}", "http://www.hitc.com/en-gb/2018/10/08/report-west-ham-tracking-mbwana-samatta-whose-potential-has-aler/", "https://www.plymouthherald.co.uk/sport/manchester-united-want-mats-hummels-2084220", "http://www.fotbolldirekt.se/2018/10/02/avslojar-united-tittar-pa-andreas-granqvist-kan-kopiera-henke-losning-otroligt-smickrande/", "https://www.plymouthherald.co.uk/sport/ex-england-star-premier-league-2086871", "https://www.dailystar.co.uk/sport/football/735127/Man-Utd-news-transfer-Jose-Mourinho-Nathan-Ake-Bournemouth-defender"], "published": "2018-10-09T12:17:00.000+03:00", "crawled": "2018-10-09T13:09:10.005+03:00", "highlightTitle": ""}