{"organizations": [], "uuid": "8e916c359f5364a5f6a79bb4e8e95e8cae68e2f6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article389198.ece/ALTERNATES/s1200/5069190_394c3290.jpg", "site_section": "https://www.devonlive.com/rss.xml", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/devon-news/last-chance-your-say-future-2090561", "country": "US", "title": "Last chance to have your say on the future of Exmouth", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-09T17:19:00.000+03:00", "replies_count": 0, "uuid": "8e916c359f5364a5f6a79bb4e8e95e8cae68e2f6"}, "author": "Daniel Clark", "url": "https://www.devonlive.com/news/devon-news/last-chance-your-say-future-2090561", "ord_in_thread": 0, "title": "Last chance to have your say on the future of Exmouth", "locations": [], "entities": {"persons": [{"name": "daniel clark", "sentiment": "none"}, {"name": "rees-mogg", "sentiment": "none"}], "locations": [{"name": "littleham village", "sentiment": "none"}, {"name": "queens drive", "sentiment": "none"}, {"name": "devon brexit", "sentiment": "none"}, {"name": "magnolia shopping centre", "sentiment": "none"}], "organizations": [{"name": "exmouth town council", "sentiment": "none"}, {"name": "east devon district council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Last chance to have your say on the future of Exmouth The plan intends to make it a vibrant town which builds on its seaside heritage Share Daniel Clark Local Democracy Reporter 15:19, 9 OCT 2018 Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nA plan to make Exmouth a friendly, welcoming, safe, clean and vibrant town, which builds on its traditional seaside heritage is out for consultation – and this is your last chance to comment.\nExmouth Town Council’s Neighbourhood Plan would preclude development taking place on the stretch of land between Littleham Village and the Maer, and also includes plans to regenerate the Magnolia Shopping Centre and that any plans for phase three of the controversial Queens Drive seafront development would have to relate to tourism. Read More Farage and Rees-Mogg are going for a Wetherspoons together as part of a Devon Brexit rally\nEast Devon District Council is formally required to consult on the Plan for a period of six weeks before it goes to an Independent Examiner, who will inspect the plan against a series of basic conditions that the plan must meet. The Maer, Exmouth\nKey policies included in the Neighbourhood Plan are: To protect, conserve and enhance the natural environmental qualities of the Exe Estuary, Exmouth beach, sea water quality, the “Jurassic Coast” World Heritage Site and the special landscape and wildlife assets of the East Devon Area of Outstanding Natural Beauty Development within the Marley area and Bystock House Estate will not be supported Existing Valley Parks at Bapton Brook and Withycombe Brook should be conserved The area of land along Littleham brook extending to Littleham Village and Plumb Park to the Maer should be conserved with a view to future designation as a Valley Park Development proposals for new renewable energy generation will be supported New development which delivers an increase in workspace within the town, generating increased employment opportunities, will be supported. Such developments should seek to use previously developed land Applications for a change of use from an employment use to residential, leading a to a reduction of employment, will only be supported if the existing site is no longer economically viable and the site has been marketed at a realistic price for a minimum of one year Read More The amazing Devon houses we wish we lived in Development proposals for the regeneration of the Magnolia Centre and the surrounding area will be supported. Proposals should incorporate improvements to accessibility, and car parking provision. Extension of improved pedestrianisation and road surface design to include Rolle Street, the Magnolia Centre and the Parade Development proposals for the regeneration of the area at the head of Camperdown Creek will be supported. Proposals should incorporate increased provision of marine-related workshops and office space. Development proposals for a permanent café facility within the pedestrianized area at Orcombe Point will be supported Buildings and land use in phase there of the Queens Drive development should be related to serving the tourism industry as well as local residents and to the provision of visitor facilities for the benefit to the community through job-creation. All housing development on sites of more than 10 properties, should seek to deliver as a minimum, 25 per cent affordable units The Neighbourhood Plan supports the provision of additional Further Education opportunities and training in Exmouth. The Neighbourhood Plan supports a new library and museum complex All existing healthcare facilities/buildings are retained and used to their full potential to provide integrated health, social care, wellbeing and health promotion for the Exmouth community of all ages. Development proposals for a new Health and Wellbeing hub, located near the LED Sports Centre and the Imperial Rugby Ground will be supported Opportunities to further develop sport and leisure facilities to meet demand will be supported in appropriate locations.\nCllr Bruce de Saram, East Devon District Council’s lead councillor for neighbourhood planning and ward member for Exmouth Littleham, said: “I am very pleased to see the progress made by my colleagues in Exmouth on the production of our neighbourhood plan. The submitted version of the neighbourhood plan is the result of a great deal of hard work by volunteer steering group members, working to deliver local objectives, informed by extensive public engagement and consultation.” Read More Storm Callum could batter Devon and Cornwall this weekend\nThe Exmouth neighbourhood plan vision is for the town to be a friendly, welcoming, safe, clean and vibrant town, protecting its environment and building on its traditional seaside heritage with an aspiration to be forward thinking – a great place for all, young and old, to live, work and visit.\nA neighbourhood plan is a planning policy document that will be used by the district council’s development management team when considering planning applications within the parish. A couple enjoy the current hot and sunny weather conditions on the beach at Exmouth (Image: APEX NEWS AND PICTURES)\nThe district council is formally required to consult on the plan for a period of six weeks before it goes to an independent examiner, who will inspect the plan against a series of basic conditions that the plan must meet.\nShould the examiner conclude that the plan meets the basic conditions it will proceed to a local community referendum where, should more than half of the electors in the local area vote in favour of the plan, it will become part of the statutory development plan for East Devon. Read More ", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-10-09T17:19:00.000+03:00", "crawled": "2018-10-09T17:31:32.001+03:00", "highlightTitle": ""}