{"organizations": [], "uuid": "eabbd86f0a317841e3cc019bab920f1eaba4bb0a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15305040.ece/ALTERNATES/s1200/0_IBP_NEC_191018farage_02JPG.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/nissan-sunderland-brexit-nigel-farage-15305029", "country": "GB", "domain_rank": 21960, "title": "Nigel Farage: 'Nissan isn't going anywhere after Brexit' amid fears over Sunderland plant's future", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-22T15:00:00.000+03:00", "replies_count": 0, "uuid": "eabbd86f0a317841e3cc019bab920f1eaba4bb0a"}, "author": "Ian Johnson", "url": "https://www.chroniclelive.co.uk/news/nissan-sunderland-brexit-nigel-farage-15305029", "ord_in_thread": 0, "title": "Nigel Farage: 'Nissan isn't going anywhere after Brexit' amid fears over Sunderland plant's future", "locations": [], "entities": {"persons": [{"name": "nigel farage", "sentiment": "negative"}, {"name": "brexit", "sentiment": "negative"}], "locations": [{"name": "gateshead", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "sunderland", "sentiment": "negative"}, {"name": "nissan", "sentiment": "negative"}, {"name": "european union", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nNigel Farage believes Nissan is \"not going anywhere\" - despite fears over the Sunderland plant's post-Brexit future.\nThe car manufacturer is warning a hard Brexit could have \"serious implications\" for the site, which employs more than 6,000 people.\nPay talks were delayed earlier this month with Britain still to thrash out a deal to leave the European Union.\nBut speaking during a visit to Gateshead , the ex-UKIP leader downplayed the firm's concerns.\n\"Twenty years ago we had these terrible, blood-curdling threats about Nissan in Sunderland if we didn't join the Euro,\" he said. Former UKIP leader Nigel Farage out and about in Gateshead (Image: Newcastle Chronicle)\n\"Twenty years later, they are still here - a massive investment and one of the most efficient car plants in the world - they are not going anywhere.\"\nNissan is the biggest employer in Sunderland , which voted overwhelmingly to leave the EU. Read More No-deal Brexit would do 'lasting damage' to North East, business leader says\nOver 60% voted out. The following February, Nissan chiefs warned Parliament its business model depends on parts arriving daily without barriers of custom delays.\nAround 85% of the five million parts fitted daily come from abroad, mainly Europe. While Britain remains in the EU, that's tariff free. Read More\nIf that changes, it could add £500m to the plant's running costs, warned Nissan executive Colin Lawther.\nIf Britain leaves without a deal - a 'hard Brexit' - it could prove disastourous.\nThe Japanese firm had remained largely tight-lipped over the Sunderland site's future since the referendum.\nMonths after the vote, it even announced a £37m investment, signalling a long-term commitment to the North East. Workers at Nissan's plant in Sunderland\nBut a statement earlier this month warned: “Frictionless trade has enabled the growth that has seen our Sunderland plant become the biggest factory in the history of the UK car industry, exporting more than half of its production to the EU.\n“Today we are among those companies with major investments in the UK who are still waiting for clarity on what the future trading relationship between the UK and the EU will look like.\n“As a sudden change from those rules to the rules of the WTO will have serious implications for British industry, we urge UK and EU negotiators to work collaboratively towards an orderly balanced Brexit that will continue to encourage mutually beneficial trade.” Read More Nigel Farage talks Brexit and Theresa May before downing 'strongest pint in Wetherspoons'\nHoughton and Sunderland South MP Bridget Phillipson said the statement had sparked \"alarm bells\".\nBut Mr Farage, who is pushing for Britain to \"get on\" with leaving - even without a deal - said: \"We have heard it all before.\n\"We have heard big companies playing political messages and trying to frighten and threaten people.\n\"And you know what, we are not listening anymore.\n\"We have had enough of being threatened and had enough of being told this stuff.\" Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-10-22T15:00:00.000+03:00", "crawled": "2018-10-22T17:50:42.009+03:00", "highlightTitle": ""}