{"organizations": [], "uuid": "9e08c4b64d3ac440e7ec10a2c840f04220658680", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15240084.ece/ALTERNATES/s1200/0_CFR_NJL_140417seaweed_03.jpg", "site_section": "http://www.thejournal.co.uk/business/?service=rss", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/whitley-bay-seaweed-business-featured-15238841", "country": "GB", "domain_rank": 21960, "title": "Whitley Bay seaweed business featured on Celebrity Bake Off targets global sales", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-04T18:00:00.000+03:00", "replies_count": 0, "uuid": "9e08c4b64d3ac440e7ec10a2c840f04220658680"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/whitley-bay-seaweed-business-featured-15238841", "ord_in_thread": 0, "title": "Whitley Bay seaweed business featured on Celebrity Bake Off targets global sales", "locations": [], "entities": {"persons": [{"name": "craig rose", "sentiment": "none"}, {"name": "ricky wilson", "sentiment": "none"}], "locations": [{"name": "whitley bay", "sentiment": "none"}, {"name": "scandinavia", "sentiment": "none"}], "organizations": [{"name": "seaweed & co", "sentiment": "none"}, {"name": "kaiser chiefs", "sentiment": "none"}, {"name": "kevin gibson photography ltd", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Whitley Bay seaweed business featured on Celebrity Bake Off targets global sales Seaweed and Co is looking to boost its exports as overseas sales improve Share Click to play Tap to play The video will start in 8 Cancel Play now Get business updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nA brand of edible seaweed products used on The Great Celebrity Bake Off is looking to expand in Scandinavia.\nSeaweed & Co was founded by Dr Craig Rose in 2014, and harvests and mills Hebridean seaweed for the industrial food and drink sector.\nThe company sells a range of seaweed products including seaweed infused rapeseed oil. Dr Craig Rose, founder of Seaweed & Co (Image: Kevin Gibson Photography Ltd)\nThe Whitley Bay firm was showcased on The Great Celebrity Bake Off when the lead singer of the Kaiser Chiefs, Ricky Wilson, used its PureSea smoked Scottish seaweed in his savoury scones.\nSeaweed & Co started exporting its products three years ago and is now looking to expand its reach into the Scandinavian market. Read More Gateshead designer launches new clothing brand The Lone Wolf Pack\nDr Rose said: “Exporting has been part of our business strategy from the very beginning. There is a huge market out there, and by working with distributors and partners overseas we’ve been able to increase our profitability and boost our resilience.\n“There is an increasing awareness of the health benefits from eating seaweed, and there’s a growing demand for our products as a direct result. Although people still raise their eyebrows when they find out we sell seaweed, markets such as Scandinavia, where consumers are relatively health conscious, hold potential for serious growth.” Dr Craig Rose, founder of Seaweed & Co (Image: Kevin Gibson Photography Ltd)\nSince the business began exporting, overseas sales have grown to account for 15% of its annual turnover. Its seaweed ingredients are sold in South Korea, Australia, Canada, Israel, the US, and across the EU.\nMost recently the firm secured a £10,000 order for its Puresea brand from a food manufacturer in Spain.\nThe company has been working with the Department for International Trade (DIT) to increase its overseas sales, and later this month it will be showcasing its Weed & Wonderful range to Danish buyers as part of a DIT sponsored “meet the buyer” mission in Copenhagen. Read More Businesses are not preparing for Brexit, warns Newcastle tech giant Sage\nDr Rose said: “Although exporting has been a huge boost to the business, it’s not without its challenges. Thankfully DIT has been on hand to help with guidance in completing the right export paperwork and navigating international regulations.\n“They even were able to help us avoid being scammed after we were contacted by what looked like a genuine overseas customer. I’d encourage anyone thinking about exporting to get in touch with DIT at the earliest possibility.”\nDavid Coppock, DIT North East regional head, said: “Seaweed & Co is an example of a local firm that has been quick to capitalise on a growing international trend with health-conscious consumers, with its highly versatile product.\n“We know that exporting can sometimes present hurdles, which is why DIT is on hand to offer our support. Our network of international trade advisers based on the ground across the North East can offer firms of all sizes advice on everything from logistics and tax to language and intellectual property, as well as help businesses access funding for missions abroad.\n“I’d encourage anyone interested in exporting to get in touch.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-10-04T18:00:00.000+03:00", "crawled": "2018-10-05T15:25:55.012+03:00", "highlightTitle": ""}