{"organizations": [], "uuid": "e1bae1cff8f1f952820f5eba409998f094dc27ab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15300914.ece/ALTERNATES/s1200/0_trickett2.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/meet-labours-new-champion-north-15300995", "country": "GB", "domain_rank": 21960, "title": "Meet Labour's new 'champion' for the North - and this is what the role could mean for the North East", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-20T07:01:00.000+03:00", "replies_count": 0, "uuid": "e1bae1cff8f1f952820f5eba409998f094dc27ab"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/meet-labours-new-champion-north-15300995", "ord_in_thread": 0, "title": "Meet Labour's new 'champion' for the North - and this is what the role could mean for the North East", "locations": [], "entities": {"persons": [{"name": "jon trickett", "sentiment": "none"}, {"name": "mr trickett", "sentiment": "none"}, {"name": "philip hammond", "sentiment": "none"}], "locations": [{"name": "north east get", "sentiment": "none"}, {"name": "westminster", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "north", "sentiment": "none"}], "organizations": [{"name": "meet labour", "sentiment": "negative"}, {"name": "labour cabinet", "sentiment": "none"}, {"name": "labour’s shadow cabinet office", "sentiment": "none"}, {"name": "labour government", "sentiment": "none"}, {"name": "invalid email labour", "sentiment": "none"}, {"name": "labour’s shadow cabinet", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nLabour has appointed a “champion” for the North of England, to speak up for the region at Westminster and in a future Labour Government.\nYorkshireman Jon Trickett, Labour’s Shadow Cabinet Office Minister and a former Shadow Business Secretary, began his new role by calling on Chancellor Philip Hammond to back the North of England in his Budget statement, on October 29.\nSpeaking to ChronicleLive , Mr Trickett said: “Northern voices are sensible. They need to be heard.\n“And after all, the industrial revolution was built in the North. We were in large measure the source of the country’s wealth.”\nHe is set to undertake a tour of the North of England and plans to be a voice for the North at Westminster, he said.\nThat includes meetings of Labour’s Shadow Cabinet and any future Labour Cabinet, if the party wins a general election. Do you know the north and south divide?\nThe North is already well-represented in the Shadow Cabinet. Members include Newcastle MP Nick Brown, Labour’s Chief Whip, along with Wansbeck MP Ian Lavery , the party chair.\nBut Mr Trickett has been specifically tasked with ensuring every decision is right for the North.\n“It’s a matter of making sure that whenever decisions are made, we have an eye on the implications for our area.\n“There are 17 million people living in the North of England, we are larger than 19 other countries in the EU, and I think we should be speaking with a very clear voice.”\nOfficial statistics make it clear that the “north/south divide”, the huge gap in wealth between the North and parts of the South of England - or certainly parts of London - still exists.\nFor example, economic output per head in London, known as GVA, is £46,482 a year, while in the North East it is £19,218. Read More Brexit could help narrow the North-South divide says survey\nWeekly pay for someone in the middle of the pay scale is £692.5 in London and £504.10 in the North East.\nMr Trickett said: “One thing that’s interesting is, if you ask people about pride in being English, many people in the North will say we are very proud, we’re proud about what we achieved in the past, and we want to be able to contribute properly to the wealth of the country in the future.”\nBut despite the Conservative claim to support the creation of a “northern powerhouse”, Mr Trickett says the North has been “held back”.\n“One of the tests we have set for the Budget is whether it will help to deal with these regional imbalances.\n“The situation is becoming quite critical. As you can see from the data, the economy is actually going backwards relative to the City of London.\n“The country as a whole suffers as a result - but obviously our area, the North, particularly.” Read More Newcastle council leader Nick Forbes: Why the North must take control of its own destiny\n“What’s needed is strong voices speaking out on behalf of the North.\n“I’m determined to take it out into Westminster and make them listen, but also I will be touring the North, speaking out on matters.\n“We’ve got council leaders and regional mayors and so on. But in addition, as a member of the Shadow Cabinet, I want to take the battle into Parliament and also across the North of England to make the point.” Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-10-20T07:01:00.000+03:00", "crawled": "2018-10-20T07:37:26.014+03:00", "highlightTitle": ""}