{"organizations": [], "uuid": "c34778c4548ef77918cab706b5a56ec9d73fa028", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15229136.ece/ALTERNATES/s1200/0_Conservative-Party-annual-conference-2018.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/theresa-promises-better-life-after-15229096", "country": "GB", "domain_rank": 21960, "title": "Theresa May promises a better life after Brexit and insists: 'Our best days lie ahead'", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-03T00:30:00.000+03:00", "replies_count": 0, "uuid": "c34778c4548ef77918cab706b5a56ec9d73fa028"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/theresa-promises-better-life-after-15229096", "ord_in_thread": 0, "title": "Theresa May promises a better life after Brexit and insists: 'Our best days lie ahead'", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "brexit", "sentiment": "negative"}, {"name": "boris johnson", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Theresa May prepares her keynote speech in her hotel room (Image: PA) Get daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nPrime Minister Theresa May will attempt to focus attention on the promise of a better life after Brexit, as she insists the UK has “everything we need to succeed”.\nShe will say on Wednesday: “I passionately believe that our best days lie ahead of us and that our future is full of promise.\"\nMrs May's speech will close a party conference that has been dominated by debate about Brexit, her proposed \"Chequers\" deal with the EU and speculation about her role as party leader.\nBoris Johnson , the former foreign secretary, delivered a challenge to her authority on Tuesday with a barnstorming speech urging delegates to \"chuck Chequers\".\nBut Mrs May will attempt to shift the focus onto her government's plans to deliver a life after Brexit takes place. Theresa May arrives at the Conservative Party conference (Image: PA)\nShe is expected to include a section on immigration, after Home Secretary Sajid Javid announced that the UK will welcome high-skilled migrants but impose barriers on low-skilled immigration.\nThe Prime Minister will also set out plans to help people struggling to obtain high quality and secure housing.\nIn a speech entitled \"Our Future Is In Our Hands\", the Prime Minister will tell activists in Birmingham that Britain's “best days lie ahead of us” as countries across the world stand ready to trade with the UK.\nShe will say: \"Don’t let anyone tell you we don’t have what it takes: we have everything we need to succeed.\"\nBrexit is due to take place on March 29, 2019. Theresa May arrives at the Conservative Party annual conference (Image: PA)\nThe Prime Minister will tell delegates that at this \"moment of opportunity\" the Conservatives will always act in the \"national interest\" and put the needs of hard-working people first.\nAnd she will launch a scathing attack on Jeremy Corbyn’s leadership of the Labour party and call for a return to \"decency\" in political discourse.\n\"Millions of people who have never supported our party in the past are appalled by what Jeremy Corbyn has done to Labour,\" she will say.\n\"They want to support a party that is decent, moderate and patriotic. One that puts the national interest first. Delivers on the issues they care about. And is comfortable with modern Britain in all its diversity.\n\"We must show everyone in this country that we are that party. Read More Huge applause for Boris Johnson as he sets out leadership pitch at Conservative conference\n\"A party that conserves the best of our inheritance but is not afraid of change. A party of patriotism but not nationalism. A party that believes in business but is not afraid to hold businesses to account.\n\"A party that believes in the good that government can do but knows that government will never have all the answers.\n\"A party that believes your success in life should not be defined by who you love, your faith, the colour of your skin, who your parents were, or where you were raised – but by your talent and hard work.\" Video Loading Click to play Tap to play The video will start in 8 Cancel Play now\nRejecting Labour's slogan of \"for the many not the few\", Mrs May will say the Conservatives are \"a party not for the few, not even for the many, but for everyone who is willing to work hard and do their best.”\nMrs May will also reiterate her refusal to accept the EU's proposed Brexit deal, which she argues would mean the break up of the UK.\nShe will say the Conservatives are \"above all a party of Unionism, not just of four proud nations, but of all our people.\" Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-10-03T00:30:00.000+03:00", "crawled": "2018-10-03T00:46:10.028+03:00", "highlightTitle": ""}