{"organizations": [], "uuid": "bf97ef305f390a5e11aa5e2f18b4a439da1d0cf2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article1859287.ece/ALTERNATES/s1200/0_A-woman-holding-a-UK-passport.jpg", "site_section": "http://www.leicestermercury.co.uk/rss.xml", "section_title": "Leicestershire Live - frontpage", "url": "https://www.leicestermercury.co.uk/news/uk-world-news/travellers-europe-should-renew-old-2069215", "country": "GB", "domain_rank": 48128, "title": "Why travellers to Europe should renew old passports as soon as possible", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-03T14:01:00.000+03:00", "replies_count": 0, "uuid": "bf97ef305f390a5e11aa5e2f18b4a439da1d0cf2"}, "author": "leicestermercury", "url": "https://www.leicestermercury.co.uk/news/uk-world-news/travellers-europe-should-renew-old-2069215", "ord_in_thread": 0, "title": "Why travellers to Europe should renew old passports as soon as possible", "locations": [], "entities": {"persons": [], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "schengen", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Why travellers to Europe should renew old passports as soon as possible Anyone with passports with less than six months left have been advised to renew them Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nTravellers who have passports which have six months or less left on them have been advised to renew them as soon as possible.\nFailure to do so could mean passengers run the risk of being barred from Europe if a no-deal Brexit happens.\nIf your passport has less than six months left on it, then the Government recommend you renew it if you want to travel to Europe after March 29, 2019.\nThe advice has been offered to help travellers avoid the possibility of their passports not complying with the Schengen Border Code, reports The Mirror .\nIt is possible that some valid British passports will be completely useless in our neighbouring countries if we leave the EU without striking a deal.\nThe documents state: \"If you plan to travel to the Schengen area after 29 March 2019, to avoid any possibility of your adult British passport not complying with the Schengen Border Code we suggest that you check the issue date and make sure your passport is no older than 9 years and 6 months on the day of travel. Read More Try this random (but simple) hack to keep spiders out of your home this winter\n\"For example, if you're planning to travel to the Schengen area on 30 March 2019, your passport should have an issue date on or after 1 October 2009.\n\"If your passport does not meet these criteria, you may be denied entry to any of the Schengen area countries, and you should renew your passport before you travel.\"\nThese same rules apply to both adult and children's passports - and the government recommends renewing as soon as possible as the passport issuing service \"can get busy\". Check your passport if you plan to travel after March next year. (Image: Getty)\nThe Schengen zone includes Brit holiday faves such as Spain, France, Greece, Germany, Italy and Portugal - as well as Austria, Belgium, the Czech Republic, Denmark, Estonia, Finland, Hungary, Iceland, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, the Netherlands, Norway, Poland, Slovakia, Slovenia, Sweden and Switzerland.\nThis is one of the many ways a no deal Brexit would negatively affect lives according to these new documents, including price hikes for products like medicines and perfumes, heartbroken families being torn apart and expensive data roaming charges. Read More ", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/leicestermercury/subscriptions/&quot;}", "https://www.mirror.co.uk/news/politics/you-should-renew-your-passport-13239167"], "published": "2018-10-03T14:01:00.000+03:00", "crawled": "2018-10-03T16:03:09.014+03:00", "highlightTitle": ""}