{"organizations": [], "uuid": "9091cb5672d5a99139724182ddaa249908f07fa6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15323561.ece/ALTERNATES/s1200/0_Mr-Lava-Lava-burger-Gourmet-Burger-Kitchen.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/gourmet-burger-kitchen-plans-shut-15323557", "country": "GB", "domain_rank": 21960, "title": "Gourmet Burger Kitchen plans to shut 17 restaurants as part of proposed CVA", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-24T18:10:00.000+03:00", "replies_count": 0, "uuid": "9091cb5672d5a99139724182ddaa249908f07fa6"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/gourmet-burger-kitchen-plans-shut-15323557", "ord_in_thread": 0, "title": "Gourmet Burger Kitchen plans to shut 17 restaurants as part of proposed CVA", "locations": [], "entities": {"persons": [], "locations": [{"name": "metrocentre", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}], "organizations": [{"name": "cva business gourmet burger kitchen", "sentiment": "negative"}, {"name": "gourmet burger kitchen", "sentiment": "negative"}, {"name": "cva", "sentiment": "negative"}, {"name": "gbk", "sentiment": "none"}, {"name": "invalid email hundreds of gourmet burger kitchen", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Gourmet Burger Kitchen plans to shut 17 restaurants as part of proposed CVA The burger restaurant has a restaurant at the intu Metrocentre in Gateshead and more than 200 jobs are affected by the announcement Share Mr Lava Lava burger, Gourmet Burger Kitchen (Image: The Wharf) Get business updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nHundreds of Gourmet Burger Kitchen employees are at risk after the fast-food chain announced it is the latest firm to embark on a store closure plan.\nThe group has announced plans for a Company Voluntary Arrangement (CVA), an insolvency procedure which allows struggling firms to dump unprofitable stores.\nSome 17 restaurants have been earmarked for closure, affecting 250 jobs.\nGBK operates more than 80 eateries, including one at the Metrocentre in Gateshead, and employs 2,000 people. The Gourmet Burger Kitchen at Metrocentre (Image: Staff photo)\nFamous Brands, the South African firm which acquired GBK in 2016 for £120m, said that the board would initiate the process with help from advisers at Grant Thornton.\nThe firm has previously unveiled stinging losses at the burger chain.\nThe company said earlier this month that it would take a pre-tax impairment charge of 874m rand (£47.2m) due to the brand’s sustained under-performance.\nCreditors will vote on the proposed closures at a meeting on November 9. All restaurants will continue trading in the meantime.\nGBK’s managing director Derrian Nadauld said: “Given the challenging UK casual dining environment and over-rented UK restaurant estate, we are having to take tough but necessary actions to reduce our fixed cost base and restore long-term profitability.”\nStore closures at GBK would represent the latest in a long line of casual dining firms to shut restaurants this year. Read More Hope for fair trade pioneer Traidcraft after threat of closure\nGaucho, Hummus Bros, Prezzo, Byron and Jamie’s Italian have all fallen on hard times as costs have rocketed off the back of the Brexit-hit pound, while consumer confidence has nosedived as the economy falters.\nAlex Probyn, president of UK expert services at real estate adviser Altus Group, said: “There has been huge growth in the casual dining market, with restaurant numbers up 15% overall since 2010.\n“The race for space has pushed up rents impacting on rateable values. Extra tax for business rates coupled with rising food prices and staff costs through increases in both the national and minimum wages are creating a potentially lethal cocktail as margins are squeezed.”\nAt the time of its takeover in 2016, Famous Brands said that fears of a Brexit effect on the eating-out market “appear negligible”, adding that it would look to export the GBK brand to South Africa, and it initially had planned to double the size of the GBK portfolio. Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-10-24T18:10:00.000+03:00", "crawled": "2018-10-24T20:05:53.008+03:00", "highlightTitle": ""}