{"organizations": [], "uuid": "c09df87c1c2b9b9e5ca4c621d8f3ca420f0c7b56", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article1921395.ece/ALTERNATES/s1200/1_JS159922867.jpg", "site_section": "http://www.leicestermercury.co.uk/rss.xml", "section_title": "Leicestershire Live - frontpage", "url": "https://www.leicestermercury.co.uk/news/business/what-debenhams-said-asked-future-2147892", "country": "GB", "domain_rank": 48128, "title": "What Debenhams said when asked about future of Fosse Park store plans", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-26T06:00:00.000+03:00", "replies_count": 0, "uuid": "c09df87c1c2b9b9e5ca4c621d8f3ca420f0c7b56"}, "author": "Tom Pegden", "url": "https://www.leicestermercury.co.uk/news/business/what-debenhams-said-asked-future-2147892", "ord_in_thread": 0, "title": "What Debenhams said when asked about future of Fosse Park store plans", "locations": [], "entities": {"persons": [], "locations": [{"name": "fosse park", "sentiment": "none"}], "organizations": [{"name": "debenhams", "sentiment": "neutral"}, {"name": "fosse park", "sentiment": "neutral"}, {"name": "castle acres", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "What Debenhams said when asked about future of Fosse Park store plans Debenhams shutting 50 of its 166 branches, in a move expected to affect 4,000 jobs Share Click to play Tap to play The video will start in 8 Cancel Play now Get Business updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nDebenhams has refused to provide an update on whether a new store at Fosse Park will still go ahead or comment on the future of its Highcross shop, in the wake of a big closure announcement.\nAll the store chain would say was that it remained business as usual” prior to any significant announcement.\nYesterday, Debenhams announced it was shutting 50 of its 166 nationwide branches , in a move expected to affect 4,000 jobs.\nIt said the closures will take place over the next three to five years after posting a £491.5 million loss in the year to September – compared to a £59 million profit in 2017.\nA spokeswoman for Debenhams would not comment on the plans for the new branch in Castle Acres. How the Fosse Park extension at Castle Acres is expected to look\nThe £135 million extension to Fosse Park is going up on the site of the former Everards brewery.\nThe spokeswoman said: “We have identified up to 50 stores, accounting for under 15 per cent of total sales, which are currently profitable, but where do we not see a long term future and which we intend to exit over the next three to five years.\n“This is an ongoing five year programme and we are not disclosing a list of these stores.” Read More Work on Everards new brewery, beer hall and distillery could start early 2019\nIn September Debenhams said it was still going ahead with plans for the new multi-million pound branch south of the city – despite its financial problems.\nAt the time the business said it was continuing talks about the new store in Castle Acres, which would be one of nine new shops and six food outlets going up on the 12.5 acre site on the corner of Narborough Road and Soar Valley Way. Debenhams, Highcross\nOther big names moving onto the land are set to include TK Maxx, Clarks, and there will also be a flagship Next store.\nToday a spokeswoman for the Fosse Park owners the Crown Estate also refused to comment.\nDebenhams boss, Sergio Bucher, said: “It has been a tough year for retail in 2018 and our performance reflects that.\n“We are taking decisive steps to strengthen Debenhams in a market that remains volatile and challenging. Read More Norton Motorcycles boss Stuart Garner on Brexit - “UK better prepared than media has us believe”\n“We are taking tough decisions on stores where financial performance is likely to deteriorate over time.\n“Debenhams remains a strong and trusted brand with 19 million customers shopping with us over the past year. Artists impression of the new Next store planned for Fosse Park on the proposed Castle Acres Shopping Park\n“With a strengthened balance sheet, we will focus investment behind our strategic priorities and ensure that Debenhams has a sustainable and profitable future.”\nBack in September the Debenhams spokeswoman said: “As with all new stores, there is an extensive period of planning and building before we open the doors to customers.\n“We are currently working with Fosse Shopping Park owners The Crown Estate to finalise plans ahead of the store’s projected opening.”\nDebenhams already has a store in Highcross, Leicester, which has just undergone a major refit.\nOne of the conditions of the new Castle Acres store was that the Leicester branch must stay open for at least five years – to ensure the out of town shopping park doesn’t pull shops and shoppers out of the city centre. Like us on Facebook ", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/leicestermercury/subscriptions/&quot;}", "https://communicatoremail.com/IN/DCF/Ad9Bw6ZcmPSmMwDi7On4yR/"], "published": "2018-10-26T06:00:00.000+03:00", "crawled": "2018-10-26T08:45:24.015+03:00", "highlightTitle": ""}