{"organizations": [], "uuid": "be51a46363cf64d36dd34d20a207cb47f26838a6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15190354.ece/ALTERNATES/s1200/0_Police-officers-second-jobs.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/most-mps-needed-police-protection-15296992", "country": "GB", "domain_rank": 21960, "title": "Most MPs have needed police protection after extreme views created 'climate of fear'", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-21T07:00:00.000+03:00", "replies_count": 0, "uuid": "be51a46363cf64d36dd34d20a207cb47f26838a6"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/most-mps-needed-police-protection-15296992", "ord_in_thread": 0, "title": "Most MPs have needed police protection after extreme views created 'climate of fear'", "locations": [], "entities": {"persons": [{"name": "opperman", "sentiment": "none"}, {"name": "guy opperman", "sentiment": "none"}, {"name": "chroniclelive", "sentiment": "none"}], "locations": [], "organizations": [{"name": "conservative", "sentiment": "none"}, {"name": "hexham", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Most MPs have needed police protection after extreme views created 'climate of fear' North East MP Guy Opperman says 'extreme views' have created a 'climate of fear' and threats were made against him Share Get daily updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nA North East MP has revealed that he required police protection after threats were made against him - and said most MPs were in the same position.\nGuy Opperman, Conservative MP for Hexham , said “extreme views” were poisoning political debate and creating a “climate of fear”.\nAnd he condemned a recent Tweet by anti-EU campaigners Leave.EU, calling it an “incitement to violence”.\nMr Opperman told ChronicleLive : “Most Members of Parliament I know have had police protection at some time. I have.\n“There have been credible threats that the police have taken seriously, and more than one.” Guy Opperman (Image: Newcastle Chronicle)\nThe MP declined to give further details.\nHe condemned a Tweet by Leave.EU, which campaigned for Brexit in the 2016 EU referendum and is currently campaigning against the Government’s proposed “Chequers” deal with the EU.\nIt included a photograph of Prime Minister Theresa May with the words: “Enemy of Britain”.\nMr Opperman responded on Twitter highlighting the murder of Yorkshire MP Jo Cox in 2016.\nHe said: “Two years ago we lost our colleague #JoCox - murdered by a right wing extremist.\n“Every #MP i know is trolled, receives hate mail + sometimes need police protection. Disagree with us - but calling someone an “enemy of Britain” as u do is an incitement to violence.\n“Not acceptable.” Homeless man kicked in face as he slept\nAnd he told ChronicleLive: “I have no problem at all with people disagreeing with either my views or the views of any other elected representatives.\n“But first of all do it courteously and agree to disagree, in a way that social media seems to be losing track of.\n“Secondly and more importantly, don’t incite people to violence in circumstances where we lost one of our colleagues just two years ago, and where extreme views are poisoning political debate, creating a climate of fear and normalising aggression when we should be having reasoned debate.”\nHe was backed by Labour MP Catherine McKinnell, MP for Newcastle North.\nShe said: “I don’t agree with Guy on many things, but on this I do. Regardless of anyone’s views on Brexit and how it is being handled, using targeted inflammatory language like this against individual politicians is a very dangerous path to go down. Read More No-deal Brexit would do 'lasting damage' to North East, business leader says\n“One of my main concerns about Brexit is how destructive and divisive our politics has become over the last two years. This benefits absolutely no one.”\nA spokesman for Leave.EU said: “He’s using the tragic death of Jo Cox to shut down the debate on Brexit - he should know better.\n\"As he well knows, like any responsible organisation, we would never condone violence of any kind and to suggest other otherwise is deeply cynical.” Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-10-21T07:00:00.000+03:00", "crawled": "2018-10-21T12:11:09.032+03:00", "highlightTitle": ""}