{"organizations": [], "uuid": "c849f8c3194d44d12133bcef45eaebed0c2bbf51", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article12982251.ece/ALTERNATES/s1200/CFR_JNL_290915metrocentre_01.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/business-breakfast-live-eldon-square-15298224", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast RECAP: Eldon Square and Metrocentre sale moves closer after Intu offer", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-19T10:10:00.000+03:00", "replies_count": 0, "uuid": "c849f8c3194d44d12133bcef45eaebed0c2bbf51"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/business-breakfast-live-eldon-square-15298224", "ord_in_thread": 0, "title": "Business Breakfast RECAP: Eldon Square and Metrocentre sale moves closer after Intu offer", "locations": [], "entities": {"persons": [{"name": "clark", "sentiment": "none"}, {"name": "erik nielsen", "sentiment": "none"}, {"name": "betty", "sentiment": "none"}, {"name": "alex clark", "sentiment": "none"}], "locations": [{"name": "eldon square", "sentiment": "none"}, {"name": "new zealand", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "shotley brid", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}], "organizations": [{"name": "intu", "sentiment": "negative"}, {"name": "coreena ford north east", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford North East artist has turned animal paintings into global, multimillion-pound business\nArtist Alex Clark has drawn on her love of animals and wildlife to create a multimillion-pound business – and her latest creation is proving priceless.\nMs Clark’s paintings and drawings of farm animals, birds, cats and dogs and other wildlife are instantly recognisable in gift shops and bigger outlets around the UK and beyond on everything from cards and magnetic bookmarks to pottery, notepads and other collectables.\nHer artwork is also becoming popular around the world, thanks to wholesalers and retailers as far afield as Canada, Australia and New Zealand.\nNow fans can snap up cards featuring one of the Northumberland artist’s own pets, as she and partner – and fellow director in the business – Erik Nielsen have just released a special Christmas card for the National Trust featuring one of their three beloved family dogs, Betty.\nIt marks the latest starring role for her pets in a growing career which has led from trade fairs to a £2.5m turnover enterprise.\nBrought up near Shotley Bridge, on the border between County Durham and Northumberland, Ms Clark used to exhibit her animal drawings and paintings at the annual Snod’s Edge Art Show when she was a teenager. While studying biology at Newcastle University she sold her artwork to fund her degree, mainly by painting pet portraits.\nAfter graduating, she focused on selling her work in craft fairs, quickly migrating to large national events as her work grew in popularity.\nToday, she has a 15,000sqft warehouse in Consett, County Durham, and employs more than 20 staff in warehousing, packaging, admin and sales roles.\nThere are also retail outlets in Corbridge and Stanhope, with sales growing thanks to the business acumen of her long-term partner and co-director Erik Nielsen.\nMr Nielsen, who ran a reproduction art print and card distribution business in Scotland and Northern Ireland, met Ms Clark in 2002 when he acted as her Scottish agent. Alex Clark the artist (Image: (C)The Bigger Picture Agency Ltd) 8.52 Coreena Ford Spectacular new CGIs of the £250m 'Gateshead Quayside arena' are released\nSpectacular new designs have been unveiled for a “game-changer” arena and leisure complex on the Gateshead Quayside.\nPlans to open a 12,500 seat venue on a 10-acre site between the Sage and the Baltic were first revealed last year, and have now been labelled one of the most exciting developments in the country by the government.\nConstruction of the new venue was first expected to be completed by 2021, but that target date has now been pushed back to early 2023.\nCoun Martin Gannon, Gateshead Council leader, said: “Gateshead Quayside speaks for itself but there are still things to be done. What would you put between Norman Foster’s Sage Gateshead, BALTIC Centre for Contemporary Art and the Gateshead Millennium Bridge?\n“It needs to be as innovative and striking as the suite of visionary waterfront developments that have went before so together with our development partners and architects HOK, we have come up with this.\n“It is one of the most exciting development opportunities in the UK today I think it’s absolutely the right thing to do in this location. This is a game-changer not just for Gateshead but for the region.” 8.45 Coreena Ford Amazon creates 1,000 jobs in UK\nAmazon is to open a new office in Manchester as part of plans to create more than 1,000 research and development jobs across the country.\nThe new site will be located in the city’s Hanover Building in the Northern Quarter, which is set to house 600 highly-skilled workers focusing on software development, machine learning and R&D.\nAs part of the recruitment drive, the online titan will also beef up numbers at its “development centres” in Edinburgh and Cambridge, with the cities seeing 250 and 180 jobs created respectively.\nDoug Gurr, Amazon’s UK country manager, said:\nWith the UK taking a leading role in our global innovation, we are delighted to announce plans to create capacity for over 1,000 new highly-skilled roles across the country.\nThese are Silicon Valley jobs in Britain, and further cement our long-term commitment to the UK.\nThe Edinburgh expansion will see Amazon take three floors in the Waverley Gate building, where the new recruits will work on advertising technology and personalised shopping. In Cambridge, there will be a focus on Amazon devices, such as the Echo.\nSince 2010, Amazon said it has invested more than £9.3 billion in the UK to build and run its operations, and is on course to grow to 27,500 employees. An Amazon sign (Image: PA Wire) 8.40 Coreena Ford No-deal Brexit would do 'lasting damage' to North East, business leader says\nA no-deal Brexit would be a “wholly unacceptable” outcome that would do “lasting, permanent damage” to the North East economy, a regional business leader has said.\nJohn McCabe, president of the North East England Chamber of Commerce, said politicians needed to act with urgency to deliver a Brexit that “puts national interest ahead of personal ambition or party political expediency”.\nMr McCabe was speaking at a meeting of many of the region’s top business leaders, with his warning on Brexit coming as other business groups have expressed concerns over the continuing chaos in the Brexit negotiations.\nMr McCabe said a recent Chamber survey of North East businesses had provided “indisputable evidence” that Brexit was holding back many firms in the region.\nBut he said the recent party conference season had shown parties more interested in their own internal squabbling than addressing one of the biggest challenges facing the UK in decades. North East England Chamber of Commerce president John McCabe (Image: handout from North East England Chamber of Commerce) 8.35 Revealed: Winners of the Dynamites 18 Awards\nThe North East celebrated its IT superstars at a glittering awards ceremony last night.\nThe fifth Dynamites 18 Awards recognised the established and future stars of a hugely important sector in the region’s economy at the Newcastle Civic Centre’s Banqueting Hall.\nMore than 480 people attended the event, sponsored by Newcastle College, which were hosted by North East actor Daymon Britton, and organised by Dynamo, the industry-led initiative focused on growing’s the region’s tech sector.\nAnd the winners are:\nOutstanding Achievement - Tristan Watson, Lyndsey Britton, Paul Smith (Ignite / Campus North / Tech for Life / Newcastle Tech Trust\nInnovator of the Year - metrology software products. Highly commended CognAssist\nGrowth Explosion - Atlas Cloud\nRising Star - Jenny Jones, HMRC\nSkills Developer - Emma Garrick, The Central Exchange. Special commendation Liam Swinney from Bede Gaming\nCollaborator of the Year - NECA Digital Leads\nTech for Good - Learning Labs. Highly commended - Equiwatt\nNew Business of the Year - Nebula Labs\nInternational Success Story - Nomad Digital\nProject of the Year – Corporate Datatrial - Northern Alliance Advanced Therapy Treatment Centre\nProject of the Year – Public Sector/Not for Profit - Gateshead Council - PROTO: The Emerging Technology Centre\nPeople’s Choice Tristan Watson, Lyndsey Britton, Paul Smith (Ignite / Campus North / Tech for Life / Newcastle Tech Trust\n2nd place Oak Internet Winners of the Dynamites 2018 awards 8.25 What's the FTSE latest?\nThe FTSE-100 index opened at 7026.99.\nThe pound at 8am was 1.3032 dollars compared to 1.3060 dollars at the previous close. The euro at 8am was 0.8793 pounds compared to 0.8797 pounds at the previous close. London Stock Exchange (Image: PA) 8.20 Coreena Ford Newcastle's Nixon Hire invests in its business after marking 50th anniversary\nIndustrial equipment company John Nixon Limited ploughed significant investment into its business after boosting sales above £60m .\nThe firm, which trades as Nixon Hire, spent £26.9m on new plant, its transport fleet and general infrastructure last year – more than £10m more than the previous year – having racked up a 9.3% increase in sales to £61.8m.\nHeadquartered on Scotswood Road, Newcastle, the former North East Company of the Year winner also last year marked 50 years since it was first formed by John Nixon as a plant hire operation with room to service no more than three machines at a time.\nSince then the firm has grown to become one of the most established companies in its sector, with depots across the North East, Scotland and Cumbria and further afield, providing plant, tools, accommodation units, portable toilets and site equipment for hire.\nAccounts for 2017 show the firm’s pre-tax profit fell from £5.9m to £3.9m, largely as a result of maintenance and refurbishment costs to keep its fleet up to date, and an increase in depreciation charges due to expansion of the fleet.\nWithin its strategic report, the directors highlight how the firm concentrated on generating new business, which served up the jump in turnover.\nDuring the year the firm also consolidated its Bradford and Wakefield depot operations into a full service depot in Castleford. A year earlier, in December 2016, the firm also bought a number of assets from the administrator of Hewden Plc, also taking on several new employees, and that depot has now integrated into the business and is adding growing revenues.\nHeadcount also grew within the business, from 435 to 468. Nixon Hire has made a Nottingham acquisition (Image: Nixon Hire) 8.10 KEY EVENT Shares soar in Intu as Eldon Square and Metrocentre deal moves closer\nShares in the owners of Eldon Square and Metrocentre have soared this morning after a deal to buy its owner Intu moved closer.\nIntu Properties shares have risen to 202.20 - a rise of 14% - following an announcement that a consortium led by property tycoon John Whittaker has made a potential offer for Intu.\nThe group - Peel Group, the Olayan Group and Brookfield Property Group- have now been given access to more data on the company ahead of a Nov 1 offer deadline. The price now 215p a share, or 210.4p excluding dividends.\nJohn Whittaker ’s Peel Group – owners of the Durham Tees Valley Airport among a raft of other property and transport investments – is leading the group to take control of the shopping centre company, and take it private.\nMr Whittaker is deputy chairman of Intu and Peel Group holds around 27% in the shopping centre firm, while Olayan holds about 3.5%.\nIn the stockmarket announcement, Intu said:\nintu confirms that on 11 October 2018 it received an indicative proposal from the Consortium of 205 pence per share in cash, subject to an adjustment for dividends.\nThe independent committee formed by intu (comprising all directors of intu other than John Whittaker, who is connected to the Consortium)and its financial advisers met to consider the Indicative Proposal.\nFollowing further engagement, on 17 October 2018 intu received a revised indicative proposal from the Consortium of 215 pence per share in cash, subject to an adjustment for dividends.\nAccordingly, should any offer on the terms of the Revised Indicative Proposal be forthcoming the consideration would be 210.4 pence per share\nIn order to advance discussions regarding the possible announcement of a firm offer, the Independent Committee has resolved to grant the Consortium access to certain due diligence materials. A further announcement will be made when appropriate. Intu Eldon Square (Image: Tony Hall Photography) More On", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/15298224;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-10-19T10:10:00.000+03:00", "crawled": "2018-10-19T12:15:49.008+03:00", "highlightTitle": ""}