{"organizations": [], "uuid": "8ec42d0f07fe9164890e4a4f5b4d8e000cf19508", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15150813.ece/ALTERNATES/s1200/0_SGP_NEC_150818RESPECT07seqnJPG.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/hate-crime-increases-north-east-15286646", "country": "GB", "domain_rank": 21960, "title": "Hate crime increases in the North East as police record 11 incidents every day", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-17T07:00:00.000+03:00", "replies_count": 0, "uuid": "8ec42d0f07fe9164890e4a4f5b4d8e000cf19508"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/hate-crime-increases-north-east-15286646", "ord_in_thread": 0, "title": "Hate crime increases in the North East as police record 11 incidents every day", "locations": [], "entities": {"persons": [{"name": "brex", "sentiment": "negative"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "northumbria", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "cleveland", "sentiment": "none"}], "organizations": [{"name": "home office", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Hate crime increases in the North East as police record 11 incidents every day Home Office says Brexit and terrorism may be connected to increase in hate crime Share Northumbria Police officers (Image: Newcastle Chronicle) Get daily updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nIncidents of hate crime have increased once again in the North East .\nThere were 4,148 hate crimes recorded by North East police forces over 12 months, new official figures show.\nThat's around 80 incidents every week.\nAnd it's a significant increase from 3,450 incidents last year - and 2,191 incidents the year before that.\nIt means the number of hate crimes has increased by 90 per cent over two years.\nThe picture in the North East is similar to the rest of the country, where hate crime has also increased.\nAccording to the Home Office, the rise may be connected to Brexit and to incidents of terrorism.\nThe figures include hate crimes recorded by Northumbria, Cleveland and Durham forces.\n\"I've been called a terrorist\" - Hate crime victim speaks out at gathering\nOf the 4,148 hate crimes over the past year, 2,559, were recorded by Northumbria Police. There were 711 in the Durham police area and 878 recorded by Cleveland police.\nThe figures show there were 2,980 hate crimes in the North East region where race was a factor.\nPolice recorded 340 hate crimes where religion was a factor, 456 involving sexual orientation, 452 where disabled people were targeted and 97 where the victim was transgender. Increase may be connected to terrorism and Brexit\nAccording to the Home Office, the rise in numbers across the country may be partly down to the police doing a better job of recording incidents - but there have also been real increases which appear to be connected to terrorism and to Brexit.\nA Home office report said: \"In 2017/18, there were 94,098 hate crime offences recorded by the police in England and Wales, an increase of 17% compared with the previous year.\n\"This continues the upward trend in recent years with the number of hate crimes recorded by the police having more than doubled since 2012/13 ... this increase is thought to be largely driven by improvements in police recording, although there has been spikes in hate crime following certain events such as the EU Referendum and the terrorist attacks in 2017.\"\nHate crime is defined as \"any criminal offence which is perceived, by the victim or any other person, to be motivated by hostility or prejudice towards someone based on a personal characteristic\". Government announces new measures to fight hate crime\nThe Government announced plans to review the law to consider whether crimes sparked by hostility to women or to men, or prejudice against the elderly, should be considered hate crimes.\nThe Home Office has tasked the Law Commission to carry out a review of current hate crime laws as part of a series of new measures.\nThe review is expected to be published by the end of next year.\nIt forms part of a refreshed strategy aimed at improving the response to hate crimes and incidents.\nNew measures include taxi drivers and door staff being given guidance on spotting hate crime. Home Secretary Sajid Javid (Image: PA)\nAdvice will be included in the Department for Transport's best practice guidance on taxi and private hire vehicle licensing, which is scheduled to be updated in 2019 and will be considered for adoption by all 293 licensing authorities in England, the document says.\nIt also notes that new guidance for door supervisors sets out how they can ensure transgender people can have a safe and enjoyable time going to pubs, clubs, festivals and events.\nThe updated action plan is being published as the Home Office releases the latest annual statistics on hate crime in England and Wales.\nHome Secretary Sajid Javid said: \"Hate crime goes directly against the long-standing British values of unity, tolerance and mutual respect - and I am committed to stamping this sickening behaviour out. Read More League of shame: The worst places for hate crime in Newcastle revealed\n\"Our refreshed action plan sets out how we will tackle the root causes of prejudice and racism, support hate crime victims and ensure offenders face the full force of the law.\"\nOther new measures include a nationwide public awareness campaign, extra funding to support communities and specialist training for police call handlers.\nThe Government is also set to unveil proposals for future legislation to tackle illegal and harmful online content.\nCommunities Secretary James Brokenshire said: \"It is completely unacceptable that anyone should live in fear of intimidation and violence because of their beliefs or the colour of their skin.\n\"We must challenge prejudice and intolerance, whenever and wherever it appears in our society.\" Increase is a 'wake up call', says Labour\nDiane Abbott MP, Labour’s Shadow Home Secretary, said: \"The fact that hate crime has more than doubled in the last five years must serve as an urgent wake up call. We must stand up to hatred and discrimination wherever it is found.\" Shadow Home Secretary Diane Abbott (Image: Getty Images)\nMs Abbott said: \"The Tories promised to tackle burning injustices but they are clearly not tackling the injustice of people being attacked simply because of their religion, sexuality, the colour of their skin or their disability.\n\"Tory cuts to the police continue to undermine the fight against crime. Labour will hire 10,000 extra police officers to work in the community to help tackle all forms of hate crime.\" Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-10-17T07:00:00.000+03:00", "crawled": "2018-10-17T09:44:10.012+03:00", "highlightTitle": ""}