{"organizations": [], "uuid": "f188c7d70f7f6cb175ea7ebfab4a4f283945dd41", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15222054.ece/ALTERNATES/s1200/0_BELGIUM_Brexit_140220.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/businesses-not-preparing-brexit-warns-15221867", "country": "GB", "domain_rank": 21960, "title": "Businesses are not preparing for Brexit, warns Newcastle tech giant Sage", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-01T14:59:00.000+03:00", "replies_count": 0, "uuid": "f188c7d70f7f6cb175ea7ebfab4a4f283945dd41"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/businesses-not-preparing-brexit-warns-15221867", "ord_in_thread": 0, "title": "Businesses are not preparing for Brexit, warns Newcastle tech giant Sage", "locations": [], "entities": {"persons": [{"name": "yougov", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "invalid email newcastle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Businesses are not preparing for Brexit, warns Newcastle tech giant Sage Lack of information around Brexit is causing firms to delay important changes to their operations Share Click to play Tap to play The video will start in 8 Cancel Play now Get business updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nNewcastle tech giant Sage has warned that businesses across the UK and Europe are at risk of taking a major hit to their productivity because of Brexit.\nResearch commissioned by the firm and carried out by YouGov suggests that two-thirds of businesses are delaying important Brexit preparations because of a lack of clarity surrounding the negotiations.\nThe survey reports that 57% of businesses in the UK say they will need to adapt their processes because of Brexit, but two-thirds have yet to make any of the necessary changes.\nMany of those contacted said the reason they had not made these crucial changes was because of a lack of information and clarity around important factors that would influence their decisions.\nOn average businesses expect it will take 15 months to prepare for Brexit, but a third of firms questioned are unsure how long it would take to prepare.\nSabby Gill, managing director UK and Ireland, Sage said: “Our research clearly shows that this current lack of both certainty and clarity is leading to a delayed investment in better equipping UK businesses to operate post Brexit. Most alarmingly, the data shows that the time these businesses will need to implement the changes necessary, will significantly exceed the no-deal deadline date. Sabby Gill (Image: Sage)\n“Businesses of all sizes are crying out for clarity and politicians need to prioritise providing guidance and support to help business continue to export and trade post-Brexit - whatever the scenario.\n“Earlier this year, Sage found that small and medium-sized businesses already spend an average of 120 working days per year on administrative tasks and we cannot risk placing additional pressure on the productivity crisis.\n“The UK Government has an important role to play in paving the way for continued growth throughout this transitional period, helping British businesses make considered decisions and securing a competitive future economy.” Read More Gateshead designer launches new clothing brand The Lone Wolf Pack\nThe research also found that the biggest impact of Brexit so far had been a hit to business confidence. 45% of UK firms reported a hit to business confidence, but the figure rose to 53% among companies that trade in Europe.\nLarger companies are also more anxious about their trading prospects, as 27% of start-ups claiming they felt less exposed to the effects of Brexit. Britain's Secretary of State for Exiting the European Union Dominic Raab, left, and EU chief Brexit negotiator Michel Barnier (Image: AP)\nSage’s survey is not the only research warning about the lack of readiness among the business community.\nLast week, the British Chambers of Commerce warned that almost two out of three companies are not preparing for Brexit while manufacturers’ organisation EEF said earlier today that manufacturers have “sharply applied the brakes” to investment plans amid the growing political uncertainty. Read More\nLast month the North East England Chamber of Commerce said almost half of companies in the region are not ready for Brexit, while even more think it will be bad for them.\nThe Department for Exiting the EU has been contacted for comment. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-10-01T14:59:00.000+03:00", "crawled": "2018-10-01T17:22:03.000+03:00", "highlightTitle": ""}