{"organizations": [], "uuid": "401c9a39077250c4262c321a28da16a4d18bb4e2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15339441.ece/ALTERNATES/s1200/0_Spring-Statement.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/budget-announcement-2018-live-what-15341595", "country": "GB", "domain_rank": 21960, "title": "Budget Announcement 2018 LIVE: What time is the Chancellor's speech today and what are the predictions?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-29T09:41:00.000+02:00", "replies_count": 0, "uuid": "401c9a39077250c4262c321a28da16a4d18bb4e2"}, "author": "Katie Collings", "url": "https://www.chroniclelive.co.uk/news/north-east-news/budget-announcement-2018-live-what-15341595", "ord_in_thread": 0, "title": "Budget Announcement 2018 LIVE: What time is the Chancellor's speech today and what are the predictions?", "locations": [], "entities": {"persons": [{"name": "katie collings", "sentiment": "negative"}, {"name": "matt hancock", "sentiment": "none"}, {"name": "hammond", "sentiment": "none"}, {"name": "hancock", "sentiment": "none"}, {"name": "philip hammond", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "budget", "sentiment": "negative"}, {"name": "nhs", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "bbc radio", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "16:46 Minimum Wage increase\nFrom April 2019, the National Living Wage (for those over 25) will rise by 4.9%, from £7.83 to £8.21 an hour. 16:41 Money for Universal Credit\nOn to the much-criticised Universal Credit, and the Chancellor announced a £1 billion package of measures over five years to support Universal Credit, and said he was increasing work allowances in Universal Credit by £1,000 a year at a cost of £1.7 billion annually, helping 2.4 million working families with children and people with disabilities by £630 per year. 16:37 Key Event Beer, cider and spirit tax frozen — but not for wine\nDuty on beer, cider and spirits frozen for the next year, saving 2p on a pint of beer, 1p on a pint of cider, and 30p on a bottle of Scotch or gin compared tothe inflation assumption in the OBR forecast.\nDuties on wine to rise in line with RPI inflation and white ciders to be taxed at a new higher rate. 16:35 Tom Eden Financial boost for high streets\nA £650 million Future High Streets Fund - co-funded by the Government to help councils improve high streets - has also been announced. 16:33 Tom Eden £37m for Northern Powerhouse rail\n£37 million of additional development funding for Northern Powerhouse Rail: 16:30 Tom Eden More money for Housing Infrastructure Fund\nMr Hammond announces a further £500 million for the Housing Infrastructure Fund, designed to unlock a further 650,000 homes; a new wave of strategic partnerships with nine English Housing Associations to deliver 13,000 homes; up to £1 billion of British Business Bank guarantees to support smaller housebuilders. 16:28 Tom Eden 16:25 Tom Eden Relief on toilet tax\nNew mandatory business rates relief for all public lavatories made available for public use, whether publicly or privately owned. 16:24 Tom Eden More reaction to the school funding announcement\nA number of MPs on the opposition benches responded angrily after Mr Hammond announced an additional £400 million to allow schools to “buy the little extras they need”.\nFormer Green Party leader Caroline Lucas said:\n“Cannot believe how out of touch this Government is. Schools don’t just need money for “little extras” - they are struggling to pay staff, upkeep buildings and provide vital support to children with special needs.”\nAnd Labour MP Jess Phillips posted:\n“Phil my kids school is talking about shutting early on Fridays because they can’t staff it. It’s not because they don’t have footballs. FFS (the F is not fiscal).” Northumbria Police Tom Eden Police commissioner responds to budget\nReacting to today’s budget, Dame Vera Baird QC, Police and Crime Commissioner for Northumbria Police said:\n“Ironically, Home Office questions were immediately before the Chancellor’s speech and his budget has done absolutely nothing to support policing.\nAusterity continues to be felt in every police station, by those on the frontline to those dealing with newer, emerging crimes such a cybercrime and child sexual exploitation.\n“This budget was the ideal opportunity for the Chancellor to give forces like Northumbria the resources needed to deliver the services expected by local residents now.\n“I am working hard to maintain neighbourhood policing, I had hoped that the Chancellor would have made extra money available to recruit more police officers - he didn’t.\n“The tide hasn’t turned, the cuts are continuing – despite the Prime Minister’s belief that austerity is ending, we see no light at the end of the tunnel.\n“The Chancellor has failed today, so it is up to others to sort this Tory funding mess. I am calling upon the Home Secretary to bring together a cross party group that will focus on devising a fair funding formula, that ensures forces like Northumbria who have received the biggest reduction in funding from government are at the table.\n“I stand ready to serve on this group, to ensure a fair and transparent funding package is delivered that puts our communities first”. 16:18 Tom Eden\nThis is the response from Labour’s Twitter account on the news of some additional money for schools: 16:17 Tom Eden\nA new tax is to be introduced, attempting to target the tech giants: 16:14 Tom Eden Start-up loan extension but levy reduced\nStart-Up Loans funding to be extended to 2021, helping 10,000 entrepreneurs. Contribution of smaller firms to apprenticeship levy to be reduced from 10% to 5%. 16:11 Tom Eden\nThis from Jonathan Walker (a different Jonathan to our politics editor - this one is from the North East England Chamber of Commerce.) 16:09 Tom Eden PFI schemes no longer to be used\nThe Chancellor has announced that the Government is abolishing the use of Private Finance Initiative and PFI2 schemes for future projects.\nThis is a former treasury adviser: 16:09 Tom Eden Money for schools\nHammond announced a £400 million in-year bonus to help schools buy kit - a one-off capital payment direct to schools worth an average of £10,000 per primary and £50,000 per secondary. 16:07 Tom Eden What we know so far\nPhilip Hammond told MPs that “austerity is finally coming to an end” as he hailed a significant improvement in public finances.\nThe Chancellor said the Office for Budget Responsibility (OBR) expected “resilient” growth over the coming years.\nIn the final scheduled Budget before Brexit, Mr Hammond announced am extra £500 million for preparations.\nAnd he hinted that an emergency Budget could take place in the Spring, adding: “If the economic or fiscal outlook changes materially in-year I reserve the right to upgrade the Spring Statement to a full fiscal event”.\nIn a boost for Mr Hammond: The OBR upgraded its forecast for GDP growth in 2019 from 1.3% to 1.6%, then 1.4% in 2020 and 2021; 1.5% in 2022; and 1.6% in 2023. Borrowing this year will be £11.6 billion lower than forecast at the Spring Statement, at 1.2% of GDP, and is then set to fall from £31.8bn in 2019/20 to £26.7bn in 2020-21, £23.8bn in 2021/22, £20.8bn in 2022/23 and £19.8bn in 2023/24. Debt peaked in 2016/17 at 85.2% of GDP and then falls in every year of the forecast from 83.7% this year; to 74.1% in 2023/24, allowing the Government to meet its target to get debt falling three years early.\nMr Hammond said his Budget was aimed at helping “the strivers, the grafters and the carers” and would pave the way for a “brighter future”.\nHis comments come after Prime Minister Theresa May promised she was ending years of austerity.\nMr Hammond told MPs: “The era of austerity is finally coming to an end.”\nDowning Street has insisted that the Budget’s spending announcements are fully funded, regardless of whether the UK secures a Brexit deal, in what has been viewed as a rebuke to the Chancellor.\nMr Hammond warned at the weekend that his economic plans depend on a successful outcome to the Brexit negotiations with Brussels.\nChancellor of the Exchequer Philip Hammond puts the finishing touches to his Budget speech (Chris Ratcliffe/PA)Speaking in the Commons Mr Hammond said he was promising a “Budget for hard-working families” and told MPs “we have reached a defining moment on this long, hard journey” after repairing the damage to the public finances caused by the financial crash.\nOn Brexit, he said the UK was reaching a “pivotal moment” in the negotiations and said that a “deal dividend” would provide a boost to the economy if an agreement with Brussels could be reached.\nIn an indication of the threats facing the UK, Mr Hammond promised an extra £1 billion to the Ministry of Defence and £160 million to fund counter-terrorism policing.\nHe also promised extra funding for health and social care - confirming extra cash for mental health services and £650 million for English councils struggling to cope with rising care bills. 16:05 Tom Eden\nA response to the defence spending increase, from Northumberland Conservative MP Anne-Marie Trevelyan 16:04 Tom Eden Government funding for air ambulances\nAir ambulance services in England to receive £10 million in state funding, Philip Hammond says. 16:03 Tom Eden\nRSM, an accountants firm with a Newcastle office, have this to say on cyber-security spending: 16:03 Tom Eden Defence and counter terrorism announcement\nAn additional £1 billion for the Ministry of Defence in the period to the end of next year to boost cyber capabilities and anti-submarine warfare capacity andmaintain the pace of the Dreadnought programme.\nThere will also be an additional £160 million in funding for counter-terrorism police for 2019/20. 16:02 Tom Eden NHS announcement\nThe Chanchellor (re)announces a £20.5 billion real terms increase for the NHS over the\nnext five years, adding that the NHS 10-Year Plan will include a new mental health crisis service, with comprehensive mental health support available in every major A&E, children and young peoples’ crisis teams in every part of the country, more mental health ambulances, more “safe havens” in the community and a 24-hour mental health crisis hotline. 15:59 Jonathan Walker\nChancellor Philip Hammond says Home Secretary Sajid Javid will “review police spending power and further options for reform” when he presents police settlement in December\nIn other words - no extra police cash promised right now. And “options for reform” sounds a lot like government looking at options other than simply increasing central government grant 15:58 Tom Eden 'Debt peaked last year'\nThe OBR confirms that debt peaked in 2016/17 at 85.2% of GDP and then falls in every year of the forecast from 83.7% this year; to 74.1% in 2023/24 - lower in every year than forecast at the Spring Statement - allowing the Government to meet its target to get debt falling three years early. 15:57 Tom Eden Newcastle MP on 'jobs miracle'\nHere’s Chi Onwurah on Philip Hammond’s apparent ‘jobs miracle’: 15:55 Tom Eden Defecit expected to fall\nHammond continues, saying that the OBR forecasts that the deficit will be less than 1.4% next year, falling to just 0.8% by 2023/24.\nBorrowing this year will be £11.6 billion lower than forecast at the Spring Statement, at 1.2% of GDP, and is then set to fall from £31.8bn in 2019/20 to £26.7bn in 2020-21, £23.8bn in 2021/22, £20.8bn in 2022/23 and £19.8bn in 2023/24.\nMr Hammond said he is predicted to meet his structural borrowing target three years early, with borrowing of 1.3% of GDP in 2020/21, maintaining £15.4 billion headroom. 15:54 Jonathan Walker\nHammond announces £650m for cash-strapped local councils nationwide to spend on social care next year 15:54 Key Event 800,000 new jobs by 2023, OBR predicts\nPhilip Hammond reports that the OBR predicts 800,000 more jobs by 2023, which would mean 4.2 million net new jobs since 2010.\nThey also think that there will be wage growth in each of the next five years. 15:52 Tom Eden\nHere’s the treasury with their growth forecast in a graph: 15:51 Tom Eden OBR forecasts\nHammond turns to the OBR economic forecasts.\nThey say that growth has been revised up from the forecast 1.3% growth forecast for next year up to 1.6%.\nThe next few years’ growth forecast are as follows: 1.4% in 2020 and 2021 1.5% in 2022 15:45 Tom Eden Brexit “double deal dividend”\nGetting the Brexit deal right will deliver a “double deal dividend”, said Hammond. But he also announced an additional £500 million for no-deal preparations.\nHammond said he was maintaining the headroom to provide firepower to intervene if the economy needs more support in the coming months, and retaining the right to upgrade the Spring Statement to a full Budget. 15:43 Tom Eden\nReferencing moving the Budget from Wednesday (Halloween) to today, Hammond cracks a joke saying that, because he’s been invited to the Tory Party’s 1922 Comittee meeting of backbench MP, he hasn’t avoided blood-curdling screams and moving furniture. 15:42 Jonathan Walker\n“Britain’s jobs miracle is set to continue” says Hammond 15:41 Key Event 'The era of austerity is coming to an end'\n“The era of austerity is finally coming to an end” continues Hammond, due to the public’s hard work. 15:37 Tom Eden Austerity not driven by ideology, Hammond claims\nHammond, to huge jeers from the Labour side of the house, says the past eight years of austerity weren’t motivated by ideology. 15:36 Tom Eden\nGetting the cliches in early 15:36 Jonathan Walker ", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/15341595;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-10-29T09:41:00.000+02:00", "crawled": "2018-10-29T12:03:53.002+02:00", "highlightTitle": ""}