{"organizations": [], "uuid": "d5d1428d3ea13747d31c446f6c08cc97ab212d3d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14608018.ece/ALTERNATES/s1200/TMP_NEC_050216Trevelyan_04JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/mp-calls-hadrians-forest-planted-15267437", "country": "GB", "domain_rank": 21960, "title": "MP calls for 'Hadrian's forest' to be planted on the border between Scotland and England", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-12T10:00:00.000+03:00", "replies_count": 0, "uuid": "d5d1428d3ea13747d31c446f6c08cc97ab212d3d"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/mp-calls-hadrians-forest-planted-15267437", "ord_in_thread": 0, "title": "MP calls for 'Hadrian's forest' to be planted on the border between Scotland and England", "locations": [], "entities": {"persons": [{"name": "hadrian", "sentiment": "negative"}, {"name": "ronnie campbell", "sentiment": "none"}, {"name": "anne-marie trevelyan", "sentiment": "none"}], "locations": [{"name": "england", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}], "organizations": [{"name": "house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MP calls for 'Hadrian's forest' to be planted on the border between Scotland and England Rather than keeping Scots out, the forest would be for Scots and English to nurture together Share An MP has called for a forest to be planted on the border between Scotland and England border (Image: TV Grab) Get daily updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nA forest should be planted on the border between England and Scotland, according to a Northumberland MP.\nBut unlike Hadrian’s Wall, built in northern England to keep out the Picts, the aim would be to create something for Scots and the English to care for together, and to protect the environment.\nThe idea came from Northumberland MP Anne-Marie Trevelyan, who said the forest could be part of the Borderlands initiative, a government scheme to encourage co-operation between northern England and the south of Scotland. Read More MP Ronnie Campbell taunts Theresa May over rising national debt\nSpeaking in the House of Commons, the Conservative MP told Agriculture Minister George Eustace: “I ask the Minister to consider, as part of the Borderlands initiative, planting a borderlands forest as part of our meeting our tree-planting targets - not so much a wall dividing us from our Scottish colleagues, but a biodiverse habitat that the English and the Scots can nurture together.”\nTrees would help reduce climate change caused by carbon dioxide, she said. Conservative MP for Berwick Anne-Marie Trevelyan (Image: Newcastle Chronicle)\n“Timber absorbs carbon dioxide as it grows and then holds that carbon a second time as wood products.”\nMrs Trevelyan also predicted that Northumberland farmers would benefit from a reduction in red tape after the UK leaves the EU. Read More Government accused of risking another Windrush scandal with new housing rules\n“We will at last be able to create management and financial incentives to suit our needs and this Government’s long-term commitment to looking after our whole environment.\n“We will be designing a system that does not funnel funds to our farmers’ foreign competitors, but frees up our land stewards to innovate; a system that supports a holistic perspective of land management, which puts long-term soil health, food production and water basin management with tree planting; and a system that incentivises long-term investment for public and economic good.”\nBut Helen Goodman, Labour MP for Bishop Auckland, told the House of Commons that she was concerned by reports that the Government was drawing up contingency plans to slaughter sheep after Brexit, due to fears it may not be possible to take the animals to slaughterhouses across the Channel.\nThe MP, whose constituency includes 400 sheep-farmers, asked whether reports “that large numbers of sheep will have to be slaughtered in the event of no deal” is correct. Read More North East MPs back Gordon Brown's call to halt roll-out of Universal Credit\nEnvironment Secretary Michael Gove said he “did not recognise” the report.\nHe said: Sheep do have to be slaughtered eventually to ensure that upland farmers and sheep farmers more broadly can get a fair price for the sheepmeat they produce.\n“Indeed, our Bill has specific provisions to ensure that all farmers get a fair price in the market and that we can intervene where necessary to safeguard their economic interests.” Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-10-12T10:00:00.000+03:00", "crawled": "2018-10-12T10:17:23.007+03:00", "highlightTitle": ""}