{"organizations": [], "uuid": "879e355681c29b6787dcf86ceaac5e618a098717", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15247452.ece/ALTERNATES/s1200/0_Peoples-Vote-rally-in-Sunderland.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/hundreds-march-peoples-vote-brexit-15246569", "country": "GB", "domain_rank": 21960, "title": "Hundreds march for a 'people's vote' on Brexit at rally in Sunderland", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-06T19:37:00.000+03:00", "replies_count": 0, "uuid": "879e355681c29b6787dcf86ceaac5e618a098717"}, "author": "Kali Lindsay", "url": "https://www.chroniclelive.co.uk/news/north-east-news/hundreds-march-peoples-vote-brexit-15246569", "ord_in_thread": 0, "title": "Hundreds march for a 'people's vote' on Brexit at rally in Sunderland", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "neutral"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "keel square", "sentiment": "none"}, {"name": "mowbray park", "sentiment": "none"}], "organizations": [{"name": "sunderland campaign", "sentiment": "neutral"}, {"name": "sunderland news hundreds", "sentiment": "neutral"}, {"name": "eu", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "rally in sunderland", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Hundreds march for a 'people's vote' on Brexit at rally in Sunderland Campaign group NE4EU say they are 'terrified' by the way the government is handling the Brexit negotiations and the impact there will be on Sunderland Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nHundreds of people gathered for a People's Vote March and Rally in Sunderland after claims the \"tide is turning\" in the former Leave capital.\nOrganised by NE4EU (North East 4 Europe), the march left Mowbray Park and made its way to Keel Square for a rally, where activists were met by a counter protest calling for 'respect' for the decision to leave the EU.\nThe crowds were addressed by politicians, North East hospital doctors and a Veterans for Europe ex-serviceman.\nThe group, which is campaigning to keep strong links with the EU, say they are responding to a growing realisation on Wearside that Brexit is turning out to be a bum deal that will seriously damage jobs, prosperity and public services in the region\n. The People's Vote March and Rally takes place in Sunderland City Centre led by Conservative MP Anna Soubry and Newcastle North MP Catherine McKinnell (Image: Newcastle Chronicle)\nIt was led by Conservative MP Anna Soubry , who has challenged Brexit and is a supporter of the cross-party for a People's Vote. Read More Online abuse by 'Labour' trolls will only help the Tories\nThe group says there is strong evidence the Sunderland public is changing its mind as Theresa May's Bad-Deal or No-Deal looms.\nNE4EU spokesperson Louise Brown, who hails from Sunderland, said: \"Whichever way you voted in the referendum, no-one did so to be worse off and have food and medicine shortages. The People's Vote March and Rally takes place in Sunderland City Centre (Image: Newcastle Chronicle)\n\"Many of us in NE4EU are from Sunderland and are terrified at the way the government is handling the Brexit negotiations.\n\"We are particularly worried about the impact on local jobs especially with Nissan, who are so important to our economy, clearly stating they need the UK to stay in the Single Market to stay profitable.\" Video Loading Click to play Tap to play The video will start in 8 Cancel Play now\nMs Brown said there had been a dramatic change in local opinion.\nShe added: \"Time is running out for Theresa May to get a deal and all the signs from Salzburg are that she can't.\n\"The time is now for the people to speak up and have their say. The consequences of Theresa May's Bad Deal or No Deal to Sunderland and the North East will be devastating.\" Leaver voters give a counter protest in Sunderland (Image: Newcastle Chronicle)\nMeanwhile, counter activists called for the crowds to remember the decision to leave the EU. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-10-06T19:37:00.000+03:00", "crawled": "2018-10-06T20:35:10.021+03:00", "highlightTitle": ""}