{"organizations": [], "uuid": "a7c25db5907fa056c77b92593fa0fdf87784442c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article491586.ece/ALTERNATES/s1200/SWNS_PONY_MEAT_11.jpg", "site_section": "http://www.middevongazette.co.uk/news.rss", "section_title": "Devon Live - News", "url": "https://www.devonlive.com/news/devon-news/dartmoor-ponies-rounded-up-shot-2064101", "country": "GB", "title": "Dartmoor ponies may have to be rounded up and shot because of Brexit, say worried volunteers", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-02T08:00:00.000+03:00", "replies_count": 0, "uuid": "a7c25db5907fa056c77b92593fa0fdf87784442c"}, "author": "Keith Rossiter", "url": "https://www.devonlive.com/news/devon-news/dartmoor-ponies-rounded-up-shot-2064101", "ord_in_thread": 0, "title": "Dartmoor ponies may have to be rounded up and shot because of Brexit, say worried volunteers", "locations": [], "entities": {"persons": [{"name": "devon", "sentiment": "none"}, {"name": "charlotte faulkner", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "chagford", "sentiment": "none"}], "organizations": [{"name": "parliament", "sentiment": "none"}, {"name": "dartmoor hill pony association", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Dartmoor ponies may have to be rounded up and shot because of Brexit, say worried volunteers New rules came into force on October 1 in preparation for Brexit Share Click to play Tap to play The video will start in 8 Cancel Play now Get\nHundreds of Dartmoor ponies being rounded up yesterday in the annual “drift” may have to be shot because of a “Catch 22” in new regulations.\nThe ponies have to come off the moor to stay within the numbers legally allowed to graze the commons.\nSome 200 ponies are then sold through the annual drift sale at Chagford in Devon, which this year is due to take place on October 11. Dartmoor Hill Ponies brought down for the Drift (Image: Hazel Mansell-Greenwood) Read More From ghosts to famous owners: These 22 notorious Devon pubs have strange stories to tell\nBut under new regulations, which came into force yesterday, ponies that are sold will have to be issued with a full ID document before they can go off to a new home and a future, according to Charlotte Faulkner, who runs the Dartmoor Hill Pony Association. Dartmoor ponies\n“As part of preparations for Brexit, EU regulation related to horse passports has been rewritten and presented to Parliament as UK regulation,” Ms Faulkner said.\nThis regulation applies to the genetically rare semi-wild pony herds of Dartmoor – a central part of hill-farming tradition and culture, essential to tourism. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now\nIt was due to be ratified by Parliament on October 1.\nMs Faulkner said: “I have been writing to Defra Equine ID for more than two years asking to hold discussions about errors in the wording of the regulation, which will result in our semi-wild herds being probably being shot as there is no way of getting them off the moor.”\nPeter Farnsworth, a partner with Rendells, which runs the annual sale, said they already had more than 200 ponies entered for this year’s sale. The cute foal (Image: Richard Austin)\n“We’ll end up with 250 to 300, which is 50 more than last year,” he said.\nMr Farnsworth is hoping for a meeting with Defra officials on Tuesday. Dartmoor Hill Ponies brought down for the Drift (Image: Hazel Mansell-Greenwood)\n“There has been no consultation,” he said. “They mention wild ponies in the regulations, but I don’t think they understand what it’s like to actually deal with it.” Read More", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-10-02T08:00:00.000+03:00", "crawled": "2018-10-02T09:14:25.034+03:00", "highlightTitle": ""}