{"organizations": [], "uuid": "3e0bd788004c28a86adb64bbf6dca0dcbd677a3c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15232421.ece/ALTERNATES/s1200/2_JS164496256.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/6-key-points-theresa-mays-15230595", "country": "GB", "domain_rank": 21960, "title": "6 key points from Theresa May's party conference speech - including Brexit and the NHS", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-03T16:16:00.000+03:00", "replies_count": 0, "uuid": "3e0bd788004c28a86adb64bbf6dca0dcbd677a3c"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/6-key-points-theresa-mays-15230595", "ord_in_thread": 0, "title": "6 key points from Theresa May's party conference speech - including Brexit and the NHS", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "theresa may dan", "sentiment": "none"}, {"name": "james duddridge", "sentiment": "none"}, {"name": "tory graham brady", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "chequers", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "nhs", "sentiment": "negative"}, {"name": "under conservative party", "sentiment": "none"}, {"name": "committee", "sentiment": "none"}, {"name": "abba", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Getting drugs out of our jails\nThis was a reference to Mrs May's proposed deal with the EU, know as the Chequers deal.\nAnd in what looked like a deliberate attempt to undermine the Prime Minister, Conservative MP James Duddridge announced around an hour before her speech began that he had submitted a letter to the 1922 Committee of backbench MPs calling on her to resign.\nUnder Conservative Party rules, a leadership contest will be triggered if 48 letters are submitted. Only the Committee chair, backbench Tory Graham Brady, knows how many letters he has receved.\nHowever, Mrs May delivered a strong speech that may well help to secure her position.\nHere are the key points from her speech: Dancing onto the stage\nThe Prime Minister, mocked by critics as the \"May-bot\", walked onto the stage to the tune of Abba's \"Dancing Queen\", doing a mock robot-style dance.\nAnd she joked about her disastrous speech at last year's conference, where she suffered a coughing fit, indulging in a fake cough to laughter from the audience. Come together - like we did after the war Prime Minister Theresa May dances onto stage during the Conservative Party Conference\nMrs May set out a vision of a better future for the UK after Brexit - but said the UK also needed to work together to create a better society as it did after World War II.\n\"We must recapture that spirit of common purpose\", she said.\n\"If we come together, there is no limit to what we can achieve. Our future is in our hands.\" Corbyn's Labour is not traditional Labour\nMrs May said British politics had become nastier in recent years - and condemned online abuse aimed at Diane Abbott, Labour's Shadow Foreign Secretary.\nShe said making the right decisions becomes harder \"when our politics becomes polarised and compromised becomes a dirty word\".\n\"Conservatives will always stand up for a politics that unites us rather than a politics that divides us,\" she insisted.\nBut she went on to condemn the Labour leadership, saying the \"Jeremy Corbyn party\" had taken over the traditional Labour Party.\nMr Corbyn \"stood by\" while Labour MPs faced de-selection, she said, and \"told British Jews they didn't know the meaning of anti-Semitism\".\nBut former Labour leaders would never have behaved this way, she said. Read More Huge applause for Boris Johnson as he sets out leadership pitch at Conservative conference\nAnd she claimed Mr Corbyn was \"happy to appear on Iranian state TV but attacks our free media here in Britain\".\nMany people who had never supported the Conservatives in the past \"are appalled at what Jeremy Corbyn has done to Labour\", she said.\nDuring the speech, Mrs May praised Labour politicians including Jo Cox, Neil Kinnock, Clem Attlee and Jim Callaghan, in an apparent attempt to suggest a Government led by Mr Corbyn would not be a normal Labour Government - and to suggest her politics were firmly on the centre ground. Support for the NHS\nMrs May said the Conservatives were committed to the NHS, and had increased funding for it.\nAnd she pointed out that she receives help and support from the NHS to manage her diabetes.\nMrs May revealed that her God-daughter had died from cancer last year.\n\"Half of us will be diagnosed with cancer. All of us know someone who has been.\"\nThe Prime Minister announced a new cancer strategy designed particularly to increase the early detection rate of cancer, a measure that could have lead to a huge increase in the survival rate. Back me on Brexit\nThe Prime Minister repeated the arguments in favour of her \"Chequers\" Brexit plan, saying it would protect the \"just in time\" supply chains that manufacturing firms depend on.\nAnd she said that leaving the EU would enable the UK \"to reduce the numbers\" of immigrants coming into the country - giving British businesses \"an incentive to train your own young people\". Theresa May arrives at the Conservative Party annual conference (Image: PA)\nIn an appeal to her party to unite - and possibly to Labour backbenchers to support her on Brexit - she said the country needed to come together.\nHer comments came after some Tories, such as Mr Johnson, spoke out against Chequers and set out rival plans.\n\"If we don't, if we all go off in different directions in pursuit of our own visions of the perfect Brexit, we risk ending up with no Brexit at all.\"\nShe insisted she was \"standing up for Britain\" to get the best possible deal from the EU.\nMrs May said the UK would hold a year-long Festival of Britain in 2022, to \"put the best of British creativity and innovation\" on show.\nShe painted a picture of a bright future for the UK after Brexit, saying: \"I passionately believe that our best days lie ahead of us and that our future is full of promise.\"\nThe UK had many advantages including the English language, rule of law and good universities, she said. Back free markets - but we must do more to help people\nThe Prime Minister launched into a defence of capitalism, saying free markets had cut global poverty in half and increased life expectancy.\nAnd she had a dig at Mr Johnson, who is reported to have said \"f*** business\", telling her audience she had a four-letter word ending in the letter \"K\" for employers - before revealing it was \"back business\".\nBut she also said that some markets \"are still not working\", and many people were still suffering as a result of the banking crisis that began more than ten years ago.\n\"Employment is up, but too many people haven't had a decent pay rise. Read More\n\"The deficit is down, but achieving that has been painful.\n\"And our economy is growing but some communities have been left behind.\"\nMr Corbyn offered answers to some of these problems, she said - but these were \"bogus solutions that would make things worse\".\nShe highlighted Labour's plan to force large businesses to put 10% of their shares into a fund which would pay some dividends to employees and, in some cases, to a Government fund.\n\"They dress it up as employee ownership, but it's a giant stealth tax on enterprise\", she said.\nLabour would pay for its nationalisation plans \"by raising taxes higher and higher\", claimed Mrs May.\nBut she admitted it wasn't good enough for Tories to criticise Labour. They also had to explain how they would address people's concerns instead. Like us on Facebook", "external_links": [], "published": "2018-10-03T16:16:00.000+03:00", "crawled": "2018-10-03T22:20:01.038+03:00", "highlightTitle": ""}