{"organizations": [], "uuid": "cdcfcc686cc25181a795e8cab1b1ea371d7bf8b8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15218844.ece/ALTERNATES/s1200/0_newcastle-university.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/newcastle-university-outlines-vision-become-15218627", "country": "GB", "domain_rank": 21960, "title": "Newcastle University outlines vision to become world leader", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-01T02:01:00.000+03:00", "replies_count": 0, "uuid": "cdcfcc686cc25181a795e8cab1b1ea371d7bf8b8"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-news/newcastle-university-outlines-vision-become-15218627", "ord_in_thread": 0, "title": "Newcastle University outlines vision to become world leader", "locations": [], "entities": {"persons": [{"name": "chris day", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "newcastle university", "sentiment": "negative"}, {"name": "newcastle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Newcastle University outlines vision to become world leader New plan for university comes as it is rising up the global rankings Share Get business updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nNewcastle University will today set out a vision to make itself a world leader in areas that will make a difference to millions of people around the world.\nUniversity vice-chancellor Prof Chris Day will unveil the vision - titled “From Newcastle. For the world” - to staff with the hope that the institution will have a greater impact on society, both locally and around the world.\nThe university puts more than £1bn into the economy, bringing 28,000 students to Newcastle and employing over 6,000 people.\nBut it is facing increasing challenges from other universities and factors such as Brexit that threaten both its income and its standing on the world stage.\nThe new vision - which has been informed by discussions with staff, students and outside organisations - says Newcastle wants to become “a more globally inclusive institution, providing new knowledge and creative solutions that make a positive impact on the economy and society of the region, the UK and beyond.” Prof Chris Day (Image: handout)\nAmong the initiatives included in the vision are plans for a Newcastle Doctoral College to create a world-class centre for research, backing for key sectors in the North East economy, working more closely with the NHS and using its global reach to boost the region.\nProf Day said: “We are excellent in a lot of areas, but we want to be world leading in areas that enable us to make a real difference out there. That’s why our strapline is ‘the things we’re doing here are making a difference out there’.\n“It’s all about what Newcastle can offer the world. We can offer it the essence of this university: producing fantastic, work-ready graduates, and we want to do more of that. We’re in the top 10 for gradate employment and 86% of our graduates, six months after leading here, are in a graduate-level job.\n“The second thing you can do is research that’s of a real relevance. In ageing, energy, data and digital, creative and cultural, and cities - those are pretty big areas that really impact on people’s lives.\n“And the other characteristic of us is that we’ve always worked very closely with our partners in the city and we want to have this city as a testbed for a lot of the things we do.\n“By getting our local partners to help set the agenda - what are the things that are bothering them, what are the questions they’re asking - we can work with them to produce those answers.” Read More Newcastle aims to become digital city to head next industrial revolution\nThe vision is split into four sections: education for life, research for discovery and impact, engagement and place, and global.\nTo back up the new vision, the university has appointed with Prof Julie Sanders as deputy vice-chancellor, Prof Brian Walker as pro-vice-chancellor for research strategy and resources, and Prof Nigel Harkness as pro-vice-chancellor for humanities and social sciences,\nThe new vision comes as Newcastle has reversed a recent slide down the UK and global university rankings, as well as leading key research on areas like Type 2 diabetes, climate change and ageing.\nProf Day said the university wasn’t looking to expand its student numbers hugely, though it could take more overseas students, who pay higher fees. Read More Universities in North East call for new visas for international students\nHe said Brexit presented three threats to the university, with loss of access to European research funding and a drop in the number of EU students both likely to hit funding.\nBut his main concern was a loss of skilled staff from Europe, which was shown when Dutch cancer research specialist Prof Josef Vormoor left the university in February in part due to the UK leaving the EU.\nThe university - which in the running to be named University of the Year - is currently building a number of buildings on the Helix site (formerly known as Science Central) and has plans to refurbish some older buildings on its city centre campus. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-10-01T02:01:00.000+03:00", "crawled": "2018-10-01T03:26:38.000+03:00", "highlightTitle": ""}