{"organizations": [], "uuid": "785ebbd0a5ec088fbad9572ff8679b15a3a673ef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article1028380.ece/ALTERNATES/s1200/30589595JPG.jpg", "site_section": "http://www.westernmorningnews.co.uk/editorschoices.rss", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/devon-news/appledore-shipyard-set-close-200-2132819", "country": "GB", "title": "Appledore shipyard set to close and 200 jobs at risk as orders dry up", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-22T15:17:00.000+03:00", "replies_count": 0, "uuid": "785ebbd0a5ec088fbad9572ff8679b15a3a673ef"}, "author": "Joel Cooper", "url": "https://www.devonlive.com/news/devon-news/appledore-shipyard-set-close-200-2132819", "ord_in_thread": 0, "title": "Appledore shipyard set to close and 200 jobs at risk as orders dry up", "locations": [], "entities": {"persons": [{"name": "babcock", "sentiment": "none"}, {"name": "gavin williamson", "sentiment": "none"}], "locations": [{"name": "north devon", "sentiment": "none"}, {"name": "appledore shipyard", "sentiment": "none"}, {"name": "devonport", "sentiment": "none"}, {"name": "appledore", "sentiment": "none"}], "organizations": [{"name": "financial times", "sentiment": "none"}, {"name": "babcock international", "sentiment": "none"}, {"name": "telegraph", "sentiment": "none"}, {"name": "defence", "sentiment": "none"}, {"name": "royal navy", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Appledore shipyard set to close and 200 jobs at risk as orders dry up Up to 200 jobs at the engineering site could be at risk Share Click to play Tap to play The video will start in 8 Cancel Play now\nAppledore shipyard in North Devon looks set to close after orders appear to have dried up, according to a reports in several national newspapers.\nThe Times, Telegraph, Financial Times and This Is Money website have all reported that up to 200 jobs at the engineering site could be at risk.\nIt is understood that a lack of orders at the 163-year-old site means it is likely to face the axe with no new work lined up for its staff.\nShipyard owners Babcock International have not confirmed the closure but say they are \"reviewing the options\" for the shipyard. Defence Secretary Gavin Williamson meeting with apprentices at Appledore Shipyard.\nThe firm, which repairs the Royal Navy’s submarines and warships, has suffered amid a decline in defence spending recently with many staff members from Appledore being relocated to Devonport.\nA spokesman for Babcock said: “Babcock is in the final stages of successfully delivering the fourth offshore patrol vessel for the Irish Naval Service, LÉ George Bernard Shaw.\n\"As that programme comes to an end, we are reviewing the options for our business at Appledore.”\nDevon Live has also contacted Torridge and West Devon MP Geoffrey Cox for a comment. Read More MPs grill Babcock boss over future of Devon shipyard\nJust last week we reported that Geoffrey Cox QC, MP for Torridge & West Devon, and Peter Heaton-Jones, MP for North Devon, held a joint meeting with Babcock International CEO, Archie Bethel, on Monday, October 15.\nThe MPs sought assurances from the group’s CEO over the future of Appledore Shipyard after recent speculation about the security of jobs.\nEarlier this month we reported that the Unite union, which represents defence workers, said the government’s \"continual lack of commitment\" to building ships for the Royal Navy threatens to \"shipwreck\" the future of Appledore shipyard.\nThe union believe the shipyard's future is vulnerable following the loss of a major contract to an Italian shipyard and apparent delays in contracts for Type 31 military frigates. Babcock's Appledore shipyard on the Torridge estuary in North Devon\nIn July we reported that Unite had criticised the government’s decision to pause the bidding for type 31e Frigates.\nThe GMB union says the government's announcement has \"ramped up the uncertainty\" about jobs at Appledore shipyard in North Devon and says it is a \"further blow to British shipbuilding\".\nMPs Cox and Heaton-Jones met with the CEO of Babcock, who own the shipyard, earlier this week to seek assurances about the security of local jobs.\nDuring the discussion the MPs emphasised the importance of the yard, not only for its highly skilled workforce, but also the neighbouring communities and the local economy. Read More Fears Babcock's Appledore Shipyard could close after it loses major contract\nFollowing the meeting Geoffrey Cox QC, who is also the Government’s Attorney General, said: “We had a productive meeting with the CEO who has given us his commitment that the Babcock Group is doing all it can to ensure the workforce at Appledore remains engaged and employed. We welcome this commitment to the yard and to its people.\n“Peter Heaton-Jones and I have held regular meetings with the Secretary of State for Defence about this vital issue and will continue to press Babcock to ensure that Appledore continues to function as a working shipyard.”\nSpeaking earlier this month, Unite assistant general secretary Steve Turner said: “The loss of the contract to Italian yard Fincantieri has exposed the vulnerability of the Appledore site, while government delays to the Type 31e frigates and an obsession with off-shoring the construction of three fleet support ships for our naval carrier fleet is threatening jobs across the UK. “Our future capability to build for the Royal Navy in UK shipyards hangs by a thread, so it is imperative that the government makes support for these yards a keystone of any post-Brexit industrial strategy. Devonport Dockyard, operated by Babcock International\n“Defence secretary Gavin Williamson and business secretary Greg Clark must now wake up and smell the coffee. They must act now to defend UK yards and what’s left of any defence and wider industrial strategy.\n“Otherwise, the future of these yards and all those who work at them, alongside thousands more jobs in the UK-wide supply chain, could be shipwrecked.\n“Block building of this work could sustain both the Appledore and Belfast communities, supporting decent skilled jobs, apprenticeships for our youth and the families reliant upon them.\nInstead, government seems willing to allow our shipyards to fall silent and skilled jobs go to wall.\n“The government needs to back UK Plc, our shipbuilders, steel plants and component suppliers and commit now to the UK design, engineering and build of the navy’s solid support ships in UK shipyards with 140,000 tonnes of British steel. Read More Thousands join campaign to save jobs at Babcock shipyard in Appledore “A failure to do so, alongside the continuing dithering over Type 31e frigates, will be a gross betrayal to UK ship workers, loyal communities and regional economies, while putting at risk manufacturing skills vital to the industry.”\nA petition to save a much-loved Devon shipyard and hundreds of jobs has been signed by thousands of people.\nThe campaign to save Appledore Shipyard from closure was mounted by the GMB and Unite unions, following the news that owners Babcock had been unsuccessful in winning a key order.\nSo far more than 7,100 people have signed the online petition . Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}", "https://www.change.org/p/save-appledore-shipyard"], "published": "2018-10-22T15:17:00.000+03:00", "crawled": "2018-10-22T15:48:36.003+03:00", "highlightTitle": ""}