{"organizations": [], "uuid": "a171d005eee3ba3105c9d631f1e713b22a65cfda", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15229160.ece/ALTERNATES/s1200/0_Conservative-Party-annual-conference-2018.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/news-opinion/conservatives-can-win-explain-how-15230741", "country": "GB", "domain_rank": 21960, "title": "Conservatives can win if they explain how they will make life better after Brexit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-03T18:20:00.000+03:00", "replies_count": 0, "uuid": "a171d005eee3ba3105c9d631f1e713b22a65cfda"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/news-opinion/conservatives-can-win-explain-how-15230741", "ord_in_thread": 0, "title": "Conservatives can win if they explain how they will make life better after Brexit", "locations": [], "entities": {"persons": [{"name": "brexit labou", "sentiment": "positive"}, {"name": "guy opperman", "sentiment": "none"}], "locations": [{"name": "birmingham", "sentiment": "none"}], "organizations": [{"name": "brexit news", "sentiment": "positive"}, {"name": "labour", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News opinion Conservatives can win if they explain how they will make life better after Brexit Labour sounds like it has a plan to make our lives better. Tories don't - but that could change. Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nThe problem the Conservatives face is that they don’t have anything to offer the country beyond delivering Brexit.\nThis was bought home at a fringe event during the party conference in Birmingham.\nThe theme was how the party could win support from younger voters, which for Conservatives today means anyone under 47.\nPolling and studies have found, the audience was told, that age and ethnicity are now the most important factors determining how people vote. And 47 is the age at which people switch from being more likely to vote Labour to being more likely to vote Conservative.\nTwo of the party's most interesting MPs were speaking at the meeting - Guy Opperman, a minister in the Department of Work and Pensions, and Sam Gyimah, a Minister in the Department for Business, Energy and Industrial Strategy. Prime Minister Theresa May dances onto stage during the Conservative Party Conference\nThere was a consensus about what needed to change. Conservatives appeared to be talking about nothing about Brexit, the MPs said, and instead they had to talk about how they would improve people’s lives once Brexit takes place.\nMr Opperman set out in general terms what sort of vision the party should offer. Pro-Nato, pro-business and pro-enterprise - all solid Tory values - and also committed to social justice and social mobility, he said.\nHe also spoke about the need to communicate better and reach out to younger voters, highlighting his activity on social media and regular visits to schools.\nThe comments from the two MPS were prescient, because Theresa May, in her conference speech, did pretty much what they’d been calling for.\nIn an attempt to shift debate on from arguments about Brexit negotiations, she promised a better life once the UK finally left the EU.\n”Our best days lie ahead”, said Mrs May.\nThat sounds great. But the Conservatives don’t appear to know how they will deliver these better days.\nThere are individual policies on issues such as housing or fairness in the workplace - such as planned laws to ensure waiters and waitresses are allowed to keep the tips customers give to them - but they don’t add up to a programme to change society for the better.\nLabour, at its party conference a week previously, sounded like it had a plan to give working people a fairer deal and to help people get a home.\nSome people will greet Labour’s ideas with enthusiasm while others will think they are totally bonkers.\nBut there’s no doubt that a plan exists. Labour leader Jeremy Corbyn giving his keynote conference speech (Image: PA)\nYou can’t say that about the Tories. And while it’s true that the party needs to communicate its ideas more effectively, it first needs to decide what those ideas are.\nBut having said that, I wouldn’t celebrate just yet if I was a Labour politician.\nThe Conservatives have been obsessed with Brexit to the exclusion of all else, and while this is a problem for them it was also inevitable - because they actually need to deliver Brexit.\nLabour is hopelessly divided over Brexit. Shadow Cabinet members such as Emily Thornberry and Ian Lavery insist that Brexit must happen, while Deputy Leader Tom Watson has raised the idea of including a commitment to a second referendum in Labour’s general election manifesto.\nBut Labour can get away with being divided. It doesn’t matter if the Shadow Cabinet can’t agree because all they can really do, being in opposition, is sit and watch while the Government attempts to deliver something.\nFor Conservatives, however, debates about Brexit aren’t just the stuff of party conference votes or TV interviews. They really are deciding the fate of the country, and their battles are very real.\nSo perhaps they can be excused for failing to put serious thought into what happens next. And, more importantly, things could change once Brexit takes place on March 29 next year. Prime Minister Theresa May with Philip Hammond, Chancellor of the Exchequer, visiting ADI Group in Kings Norton, Birmingham meeting apprentices (Image: Birmingham Mail)\nBrexit will be a process rather than an event. It won’t suddenly be over next March, especially if we enter a transition period where very little will change for a while.\nBut (unless something very dramatic and unexpected happens in the meantime) we’ll have left the EU.\nAnd we’ll probably know what sort of deal we’ve got. Chequers, Canada plus or no-deal? That debate, which has consumed the Conservative Party and the media but means little to many voters, will finally be over,\nIt will provide space for the Tories to think hard about how they counter Jeremy Corbyn’s promise of a fairer society by coming up with a vision of their own.\nThat doesn’t have to mean matching all of Labour’s pledges. Tories can be committed to social justice but base their ideas on common sense rather than promising the earth.\nTheresa May made a start on this - though only a start - in her conference speech this week.\nConservatives are quite capable of recovering from periods of division and failure and re-uniting, particularly if it’s around a new leader. Read More", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-10-03T18:20:00.000+03:00", "crawled": "2018-10-03T22:19:40.004+03:00", "highlightTitle": ""}