{"organizations": [], "uuid": "68cf6c69553d8e54f8464b0e4b2521f7deb34788", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15346381.ece/ALTERNATES/s1200/0_Untitled-1.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/more-treats-tricks-business-leaders-15346139", "country": "GB", "domain_rank": 21960, "title": "'More treats than tricks' - business leaders hail Budget for helping small firms and the high street", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-29T20:00:00.000+02:00", "replies_count": 0, "uuid": "68cf6c69553d8e54f8464b0e4b2521f7deb34788"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/more-treats-tricks-business-leaders-15346139", "ord_in_thread": 0, "title": "'More treats than tricks' - business leaders hail Budget for helping small firms and the high street", "locations": [], "entities": {"persons": [{"name": "carolyn fairbairn", "sentiment": "negative"}, {"name": "philip hammond", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "newcastle chronicle", "sentiment": "negative"}, {"name": "cbi", "sentiment": "negative"}, {"name": "digital services tax", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Carolyn Fairbairn, CBI director-general (Image: Newcastle Chronicle) Get business updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nBusiness leaders and industry organisations have hailed the Chancellor’s moves to support small businesses and help the high street in a budget which delivered “more treats than tricks” - yet some claimed it fails to address the needs of Brexit.\nIn his 2018 Budget, Philip Hammond announced a new Digital Services Tax, to ensure global, tech giants “pay their fair share towards supporting our public services”, while also announcing business rates bills will be cut by a third for firms with a rateable value less than £51,000.\nOther measures included a £675m package of support unveiled in co-funding for a Future High Streets Fund, to help authorities transform town centres, a reduction in the amount small firms pay towards the apprenticeship levy, from 10% to 5%.\nSuch measures, the CBI said, showed this was a solid budget – but that the Chancellor could have gone further still.\nCarolyn Fairbairn, CBI director-general, said: “This was a rock-solid budget, bringing more treats than tricks for business. It recognises the enormous contribution enterprise has made to balancing the UK’s books through jobs, pay and tax and responds to many of the recommendations that firms have made. Read More UK Budget Announcement 2018 — as it happened: Chancellor Philip Hammond's autumn statement; summary, reaction and what it means for you\n“But while the Chancellor has reduced some of biggest barriers to growth, he has missed some opportunities.\n“That said, the new investment in broadband, research, housing and infrastructure will help tackle the UK’s glaring regional equalities head on.\n“Ongoing reform of the apprenticeship levy and collaboration with business on retraining reflects long-standing business advice and will help individuals adapt to a fast-changing world of work.\n“The Chancellor has come up trumps with a bumper package to spur firms to invest more into their factories and machinery, with the improved Annual Investment Allowance and incentives for spending on buildings.\n“Smaller businesses will be relieved by the support on Business Rates at a time where the current system is crippling many high streets. But larger retailers and manufactures - and the millions they employ across the UK - will continue to suffer needlessly until there is a full, in-depth review.”\nKelly Green, regional director for the North East, Lloyds Bank Commercial Banking, agreed, saying: “The Chancellor’s decision to cut business rates for smaller high street operators by a third will be welcomed by many our region’s SME retailers. Read More Budget 2018: Chancellor urged to show commitment to the North by backing Northern Powerhouse Rail\n“Local commercial centres such as Newcastle have been hit by a string of recent store closures, and savings here will not only support the day-to-day cost of doing business but could also free-up cash flow for investment in developing crucial skills and tackling low productivity – both ongoing challenges for businesses in the North East.\n“Meanwhile, the Government’s £30bn investment pledge on road infrastructure and its £37m commitment to Northern Powerhouse Rail will also be well received locally.\n“When we spoke to business leaders in the run-up to the Budget, one in 10 told us they wanted the Chancellor to prioritise transport infrastructure spending today. They’ll hope that increased spending in this area will enhance connectivity, in turn helping to fuel growth and enhance prosperity.”\nThe North East England Chamber of Commerce said the budget provides good short term solutions, and welcomed moves to provide up to £14m to fund the South Tees Development Corporation site, the first Mayoral Development Corporation outside of London.\nHowever, the Chamber criticised the Chancellor for missed opportunities. North East England Chamber of Commerce, Jonathan Walker (Image: Handout)\nJonathan Walker, assistant director at the Chamber, said: “We are pleased the Chancellor has listened to our calls to improve local business conditions in our region and welcome the business rate relief for town centre retailers as well as the future High Street fund. The decision to half the apprenticeship cost of training for SMEs is also good news and is an endorsement of what was contained in our submission to the Treasury.\n“Our businesses need to have a good infrastructure to succeed and grow so the announcement of £37m to develop plans for Northern Powerhouse Rail is welcome. Government now needs to commit to backing the full proposals as they come forwards.\n“We have worked hard over the past year to support workers’ mental health and welcome the investment in services to provide help for this important area of employees’ well-being.\n“Developing the South Tees site is a complex, long term project and so new funding is a useful start to attract new businesses to the area.\n“Sadly, the major omission was support for exporters in the context of Brexit. We called for additional support for companies to break into new markets and strengthen our export performance. The Chancellor also missed the opportunity to improve regional competitiveness by not reforming Air Passenger Duty.” Mike Cherry, chair of the Federation of Small Businesses (Image: Handout)\nMike Cherry, Federation of Small Businesses (FSB) national chairman, said the Budget’s inclusion of measures in several areas of tax, expenditure and public policy would very specifically help the small business community.\nAs well as the £900m of business rates support for small businesses on the high street, the package includes a freeze of the current VAT threshold for two years and a new pilot scheme to fund training for the self-employed that FSB will be taking part in.\nMr Cherry said: “This is the most small-business-friendly budget that this Chancellor has delivered.\n“On the tax front, small firms up and down the country will be pleased to see the VAT threshold frozen for two years. Small businesses on our high streets that cannot get Small Business Rate Relief will be delighted with the significant discount for the next two years, which on average will help these businesses to the tune of almost £2,000 each, but potentially up to around £16,000 off small businesses facing the biggest bills. Read More 10 key announcements from Chancellor Philip Hammond's 2018 Budget and how they affect you\n“Through the Budget, the Chancellor is now using the strength of the Treasury to back small business. We have already seen a significant change of tone in recent months towards helping businesses, right from the top of Government, and today represents the change of policy that backs this up.\n“This is long due recognition that small firms are the UK’s job creators and community leaders.”\nSue Richardson, head of retail at KPMG in the North of England, added: “There is no denying that Britain’s retail industry has been battling abrasive headwinds, and thankfully this year’s Budget took note of this unfortunate fact. As the bout of store closures, profit warnings and casualties this year will attest to, retail is undergoing fundamental structural change, and many are struggling to keep up with the pace of change.\n“It is often smaller, non-food retail on our local high street that appears to be taking the biggest bashing. As such, the Chancellor’s measures for smaller businesses will provide some much-needed relief for those eligible.” Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-10-29T20:00:00.000+02:00", "crawled": "2018-10-30T01:47:02.016+02:00", "highlightTitle": ""}