{"organizations": [], "uuid": "239924080ccc64c59ddf88faddf495496eb5af94", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article2074440.ece/ALTERNATES/s1200/0_CoxJPG.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/devon-news/calls-booming-devon-mp-geoffrey-2074221", "country": "GB", "title": "Calls for 'booming' Devon MP Geoffrey Cox to become next Prime Minister after bizarre 'show-stealing' speech at Conservative party conference", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-04T17:32:00.000+03:00", "replies_count": 0, "uuid": "239924080ccc64c59ddf88faddf495496eb5af94"}, "author": "Joel Cooper", "url": "https://www.devonlive.com/news/devon-news/calls-booming-devon-mp-geoffrey-2074221", "ord_in_thread": 0, "title": "Calls for 'booming' Devon MP Geoffrey Cox to become next Prime Minister after bizarre 'show-stealing' speech at Conservative party conference", "locations": [], "entities": {"persons": [{"name": "geoffrey cox", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "cox", "sentiment": "none"}], "locations": [{"name": "torridge", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "west devon", "sentiment": "none"}], "organizations": [{"name": "conservative", "sentiment": "none"}, {"name": "cabinet", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}, {"name": "cox", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get Daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nA Devon MP who introduced Theresa May at the Conservative Party conference yesterday has been accused of overshadowing the PM with his dramatic and thunderous speech.\nThere have even been calls for Geoffrey Cox, MP for Torridge and West Devon, to be made the next leader of the Tories - such was the popularity of his booming display\nVideo's of Cox's speech, such as the ones below, have been shared widely on social media.\nCox, who was appointed the UK's Attorney General earlier this year, attracted huge applause with his speech prior to the Prime Minister's address.\nHis dramatic delivery included phrases such as \"a noble and puissant nation\" and, speaking about Theresa May, he said: \"Methinks I see her, as an eagle, mewing her mighty youth and kindling her undazzled eyes at the full midday beam.\" Read More Devon MP Geoffrey Cox is the new Attorney General after Cabinet reshuffle\nSome amusing commentators drew similarities between his voice and those of actor Brian Blessed, Mufasa from the Lion King and even Lord of the Ring's wizard Gandalf.\nIn fact, such was his popularity, he became one of the top trending search queries about the conference, according to data from Google Trends.\nIn his speech he said it was time for the party's members to 'grow up' and back Mrs May in Brexit negotiations and as leader of the party as well as PM.\nOn more serious matters, Mr Cox said: \"We have to be grown up. We have now reached the critical moment. Read More Union says closure of Devon shipyard would be 'devastating' and urges Government to 'stop playing with people's jobs'\n\"We must resolve and put aside our differences and unite behind the PM. Brexit is based on hope, not fear. We need not fear self-government.\n\"We believe a nation like the UK will soon be able to gather her strength and step into the world as a sovereign partner to the other democracies.\"\nBut others were less impressed with his speech.\nOn Twitter, some commentators said his delivery was a \"masterclass in the emptiest of orations\" with another saying there was \"no substance to his rhetoric, just a lot of British bulldog chest puffing\". Read More Devon MPs threaten to derail government plans for high speed rail unless investment is made in Westcountry\nMr Cox has been a character that has divided opinion for some time.\nAllegedly the wealthiest Member of Parliament, there have often been suggestions that Mr Cox spends too much time working and not enough on his constituency. poll loading What did you think to Geoffrey Cox's speech at the Conservative Party conference? 0+ VOTES SO FAR Brilliant - he spoke well and delivered his speech with great oratory OK - it was very entertaining but it lacked substance Poor - I disagree with his points and the way in which he delivered them was out of touch with the average man in the street\nIn 2015 Mr Cox resigned from the Parliament’s sleaze watchdog after failing to declare on time thousands of pounds of outside income.\nHe also came under fire for claiming expenses for a pint of milk.\nIn May this year we reported how he had come under fire after defending tax havens against scrutiny - before revealing he had received tens of thousands of pounds from legal firms in the Cayman Islands.\nThe MP has acted as a barrister for companies based in the Cayman Islands - and once represented the British overseas territory’s Opposition Leader McKeeva Bush in a corruption trial over his use of a government credit card in casinos. Read More", "external_links": ["https://mab.data.tm-awx.com/rhs&quot;,&quot;lazyLoadHTML&quot;:&quot;true&quot;,&quot;modularCss&quot;:&quot;true&quot;,&quot;swipeNavigation&quot;:&quot;true&quot;}}}", "https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-10-04T17:32:00.000+03:00", "crawled": "2018-10-04T17:42:24.043+03:00", "highlightTitle": ""}