{"organizations": [], "uuid": "60a99e5156ba49699712278fca36a6e7fa68c29f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article2129667.ece/ALTERNATES/s1200/2_WLL-JOHNSTON-PHOTOGRAPHY.jpg", "site_section": "http://www.leicestermercury.co.uk/rss.xml", "section_title": "Leicestershire Live - frontpage", "url": "https://www.leicestermercury.co.uk/news/business/mattioli-woods-well-placed-growth-2146656", "country": "GB", "domain_rank": 48128, "title": "Mattioli Woods “well placed” for growth despite market caution and Brexit uncertainty", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-25T15:54:00.000+03:00", "replies_count": 0, "uuid": "60a99e5156ba49699712278fca36a6e7fa68c29f"}, "author": "Tom Pegden", "url": "https://www.leicestermercury.co.uk/news/business/mattioli-woods-well-placed-growth-2146656", "ord_in_thread": 0, "title": "Mattioli Woods “well placed” for growth despite market caution and Brexit uncertainty", "locations": [], "entities": {"persons": [{"name": "mattioli woods", "sentiment": "negative"}, {"name": "joanne lake", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "budget", "sentiment": "none"}, {"name": "world trade organisation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Mattioli Woods “well placed” for growth despite market caution and Brexit uncertainty \"Efficiencies over the past few months offset lower client activity\" Share Click to play Tap to play The video will start in 8 Cancel Play now Get Business\nThe team at Leicester wealth management specialist Mattioli Woods say they are “well placed” to keep growing despite caution around markets and continuing uncertainty over Brexit .\nChairman Joanne Lake told shareholders she expected both factors – and likely changes to pension legislation in next week’s Budget – to “drive a sustained demand for advice”.\nAnd she said efficiencies over the past few months had offset lower client activity.\nThe value of the FTSE 100 has tumbled in recent weeks on the back of the Brexit stalemate and a subdued business mood across the UK and Europe.\nMeanwhile the Government is drawing up drastic plans to keep the UK running in the event of a no-deal Brexit. Mattioli Woods chairman Joanne Lake\nAnd it was reported today that Russia now wants to block Britain from inheriting EU terms on the World Trade Organisation after Brexit.\nMrs Lake was speaking at the company’s annual general meeting where she said Mattioli Woods had made a strong start to the new financial year, with further revenue growth and operational efficiencies.\nShe said: “As reported by many participants in the UK wealth management sector, we have seen a lower level of client activity over the summer months, attributed primarily to poor investor sentiment and prolonged uncertainty over Brexit.” The new Mattioli Woods building (Image: Will Johnston Photography)\nHowever, the impact of that and reducing clients’ costs had been “more than offset” by cost savings. Read More Profits up a quarter as Mattioli Woods gears up for office opening in Leicester's New Walk\nShe said: “Although there is some caution around markets, we believe the group is well placed to continue to grow, both organically and by acquisition.\n“Many commentators predict that next week’s Budget will include changes to pension tax relief and we expect further changes in pension legislation, fresh speculation around the shape of Brexit and any further volatility in markets to drive a sustained demand for advice. Read More First look inside Mattioli Woods' new £14m Leicester city centre office - that has its own sky bar\n“The inherent flex within our business model will allow us to adapt to meet the needs of our clients in what remains a changing marketplace, with a key part of our strategy being to lower the cost of the services we provide while growing a long-term sustainable business.” (Image: Victoria Jones/PA Wire)\nMrs Lake said the wealth management and employee benefits specialist’s recent move to new offices in the heart of Leicester city centre had created a more flexible working environment which “will allow us to continue to grow the business and realise further operational efficiencies, whilst ensuring our client services continue to be first class”.\nShe also revealed Mattioli Woods stood to benefit from rental savings of £850,000 a year as a result of the switch from its former premises in Grove Park, Enderby.\nLast month, Mattioli Woods posted pre-tax profits of almost £10 million, up a quarter.\nRevenues were up 16.2 per cent to £58.7 million for the year ending May 31, underpinned by strong organic growth of 15.6 per cent compared to 11.6 per cent in 2017. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/leicestermercury/subscriptions/&quot;}", "https://communicatoremail.com/IN/DCF/Ad9Bw6ZcmPSmMwDi7On4yR/"], "published": "2018-10-25T15:54:00.000+03:00", "crawled": "2018-10-25T17:01:00.026+03:00", "highlightTitle": ""}