{"organizations": [], "uuid": "86dcfd807ca262b43a48c1bd73a76e491d393809", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15240076.ece/ALTERNATES/s1200/0_CFR_NJL_270917rotary_01.jpg", "site_section": "http://www.thejournal.co.uk/business/?service=rss", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/seven-north-east-firms-makes-15238808", "country": "GB", "domain_rank": 21960, "title": "Seven North East firms makes list of UK's top companies", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-04T15:00:00.000+03:00", "replies_count": 0, "uuid": "86dcfd807ca262b43a48c1bd73a76e491d393809"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/seven-north-east-firms-makes-15238808", "ord_in_thread": 0, "title": "Seven North East firms makes list of UK's top companies", "locations": [], "entities": {"persons": [{"name": "grant thornton top", "sentiment": "negative"}, {"name": "thornton", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "jarrow", "sentiment": "none"}], "organizations": [{"name": "business seven north east", "sentiment": "negative"}, {"name": "the sunday times", "sentiment": "negative"}, {"name": "rotary power", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "brexit care", "sentiment": "none"}, {"name": "british engines", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Seven North East firms makes list of UK's top companies The Sunday Times Grant Thornton Top Track 250 league table ranks Britain’s private mid-market growth companies with the biggest sales Share Apprentices at Rotary Power, part of the British Engines group, based in Jarrow (Image: British Engines) Get business updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nSeven North East businesses have seen their success recognised in a nationwide list of the UK’s leading private companies.\nThe 14th annual Sunday Times Grant Thornton Top Track 250 league table lists Britain’s private mid-market growth companies with the biggest sales and last year just two firms from the region made the cut.\nThis year, however, seven companies from across the region feature in the table, increasing their combined sales 11% to £1.5bn and operating profits 28% to £97m. Between them they employ more than 19,000 people. Read More Nissan warns of 'serious implications' for Sunderland plant over no-deal Brexit\nCare home operator and new entrant HC-One, which employs 13,712 people, is the biggest mid-market growth company in the region. Based in Darlington, sales grew 11% to £375m in 2017 and profits topped £28m, taking the firm to number 49 in the table.\nSunderland’s Hays Travel ranked 61st in the table with sales of £338m and profit of £9m.\nEarlier this year the firm announced a move to new headquarters in Sunderland and also announced that all staff would benefit from the business reaching £1bn in gross sales, with all all employees receiving £100 for every full year they have served with the company.\nStockton’s PX Group, which now has 365 staff, appears on the list for the first time, having grown sales to £136m and more than doubling its profit to £5m. Mark Kenrick, CEO of PX Group (Image: Dave Charnley Photography)\nCEO Mark Kenrick said: “It’s tremendous to have received this recognition for all of the hard work put in by everyone at PX and for the support we have received from our shareholders BWE.\n“We have enjoyed significant growth over the years as we have expanded and diversified our business. All our work provides us with firm foundations on which to build further growth.”\nSouth Shields clothing manufacturer Barbour also features on the table, with sales of £184m and profit of £29m. Last year the waxed jacket favourite announced plans to open a new warehouse and distribution site.\nGateshead construction firm Tolent said it is enjoying a successful time, having weathered the recession when the construction sector was particularly impacted.\nThe firm, which was involved in the construction of The Beacon in Sunderland, grew sales to £178m and profit of £4m.\nChairman John Wood said: “Business is returning to normality – and we’ve got some really good opportunities coming through.\n“Since we got Gentoo Construction, which is now Tolent Living, it’s opened a whole new area of work for us. Life is getting back to normal.” Read More Newcastle Airport soars to 10-year high as passenger numbers top five million\nFrank Recruitment, which has just announced plans to create 400 jobs by opening a series of global offices, features in the list for a second year, moving up from 226 to 154 with sales of £180m and profit of £15m.\nCEO James Lloyd-Townshend said: “It’s been an incredible year for Frank Recruitment Group, and we’re privileged to be recognised in the Sunday Times Grant Thornton Top Track 250 for the second year in a row.\n“We first opened our doors in 2006 right here in Newcastle as Nigel Frank, and by 2016, we had blossomed into a global company with several brands and around 800 employees across the UK, North America, Europe and Asia-Pacific.”\nMeanwhile, Newcastle-based engineering firm British Engines, which has grown sales 11% to £154m under the stewardship of chairman Alex Lamb, a descendant of the founders, is ranked at 196 with sales of £154m and profit of £7m.\nThe companies in the North East appear with businesses from around the UK, including Travelodge, Trainline, PureGym and The White Company.\nThe Top Track 250 is sponsored by Grant Thornton and Lloyds Banking Group, and compiled by Fast Track, the Oxford-based research and networking events firm.\nRachel Engwell, Partner at Grant Thornton UK LLP, the title sponsor of the league table, said: “If we are to continue turning innovative ideas into businesses with international scale, we all need to play our part in shaping a vibrant economy that thrives. In this, the role of the mid-market is crucial.\n“Resilient despite the headwinds, the Top Track 250 are innovating, winning business and adapting to generate value. There is much to learn from them.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-10-04T15:00:00.000+03:00", "crawled": "2018-10-05T15:26:02.083+03:00", "highlightTitle": ""}