{"organizations": [], "uuid": "eedfa8d607b3ea7dff9429b52e1e1c62b21ab810", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article2145762.ece/ALTERNATES/s1200/3_JS153852362.jpg", "site_section": "", "section_title": "", "url": "https://www.leicestermercury.co.uk/news/local-news/spotify-netflix-horse-racing-changes-2145794", "country": "GB", "domain_rank": 48128, "title": "Spotify, Netflix and horse racing changes are all new reasons to worry about a no-deal Brexit - Leicestershire Live", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.142, "site_type": "news", "published": "2018-10-28T02:00:00.000+02:00", "replies_count": 0, "uuid": "eedfa8d607b3ea7dff9429b52e1e1c62b21ab810"}, "author": "Dan Bloom", "url": "https://www.leicestermercury.co.uk/news/local-news/spotify-netflix-horse-racing-changes-2145794", "ord_in_thread": 0, "title": "Spotify, Netflix and horse racing changes are all new reasons to worry about a no-deal Brexit - Leicestershire Live", "locations": [], "entities": {"persons": [], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}], "organizations": [{"name": "netflix", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Package holidaymakers could be left stranded if their firm goes bust Holiday protections will be lost under a no-deal Brexit\nPackage holidaymakers could find themselves with no legal protection if their holiday company goes bust.\nWe are currently protected by both UK law and the EU if our holiday provider collapses but if we book with, say, a Spanish company online, we will have no automatic protection.\nIt will also be harder for British consumers to sue European companies that sell them dangerous products because UK courts will cease to be recognised in EU countries. Caviar imports will be limited\nThis one is hardly going to plunge Brexit voters into a self-hating gloom, but it is going to be harder to bring back caviar.\nIt will join snowdrops, orchids and reptiles on 'endangered species' list and would need import and export permits to cross an EU border. Read More\nHoliday makers will have to settle for bringing back 125g of caviar from Europe. British race horses could cost far more to take to the Ireland Race horses may become much more costly to move around\nAgain, this one will not directly affect most of us, but EU horse passports would not be valid and, depending on how things turn out, the EU could force horse owners to pay £500 for travel documents to the Republic of Ireland, or stop travel altogether.\nBreeders of pedigree horses, cattle, sheep, pigs and goats could also find it harder to work with counterparts on the continent. Fishermen face being barred from EU and international waters The UK fishing fleet will be banned from EU waters (Image: Daily Mirror)\nThe Department for Environment made clear that the UK will leave the Common Fisheries Policy when it quits the EU.\nEU vessels will no longer have automatic access to British waters and UK vessels will not have automatic rights to fish in EU waters.\nExcept in cases of distress, British boats will lose their automatic right to land fish in any EU port.\nAnd they will have to notify their intention to visit and submit to inspections of their catch. We could be stuck with no way of exporting our rubbish\nThousands of tonnes of our rubbish is exported to EU countries such as Poland, particularly since China stopped taking it.\nBut if there's no Brexit deal, this will be slapped with a tangle of new red tape. Read More\nAs well as getting permission to export to the destination country, anyone trying to ship waste abroad will also have to submit a request to the EU. EU websites could be blocked in the UK Websites will have the right to refuse us service\nUK citizens are protected by a rule that prevents any online business from discriminating against customers based on their native country.\nBut since that happens to be an EU rule, we will lose that protection next year.\nA technical paper said that in the event of no agreement being reached before the UK leaves the European Union, the regulation would \"cease to have effect\" in UK law.\nUK traders wishing to operate within the EU would still have to abide by the regulations, however. Read More ", "external_links": [], "published": "2018-10-28T02:00:00.000+02:00", "crawled": "2018-10-29T00:55:57.008+02:00", "highlightTitle": ""}