{"organizations": [], "uuid": "d4f0e747ad7a9cc2573a8ebb46b854273349903d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15254218.ece/ALTERNATES/s1200/0_GWR_-NJL_081018marshall_01.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/uk-economy-stuck-rut-brexit-15254042", "country": "GB", "domain_rank": 21960, "title": "UK economy 'stuck in a rut' as Brexit uncertainty bites, business group warns", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-08T17:44:00.000+03:00", "replies_count": 0, "uuid": "d4f0e747ad7a9cc2573a8ebb46b854273349903d"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-news/uk-economy-stuck-rut-brexit-15254042", "ord_in_thread": 0, "title": "UK economy 'stuck in a rut' as Brexit uncertainty bites, business group warns", "locations": [], "entities": {"persons": [{"name": "craig hibbertcraig.hibbert@outlook.com+447967588839", "sentiment": "none"}, {"name": "adam marshall", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}], "organizations": [{"name": "british chambers of co", "sentiment": "negative"}, {"name": "bcc", "sentiment": "none"}, {"name": "chambers of commerce", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "UK economy 'stuck in a rut' as Brexit uncertainty bites, business group warns British Chambers of Commerce says firms have stopped investing and hiring has ground to a halt Share Adam Marshall, acting Director General of the BCC (Image: Craig Hibbertcraig.hibbert@outlook.com+447967588839) Get business\nThe UK economy is “stuck in a rut” amid continued uncertainty over Brexit, with some firms giving up trying to hire staff, a leading business group has warned.\nThe British Chambers of Commerce (BCC) said growth was “flatlining” and business confidence weakening.\nA survey of 5,600 businesses showed manufacturing exports were slowing and many services firms were giving up trying to hire new staff.\nRecruitment problems reported by service firms have hit an all-time high, the BCC said.\nThe study also revealed an increasing number of manufacturers expect prices to rise, mainly because of the cost of raw materials.\nUncertainty over future trading conditions is continuing to act as a brake on business investment in both the manufacturing and services sectors, the report said. An engineer working on a vehicle production line (Image: PA)\nThe balance of firms that looked to invest in either plant and machinery or training in recent months fell in both sectors to their lowest level in more than a year.\nDr Adam Marshall, director general of the BCC, said: “These figures reinforce what we are hearing from businesses up and down the country - the uncertainty over Brexit and the lack of bold moves to boost business at home are starting to bite.\n“It should be a matter of grave concern to Government that sales and orders both at home and abroad are stagnating. Read More Nissan warns of 'serious implications' for Sunderland plant over no-deal Brexit\n“Weaker sterling is no longer proving a boon to many of our exporters, while consumer spending is failing to boost the domestic market.”\nHe added: “We have a vibrant and innovative business community that wants to invest and grow but we are stuck in limbo while Brexit negotiations rumble on.\n“The upcoming Budget must deliver radical, decisive action to boost growth and productivity at precisely the moment that the economy needs it most.\n“There has never been a more important time for the Government to bolster business investment, competitiveness and productivity in the face of significant Brexit headwinds.\n“While fewer companies are trying to recruit, those that are hiring they are finding it increasing challenging to fill vacancies.\n“The sharp deterioration of the share of firms attempting to recruit is a concern and reflects both persistent hiring difficulties and heightened economic uncertainty, which if sustained could materially weaken jobs growth.”\nMeanwhile, a separate report has found that most smaller firms are having to increase pay to attract suitably skilled staff.\nA study by recruiters Robert Half found that half of employers cannot find candidates suited to the increasingly digitalised world of work.\nA survey of 600 chief finance or information officers in small to medium sized enterprises (SMEs) found problems recruiting workers with analysis and digital skills or softer skills such as critical thinking. Read More Brexit and red tape causing concerns in North East business community, survey finds\nMore than two out of five firms have increased pay in the past three years to boost recruitment.\nMatt Weston, UK managing director at Robert Half, said: “Technology and digitalisation is rapidly changing the UK business landscape.\n“This, coupled with uncertainty around Brexit, means that businesses must adapt their recruitment strategies to ensure they are equipped with the right talent to keep up.\n“The skills desired within certain roles remain specialist and unobtainable without presenting a competitive offer.\n“The skills required is changing at faster pace than their adoption among the mainstream UK workforce, creating a ‘buyer’s market’ for those who possess them.” Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-10-08T17:44:00.000+03:00", "crawled": "2018-10-08T20:19:54.028+03:00", "highlightTitle": ""}