{"organizations": [], "uuid": "ed660affa824d2f10f15f93dfd605210e6841e34", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15250361.ece/ALTERNATES/s1200/0_Damian-Hinds.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/north-east-schools-getting-24m-15254502", "country": "GB", "domain_rank": 21960, "title": "North East schools are getting £24m - we ask a minister what difference it will really make", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-08T19:04:00.000+03:00", "replies_count": 0, "uuid": "ed660affa824d2f10f15f93dfd605210e6841e34"}, "author": "Hannah Graham", "url": "https://www.chroniclelive.co.uk/news/north-east-news/north-east-schools-getting-24m-15254502", "ord_in_thread": 0, "title": "North East schools are getting £24m - we ask a minister what difference it will really make", "locations": [], "entities": {"persons": [{"name": "stefan", "sentiment": "negative"}, {"name": "damian hinds", "sentiment": "negative"}, {"name": "hinds", "sentiment": "none"}, {"name": "damien hinds", "sentiment": "none"}], "locations": [{"name": "gateshead", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "cardinal hume catholic high school", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Education Secretary Damian Hinds (Image: Stefan Rousseau/PA Wire) Get daily\nIs this the funding boost the North East's struggling schools desperately need?\nGovernment ministers have today announced a £24m funding package to boost social mobility and job prospects in the region - but what will it really mean for our schools and our children?\nAt present, the North East boasts some of the country's best results at primary school level, but after that, our children's success plummets, with fewer students leaving school to attend top universities, and more young people not in work or education after year 11 than anywhere else in the country.\nEducation Secretary Damien Hinds today visited Cardinal Hume Catholic High School, in Gateshead, to announce a £24m education funding package and discuss the region's challenges and strategies for improvement with teachers, education experts and business leaders.\nChronicleLive spoke to Mr Hinds to find out more about the scheme and ask how it could change lives for children currently being left behind.\nWhy is the North East falling behind at the moment?\n\"I don't think there is a simple answer but we did spend a lot of time talking about that exact question today.\n\"Although we do have to understand the underlying disparity, what we are really about is doing something about it.\"\nToday you spoke to local employers and head teachers - what did you say to them and what more do you think they should be doing?\n\"The main point was to listen to them, to hear their ideas and their thoughts about how everyone can work together to get more out of the brilliant talent there is in the area.\n\"The North East is particularly strong at primary level, and there are some excellent secondary schools too - I was at one today - but not enough of that promise is coming through to secondary schools.\n\"We want to see more kids from the North East going to the very top universities, we need to raise aspirations.\n\"We've announced funding today, but for me, primarily it isn't about the money. Money is obviously important, but the primary thing is how we work together to make sure opportunities are evenly spread.\n\"Concretely, some of the things we are looking at are how we can improve the transition from primary to secondary. That summer between year 6 and year 7 can be a difficult one, so we're looking at how we can keep up that momentum from primary school.\n\"Behaviour is a big issue, so we're looking at how programmes we're working on nationally can help in the North East.\n\"We're working with Teach First and local universities on training more teachers here in the region.\" Read More Ofsted results for North East schools: How do inspectors say they are performing? Cardinal Hume Catholic School, Gateshead\nHow do you plan to improve technical eduction in the region - and how can specialist technical schools avoid the pitfalls of the troubled £9m Discovery School?\n\"We are doing a lot of reform of technical and vocational education - I've just come back from a visit to Germany, to look at how they do things there, and I've drawn a few lessons from that. The close involvement of business, making sure that the qualifications themselves are really high quality and people respect them.\n\"The new T Levels, which will be rolled out in 2020, will have very high standards, with more hours at college and a very substantial industry placement, alongside a focus on things like maths and English, which will make sure young people get to experience the reality of working life.\" Read More New college must not repeat Discovery School's 'catastrophic' failings, council warns\nWe know the region struggles with teacher retention - how can you keep the best educators working here?\n\"We're bringing forward support for teachers' career development early in their careers: we want to tackle teachers' recruitment and retention nationally, and the North East will get £12m and be the first region in the country to get this support.\n\"In the North East, there are two sides to the issue: one is getting teachers to stay in teaching as a career, but also staying in the region itself, it would be nice if more of those young people who are training here would stay.\" Matt Hancock says phones should be banned from classrooms (Image: PA)\nYou've spoken about how the region's businesses and universities can help boost aspirations - how do you predict Brexit will impact on these institutions, and is this something you've taken into account in this plan?\n\"Brexit changes a lot to do with our economic relationships with our closest neighbours, but a lot of things will stay the same, and it creates a lot of opportunities around global trade.\n\"We've got to make sure education is prioritising the skills children will need for this world of global trade: giving children confidence not just in using computers but in computer programming, in knowing about the around them, learning foreign languages, which I think is a really important part of a global trade relationship.\" Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-10-08T19:04:00.000+03:00", "crawled": "2018-10-08T20:19:20.013+03:00", "highlightTitle": ""}