{"organizations": [], "uuid": "cdb5b8c8593210567920ec14687fbfac96218ef9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article1638953.ece/ALTERNATES/s1200/0_GettyImages-830392468-1.jpg", "site_section": "http://www.leicestermercury.co.uk/rss.xml", "section_title": "Leicestershire Live - frontpage", "url": "https://www.leicestermercury.co.uk/sport/football/how-world-very-different-place-2125194", "country": "GB", "domain_rank": 48128, "title": "How the 'world was a very different place' the last time Leicester City won at Arsenal", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-20T11:00:00.000+03:00", "replies_count": 0, "uuid": "cdb5b8c8593210567920ec14687fbfac96218ef9"}, "author": "Gary Silke", "url": "https://www.leicestermercury.co.uk/sport/football/how-world-very-different-place-2125194", "ord_in_thread": 0, "title": "How the 'world was a very different place' the last time Leicester City won at Arsenal", "locations": [], "entities": {"persons": [{"name": "gary si", "sentiment": "neutral"}, {"name": "pink floyd", "sentiment": "none"}, {"name": "shinji okazaki", "sentiment": "none"}, {"name": "leyland", "sentiment": "none"}, {"name": "jamie vardy", "sentiment": "none"}], "locations": [{"name": "leicester city", "sentiment": "none"}, {"name": "austin allegro", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "emirates", "sentiment": "none"}], "organizations": [{"name": "leicester city", "sentiment": "neutral"}, {"name": "european economic community", "sentiment": "none"}, {"name": "arsenal", "sentiment": "none"}, {"name": "city", "sentiment": "none"}, {"name": "leicester city fc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Sport How the 'world was a very different place' the last time Leicester City won at Arsenal Gary Silke looks back at 1973, the year City last beat the Gunners in their own back yard Share Click to play Tap to play The video will start in 8 Cancel Play now Get Weekday Leicester City FC updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nThe world was a very different place in 1973.\nBritain joined the European Economic Community, British Leyland launched the Austin Allegro, Pink Floyd released ‘Dark Side of the Moon’, the United States ended its involvement in the Vietnam War, and Leicester City won a game at Arsenal.\nIn the 45 years, and 25 visits, since then City haven’t been able to repeat that success (and neither did Pink Floyd, in my opinion).\nLast season’s Premier League curtain-raiser at the Emirates saw a brave effort. Having gone a goal down in the second minute City fought back to take the lead with goals from Shinji Okazaki and Jamie Vardy. Read More Unai Emery admits Leicester City's 'very good' Jamie Vardy will pose big threat to Arsenal\nAlthough Arsenal equalised seconds before the half-time whistle, another Vardy goal saw City regain the lead early in the second half.\nThey held that lead until the 83rd minute when, just as we were starting to think a hugely historic victory might be happening, an equaliser from Aaron Ramsey and a winner from Olivier Giroud saw normal service resumed.\nLike gravity, it seems that Leicester not winning at Arsenal is an immutable law of physics.\nEven in the title-winning season one of City’s three defeats were suffered at the Emirates. Read More\nOver the years City have had a few away fixtures where the winless runs extended to decades. Coventry, Nottingham Forest, Chelsea, West Ham… all were eventually conquered, but Arsenal remains. Arsenal manager Unai Emery (Image: Nick Potts/PA Wire)\nHaving gone through the long and painful death throes of the Arsene Wenger era, it appears that the Gunners are on the up again under new boss Unai Emery. They have won their last nine games in all competitions so current form is against City, as well as the hand of history.\nSo the trip to the Emirates for the Monday night Sky TV graveyard slot will be made more in hope than expectation.\nI ‘hope’ that someone will replace Mike Stringfellow as the last City player to score a winner at Arsenal, but I’ll be happy with a point.\nWith a newly designed £50 note on its way, public nominations for the person to be appearing on the reverse side to the Queen have been encouraged (did they learn nothing from the Boaty McBoatface affair?!). Read More Premier League great backs Arsenal to continue ‘excellent recent run’ by beating Leicester City\nCurrently in the leading pack is the familiar image of Harry Maguire riding an inflatable unicorn from England’s Russian World Cup swimming session, with over 35,000 votes and rapidly rising on a change.org petition.\nSadly, those old fuddy-duddies at the Bank of England are saying that “fictional characters, or people who are still living” will not be considered. So it looks like neither our Harry nor the unicorn, one being fictional and one alive, will be replacing those key figures of the industrial revolution Matthew Boulton and James Watt on the half a ton note.\nThe nation will be deprived of a much needed lift during this time of messy Brexit negotiations, although come to think of it I don’t think I have ever been in possession of a fifty pound note? Like us on Facebook Weekday Leicester City FC Newsletter leicestershirelive", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/leicestermercury/subscriptions/&quot;}", "http://change.org/", "https://communicatoremail.com/IN/DCF/Ad9Bw6ZcmPSmMwDi7On4yR/"], "published": "2018-10-20T11:00:00.000+03:00", "crawled": "2018-10-20T20:38:33.012+03:00", "highlightTitle": ""}