{"organizations": [], "uuid": "7c535e8bc8a23b60b9c52449c86bc9c0d3db7eb3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15272714.ece/ALTERNATES/s1200/1_A-cheeky-mock-Sports-Direct-sign-has-popped-up-in-Sunderland-to-ridicule-Newcastle-United-fans.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/see-mock-sports-direct-sign-15272489", "country": "GB", "domain_rank": 21960, "title": "See the spoof 'Sports Direct' sign in Sunderland - and we talk to the guy behind it", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-12T15:49:00.000+03:00", "replies_count": 0, "uuid": "7c535e8bc8a23b60b9c52449c86bc9c0d3db7eb3"}, "author": "Lisa Hutchinson", "url": "https://www.chroniclelive.co.uk/news/north-east-news/see-mock-sports-direct-sign-15272489", "ord_in_thread": 0, "title": "See the spoof 'Sports Direct' sign in Sunderland - and we talk to the guy behind it", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now Get Newcastle United FC updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nThis is the cheeky mock ‘Sports Direct’ sign that has popped up in Sunderland to ridicule Newcastle United fans - and ChronicleLive can reveal who has created it.\nThe shop sign - based on the logo of Magpies’ owner Mike Ashley ’s sportswear empire - takes the mickey out of angry Toon supporters over their recent protests against their club’s owner.\nAnd it has set tongues wagging as it hangs above a disused shop on Hylton Road on Mackem soil. (Image: Newcastle Chronicle)\nNow, after a bit of detective work, we can reveal that Sunderland fan and sign writer Darren Lloyd, of Seaham , is back to his old tricks and has erected another spoof sign.\n“It’s just a bit of fun, when we got relegated they put signs up. It’s just banter but if I have to take the sign down from the shop then I will. I did the Pound Shop mock-up sign on Alan Shearer a while back. It’s just tit for tat.”\nThe sign, above a former pram shop says “Pop Up Shout Shop For Sad Newcastle United Fans To Yell And Scream At’ in a direct reference to those NUFC fans who have recently taken to protesting outside of the Sports Direct store in Newcastle about Ashley’s running of his club.\nThe sign also hails Sunderland’s record-breaking six consecutive Wear-Tyne derby wins and refers to ‘horse punchers’ after a well-documented incident where one Toon fan was jailed for punching a police horse on duty after the Black Cats won at St James’ Park in 2013.\nTh sign ends says ‘scum.com’. Newcastle United owner Mike Ashley leaves a restaurant in Ponteland after a meal with Manager Rafa Benitez and the first team squad\nPaul Greenwell, 42, licencee of The Willows Pond pub, which looks directly onto the sign, said: “I suppose the sign is OK for Sunderland fans. It’s just a bit of humour, a bit of banter.\n“It slows down the traffic because people are putting on their brakes when they drive by to take a look.\n“It has been doing the rounds on social media, it’s just humour and it stops people talking about Brexit.” A cheeky mock ‘Sports Direct’ sign has popped up in Sunderland to ridicule Newcastle United fans. Pictured: Paul Greenwell, 48, licencee of the Willow Pond pub in Sunderland (Image: Newcastle Chronicle)\nAndrew Lower, 23, of Fulwell, Sunderland, said: “I’m a Sunderland AFC fan and it’s funny, just banter. I don’t think it would incite violence.\nNewcastle fans face travel disruption for their trip to Southampton later this month\n“On the other hand, if Newcastle fans did it to us, I don’t think it would incite violence either. It’s not necessarily hurting anyone, if an everyday person looks at it they will have a chuckle and understand its meaning, it’s just creating a discussion.”\nElaine Rogers, 53, of Herrington, Sunderland , who owns Avenues sandwich shop, next to where the sign is hanging, said: “It appeared yesterday, we’ve had a few signs about various things over the years. A cheeky mock ‘Sports Direct’ sign has popped up in Sunderland to ridicule Newcastle United fans. Pictured: Sunderland fan Andrew Lower, 21 (Image: Newcastle Chronicle)\n“I did a quick double take when I saw it, a lot of people think it is just banter but I think it’s too much.\n\"It’s getting a bit nasty, why not look at the positives?\n“I have seen people taking photographs of it, it’s just got a lot of people talking and I suspect it’s profile will be raised on Friday night when more people see it from the pub opposite.”\nElaine’s husband, Darren, 53, who’s not a football fan, said: “I think the sign is over the top, I don’t get why someone should do that, there is no need for it. Someone has spent money on getting that done and put in the effort and for what point.\nPaul Gascoigne and Doug Ellis - the fantastic tale of Geordie's star surprise encounter with Villa man\nI don’t understand the banter, I don’t get it, it kind of puts me off football. In fact I think this kind of thing encourages the bad side of football, in my opinion.”\nIt’s not the first time Sunderland fans have taunted their Toon rivals over their football misfortunes. In 2016 they mocked Newcastle’s relegation from the Premier League by having a 30-ft banner saying ‘AUF WIEDERSEHEN PREM’ flown over St James’ Park. Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-10-12T15:49:00.000+03:00", "crawled": "2018-10-12T17:41:15.003+03:00", "highlightTitle": ""}