{"organizations": [], "uuid": "6705efa2d2fa12cf69a929bf3aacb956f88d685a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article9829851.ece/ALTERNATES/s1200/CS78868792.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/lib-dem-leader-vince-cable-15289098", "country": "GB", "domain_rank": 21960, "title": "Lib Dem leader Vince Cable urges Theresa May to break Brexit deadlock by backing a 'People's Vote'", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-17T07:00:00.000+03:00", "replies_count": 0, "uuid": "6705efa2d2fa12cf69a929bf3aacb956f88d685a"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/lib-dem-leader-vince-cable-15289098", "ord_in_thread": 0, "title": "Lib Dem leader Vince Cable urges Theresa May to break Brexit deadlock by backing a 'People's Vote'", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "vince cable", "sentiment": "negative"}, {"name": "vince", "sentiment": "none"}, {"name": "caroline lucas", "sentiment": "none"}, {"name": "anna soubry", "sentiment": "none"}, {"name": "sadiq khan", "sentiment": "none"}, {"name": "chuk", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "liberal", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "green", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Lib Dem leader Vince Cable urges Theresa May to break Brexit deadlock by backing a 'People's Vote' Some of Theresa May's advisers are urging her to call a second referendum, says Vince Cable Share Leader of the Liberal Democrats Sir Vince Cable (Image: PA) Get daily updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nTheresa May could solve the deadlock over Brexit by offering a “People’s Vote” on her proposed EU deal, according to Liberal Democrat leader Vince Cable.\nHe claimed that some people close to Mrs May were advising her to hold a second referendum.\nSir Vince said: “We do know that there are people in her entourage who are saying ‘for God’s sake, this is your best chance of getting this thing through’.”\nHe was speaking in advance of a rally in favour of a second referendum to be held in London on Saturday.\nSpeakers include Sir Vince, London’s Labour mayor Sadiq Khan, Conservative backbencher Anna Soubry, Green MP Caroline Lucas and Labour backbencher Chukka Umunna. The People's Vote March and Rally takes place in Sunderland City Centre (Image: Newcastle Chronicle)\nOrganisers hope to attract even more people than a march in June that was attended by 100,000 protestors.\nFormer foreign secretary David Miliband is sponsoring a coach from South Shields , the constituency he represented for 12 years, to take people to the event.\nSedgefield Labour MP Phil Wilson has said he will be attending.\nThe so-called People’s Vote would include an option of scrapping Brexit and staying in the EU.\nBut Sir Vince said it could also include the option of endorsing whatever deal Mrs May agrees with the EU.\nAt the moment, it appears she will struggle to get any deal acceptable to the EU though the House of Commons because of opposition Conservative supporters of a “hard” Brexit , some of whom are members of a group called the European Reform Group.\nLabour has also said it is very likely to reject any deal Mrs May proposes. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now\nMrs May has ruled out holding a referendum, telling the House of Commons that she would carry out the decision of the 2016 EU referendum. She said: “The people’s vote happened in 2016 and the people voted to leave.”\nBut Sir Vince said: “She has of course done massive u-turns before, not least in having an early election, She has some form on this.\n“We do know that there are people in her entourage who are saying ‘for God’s sake, this is your best chance of getting this thing through’, because she has been blocked on one hand by the opposition and on the other by European Reform Group supporters.\n“If she wants to actually get this deal landed, going to the country and offering what she would present as a middle way alternative may have a certain appeal.”\nHe also insisted there was little chance of a “no-deal” Brexit happening. Read More Nissan stalls pay talks in Sunderland amid continuing Brexit negotiations\n“I know we have all been frightened by this no deal talk. It’s a bit like talking about nuclear weapons - they are not designed to be used. The chances of it actually happening are very remote.”\nOther people sponsoring coaches to the protest include actor Sir Patrick Stewart, who is sponsoring a coach leaving from his native Huddersfield, and chef Delia Smith, whose coach leaves from her home city of Norwich.\nPoliticians paying for coaches include Conservative anti-Brexit MP Anna Soubry and Tory peer Michael Heseltine.\nAlan Partridge creator and Steve Coogan and actor Jason Isaacs, who played Lucius Malfoy in the Harry Potter films, are also sponsoring coaches. Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-10-17T07:00:00.000+03:00", "crawled": "2018-10-17T09:44:07.005+03:00", "highlightTitle": ""}