{"organizations": [], "uuid": "b2e6d8af3e4bfecaf3e44f69aa353191bd1b0fe7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15344853.ece/ALTERNATES/s1200/1_budget-box.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/budget-2018-chancellor-urged-show-15346186", "country": "GB", "domain_rank": 21960, "title": "Budget 2018: Chancellor urged to show commitment to the North by backing Northern Powerhouse Rail", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-29T21:18:00.000+02:00", "replies_count": 0, "uuid": "b2e6d8af3e4bfecaf3e44f69aa353191bd1b0fe7"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/budget-2018-chancellor-urged-show-15346186", "ord_in_thread": 0, "title": "Budget 2018: Chancellor urged to show commitment to the North by backing Northern Powerhouse Rail", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "hammond", "sentiment": "none"}, {"name": "sajid javid", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}], "organizations": [{"name": "northern powerhouse rail north east", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "budget", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "North East MPs on 2018 Budget\nEarlier this month, Prime Minister Theresa May told the Conservative conference in Birmingham that the Government was “ending austerity”.\nAnd delivering his Budget speech to Parliament, Mr Hammond said: \"The era of austerity finally coming to an end.\"\nBut he also said the details of funding increases for public services would be revealed in another financial statement, the spending review, to take place next year.\nAnd he hinted that significant increases would only come about if the UK managed to secure a good Brexit deal with the EU.\nMr Hammond said: \"I expect that the 'Deal Dividend' will allow us to provide further funding for the Spending Review.\"\nHe did announce an extra £160 million specifically to for counter-terrorism policing.\nBut there was nothing to help police forces struggling to cope with cuts to regular funding.\nInstead, Mr Hammond said that Home Secretary Sajid Javid would \"review police spending power and further options for reform\" in December. Read More Theresa May promised to end austerity but the Budget hasn't delivered\nOne option the Government is believed to be considering is lifting the cap on the police precept, which is added to council tax bills.\nThis would allow Police and Crime Commissioners to raise more money for forces by increasing local taxes, possibly adding as much as £50-a-year to household bills.\nDame Vera Baird, the Labour Police and Crime Commissioner for Northumbria, said: This budget was the ideal opportunity for the Chancellor to give forces like Northumbria the resources needed to deliver the services expected by local residents.\n\"I am working hard to maintain neighbourhood policing, I had hoped that the Chancellor would have made extra money available to recruit more police officers - he didn't. \"\nMPs also criticised the decision to provide only £400 million nationally for struggling schools. (Image: PA)\nNick Brown, Labour MP for Newcastle East, said: \"The country is crying out for an ambitious regional policy to address the disparity between the South East and the rest of the country. This year’s Budget lacked any positive vision for the North East. It was a compromise budget that failed to help the areas that have suffered most from eight years of Tory austerity.\n“Over a third of children in Newcastle grow up in poverty. Due to Government cuts, our local council has been forced to reduce spending on social care for children by 37.5% since 2010.\n\"Moreover, 75% of Newcastle schools have seen staff cuts in the past two years, while class sizes have risen across the North East. It simply cannot be right that by 2022 the Government will have given £110 billion away in corporate tax changes, while vulnerable children in our region receive less and less support.”\nEasington Labour MP Grahame Morris said: \"Like many communities, areas in East Durham are being starved of funding and investment. Thirty years after a Tory government closed our industry, took our jobs, and abandoned our communities.\" Like us on Facebook", "external_links": [], "published": "2018-10-29T21:18:00.000+02:00", "crawled": "2018-10-30T04:52:36.003+02:00", "highlightTitle": ""}