{"organizations": [], "uuid": "33d6a2ceffb912a1430523d988860c91d8d26bb6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article2116791.ece/ALTERNATES/s1200/0_Brexit-2JPG.jpg", "site_section": "https://www.devonlive.com/rss.xml", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/devon-news/devon-council-votes-favour-peoples-2116768", "country": "US", "title": "Devon council votes in favour of 'People's Vote' on Brexit deal", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-16T22:57:00.000+03:00", "replies_count": 0, "uuid": "33d6a2ceffb912a1430523d988860c91d8d26bb6"}, "author": "Joel Cooper", "url": "https://www.devonlive.com/news/devon-news/devon-council-votes-favour-peoples-2116768", "ord_in_thread": 0, "title": "Devon council votes in favour of 'People's Vote' on Brexit deal", "locations": [], "entities": {"persons": [{"name": "devon", "sentiment": "none"}, {"name": "cllr musgrave", "sentiment": "none"}, {"name": "kevin mitchell", "sentiment": "none"}, {"name": "chris musgrave", "sentiment": "none"}], "locations": [{"name": "guildhall", "sentiment": "none"}, {"name": "anti-brexit", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}], "organizations": [{"name": "european union", "sentiment": "none"}, {"name": "exeter city council", "sentiment": "none"}, {"name": "green party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Devon council votes in favour of 'People's Vote' on Brexit deal The vote happened moments ago with 21 in favour and seven against Share Click to play Tap to play The video will start in 8 Cancel Play now Get\nA Devon council has tonight voted to support a 'People's Vote' on the final terms of any Brexit deal.\nExeter City Council heard the motion from Liberal Democrat councillor Kevin Mitchell which sought the council's public expression of support for a final referendum on the terms leaving the European Union.\nThe motion was proposed by Green Party councillor Chris Musgrave but presented by Cllr Musgrave in his absence. Anti-Brexit protestors gathered outside Guildhall in Exeter\nIt was passed with 21 votes in favour, seven against and one abstention.\nMeanwhile, outside Exeter's Guildhall, crowds gathered for an anti-Brexit protest. Read More\nWearing the stars of the European Union and waving large flags, campaigners in favour of a second referendum say they feel Brexit would \"harm the people of Devon and those living in Exeter\". What exactly were they voting on? Crowrds gather outside Exeter's Guildhall\nHere's the full motion on which Exeter City Council voted this evening:\nThis Council notes: 55% of Exeter residents who voted in the EU referendum voted to remain in the EU [1]. Exeter has a greater share of exports to the EU than any other city in the UK (70% of exports from the city are destined for EU countries) [2]. A recent Local Business Survey showed that confidence among SMEs in the West of England in the government to deliver a Brexit that works for business is on the wane, with only 11.69% of 230 businesses polled being confident or very confident that there will be a good deal [3]. Polling in July 2018 found that 71% of British people disapprove of how the Brexit negotiations are being handled [4]. Polling in August 2018 found that voters in the South West of England back a second referendum on the Brexit deal by a margin of 42% to 35% [5].\nThis Council believes: That the EU referendum on 23rd June 2016 should be considered the beginning of a democratic process, not the end of one. That the conclusion by the Electoral Commission that the Leave campaign committed serious offences by breaking electoral law casts doubt on the legitimacy of the result of the 2016 referendum [6]. That new information on the way the referendum campaign was conducted and the economic, environmental and social impacts of Brexit, which have come to light since the referendum, may have altered some voters’ preferences regarding desired outcomes of the Brexit negotiations. That giving the British people a final say on the Brexit negotiations will help to rebuild trust and engagement in the political process.\nThis Council resolves: To express our support publicly for a People’s Vote on the final terms of any Brexit deal. To write to our local MP, Ben Bradshaw, and the Prime Minister, Theresa May, informing them that Exeter City Council has passed this motion in support of a People’s Vote. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-10-16T22:57:00.000+03:00", "crawled": "2018-10-16T23:33:41.000+03:00", "highlightTitle": ""}