{"organizations": [], "uuid": "3969685325dfe8ea852e1410180c9ceb73108413", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.bristolpost.co.uk/incoming/article152220.ece/ALTERNATES/s1200/Stephen-Graham.jpg", "site_section": "http://www.leicestermercury.co.uk/rss.xml", "section_title": "Leicestershire Live - frontpage", "url": "https://www.leicestermercury.co.uk/news/celebs-tv/who-is-stephen-graham-actor-152239", "country": "GB", "domain_rank": 48128, "title": "Meet Stephen Graham, the Hollywood star who lives in a Leicestershire village", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-06T12:57:00.000+03:00", "replies_count": 0, "uuid": "3969685325dfe8ea852e1410180c9ceb73108413"}, "author": "leicestermercury", "url": "https://www.leicestermercury.co.uk/news/celebs-tv/who-is-stephen-graham-actor-152239", "ord_in_thread": 0, "title": "Meet Stephen Graham, the Hollywood star who lives in a Leicestershire village", "locations": [], "entities": {"persons": [{"name": "stephen graham", "sentiment": "negative"}, {"name": "john lydon", "sentiment": "none"}, {"name": "alfie", "sentiment": "none"}, {"name": "graham", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "grace", "sentiment": "none"}, {"name": "lee marlow", "sentiment": "none"}, {"name": "matt short", "sentiment": "none"}], "locations": [{"name": "hollywood", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "boardwalk empire", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}], "organizations": [{"name": "pirates", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Meet Stephen Graham, the Hollywood star who lives in a Leicestershire village The 45-year-old has starred in This Is England, Boardwalk Empire and Pirates of the Caribbean Share Stephen Graham (Image: Matt Short) Get Daily\nIt's 10.30am on Saturday morning and Stephen Graham has just got out of bed, writes Lee Marlow. He stumbles downstairs and into the kitchen with sleepy eyes and unruly bed hair, the kind of hair that points everywhere except the way it should.\nYeah, he says, knowingly. Sorry about this. And then he shrugs, holds his hands upwards and smiles, as if to say: \"Look mate, it's Saturday morning, you're in my house, my missus is making you tea, I've just got up and what you see is what you get. Take it or leave it.\"\nI take it. I like him already. \"Come on,\" he says, grabbing his Embassy No 1s, \"let's sit out the back.\"\nIn the lounge, his kids Grace and Alfie are playing on the Wii. Read More ​John Lydon on Brexit, Donald Trump and why Leicester people are 'my kind of people'\nToday is a big day in the Graham household. Today is the day Grace, aged six, and Alfie, four, will watch their film star dad on the silver screen for the first time.\nStephen – the 45-year-old who has starred in This Is England, Gangs of New York, HBO's critically acclaimed Boardwalk Empire and Pirates of the Caribbean 4 – is as excited about this as they are.\n\"They know what I do,\" he says, \"but, you know, because I normally play psychopaths and nutters, it's not something we can usually let them see.\"\nToday, that will change. They've hired a room at the Cinema de Lux in Highcross to watch Pirates of the Caribbean 4 – On Stranger Tides.\nStephen plays Scrum, a cheeky, pint-sized Cockney pirate, one part Artful Dodger, one part Les Dawson (more of this later).\nHe's not going to watch the film, he says. He knows what happens, after all.\n\"I'm just going to watch their faces. That's it for me.\"\nStephen and his family live in Ibstock, a small, former coal-mining village three miles south west of Coalville. Read More Melton news\nIt's hard to know what to say about Ibstock. It has a big Co-op. A few pubs. A population of about 5,500, an award-winning chippy, some of the most confusing mini-roundabouts you'll ever see, and a popular car parts shop called Fowkes that seems to pull in customers from all over the Midlands.\nIt's all right, but it's perhaps not the first place you'd expect to find what Johnny Depp called \"one of the finest English actors of his generation.\"\nStephen, a Scouser, has lived here for eight years; first with his mother-in-law, Sue, and then moving to a new home on the edge of the village a few months ago.\n\"I love it, mate,\" he says. \"I'm part of the furniture here. I love the sense of camaraderie in Ibstock, the community spirit. It's a proper English village.\n\"I like it that I can go into Smith's, the local butchers – they've been here for years, you know – and people are all chatting and they say hello, how are ya and the treat me like they do everyone else.\"\nLike one of them, he says. \"They've taken me in,\" he says. Read More\nWhen we heard the whispers that Stephen lived in Leicestershire, we assumed it was south of the River Soar, in one of the more salubrious villages around Harborough.\nNo, no, he says, pulling a face and shaking his head.\n\"Nah, that's not for me, really,\" he says. \"Even if I did have the money, I wouldn't want that. I prefer it here. It's more honest. It's real.\"\nSo he shops in the local Co-op, his kids go the local junior school and the local nursery and, when he's not working, he drops them off and picks them up, chatting with the local mums in the playground.\nAnd look at this, he says, pointing over the kids' trampoline, over the back garden and away into the distance, an unbroken horizon filled with rolling fields and hedges.\n\"I love that. I don't know where it is. But it's like you're looking out from Leicestershire all the way to Wales.\"\nStephen was born in Kirkby, Liverpool, a mixed race lad from a normal family who loved acting. He managed to bag a place at the Rose Bruford College of Speech and Drama in London, where he met Leicestershire girl Hannah Walters.\n\"We were bezzie mates,\" he says. \"Which is the best way, isn't it? After a while we just thought: this is daft, do you know what I mean? We like each other, we should get together.\" Read More We meet the Los Angeles porn star who comes from Wigston\nSo they did. She's still his best mate, his wife and his fiercest critic, he says.\nThey lived together in London, then Rome – where Martin Scorcese's Gangs of New York was filmed – before coming back to Ibstock.\n\"London. Rome. Ibstock,\" he says. \"I don't suppose there's many people who can say that.\"\nHis home here and everything it represents – the sense of belonging, the community spirit – is important to him, doubly so because he's away so often.\nThis week is fairly typical, he says. After the Graham family premiere of Pirates 4 in Leicester, he flies off to New York, filming Scorsese's Boardwalk Empire.\nStephen plays a young Al Capone. His wayward hair has been dyed black especially for the part.\nScorsese rang him at home and told him about the series and that he wanted him to play Capone.\n\"There was no audition,\" he says. \"He just said he wanted me to do it.\"\nHow did that feel?\nHe smiles, like a bashful kid. \"Yeah, you know, it was pretty good. Imagine that – me, this scruffy Scouser, playing Al Capone… it's .. well, it's brilliant.\"\nSo they arranged planes from here to there, first class travel tickets and top hotels in New York.\n\"But I stopped that,\" he says. \"So now, rather than fly first class from Gatwick and spend all these days in a swanky hotel in New York, I fly economy class from Birmingham.\n\"But doing that means if I have a break of four days or more, I fly back.\"\nThat was the arrangement. Fewer first class flights for more economy flights.\n\"I prefer that. It's only six hours, you know what I mean? I watch two films, have a kip, and I'm there.\"\nIt's no big deal, he says. His uncles used to do the same thing in the 80s: catch the train down to London, work on a building site for the week and then come back on Friday night for the weekend. It's no different to that really, he says.\nLife's not about the luxury, he's discovered. It's not about stepping to the left when you board a plane or ordering ridiculous things from room service at 4am. It's about family.\nSo when he did Pirates of the Caribbean, he got his agent to say, yes, he'd do it – but that he wanted to bring his family with him.\n\"So I had that in my contract. They came with me to Hawaii and we had a house right on the beach and … well, it was just like a paid holiday really,\" he laughs. Read More Hollywood's Hugh Jackman reminisces with ex-pupil on red carpet\nHe had to pinch himself, he says, the first day of filming, as they were taken out to his huge pirate galleon on a speedboat, all made up like vagabond pirates.\n\"My first acting role, at school, at the age of 10, was Jim Hawkins in Treasure Island. I used to play pirate games all the time as kid. And there I was, decked out like a pirate, on the set of the biggest pirate film in the world!\"\nThat's part of his secret, he says, retaining that inner kid, not letting it go.\n\"I watch my kids playing all the time – and, you know, they teach me more about acting than anyone else.\"\nBecause they have that complete abandon, he says. They're not afraid of letting go.\n\"Acting is all about not being afraid of making an utter pillock of yourself,\" he says. \"You have to immerse yourself into the character. I do that for every role.\"\nIn Pirates 4, he plays several scenes with Captain Jack Sparrow, Johnny Depp. The two of them are good mates.\n\"I showed him those old Les Dawson videos, the ones where Les and Roy Barraclough play Cissie and Ada, the two northern women gossiping over the fence.\n\"We should make it a bit more like that,\" Stephen suggested.\nDepp – \"a normal, decent happy-go-lucky bloke who loves his missus and kids and is dead genuine,\" he says – was happy to go with it.\n\"If you look closely, there are a few scenes with Scrum and Captain Sparrow, and you can see it, you can see what we're doing.\" Actor Stephen Graham collects money for LOROS in the Highcross shopping centre. (Image: Mike Sewell)\nAt one point, if you look closely, you'll see him pushing up an imaginary sagging bosom. \"It's my homage to Les Dawson.\"\nAt the film's UK premiere in Leicester Square earlier this month, they all went back to Johnny's hotel – him, Hannah, his 10 friends and family he'd somehow managed to sneak in – and drank until four in the morning.\nSo it's all worked out splendidly for Stephen Graham. \"It has,\" he says. \"I'm a lucky man.\"\nBut it wasn't always so. Three years ago, he nearly quit acting to become a youth worker.\nAfter his menacing performance as racist skinhead Combo in This is England, the phone stopped ringing. The scripts stopped landing on his doormat. Read More EU referendum result: How did Leicester, Leicestershire and Rutland vote?\nThere seemed to be this general presumption that all he could play was madmen, loose cannons, alcoholics and nutters.\nHe sat at home for the best part of the year. He took the kids to school; did the shopping, washed the dishes, whiled away the hours while Hannah, also an actor, worked as a teacher, keeping a roof over their heads.\nHe did some voluntary work with local youth worker Taff Thomas – \"I don't think we're supposed to call him Taff now,\" he says, even though everyone knows him as that – making little films and a documentary with local kids.\nIt was good. It lifted his spirits. The kids were brilliant, he says.\n\"I love working with kids. I got such a buzz from it. And I thought: 'Well, you know, this is all right. I could do this. Maybe I should become a youth worker, maybe this acting malarkey is over?\"\nIt was close, he says. Really close. And then the phone rang. He was offered the role of Billy Bremner in the film of The Damned United.\nThen Jimmy McGovern rang and told him he'd written an episode of The Street – the well received BBC1 drama series – just for him.\nHe read the script and loved it. Stephen Graham was back.\nHe rues the lack of decent drama on TV today. Stephen Graham and Hannah Walters with the bucket and Lionel the Loros mascot\n\"The Street was brilliant, little stories of real people, real working class life, brilliantly scripted, brilliantly filmed, so well made – and it's gone. It's been axed.\"\nAnd axed for what, he says. So we can have more celebrities on ice, more D-listers in the jungle, all this stuff about Essex and Chelsea.\n\"I despise all that,\" he says. \"And it's not just actors like me missing out, or even the audience at home – it's the cameramen, the writers, the technicians. It's a good breeding ground for so many people.\"\nThese days, when he's not working, he sticks close to home. He doesn't go out much.\n\"I used to,\" he says. \"I used to go out in Ashby at the weekend, to Ciro's, have a few, but I don't drink much now.\"\nHe never drinks beer – \"we stole a crate of it when I was a lad in Liverpool,\" he winces. \"Never again\" – and, besides, at his age, \"nearer 40 than 30\", the hangovers don't get any better.\n\"If I stick to just white wine, I'm not so bad,\" he says. \"But otherwise, forget it. You can't do that with two kids to look after, anyway. You need to slow it down a bit.\"\nSo there you go. Stephen Graham. Top actor, lovely fella, can't drink beer, loves his missus and kids, lives in Ibstock, not a nutter at all – just an actor, and a bloody good one at that. Read More 12 of the best musical acts to come out of Leicester\n\"I'm just a normal bloke,\" he says \"who feels very blessed.\n\"I was brought up the right way and my kids are brought up the right way. I teach them to have manners, and to be decent. It doesn't cost anything to be like that, does it?\"\nPirates of the Caribbean – On Strange Tides' is out now.\nIf you miss him in that, you can occasionally see Stephen Graham in the Ibstock Co-op, or Smith's butchers on the High Street. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/leicestermercury/subscriptions/&quot;}"], "published": "2018-10-06T12:57:00.000+03:00", "crawled": "2018-10-06T23:32:00.047+03:00", "highlightTitle": ""}