{"organizations": [], "uuid": "0f3465f0904926470348a72e9c85cd5fc2e1b036", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14191889.ece/ALTERNATES/s1200/Virgin-Money-profits.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15231403", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Green light for Virgin Money and CYBG £1.7bn merger", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-04T10:35:00.000+03:00", "replies_count": 0, "uuid": "0f3465f0904926470348a72e9c85cd5fc2e1b036"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15231403", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Green light for Virgin Money and CYBG £1.7bn merger", "locations": [], "entities": {"persons": [{"name": "gary grant", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "staines", "sentiment": "none"}], "organizations": [{"name": "cybg", "sentiment": "negative"}, {"name": "coreena ford", "sentiment": "negative"}, {"name": "red power ranger &", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford The Entertainer unboxes expansion plans as profits climb\nToy shop chain The Entertainer has expansion in its sights after reporting sales and profit growth last year.\nIn the 12 months to January 2018, the retailer posted a 38% increase in profit supported by a 7.4% boost to sales across all channels.\nDespite fierce competition from online-only retailers such as Amazon, which have been blamed for the demise of Toys R Us, The Entertainer’s web platform reported a 28% sales increase.\nFounder and chairman Gary Grant said the company’s “growth agenda” would continue, backed by strong trading so far in 2018.\nIn the current year, 12 new stores are due to open, while a further 10 will be refitted. The Entertainer opening in Staines had appearances from the Red Power Ranger & two Lego Ninjago characters 10.08 Coreena Ford European mobile bank N26 makes moves into UK\nEuropean bank N26 is making its first foray into the UK today, as it becomes the latest foreign lender to enter Britain’s digital banking space in recent weeks. The Berlin-headquartered mobile bank will initially be available to “friends and family” of N26 staff before rolling out to a UK waiting list that the company says is 50,000-strong.\nThe full public launch is set for November.\nThe company is currently set to operate under its European banking licence, but could seek a UK licence down the line depending on the outcome of Brexit.\nA spokesman said:\nWe have a German banking licence currently.\nIf there comes a point at which that is not sufficient, we would do everything required of us to ensure we are still authorised to operate in the market.\nWhile the bulk of its UK operations will be managed from continental Europe, where N26 employs around 500 staff, it has 10 staff who will split their time between London and Berlin.\nIts local team is expected to expand as UK services grow. N26 chief executive and co-founder Valentin Stalf said: “The UK is one of the most digitally advanced countries in the world. 9.50 Coreena Ford Carluccio's wants more North East sites after unveiling new look in Newcastle city centre\nCarluccio’s Italian restaurant in Newcastle is poised to unveil a new look and a new bar area as part of a transformation programme aiming to revive the struggling brand.\nA host of jobs are also being created at the Grey Street eatery, where the owners have spent £200,000 in a bid to create an “innovative” all-day venue in a bid to stay ahead of the competition.\nChief executive Mark Jones has pledged that longer-term plans could include the opening of more restaurants as it looks to grow once more, following the exit of loss-making sites including its Metrocentre venue.\nThe transformation in Newcastle forms part of the firm’s £10m ‘Fresca’ programme which will see it upgrade 20 restaurants a year. The programme is aimed at revitalising the brand in the wake of its company voluntary arrangement which led to it closing 30 sites from its 103-strong estate.\nCarluccio’s is looking to hire 10 people to join the existing 20-strong Newcastle team. Carluccio's Restaurant and shop on Grey Street in Newcastle City Centre (Image: The Journal) 9.45 Coreena Ford Nissan warns of 'serious implications' for Sunderland plant over no-deal Brexit\nNissan has become the latest car maker to warn of “serious implications” for its Sunderland plant and the wider manufacturing industry in the event of a no-deal Brexit.\nThe Japanese juggernaut, which has grown to employ more than 8,000 people at its Wearside plant and more than 30,000 in its supply chain, has remained relatively tight-lipped since the June 2016 referendum result.\nYet alarm bells should now be sounding after the firm – operator of the UK’s largest car plant – released a statement highlighting its fears for the future, amid moves by the government to steps up planning for a so-called no-deal Brexit when the UK leaves the EU on March 29 next year.\nThe statement says: “Since 1986, the UK has been a production base for Nissan in Europe. Our British-based R&D and design teams support the development of products made in Sunderland, specifically for the European market.\n“Frictionless trade has enabled the growth that has seen our Sunderland plant become the biggest factory in the history of the UK car industry, exporting more than half of its production to the EU.\n“Today we are among those companies with major investments in the UK who are still waiting for clarity on what the future trading relationship between the UK and the EU will look like.\n“As a sudden change from those rules to the rules of the WTO will have serious implications for British industry, we urge UK and EU negotiators to work collaboratively towards an orderly balanced Brexit that will continue to encourage mutually beneficial trade.” The Millionth Juke is built at Nissan Sunderland Plant, July 2018 9.43 KEY EVENT Newcastle Airport soars to 10-year high as passenger numbers top five million\nPassenger numbers climbed to a 10-year high at Newcastle Airport last year as it reaped the rewards of investment and new destinations.\nThe business behind the North East airport – NIAL Group Limited – has published accounts for 2017 showing passenger numbers rose 10% to 5.35m last year – an extra 490,000 travellers and the highest figure recorded in a decade.\nAirport bosses said the figures were boosted by additional capacity with low-cost airlines, as more sunshine destinations and an enhanced winter flying programme was on offer.\nOverall, revenues increased 4% to £67m and EBITDA (earnings before interest, tax, depreciation and amortisation) rose 16% to £38.7m.\nMeanwhile, operating profit increased 24% to £27.8m and last year’s pre-tax loss of £2.3m was converted to profit of £6.9m.\nA report for the year details how £11.5m of investment was ploughed into a series of improvements, including an upgrade to the hold baggage handling and check-in systems, a reconfiguration of the express car park and a replacement of part of the terminal floor. Nick Jones (Image: handout) Coreena Ford DFS annual profits scorched by heatwave\nSofa chain DFS has seen full year profits cut in half after the summer heatwave hit sales in the fourth quarter.\nPre-tax profit for the year to July 28 plummeted 48.5% to £25.8m, while underlying earnings crashed 7.6% to £76.1m.\nRevenue fell 2% to £747.7m when stripping out the benefit of acquisitions.\nDFS said: “Continued economic uncertainty for consumers, compounded by some exceptional hot weather over key trading periods in the final quarter, resulted in sales and profits for the full year falling below our expectations.”\nThe retailer saw lower-than-expected orders in its fourth quarter as the hot weather put off customers over key trading weekends. As well as warm weather woes, shipments of made-to-order products from the Far East were hit by delays at Felixstowe port, which has been thrown into turmoil after the troubled launch of a new terminal operating system.\nThis has been delaying deliveries to customers, which is when DFS records the sale on its books.\nChief executive Ian Filby struck a decidedly downbeat tone on Brexit and consumer confidence.\n“Financial results for the year reflected the exceptional downturn in market demand we saw in the fourth quarter.\n“We are pleased to note that the market has recovered since the start of the new financial year, with the group seeing like-for-like order growth across all brands over the first nine weeks.\n“We believe, however, we are benefiting from deferred purchases in the prior financial year and overall we expect the market to remain subdued into 2019, constrained by political risk and weak consumer sentiment.” In better news, group revenue including acquisitions, such as Sofology, rose 14.1% to £870.5 million, while online sales jumped 15.1%. DFS store at Teesside Park shopping centre 8.46 KEY EVENT Comcast buys Fox's Sky stake for £11.6bn\nUS cable group Comcast has confirmed an agreement to buy 21st Century Fox’s 39% stake in Sky for £11.6bn after emerging victorious in the takeover for the pay TV giant.\nComcast said it will have the backing of more than 75% of shareholders in Sky after snapping up the stake held by Rupert Murdoch’s Fox for £17.28 each.\nLast week, Comcast bought Sky shares on the open market, building up a 37.7% stake in the group.\nIt comes after Comcast won the £30bn bidding war over the British broadcaster in a rare auction held late last month by the City’s Takeover Panel.\nIts bid beat Fox’s £15.67 per share offer after the auction went to the maximum three rounds.\nThe Murdoch family will now relinquish their holding in Sky after launching the group nearly 30 years ago.\nComcast’s victory means that Mr Murdoch has failed for a second time to gain full control of Sky.\nBut since Fox made its first bid for Sky nearly two years ago, it has agreed to sell a major chunk of its own business - including its existing 39% Sky stake - to Walt Disney, which has now rubber stamped the sale to Comcast.\nComcast owns NBC Universal and is the largest cable operator in the US. With the Sky takeover, Comcast will become the biggest pay-TV provider in the world, with around 52 million customers after adding Sky’s 23 million subscribers. The Comcast Center in Philadelphia. 8.40 Coreena Ford House of Fraser and weather woes take toll on Ted Baker\nFashion chain Ted Baker has become the latest fashion firm to reveal a hit from beleaguered department store chain House of Fraser as it posted lower half-year sales and profits.\nThe retailer said pre-tax profits fell 3.2% to £24.5m in the six months to August 11, with the group writing off £600,000 owed by House of Fraser, which collapsed into administration in August and has since been bought by Sports Direct.\nTed Baker saw UK and European retail sales growth slow sharply to 1%, or 0.7% with exchange movements stripped out, as the House of Fraser woes and extreme weather took its toll.\nHigh street store sales plummeted 10.4% per square foot in constant currency, although this was offset by a 22.9% jump in online sales.\nThe group said sales were hurt in particular by dismal trading in its House of Fraser concessions leading up the department store’s collapse, as well as the “unseasonable weather” in the half-year.\nIt also warned that hotter-than-usual weather across the UK, Europe and East Coast of America had affected trading in September. “In addition, trading in the UK has been impacted by the well-publicised challenges facing some of our trading partners,” it added.\nWhile online sales now account for 29% of UK and European retail revenues, the group said its stores “remain key to the success of the e-commerce business through initiatives such as order in store, click and collect, as well as showcasing the brand”. A Ted Baker clothes store 8.30 KEY EVENT City watchdogs clear Virgin Money and CYBG merger\nNew CYBG shares are set to be issued to Virgin Money shareholders on October 15 after city watchdogs gave their approval to the banks’£1.7bn merger.\nCYBG and Virgin Money announced they have been given regulatory approval for its takeover of the Newcastle-headquartered challenger Virgin Money.\nThe groups said the Financial Conduct Authority and the Prudential Regulation Authority have given their blessing to the all-share deal.\n“Virgin Money and CYBG are pleased to confirm that, on 3 October 2018, the FCA and the PRA gave written notice to CYBG, Virgin... of their approval of the acquisition.”\nInvestors in both firms voted overwhelmingly in favour of the deal last month.\nThe union will see the owner of Clydesdale Bank, Yorkshire Bank and B brand take over the Richard Branson-backed lender, creating an entity with around six million customers.\nCYBG’s David Duffy will stay on as chief executive, leaving Virgin Money boss Jayne-Anne Gadhia to serve in a consultancy role as his senior adviser.\nThe boards of both CYBG and Virgin Money believe the deal will create the UK’s “first true national banking competitor”, offering a sound alternative to both SME and personal banking customers.\nThe combined group will rebrand as Virgin Money. Ms Gadhia has said that the tie up will “accelerate the delivery of our strategic objectives”. Jayne-Anne Gadhia, CEO of Virgin Money (Image: handout) More On", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/", "https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/15231403;"], "published": "2018-10-04T10:35:00.000+03:00", "crawled": "2018-10-04T13:07:53.051+03:00", "highlightTitle": ""}