{"organizations": [], "uuid": "6eaec92e7cc85759efb0eb73ebac0c4eedd95032", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13772798.ece/ALTERNATES/s1200/1_Augusta-Drive-2.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15281239", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Newcastle housebuilder Bellway cheers 14% profit boost", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-16T10:10:00.000+03:00", "replies_count": 0, "uuid": "6eaec92e7cc85759efb0eb73ebac0c4eedd95032"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15281239", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Newcastle housebuilder Bellway cheers 14% profit boost", "locations": [], "entities": {"persons": [{"name": "lidl", "sentiment": "none"}, {"name": "john lewis partnership", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "oxford", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "bellway", "sentiment": "negative"}, {"name": "coreena ford", "sentiment": "negative"}, {"name": "tesco", "sentiment": "none"}, {"name": "hsbc uk pensions scheme", "sentiment": "none"}, {"name": "ni week", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}, {"name": "green gb", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford Tommee Tippee cheers success after breaking into China - and moving to new headquarters\nThe owners of global baby brand Tommee Tippee are cheering a strong year following moves into huge new markets – and brand new £2m headquarters .\nMayborn Group, which employs 1,300 around the world, has published accounts for 2017 which pull together worldwide sales and profit for its entire group, including baby bottle products under the Tommee Tippee name and sleep brand Gro.\nThe firm’s revenue jumped from £81.6m to £165.7m and like-for-like sales were up 10.1%, while operating profit also soared, from £8.5m to £13.9m. Profit for the financial year ended at £4.5m, up on the previous year’s £2.9m.\nBefore its financial year end in December 2017, Mayborn entered the sleep category after snapping up the leading UK, Australia and New Zealand sleep brand Gro, which has since been launched internationally into Europe, Asia and the US.\nDuring the second quarter, and with support from its shareholder Shanghai Jahwa, the firm also launched into China, the world’s biggest baby market.\nAfter just a year, directors said it is making significant progress in becoming one of China’s leading juvenile brands with more than 3,000 distribution outlets in specialist mother and baby stores alone.\nDuring the year it also extended its full global footprint to 13 offices in eight countries – UK, France, Australia, Hong Kong, China, Italy, Morocco and US following investment in new offices in the US. Significant market share gains were also made in the US, Europe and Asia.\nFollowing the year end, in September, the group also moved its operations in Cramlington into 3 0,000sqft of office space at Balliol Business Park . 8.51 'Bellway building for the future' - Newcastle analyst\nFiona Ratcliffe, investment associate at Newcastle stockbrokers Vertem said.\nBellway have once again demonstrated strong growth in 2018, breaching the 10,000 homes barrier for the first time with the group completing 10,307 new homes in the financial year, while an all-time high sales rate of 200 reservations per week has been recorded. Revenues in the year rose more than 15% although the continued shortage of skilled labour and core materials impacted margins, although measures are in place to protect margins going forward. The Government’s Help-to-Buy incentive remains a strong contributor to sales; 39% of completions were completed using the incentive.\nThe ongoing Brexit uncertainty leaves both house buyers and builders in a state of limbo currently, but should market conditions remain robust, Bellway highlight the opportunities to further increase output over the coming year. Land continues to be invested in; an further 27 sites have been agreed upon in the year, resulting in a further 8,500 plots added to the group’s holdings.\nA new style of house type range looks to help achieve cost savings for customers, while at the same time protecting Bellway’s margins through greater standardisation. A strong financial position and a healthy cash position on the balance sheet results in shareholders receiving a 17% higher dividend than last year (143p).\nBellway’s 21% fall in share price in 2018 is more reflective of the sector, rather than Bellway’s operational progress itself is making. The new financial year (9 weeks reported) is reflecting a slight fall in sales per site and while political/Brexit uncertainty hampers the sector’s growth prospects, Bellway have demonstrated they remain in a strong position to further enhance growth. 8.43 Coreena Ford Vianet toasts good commercial progress\nInternet of Things specialist Vianet has issued a strong trading update ahead of announcing its interim results in December.\nThe Teesside telemetry solutions business, which provides data and business insight through devices connected to its Internet of Things, said trading for the first half of the current financial year is ahead of the same period last year with growth in operating profit in line with market expectations.\nThe board intends to maintain the interim dividend of 1.7 pence per share.\nA stock market announcement said the Smart Machines division delivered a strong year on year increase and that its Smart Zones division was satisfactory. The firm said: “This performance was achieved despite delays due to Pubco corporate activity and our managed compliance service being held back by the UK beer supply chain being adversely impacted by the Europe wide shortage of CO2 gas over the summer months.”\nJames Dickson, chairman, added:\nThe team continues to make good commercial progress, particularly with our telemetry and payment solutions for the coffee vending market, where momentum is being boosted by good progress integrating the Vendman acquisition. Vianet’s medium to long term prospects are exciting as we are increasingly demonstrating that our strategy of leveraging the power of our cutting edge technology to bring game changing business insight to our customers is the right one. James Dickson KEY EVENT Luxury aparthotel with three bars planned for landmark Newcastle building\nNewcastle developer the Malhotra Group has unveiled plans to create a luxury aparthotel with a glass lift and rooftop bar in a prominent Newcastle city centre building.\nThe growing leisure, care and property group, based in Newcastle, has secured 1 Mosley Street in Newcastle, the current base for the GMB union, which it plans to redevelop in a scheme which aims to be one of the first to regenerate the East Pilgrim Street area.\nIn a move to complement its nearby Grey Street Hotel, the group plans to plough £7m into bringing the whole building to life with 23 one and two-bedroom apartments, three upmarket bars and a boutique.\nA large empty void between the building’s Pilgrim Street wall and the neighbouring property could also be filled with a glass capsule lift which guests can use to reach the rooftop gardens and bar, which will have views across the city.\nA large luxury bar is proposed for the ground floor and plans are being developed to bring the basement level back to its former glory, to house a luxury members’ club providing music and entertainment, aimed at 35 to 50-year-olds, with jazz, cabaret and a collection of vintage wines and spirits.\nAround 25 jobs will be created through the scheme’s construction and a further 25 employees will be needed once the hotel opens.\nChairman Meenu Malhotra said: “This will be the first part of the regeneration of that area and the directors are all very excited and raring to go on this project. A CGI of the luxury aparthotel the Malhotra Group are planning for the corner of Mosely Street and Pilgrim Street (Image: Newcastle Journal) 8.30 Coreena Ford The Diamond in Ponteland taken over by Bar Luga owners\nGrowing leisure operator The Vaulkhard Group has revealed plans to invest in a makeover for The Diamond pub in Ponteland after taking over the popular venue.\nThe Newcastle group, which runs a host of bars and restaurants in the North East including Newcastle’s Barluga, the Mushroom Bar, Bealim House and Blake’s coffee shop, has agreed a deal to take over the management of the popular Diamond pub after being approached by owners Heineken.\nThe Diamond is a well-known and successful pub on Main Street in Ponteland which The Vaulkhard Group intends to run with no immediate change. However, the group is planning to invest in an interior refit in mid-2019.\nThe deal to take on The Diamond has come a few days after Vaulkhard secured a licence to open one of its Barluga-branded venues at the former Loch Fyne restaurant at Gosforth, following nine months of negotiations.\nThe group expects to open Barluga Gosforth next spring, where it will employ up to 40 people in full and part-time roles.\nIt will be investing heavily in its redevelopment with an internal refit planned and is also seeking to extend the lease beyond its current 11-year term. The refurbishment work will take at least six months to complete, and in the meantime gardeners and maintenance teams will be on site looking after the building and its surroundings. The Diamond Inn KEY EVENT Paddy Power Betfair fined £2.2m for failing to protect customers\nOnline operator Paddy Power Betfair is to pay £2.2m for failing to protect customers and stop stolen money being gambled.\nA Gambling Commission investigation found that the firm failed to adequately interact with customers who were displaying signs of problem gambling and failed to adequately carry out anti-money laundering checks.\nThe investigation found that two of the customers were using Paddy Power Betfair’s betting exchange and a further three were gambling using the operator’s online presence and retail premises.\nRichard Watson, Gambling Commission executive director, said: “As a result of Paddy Power Betfair’s failings significant amounts of stolen money flowed through their exchange and this is simply not acceptable. Operators have a duty to all of their customers to seek to prevent the proceeds of crime from being used in gambling.\n“These failings all stem from one simple principle – operators must know their customer. If they know their customer and ask the right questions then they place themselves in a strong position to meet their anti-money laundering and social responsibility obligations.”\nIn a response from the licensee, Paddy Power Betfair (PPB) said:\n“PPB acknowledge that certain policies in force at the relevant time were ineffective. It had already evolved those policies, and that process remains ongoing.\n“PPB recognises there have been considerable learnings from these cases and has invested in improving its AML and responsible gambling processes. PPB is also committed to working with the industry to raise standards, particularly in relation to safer gambling.” Paddy Power Betfair logo Coreena Ford Contactless payments now more popular than chip and pin\nContactless payments are now more popular than chip and Pin card payments when people pay in UK stores, according to a major payments processing company.\nPayments technology company Worldpay, which processes payments for large retailers as well as small businesses, said it is the first time it has seen “tap and go” contactless payments overtake chip and Pin.\nThe switch-over happened in June, according to Worldpay, which said 51% of in-store card transactions in that month were contactless, rising further to 52% in July.\nContactless usage jumped by around 30% in stores between June 2017 and June 2018, according to Worldpay’s analysis of its data.\nThe popularity of contactless has surged in recent years following increases to spending limits as well as a rapid expansion in places where contactless payments can be used. The current limit for single contactless card transactions is £30.\nWorldpay said fashion retailers have seen a particularly big shift from chip and Pin to contactless.\nMeanwhile, betting shops and department stores have seen significant increases in mobile contactless payments, it said. Contacless payments are now more popular than using chip and pin (Image: PA) 8.15 Coreena Ford Big businesses pledge investment in climate change fight\nMajor companies are investing hundreds of millions of pounds in schemes to cut emissions, from solar panels to overhauling their lorry fleets, it has been announced.\nThe John Lewis Partnership is phasing out all diesel-powered heavy trucks from its fleet by 2028, and is rolling out more than 500 new delivery lorries powered by 100% renewable biomethane fuel.\nAmazon is installing solar panels on depots across the UK which will generate the equivalent electricity required to power 4,500 homes, and has signed a deal to ensure 100% of the power for its UK buildings is from renewables.\nAnd HSBC UK Pensions Scheme has announced it is investing £250m in solar parks and wind farms around the country, which it said will generate enough clean electricity for the entire population of Oxford.\nThey are among 30 companies which outlined commitments to tackle climate change and help the environment as part of the Government’s Green GB and NI Week.\nThey include Lidl and Tesco launching new zero-deforestation soy policies to prevent tropical forests being cut down to grow soy, while EDF Energy plans to electrify its own fleet of 1,500 vehicles by 2030 to cut carbon emissions.\nAnd companies in the low-carbon heating sector, including Engie, Vattenfall, SSE and Metropolitan, are committing more than £320m investment to boost growth in low-carbon heating schemes for towns and cities. Firms are doing their bit in the fight against climate change. These glaciers in Argentina have been retreating due to warming temperatures. (Image: Getty Images South America) 8.10 Coreena Ford Energy firm Drax swoops for a number of Scottish Power's assets\nEnergy company Drax Group has announced it is to buy a number of Scottish Power’s assets for £702m.\nThe acquisition includes a portfolio of pumped storage, hydro and gas-fired generation assets.\nConfirmation of the deal comes after Drax said last month it was in discussions with Spain’s Iberdrola, Scottish Power’s parent company. The move marks another move away from coal-burning power stations for Drax, which has already converted four of its six generating units to burn wood pellets.\nDrax chief executive Will Gardiner said:\nI am excited by the opportunity to acquire this unique and complementary portfolio of flexible, low-carbon and renewable generation assets.\nIt’s a critical time in the UK power sector.\nAs the system transitions towards renewable technologies, the demand for flexible, secure energy sources is set to grow. We believe there is a compelling logic in our move to add further flexible sources of power to our offering, accelerating our strategic vision to deliver a lower-carbon, lower-cost energy future for the UK. Cooling towers and Biomass facility 8.00 KEY EVENT Bellway boosts profit by 14% amid strong year\nNewcastle’s national housebuilder Bellway has toasted a strong year in which profits and revenues rose.\nBellway has reported a 14.3% rise in pre-tax profits to £641.1m for the year to July 31, on revenues of £2.96bn - a lift of 15.6%.\nIts average selling price for private homes rose by 9.3% to £323,426.\nHowever, directors reiterated warnings that house price growth has “moderated, taking its toll on profit margins, and also said that demand has been “less pronounced at the higher end of the market”.\nChief executive Jason Honeyman warned that next March’s exit from the EU could also knock consumer confidence, but said that the firm was in a healthy position with strong orders.\nTrading has remained “solid” in the first nine weeks of the new financial year, with the group notching up 176 reservations per week, up 2.9% year-on-year.\nMr Honeyman said:\nThe board are mindful that the forthcoming exit from the EU in March could pose a threat to consumer confidence during the busy spring selling season.\nAssuming that market conditions remain unchanged, however, this healthy position should enable Bellway to further increase output in the year ahead.\nThereafter, the Board still see opportunities for growth in areas of high demand. Taken together with our positive initiatives to help protect the margin in the future, Bellway’s ongoing strategy for growth should deliver further sustainable, long term returns for shareholders.\nMr Honeyman, formerly chief operating officer, was appointed as chief executive in August, replacing Ted Ayres, who left the Board after a period of poor health. In addition, John Watson said he is retiring as non-executive chairman at the AGM on December 12 when he will be replaced by the current audit committee chair, Paul Hampden Smith. Bellway homes at Stannington Park More On", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/15281239;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-10-16T10:10:00.000+03:00", "crawled": "2018-10-16T10:20:40.013+03:00", "highlightTitle": ""}