{"organizations": [], "uuid": "13498038e9d930bf846fa7d0497cdc5fcca0ec3c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15222721.ece/ALTERNATES/s1200/0_HKR_NEC_31118photos_01.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/north-east-news-live-updates-15312902", "country": "GB", "domain_rank": 21960, "title": "North East news LIVE: Latest breaking news, sport, weather, traffic and travel", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-23T07:00:00.000+03:00", "replies_count": 0, "uuid": "13498038e9d930bf846fa7d0497cdc5fcca0ec3c"}, "author": "Tom Eden", "url": "https://www.chroniclelive.co.uk/news/north-east-news/north-east-news-live-updates-15312902", "ord_in_thread": 0, "title": "North East news LIVE: Latest breaking news, sport, weather, traffic and travel", "locations": [], "entities": {"persons": [{"name": "chris goddard", "sentiment": "negative"}, {"name": "tom eden", "sentiment": "none"}], "locations": [{"name": "warkworth castle", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "newcastle city centre", "sentiment": "none"}], "organizations": [{"name": "debenhams", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "m&s", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Tom Eden Dyson to manufacture electric cars...abroad\nDyson has decided to manufacture its new electric cars in Singapore, ending hopes for a site in Britain. (Image: PA)\nThe firm confirmed to staff on Tuesday that the company’s board has ratified the decision to construct its first “advanced automotive manufacturing” facility in the Asian country.\nThe factory is scheduled for completion in 2020 and is part of a £2.5 billion global investment drive in new technology.\nDyson is aiming to launch its electric vehicles in 2021.\nHowever, the move could prove controversial given that Sir James Dyson, the company’s billionaire chairman and founder, is an outspoken proponent of Brexit.\nIt also comes at a sensitive time for Britain’s manufacturing sector, with several car makers including Nissan, Ford and Toyota warning about the rising prospects of a “no-deal” EU exit, which would jeopardise their operations in the UK. 09:41 Tom Eden Salmonella warning issued\nMeat lovers have been warned to cook their food properly after a spike in confirmed salmonella cases. Salmonella warning issued over lamb (Image: Newcastle Chronicle)\nThe Food Standards Agency (FSA) has launched an investigation following the surge in people contracting the bug linked to lamb and mutton.\nShoppers can buy meat as usual, the FSA says, but should take extra care when handling and storing raw meat, and make sure to cook food like steaks and chops fully on the outside.\nIt is also reminding cooks to wash their hands thoroughly with soap and warm water when preparing food.\nThe warning comes after almost 300 cases of Salmonella Typhimurium were recorded in the last few months.\nIt first started to appear in the UK in July 2017 but control measures were put in place which led to a significant decline.\nBy May this year, 118 people had fallen ill from it.\nAnd since June, a further 165 cases have been reported – meaning a total of 283 people have been struck down by the nasty bug.\nColin Sullivan, FSA chief operating officer, said:\n‘We are advising care when preparing all meat, including lamb and mutton, to reduce the likelihood of becoming ill with Salmonella Typhimurium.\n“Our advice is to purchase food as normal but to take care when storing, handling and cooking raw meat.\n“People should wash their hands after touching raw meat, avoid contaminating other food in the kitchen by storing it separately in the fridge and using different chopping boards and knives, and ensure that meat, particularly diced and minced lamb, is cooked properly.” Newcastle Tom Eden Stagecoach extends £1 single fare offer\nStagecoach is extending an offer where passengers are charged just £1 to use Newcastle’s new night bus service. (Image: Stagecoach)\nThe operator reintroduced a weekend night bus in September, giving passengers another way to get home from their nights out on Fridays and Saturdays.\nThe service runs until 3am on Saturday morning and 3am on Sunday morning, taking passengers from the city centre to areas including Jesmond , Kenton, Heaton , Walker, Byker, West Denton, Newbiggin Hall and Westerhope.\nPassengers can now take advantage of £1 single fares until Sunday, November 11, as Stagecoach has extended an introductory cut-price offer. Originally, the special low fares were only available until October 14.\nSteve Walker, Managing Director, Stagecoach North East, said:\n“After listening to our customers and responding to their feedback in relation to night services around Newcastle, we are delighted to extend our special offer for the night bus until mid-November, providing an alternative and cheaper travel service to help Newcastle residents and visitors save money on taxi fares.\n“Newcastle is an extremely popular city with a thriving restaurant , entertainment and nightlife scene and our new night service will provide affordable and frequent travel to further boost the night time economy and the city’s reputation as a great night out.\n“With so many people working varying shift patterns and enjoying evenings in the city centre, this service is designed to support customers seeking value for money travel in the early hours of the weekend.”\nServices include N1, N30, N39, N40 and N88, from Pilgrim Street and Blackett Street. 09:30 Tom Eden Metro delays continue\nThere are still delays of up to 20 mins to trains running between St James and Chichester due to earlier trees on the overhead line at Cullercoats and a train failure at Chichester. Prudhoe KEY EVENT Benefit cheat claimed over £78,000\nA £78,000 benefit cheat wants to get out of doing unpaid work - claiming she’s incapable of doing it. (Image: ncjMedia)\nKathryn Leathard fleeced taxpayers for five years by claiming to be a single mum.\nShe dodged jail last year due to her three kids.\nInstead, she was handed 140 hours of unpaid work to do.\nBut now she’s trying to get that scrapped, claiming it is “unworkable”.\nThe 30-year-old was due at South Tyneside Magistrates’ Court on Monday but failed to show.\nThe court heard she had called up that day claiming she was “too anxious” to attend.\nLast year the Prudhoe woman pleaded guilty to three benefit fraud offences, receiving a 12-month suspended sentence along with the community service.\nShe’d claimed tax credits, income support, council tax benefit and housing benefit on the basis she was living alone.\nBut inspectors realised she was living with her partner - after his Just Eat account was registered to her Parkwood Avenue address.\nSentencing Leathard in November, Judge Stephen Earl slammed her for taking from the public purse.", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/", "https://www.fish4.co.uk/jobs/north-east-england/", "http://www.twitter.com/tomeden11", "https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/15312902;"], "published": "2018-10-23T07:00:00.000+03:00", "crawled": "2018-10-23T08:31:55.005+03:00", "highlightTitle": ""}