{"organizations": [], "uuid": "9f3a9c788108ff40ff79cd4c666c554fa4f79369", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article2067153.ece/ALTERNATES/s1200/0_secmaton-lane1PNG.png", "site_section": "https://www.devonlive.com/rss.xml", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/devon-news/latest-new-critical-link-road-2067128", "country": "US", "title": "Latest on new ‘critical’ Link Road in Dawlish that will help speed up delivery of 1,000 new homes", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-02T18:38:00.000+03:00", "replies_count": 0, "uuid": "9f3a9c788108ff40ff79cd4c666c554fa4f79369"}, "author": "Richard Booth", "url": "https://www.devonlive.com/news/devon-news/latest-new-critical-link-road-2067128", "ord_in_thread": 0, "title": "Latest on new ‘critical’ Link Road in Dawlish that will help speed up delivery of 1,000 new homes", "locations": [], "entities": {"persons": [{"name": "dawlish", "sentiment": "none"}, {"name": "cllr humphrey clemens", "sentiment": "none"}, {"name": "andy styles", "sentiment": "none"}], "locations": [{"name": "link road", "sentiment": "none"}, {"name": "exeter road", "sentiment": "none"}, {"name": "secmaton lane", "sentiment": "none"}, {"name": "homes england", "sentiment": "none"}, {"name": "secmaton link road", "sentiment": "none"}], "organizations": [{"name": "sainsbury", "sentiment": "none"}, {"name": "housing infrastructure fund", "sentiment": "none"}, {"name": "teignbridge district council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Latest on new ‘critical’ Link Road in Dawlish that will help speed up delivery of 1,000 new homes As part of the Dawlish Urban Extension, 1,685 new homes are planned Share Gv of Junction of Exeter Road and Secmaton Lane, Dawlish (Image: Andy Styles) Get Daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nA new ‘critical’ Link Road in Dawlish that will help speed up the delivery of nearly 1,000 new homes will be fully funded by the Government.\nEarlier in the year, it was announced that Teignbridge District Council had secured £4.2m of funding from the Government’s Housing Infrastructure Fund for the Secmaton Link Road.\nAt Tuesday morning’s executive meeting, Cllr Humphrey Clemens, Teignbridge District Council’s Executive Portfolio Holder for Housing and Planning, announced that the scheme has not only received internal approval from Homes England, but that an additional £700,000 of funding for the road would be provided.\nThe new road, which will link from the A379 roundabout opposite the Sainsbury’s to Secmaton Lane, along with a new bridge and high quality pedestrian and cycleway, has been called by the council a critical strategic road project that will help unlock delivery of 350 new homes and accelerate more than 500. Read More Council's meeting over free public Wi-Fi somehow turns into row over Brexit The Dawlish Urban Extension and the new Link Road\nAs part of the Dawlish Urban Extension, 1,685 new homes are planned, and the new road is considered vital for the building of nearly 850 homes.\nCllr Clemens said: “Members were concerned that the link road not being provided first would cause serious problems. We agreed that the link road should go in first and went back to and have achieved more funding. This is a great news story for the area and we will look forward to more stories coming like this in the future.\n“The biggest bonus of this is that the money doesn’t have to be clawed back from developers. If we had to then probably we would be not be getting any affordable housing on the site, but this means we are getting the most amount of affordable housing we can.” Read More", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-10-02T18:38:00.000+03:00", "crawled": "2018-10-02T19:09:15.007+03:00", "highlightTitle": ""}