{"organizations": [], "uuid": "052017f60bedf991064b25ee2beb71f1dbc30b5d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article2092489.ece/ALTERNATES/s1200/0_business-festivalJPG.jpg", "site_section": "", "section_title": "", "url": "https://www.devonlive.com/news/devon-news/diversity-businesses-together-festival-2092486", "country": "US", "title": "Diversity of businesses together at festival - Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-10-10T03:00:00.000+03:00", "replies_count": 0, "uuid": "052017f60bedf991064b25ee2beb71f1dbc30b5d"}, "author": "Guy Henderson", "url": "https://www.devonlive.com/news/devon-news/diversity-businesses-together-festival-2092486", "ord_in_thread": 0, "title": "Diversity of businesses together at festival - Devon Live", "locations": [], "entities": {"persons": [], "locations": [{"name": "torquay", "sentiment": "none"}, {"name": "riviera international conference centre", "sentiment": "none"}], "organizations": [{"name": "bmw", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Diversity of businesses together at festival With 70 exhibitors, an impressive line-up of speakers, speednetworking and even the opportunity to win a BMW for the weekend, it will be an action packed day for everyone Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nTHE Torbay Business Festival at the Riviera International Conference Centre in Torquay tomorrow will bring together businesses from areas such as recruitment, construction, media, tourism, solicitors, accountants, taxi firms, banks and flower shops.\nThe event from 10 am to 4pm is designed to bring people together to celebrate the diversity of local businesses. Entry is free for delegates and people can arrive anytime during the day – whether they are small, medium, large businesses, or new start-ups, those thinking of starting business, organisations, students.\nWith 70 exhibitors, an impressive line-up of speakers, speednetworking and even the opportunity to win a BMW for the weekend, it will be an action packed day for everyone. Read More Which favourite event or festival gets your vote?\nThe morning speakers include the Herald Express’ Jim Parker talking about Torbay Together, Carolyn Custerson from the English Riviera BID Company, and award winning, Brixham-based Flossy and Jim. From noon there will be a Speednetworking event, run by Barry Cole from The Resultant – a great way to meet many new people in a short space of time. The afternoon’s line-up includes Russell Beck from Impellam Group Plc, giving a thought-provoking talk on the Future of Work before Cosmic’s Julie Hawker shares Digital Media tips to boost your business. Read More Farage and Rees-Mogg are going for a Wetherspoons together as part of a Devon Brexit rally\nIn between the presentations, people can visit all the exhibitor stands and enjoy networking with local businesses and there will be a Bays Brewery sponsored reception as the exhibition officially ends at 4pm.\nThe festival has been organised by the local voluntary group, Torbay Business Forum and is sponsored by the TDA and Bays Brewery.\nFor more information click torbaybusinessforum.org.uk Like us on Facebook ", "external_links": [], "published": "2018-10-10T03:00:00.000+03:00", "crawled": "2018-10-11T04:47:45.001+03:00", "highlightTitle": ""}