{"organizations": [], "uuid": "ca469c7c4cca62543e3f306ab8967103db9db286", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15263591.ece/ALTERNATES/s1200/0_Untitled-design.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/government-blood-hands-unless-ends-15262931", "country": "GB", "domain_rank": 21960, "title": "Government will have \"blood on its hands\" unless it ends Universal Credit immediately, MP warns", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-10T20:00:00.000+03:00", "replies_count": 0, "uuid": "ca469c7c4cca62543e3f306ab8967103db9db286"}, "author": "Hannah Graham", "url": "https://www.chroniclelive.co.uk/news/north-east-news/government-blood-hands-unless-ends-15262931", "ord_in_thread": 0, "title": "Government will have \"blood on its hands\" unless it ends Universal Credit immediately, MP warns", "locations": [], "entities": {"persons": [{"name": "ian lavery", "sentiment": "none"}, {"name": "gordon brown", "sentiment": "none"}], "locations": [{"name": "wansbeck", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}], "organizations": [{"name": "universal credit", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Government will have \"blood on its hands\" unless it ends Universal Credit immediately, MP warns The Wansbeck MP has called for an end to the controversial benefit, which is set to be fully rolled out in Northumberland from November Share Wansbeck MP Ian Lavery, a protest against Universal Credit, and a Job Centre Plus Get daily updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nA North East MP has demanded the \"immediate scrapping\" of controversial benefit Universal Credit.\nThe system will worsen child poverty, increase homelessness and even lead to people taking their own lives, Wansbeck MP Ian Lavery has claimed.\nFormer Prime Minister Gordon Brown warned the country could face \"chaos\" similar to the poll tax riots if the national roll out continues, in the Daily Mirror today,\nHe branded the welfare reforms a \"cruel and vindictive\" experiment that will exacerbate the \"convulsions\" of Brexit and risk public disorder.\nThe Government says the reforms ensure working is worthwhile for claimants and simplifies the benefits system. But opponents believe it leaves claimants worse-off, and creates delays which leave people waiting for much-needed cash.\nNow, Labour Party Chair Ian Lavery has called for an end to Universal Credit, predicting dire consequences for Northumberland if the roll out goes head. Ian Lavery (Image: Daily Mirror)\nHis words come as one charity says it's preparing for a huge spike in demand as Northumberland sees the full introduction of the controversial system, which rolls job seekers' allowance, tax credits, housing benefit and income support into one payment, in November and December.\nPreviously one of the country's \"live service areas\", where the new benefit was first introduced to single unemployed people without children, while families and others awaited the full introduction, following changes to the system in January, Northumberland will now see Universal Credit introduced for almost everyone before the end of the year.\nIn November, the benefit will be fully introduced in Ashington, Berwick, Cramlington and Morpeth job centres.\nBy December, it will be introduced Alnwick, Bedlington, Blyth, and Hexham. Read More Workers are being hired to help us cope with 'Brexit disruption' - and could earn £46,000 a year\nMr Lavery said: \"This political policy will lead to the deaths of people across the UK and in addition to worsening almost every social issue imaginable, from child poverty to increases in homelessness, I believe for the most vulnerable in our communities and especially those with mental health issues, I fear this cruel and callous decision will tip people over the edge.\n“We are passed the point of no return and the only reasonable action is for Universal Credit to be immediately scrapped.\" Unite Community members and campaigners in Newcastle raise awareness of Universal Credit impact\nHe added: \"Today, on world mental health day, I have written urgently to the Prime Minister to make her aware of the irreparable damage her policy is going to inflict on countless UK residents.\n\"I firmly believe that if the government continues to push forward this nonsensical and vicious agenda, they will have blood on their hands.”\n\"Many vulnerable people may feel they have no option other than taking their own lives, something which is utterly devastating,which I have seen happen to constituents of mine before.\"\nThe Briardale Centre, in Blyth, acts as a distribution centre for the local foodbank. Staff there link Universal Credit to unpredictable spikes in demand, as people face sanctions which can last for weeks.\nAs the new system is introduced for all the area's families, they say they're preparing to be especially busy. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now\nManager Graham Harper said: \"Over the last six months, we've seen an increase in referrals, and I would say about 80% of those are people who've had problems with money management. Of those, about 60% is down to the sanctions system, so it's not an ideal system.\n\"It makes it very difficult to be able to effectively plan what our demand is, and there's a lot of pressure from these short term spikes.\n\"Many people accessing the foodbank are in very difficult stages of their lives and the foodbank is there as a safety net. We fear the changes with the total roll out of Universal Credit will further complicate complicated circumstances and place undue burden on people and families who are already struggling\".\nHe says staff are planning for increased demand as people wait up to five weeks for their new benefit to come in, while the fact that families will now be claiming means even more food will be required.\n\"We are trying to ensure we are ready for a spike as it's rolled out and people wait to get their payments,\" he said.\n\"Along with the pressure of Christmas coming up - a five week wait for payments could take people right up to Christmas.\" Read More Is it enough? Here's what North East teachers think of the Government's £24m funding pledge\nIn Parliament today, Prime Minister Theresa May defended the system, saying it will ensure one million disabled households get around £110 a month more.\nA Department of Work and Pensions spokesperson said Universal Credit 'simplifies an out-of-date, complex legacy system', adding: \"It removes the '16 hour rule' which disincentivised work, and covers 85% of child care costs to support claimants in work.\n\"Each claimant is assigned a one-to-one work coach, who is able to provide tailored support, addressing each individuals specific needs and barriers into work.\n\"Through our 'test and learn' approach, significant improvements have been made to the system, such as making 100% advances available, removing the seven waiting days, and providing two additional weeks of housing benefit for claimants moving from legacy benefits to Universal Credit.\" Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-10-10T20:00:00.000+03:00", "crawled": "2018-10-10T20:59:44.032+03:00", "highlightTitle": ""}