{"organizations": [], "uuid": "78a48755fb647f00604c8da62ad310f44d38aeae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15148789.ece/ALTERNATES/s1200/0_Dominic-Raab-Speaks-On-Government-Plans-In-The-Event-Of-A-No-Deal-Brexit.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/brexit-deal-dominic-raab-uk-15259958", "country": "GB", "domain_rank": 21960, "title": "UK is 'closing in' on a Brexit deal, according to Brexit Secretary Dominic Raab", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-09T20:42:00.000+03:00", "replies_count": 0, "uuid": "78a48755fb647f00604c8da62ad310f44d38aeae"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/brexit-deal-dominic-raab-uk-15259958", "ord_in_thread": 0, "title": "UK is 'closing in' on a Brexit deal, according to Brexit Secretary Dominic Raab", "locations": [], "entities": {"persons": [{"name": "dominic raab uk", "sentiment": "negative"}, {"name": "dominic raab", "sentiment": "negative"}, {"name": "raab", "sentiment": "none"}, {"name": "catherine mckinnell", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "chequers", "sentiment": "none"}], "organizations": [{"name": "brexit", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "newcastle north", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "UK is 'closing in' on a Brexit deal, according to Brexit Secretary Dominic Raab As Brexit day gets closer, the Government insists progress is being made in talks with the EU Share Brexit Secretary, Dominic Raab (Image: Getty Images Europe) Get daily updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nBrexit Secretary Dominic Raab has told MPs the Government is “closing in” on a Brexit deal with the EU.\nHe said: “On the withdrawal agreement, while there remains some differences, we are closing in on workable solutions to all of the key outstanding issues.”\nMr Raab spoke in the House of Commons, but there was criticism of Prime Minister Theresa May’s failure to deliver the statement herself.\nNewcastle North MP Catherine McKinnell said: “Everyone knows Theresa May’s so-called Chequers plan satisfies no one, so it’s not surprising she wasn’t even prepared to come to Parliament today to defend it.\n“Sadly for areas like the North East, her focus over the last two years has been on holding the Tory party together, rather than the national interest - and she is not even managing to do that.\n“So, with less than six months before we are due to leave the EU, the prospect of a bad deal, or even worse no deal at all, is now looming ever larger on the horizon.\n“This would be a disaster for the North East’s economy, and we would be left paying a very heavy price for the Prime Minister’s failure. I don’t think anyone voted for that back in 2016.” British Labour Party politician Catherine McKinnell (Image: Newcastle Chronicle)\nMs McKinnell repeated her call for a so-called People’s Vote on whether to accept the proposed Brexit deal once it becomes clear.\n“There’s only one democratic way out of this mess - and that’s to put it back to the people to decide how we should proceed, through a People’s Vote.”\nBrexit is due to take place on March 29, 2019.\nIn a sign of the difficulties Theresa May will face getting Parliamentary approval for a deal, former Brexit Secretary David Davis said there would “dire” consequences for Conservatives at the next general election if the Government sticks to its current plans. Read More Watch Theresa May dance to Abba in one of the cringiest stage walk-ons you'll ever see\nIn a letter to fellow Tory MPs, Mr Davis said a deal based on Theresa May’s Chequers plan would deliver “none of the benefits of Brexit” and reduce the UK to being “a rule-taker from Brussels”.\nMr Davis said that if a deal of this kind is struck, it will be “very obvious” to voters at the next general election that the Government had broken promises from the 2017 Conservative manifesto and the Prime Minister’s Lancaster House speech setting out her Brexit “red lines”.\nHe repeated his call for the Cabinet to ditch the Chequers plan, which envisages a free trade area for goods based on a “common rulebook”, and go for a looser free trade agreement like the “Ceta” deal between the EU and Canada. Read More", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-10-09T20:42:00.000+03:00", "crawled": "2018-10-10T00:07:26.006+03:00", "highlightTitle": ""}