{"organizations": [], "uuid": "950b312c111c6339fa983a788f8ac7d790c451ef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14888496.ece/ALTERNATES/s1200/IBP_NEC_041116aldi_04JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15220483", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast RECAP: Aldi opening 130 new stores creating 5,000 jobs", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-01T10:05:00.000+03:00", "replies_count": 0, "uuid": "950b312c111c6339fa983a788f8ac7d790c451ef"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15220483", "ord_in_thread": 0, "title": "Business Breakfast RECAP: Aldi opening 130 new stores creating 5,000 jobs", "locations": [], "entities": {"persons": [{"name": "eldon robson", "sentiment": "none"}, {"name": "fentimans", "sentiment": "none"}, {"name": "fenti", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}], "organizations": [{"name": "aldi", "sentiment": "negative"}, {"name": "coreena ford", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford Fentimans launches new flavours as premium drinks markets continues to fizz\nBotanical drinks favourite Fentimans has raised a glass to a strong year as sales of its bottled brews rose 25% to top £30.1m.\nThe Hexham-headquartered firm was relaunched more than 20 years ago by founder Eldon Robson, who worked with scientists to recreate a 100-year-old recipe for ginger beer.\nSince then, the firm has grown to sell premium mixers and ‘grown up’ fizzy drinks in all major UK supermarkets as well as farm shops, restaurants, cafe, pubs and through retailers and distributors across the world.\nLatest accounts show its exports prowess is continuing thanks to a major brand relaunch, with UK sales growing by 18% to £19m and overseas sales soaring by 37% to £11.1m.\nWhilst its top line grew by a quarter, gross profit of £8.5m was £500,000 higher, but after charging administration costs of £7.9m – 13% higher than the previous year – pre-tax profit dropped from £1m to £634,000, which the firm attributed to significant expenditure on new product development and its packaging relaunch. Fentimans Yuzu Tonic (Image: Grumpycockstudios) 9.05 Coreena Ford BT Workers transfer to Openreach\nThousands of BT workers will transfer to infrastructure arm Openreach on Monday, completing a “major milestone” in creating the separate business.\nThe transfer of 31,000 workers, including fibre broadband engineers, is believed to be the biggest one-off transfer of employees in UK corporate history. Openreach chairman Mike McTighe said: “This is an important day for Openreach as we’re fulfilling the commitments to Ofcom under the Digital Communications Review.\n“Openreach now has its own board, greater strategic and operational independence, a separate brand and an independent workforce, and we’re ambitious for the future.\n“We’ve set out a clear plan to invest in new, more reliable, future-proof broadband technology, and we’re right in the middle of our largest ever recruitment drive for 3,500 engineers.\n“We’re determined to continue improving customer service, collaborating closely with our customers, and spearheading the national rollout of next generation broadband networks.” Thousands of BT workers are transferring to Openreach (Image: BILLYPIX) 9.00 Coreena Ford Carillion collapse continues to have knock-on effect for construction industry\nThe number of construction firms going insolvent increased by a fifth following the collapse of Carillion earlier this year, a new study shows.\nA total of 780 companies in the industry fell into insolvency in the first quarter of 2018, a 20% rise on the same period a year ago, said accountants Moore Stephens.\nThere were 2,764 insolvencies among building firms in the 2017/18 financial year, up by 6% on the previous 12 months, said the report.\nCarillion was involved in large-scale projects across the UK and internationally, including military bases, hospitals and road and rail projects, and, following its liquidation, thousands of sub-contractors lost significant amounts of work and were left with a substantial bad debt, said Moore Stephens.\nSpokesman Lee Causer said: “The collapse of Carillion sent shockwaves through the construction sector, and we are seeing more insolvencies as a direct result.\n“Large construction companies are infamous for squeezing the profit margins of the contractors and sub-contractors who work for them. These contractors often cannot negotiate against the terms set for them by their larger clients.\n“Small to medium-sized enterprises and specialist sub-contractors have been hit particularly hard by Carillion’s fall, as many of them will have relied on the giant for significant amounts of their work. “It is also likely that these sub-contractors would have had to write off virtually everything owed to them by Carillion.” Thousands of jobs, including a number in the North East, have been lost since Carillion went into liquidation in January (Image: PA) 8.52 KEY EVENT Manufacturers are 'applying brakes to investment plans', study reveals\nManufacturers have “sharply applied the brakes” to investment plans amid growing political uncertainty, a new study reveals.\nResearch among more than 230 firms by the EEF manufacturers’ organisation and Santander bank also showed rising fears of the impact of global trade tensions.\nOnly a third of companies plan to increase their investment in plant and machinery, the lowest figure in the survey’s five-year history.\nThis sentiment is especially pronounced for small companies, where three quarters of companies are refraining from increasing their investment in the coming two years.\nEEF chief economist Lee Hopley said:\nThese figures put into sharp focus the widening gap between the investment manufacturers know they need to make to capitalise on growth opportunities and to adopt productivity-enhancing technologies and the hurdles they face in getting those decisions over the line.\nThe upcoming Budget needs to take some bold steps to support companies in addressing this shortfall until the clouds of uncertainty start to lift.\nPaul Brooks, of Santander, said:\nIt is understandable given the current uncertain political and economic conditions in the UK that manufacturers are being cautious in their key investment decisions. Workers in a factory (Image: PA) 8.45 Coreena Ford Planet Organic devoured by Scottish private equity firm\nPlanet Organic, the trendy health food chain, has been sold to Scottish private equity firm Inverleith in a deal thought to be worth around £15m.\nThe deal will result in a pay day for founder Renee Elliott who is reducing her holding in the business she founded in 1991.\nInverleith said that it will now look to double Planet Organic’s existing seven-store London footprint over the next five years.\nIt represents the latest deal in the sector, following the £1.7bn sale of Holland & Barrett to Nature’s Bounty and Amazon’s £10.7bn acquisition of Whole Foods, both last year.\nInverleith chairman Ben Thomson said:\nThis is an interesting time of change for the high street with shoppers wanting more community-based shopping.\nConsumers are looking for an experience when they shop and for real knowledge about the products offered.\nThey care deeply about the quality and provenance of products they buy and increasingly search for items which help them lead a holistic healthy lifestyle. 8.40 Coreena Ford Co-op steps up funeral price war with new guarantees\nThe Co-op has stepped up its efforts in a price war with other funeral providers with an extension on its guarantee to beat competitor quotes.\nIn yet another aggressive move designed to put pressure on its rivals, Co-op extended its price guarantee to all funeral plans and probate fees.\nThis is on top of a previous promise to beat quotes for funeral service costs on a like-for-like basis, which was announced early in September.\nThe additional guarantee covers plans taken out by the living in preparation for their own funerals.\nSome 70,000 people took out funeral plans with Co-op, which is the UK’s biggest funeral provider, last year. It will also apply to the cost of administering a grant of probate, which can on average amount to £4,500.\n“Every year, thousands of families are having to find significant sums to arrange the funerals of their loved ones and are seeing any inheritance left, reduced by probate fees,” said Robert Maclachlan, managing director of Co-op funerals and care and life planning.\n“By introducing these new measures, we hope that more people will plan ahead with confidence and families who are left to deal with probate can trust that they’re getting the best price,” he added. The Co-operative Group has extended its price guarantee to all funeral plans. 8.31 Coreena Ford Newcastle University outlines its vision to become a world leader\nNewcastle University has set out a vision to make itself a world leader in areas that will make a difference to millions of people around the world.\nUniversity vice-chancellor Prof Chris Day will unveil the vision – titled “From Newcastle. For the world”– to staff with the hope that the institution will have a greater impact on society, both locally and around the world.\nThe university injects more than £1bn into the regional economy, bringing 28,000 students to Newcastle and employing over 6,000 people.\nBut it is facing increasing challenges from other universities and factors such as Brexit that threaten both its income and its standing on the world stage.\nThe university is not looking to kick start a major expansion of student numbers – though it could take more overseas students. Newcastle University KEY EVENT Entrepreneurial Awards recognise North East business leaders\nThe North East’s leading business figures have been recognised by the Entrepreneurs’ Forum at its 15th annual Entrepreneurial Awards.\nHeld in partnership with the North East Local Enterprise Partnership (NELEP), each year, the North East Entrepreneurial Awards honours entrepreneurs leading dynamic, innovative businesses and who are making a genuine change to the region.\nMore than 350 members of the region’s business community attended the event at the Hilton Newcastle Gateshead hotel.\nLianne Walker MBE, group managing director of Washington-based Walker Filtration, was named Entrepreneur of the Year, the evening’s most coveted award.\nAfter taking over the company from her father in 2005, the firm has grown to become a £30m turnover business, and is set to become one of the world’s largest manufacturers of filtration products after it was acquired by Swedish firm Atlas Copco, in March.\nSunderland-based entrepreneur Paul Callaghan CBE was presented with the Lifetime Achievement Award.\nKevin Brown, managing director of Houghton-le-Spring based home services company Pacifica Group, was the winner of the Scale-Up Award.\nThe Emerging Talent award was presented to Jordan McCabe of Aztec Diamond Equestrian, who has turned a childhood passion for horse riding and clothing design into a successful and highly profitable business, and Pamela Petty was named Mentor of the Year after founding her own entrepreneur mentoring business, Entreprenising, in June 2016\nJames Robson, chairman of the Entrepreneurs’ Forum, said:\nWe received extremely strong nominations in each of the categories which are very encouraging for the future of innovation and the creation of bold and successful businesses here in the North East.\nI hope this will inspire the current crop of emerging entrepreneurs and I look forward to hearing about their success stories at future awards events. The winners of the North East Entrepreneurial Awards 8.19 Coreena Ford See inside Newcastle office with a park, trees, benches and an American style diner\nA park with swings, trees and an American style diner aren’t typical finds in offices, but one North East firm is daring to be different .\nMayborn Group has become a major contender for the North East’s coolest office crown after opening its new headquarters at Balliol Business Park, built to reflect its vision to become the world’s most loved baby company.\nThe firm, the North East company behind the global brand Tommee Tippee and sleep experts Gro, has invested £2m in its new headquarters, a 30,000 sq ft building bringing all staff from its previous HQ at Dudley, North Tyneside, under one roof in a colourful base from which it can develop its global expansion.\nThe 160 staff move into the building on Monday, and with the business planning to grow to more 200 people, the firm’s CEO Steve Parkin hopes the colourful and creative environment will attract staff keen to join the company.\nHe said: “We are trying to build our brand from the North East – 60% of our business is overseas but the creativity comes from here, so I wanted to get a space which had the social space for teams to have a feeling of creativity and fun – that was the brief to the designers.\nAnd designer Ben Johnson have certainly achieved that. . . Mayborn Group's new HQ at Balliol Business Park 8.10 Ryanair issues profit warning\nRyanair has warned that full-year profits will be 12% lower than expected.\nIt has lowered the range from 1.25-1.35 billion euro (£1.1-1.2 bn) to 1.1-1.2 billion euro (£978m to £1bn).\nThe budget airline said it suffered a drop in traffic due to co-ordinated pilot and cabin crew strikes in September, which has hit consumer confidence and knocked forward bookings in the third quarter.\nRyanair also cited higher oil prices.\nRyanair chief executive Michael O’Leary said:\nWhile we successfully managed five strikes by 25% of our Irish pilots this summer, two recent co-ordinated strikes by cabin crew and pilots across five EU countries has affected passenger numbers (through flight cancellations), close in bookings and yields (as we re-accommodate disrupted passengers), and forward air fares into Q3.\nWhile we regret these disruptions, we have on both strike days operated over 90% of our schedule. “However, customer confidence, forward bookings and Q3 fares has been affected, most notably over the October school mid-terms and Christmas, in those five countries where unnecessary strikes have been repeated. A Ryanair plane (Image: PA) 8.00 KEY EVENT Aldi plans to open 130 new stores\nAldi has confirmed plans to open 130 new stores in the UK over the next two years after sales hit a record high in 2017.\nThe German grocer said the move will create 5,000 jobs, while helping it move towards a previously set target of 1,000 stores by 2022.\nThe network will be supported by plans for three warehouses in Sheppey in Kent, Sawley in Derbyshire; and Bedford, as well as the extension of existing distribution centres in Darlington and Bathgate in West Lothian.\nThe store expansion announcement came as Aldi revealed that sales grew 16.4% across the UK and Ireland to a record £10.2bn in 2017.\nFull-year operating profit rose 26% to £265.9m.\nGiles Hurley, chief executive of Aldi UK and Ireland, said the supermarket’s investment signalled its “continued commitment to growing responsibly in the UK”.\nHe added:\nThat means having a positive and lasting impact on the economies where we operate and improving the lives of British people.\nIn 2020, Aldi will have been serving British shoppers for 30 years. In that time, we’ve become part of the fabric of British life.\nWe’re proud to be reaffirming our commitment today.\nThe grocer also outlined plans to boost its range of British suppliers, who already account for its core range of meat, eggs, milk butter and fresh meat. Aldi said it currently spends more than £100 million each week with more than 1,000 local suppliers.\nThe discounter is now Britain’s fifth largest supermarket with 775 stores, having attracted a further 1.1 million shoppers last year. It now accounts for 7.6% of all UK grocery store spending, according to Kantar Worldpanel data. Aldi has posted record sales More On", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/15220483;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-10-01T10:05:00.000+03:00", "crawled": "2018-10-01T19:26:33.019+03:00", "highlightTitle": ""}