{"organizations": [], "uuid": "a5d8b444e7adada735faa16291795153a52a6286", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15299204.ece/ALTERNATES/s1200/0_GWR_-NJL_181018mccabe_01.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/no-deal-brexit-would-lasting-15298809", "country": "GB", "domain_rank": 21960, "title": "No-deal Brexit would do 'lasting damage' to North East, business leader says", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-18T19:23:00.000+03:00", "replies_count": 0, "uuid": "a5d8b444e7adada735faa16291795153a52a6286"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-news/no-deal-brexit-would-lasting-15298809", "ord_in_thread": 0, "title": "No-deal Brexit would do 'lasting damage' to North East, business leader says", "locations": [], "entities": {"persons": [{"name": "john mccabe", "sentiment": "negative"}, {"name": "brexit", "sentiment": "none"}, {"name": "mccabe", "sentiment": "none"}], "locations": [{"name": "north east england", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "north east england chamber of commerce", "sentiment": "negative"}, {"name": "chamber of commerce", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "North East England Chamber of Commerce president John McCabe (Image: handout from North East England Chamber of Commerce) Get business updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nA no-deal Brexit would be a “wholly unacceptable” outcome that would do “lasting, permanent damage” to the North East economy, a regional business leader has said.\nJohn McCabe, president of the North East England Chamber of Commerce, said politicians needed to act with urgency to deliver a Brexit that “puts national interest ahead of personal ambition or party political expediency”.\nMr McCabe was speaking at a meeting of many of the region’s top business leaders, with his warning on Brexit coming as other business groups have expressed concerns over the continuing chaos in the Brexit negotiations.\nMr McCabe said a recent Chamber survey of North East businesses had provided “indisputable evidence” that Brexit was holding back many firms in the region.\nBut he said the recent party conference season had shown parties more interested in their own internal squabbling than addressing one of the biggest challenges facing the UK in decades. Britain's Secretary of State for Exiting the European Union Dominic Raab, left, and EU chief Brexit negotiator Michel Barnier (Image: AP)\nHe said: “The concerns I express today are not those of a so-called Remoaner. I am, on behalf of the Chamber, giving voice to what our members are telling us every single day.\n“However we all voted individually, the future of our region’s economy , the jobs that drive our businesses forward, the potential we all see in the North East - that’s where we find our common ground. And surely none of us voted for the chaos our politicians have delivered so far.\n“The recent success of our region’s economy has largely been built on the talents, the vision and the resilience of the people and businesses in this room today. Our economy has grown, employment levels remain strong and every day brings new success stories from the North East business community.\n“If only our political leaders could take inspiration from you and listen to what it takes to build a thriving, internationally successful business, we would ensure that the fruits of our labours were enjoyed for generations to come. North East England Chamber of Commerce president John McCabe (Image: Handout)\n“There is a great urgency to this, but it’s not too late to arrest the slide in confidence. and for the Government to deliver a Brexit outcome that puts national interest ahead of personal ambition or party political expediency. Read More Lib Dem leader Vince Cable urges Theresa May to break Brexit deadlock by backing a 'People's Vote'\n“A final word on Brexit, for today at least, is simply this: ‘no-deal’ would do lasting, permanent damage to our economy and it is a wholly unacceptable solution for the North East business community.”\nMr McCabe - speaking at a lunch of the Chamber Presidents’ Club where Prince Edward was guest of honour - had earlier referred to a Chamber survey which found that 52.4% of business people in the region believed Brexit would have a negative impact on their firms, while just 14.1% saw it being beneficial.\nHe was speaking a day after a key European summit failed to reach any agreement and efforts to break the deadlock led to more in-fighting in the Conservative Party.\nHis comments also coincided with the publication of new research from the British Chambers of Commerce (BCC) which shows that Brexit is making it difficult for firms to decide whether to import or export, hampering British trade.\nThe BCC said its poll of 2,500 firms highlighted the economic cost of the “persistent lack of political clarity”.\nHalf of firms were also concerned by the related issue of exchange rate volatility, which can increase the cost of raw materials and potentially make UK exports less competitive, the BCC added. Read More Government urged to ban the sale of petrol and diesel cars from 2032\nBCC director-general Dr Adam Marshall said: “It is vital that clear progress is made in Brexit negotiations to give firms confidence and empower them to take risks and try to break into new markets, creating the Global Britain this Government so often talks about.”\nCBI director-general Carolyn Fairbairn has also spoken of her “diappointment” at the latest impasse in the Brexit negotiations, and urged businesses to contact their MPs to outline how damaging a no-deal Brexit would be. Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-10-18T19:23:00.000+03:00", "crawled": "2018-10-19T00:55:00.013+03:00", "highlightTitle": ""}