{"organizations": [], "uuid": "653159b672f35f0ebf2eaf2240301a5621c4b1e7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article2123758.ece/ALTERNATES/s1200/0_FILE-Physicist-Stephen-Hawking-Has-Died-Aged-76.jpg", "site_section": "http://www.leicestermercury.co.uk/rss.xml", "section_title": "Leicestershire Live - frontpage", "url": "https://www.leicestermercury.co.uk/news/leicester-news/scientist-stephen-hawkings-answers-lifes-2125249", "country": "GB", "domain_rank": 48128, "title": "Scientist Stephen Hawking's answers life's biggest questions in new book", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-19T17:23:00.000+03:00", "replies_count": 0, "uuid": "653159b672f35f0ebf2eaf2240301a5621c4b1e7"}, "author": "Adrian Troughton", "url": "https://www.leicestermercury.co.uk/news/leicester-news/scientist-stephen-hawkings-answers-lifes-2125249", "ord_in_thread": 0, "title": "Scientist Stephen Hawking's answers life's biggest questions in new book", "locations": [], "entities": {"persons": [{"name": "stephen hawking", "sentiment": "neutral"}], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Scientist Stephen Hawking's answers life's biggest questions in new book He died in March, but not before completing the book Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily\nHumans will transcend the earth and live in space, according to the late scientist Professor Stephen Hawking.\nThe prediction is just one of many made by the outspoken astrophysicist scientist who died in March.\nThe celebrated astrophysicist was also convinced that computers could outstrip human intelligence within 100 years - meaning they could become dangerous, the Mirror reports.\nHe said: \"We may face an intelligence explosion that ultimately results in machines whose intelligence exceeds ours by more than ours exceeds that of snails.\n“When that happens, we will need to ensure that the computers have goals aligned with ours.”\nThe eminent scientist tackled some of life's biggest mysteries in his book Brief Answers To The Big Questions.\nHere are some of the key questions that he answered in his final text: Is there a God?\n\"We are each free to believe what we want, and it’s my view that the simplest explanation is that there is no God.\n\"No one created the universe and no one directs our fate.\n\"This leads me to a profound realisation: there is probably no heaven and afterlife either. Will humans live in space?\n\"We will transcend the Earth and learn to exist in space.\" Is it possible to travel through time?\n\"Travel back in time can't be ruled out according to our present understanding.\" Should we be worried about artificial intelligence?\n\"We may face an intelligence explosion that ultimately results in machines whose intelligence exceeds ours by more than ours exceeds that of snails.\n\"When that happens, we will need to ensure that the computers have goals aligned with ours.\n\"It's tempting to dismiss the notion of highly intelligent machines as mere science fiction, but this would be a mistake — and potentially our worst mistake ever.\" Should genetic engineering be used to create superhumans?\n\"Laws will probably be passed against genetic engineering with humans. But some people won't be able to resist the temptation to improve human characteristics, such as size of memory, resistance to disease and length of life.\n\"Once such superhumans appear, there are going to be major political problems with the unimproved humans who won't be able to compete.\" Is Brexit a good thing?\n\"Unfortunately we cannot go back in time.\n\" With Brexit and Trump now exerting new forces in relation to immigration and the development of education, we are witnessing a global revolt against experts, which includes scientists.\"\nIn an address broadcast at London's Science Museum, Prof Hawking ended his emotional address to younger generations with these stirring words: \"Remember to look up at the stars and not down at your feet. Try to make sense of what you see, and wonder about what makes the universe exist.\n\"Be curious, and however difficult life may seem there is always something you can do and succeed at.\n\"It matters that you don't give up. Unleash your imagination. Shape the future.\" Read More", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/leicestermercury/subscriptions/&quot;}", "https://www.mirror.co.uk/news/uk-news/stephen-hawking-answers-big-life-13428067?utm_source=facebook.com&utm_medium=social&utm_campaign=mirror_main", "https://communicatoremail.com/IN/DCF/Ad9Bw6ZcmPSmMwDi7On4yR/"], "published": "2018-10-19T17:23:00.000+03:00", "crawled": "2018-10-19T18:04:58.021+03:00", "highlightTitle": ""}