{"organizations": [], "uuid": "8f9c13140d17512dd8121b7fd95f0b4c2bfc47b6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.gazettelive.co.uk/incoming/article15271033.ece/ALTERNATES/s1200/0_GWR_-NJL_101018lawyer_01.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/small-firms-shouldnt-hold-back-15270938", "country": "GB", "domain_rank": 21960, "title": "Small firms shouldn't hold back when seeking funding, advises Fastest 50 organiser", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-12T13:07:00.000+03:00", "replies_count": 0, "uuid": "8f9c13140d17512dd8121b7fd95f0b4c2bfc47b6"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-news/small-firms-shouldnt-hold-back-15270938", "ord_in_thread": 0, "title": "Small firms shouldn't hold back when seeking funding, advises Fastest 50 organiser", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Business Small firms shouldn't hold back when seeking funding, advises Fastest 50 organiser Fast-growing SMEs in the North East should feel confident about applying for credit to grow and expand, says Ward Hadaway Share Julie Harrison, head of banking and finance at Ward Hadaway (Image: Handout) Get business updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nThe North East’s fastest growing companies need to be confident when approaching their bank for finance, according to organisers of the Ward Hadaway Fastest 50 for 2018.\nJulie Harrison, head of banking and finance at Ward Hadaway, the law firm which organises the annual countdown of the region’s fastest growing companies, says businesses shouldn’t hold back from looking for funding support that could help them grow.\nMs Harrison said: “For some time now the economic climate has been challenging for the small business community struggling with economic uncertainty. Despite these challenges, the sector is doing well.\n“As we prepare for Brexit, it is vitally important that SMEs seek guidance on their finance requirements as they develop and grow.”\nHer comments come after it was revealed that banks approved eight out of 10 applications for SME finance during the second quarter of 2018, according to figures from UK Finance, the trade association for the finance and banking industry.\nUK Finance’s SME update for Q2 2018 also found that 69,300 new SME loans were approved by banks for a value of £7.1bn.\n“These research findings have shed interesting light on current borrowing habits and expectations of SMEs across the country. They also show SMEs should be confident in approaching their bank for finance to grow and expand,” said Ms Harrison, who has advised on banking, funding and corporate issues for 30 years.\nShe added: “The banks are earmarking funds for SMEs to encourage them to apply for funding. Earlier this year, Barclays launched a new £500m growth fund for small and medium-sized businesses in the North of England. The fund formed part of the bank’s commitment to support the Government’s Northern Powerhouse initiative and help businesses realise their ambitions for growth.\n“Last year Lloyds earmarked a similar amount to encourage SMEs to invest in equipment, NatWest announced an additional £1bn of lending aimed at SMEs looking to boost business performance through investment in productivity-improving measures and Yorkshire Bank announced £1bn of funding aimed at the SME market. Santander has also committed their expertise in helping SMEs export and trade internationally.”\nThe 80% approval rate by banks in Q2, is showing that the changes banks have made in dealing with their SME customers is working\n“The role of funders – banks – has transformed in recent years as they have recognised SME needs go beyond access to funding. They have recognised the need for business advice and support and are responding.\n“As a law firm, we need to continue to support businesses in understanding the many options available to them to help them reach their full potential. Businesses certainly shouldn’t be afraid of exploring their finance options though as they could be letting opportunities pass by.”\n“We understand that SMEs need different forms of finance at different stages of their development. Whichever route a business chooses to access finance for growth, securing sound professional advice before making a decision can really pay dividends.\n“We have partnerships with traditional institutions as well as alternative lenders to help bring finance to even more fast-growing businesses.”\nWard Hadaway, which has offices in Newcastle, Leeds and Manchester, devised the Fastest 50 back in 1998 as a way of highlighting and celebrating the achievements of fast-growing privately owned companies across the North East.\nEvery year since then, the UK Top 100 law firm has used publicly available figures from Companies House to compile a list of the businesses across the region which have seen the highest annualised growth in their turnovers whilst remaining profitable.\nAn awards ceremony is then held where awards are presented to the fastest growing small business, fastest growing medium-sized business and fastest growing large business, with one of these winners being crowned the overall fastest growing business in the North East.\nThis year will be the 21st time that the Ward Hadaway Fastest 50 Awards have been held with the invitation-only event taking place at the Baltic, centre tomorrow.\nNorthumbrian Water Group’s information services director, Nigel Watson, who is also a member of the CBI’s Innovation Council, will speak on innovation at the event. Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-10-12T13:07:00.000+03:00", "crawled": "2018-10-13T04:28:12.000+03:00", "highlightTitle": ""}