{"organizations": [], "uuid": "f96efae067f17aa580ae685920b831113ec09cd5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14426047.ece/ALTERNATES/s1200/Stormy-seas-at-Blyth.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/north-east-news-live-updates-15225602", "country": "GB", "domain_rank": 21960, "title": "North East news LIVE: Latest breaking news, sport, weather, traffic and travel", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-04T07:00:00.000+03:00", "replies_count": 0, "uuid": "f96efae067f17aa580ae685920b831113ec09cd5"}, "author": "Kathryn Riddell", "url": "https://www.chroniclelive.co.uk/news/north-east-news/north-east-news-live-updates-15225602", "ord_in_thread": 0, "title": "North East news LIVE: Latest breaking news, sport, weather, traffic and travel", "locations": [], "entities": {"persons": [{"name": "tunmore", "sentiment": "none"}, {"name": "kai", "sentiment": "none"}, {"name": "karen tunmore", "sentiment": "none"}, {"name": "scott pritchard", "sentiment": "none"}, {"name": "lynn blundell", "sentiment": "none"}, {"name": "lynn", "sentiment": "none"}, {"name": "karen", "sentiment": "none"}], "locations": [{"name": "sunderland", "sentiment": "none"}, {"name": "shantelle", "sentiment": "none"}], "organizations": [{"name": "northumbria police", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Suspected burglar found by police 'in minutes'\nQuick-acting police swooped on a suspected intruder at a Sunderland chemists within minutes.\nShortly after 1am today, police received a report that an alarm had been triggered at a shop on Suffolk Street.\nOfficers – assisted by the Dog Section – attended the scene within two minutes of the initial report being received and found a hole in the roof.\nAfter liaising with the shop owner, police entered the shop and found a man inside. Police van (Image: Northumbria Police)\nThe 39-year-old was arrested on suspicion of burglary.\nHe is now in police custody assisting officers.\nAnyone who saw anything suspicious in the area at the time of the incident is asked to contact police on 101 quoting reference 44 041018. 10:59 Kathryn Riddell Should Blackett Street be closed for good?\nNewcastle’s Blackett Street could be closed to vehicles again this winter in a bid to boost the city centre’s Christmas market.\nThe busy route was pedestrianised for 10 weekends this summer so that it could host a series of family fun events during the Great Exhibition of the North .\nThat move proved popular with many visitors to the city centre and council bosses are hoping to replicate that success over the festive period.\nCouncil leader Nick Forbes told a scrutiny committee meeting on Tuesday that Blackett Street can be “a very different place without vehicles” and that plans are in the works that could see it closed during this year’s Christmas market.\nHowever, it has not yet been confirmed exactly when Blackett Street would close or for how long, or what events and stalls the space might be used for. 10:50 KEY EVENT Fans sing 'we want Ashley out' outside restaurant\nNewcastle United’s pizza summit in Ponteland ended in chaotic scenes as Mike Ashley felt the force of angry fans on his way out of the Rialto restaurant last night.\nAs reported by the Chronicle last night, Ashley made his way to Tyneside for for was scheduled to be face-to-face talks with both Rafa Benitez and the United squad after a summer of silence at St James’ Park.\nAshley had twice failed to speak to Benitez after the Crystal Palace and Leicester games before arranging a meal in the North-East.\nBut after information was leaked from the club over the weekend, the meal did not go completely to plan for the club.\nPlayers were first informed that the meal would take place at Ristorante Fratelli in Ponteland but the venue was switched at the last minute as Newcastle needed a bigger room and wanted the squad to follow a seating plan.\nFans also gathered outside in protest of Ashley’s handling of the club’s finances. 10:36 'Secret' drink creating a stir with McDonald's customers\nEver heard of a McAffagato? Doubt it.\nIt’s the new drink which is giving police officers working the night shift a caffeine kick - but now the secret is out so you can expect a lot more people ordering one.\nThe secret item this time is the McAffogato from McDonald’s. For those unfamiliar, the affogato is a classic Italian dessert that normally consists of a scoop of vanilla ice cream with a shot of hot espresso poured over it. The new McDonalds in the Silverlink retail park (Image: Newcastle Chronicle)\nIf you want to recreate this then you order 79p espresso shot and also get a vanilla milkshake.\nThe drink’s popularity is not exclusive to the North East either with people posting to UK Cop Humour page from Burnley, Devon and more.\nPeople across the country are tweeting on the hashtag #McAffagato including members of the forces across the North East.\nThe fast-food giant is looking at adding the drink to their menu and bosses said on Twitter they’ll offer the drink free to officers on duty. 10:23 Kathryn Riddell Some lasting delays\nThere are still minor delays on the Tyne And Wear Metro between South Shields and St James due to power supply problems at Benton. 10:08 KEY EVENT Nissan's warning against a hard Brexit\nNissan has warned that a hard Brexit will have “serious implications” for the carmaker’s Sunderland factory.\nThe Japanese firm, which employs about 8,000 in the UK, said that Britain crashing out of the EU’s single market and customs union into World Trading Organisation rules would be detrimental to its operation.\nNissan uses its UK operations to export to the EU and benefits from being able to trade freely without customs checks or extra tariffs while Britain is a full member. The Nissan factory in Sunderland (Image: Unknown)\nThe company said in a statement on Thursday: “As a sudden change from those rules to the rules of the WTO will have serious implications for British industry, we urge UK and EU negotiators to work collaboratively towards an orderly balanced Brexit that will continue to encourage mutually beneficial trade.\n“Since 1986, the UK has been a production base for Nissan in Europe. Our British-based research and development and design teams support the development of products made in Sunderland, specifically for the European market.” 09:57 Traffic cleared after earlier A1 crash\nTraffic has returned to normal on the A1 southbound near Chester-le-Street.\nThere had been a two-vehicle crash which was quickly cleared but caused traffic to build up. 09:47 Kathryn Riddell Commuters 'shouldn't give up' hope on Metro coming to West End\nHopes of opening a new rail link to Newcastle’s West End should not be abandoned in favour of a less ambitious plan, according to the city’s council leader.\nCoun Nick Forbes has rejected suggestions that the idea of Metro services heading from Central Station on a re-opened route along Scotswood Road may not be realistic. Councillor Nick Forbes and two Metro trains\nAmbitions plans revealed in 2016 to expand Metro and rail routes across the region included proposals to use the original Newcastle to Carlisle railway line to introduce new services connecting the west of the city.", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/15225602;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-10-04T07:00:00.000+03:00", "crawled": "2018-10-04T08:18:59.014+03:00", "highlightTitle": ""}