{"organizations": [], "uuid": "6422df72f0f20f01f82bc9e1ea6023d64472169a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article12076368.ece/ALTERNATES/s1200/JS86851493.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/european-union-funding-brexit-north-15252460", "country": "GB", "domain_rank": 21960, "title": "Northern leaders demand control of the EU's billions after Brexit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-08T15:00:00.000+03:00", "replies_count": 0, "uuid": "6422df72f0f20f01f82bc9e1ea6023d64472169a"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/european-union-funding-brexit-north-15252460", "ord_in_thread": 0, "title": "Northern leaders demand control of the EU's billions after Brexit", "locations": [], "entities": {"persons": [{"name": "henri murison", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "brexit news northern", "sentiment": "negative"}, {"name": "treasury", "sentiment": "none"}, {"name": "northern powerhouse partnership", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Northern leaders demand control of the EU's billions after Brexit Northern leaders want direct control after Brexit of £2.4bn a year currently provided by the EU and the government Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily\nNorthern leaders have united to demand control over up to £2.4bn in cash which is currently spent by the EU.\nThey say the money would be used to bring investment into the North of England and create jobs.\nHenri Murison, director of the Northern Powerhouse Partnership, said: “Alongside businesses investing in creating new, higher-skilled jobs, we need to ensure those living in towns and communities which have been great in the North’s glorious past can play their part in it being even greater in the future.”\nMayors and business leaders want the North to take direct control of money currently known as EU Structural Funds. This is cash from the EU which is matched with money from the Treasury, and comes to a total of £2.4bn a year.\nThe North East is one of the biggest beneficiaries of the money, getting £64 per year per person. Tees Valley gets £70 a year and only one region, Cornwall, receives more than this. The Core at Newcastle Science Central\nThe Government has said that Structural Funds will be replaced by a new scheme called the Shared Prosperity Fund after Brexit takes place. Read More\nLaunching a consultation in July, Communities Secretary James Brokenshire said Councils and Local Enterprise Partnerships, which are led by local businesses, would draw up industrial strategies to help decide how the money would be spent.\nThe North East region and Tees Valley have both been asked to draw up strategies.\nBut details of how the Shared Prosperity Fund will work are not due until the next Government Spending Review, which is expected in early spring. Read More Former North East MP David Miliband sponsors coach to anti-Brexit demo in London\nNorthern leaders have urged the Government to ensure funding is guaranteed much sooner than this, and to get the Shared Prosperity Fund up and running to create more and better jobs.\nThe urgency is underlined by new analysis by the Joseph Rowntree Foundation (JRF), which shows how some towns and cities have fallen further behind the rest of the country on employment and pay for the least well-off. Communities Secretary James Brokenshire launched a consultation (Image: PA)\nNationally the UK has record employment, but some towns and cities are locked out of this success, according to JRF’s new report.\nFor example, Newcastle has an employment rate of 66.3% compared to a GB average of 73.9%.\nRoger Marsh OBE, chair of the NP11 group which represents local enterprise partnerships across the North, said: “The creation of the UK Shared Prosperity Fund is an opportunity to create a funding mechanism that supports and accelerates the work already under way to create faster growth which benefits our regions and the UK as a whole. Read More", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-10-08T15:00:00.000+03:00", "crawled": "2018-10-08T15:38:42.001+03:00", "highlightTitle": ""}