{"organizations": [], "uuid": "7ccd4e0ce4a00ea97d55b8c223cdc7ed3cd2673a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14608018.ece/ALTERNATES/s1200/TMP_NEC_050216Trevelyan_04JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/eu-using-ireland-political-weapon-15322900", "country": "GB", "domain_rank": 21960, "title": "EU is using Ireland as a 'political weapon' says Conservative MP Anne-Marie Trevelyan", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-24T17:49:00.000+03:00", "replies_count": 0, "uuid": "7ccd4e0ce4a00ea97d55b8c223cdc7ed3cd2673a"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/eu-using-ireland-political-weapon-15322900", "ord_in_thread": 0, "title": "EU is using Ireland as a 'political weapon' says Conservative MP Anne-Marie Trevelyan", "locations": [], "entities": {"persons": [{"name": "anne-marie trevelyan", "sentiment": "negative"}, {"name": "mrs trevelyan", "sentiment": "none"}, {"name": "chris grayling", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "ireland", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "conservative", "sentiment": "negative"}, {"name": "berwick", "sentiment": "negative"}, {"name": "newcastle chronicle", "sentiment": "negative"}, {"name": "bbc two", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "northern rail", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Conservative MP for Berwick Anne-Marie Trevelyan (Image: Newcastle Chronicle) Get daily updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nThe European Union is using Ireland as “a political weapon” to make it difficult for the UK to leave, Northumberland MP Anne-Marie Trevelyan has claimed.\nTalks between the UK and EU have stalled because of disagreement about the border between Northern Ireland and Ireland.\nBut Mrs Trevelyan insisted: “It is not something that is irresolvable. And it’s been a political weapon used by the EU.”\nSpeaking on BBC Two’s Politics Live, she added: “It’s a political weapon being used by the EU to try to frustrate the UK getting a good deal.”\nAnd she said the EU was deliberately making Brexit “as difficult as possible” to discourage other countries from leaving. Read More Chris Grayling says you can't blame him for Northern Rail chaos - despite a summer of misery\nWhile the EU and UK have made progress on a range of issues, disagreement over the Northern Ireland border has yet to be resolved.\nIf the UK leaves the EU’s Customs Union, as Prime Minister Theresa May plans, there will need to be some sort of border with Ireland, which is inside the Customs Union. Theresa May arrives at the Conservative Party conference (Image: PA)\nHowever, fears have been raised that this would undermine the Northern Ireland peace process.\nAn option would be for Northern Ireland to remain inside the Customs Union, which would mean there does not need to be a border with Ireland - but it would effectively create a border between Northern Ireland and the UK, which is not acceptable to the UK government.\nIn developments which will cause further unease among Tory Brexiteers, leaked Cabinet papers obtained by The Times indicated the transition period during which the UK will remain tied to Brussels could turn into a “long-running” arrangement lasting years. Read More Fears new Government scheme could mean lower wages 'for generations to come' in the North East\nThe option of extending the transition period has been put forward as a way of resolving the impasse over the Irish frontier by giving extra time to find a mechanism to avoid a hard border.\nThe transition period is due to expire at the end of 2020 and Mrs May has insisted that if an extension is necessary it should only last a few months.\nBut the leaked documents conceded that the plan “could, in theory, lead to a long-running IP (implementation period)”.\nThe arrangement could last for many years on a “rolling” basis with an annual decision on whether to extend the period.\nResponding to the leak, a Downing Street spokesman said: “This is nothing more than a partial reflection of advice to ministers, and not of decisions taken - the Prime Minister made her position absolutely clear in the House of Commons on Monday.\n“As the PM said then, we do not believe any extension to the implementation period will be necessary, and in any event we would have to be out of it well before the end of the Parliament. Read More Newcastle, North Tyneside and Northumberland to break off from 'south of Tyne' - and have its own mayor\n“We would not accept a position in which the UK, having negotiated in good faith an agreement which prevents a hard border in Northern Ireland, nonetheless finds itself indefinitely locked into an alternative, inferior arrangement against our will.”\nMeanwhile, it has emerged that ships may have to be chartered by Whitehall to ensure vital supplies reach the UK if there is a no-deal Brexit. Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-10-24T17:49:00.000+03:00", "crawled": "2018-10-24T18:33:55.001+03:00", "highlightTitle": ""}