{"organizations": [], "uuid": "aa08a3706596edb892e7b1f9eb26839e426fdb38", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15287663.ece/ALTERNATES/s1200/0_bellway-brexit.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/bellways-turnover-approaches-3bn-firm-15287611", "country": "GB", "domain_rank": 21960, "title": "Bellway's turnover approaches £3bn but the firm warns Brexit could dampen sales", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-16T16:24:00.000+03:00", "replies_count": 0, "uuid": "aa08a3706596edb892e7b1f9eb26839e426fdb38"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/bellways-turnover-approaches-3bn-firm-15287611", "ord_in_thread": 0, "title": "Bellway's turnover approaches £3bn but the firm warns Brexit could dampen sales", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "negative"}, {"name": "keith adey", "sentiment": "none"}], "locations": [{"name": "share bellway homes collingwood manor", "sentiment": "none"}], "organizations": [{"name": "bellway", "sentiment": "negative"}, {"name": "brexit", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Bellway's turnover approaches £3bn but the firm warns Brexit could dampen sales Consumer sentiment around Brexit could lead to lower house sales during Bellway's busy spring period Share Bellway Homes Collingwood Manor development in Morpeth (Image: handout) Get business updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nHousebuilder Bellway’s turnover soared to nearly £3bn last year after selling a record number of homes, but the firm has warned that Brexit could impact one of its busiest selling periods.\nThe Newcastle firm saw its revenue grow 15.6%, from £2.56bn to £2.96bn for the year ending July 31, while the company sold more than 10,000 homes for the first time in its history.\nCommenting on the sales, finance director Keith Adey said: “We are delighted. We have smashed through that 10,000 barrier for the first time in our history which is something we are very pleased with.”\nHe added: “I think there is an inevitability that this rate of growth will moderate to a sustainable level.\n“Over the last three years we have grown our house revenue by 68%. We couldn’t maintain that level of growth but we see significant growth potential in the years ahead.” Keith Adey, group finance director at Bellway plc (Image: Newcastle Journal)\nBellway’s revenue growth was also boosted by a 9.3% increase in the average selling price for private homes, which now stands at £323,426. Operating profit increased from £571.2m to £652.9m.\nBut despite Bellway’s strong results, the company’s chief executive Jason Honeyman warned that the company’s figures for the current financial year could be dampened by consumers’ worries about Brexit .\nMr Honeyman said: “So far year to date, there has been no impact to the sales rate but the concern from Brexit is that our spring selling period is usually busy. We are concerned that the Brexit period might hit sales rates in that period.\n“It is probably more acute in London than other areas of the country. In the North East, North West and Midlands it is less of a concern.\n“Over 90% of our supply chain is UK based, so it is not a concern to us where we get labour and materials. I am concerned about customer sentiment - are people going to by a home in January, February and March?” Read More The Diamond in Ponteland set for makeover as Barluga owners become new managers\n2018 has seen a number of major changes take place within Bellway’s senior management team. Mr Honeyman was promoted to his current role after former chief executive Ted Ayres retired from the firm . Mr Ayres worked for Bellway for 16 years but had been forced to take a leave of absence due to ill health.\nNon-executive chairman John Watson is also set to retire from his role at the company’s AGM on December 12. Mr Watson will be replaced by current audit committee chair Paul Hampden Smith.\nMr Honeyman said that despite the changes within Bellway’s leadership team the business would continuing with the same strategy it has been working towards. Read More Sanderson Young sale criticised by potential buyers after firm bought by founder's wife\nHe said: “I was in an interim roll since 2017 so I have had a year to warm up for working alongside Keith [Adey]. I know the script and we know what we are about. The message is it is business as usual.\n“I think John, our chairman, will be missed. He has been instrumental but we are continuing in the same vein. We have a lot of strength and depth in the management at Bellway.” Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-10-16T16:24:00.000+03:00", "crawled": "2018-10-16T17:26:02.040+03:00", "highlightTitle": ""}