{"organizations": [], "uuid": "2946436ffebb4af055620ca0979c9295a9652cec", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article1028380.ece/ALTERNATES/s1200/30589595JPG.jpg", "site_section": "https://www.devonlive.com/rss.xml", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/devon-news/future-babcock-appledore-shipyard-hangs-2077599", "country": "US", "title": "Future of Babcock Appledore shipyard hangs in the balance as union accuses government 'shipwrecking' the industry", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-05T15:32:00.000+03:00", "replies_count": 0, "uuid": "2946436ffebb4af055620ca0979c9295a9652cec"}, "author": "Joel Cooper", "url": "https://www.devonlive.com/news/devon-news/future-babcock-appledore-shipyard-hangs-2077599", "ord_in_thread": 0, "title": "Future of Babcock Appledore shipyard hangs in the balance as union accuses government 'shipwrecking' the industry", "locations": [], "entities": {"persons": [{"name": "babcock appledore", "sentiment": "none"}, {"name": "greg clark", "sentiment": "none"}, {"name": "babcock", "sentiment": "none"}, {"name": "gavin williamson", "sentiment": "none"}, {"name": "wolff", "sentiment": "none"}, {"name": "mike southon", "sentiment": "none"}, {"name": "steve turner", "sentiment": "none"}], "locations": [{"name": "north devon", "sentiment": "none"}, {"name": "belfast", "sentiment": "none"}, {"name": "appledore shipyard", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "appledore", "sentiment": "none"}], "organizations": [{"name": "future of babcock appledore", "sentiment": "none"}, {"name": "defence", "sentiment": "none"}, {"name": "royal navy", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Future of Babcock Appledore shipyard hangs in the balance as union accuses government 'shipwrecking' the industry \"The future of these yards and all those who work at them could be shipwrecked.\" Share Click to play Tap to play The video will start in 8 Cancel Play now Get trade union which represents defence workers says the government’s \"continual lack of commitment\" to building ships for the Royal Navy threatens to \"shipwreck\" the future of a Devon shipyard.\nThe future of Babcock's Appledore shipyard in North Devon is vulnerable according to Unite, the largest union for defence workers.\nIt follows the loss of a major contract to an Italian shipyard and apparent delays in contracts for Type 31 military frigates. Appledore Shipyard (Image: Mike Southon)\nThe union called for defence secretary Gavin Williamson and business secretary Greg Clark to stop \"navel gazing\" and make a firm commitment to back the UK’s centuries-old naval shipbuilding tradition. Unite assistant general secretary Steve Turner said: “We have two iconic shipyards - Harland & Wolff in Belfast and Appledore in North Devon - fighting for a future. “The loss of the contract to Italian yard Fincantieri has exposed the vulnerability of the Appledore site, while government delays to the Type 31e frigates and an obsession with off-shoring the construction of three fleet support ships for our naval carrier fleet is threatening jobs across the UK. “Our future capability to build for the Royal Navy in UK shipyards hangs by a thread, so it is imperative that the government makes support for these yards a keystone of any post-Brexit industrial strategy. Defence Secretary Gavin Williamson meeting with apprentices at Appledore Shipyard.\n“Defence secretary Gavin Williamson and business secretary Greg Clark must now wake up and smell the coffee. They must act now to defend UK yards and what’s left of any defence and wider industrial strategy. “Otherwise, the future of these yards and all those who work at them, alongside thousands more jobs in the UK-wide supply chain, could be shipwrecked.\n“Block building of this work could sustain both the Appledore and Belfast communities, supporting decent skilled jobs, apprenticeships for our youth and the families reliant upon them. Instead, government seems willing to allow our shipyards to fall silent and skilled jobs go to wall. Read More Babcock insists scrapped tender won't hit its £900m vehicle repair work\n“The government needs to back UK Plc, our shipbuilders, steel plants and component suppliers and commit now to the UK design, engineering and build of the navy’s solid support ships in UK shipyards with 140,000 tonnes of British steel. “A failure to do so, alongside the continuing dithering over Type 31e frigates, will be a gross betrayal to UK ship workers, loyal communities and regional economies, while putting at risk manufacturing skills vital to the industry.” Heathcliffe Pettifer, Unite regional officer responsible for Appledore, said: “Unite is committed to supporting our members still employed by Babcock, but transferred to Devonport dockyard. A concept image for a Royal Navy Type 31e frigate\n“There are a number of questions our members will want answering, therefore I have secured a meeting with the Babcock directors, the leader of Torridge district council, and Torridge and West .” A spokesman said: \"Geoffrey is working hard with colleagues in the Ministry of Defence to look at the challenges facing Appledore.\"\nIn July we reported that Unite had criticised the government’s decision to pause the bidding for type 31e Frigates.\nThe GMB union says the government's announcement has \"ramped up the uncertainty\" about jobs at Appledore shipyard in North Devon and says it is a \"further blow to British shipbuilding\". Read More CONFIRMED: Exeter's House of Fraser to close\nSpeaking at the time, Geoffrey Cox MP said: \"While I recognise that this announcement will raise concern, I am assured that the pause to the procurement process will not jeopardise the Type 31e programme which is due to produce its first warship by 2023, the first of five Type 31e frigates for our Royal Navy.\n\"I look forward to the imminent launch of the new streamlined procurement process and shall do everything I can to support the highly skilled men and women working at Appledore Shipyard.\n\"I am in close touch with Babcock and I shall be holding discussions with my colleagues, the Secretaries of State for Defence and Business, about the timetable for the procurement and how the Government can further support Babcock in its efforts to secure overseas orders.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-10-05T15:32:00.000+03:00", "crawled": "2018-10-05T16:52:20.019+03:00", "highlightTitle": ""}