{"organizations": [], "uuid": "2f676d7bea6a70ffb221f68523d80acee322b1fa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article2129708.ece/ALTERNATES/s1200/5145112_8c6b9089_1024x1024.jpg", "site_section": "http://www.westernmorningnews.co.uk/editorschoices.rss", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/devon-news/boost-east-worlington-parish-hall-2129722", "country": "GB", "title": "Boost for East Worlington Parish Hall after £90k cash donation", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-20T15:39:00.000+03:00", "replies_count": 0, "uuid": "2f676d7bea6a70ffb221f68523d80acee322b1fa"}, "author": "Lewis Clarke", "url": "https://www.devonlive.com/news/devon-news/boost-east-worlington-parish-hall-2129722", "ord_in_thread": 0, "title": "Boost for East Worlington Parish Hall after £90k cash donation", "locations": [], "entities": {"persons": [], "locations": [{"name": "uk", "sentiment": "none"}], "organizations": [{"name": "east worlington parish hall", "sentiment": "none"}, {"name": "garfield weston foundation", "sentiment": "none"}, {"name": "the foundation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Boost for East Worlington Parish Hall after £90k cash donation The funding will enable the charity to conserve and improve the facilities available for the community Share\nEast Worlington Parish Hall which supports community well-being and cohesion through a range of facilities, services and activities has been awarded £90,000 from one of the UK’s largest charitable funders.\nThe funding will enable the charity to conserve and improve the facilities available for the community by ensuring that the Parish Hall, the only community facility within the area, has the vital and necessary accommodation and equipment to address local needs, especially for older people, those living with disabled, families with younger children and in support of activities for children at the adjacent primary school. The Garfield Weston Foundation says small community charities are rising to the challenge of facing unprecedented demand for their services by being proactive and innovative. Read More East Worlington pupils need your votes in in bid to revamp outdoor classroom\nThe Foundation has more then doubled its £5m capital fund to over £11m so it can support over 150 charities and community organisations across the UK.\nThe Weston Anniversary Fund was launched earlier this year to provide funding to charities to improve their existing facilities or provide new ones as part of the Foundation’s 60 year. The Trustees took the decision to more than double the fund after receiving over 2,300 applications, with over 60 per cent from charities that have never applied to them before.\nSteve Baber, Chair of Trustees of East Worlington Parish Hall said: “The fantastic support offered by Garfield Weston is brilliant news for our community. It enables us to address needs of community, which is in a rural isolated location in North Devon, by providing the necessary and vital resources required to ensure we have the facilities that support our provision.\n“The warm-felt thanks of our community is sent to Garfield Weston. It provides a real boost to our community volunteers and ensures we are more able to have a positive impact on the community we serve.”\nSuzie Pinn, Head of School at the adjacent village primary school which relies on the facilities of the Parish Hall added: “All the children, staff and parents associated with East Worlington Primary School were delighted to learn that the Parish Hall, for which we rely on for a range of our activities, had gained the support of Garfield Weston and are now able to improve the facilities we need. It will make a big difference to the provision and will contribute to greater use and benefit to our pupils. Many thanks to Garfield Weston from all at East Worlington Primary School.”\nThe Garfield Weston Foundation’s Director, Philippa Charles, said: “What really impressed our Trustees is the amount of volunteering and community involvement that’s going on across the UK. We heard about so many amazing projects involving local people who are helping their communities thrive - regardless of cuts, Brexit debates and other challenges. Read More Thousands of crocuses for you to enjoy will be open to the public this weekend\n“The response from charities to this new fund clearly demonstrates the voluntary sector is proactive and energetic; far from the complacency it is sometimes accused of.\n“Yet we can also see the level of need that exists in our local communities and how much the services charities provide are so desperately needed. The impact of these grants will be significant, with benefits for many people lasting years.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}", "https://anniversary.garfieldweston.org/weston-anniversary-fund/"], "published": "2018-10-20T15:39:00.000+03:00", "crawled": "2018-10-20T16:01:33.002+03:00", "highlightTitle": ""}