{"organizations": [], "uuid": "86fba5acd57cee40038218977c1a473d15c4b95c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15227258.ece/ALTERNATES/s1200/0_JS164385082.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/boris-johnson-conservative-party-conference-15227105", "country": "GB", "domain_rank": 21960, "title": "Huge applause for Boris Johnson as he sets out leadership pitch at Conservative conference", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-02T17:14:00.000+03:00", "replies_count": 0, "uuid": "86fba5acd57cee40038218977c1a473d15c4b95c"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/boris-johnson-conservative-party-conference-15227105", "ord_in_thread": 0, "title": "Huge applause for Boris Johnson as he sets out leadership pitch at Conservative conference", "locations": [], "entities": {"persons": [{"name": "boris johnson", "sentiment": "negative"}, {"name": "johnson", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "anne-marie trevelyan", "sentiment": "none"}, {"name": "chuck chequers", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}], "organizations": [{"name": "conservative", "sentiment": "negative"}, {"name": "cabinet", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Huge applause for Boris Johnson as he sets out leadership pitch at Conservative conference Former Foreign Secretary Boris Johnson took on Theresa May by urging Tories to 'chuck Chequers', her flagship Brexit plan Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nTory leadership hopeful Boris Johnson stole the show at the Conservative conference in Birmingham, setting out his manifesto for Britain to a packed meeting of activists.\nMr Johnson is officially just a lowly backbencher, since resigning as Foreign Secretary in protest at Prime Minister Theresa May's proposed \"Chequers\" Brexit deal.\nBut his speech, at a fringe event organised by Tory activist website ConservatveHome, attracted a bigger audience than many of the official conference speeches delivered by members of the Cabinet.\nHe was accompanied into the event by Berwick-upon-Tweed MP Anne-Marie Trevelyan.\nMr Johnson condemned Mrs May's Brexit plan, the policy that currently defines her Government, urging the Conservative Party to \"chuck Chequers\". Boris Johnson arrives before speaking at a Conservative home fringe meeting\nAnd he even won loud applause when he suggested that Mrs May risked being prosecuted under a 14th century law saying that \"no foreign court or Government shall have jurisdiction in this country\".\nBut at the same time, he insisted he was urging the party to unify and to support Mrs May.\nClaiming to support the Prime Minister's \"original plan\" for Brexit, Mr Johnson said: \"For one last time, I urge our friends in Government to deliver what the people voted for, to back Theresa May in the best way possible - by softly, quietly, and sensibly backing her original plan.\"\nMr Johnson said that Mrs May's Chequers blueprint - which ties Britain to a common rulebook with the EU for trade in goods - would be \"politically humiliating for a £2 trillion economy\" and would prevent the UK from making its own laws and subject it to the directives of Brussels.\nHe said: \"This is not pragmatic, it is not a compromise. It is dangerous and unstable - politically and economically. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now\n\"My fellow Conservatives, this is not democracy. This is not what we voted for. This is an outrage.\n\"This is not taking back control: this is forfeiting control.\"\nMr Johnson tackled a wide range of issues in his speech, strengthening the widespread view at the conference that he was setting out his manifesto for a future Conservative leadership contest.\nOn law and order, he won loud applause when he called for the return of stop and search - a power Mrs May curbed.\nHe said: \"We Conservatives know that it is only a strong private sector economy that can pay for superb public services. And that is the central symmetry of our one nation Toryism. Read More", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-10-02T17:14:00.000+03:00", "crawled": "2018-10-02T22:57:04.003+03:00", "highlightTitle": ""}