{"organizations": [], "uuid": "c265cf8cbc4418a5b63a872ef4433f5d8420759e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14760040.ece/ALTERNATES/s1200/Breaking-News-Graphic-Live-Blog-Smaller.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/north-east-news-live-updates-15275599", "country": "GB", "domain_rank": 21960, "title": "North East news LIVE: Latest breaking news, sport, weather, traffic and travel", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-13T11:00:00.000+03:00", "replies_count": 0, "uuid": "c265cf8cbc4418a5b63a872ef4433f5d8420759e"}, "author": "Tom Eden", "url": "https://www.chroniclelive.co.uk/news/north-east-news/north-east-news-live-updates-15275599", "ord_in_thread": 0, "title": "North East news LIVE: Latest breaking news, sport, weather, traffic and travel", "locations": [], "entities": {"persons": [{"name": "tom eden", "sentiment": "negative"}], "locations": [{"name": "teeside", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The crash on the Northbound A1 is causing bus diversions in Gateshead: 12:56 KEY EVENT Crash on the A1\nThere has been a crash on the A1, and with two lanes blocked there’s a lot of congestion.\nPolice are on scene: Tom Eden Nissan stalls pay talks amid Brexit negotiations\nPay talks have been delayed between Nissan and its workers on Wearside amid continuing talks over the UK’s Brexit deal. (Image: nissan)\nBiennial discussions between the firm’s 6,000-plus workforce and bosses had been due to start around this time, but the car manufacturer has confirmed they have been stalled until next year.\nA date for the talks has not yet been set.\nA Nissan spokesman said:\n“In agreement with our employee representatives, the 2019/2020 pay negotiations in our UK plant and technical centre will commence in 2019 when we have better clarity on the future business outlook.\n“Beyond this we will not be commenting on internal matters.”\nThe news comes a week after Nissan warned of “serious implications” for its Sunderland plant and the wider manufacturing industryin the event of a so-called ‘Hard Brexit’ when the UK leaves the European Union on March 29, 2019 Gateshead Sister pays emotional tribute to popular barber Barry Routledge\nHe was the ‘much-loved’ barber who enjoyed passions for cooking and travel.\nBut now the Heworth community have been rocked by the tragic passing of popular Barry Routledge weeks after celebrating his 60th birthday.\nThe owner of Phaze One on Buttermere, Gateshead , lost his fight with lymphoma at the Freeman Hospital in Newcastle on September 29.\nNow - with family and friends preparing to bid their final goodbyes - sister Lynn has paid an emotional tribute to the brother who will be missed by all.\nShe said:\n“Barry loved being a barber and became friends with many around him. The community took him into their hearts and homes.\n“He was much loved by everyone and it shows by the amount of tributes paid to him via social media.\n“Barry’s life was filled with such joy and happiness until he became ill and it took hold of all his activities. He tried to stay positive.\n“He still had a smile on his face right to the end that will be sadly missed by family and friends.” Durham Tom Eden Deliveroo recruiting riders after surge in orders\nDeliveroo is looking for more riders in Durham city after seeing the number of lunch orders double.\nThe company recently launched Marketplace+, which has seen an influx of traditional takeaways joining the delivery company.\nIn the past year, the number of lunch orders has increased by 105%, the company says, with Fat Hippo Burger and Fat Hippo Durham take the top spot for most popular lunch order in the city. (Image: Newcastle Chronicle)\nDeliveroo is now looking for more riders, and current riders who successfully refer someone new to Deliveroo in Durham will receive up to £150.\nDan Warne, UK and Ireland Managing Director said: “We’re proud to be offering more locals in Durham well-paid flexible work and have been astounded by the huge growth we’ve seen in the city.”\nDeliveroo provides a delivery service for restaurants and takeaways which do not employ drivers, and has now expanded to include takeaways which have their own delivery teams.\nThe firm launched in Newcastle in 2015. It’s main rival in the city, Uber Eats, launched last summer. International Tom Eden Calls for UK response to Saudi Arabia over missing journalist\nThe UK must reconsider its relations with Saudi Arabia if the state ordered the murder of a journalist, a senior MP said.\nCommons Foreign Affairs Committee chairman Tom Tugendhat said the UK should work with its allies on its response following claims Jamal Khashoggi was killed while visiting the Saudi consulate in Istanbul.\nMr Tugendhat said it was important to establish the facts, but if the Riyadh government had murdered Mr Khashoggi then there could be a downgrading of diplomatic relations and a boycott by UK ministers.\nRiyadh faces a chorus of international calls to shed light on what happened to the Washington Post columnist, and business leaders have already shunned the regime.\nIn a sign of the international concern, UN Secretary General Antonio Guterres said he wanted to know the truth about what happened and expressed fears such disappearances would happen more regularly and become a “new normal”.\nFinancial Times editor Lionel Barber announced the newspaper would be pulling out of its partnership in a high-profile economic conference in Riyadh, while Sir Richard Branson has frozen several business links with the Gulf state.\nMr Tugendhat said International Trade Secretary Liam Fox should boycott the Future Investment Initiative in Riyadh later this month if Saudi involvement in Mr Khashoggi’s disappearance was proved. Middlesbrough Boxing club that 'changes lives' gets royal seal of approval\nA Teesside boxing club has punched its way to receive a royal seal of approval.\nThe Middlesbrough Amateur Boxing Club has been given The Queen’s Award for Voluntary Service. (Image: Doug Moody Photography)\nIt is in recognition of the years of work that have given young people fresh opportunities while helping to cut crime and anti-social behaviour.\nManager Tony Whitby – Middlesbrough ’s 2016 Citizen of the Year - has run the club for more than 20 years and was also invited to Buckingham Palace in honour of his achievements.\nHe founded the club to offer boxing opportunities to young people from the local community, promoting values of discipline and respect, as well as encouraging healthy lifestyles and offering alternatives to crime and anti-social behaviour.\nTony said:\n“It’s brilliant – not many clubs achieve this, so it’s great for the club and great for the area.\n“It’s for all the volunteers and everyone that’s involved with the club, because they’re the ones that keep it alive and keeping growing.\n“Everyone is over the moon, and we have a fresh intake of kids, so we’re going from strength to strength.”", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/", "http://www.gazettelive.co.uk/apps", "http://www.twitter.com/tomeden11", "https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/15275599;"], "published": "2018-10-13T11:00:00.000+03:00", "crawled": "2018-10-13T11:09:34.019+03:00", "highlightTitle": ""}