{"organizations": [], "uuid": "8ab1e659c1c0694129bdfd088333417369f38c48", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article2121095.ece/ALTERNATES/s1200/0_PA-39167104.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/devon-news/prince-harry-gets-name-snail-2121100", "country": "GB", "title": "Prince Harry gets to name snail during trip to school in Australia", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-18T09:46:00.000+03:00", "replies_count": 0, "uuid": "8ab1e659c1c0694129bdfd088333417369f38c48"}, "author": "Neil Shaw", "url": "https://www.devonlive.com/news/devon-news/prince-harry-gets-name-snail-2121100", "ord_in_thread": 0, "title": "Prince Harry gets to name snail during trip to school in Australia", "locations": [], "entities": {"persons": [{"name": "meghan", "sentiment": "none"}, {"name": "harry", "sentiment": "none"}, {"name": "neil shaw", "sentiment": "none"}, {"name": "annie", "sentiment": "none"}], "locations": [{"name": "australia", "sentiment": "none"}, {"name": "dubbo", "sentiment": "none"}, {"name": "albert park", "sentiment": "none"}, {"name": "melbourne", "sentiment": "none"}], "organizations": [{"name": "clontarf foundation", "sentiment": "none"}, {"name": "girls academy", "sentiment": "none"}, {"name": "digital", "sentiment": "none"}, {"name": "duke", "sentiment": "none"}, {"name": "sussex", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Prince Harry gets to name snail during trip to school in Australia One girl presented Meghan with a new tiara Share Neil Shaw Head of Digital, live and trending for PlymouthLive, DevonLive and CornwallLive 07:46, 18 OCT 2018 The Duke and Duchess of Sussex arriving in the rain for their visit to Clontarf Foundation and Girls Academy in Dubbo, on the second day of the Royal couple's visit to Australia.\nPrince Harry raised a smile at a school in Australia when he was given the opportunity to name the pet snail, and suggested Speedy.\nAs the couple left, one little boy told Harry: \"You remind me of my uncle.\"\nThe duke replied: \"Is that a good thing? Is it because I've got a ginger beard?\"\nFlowers may be the gift of choice for the Duchess of Sussex, but a six-year-old girl gave her a tiara as the royals visited the Melbourne school.\nHarry and Meghan were met by 600 pupils at the Albert Park primary school where they learned about efforts the school is making to cut waste and be more sustainable. Read More\nThe duke picked out Annie from the crowd after seeing her holding a bunch of flowers and toy tiara.\n\"Are they for her?\", he asked, gesturing towards his pregnant wife.\nMeghan then came over, took the gifts and said \"Oh my goodness, thank you. Those are amazing.\"\nThe Duke and Duchess of Sussex were treated to a set menu of Melbourne life during their visit to the city as Meghan played Aussie Rules, before she and Harry rode on a tram and took in the beach.\nThe couple were met with a rapturous reception at the Royal Botanic Gardens, before they visited a community cafe for lunch and dropped in on a primary school.\nThey are on a 16-day tour which will see them also visit New Zealand, Fiji and Tonga, as well as catching the Invictus Games. Read More Meghan and Harry's baby could rule England and be US President\nAustralian Rules - or footy - is huge in Victoria and Meghan appeared to be bitten by the bug as the couple watched displays from Victoria's This Girl Can empowerment campaign.\nAfter some gentle persuasion, the duchess took the ball and laughed nervously as she gingerly threw it to one of the women, adding: \"I'm not sure I did it right!\"\nJerril Rechter, chief executive of VicHealth, who showed Meghan around the event, said: \"She did pass an AFL football. She did a handball. That's a pretty incredible thing for anybody to do.\n\"She had not seen an AFL football before Howard, the governor's husband, explained to her what it was like - the weight of it is a little bit different, and that you handball it, you don't pass it.\" Read More Royal baby could share birthday with Queen, Shakespeare or Brexit\nDiscussion about the future baby was fairly limited during engagements in Sydney and Dubbo, but youngsters who accompanied the duke and duchess on a tram in Melbourne were able to ask more probing questions.\nCharlie Wolf, a 12-year-old pupil from Middle Park primary school, asked if the couple had any names for their baby.\nThe children said Meghan replied: \"We've been given a long list of names from everyone, we're going to sit down and have a look at them.\"\nElla Burns, also 12, from Albert Park primary school, said: \"She said that she hadn't thought of one as it was still quite early.\"\nThe baby was also at the forefront of the minds of people who had queued up from as early as 5am to catch sight of the couple at the Royal Botanic Gardens. Read More Royal baby name favourites include Diana, Alice and Arthur\nHarry and Meghan, who was wearing a navy blue dress by Australian brand Dion Lee with a camel-coloured trench coat and black stilettos, were met by a crowd nearly 5,000 and abandoned their strict scheduling to meet well-wishers for 25 minutes.\nGifts, including toys, flags and flowers, were given to the parents-to-be as a group sang Stand By Me, the gospel song performed at the royal wedding in May.\nOne of the larger presents of the day came from Courtney Pistone, 10, who held a large teddy over the barriers and handed it to Meghan for the unborn baby.\nShe said: \"I gave it to her for the nursery.\n\"I thought it would be suitable because we didn't know if it was a boy or a girl and both boys and girls like bears.\"\nThe duke and duchess stopped to play with five-and-a-half-month-old Harriet Bonaddido and chatted with her mother, Jessica. Read More\nThe 28-year-old said: \"As soon as I introduced my daughter to Harry, he said 'That's a great name'.\n\"Maybe they will choose it for their own child, which would be fun.\n\"Meghan was right behind him and was playfully tickling her toes and said how sweet it was that I'd brought her out today.\"\nOne woman, 19-year-old India Brown, held a sign saying, \"Been here since 4am, loved you since I was 8\" and was visibly emotional when Harry gave her a hug.\nOther signs including \"Worth the detention\" and \"Fresh Prince with red hair\" were held aloft as the royal party made their way through the botanical gardens to Government House.\nAfter a morning of engagements, the couple headed to social enterprise cafe Charcoal Lane in the trendy suburb of Fitzroy for lunch. Read More Did Meghan and Harry argue at royal wedding? This is what really happened\nChefs, trained by the Mission Australia programme, served up an entree of mushroom and quinoa nest and chargrilled kangaroo followed by main courses of wild boar, saffron risotto and barramundi.\nThe duke and duchess rounded off their day with a trip to the beach, where they heard about the work of the BeachPatrol, who work to keep the foreshores clean.\nMeghan, who had changed into a black Club Monaco dress, and Harry also spoke to lifeguards before making their way back to the airport, and a flight back to Sydney. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-10-18T09:46:00.000+03:00", "crawled": "2018-10-18T10:57:03.005+03:00", "highlightTitle": ""}