{"organizations": [], "uuid": "b0319c0b2cbe35052905f123af6c69d168cc08b9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article2146454.ece/ALTERNATES/s1200/2_Female-Office-Worker-With-Coffee-At-Desk-Working-Late.jpg", "site_section": "http://www.leicestermercury.co.uk/rss.xml", "section_title": "Leicestershire Live - frontpage", "url": "https://www.leicestermercury.co.uk/news/business/worrying-number-leicester-firms-difficulty-2146447", "country": "GB", "domain_rank": 48128, "title": "\"Worrying\" number of Leicester firms in difficulty says Begbies Traynor report", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-25T15:18:00.000+03:00", "replies_count": 0, "uuid": "b0319c0b2cbe35052905f123af6c69d168cc08b9"}, "author": "Tom Pegden", "url": "https://www.leicestermercury.co.uk/news/business/worrying-number-leicester-firms-difficulty-2146447", "ord_in_thread": 0, "title": "\"Worrying\" number of Leicester firms in difficulty says Begbies Traynor report", "locations": [], "entities": {"persons": [{"name": "begbies traynor", "sentiment": "negative"}], "locations": [{"name": "leicester", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "midlands", "sentiment": "none"}], "organizations": [{"name": "begbies traynor", "sentiment": "negative"}, {"name": "share times", "sentiment": "none"}, {"name": "debenhams", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "\"Worrying\" number of Leicester firms in difficulty says Begbies Traynor report 10 per cent increase in Leicester firms reporting “significant financial distress” Share Times not great for all Leicester business leaders Get Business\nLocal businesses have seen a “worrying” increase in trading difficulties over the past year according to new figures.\nResearch into the financial health of UK companies by insolvency firm Begbies Traynor suggests a 10 per cent increase in Leicester firms reporting “significant financial distress” in July, August and September, compared to the same time last year.\nIts latest Red Flag Alert research suggests the local number of companies reporting problems rose from 3,484 to 3,816 in the year.\nAcross the wider Midlands, almost 56,000 businesses reported they were in trouble, up 2 per cent year-on-year.\nNationally the number of companies rated as being in ‘significant financial distress’ increased by 5 per cent on 2017. Debenhams is closing stores (Image: PA)\nAlthough nationally and locally, Begbies Traynor said, the figures do seem to be stabilizing.\nThe worst hit areas nationally were real estate, utilities, hotels and accommodation and financial services.\nIn Leicester, according to the report, support services and construction services had experienced “worrying rises in significant financial distress” since last year.\nPeter Blair is a consultant and licensed insolvency practitioner with Begbies Traynor in the East Midlands.\nHe said: “The UK’s barbecue summer – coupled with major events such as the World Cup – provided a feel good bubble for the UK economy.\n“However, the fading of the summer sun has been accompanied by a reality check as consumers tighten their purse strings, with a 0.8 per cent drop in retail sales from August to September, which included the largest decline in food sales since October 2015.\n“This change coupled with falling house prices and higher inflation across key essentials such as energy and fuel have made UK consumers cautious, particularly as economic certainty around the details of the Brexit deal remain stubbornly elusive.\n“While there has been a recent spate of positive company results – particularly those with a strong online offering, there have also been a series of very high profile collapses and profit warnings. Read More Shock as Leicester's Walkers pie shop set to close after nearly 200 years\n“While the headlines have focused on the high street, other “bellwether” sectors such as property and financial services, as highlighted in these figures, are showing worrying signs of increasing distress that needs to be addressed if we are to avoid a spiral towards static economic growth.\n“With an early budget on the horizon, businesses will be waiting to see what measures the chancellor can implement to arrest this decline, however the greatest domestic issue remains Brexit uncertainty which is the biggest elephant in the economic room.\nRic Traynor, executive chairman of Begbies Traynor, said: “Businesses with a strong product offering in growing markets will always do well, however all businesses need to focus on the fundamentals – innovation, sales and financial management, as these will be key to staying ahead of both domestic and international competition.”\nIt comes amid growing concerns of the impact Brexit will have on UK firms' abilities to trade.\nTheresa May and Philip Hammond will meet with more than 100 UK business leaders at a post-Budget and pre-Brexit summit next week. (Image: Victoria Jones/PA Wire)\nThey will address and take questions from some 120 chief executives and investors on Wednesday, two days after the Chancellor presents the last scheduled Budget before Britain leaves the EU in March.\nDowning Street said the meeting, believed to be the first of its kind to be undertaken, was a joint initiative of the Prime Minister and Chancellor.\nThe Prime Minister's official spokesman said: \"The Budget is always a significant event for business and the country at large so it is an opportunity to update some of the core messages from the Budget.\n\"But equally we are approaching March 29 next year and the Prime Minister wants to make sure that business are fully engaged in what the Government are doing and to provide them with information and updates.\" Theresa May (Image: PA)\nThe announcement follows a conference call Mrs May held with a similar-sized group of business leaders last week.\nIn a 35-minute conference call with around 120 company bosses to update them on the progress in the exit talks, the Prime Minister was said to have accepted uncertainty could be having an impact on UK firms.\nDowning Street said last Friday that Mrs May told the business leaders that \"significant progress\" has been made in the talks but \"acknowledged that there were a few significant issues that were still outstanding\". Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/leicestermercury/subscriptions/&quot;}", "https://communicatoremail.com/IN/DCF/Ad9Bw6ZcmPSmMwDi7On4yR/"], "published": "2018-10-25T15:18:00.000+03:00", "crawled": "2018-10-25T17:01:08.018+03:00", "highlightTitle": ""}