{"organizations": [], "uuid": "8a22e9dcd994ffbd7ac83193d491fbd7362bcf6c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/devon-news/who-is-geoffrey-cox-2069778", "country": "GB", "title": "Who is Geoffrey Cox?", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-03T14:21:00.000+03:00", "replies_count": 0, "uuid": "8a22e9dcd994ffbd7ac83193d491fbd7362bcf6c"}, "author": "Neil Shaw", "url": "https://www.devonlive.com/news/devon-news/who-is-geoffrey-cox-2069778", "ord_in_thread": 0, "title": "Who is Geoffrey Cox?", "locations": [], "entities": {"persons": [{"name": "neil shaw", "sentiment": "none"}, {"name": "geoffrey cox", "sentiment": "none"}], "locations": [{"name": "torridge", "sentiment": "none"}, {"name": "west devon", "sentiment": "none"}], "organizations": [{"name": "digital", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get Daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nGeoffrey Cox has been MP for Torridge and West Devon since 2005 and is said to be the highest earning MP in the House of Commons, thanks to his other role as a barrister.\nOn July 9, 2018 he was appointed Attorney General and at the Conservative Party Conference 2018 was the special guest invited to introduce Prime Minister Theresa may.\nIn his speech he said it was time for the party's members to 'grow up' and back Mrs May in Brexit negotiations and as leader of the party as well as PM. Read More\nHe said: \"We have to be grown up. We have now reached the critical moment. We must resolve and put aside our differences and unite behind the PM.\"\nMr Cox added: \"Brexit is based on hope, not fear. We need not fear self-government.\"We believe a nation like the UK will soon be able to gather her strength and step into the world as a sovereign partner to the other democracies.\"\nGeoffrey Cox was born in Wiltshire in 1960 and went to King's College, Taunton before studying law at Downing College, Cambridge.\nHe started practice as a barrister in 1992 and was appointed QC in 2003. For part of his career as a barrister, Cox was Standing Counsel to the government of the Indian Ocean island nation of Mauritius.\nHis criminal cases have included the Jubilee line corruption trial; representing the controversial multi-millionaire Nicholas van Hoogstraten and successfully defending Kingsman Darren Fallon of the Queen's Lancashire Regiment, who had been accused of war crimes. Read More Devon MP 'delighted' to help nurses voted against end to pay cap\nIn 2014, Cox successfully defended the former Premier of the Cayman Islands, McKeeva Bush, on charges of corruption and misuse of office. In March 2015, Cox successfully defended the deputy Editor of The Sun , Geoff Webster, in a trial of four journalists resulting from Operation Elveden.\nCox was first selected to stand for Parliament in 2000 by the Torridge and West Devon Conservatives. In the following 2001 general election, he was narrowly defeated by the Liberal Democrats.\nAt the 2005 general election Cox defeated the new Liberal Democrat candidate, David Walter, gaining a majority of 3,236. Cox made his maiden speech in the House of Commons on 28 June 2005, which was voted by fellow MPs as being one of the four best maiden speeches of the parliament. Read More How much did your MP claim in expenses for rent, hotels and travel?\nCox was re-elected as MP for Torridge and West Devon at the 2015 general election with a substantially increased majority of 18,403 votes, or 32.5%. He increased that majority by over 2000 votes at the 2017 election to 20,686 or 34.7%, which is the largest majority in Devon and Cornwall.\nIn the House of Commons he has sat on the Environment, Food and Rural Affairs Select Committee, the Committee on Standards and the Committee on Privileges. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-10-03T14:21:00.000+03:00", "crawled": "2018-10-03T14:39:27.015+03:00", "highlightTitle": ""}