{"organizations": [], "uuid": "e960eb8c3f1b2fcddd62c31e358aee7b8907ee05", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15264014.ece/ALTERNATES/s1200/0_gordon-11.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/universal-credit-gordon-brown-labour-15262895", "country": "GB", "domain_rank": 21960, "title": "North East MPs back Gordon Brown's call to halt roll-out of Universal Credit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-10T18:08:00.000+03:00", "replies_count": 0, "uuid": "e960eb8c3f1b2fcddd62c31e358aee7b8907ee05"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/universal-credit-gordon-brown-labour-15262895", "ord_in_thread": 0, "title": "North East MPs back Gordon Brown's call to halt roll-out of Universal Credit", "locations": [], "entities": {"persons": [{"name": "gordon brown", "sentiment": "negative"}, {"name": "gordon", "sentiment": "none"}, {"name": "brown", "sentiment": "none"}, {"name": "grahame morris", "sentiment": "none"}, {"name": "helen goodman", "sentiment": "none"}, {"name": "morris", "sentiment": "none"}, {"name": "tony blair", "sentiment": "none"}], "locations": [], "organizations": [{"name": "cancel play now labour", "sentiment": "negative"}, {"name": "bishop auckland labour", "sentiment": "none"}, {"name": "universal credit", "sentiment": "none"}, {"name": "easington labour", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now Get daily\nLabour MPs have backed former Prime Minister Gordon Brown’s call for the Government to halt the roll-out of Universal Credit.\nMr Brown has warned of “chaos” if the Government pushes on with the new benefits system - and suggested there could be riots similar to those that followed the introduction of the poll tax in the 1990s.\nHe was praised by Bishop Auckland Labour MP Helen Goodman, who said: “I agree with Gordon. The average cuts to family incomes from the roll out of Universal Credit will be £2,400, but many of my constituents will lose even more.”\nEasington Labour MP Grahame Morris said: “Gordon Brown is absolutely correct Universal Credit is cruel and vindictive in nature.” Former Prime Minister Gordon Brown (Image: PA)\nIn a dig at another former Labour Prime Minister, Tony Blair , Mr Morris said: “I think Gordon Brown’s intervention adds significant weight to the argument to scrap Universal Credit and distinguishes him from Tony Blair, who has remained silent about a disaster of cataclysmic proportions for millions of our people.” Read More UK is 'closing in' on a Brexit deal, according to Brexit Secretary Dominic Raab\nIt comes after charities warned the nationwide introduction of Universal Credit would trigger a surge in the number of people using food banks.\nAccording to reports, millions of families could be left up to £200-a-month worse off when the new system is introduced in July.\nMr Brown warned that Universal Credit would remove £3 billion from the social security budget on top of cuts to child tax credits and benefit, which he helped introduce.\nHe said: “For the first time that any of us can remember, the safety net is not now the welfare state but charity and the lifeline for families in need is not social security but food banks.”\nAnd he warned: “A return to poll tax-style chaos in a summer of discontent lies ahead.”\nUniversal Credit, which replaces a range of benefits including Jobseeker’s Allowance, Income Support, Housing Benefit and more, has been rolled out gradually across the country, and Newcastle was the first whole city to receive it.\nThe new benefit comes to Northumberland and to the area served by Redcar and Cleveland council in November. Unite Community members and campaigners holding a street stall in Newcastle to help raise awareness of who will be affected by Universal Credit (Image: Newcastle Chronicle)\nBut the National Audit Office, the official independent watchdog for government spending, has warned that at least 270,000 claimants are expected to receive their payments late in 2018, likely to cause them serious financial problems.\nFigures from the Trussell Trust, a charity which runs food banks, show demand for food parcels has shot up in the North East, and the charity released a report in April suggesting Universal Credit was one of the causes.\nSo far, only new claimants or people whose circumstances change receive the new benefit.\nBut next year the process begins of moving existing claimants across the country onto Universal Credit and there are concerns that the system won’t be able to cope. Read More Ministers attempt to fix Universal Credit chaos by offering desperate claimants advice\nThe Bishop of Durham, the Rt Rev Paul Butler, is among those calling on the Government to “fix” Universal Credit and prevent more people going hungry.\nKey problems include the fact that payments are deliberately delayed, in an attempt to make receiving the benefit more like receiving a monthly pay cheque.\nBut there have been numerous reports of further delays caused by mistakes by officials. Claimants can also face a wait for benefits whenever their circumstances change, such as if they obtain short-term work but then return to the jobs market. Labour MP Helen Goodman (Image: Mirrorpix)\nAnd the Government used the introduction of the new benefit as an opportunity to cut total payments.\nThe poll tax riots in March 1990 erupted after a peaceful march by 70,000 protesters in London broke down into violent disorder.\nThere were 400 arrests and 113 people, including 45 police, were injured.\nThe march was in opposition to the Community Charge, dubbed the poll tax, which later became council tax.\nThe riots contributed to the the downfall of Margaret Thatcher, who resigned as prime minister in November 1990. Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-10-10T18:08:00.000+03:00", "crawled": "2018-10-10T19:07:19.015+03:00", "highlightTitle": ""}