{"organizations": [], "uuid": "0e6db0e7665e365098e76b472fe42b6490870aa6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14439841.ece/ALTERNATES/s1200/Sean-Sneddon.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/funding-north-tyne-council-expected-15224314", "country": "GB", "domain_rank": 21960, "title": "Funding for North of Tyne council expected in Chancellor's Budget", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-02T07:00:00.000+03:00", "replies_count": 0, "uuid": "0e6db0e7665e365098e76b472fe42b6490870aa6"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/funding-north-tyne-council-expected-15224314", "ord_in_thread": 0, "title": "Funding for North of Tyne council expected in Chancellor's Budget", "locations": [], "entities": {"persons": [{"name": "tyne", "sentiment": "negative"}, {"name": "philip hammond", "sentiment": "negative"}, {"name": "peter alan jackson", "sentiment": "none"}, {"name": "robert jenrick", "sentiment": "none"}, {"name": "nick forbes", "sentiment": "none"}, {"name": "norma redfearn", "sentiment": "none"}], "locations": [{"name": "north tyneside", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}], "organizations": [{"name": "budget news funding for north of tyne", "sentiment": "negative"}, {"name": "newcastle city council", "sentiment": "none"}, {"name": "northumberland council", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Funding for North of Tyne council expected in Chancellor's Budget Chancellor Philip Hammond's Budget statement on October 29 is likely to include funding for the new Combined Authority Share Nick Forbes. leader of Newcastle City Council, Norma Redfearn, directly-elected Mayor of North Tyneside and Councillor Peter Alan Jackson, leader of Northumberland Council (Image: Newcastle Chronicle) Get daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nThe Chancellor’s Budget on October 29 is expected to reveal more details of funding for the new North of Tyne mayor and combined authority.\nNewcastle, Northumberland and North Tyneside are forming a new regional council to be led by a mayor.\nAnd Chancellor Philip Hammond is expected to make a funding announcement in his Budget on October 29.\nSpeaking to ChronicleLive at the Conservative Party conference in Birmingham, Treasury Minister Robert Jenrick said: “We are very excited about the potential of the North of Tyne deal.” Video Loading Click to play Tap to play The video will start in 8 Cancel Play now\nMr Jenrick, the Exchequer Secretary to the Treasury, is the Treasury minister responsible for the Northern Powerhouse and regional devolution.\nAn interim mayor with limited powers will be appointed this year, and elections for a mayor take place in 2019.\nMr Jenrick said: “We are looking forward to the elections next year.\n“We want to ensure that this deal, like the ones we have created in regions such as the West Midlands, delivers economic strategy and new jobs, helps us to deliver the industrial strategy, and we get infrastructure investment going in the north of England.\n“We will be returning to the funding shortly, so we will be clearer on that in the current weeks.” Read More Business Secretary Greg Clark warns Tories must listen to carmakers such as Nissan over Brexit\nGovernment legislation is creating a new mayor-led combined authority covering the three councils, known as the North of Tyne Combined Authority, as well as changing the boundaries of the North East Combined Authority so that Newcastle, Northumberland and North Tyneside are no longer members.\nAnd it orders the combined authorities to create a new “joint transport committee” to take over some of the work currently carried out by the North East Combined Authority, which includes overseeing Nexus, the transport body responsible for the Tyne and Wear Metro and more.\nNewcastle, North Tyneside and Northumberland councils will each choose two councillors to sit on the Combined Authority.\nOne of the first acts of the Combined Authority will be to appoint a mayor, who will chair the new authority until elections take place next May.\nThe first directly-elected mayor holds the post for five years, with the next election in 2024.\nThe Combined Authority will have a range of powers, such as control over housing policy.\nThe mayor will have influence over the Combined Authority as its chair, and directly-elected mayors will also have some powers in their own right, such as control over a Mayoral Development Corporation designed to improve the local economy. Read More\nMayors will also be able to add a small charge to council tax bills, known as a precept, to help pay their running costs.\nIn Greater Manchester, this currently comes to £8 a year for a band D property. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-10-02T07:00:00.000+03:00", "crawled": "2018-10-02T09:59:28.004+03:00", "highlightTitle": ""}