{"organizations": [], "uuid": "37e9cdf09940a19f7a692c84ca96778eb7a370b1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article2074633.ece/ALTERNATES/s1200/0_35914358.jpg", "site_section": "", "section_title": "", "url": "https://www.leicestermercury.co.uk/news/local-news/council-leader-ignores-calls-mps-2160881", "country": "GB", "domain_rank": 48128, "title": "Council leader ignores calls from MPs to shelve unitary authority plans - Leicestershire Live", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-30T02:00:00.000+02:00", "replies_count": 0, "uuid": "37e9cdf09940a19f7a692c84ca96778eb7a370b1"}, "author": "Amy Orton", "url": "https://www.leicestermercury.co.uk/news/local-news/council-leader-ignores-calls-mps-2160881", "ord_in_thread": 0, "title": "Council leader ignores calls from MPs to shelve unitary authority plans - Leicestershire Live", "locations": [], "entities": {"persons": [{"name": "nick rushton", "sentiment": "negative"}, {"name": "coun rushton", "sentiment": "none"}, {"name": "edward arg", "sentiment": "none"}], "locations": [{"name": "leicestershire", "sentiment": "none"}], "organizations": [{"name": "leicestershire live council", "sentiment": "negative"}, {"name": "share amy orton local democracy", "sentiment": "none"}, {"name": "leicestershire county council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Council leader ignores calls from MPs to shelve unitary authority plans Councillor Nick Rushton will continue to look at scrapping district and borough councils Share Amy Orton Local Democracy Reporter 15:17, 30 OCT 2018 Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nThe leader of Leicestershire County Council is refusing to bow to pressure from local MPs who are suggesting plans for a major local government shake up be scrapped.\nA letter has been sent to Councillor Nick Rushton formally asking him to shelve plans to scrap Leicestershire County Council and the county's borough and district councils and form a unitary authority. The letter also calls for no more public funds to be spent on exploring the restructure.\nCoun Rushton is thought to have been told that now is not the time to carry out a review of local authority structures in Leicestershire in a joint letter from Edward Argar, Andrew Bridgen, Alberto Costa, Alan Duncan, David Tredinnick, Nicky Morgan and Neil O'Brien.\nIt was apparently sent following recent discussions between the seven MPs and the Secretary of State for Housing, Communities and Local Government, James Brokenshire MP.\nThe Government will need to approve any changes to council structures. Read More Why councillors discussing unitary plans are meeting behind closed doors\nThe leaders of Blaby, Charnwood, Harborough, Hinckley and Bosworth, Melton, North West Leicestershire, and Oadby and Wigston councils issued a joint statement in response to the letter.\nIt said: “We would like to thank the Leicestershire MPs for their joint letter to all district and county council leaders following their meeting with the Secretary of State to discuss our proposed review of the current model of local government in Leicestershire and the county council’s promotion of structural reform of local government. County Hall Exterior GV.PICTURE CHRIS GORDON\n“The conclusion of the MPs, supported by the Secretary of State, that no such change is necessary and work towards it should cease immediately reinforces what the districts have previously stated, that local authority structural reform will only happen if all parties are working together and in agreement.\n“We understand and respect their concerns and therefore the district councils will not be pursuing any proposals for structural change.\n“Districts have always worked together and we will continue to collaborate with all partners in order to deliver the best possible services to residents.” Read More More than 140k Leicestershire people called WRONG council last year - do you know who to call?\nHarborough MP Neil O'Brien confirmed he and his colleagues had written to County Hall saying the plans to move to unitary status should be dropped.\nHe said: \"For this to go ahead it needs to have universal support from MPs and the districts.\n\"At the moment it has the opposite of that. It has no support.\n\"It's not even a close-run thing.\n\"My suggestion would be to drop the conversation for the time being. It is as comprehensively off as it could be.\n\"A single unitary authority would be too remote. Read More Budget 2018 documents confirm that there will be a Brexit 50p coin\n\"I am incredibly sympathetic to the financial plight of the county council and it is a big part of my campaigning but I do not think this is the way to address it.\"\nBut Coun Rushton, who first tabled the plans in June, has refused to step away from the proposals and said he looks forward to hearing what tax payers think.\nHe said: “I am disappointed that the Leicestershire MPs have come to these conclusions so early in this process. We have just started the conversation and it’s too soon to draw the debate to a close.\n“I understand that this is a difficult topic and we are challenging the status quo. But we face serious financial challenges here and we cannot simply reject ideas which could potentially save many millions for the people of Leicestershire without the proper discussion. Nick Rushton\n“I look forward to hearing more from the people who matter most, namely our council tax payers and amongst others, the business community and our partners across the public and voluntary sector, before we finalise any possible proposals.”\nLeicestershire Live has previously asked how much drawing up the plans and compiling reports on the reform has cost Leicestershire County Council but no amount has been confirmed. Read More ", "external_links": [], "published": "2018-10-30T02:00:00.000+02:00", "crawled": "2018-10-30T18:52:16.011+02:00", "highlightTitle": ""}