{"organizations": [], "uuid": "84b27b874ba1328c2f16984b16c88c78b4220620", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14580082.ece/ALTERNATES/s1200/0_JS109654067.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/uk-autumn-budget-2018-predictions-15312356", "country": "GB", "domain_rank": 21960, "title": "UK Autumn Budget 2018: What can we expect in Chancellor Philip Hammond's statement?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-28T07:00:00.000+02:00", "replies_count": 0, "uuid": "84b27b874ba1328c2f16984b16c88c78b4220620"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/uk-autumn-budget-2018-predictions-15312356", "ord_in_thread": 0, "title": "UK Autumn Budget 2018: What can we expect in Chancellor Philip Hammond's statement?", "locations": [], "entities": {"persons": [{"name": "philip hammond", "sentiment": "neutral"}, {"name": "hammond", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}], "organizations": [{"name": "cabinet", "sentiment": "none"}, {"name": "budget", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}, {"name": "whitehall", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nTheresa May promised earlier this month that austerity was coming to an end.\nThe promise, in her speech to the Conservative Party conference, referred to the period after Brexit takes place.\nBut Chancellor Philip Hammond will be under pressure to demonstrate that austerity is reaching an end when he delivers his Budget statement on Monday.\nThe Budget takes place on October 29, at about 3.30pm. Chancellor Philip Hammond leaves number 11 Downing Street (Image: Getty Images Europe)\nSome details of the Cabinet discussions taking place in the run-up to the Budget have already leaked.\nBut beware - sometimes plans are deliberately leaked in order to manage expectations or to give Cabinet Ministers ammunition in their negotiations with the Treasury. Measures that may be in the Budget The promise of extra spending\nMr Hammond will promise that Whitehall departments will get above-inflation budget increases in next year’s spending review - but only if Britain emerges with a Brexit deal, according to reports.\nHe may also announce NHS funding to pay for the 10-year cancer strategy announced by Theresa May at the Conservative conference. Read More A 'no-deal' Brexit will be a disaster for the North East, says TUC General Secretary Regional pay\nMr Hammond wants greater “flexibility” over public sector pay and is looking to take a more “targeted” approach, according to reports.\nThis would include ensuring pay rises are based on people’s performance and where they live. A freeze on fuel duty\nTheresa May has already pledged that fuel duty will be frozen for the ninth year in a row. A person using a petrol pump (Image: PA)\nThink tank the Institute for Fiscal Studies has estimated that the policy costs the Treasury about £9bn a year.\nHowever, supporters of a freeze say it cuts bills for cash-strapped motorists, and particularly helps people in rural areas. Tax rises\nThe Chancellor is said to be considering postponing income tax cuts and curbing pensions tax relief in a bid to find more funding. Universal Credit\nThe Chancellor has been urged by some Conservative MPs to provide up to £2 billion to sort out Universal Credit, the Tories’ flagship benefits policy.\nUniversal Credit is supposed to reduce poverty by helping people get into work (though it is also claimed by some people who already have a job). But in practice there’s evidence it has led to an increase in rent arrears and families dependent on food banks. Read More", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-10-28T07:00:00.000+02:00", "crawled": "2018-10-28T08:22:30.008+02:00", "highlightTitle": ""}