{"organizations": [], "uuid": "7885ac374380547ee847dffa60e1f6cd5d1e946d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15323604.ece/ALTERNATES/s1200/0_James-Ramsbotham-NECC.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-most-lose-chaotic-15323521", "country": "GB", "domain_rank": 21960, "title": "North East has 'most to lose from chaotic Brexit', business leaders say", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-24T18:08:00.000+03:00", "replies_count": 0, "uuid": "7885ac374380547ee847dffa60e1f6cd5d1e946d"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-most-lose-chaotic-15323521", "ord_in_thread": 0, "title": "North East has 'most to lose from chaotic Brexit', business leaders say", "locations": [], "entities": {"persons": [{"name": "james ramsbotham", "sentiment": "none"}, {"name": "philip hammond", "sentiment": "none"}], "locations": [{"name": "north east england", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "necc", "sentiment": "none"}, {"name": "budget", "sentiment": "none"}, {"name": "kevin gibson photography ltd", "sentiment": "none"}, {"name": "chamber of commerce", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business North East has 'most to lose from chaotic Brexit', business leaders say North East England Chamber of Commerce calls on Chancellor Philip Hammond to back region in next week's Budget Share James Ramsbotham, NECC (Image: Kevin Gibson Photography Ltd) Get business updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nThe North East’s largest business organisation has called on Chancellor Philip Hammond to boost the regional economy but warned we have “the most to lose from a chaotic Brexit.”\nIn its submission to the Chancellor in the run-up to Monday’s Budget , the North East England Chamber of Commerce has called for more investment in infrastructure, better funding for business support and greater backing for companies looking to export.\nSenior figures at the Chamber have become increasingly critical in recent weeks of the Government’s handling of Brexit, with a poll of its members showing that more than half of firms in the region believe that leaving the EU will do them harm. Chancellor Philip Hammond leaves number 11 Downing Street (Image: Getty Images Europe)\nChief executive James Ramsbotham said: “Our regional economy has the most to lose from a chaotic Brexit. We need fundamental economic and infrastructure issues to be addressed urgently through this Budget to put us in the best place to sustain economic growth.\n“In the North East we need both a stronger voice at a national level and the ability to take far more decisions about our own economic future. This Budget has to reinforce the progress made through devolution settlements in Tees Valley and North of Tyne and recognise that our region has so much more to contribute to the national economy.”\nThe Chamber’s letter to the Chancellor also calls for specific investment in East Coast Main Line to address current capacity issues and prepare for HS2 and Northern Powerhouse Rail, as well as support for improvements to Darlington and Middlesbrough stations. The EU and Union flags (Image: PA)\nMr Ramsbotham said: “Our region has historically been one of the biggest recipients of EU funding; based rightly on the need to address economic underperformance and higher levels of deprivation compared to elsewhere in the UK. We are therefore seeking a guarantee in this Budget that the new UK Shared Prosperity Fund will recognise the specific economic needs of regions such as ours.”\nThe Chancellor has received hundreds of appeals for funding in the run-up to next week’s Budget, the last before the UK is due to leave the EU.\nThe Royal Institution of Chartered Surveyors (RICS) has joined a number of groups in urging a review of business rates, saying the current system, along with uncertainty surrounding the Brexit negotiations, has taken taking its toll on the North East’s commercial property market, Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-10-24T18:08:00.000+03:00", "crawled": "2018-10-24T20:05:56.001+03:00", "highlightTitle": ""}