{"organizations": [], "uuid": "bc8ce1643b81bc659d19d88af22f398621538920", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15200660.ece/ALTERNATES/s1200/0_Theresa-May-Makes-EU-Statement.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/here-big-announcements-expected-conservative-15220297", "country": "GB", "domain_rank": 21960, "title": "Here are the big announcements expected at the Conservative conference on Monday", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-01T02:01:00.000+03:00", "replies_count": 0, "uuid": "bc8ce1643b81bc659d19d88af22f398621538920"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/here-big-announcements-expected-conservative-15220297", "ord_in_thread": 0, "title": "Here are the big announcements expected at the Conservative conference on Monday", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "News Here are the big announcements expected at the Conservative conference on Monday Prime Minister Theresa May is promising laws to stop employers taking tips from waiters and waitresses at the Tory conference Share British Prime Minister Theresa May (Image: Getty Images Europe) Get daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nPrime Minister Theresa May is announcing plans for new laws to stop employers making deductions from workers’ tips.\nIt follows reports that some well-known restaurant chains and hospitality businesses have deducted money from tips left for their staff.\nTo stop this, the Prime Minister is announcing the Government’s response to a consultation, which will be to introduce new primary legislation to ban employers making such deductions.\nMrs May said: “The unemployment rate under this government is now the lowest since the 1970s – but we want to ensure that everyone is treated fairly in the workplace. That’s why we will introduce tough new legislation to ensure that workers get to keep all of their tips – banning employers from making any deductions.\n“It’s another way we are building an economy that works for everyone.” Read More Chancellor Philip Hammond leaves number 11 Downing Street (Image: Getty Images Europe) Chancellor Philip Hammond announces £125 million package to support learning and apprenticeships.\nThe funding will expand the range of existing courses available and increase the number of people who can access science, technology, transport and healthcare courses, giving more people a choice as they climb the career ladder.\nThe Chancellor will also announce £30 million to encourage big business to mentor small business, in a drive to share knowledge, best practice and digital support.\nMr Hammond will say: “Too many people have experienced years of slow wage growth, felt less secure in their jobs and seen the housing market spiral beyond their reach. And as they look around them, they feel a growing concern that they are falling behind.\n“So the challenge is to ensure that 21st Century capitalism delivers for them; to convince them that our vision of Britain’s future can meet their aspirations and that our plan, unlike Labour’s, will actually deliver a better tomorrow for them and their families.” Read More Business Secretary Greg Clark warns Tories must listen to carmakers such as Nissan over Brexit Exiting the European Union Secretary Dominic Raab (Image: PA) Brexit Secretary Dominic Raab will warn that the UK is ready to leave the EU without a Brexit deal if need be.\nHe is expected to say: “Our proposals would deliver a historic agreement that provides a roadmap out of the EU and a final deal that will be good for the whole country.\n“A deal that delivers on the referendum, because that’s our democratic duty. A deal that manages the risks of Brexit, because that’s our responsibility.” poll loading Would you change your Brexit vote if you could? 500+ VOTES SO FAR Yes No\nBut he will continue: “Our willingness to compromise is not without limits. We are leaving the European Union in fact, not just in name.\n“If we can’t obtain a deal that secures that objective...if an attempt is made to lock us in via the back door of the EEA and Customs Union...or if the only offer from the EU threatens the integrity of our Union. Then we will be left with no choice but to leave without a deal.” Read More Home Secretary Sajid Javid was \"cornered\" by top police officers to defend police cuts - here's what he said Communities Secretary James Brokenshire (Image: PA) Communities Secretary James Brokenshire will announce the government is to change planning rules making it easier for property owners to “build up” by adding new floors.\nHe will also announce that councils will be allowed to sell land cheaply when theer is a developer interested in building new homes, in an effort to ensure new home are actually built. It follows complaints that developers have been buying land and leaving it empty while they wait for values property values to increase.\nMr Brokenshire will say: “We need to be smarter on how we use land and the space available.\n“Prioritising brownfield but also looking at land that’s already been built on.\n“That’s why I will publish proposals to permit people to build up on existing buildings rather than build out to use more precious land.\n“And give Councils greater powers to deliver the garden communities of the future.” Like us on Facebook", "external_links": ["https://mab.data.tm-awx.com/rhs&quot;,&quot;modularCss&quot;:&quot;true&quot;,&quot;nativeAppBanner&quot;:&quot;true&quot;}}}", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-10-01T02:01:00.000+03:00", "crawled": "2018-10-01T06:10:01.016+03:00", "highlightTitle": ""}