{"organizations": [], "uuid": "5aff3c05902c33999f2821085e79d4065c1b341f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article2116061.ece/ALTERNATES/s1200/0_Untitled-design-2.jpg", "site_section": "http://www.leicestermercury.co.uk/rss.xml", "section_title": "Leicestershire Live - frontpage", "url": "https://www.leicestermercury.co.uk/news/local-news/andrew-bridgen-rounds-house-commons-2116009", "country": "GB", "domain_rank": 48128, "title": "Andrew Bridgen rounds on House of Commons Speaker John Bercow after bullying report", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-17T16:15:00.000+03:00", "replies_count": 0, "uuid": "5aff3c05902c33999f2821085e79d4065c1b341f"}, "author": "Dan Martin", "url": "https://www.leicestermercury.co.uk/news/local-news/andrew-bridgen-rounds-house-commons-2116009", "ord_in_thread": 0, "title": "Andrew Bridgen rounds on House of Commons Speaker John Bercow after bullying report", "locations": [], "entities": {"persons": [{"name": "andrew bridgen", "sentiment": "negative"}, {"name": "john bercow", "sentiment": "negative"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "dame laura cox", "sentiment": "none"}, {"name": "bercow", "sentiment": "none"}], "locations": [{"name": "westminster", "sentiment": "none"}], "organizations": [{"name": "house of commons", "sentiment": "negative"}, {"name": "house of commons speaker", "sentiment": "none"}, {"name": "tory north west leicestershire", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Andrew Bridgen rounds on House of Commons Speaker John Bercow after bullying report The North West Leicestershire MP says the speaker cannot be part of the solution to Parliament's 'toxic' culture Share John Bercow and Andrew Bridgen Get Daily\nAndrew Bridgen has hit out at John Bercow amid calls for the House of Commons Speaker to resign in the wake of an investigation into a culture of bullying in parliament.\nMr Bercow has come under fire following a scathing report into bullying and sexual harassment in Westminster and the Tory North West Leicestershire MP has said he ‘cannot be part of the solution’ to the bullying behaviour set out.\nHigh Court judge Dame Laura Cox lifted the lid on a toxic environment in that included staff having their bottoms and breasts touched in an atmosphere fuelled by ready access to alcohol. Read More Andrew Bridgen calls for Parliament watchdog to investigate Jeremy Corbyn's trip to wreath laying ceremony\nHer report found a culture of \"deference, subservience, acquiescence and silence\" had allowed the mistreatment of staff in the House of Commons to thrive.\nIn the report, Dame Laura said it was \"difficult to envisage\" how the reforms needed could be delivered under the current senior House administration.\nDuring a Commons debate on the report, during which Mr Bercow remained in the chair, MPs said it was time for him to stand down.\nIt has been reported the speaker has privately indicated he will step down next summer after he has completed a decade in the influential role.\nMr Bridgen, a vocal critic of Mr Bercow, has questioned whether he should remain that long. Andrew Bridgen\nMr Bridgen told the BBC: “This is clearly a pre-emptive strike for him to see off calls to go immediately following the very damning criticism he has received from the Dame Laura Cox report.\n“The culture change needs to be seismic and the current senior management of the House of Commons came in for particularly heavy criticism.\n“Dame Laura Cox said she did not believe the change we need to see in this place could go ahead with those characters in position and if it is going to be another eight or nine months before the speaker leaves it will delay the whole process. Read More Jain temple objects to £1.5m revamp of York Road in Leicester city centre\n“Whether that will be enough to keep John Bercow in position with so much else going on, such as Brexit, is up to colleagues.”\nAsked if the speaker should leave sooner, Mr Bridgen said: “I’ve been critical of him in the past, in my view he has ripped every page of impartiality from the Speaker’s rule book.\n“He is mercurial. He can turn on a sixpence.\n“I have seen him take apart fairly vulnerable new MPs in that chamber and destroy their confidence to speak and that cannot be condoned.”\nHe added: “Given that the current senior management of the House of Commons is so criticised in Dame Laura's report, who can be trusted to take ownership of this important issue and how can those deemed to be the problem themselves ever possibly be part of the solution?\" Read More", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/leicestermercury/subscriptions/&quot;}", "https://communicatoremail.com/IN/DCF/Ad9Bw6ZcmPSmMwDi7On4yR/"], "published": "2018-10-17T16:15:00.000+03:00", "crawled": "2018-10-17T16:58:26.003+03:00", "highlightTitle": ""}