{"organizations": [], "uuid": "ad434ae4b97b41bea35972d4148d4330f00126b9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/uk-world-news/article2129818.ece/ALTERNATES/s1200/0_19436457-1.jpg", "site_section": "", "section_title": "", "url": "https://www.devonlive.com/news/uk-world-news/peoples-vote-march-live-half-2129802", "country": "US", "title": "People's Vote March live as half a million anti-Brexit campaigners bring London to a standstill - Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.105, "site_type": "news", "published": "2018-10-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "ad434ae4b97b41bea35972d4148d4330f00126b9"}, "author": "Jacqui Merrington", "url": "https://www.devonlive.com/news/uk-world-news/peoples-vote-march-live-half-2129802", "ord_in_thread": 0, "title": "People's Vote March live as half a million anti-Brexit campaigners bring London to a standstill - Devon Live", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "none"}, {"name": "simon chater", "sentiment": "none"}, {"name": "johnny mercer", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "park lane", "sentiment": "none"}, {"name": "parliament square", "sentiment": "none"}, {"name": "south devon", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now\nHalf a million anti- Brexit campaigners have descended on central London to demand a second EU referendum.\nThe People's Vote March set off from Park Lane at midday to march to Parliament Square in protest over the Government's plans to leave the European Union .\nAerial footage on Sky News showed tens of thousands of people making their way through the capital.\nIn a statement released prior to the march, organisers said the campaign would \"use the biggest, loudest and most important demonstration on Brexit to unleash a postal tidal wave on MPs in Parliament\".\nProtest group Devon for Europe sent around 400 people to the event in eight coaches which left the county at 6am.\nSimon Chater, 69, from South Devon, said: \"This is the first time in my life I've been political.\" Read More Twitter and Johnny Mercer's most astonishing moments - revealed\nThe march is part of the #WriteThisWrong campaign, in which 100,000 postcards will be distributed with the words \"Brexit has already become a dog’s dinner – the whole process is going badly wrong. And it’s only going to get worse.\"\nLed by a group of young voters, the march to Parliament Square is under way.\nLondon Mayor Sadiq Khan and celebrity chef Delia Smith are among those due to speak at the event, along with MPs from Labour, Conservative, Liberal Democrat, Green Party, the SNP and Plaid Cymru. Read More\nMarchers will be encouraged to write a personal message on the other side of the postcard and address it to their MP before handing them to People’s Vote volunteers for delivery direct to the House of Commons next week. poll loading Should there be a second Brexit referendum? 500+ VOTES SO FAR Yes - I voted against it first time and would again Yes - I voted for Brexit but I've changed my mind No - I voted against it but now I want it to happen No - Brexit means Brexit, just get on with it I don't care\nThe campaign will also launch an innovative new email tool, integrated into the People’s Vote website, where people can put in their postcodes to find their MP and write personalised text to their elected representatives. Read More Holidaymakers need to renew passports NOW in case of no deal Brexit\nA leading campaigner for the People's Vote, Andrew Adonis, said: \"Brexit becoming a dog’s dinner. This week’s fresh chaos and confusion over Brexit negotiations has exposed how even the best deal now available will be a bad one for Britain.\n\"It’s a mess that nobody voted for and the reason we’re in such a growing crisis is that those cheerleading for Brexit know the promises they made can never be kept.\n\"So this campaign is about using the people power writing to their MP get a People’s Vote to address the wrongs of this botched Brexit process.\n\"This is about making sure MPs understand how strong feelings are running on this vital issue. If they are wavering, they need to know there is a political price to be paid for doing the wrong thing.\n\"Voters will neither forgive nor forget if MPs allow this miserable Brexit to proceed without people being given the final say.\"\nLive updates from the march below More On ", "external_links": [], "published": "2018-10-20T03:00:00.000+03:00", "crawled": "2018-10-21T20:14:48.008+03:00", "highlightTitle": ""}