{"organizations": [], "uuid": "b249da70a4e2ed5cb5a0f40e523413d28791ceea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15232421.ece/ALTERNATES/s1200/2_JS164496256.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/brexit-latest-news-dup-may-15267938", "country": "GB", "domain_rank": 21960, "title": "Brexit latest: This is what to expect as Theresa May gets closer to agreeing a deal with the EU", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-11T16:09:00.000+03:00", "replies_count": 0, "uuid": "b249da70a4e2ed5cb5a0f40e523413d28791ceea"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/brexit-latest-news-dup-may-15267938", "ord_in_thread": 0, "title": "Brexit latest: This is what to expect as Theresa May gets closer to agreeing a deal with the EU", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "eu farming", "sentiment": "negative"}, {"name": "house of commons", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Farming industry A dilemma for Labour MPs\nOne of the big questions Labour MPs must ask is whether voting down the deal would simply lead to the UK crashing out of the EU without any deal at all.\nThere’s certainly no majority in the House of Commons for doing that. But as things stand, Brexit is due to take place on March 29, 2019 - and if no deal is agreed by that point then a no-deal Brexit appears to be the default position.\nThe Labour leadership has been pushing the idea that defeating Theresa May on the Brexit vote would lead to a general election.\nBut the Brexit vote will not be a vote of confidence, which is what would be required to trigger a general election (and even then there would be complications thanks to the Fixed-Term Parliaments Act). Labour leader Jeremy Corbyn (Image: PA)\nThere’s nothing to stop Labour calling a vote of confidence, but all the Tory rebels who oppose Mrs May’s Brexit deal would rally to her side in such a vote, as this time they would effectively be voting on whether their party should stay in power.\nFurthermore, the hardline Brexiteers who oppose Mrs May’s proposed “Brexit” deal are exactly the sort of people who would welcome the prospect of a “no-deal” Brexit. They’re hardly going to bring down the Government when it looks like they’re on course to get what they want. Read More\nThe only thing that’s guaranteed if the Commons votes down a proposed EU deal is that the EU deal won’t be implemented. Nothing else is certain. The dangers of a no-deal Brexit\nThere’s a chance that some Labour MPs will vote with the Government, on the grounds that a no-deal Brexit would do enormous harm to the UK’s economy.\nThe automotive industry would be particularly hard hit, and firms such as Jaguar Land Rover have issued dire warnings about the impact of a no-deal Brexit on their supply chains.\nFactories simply wouldn’t be able to operate if it became harder to import parts from EU suppliers due to delays at borders.\nBut carmakers are just one example. Many British firms have taken full advantage of the opportunities that EU membership offers, and losing those advantages would cause a profound shock to the economy. The Nissan factory in Sunderland (Image: Unknown)\nAt least with Theresa May’s “Chequers” plan, the UK would enter into a customs partnership and free trade zone which replicate, to some extent, what we have now.\nAnd it seems clear that the Government is preparing for a no-deal Brexit if that’s the only one on offer.\nFor example, we learnt this week that Whitehall officials are discussing whether the mass slaughter of sleep might be required, if they can no longer be taken to slaughterhouses in continental Europe. Read More MP Ronnie Campbell taunts Theresa May over rising national debt\nIt means Labour MPs face a difficult decision. If Jeremy Corbyn does order them to vote against a deal, and they obey, they might bring about exactly the result they hope to avoid.\nBut if they support a deal, they will come under fire from those party activists who believe that defeating Mrs May over Brexit would somehow trigger a general election and give Labour a chance to take power. Government asks for Labour support Exiting the European Union Secretary Dominic Raab (Image: PA)\nBrexit Secretary Dominic Raab urged MPs worried about the future of the car industry to back the Government’s deal.\nSpeaking in the House of Commons, he said: “Opposition Members should get behind the Government’s approach.\n“Through the White Paper we can guarantee frictionless trade with our EU partners, while expanding our global opportunities.” But what about the DUP?\nThe great unknown is whether Theresa May's allies in the DUP will be willing to back whatever deal she thrashes out with the EU. Read More Government will have \"blood on its hands\" unless it ends Universal Credit immediately, MP warns\nAfter losing her majority in the 2017 general election, she almost certainly needs their support to win Commons votes on Brexit.\nAnd for a while, everyone assumed they'd back her - because they don't want Jeremy Corbyn to become Prime Minister.\nBut now it seems the DUP might really be willing to vote against any Brexit deal that creates some sort of border between Northern Ireland and the rest of the UK, even if it means there's a chance of Labour gaining power. Like us on Facebook", "external_links": [], "published": "2018-10-11T16:09:00.000+03:00", "crawled": "2018-10-11T21:04:23.025+03:00", "highlightTitle": ""}