{"organizations": [], "uuid": "a978c4df9f35892d517153a7cc66a47ac69b4fa5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15265570.ece/ALTERNATES/s1200/1_JS165198332.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15265568", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast RECAP: Firms could be forced to reveal ethnicity pay gap to boost minority workers", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-11T10:00:00.000+03:00", "replies_count": 0, "uuid": "a978c4df9f35892d517153a7cc66a47ac69b4fa5"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15265568", "ord_in_thread": 0, "title": "Business Breakfast RECAP: Firms could be forced to reveal ethnicity pay gap to boost minority workers", "locations": [], "entities": {"persons": [{"name": "br", "sentiment": "negative"}, {"name": "jonathon manning chequers", "sentiment": "negative"}, {"name": "blair", "sentiment": "negative"}, {"name": "theresa may", "sentiment": "none"}, {"name": "tony blair", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "chequers", "sentiment": "none"}], "organizations": [{"name": "brexit", "sentiment": "negative"}, {"name": "financial times", "sentiment": "none"}, {"name": "wto", "sentiment": "none"}, {"name": "niesr", "sentiment": "none"}, {"name": "national institute of economic and social research", "sentiment": "none"}, {"name": "world trade organisation", "sentiment": "none"}, {"name": "chequers", "sentiment": "none"}, {"name": "institute for global change", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning Chequers plan nearly as bad for services as no-deal Brexit - Blair backed report\nBrexit will inflict long-lasting “pain” on Britain’s service sector, Tony Blair has warned as a report said the Prime Minister’s plans will be only marginally better than no-deal on the dominant industry.An analysis carried out for the former prime minister’s Institute for Global Change said that crashing out and trading on World Trade Organisation (WTO) terms would see productivity 4.91% lower in 12 years’ time than if Britain remained in the customs union and single market.Even Theresa May’s so-called Chequers deal would see GDP take a 4.13% hit, research carried out by the National Institute of Economic and Social Research (NIESR) suggests.The impact on services from the WTO scenario would be 2.1%, double that of goods exports.The Chequers plan, which would keep Britain closer to the EU for goods but allow it more freedom over services, would leave it only marginally better with a 1.9% fall in GDP, it claims.Mr Blair told the Financial Times that services were “the forgotten part of the Brexit landscape”, saying:\nMany people may think that though the short-term impact of Brexit will be severe, we will swiftly recover. This analysis demonstrates that this is not the case.\nThe pain will go on for a long time and will only be reduced by radical measures of deregulation and cost saving to improve Britain’s competitive advantage with Europe, which run in precisely the opposite direction of the policies now advocated by both main political parties. Tony Blair (Image: PA) Jonathon Manning Vertu Motors' turnover smashes £1.5bn mark but profits hit by supply chain issues\nVertu Motors’s revenue rose to £1.56bn at the half-year mark, but the company’s profits were dented by supply chain issues across the market.\nThe Gateshead firm saw its turnover grow 7.6% to £1.56bn for the six months ending August 31, up from £1.45bn during the same period in 2017.\nCommenting on the results, Vertu’s CEO Robert Forrester said:\nIn terms of our first half results we performed well and in line with our expectations. We actually sold more new cars through our retail channels despite a fall in the market, and more used cars despite the market fall.\nOverall we generated £166.7m of gross profit. There is a lot to be thankful for.\nMr Forrester added that the company’s operating profit had been hit by a rise in costs as well as a number of external factors. Vertu’s operating profit fell from £24.7m to £18.6m during the period.\nThe decrease in margins was largely due to supply chain issues caused by the EU’s new regulations for car emissions. As manufacturers worked to abide by the new rules, they delivered fewer cars to the UK.\nProfitability was also hit by the low value of the pound, which led to manufacturers increasing their prices.\nMr Forrester said:\nThe UK market fell 20% in September, and September is a big month [because of the release of new car registrations]. That will continue in a modest form for four months but at a less vicious rate.\nThe second item is the impact of the sterling weakness. The manufacturers have been looking at how many cars they want to sell in the UK. Robert Forrester, CEO of Vertu Motors (Image: vertu motors) 8:57 Whitbread shareholders vote through Costa Coffee takeover by Coca-Cola Costa Coffee (Image: South Wales Evening Post) 8:50 KEY EVENT Utilitywise cuts nearly 60 roles as company works to bounce back from troubles\nTyneside’s Utilitywise is axing nearly 60 roles across two of its offices as the company continues changes to the way it operates.\nA total of 58 roles have been affected by the restructure, with 20 jobs in the North East and 38 in Redditch put at risk. The cuts have been made to the firm’s outbound sales team, but the company said it would look to move some of those impacted by the changes to other in-house roles.\nA spokesperson for Utilitywise said:\nIn response to a changing landscape in the market place, our current operating model needs to evolve. Following a strategic assessment of our customer requirements, roles in our outbound sales team are now under review.\nAs a business we have sought to minimise redundancies as far as possible and are working hard to find alternative employment for colleagues affected by this decision elsewhere within the organisation.\nThis has been a difficult decision to take, but we know that this move is in the long-term interests for Utilitywise.\nIn the company’s most recent trading update, Utilitywise said it had launched a new inbound channel as part of its “strategy for growth”. Utilitywise in Cobalt Business Park (Image: newcastle chronicle) 8:45 Jonathon Manning WH Smaith restructures high street arm amid retail gloom\nRetailer WH Smith has launched an overhaul of its under-pressure high street business as it revealed sliding sales and profits at the division.The group said it has kicked off a detailed review of the high street business which will see it close six stores and wind down trials such as its 20-strong Cardmarket chain and franchised convenience store arm WH Smith Local.WH Smith - which has 839 travel outlets and 610 high street stores in the UK - said the move was designed to “better structure the business for the future”.It will also see a restructure of some operational activities and a renewed focus on core ranges.One-off costs of the review sent group pre-tax profits down 4% to £134m for the year to August 31.But with these costs stripped out, underlying pre-tax profits rose 4% to £145m.WH Smith saw trading profits in its high street stores fall 3% to £60m, but this was offset by a 7% rise in profits at its travel arm to £103m.The group said high street like-for-like sales dropped 3%, although it said the “slime” craze helped drive an “encouraging” performance in the final six months.Sales rose 3% across its outlets based in airports and train stations.Stephen Clarke, group chief executive of WH Smith, said:\nWe had a good year in high street despite the well-documented challenges of the UK high street.\nDuring an encouraging second half, the business traded well and we quickly identified the latest trend in the market, becoming a one-stop-shop for all slime-related products.\nDespite this good performance, we are not ignoring the broader challenges on the UK high street and, during the second half, we conducted a business review to ensure our high street business is fit for purpose now and for the future. WH Smith (Image: PA)", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/15265568;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-10-11T10:00:00.000+03:00", "crawled": "2018-10-11T20:25:36.019+03:00", "highlightTitle": ""}