{"organizations": [], "uuid": "c7164014ccafbcf14d2eec67a281765b16cc0630", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15330695.ece/ALTERNATES/s1200/0_Conservative-Party-Conference-in-Manchester.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/britain-enough-experts-unless-tell-15330707", "country": "GB", "domain_rank": 21960, "title": "Britain has had enough of experts - unless they tell you what you want to hear", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-25T18:00:00.000+03:00", "replies_count": 0, "uuid": "c7164014ccafbcf14d2eec67a281765b16cc0630"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-news/britain-enough-experts-unless-tell-15330707", "ord_in_thread": 0, "title": "Britain has had enough of experts - unless they tell you what you want to hear", "locations": [], "entities": {"persons": [{"name": "iain duncan smith", "sentiment": "negative"}, {"name": "iain duncan", "sentiment": "none"}, {"name": "mike ashley", "sentiment": "none"}, {"name": "smith", "sentiment": "none"}, {"name": "lea", "sentiment": "none"}, {"name": "ruth lea", "sentiment": "none"}, {"name": "duncan smith", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}], "organizations": [{"name": "manchester", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Iain Duncan Smith speaks at the 2015 Conservative Party Conference, Manchester (Image: Daily Mirror) Get business updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nWhen you find yourself typing the words “excellent article from Iain Duncan Smith”, surely that act in itself should be enough to give you pause for thought.\nApparently not. We now live in a world where hailing the genius of Iain Duncan Smith - Iain Duncan bleedin’ Smith - is something a person might do. I know - what a time to be alive etc etc.\nThose unlikely words were typed by Ruth Lea, an economist and writer who is (and the more perceptive of you can probably see this next bit coming) fervently pro-Brexit. Read More Store closures, job losses and Mike Ashley: where will the crisis on the High Street leave us?\nIn the article that so enraptured Ms Lea, Mr Duncan Smith argues that we shouldn’t listen to the automotive industry’s warnings on a no-deal Brexit - the whole job-loss, economic peril gubbins - because “ employment in the industry constitutes some 0.57% of total UK employment”.\nThe article is well worth reading, if only to reveal that Universal Credit was only Part One of IDS’ plan to kick all hell out of the North East economy. You might disagree with it - if perhaps, you have any knowledge at all of this region - but it’s good to know where people like Mr Duncan Smith are coming from.\nBut I come here not to discuss Mr Duncan Smith’s idiocy, or even the downsides of Brexit.\nInstead I find myself pondering just how we have got to this point, where so many apparently intelligent people actively seek out what they already believe to make themselves feel better about their unexamined views.\nWhy does Ruth Lea think Iain Duncan Smith knows what he’s talking about on the automotive industry rather than, say, everyone who works in it? Because he’s telling her what she wants to hear. Britain has had enough of experts, unless you can find an expert who can confirm your most halfwitted prejudice. Read More Eldon Garden closure threat lifted - but centre could be redeveloped\nThis attitude is not confined to Brexiteers by any means; people on my the side of that particular debate are equally guilty of seeking the facts that bolster their own beliefs and ignoring the many shortcomings of the EU .\nBut anyone who has worked in a business, or indeed any organisation, will know the importance of things like compromise, reasoned debate and listening in good faith if you want to achieve is to get to a good decision.\nWe are a country that is divided fairly equally between Remain and Leave, where - as Theresa May is finding out - any sort of middle way is pretty much impossible.\nMore than ever, we need to be able to see the other side, examine our own beliefs and put them to the test.\nBut more than ever, such actions are nowhere to be seen.\nGraeme Whitfield is business editor of The Journal Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-10-25T18:00:00.000+03:00", "crawled": "2018-10-27T03:31:29.005+03:00", "highlightTitle": ""}