{"organizations": [], "uuid": "8254c9fa328ad42506e8b87f7540b9924225f0b8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1799154.ece/ALTERNATES/s1200/0_Untitled-1.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/news-opinion/no-aspect-local-life-exeter-2095127", "country": "GB", "title": "No aspect of our local life in Exeter is immune from the impact of Brexit", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-10T17:47:00.000+03:00", "replies_count": 0, "uuid": "8254c9fa328ad42506e8b87f7540b9924225f0b8"}, "author": "Ben Bradshaw", "url": "https://www.devonlive.com/news/news-opinion/no-aspect-local-life-exeter-2095127", "ord_in_thread": 0, "title": "No aspect of our local life in Exeter is immune from the impact of Brexit", "locations": [], "entities": {"persons": [{"name": "brexit ben bradshaw", "sentiment": "none"}, {"name": "andrew", "sentiment": "none"}, {"name": "ben bradshaw", "sentiment": "none"}, {"name": "ben bradshaw", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "andrew scutcher", "sentiment": "none"}], "locations": [{"name": "exeter", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "brexit news", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News opinion No aspect of our local life in Exeter is immune from the impact of Brexit Ben Bradshaw MP says he makes no apology for fighting to avoiding the additional damage of a hard or no-deal Brexit Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nBEN BRADSHAW IS THE LABOUR MP FOR EXETER AND HAS BEEN SINCE 2010\nI was taken to task by a correspondent on the Express and Echo letters pages a couple of weeks’ ago for focussing too much in my recent columns on national issues, especially Brexit.\nAndrew Scutcher said I should stop worrying about Brexit, as it was above my “pay grade” and I should concentrate on local issues like potholes.\nI can understand why a Brexit supporter like Andrew might feel this way, but his advice is based on two fundamental miss-understandings – both about Brexit and the role of a Member of Parliament. Read More\nFirstly, there is no aspect of our local life in Exeter that is immune from the impact of Brexit. Ben Bradshaw MP\nThere is already less money for local councils to repair potholes, build council houses and for any of the other services Andrew and I would like to see, because of the impact of Brexit.\nThe Governor of the Bank of England, Mark Carney, told Parliament recently that the average UK household is already £900 a year worse off since the Referendum because of slower growth and higher living costs.\nAs the Government’s own impact studies show – this situation will get a great deal worse in the event of a hard or no-deal Brexit. In that scenario, the cuts that have now been going on for eight years, disproportionately affecting low income families, will go on for many years to come. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now\nSo, it is absolutely my duty, as Exeter’s representative in Parliament to do all I can to try to minimise this danger or avoid it altogether.\nThis brings me to Andrew’s second misconception – on the role of an MP. Read More Antisemitism and islamophobia rows show the current sorry state of British politics\nAn MP’s primary responsibility is to fight for the interests of their constituency. My job is to make sure Exeter gets a fair deal when it comes to Government spending decisions. To oppose national policies that are detrimental to our city and support those that are beneficial. It is to be an ambassador for Exeter and the Westcountry in Parliament and an ambassador for my Party locally and regionally.\nAn MP’s job is not to try to interfere in or second guess the day-to-day decisions of local councils or other local bodies. That is what local councillors are for, and they are accountable, in Exeter, on an annual basis, to the electorate for those decisions. Exeter MP Ben Bradshaw\nOf course, as an MP, I also pick up a lot of individual constituents’ problems and local issues through my surgeries, door to door canvassing sessions and correspondence. Yes, lots on potholes, housing, congestion, antisocial behaviour – and these are all issues I have written about in previous DevonLive.com columns. Read More We are running out of time to solve Britain’s self-inflicted Brexit crisis\nBut if you talk to any of the people in Exeter responsible for dealing with these – be they the local council or the police – their main challenge is resources.\nSo, ending the national austerity policies of the last eight years and avoiding the additional damage of a hard or no-deal Brexit are essential if we’re to address the problems Andrew raises.\nThat’s why I make no apology for fighting on those fronts. Like us on Facebook ", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-10-10T17:47:00.000+03:00", "crawled": "2018-10-10T18:04:56.000+03:00", "highlightTitle": ""}