{"organizations": [], "uuid": "4c720a1915f1f6758db9adaa0d173bac13cd64ff", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article12228867.ece/ALTERNATES/s1200/0_JS105854818.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15255874", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast RECAP: 11,500 jobs up for grabs at Sainsbury's and Argos prepares for Christmas", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-09T10:00:00.000+03:00", "replies_count": 0, "uuid": "4c720a1915f1f6758db9adaa0d173bac13cd64ff"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15255874", "ord_in_thread": 0, "title": "Business Breakfast RECAP: 11,500 jobs up for grabs at Sainsbury's and Argos prepares for Christmas", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning Retail sales slump ahead of crucial Christmas trading period\nBritain’s retailers posted their weakest sales figures in five months in September as consumer confidence took a knock.\nFigures from the British Retail Consortium-KPMG sales monitor showed that retail sales fell by 0.2% on a like-for-like bases, compared with the same month in 2017.\nThis compares with a 0.2% increase in August.\nGrowth in grocery spending “retreated” in September, the BRC said, while non-food sales were hammered as “back-to-school” sales failed to deliver.\nJon Woolven, of IGD, said:\nShopper confidence has followed a downward path with those expecting to be financially better off over the year ahead dipping from 26% in July to 22% in September.\nBrexit-related uncertainty probably plays a part in this, so retailers will be hoping for a clear resolution ahead of the Christmas shopping season. Northumberland Street, Newcastle (Image: Newcastle Chronicle) 9:05 Jonathon Manning Durham's Hargreaves sells renewable energy business Brockwell in deal worth up to £23m\nDurham’s Hargreaves Services has announced it has sold its renewable energy company in a deal worth up to £23m.\nThe diversified company, which has been steadily moving away from its traditional ventures of mining and distributing coal to power stations, launched Brockwell Energy in June 2017 to focus on the development of onshore wind farms, energy from waste facilities and flexible gas generation projects.\nSince the summer, however, Hargreaves said it had been looking to sell the business and it has been in exclusive talks with one company which has ambitious plans to build wind farms and waste-to-energy plants.\nNow Hargreaves has confirmed that it has signed a conditional agreement for the sale of the entire share capital of Brockwell Energy Limited to Lantern Bidco Limited, a newly incorporated company based in London backed by international investors experienced in UK energy infrastructure.\nThe initial gross proceeds are estimated to be £21m, including the reimbursement of certain costs to be incurred by Brockwell prior to completion. A further £2m in cash may become payable upon the successful financial close of a future development project.\nCompletion will take place no later than October 19.\nBrockwell has not recorded any income to date and was reported as a discontinued business in the audited results of Hargreaves for the year ended May 31, recording a loss before and after tax of £1m. The net assets of Brockwell are estimated to be £10m.\nAfter deduction of transaction fees and other non-recoverable costs, the Hargreaves board estimates that it will record a profit on disposal of Brockwell of approximately £4m excluding the contingent consideration.\nThe board intends to use the cash received to reduce bank borrowings. Hargreaves Services has diversified in recent years and is now spinning out its renewable energy business Blackwell, which worked on this project at Clyde wind farm (Image: Hargreaves Services) 8:57 KEY EVENT Chancellor hails economic power of Peppa Pig\nPeppa Pig has been praised by the Chancellor of the Exchequer for helping to boost the UK screen industry.\nThe cartoon has been named alongside blockbuster film Dunkirk and the Game of Thrones series by Philip Hammond as being key to boosting tax revenues from the film industry by more than £2bn. It was generated by more than £600m in Government-backed tax relieve in 2016.\nThe tax relief proved controversial in the past as it has been used by some wealthy individuals to reduce their tax bill.\nBut the British Film Institute (BFI) has found that spending in the industry has doubled from £850.9m in 2007m when the tax relief started, to £1.72bn.\nMr Hammond said:\nFrom TV shows like The Crown, to films like Darkest Hour, and animations like Peppa Pig, our creative industries are intrinsic to the rich cultural fabric of the UK.\nBut they’re also an important part of a dynamic and diversified economy, and a key component of our great, global trading nation. That is why this government is committed to supporting our highly skilled and innovative creative industries through creative sector tax reliefs.\nI am confident that the creative industries will continue to grow, provide strong employment and be the face of British culture to the world in future years. Peppa Pig (Image: PA) Jonathon Manning French Connection - 27% owned by Mike Ashley - announces it is looking for a buyer\nShares in struggling fashion chain French Connection have risen 25% to 55p after it revealed it could be looking for a buyer.\nFollowing speculation over the weekend, the retailer announced on the London Stock Exchange that it was “reviewing all strategic options” including the potential sale of the firm.\nHowever, it added there is no certainty an offer will be made for the company.\nFounder Stephen Marks owns 40% of the business, 27% is owned by Newcastle United owner Mike Ashley and William Adderley, founder of the Dunelm Group, also has a stake.\nWhether Mr Ashley is interested in taking control of another struggling business so soon after acquiring House of Fraser is not clear, but he has been especially busy over the last year building up his already sizeable retail empire.\nMr Ashley’s Sports Direct firm is among a number of bidders for American Golf, whose owners are looking to sell what is the country’s largest specialist golf retailer, and the firm is also believed to be in the running to buy Evans Cycles, which is seeking investment following two years of heavy losses.\nIf he was to make an offer for French Connection it would join clothing chain Flannels – set to open its newest store in Newcastle in the New Year – lingerie firm Agent Provocateur the House of Fraser department stores. Sports Direct also has shares in Debenhams, Game and a number of American sports retailers.\nTaking on French Connection could prove to be a tempting challenge for Mr Ashley as the firm has made a loss for each of the five most recent years, also sells homewares and perfumes. Mike Ashley (Image: DAILY RECORD) 8:42 KEY EVENT Aviva boss Mark Wilson steps down after five years\nMark Wilson has revealed he will stand down form his role at the helm of Aviva after leading the group for five years.the shock move will see Mr Wilson will leave his executive role immediately, the FTSE 100 insurer said on Tuesday, but remain with the group until April 2019 while a successor is appointed.Chairman Sir Adrian Montague will assume executive responsibilities while Aviva launches the hunt for a new CEO.He will chair a committee of three executive directors: UK insurance chief executive Andy Briggs, chief financial officer Thomas Stoddard, and international insurance chief executive Maurice Tulloch.The move follows Mr Wilson’s decision in March to join the board of rival asset manager BlackRock, which angered some shareholders.Aviva said it was time for “new leadership” after five years under Mr Wilson in which he led a turnaround which the company said was now complete.\nSir Adrian said:\nHe leaves the group in a far stronger state than when he joined. Aviva is now financially strong and delivering solid earnings growth.\nThere is much further to go in accelerating our strategic development and enhancing shareholder value. We have agreed with Mark this is the right time for a new leader to ensure Aviva delivers to its full potential.\nAviva will commence the search for a successor immediately. The process is expected to take four months.Mr Wilson said:", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/", "https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/15255874;"], "published": "2018-10-09T10:00:00.000+03:00", "crawled": "2018-10-10T01:08:09.092+03:00", "highlightTitle": ""}