{"organizations": [], "uuid": "2acaa52a9392b49fc938ed328cd3c8f4e7116ec0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15353752.ece/ALTERNATES/s1200/0_Untitled-design-38.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/brexit-referendum-passport-caroline-nokes-15353790", "country": "GB", "domain_rank": 21960, "title": "Stark airport queues warning for British tourists going on holiday AFTER Brexit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-31T16:39:00.000+02:00", "replies_count": 0, "uuid": "2acaa52a9392b49fc938ed328cd3c8f4e7116ec0"}, "author": "nechronicle", "url": "https://www.chroniclelive.co.uk/news/north-east-news/brexit-referendum-passport-caroline-nokes-15353790", "ord_in_thread": 0, "title": "Stark airport queues warning for British tourists going on holiday AFTER Brexit", "locations": [], "entities": {"persons": [{"name": "caroline nokes", "sentiment": "none"}, {"name": "nokes", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "commons home affairs committee", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Stark airport queues warning for British tourists going on holiday AFTER Brexit Holidaymakers could end up in the 'rest of the world' airport queues, Immigration minister Caroline Nokes has warned Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nBritish tourists could face delays at European airports after Brexit , the Immigration Minister has admitted.\nCaroline Nokes warned the prospect of UK travellers ending up in \"rest of the world\" queues is \"not unrealistic\".\nIn a wide-ranging session with the Commons Home Affairs Committee, she also acknowledged that in some cases it could be \"almost impossible\" for businesses to differentiate between EU migrants who have lived in the UK for years and those who arrive after Brexit.\nMs Nokes told MPs the priorities in the event of a no-deal scenario are security, the flow of goods and people, and revenue processes.\n\"Of course it's feasible that there could be delays for people travelling through EU airports. Immigration Minister Caroline Nokes uses the new ePassport gates at Newcastle Airport (Image: ncjMedia)\n\"The prospect of them ending up in rest of the world queues at some major airports across the continent is not unrealistic.\"\nMs Nokes also acknowledged employers may struggle to establish whether a prospective EU worker is a long-term resident if they have not yet obtained the status that confirms their right to live and work in the UK. Read More Budget 2018: Money Saving Expert Martin Lewis' five things you should have spotted\nShe said the issue presents a \"conundrum\" but denied the future system is \"unworkable\".\nUnder the Government's proposed settlement scheme, EU migrants who have been in the UK for five years by the end of 2020 can apply for \"settled status\", meaning they are free to go on living and working in the UK indefinitely. Read More Want to go on holiday to Spain or other EU countries? You could soon be forced to pay for a visa\nThose who have arrived by December 31 2020 but do not have five years' residence can seek to stay until they have, at which point they can seek settled status.\nEU citizens who arrive in the implementation period, which starts after the official exit date in March, will face no new curbs on living and working in the UK but will be required to register if they intend to stay for longer than three months. Read More", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-10-31T16:39:00.000+02:00", "crawled": "2018-10-31T17:03:42.012+02:00", "highlightTitle": ""}