{"organizations": [], "uuid": "20cd10d69040ec75f28494ef1a1e2ded0c039a7f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article1028380.ece/ALTERNATES/s1200/30589595JPG.jpg", "site_section": "http://www.westernmorningnews.co.uk/editorschoices.rss", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/devon-news/mps-grill-babcock-boss-over-2117339", "country": "GB", "title": "MPs grill Babcock boss over future of Devon shipyard", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-17T11:27:00.000+03:00", "replies_count": 0, "uuid": "20cd10d69040ec75f28494ef1a1e2ded0c039a7f"}, "author": "Joel Cooper", "url": "https://www.devonlive.com/news/devon-news/mps-grill-babcock-boss-over-2117339", "ord_in_thread": 0, "title": "MPs grill Babcock boss over future of Devon shipyard", "locations": [], "entities": {"persons": [{"name": "archie bethel", "sentiment": "none"}, {"name": "babcock", "sentiment": "none"}, {"name": "geoffrey cox qc", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "mike southon", "sentiment": "none"}, {"name": "ju", "sentiment": "none"}, {"name": "peter heaton-jones", "sentiment": "none"}], "locations": [{"name": "devon", "sentiment": "none"}, {"name": "north devon", "sentiment": "none"}, {"name": "torridge", "sentiment": "none"}, {"name": "appledore shipyard", "sentiment": "none"}, {"name": "west devon", "sentiment": "none"}, {"name": "north devon earlier", "sentiment": "none"}], "organizations": [{"name": "babcock international", "sentiment": "none"}, {"name": "group", "sentiment": "none"}, {"name": "appledore shipyard", "sentiment": "none"}, {"name": "babcock international ceo", "sentiment": "none"}, {"name": "royal navy", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MPs grill Babcock boss over future of Devon shipyard They met with CEO Archie Bethel on Monday Share Appledore Shipyard (Image: Mike Southon) Get Daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nTwo of Devon MPs have met with the chief executive of Babcock International to discuss the future of a shipyard which many believe is \"on the edge\".\nGeoffrey Cox QC, MP for Torridge & West Devon, and Peter Heaton-Jones, MP for North Devon, held a joint meeting with Babcock International CEO, Archie Bethel, on Monday, October 15.\nThe MPs sought assurances from the Group’s CEO over the future of Appledore Shipyard after recent speculation about the security of jobs. Babcock's Appledore shipyard on the Torridge estuary in North Devon\nEarlier this month we reported that the Unite union, which represents defence workers, said the government’s \"continual lack of commitment\" to building ships for the Royal Navy threatens to \"shipwreck\" the future of Appledore shipyard.\nThe union believe the shipyard's future is vulnerable following the loss of a major contract to an Italian shipyard and apparent delays in contracts for Type 31 military frigates.\nIn July we reported that Unite had criticised the government’s decision to pause the bidding for type 31e Frigates. Read More Fears Babcock's Appledore Shipyard could close after it loses major contract\nThe GMB union says the government's announcement has \"ramped up the uncertainty\" about jobs at Appledore shipyard in North Devon and says it is a \"further blow to British shipbuilding\".\nMPs Cox and Heaton-Jones met with the CEO of Babcock, who own the shipyard, earlier this week to seek assurances about the security of local jobs.\nDuring the discussion the MPs emphasised the importance of the yard, not only for its highly skilled workforce, but also the neighbouring communities and the local economy. Geoffrey Cox, Torridge and West Devon MP\nFollowing the meeting Geoffrey Cox QC, who is also the Government’s Attorney General, said: “We had a productive meeting with the CEO who has given us his commitment that the Babcock Group is doing all it can to ensure the workforce at Appledore remains engaged and employed. We welcome this commitment to the yard and to its people.\n“Peter Heaton-Jones and I have held regular meetings with the Secretary of State for Defence about this vital issue and will continue to press Babcock to ensure that Appledore continues to function as a working shipyard.” Read More Thousands join campaign to save jobs at Babcock shipyard in Appledore\nSpeaking earlier this month, Unite assistant general secretary Steve Turner said: “The loss of the contract to Italian yard Fincantieri has exposed the vulnerability of the Appledore site, while government delays to the Type 31e frigates and an obsession with off-shoring the construction of three fleet support ships for our naval carrier fleet is threatening jobs across the UK. “Our future capability to build for the Royal Navy in UK shipyards hangs by a thread, so it is imperative that the government makes support for these yards a keystone of any post-Brexit industrial strategy.\n“Defence secretary Gavin Williamson and business secretary Greg Clark must now wake up and smell the coffee. They must act now to defend UK yards and what’s left of any defence and wider industrial strategy. “Otherwise, the future of these yards and all those who work at them, alongside thousands more jobs in the UK-wide supply chain, could be shipwrecked.\n“Block building of this work could sustain both the Appledore and Belfast communities, supporting decent skilled jobs, apprenticeships for our youth and the families reliant upon them. Instead, government seems willing to allow our shipyards to fall silent and skilled jobs go to wall. Read More All new Type 26 frigates will be homed in Devonport\n“The government needs to back UK Plc, our shipbuilders, steel plants and component suppliers and commit now to the UK design, engineering and build of the navy’s solid support ships in UK shipyards with 140,000 tonnes of British steel. “A failure to do so, alongside the continuing dithering over Type 31e frigates, will be a gross betrayal to UK ship workers, loyal communities and regional economies, while putting at risk manufacturing skills vital to the industry.”\nA petition to save a much-loved Devon shipyard and hundreds of jobs has been signed by thousands of people.\nThe campaign to save Appledore Shipyard from closure was mounted by the GMB and Unite unions, following the news that owners Babcock had been unsuccessful in winning a key order.\nSo far more than 3,600 people have signed the online petition . Like us on Facebook ", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}", "https://www.change.org/p/save-appledore-shipyard"], "published": "2018-10-17T11:27:00.000+03:00", "crawled": "2018-10-17T11:46:31.001+03:00", "highlightTitle": ""}