{"organizations": [], "uuid": "bfba61256294e7e0bfb8f4151b399c995e9ef726", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15222608.ece/ALTERNATES/s1200/0_CFR_NJL_150318honcho_01.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/reverse-auction-app-honcho-secures-15222129", "country": "GB", "domain_rank": 21960, "title": "Reverse auction app honcho secures £50,000 as company gears up for launch", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-01T16:22:00.000+03:00", "replies_count": 0, "uuid": "bfba61256294e7e0bfb8f4151b399c995e9ef726"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/reverse-auction-app-honcho-secures-15222129", "ord_in_thread": 0, "title": "Reverse auction app honcho secures £50,000 as company gears up for launch", "locations": [], "entities": {"persons": [{"name": "michael vassallo", "sentiment": "none"}, {"name": "gavin sewell", "sentiment": "none"}, {"name": "carl marshall", "sentiment": "none"}, {"name": "sarah slaven", "sentiment": "none"}, {"name": "alex marsh", "sentiment": "none"}], "locations": [{"name": "durham", "sentiment": "none"}], "organizations": [{"name": "business durham", "sentiment": "none"}, {"name": "barclays northern powerhouse fund", "sentiment": "none"}, {"name": "durham county council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Reverse auction app honcho secures £50,000 as company gears up for launch Honcho's reverse auction platform will see car insurers bid to win customers Share Left to right: Carl Marshall of Durham County Council, Sarah Slaven of Business Durham, Gavin Sewell of honcho, Michael Vassallo and Alex Marsh of Maven Capital Part (Image: honcho) Get business updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nA new mobile app hoping to revolutionise the car insurance market has secured £50,000 towards its launch.\nDurham’s Honcho is attempting to disrupt the insurance market by providing an alternative to price comparison websites.\nThe firm will instead launch a reverse auction site, where car insurers will bid against each other for consumers’ business. The method could lead to lower premiums for drivers.\nHoncho has secured a £50,000 debenture facility from the Barclays Northern Powerhouse Fund to help get the business off the ground. The firm is set to launch early next year.\nGavin Sewell, chief executive of honcho, said: “We’re delighted to benefit from the Barclays Northern Powerhouse Growth Fund. Barclays have always been very supportive of honcho and we’re thrilled that they’re now offering us additional support through their initiative to help SMEs in the North East .” Read More Newcastle University outlines vision to become world leader\nMichael Watson, business manager at Barclays said: “As a team we were incredibly impressed with honcho’s business plan. For a company, the size of honcho we were overwhelmed with not only the exceptional progress that the Durham-based company had already made in such a short amount of time and it was for this reason that we felt, the financial disruptor fit our criteria of a start-up business with high growth potential.\n“At Barclays we are delighted to help small businesses grow and expand. This is especially vital as we, as a nation, are entering a new phase of Brexit.\n“As we prepare for this, it has never been more important for businesses and Government individuals to come together and provide schemes, like The Northern Powerhouse Fund, in order to nurture regional entrepreneurship.” The honcho app aims to revolutionise the car insurance market (Image: honcho)\nHoncho was founded by Mr Sewell, who lives in Northumberland and Frank Speight, the firm’s commercial director. The business will initially offer a reverse auction service for the car insurance industry but plans to expand into other financial service sectors, such as home and contents, pet, and travel insurance.\nEarlier this year the company secured £830,000 of investment on crowdfunding site Crowdcube.\nIt has since boosted its senior team after appointing Tom Spence, Barclays former head of digital adoption, as its new chief product officer, and Utilitywise’s Graeme Stoker as chief digital officer. Chad Crossman was also appointed chief technology officer, after joining form yourmovelabs.com. Read More Theresa May pledges to stop restaurants taking money away from front of house staff's tips\nGlobal marketing firm Social Chain has also been brought in to carry out social media marketing for honcho.\nCommenting on the appointments Mr Speight said: “The launch team and agency appointments are now complete, and we’re delighted with the outstanding level of talent we have on board, including our CTO, Chad Crossman.\n“We’re a disruptive business by nature and between Social Chain, Graeme and Tom, the appointments we have made reflect this.\n“We’re passionate about offering people a real alternative to price comparison websites and putting customers back at the centre of the proposition, and we are confident that the team we have assembled and the partners we now have in place will help us achieve that objective.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-10-01T16:22:00.000+03:00", "crawled": "2018-10-01T17:21:21.000+03:00", "highlightTitle": ""}