{"organizations": [], "uuid": "3de7d40919cfb8dd23e996adf50b450f7b7e220d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15222054.ece/ALTERNATES/s1200/0_BELGIUM_Brexit_140220.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/dominic-raab-brexit-date-news-15354330", "country": "GB", "domain_rank": 21960, "title": "Dominic Raab: Brexit deal date revealed by Brexit Secretary - only for his department to say there was 'no date set'", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-31T21:18:00.000+02:00", "replies_count": 0, "uuid": "3de7d40919cfb8dd23e996adf50b450f7b7e220d"}, "author": "Daniel Milligan", "url": "https://www.chroniclelive.co.uk/news/north-east-news/dominic-raab-brexit-date-news-15354330", "ord_in_thread": 0, "title": "Dominic Raab: Brexit deal date revealed by Brexit Secretary - only for his department to say there was 'no date set'", "locations": [], "entities": {"persons": [{"name": "dominic raab", "sentiment": "negative"}, {"name": "raab", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "michel barnier", "sentiment": "none"}], "locations": [{"name": "brussels", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}], "organizations": [{"name": "european union", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "state", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Farming industry\nThe Department for Exiting the European Union later clarified \"there is no set date for the negotiations to conclude\" and November 21 \"was the date offered by the chair of the select committee for the Secretary of State to give evidence\".\nThe letter, released by the committee on Wednesday, was dated October 24 and therefore does not reflect any breakthrough in the past few days.\nNegotiations are deadlocked on the question of a \"backstop\" arrangement to guarantee that there will be no hard border in Ireland.\nPrime Minister Theresa May insists she will not accept an EU proposal which would establish a customs border between Northern Ireland and the British mainland, while Brussels is resisting her plan to keep the whole UK temporarily in a customs union. Britain's Secretary of State for Exiting the European Union Dominic Raab, left, and EU chief Brexit negotiator Michel Barnier (Image: AP)\nMr Raab wrote: \"Despite our differences, we are not far from an agreement on this issue. We agree on the principle of a UK-wide customs backstop. An agreement on the details of that backstop should be possible.\n\"Both sides agree that this backstop cannot provide for a permanent UK/EU relationship and are committed to a future relationship that works for the whole of the UK, including Northern Ireland.\n\"We are open to talking about ways to achieve this and committed to continuing discussions in order to reach an agreement.\n\"The end is now firmly in sight and, while obstacles remain, it cannot be beyond us to navigate them. We have resolved most of the issues and we are building up together what the future relationship should look like and making real progress. Read More Brexit 50p coin will be released on the day Britain leaves the European Union\n\"We now need to acknowledge the progress that has been made and now work rapidly through the remaining issues and come to an agreement that works for both sides.\"\nMr Raab had been due to give evidence to the committee on October 24, but pulled out shortly before the crunch October 17-18 European Council summit, with his office saying that he was committed to appear only once a deal was finalised. Read More", "external_links": [], "published": "2018-10-31T21:18:00.000+02:00", "crawled": "2018-10-31T23:44:14.000+02:00", "highlightTitle": ""}