{"organizations": [], "uuid": "653580b7eb71576b9c8b0bb611cb2adbd4ae06f9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article2072634.ece/ALTERNATES/s1200/1_r.png", "site_section": "http://www.devonlive.com/rss.xml", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/devon-news/police-searches-continue-missing-44-2072666", "country": "US", "title": "Police searches continue for missing 44-year-old woman", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-04T10:55:00.000+03:00", "replies_count": 0, "uuid": "653580b7eb71576b9c8b0bb611cb2adbd4ae06f9"}, "author": "Jamie Hawkins", "url": "https://www.devonlive.com/news/devon-news/police-searches-continue-missing-44-2072666", "ord_in_thread": 0, "title": "Police searches continue for missing 44-year-old woman", "locations": [], "entities": {"persons": [{"name": "emma adderley", "sentiment": "none"}, {"name": "emma adderley anyone", "sentiment": "none"}, {"name": "emma", "sentiment": "none"}], "locations": [{"name": "torrington", "sentiment": "none"}, {"name": "barnstaple", "sentiment": "none"}, {"name": "bideford", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nSearches are continuing for a 44-year-old woman who has gone missing.\nPolice are concerned for the welfare of Emma Adderley, who is reported missing from Torrington, and are now appealing for help from the public.\nEmma also has links to Bideford and Barnstaple, and is described as white, 5ft 4ins tall with very long dark brown hair usually worn in a ponytail.\nUPDATE: Police confirm she has been located safely Emma Adderley\nAnyone who sees her is asked to call 999 immediately quoting log 221 of Wednesday, October 3.\nHow does a missing person investigation work? Video Loading Click to play Tap to play The video will start in 8 Cancel Play now What to do if someone goes missing?\nIt is a traumatic experience when a person goes missing. Read More\nFortunately, most people return or are found within 48 hours. However, sometimes this is not the case. When should I report a person missing?\nYou should report a missing person to the police if: The person is a child The person is a vulnerable adult The person has been detained (sectioned) under the Mental Health Act or are legally in the care of another person You are concerned for the person’s safety What you should do\nThe police ask parents and carers, including staff acting in a parenting role in care homes, to undertake reasonable actions to try and establish the whereabouts of the individual.\nThis could include, but is not limited to; Attempts to contact the child or adult. Calling friends or family. Visiting areas that the child or adult is known to frequent. Visiting the place where the child or adult was known to be attending (i.e. a friend's house or party). Checking to see if any items are missing from the home. Checking social media. Native hornets being persecuted amid fear of Asian invader\nExperience has shown that these initial enquiries yield additional information that helps narrow down any police search. In several cases it has resulted in the early return of the missing person and in some cases it has resulted in there being no additional police involvement as the missing person is located before a full missing person search begins. How do I report a person missing?\nYou can report a person missing in the following ways: Call 999, if the missing person is a vulnerable adult or a child, or you believe them to be in danger, or Call 101 Go to your local police station What happens when I report a person missing to the police?\nWe will ask you to provide as many details as possible to enable us to find the missing person quickly. This could include: Personal details: Name, date of birth Appearance including any distinguishing marks Contact details such as mobile phone number Medical conditions and whether or not these require medication Circumstances under which they went missing Details of friends and relatives Details of places they often visit\nWe will use this information to determine the level of risk the missing person is at and what the police response should be. Read More Holidaymakers need to renew passports NOW in case of no deal Brexit\nThe information you give us will also be put onto the Police National Computer and circulated to all police forces. Initial inquiries will be made to try to find the missing person.\nIf they are not found the investigation is passed to a nominated officer who will deal with all further enquiries. Like us on Facebook ", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-10-04T10:55:00.000+03:00", "crawled": "2018-10-04T16:09:34.005+03:00", "highlightTitle": ""}