{"organizations": [], "uuid": "8bc088e001bdc794fccb3cdac78167f7474d1424", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article269557.ece/ALTERNATES/s1200/Primark.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/business/what-makes-primark-good-what-2066268", "country": "GB", "title": "What makes Primark so good at what they do?", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-09T13:23:00.000+03:00", "replies_count": 0, "uuid": "8bc088e001bdc794fccb3cdac78167f7474d1424"}, "author": "Hannah Finch", "url": "https://www.devonlive.com/news/business/what-makes-primark-good-what-2066268", "ord_in_thread": 0, "title": "What makes Primark so good at what they do?", "locations": [], "entities": {"persons": [{"name": "nick turk", "sentiment": "none"}, {"name": "joe hocking", "sentiment": "none"}], "locations": [{"name": "torquay", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "new look", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}], "organizations": [{"name": "primark", "sentiment": "none"}, {"name": "colliers international", "sentiment": "none"}, {"name": "debenhams", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "local data company", "sentiment": "none"}, {"name": "matalan", "sentiment": "none"}, {"name": "house of fraser", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "What makes Primark so good at what they do? It's not online but does that matter? Share Get Daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nPrimark splashes out on some of the priciest sites in Torquay, Exeter, Barnstaple and Plymouth and doesn’t even sell online.\nAnd yet, it is one of the big names on the High Street that is weathering the retail down turn.\nWhile the likes of New Look , Debenhams and House of Fraser are struggling to cope with big rents on massive stores and competition from more nimble online brands, Primark still manages to stay competitive.\nAnd its worth noting that while the brand has 179 stores across the UK, it still has a smaller portfolio than its competitors Peacocks, New Look and Matalan, according to the Local Data Company . Read More\nAnd it’s because it knows its customer, said Nick Turk, director on the retail parks team in the South West at Colliers International. Primark in Drake Circus Shopping Centre (Image: Joe Hocking)\nHe said: Primark – which does not even sell online - provides a vivid example of a modern retail success story. They are very close to their customer base and have a very clear and consistent retail offer.” Five reasons High Streets are struggling\nWe asked Lucinda Coleman, Business Recovery Partner at PKF Francis Clark and an expert in helping struggling retailers to find ways of restructuring their business to ride out the storm, to explain why the High Street has buckled under pressure.\n1. Tight wallets\nConsumer spending has had its weakest start to the year since 2012 seeing consumer spending falling -1.1% year – on- year, declining for the ninth time in ten months; face to face spend down -2.5% year- on- year and recreation and culture spending seeing its greatest decline since April 2010, according to the Visa UK Consumer Spending Index.\nIt is a stark reminder of just how tough it is for consumer-facing businesses.\n2. Rising labour costs and business rates\nRetailers and restaurants are facing a combination of costs such as the National Living Wage, Apprenticeship Levy and business rates, together with reduced consumer spending.\nMany businesses are reluctant to pass on growing costs to their customers in the form of price rises but that eats into profits.\n3. Narrow margins\nSmall and medium sized businesses operate on tighter budgets so they are likely to either lose money or raise prices which could result in a loss of custom. These tight margins and fragile finances show just how big the threat of insolvency will be in this sector.\n4. Cost of ingredients\nAs the value of sterling has fallen, it has pushed up the price of imported goods including the price of food that we import. The UK imports around 50% of its food so many restaurants rely heavily on food and wine imports. With the cost of importing ingredients now higher and the increase in the cost of labour, due to the national minimum wage rises the sector is facing the perfect storm.\n5. Competition\nThe restaurant sector is fiercely competitive with so much choice available. The rapid shift towards online shopping and meal delivery services has also taken a severe toll.\nNow, when diners do venture out for a meal with their tightened purses the restaurant needs to do something to entice the customer into their establishment.\nPrimark does not sell a thing online but finds its customers through social media and its website which is growing in reach. &mdash; Primark (@Primark) 27 September 2018\nIts Twitter and Instagram accounts have around 6.5million followers and that all helps to get people in store.\nAnd Primark is very good at giving customers what they want, fast turnaround trends at good prices. Just as Sainsbury’s launches its new beauty line, Primark has collaborated with social media influencer and ex-Glamour magazine beauty director Alex Steinherr to launch its new skincare line. Primark is thriving while its rivals struggle (Image: Liverpool Echo)\nThe range, which is cruelty free, vegan friendly and contains no parabens, has the type of packaging you’re more likely to see in the luxury lines and yet the prices range from £3-£5. After two years of research and development, we are super excited to reveal our incredible skincare collaboration with beauty expert @AlexSteinherr Available in selected Primark stores this coming week #AlexSXPrimark pic.twitter.com/LaorUJBlzN &mdash; Primark (@Primark) 1 October 2018\nMr Turk said: “There are retailers that are facing up to the challenges of business rates, e-commerce and Brexit and succeeding. Low debt, experienced management and constant improvement can overcome, and thrive, in these tough conditions”.\nPrimark is owned by Associated British Foods Plc, which also owns brands including Jordans, Kingsmill, Twinings and Ovaltine. Read More 27 insider secrets you may not know about Primark - but you REALLY need to know before your next shop\nIt’s half-year results published in April showed that for Primark in the UK, sales were up 8%, up by 1% for the earliest part of the year with winter items like big puffer jackets and skinny jeans becoming bestsellers.\nAnd although overall, like for like sales were down by 1.5% compared to the previous year, the retailer is faring better than most.\nThe interim report showed that Primark’s adjusted operating profit of £341m was up 6 per cent, compared with the same period last year, with total sales of £3.5billion.\nThe Local Data Company that undertakes retail research said that Primark has succeeded because it knows its customers, maintains a strong website and has a strong social media relationship with its customers.\nThe Local Data Company blog, Primark: What’s the Secret to its Success , reads: “Whilst it can’t be denied that there are many economic, cultural and political challenges in the market, the success of Primark evidences the fact that digital is actually a huge opportunity for the high street in driving footfall to stores and not a threat, as commonly reported. Whilst many ‘traditional’ retailers are struggling to stay afloat in today’s market, it could be that these businesses were not quick enough or did not have the resources to stay relevant to consumers – embracing and adapting to a new world where being at the forefront of technology is no longer a competitive advantage, it’s a necessary factor to enable the sustainability of a retailer. If that is the secret to success, it’s time we start sharing it.” Read More", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}", "https://www.plymouthherald.co.uk/news/business/debenhams-could-merge-house-fraser-1987812", "https://twitter.com/Primark/status/1045372708836511745?ref_src=twsrc%5Etfw", "https://twitter.com/Primark/status/1046787161532649472?ref_src=twsrc%5Etfw", "http://blog.localdatacompany.com/primark-whats-the-secret-to-its-success", "https://t.co/LaorUJBlzN", "https://twitter.com/AlexSteinherr?ref_src=twsrc%5Etfw", "https://www.abf.co.uk/documents/pdfs/2018/2018-interim-results-presentation.pdf", "https://www.pkf-francisclark.co.uk/", "https://twitter.com/hashtag/AlexSXPrimark?src=hash&%3Bref_src=twsrc%5Etfw"], "published": "2018-10-09T13:23:00.000+03:00", "crawled": "2018-10-09T13:35:06.008+03:00", "highlightTitle": ""}