{"organizations": [], "uuid": "82166564f89483a6b5e54b8665e45fd7024093f3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article12796986.ece/ALTERNATES/s1200/1_FILE-Tesco-Posts-Record-Loss.jpg", "site_section": "http://www.thejournal.co.uk/business/?service=rss", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15227088", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast RECAP: Tesco posts 47% leap in UK profits as Booker serves up a boost", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-03T10:05:00.000+03:00", "replies_count": 0, "uuid": "82166564f89483a6b5e54b8665e45fd7024093f3"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15227088", "ord_in_thread": 0, "title": "Business Breakfast RECAP: Tesco posts 47% leap in UK profits as Booker serves up a boost", "locations": [], "entities": {"persons": [{"name": "mike ashley", "sentiment": "negative"}, {"name": "booker", "sentiment": "negative"}], "locations": [{"name": "uk", "sentiment": "none"}], "organizations": [{"name": "house of fraser", "sentiment": "negative"}, {"name": "tesco", "sentiment": "negative"}, {"name": "scs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KEY EVENT ScS in talks with Mike Ashley's House of Fraser amid falling concession sales\nDirectors at Sunderland sofas and carpet giant ScS shrugged off a sales hit to its House of Fraser concessions and endured the hot summer weather to post an 11% rise in annual profits.\nThe Wearside retail giant, which has 101 stores and 27 concessions within House of Fraser stores, posted a £4.3m (1.3%) increase in revenue in the year to £337.3m, with Ebitda creeping up 8.1% to £18.8m and profit before tax rising 10.5% to £13.2m.\nYet the firm said its House of Fraser concessions had a particularly challenging year, with gross sales in the division falling 9.4% to £24.8m in the year to July 28 – a picture that has continued since Mike Ashley’s retail group Sports Direct snapped up the department store chain.\nScS said it is in discussions with Sports Direct over the future of the concessions – while also stressing that it represents a small part of the business – in a bid to halt falling sales.\nThe concessions, which employ 124 staff, were launched as a way to reach customers who prefer to shop in department stores and town centres, to rival the likes of John Lewis. Sales last year represented 7.1% of gross sales.\nFinance director Chris Muir said:\nWhat we try to stress is House of Fraser is not a big proportion of the business – yes, it is part of the part of the business and we would like to continue to work with it but it’s not a significant part of the group.\nWe saw yesterday’s announcement and we are not sure who our main contact is at the moment. We had had contact with their senior team.\nIf you look at House of Fraser in the last year it has gone from CVA to administration to new owners, so they have been up in the air for some time. Yesterday’s announcement is just the latest element of change.\nWhat we do know is that Mike Ashley is a good retailer so if we can can work with them we will. Talks are ongoing, we are still trying to understand what their plans are and if we can play a part in that we will do so. Chris Muir, ScS's chief financial officer (Image: NCJ Media) 8.54 Coreena Ford Owners of Jesmond's Parichat at Sohe splash out £100,000\nGrowing leisure company Cairn Group has spent £100,000 on sprucing up a popular venue in Jesmond .\nThe bar and lounge area at Parichat, part of the firm’s Sohe restaurant specialising in Pan-Asian food, has been transformed following the investment, creating two new jobs while ringing in the changes.\nParichat at Sohe launched last year when the restaurant partnered with award-winning Thailand-born chef Parichat Somsri-Kirby to serve what it describes as a dynamic dining experience of Asian fusion plates.\nNaveen Handa, director at Cairn Group said: “Following the partnership with Parichat which has set the restaurant’s food offering up there with the best Asian cuisine in the region, the natural next step was to add the same spice to the bar. The new look bar area at Parichat at Sohe in Jesmond (Image: William Amann) 8.46 Coreena Ford Shop prices increase for second consecutive month\nShop prices have increased for a second consecutive month after five years of deflation, figures show.\nInflation inched up to 0.2% in September from 0.1% the month before, according to the BRC-Nielsen Shop Price Index.\nPrices of non-food items eased slightly to 0.9% from August’s 1%. However, food prices remained inflationary at 1.9%, the result of unusual weather patterns in the first half of the year.\nBritish Retail Consortium chief executive Helen Dickinson said:\nGlobal commodity conditions, in particular oil prices, would indicate that there are likely to be further inflationary pressures in the short to medium term which could lead to further price rises.\nThis would be worrying enough for hard-pressed British consumers if we weren’t staring down the barrel of a no-deal Brexit. Food prices alone have now been inflationary for more than a year and the BRC estimates that consumers could face up to a 29% increase in prices of products such as beef in the event of a no-deal.\nMike Watkins, head of retailer and business insight at Nielsen, added:\nLooking ahead we expect shoppers to maintain their grocery spend by making savings elsewhere in their overall household expenditure. Northumberland Street in Newcastle (Image: Newcastle Chronicle) 8.40 Coreena Ford Great North Run owner wins work on UEFA Champions League\nThe company behind The Great North Run has posted rising profits after launching two new marathon events and securing work with the UEFA Champions League.\nNova Marketing Limited brought in £20m in turnover for the nine months ending December 31, 2017 – only £2m less than during the 12 months ending March 31, 2017.\nIt also saw a big rise in operating profit, which increased from £64,500 in the previous period to just over £1m.\nThe company is best known for organising the world’s largest half-marathon, The Great North Run, but its figures were boosted after the firm launched two new events – the Stirling Scottish Marathon and the Birmingham International Marathon. Both events attracted strong entry numbers in their inaugural year.\nNova Marketing also found success through its TV production business, which broadcasts footage of major athletic events from across the UK. The accounts reveal that FilmNova has “secured a three-year contract with UEFA to deliver promotional trailers for the Champions League and Europa League”. Runners take part in the 2018 Simply Health Great North Run (Image: PA) 8.32 Coreena Ford Almost half of workers in the UK are 'in the wrong job'\nAlmost half of workers in the UK are in the wrong job based on their skill level, according to new research.\nA survey of 3,700 employees found a third could cope with more demanding duties, while one in eight admitted they lacked the skills to do their job effectively.\nThe Chartered Institute of Personnel and Development (CIPD) said this means 49% of employees in the UK could be in the wrong position.\nIts study also found many graduates are in jobs that do not require degree-level qualifications.\nOnly half of over-skilled workers said they were satisfied with their jobs and one in four earned less than £20,000 a year, the report found.\nLizzie Crowley, skills adviser at the CIPD, said:\nHow skills are used, or not used, in the workplace has important economic and social implications, and is a key factor in tackling the UK’s productivity crisis.\nIndividuals who report using their skills fully in the workplace have higher levels of job satisfaction, earn more and are more resilient to change, while businesses benefit from a more productive workforce and increased profitability.\nHowever, we have ended up in a situation where our economy isn’t creating nearly enough high-skilled jobs, while the proportion of low-skilled roles remains stubbornly high. This leaves many workers trapped in low-skill work, which doesn’t match their ability, offers poorer pay and progression prospects and does little to boost the productivity of organisations. A survey has found 49% of employees in the UK could be in the wrong role (Image: iStockphoto) 8.24 Coreena Ford Tesco shares fall 5% in early trading\nTesco shares fell more than 5% in morning trade and currently sit at 224.3p - down 4.63%\nBruno Monteyne, a retail analyst at Bernstein, said Tesco’s first half figures showed a “strong sales momentum in Booker and UK food retail, but was soft on profitability”. Tesco’s underlying earnings for the group fell 4.6% short of analyst expectations, he added.\nRichard Hunter, head of markets at interactive investor, said:\nThe supermarket behemoth continues, for the most part, to fend off its competition.\nIn particular, the wisdom of its Booker acquisition is becoming ever clearer, whilst the tie-up with Carrefour which kicks in this month should strengthen its position further. However, it is not all plain sailing.\nThe proposed Sainsbury/Asda merger would add another level of competition within the sector, the discounters continue to pile on the pressure and Amazon also casts its own long shadow.\nSales in Central Europe and Asia remain laboured, although improving in the latter, whilst the UK consumer will likely look to carry on being driven by price as the economic implications of Brexit emerge. 8.21 Topps Tiles enjoys improved trading as market picks up\nRetailer Topps Tiles has upgraded its profit forecast following much-improved trading in the fourth quarter.\nThe group posted a 1.2% increase in like-for-like sales in the 13 weeks to September 29 as it benefited from a turnaround strategy and the outperformance of the tile market.\nAs a result, Topps expects adjusted pre-tax profits for the year to be slightly ahead of the top end of the current range of market expectations, which stand at between £14.6m and £15.2m.\nAdjusted revenues for the year are expected to be in the region of £215m, up from last year’s £211.8m. Like-for-like revenues in the 52-week period to the end of September were flat.\nChief executive Matthew Williams said: “I am pleased to report an improvement in trading over the final quarter which has enabled the group to post a full-year sales result which is slightly ahead of the top end of market expectations and which represents an outperformance of the overall tile market.”\nIt comes after a difficult year for Topps, which saw half-year profits tumble by nearly a third after the Beast from the East and the timing of Easter hit sales. A Topps Tiles store (Image: Topps Tiles/PA Wire) 8.18", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/15227088;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-10-03T10:05:00.000+03:00", "crawled": "2018-10-05T15:26:36.012+03:00", "highlightTitle": ""}