{"organizations": [], "uuid": "671faffed8ecc762f556b5ff4b1da93b49a2ac24", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15305281.ece/ALTERNATES/s1200/0_household-rubbish-weekly-rubbish-feature.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/how-legal-age-drink-alcohol-15305282", "country": "GB", "domain_rank": 21960, "title": "How the legal age to drink alcohol in the UK compares to the rest of the world", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-20T11:38:00.000+03:00", "replies_count": 0, "uuid": "671faffed8ecc762f556b5ff4b1da93b49a2ac24"}, "author": "nechronicle", "url": "https://www.chroniclelive.co.uk/news/how-legal-age-drink-alcohol-15305282", "ord_in_thread": 0, "title": "How the legal age to drink alcohol in the UK compares to the rest of the world", "locations": [], "entities": {"persons": [], "locations": [{"name": "uk", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "News How the legal age to drink alcohol in the UK compares to the rest of the world It's not actually illegal to drink under the age of 18 in the UK, but's it's still older than many places in the world Share Empty wine bottles and beer bottles (Image: Sunday Mirror) Get daily updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nThe idea of teenagers waiting until the 18th birthday for their first alcoholic drink isn't all that realistic.\nFor many they've had a drink at home with the family or slyly with their mates before they reach that age.\nAnd while it is illegal to SELL alcohol to anyone under the age of 18, the actual legal age to drink is much younger.\nBut what exactly is legal and illegal when it comes to drinking in the UK? The law on drinking alcohol in the UK It is illegal to sell anyone aged under 18 alcohol. It is illegal for someone aged under 18 to try and buy alcohol. It is illegal to try and buy alcohol for someone aged under 18. It is LEGAL to buy a child aged between 16-18 beer, wine or cider if they are eating a table meal at a licensed premises. It is LEGAL for a child aged 5-16 to drink alcohol at home or other licensed premises.\nThe UK's chief medical officer recommends an alcohol free childhood is healthiest, however if children do drink underage it shouldn't be until they turn 15. Read More Nigel Farage talks Brexit and Theresa May before downing 'strongest pint in Wetherspoons'\nThe drinkaware website states: \"If 15 to 17 year olds do consume alcohol, they should limit it to no more than one day a week.\n\"Young people aged 15 to 17 years should never exceed the recommended adult weekly alcohol limits (no more than 14 units a week) and, when they do drink, they should usually drink less than that amount.\" What is the law on drinking alcohol elsewhere in the world?\nThe laws on drinking alcohol in the UK are pretty similar to the rest of the world, despite claims that some European countries are more laid back. Read More Mushroom Bar's had a £100,000 revamp - but 'it is still two skittles for a fiver' Italy: The age you can legally buy alcohol was raised from 16-18 in 2012 France: There is no legal age for consumption of alcohol but you have to be 18 to buy it Spain: The legal age for buying alcohol is 18, having recently been raised from 16 Greece: There is no legal drinking age in private. The legal age to buy alcohol is 18, although the law isn't always enforced United States: The legal drinking age is 21 but some states allow people aged 18 or over to drink Dubai: Venues serving alcohol have to be attached to a hotel or a private club. The legal age for buying alcohol is 21 Egypt: The age you can legally buy alcohol is 21 Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}", "https://www.drinkaware.co.uk/advice/underage-drinking/the-law/"], "published": "2018-10-20T11:38:00.000+03:00", "crawled": "2018-10-20T11:50:47.028+03:00", "highlightTitle": ""}