{"organizations": [], "uuid": "0f196d1f6fe9b821697aeb566538db3dc5438c42", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15114722.ece/ALTERNATES/s1200/1_Untitled-design.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/companies-must-keep-investing-future-15242822", "country": "GB", "domain_rank": 21960, "title": "Companies must keep investing in future success, Fastest 50 organiser says", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-05T22:57:00.000+03:00", "replies_count": 0, "uuid": "0f196d1f6fe9b821697aeb566538db3dc5438c42"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-news/companies-must-keep-investing-future-15242822", "ord_in_thread": 0, "title": "Companies must keep investing in future success, Fastest 50 organiser says", "locations": [], "entities": {"persons": [{"name": "ward hadaway", "sentiment": "none"}, {"name": "damien charlton", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "ward hadaway get", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "business companies", "sentiment": "negative"}, {"name": "ward hadaway fastest", "sentiment": "none"}, {"name": "ward hadaway", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Companies must keep investing in future success, Fastest 50 organiser says Newcastle law firm Ward Hadaway is urging the North East's fastest growing companies to keeping investing in innovation to build on their success Share Damien Charlton, a Partner in the Commercial team at Ward Hadaway Get business updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nWith Brexit just six months away, the North East’s fastest growing companies need to continue investing in innovation to build on their success, according to organisers of the Ward Hadaway Fastest 50 for 2018 .\nDamien Charlton, a partner in the commercial team at Ward Hadaway, the law firm which organises the annual countdown of the region’s fastest growing companies, says that businesses’ future growth prospects may be harmed unless they continue investing in innovation and sustainability programmes ahead of Brexit. Read More North East bosses on list of \"UK's most ambitious business leaders\"\nHe said: “Businesses need to remain focused on showing sustainable revenue growth, but it’s clear from recent surveys that companies are concerned about the impact of Brexit and so there is a risk that investment in areas such as innovation will be put on hold.”\nA recent Brexit survey from the North East England Chamber of Commerce shows the optimism shown earlier in the year following phase one of Brexit negotiations has faltered.\nIt found that more than half of North East business people believed Brexit would have a negative impact on their business, while just 14.1% saw it being beneficial to them.\nMr Charlton added: “Businesses will find it harder to focus on innovation and growth when the outcome of Brexit is so uncertain.”\nThe top three Brexit concerns identified in the Chamber survey were the cost of trade, changes to standards and regulations, and changes in access to EU funding. According to the survey, two in five business people also felt their business was underprepared.\nMr Charlton said: “The Chamber results come as no surprise. Given that the outcome of the current Brexit negotiations is still so uncertain, it will be difficult for some businesses to think in an expansive way and make longer-term growth and investment plans.” Read More Mike Ashley's Sports Direct in running to buy American Golf and Evans Cycles\nMr Charlton added that while shifts in trade relations and government policy may create new costs, resulting in companies becoming more selective when it comes to investment, he warned against “knee-jerk reactions”.\nHe said: “Any fast growing business with hopes for sustainable growth needs to be prepared for shifts in the landscape of business regulation in the long term. We are a trading nation and our supply chains are closely integrated with the wider European market and businesses will adapt to a different relationship with Europe.\n“Companies with a strong ethos like those in our North East Fastest 50 are more likely to weather the storm. The Fastest 50 recognises businesses that are making their mark and growing consistently, whatever the weather.”\nWard Hadaway, which has offices in Newcastle, Leeds and Manchester, devised the Fastest 50 back in 1998 as a way of highlighting and celebrating the achievements of fast-growing privately-owned companies across the North East.\nEvery year since then the UK Top 100 law firm has used publicly available figures from Companies House to compile a list of the businesses across the region which have seen the highest annualised growth in their turnovers whilst remaining profitable.\nAn awards ceremony is then held where awards are presented to the fastest growing small business, fastest growing medium-sized business and fastest growing large business with one of these winners being crowned the overall fastest growing business in the North East. Read More Newcastle beer to go global as brewery signs deal with cruise liner\nThis year will be the 21st time that the Ward Hadaway Fastest 50 Awards have been held with the invitation-only event taking place at Baltic, the Centre for Contemporary Art, in Gateshead on October 12.\nNorthumbrian Water Group’s information services director Nigel Watson, who is also a member of the CBI’s Innovation Council, will deliver a keynote speech on innovation at the event.\nMr Charlton said: “The qualities exemplified by the companies which make up this year’s list – dedication, determination, adaptability and expertise – are precisely those which will be needed as we head into what are unchartered waters in a post-Brexit Britain.”\nSince the referendum, Ward Hadaway has held a number of seminars and briefings looking at the issues and challenges of Brexit, and will continue to do so as further details emerge from the negotiations. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-10-05T22:57:00.000+03:00", "crawled": "2018-10-06T00:06:52.004+03:00", "highlightTitle": ""}