{"organizations": [], "uuid": "de4d89be1ee9e49b3e003f4a073011078f77ba88", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14919747.ece/ALTERNATES/s1200/3_JS143562321.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15318528", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Barclays banks rise in profits to £1.46bn", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-24T10:30:00.000+03:00", "replies_count": 0, "uuid": "de4d89be1ee9e49b3e003f4a073011078f77ba88"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15318528", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Barclays banks rise in profits to £1.46bn", "locations": [], "entities": {"persons": [{"name": "dylan thomas", "sentiment": "none"}], "locations": [], "organizations": [{"name": "barclays", "sentiment": "negative"}, {"name": "nissan", "sentiment": "negative"}, {"name": "ford", "sentiment": "negative"}, {"name": "fiat chrysler", "sentiment": "negative"}, {"name": "youtube", "sentiment": "none"}, {"name": "ford mustang", "sentiment": "none"}, {"name": "advertising standards authority", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Ford, Nissan and Fiat Chrysler ads banned\nAdverts for Ford, Nissan and Fiat Chrysler have been banned for encouraging irresponsible driving.\nTwo ads for Ford, seen on the carmaker’s YouTube channel and in cinemas, featured a voice-over that stated: “Do not go gentle into that good night... Old age should burn and rave at close of day. Rage. Rage against the dying of the light.”\nTwelve viewers complained that they depicted driving as a way of relieving anger.\nFord said the aim of the ad was to contrast the “everyday frustrations of work life with the freedom of driving a new Ford Mustang”, with viewers left to imagine how they would feel driving the car instead of experiencing in the daily grind of office life.\nIt said the voice-over quoted the Dylan Thomas poem ‘Do not go gentle into that good night,’ and its reference in the ads suggested that a Ford Mustang could be the antidote to a dull life.\nThe Advertising Standards Authority (ASA) said the ad showed the Mustang bring driven in an “abrupt manner” as on-screen text read “Don’t go quietly” and characters were depicted releasing their anger while driving the car.\nThe ASA said: “We therefore considered that the ads suggested that driving was a way of releasing anger, which put the driver, other motorists and pedestrians at risk.”\nFord said: “Our intent is never to encourage unsafe driving and, while care was taken during filming of the ad to show the car driving safely and at no point exceeding 15mph, we will no longer include the ad in our future marketing communications.” The watchdog also upheld a complaint about a television ad for Nissan, which showed a car veering into the left-hand lane before taking a hard left around a corner into an airport, and a separate complaint about a Fiat Chrysler ad which showed cars being driven at high speeds and racing.\nFiat Chrysler said the track running between high rise buildings in its ad was designed to emulate the Hot Wheels children’s toy cars game and highlighted inventiveness and creativity rather than competitiveness.\nNissan said its ad aimed to demonstrate the intelligent technology and safety features of the Micra car, adding that the it believed the benefit of the Micra’s safety feature was not exaggerated and the driver was at all times driving within the applicable speed limits.\nThe ASA banned both ads, finding that Nissan’s ad implied the character had increased the speed of the vehicle because they were in a rush and Fiat portrayed the cars racing and being driven in a manner that condoned or encouraged unsafe or irresponsible driving.\nA Nissan spokesman said: “We were very disappointed with the ruling made by the ASA, although of course we will respect their decision.\n“This advert showed the benefits of advanced safety technologies for drivers and included a depiction of pedestrian detection and Intelligent Emergency Braking.\n“Nissan does not condone or encourage irresponsible driving at any time.” A screengrab issued by the Advertising Standards Authority (ASA) of the advert for Ford Mustang which has been banned for encouraging irresponsible driving. 8.50 Coreena Ford Newcastle Racecourse turnover jumps 47% in two years thanks to new all-weather track\nTurnover has jumped 17% at the firm behind Newcastle Racecourse as it reaps the rewards of investment in its all-weather track.\nHigh Gosforth Park Limited saw revenues rise from £12.4m to £14.6m last year, its first full year of trading since a £12m redevelopement of the racecourse was unveiled.\nThe firm, now owned by Arena Racing Company, the sporting group which is in turn owned by billionaire entrepreneurs David and Simon Reuben, ploughed significant sums into building an all-weather track and installing 44 flood lights, allowing it stage twilight meetings.\nThe move has greatly increased the number of meetings it holds each year, from 29 in 2015 to 61 in 2017, and sales have soared by 47% over the last two years too. A twilight meeting on the new all-weather track at Newcastle Racecourse 8.45 Coreena Ford Stobart swings to loss\nShares in Stobart nosedived after the troubled infrastructure group swung to a half-year loss as a bitter boardroom row rumbles on in the courts.\nThe firm, which owns Southend Airport, posted a £17.5m loss in the first six months of the year, compared with a profit of £111.9m in 2017.\nStobart said the poor figures were due to investment in Southend Airport route development and marketing.\nShares tumbled more than 7% to 199p in morning trade. In better news, revenue grew 21.4% to £151.3m, boosted by the performance of aviation security. But the figures are likely to be overshadowed by a boardroom dispute now being played out in the High Court between Stobart and former chief executive Andrew Tinkler.\nMr Tinkler was trying to install retail boss Philip Day in his stead in a bid backed by a fund controlled by star investor Neil Woodfood and Allan Jenkinson, a former Stobart director.\nMr Ferguson survived the shareholder vote on his re-election at the the company’s contentious annual general meeting (AGM), but said he would step down in any case.\nStobart is now suing Mr Tinkler, accusing him of conspiring to harm the company’s interests. 8.40 Coreena Ford Thousands of TSB customers switch amid IT meltdown\nThousands of TSB customers switched away from the bank between April and June as the repercussions of its IT meltdown were felt, figures show.\nFigures for the second quarter of 2018 show that, among those customers using the seven-day current account switch service (Cass), TSB made a net loss of 16,641 current account switches - with 5,149 switches being made to the bank during the second quarter of 2018 while 21,790 customers switched away from it.\nThe figures include people, small businesses and small charities using Cass, which automatically redirects outgoing and incoming payments to the new account and guarantees people will not be left out of pocket if anything goes wrong.\nThe figures do not include switches made by customers outside of Cass, so do not capture the total number of account changes made.\nTSB said the figures only show “part of the total picture”, and added it had welcomed more than 20,000 new customers during the period.\nA TSB spokeswoman said:\nThe number of people who use the current account switching service is only part of the total picture. During the three months in question we actually saw more than 20,000 customers either open a new bank account at one of our branches or switch their account to us using the Cass system.\nThe Cass figures, which are supplied on a voluntary basis by banks and building societies, also suggest HSBC, Nationwide Building Society and a clutch of newer market challengers were among the “winners” when it came to customers looking for a new provider in the second quarter. A TSB branch (Image: DAILY RECORD) 8.35 Coreena Ford Metro Bank profit more than doubles\nMetro Bank has reported a surge in third-quarter profit as the group hailed a surge in deposits and record lending growth.\nThe challenger bank saw statutory profit more than double from £4.7m to £10m in the three months to September 30.\nOn an underlying basis, pre-tax profit came in at £15.1m, up from £7.2m in the same period last year.\nMetro said in the first nine months of 2018 it delivered double-digit growth in deposits and record lending growth year-on-year. The group said that, for the fourth successive quarter, it exceeded £1 billion in net lending. Total deposits increased to £14.8bn up from £10.8bn at the same time in 2017.\nBoss Craig Donaldson said:\nThe first nine months of 2018 show another strong performance from Metro Bank.\nOur integrated, frictionless model - stores, online, mobile and phone - combined with superior service is a winning formula for our customers.\nWe have continued to invest in our mobile services and have harnessed the power of Artificial Intelligence.\nHowever, Metro’s net interest margin - the difference between the interest received from borrowers and the amount paid out on deposits - fell from 1.94% to 1.77%. The lender pinned the blame on competition in residential mortgages. A Metro Bank branch KEY EVENT Barclays banks rise in profits\nBarclays has reported a rise in third-quarter profits as the bank dodged major conduct and litigation costs.\nThe group posted a rise in pre-tax profits from £1.11bn to £1.46bn in the three months to September 30.\nThe figures were helped by the absence of misconduct charges which dragged down first-quarter results.\nChief executive Jes Staley said: “In spite of macro-economic uncertainty, and particularly concerns over Brexit which weigh heavily on market sentiment, 2018 is proving to be a year of delivery on our strategy at Barclays.\n“We remain focused on generating improved returns, and on distributing a greater proportion of excess capital to shareholders over time.”\nNet profit came in at £1bn, beating consensus forecasts. Barclays’ investment banking arm had an improved performance with income at tits markets division rising 19% to £1.15bn in the period.\nMacro income, which comprises fixed income, currencies and commodities, rose from £627m to £688m.\nThe corporate and investment bank booked a total income of £2.24bn, down slightly compared with the same quarter last year.\nMr Staley added: “During the third quarter, our Corporate and Investment bank outperformed peers again in Markets, with a 19% increase in income, and, in Banking, while we saw a dip in income, we have seen strong completion activity in October.”\nThe results come at a challenging time for the lender, with activist investor Sherborne pushing for higher returns from the investment bank and looking for bigger payouts for shareholders.\nMr Staley himself has also come under fire this year after attempting to identify a whistleblower at Barclays, sparking a probe by the Financial Conduct Authority. Barclays CEO Jes Staley during a visit to Ashington (Image: Barclays) More On", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/15318528;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-10-24T10:30:00.000+03:00", "crawled": "2018-10-24T13:33:34.001+03:00", "highlightTitle": ""}