{"organizations": [], "uuid": "806acf8d7acdabc28686f01172491113f13d8f5d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.nottinghampost.com/incoming/article2161420.ece/ALTERNATES/s1200/0_Budget-2018.jpg", "site_section": "", "section_title": "", "url": "https://www.leicestermercury.co.uk/news/uk-world-news/budget-2018-11-announcements-affect-2162375", "country": "GB", "domain_rank": 48128, "title": "The Budget 2018 - 11 announcements that will affect people in Leicester - Leicestershire Live", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.007, "site_type": "news", "published": "2018-10-30T02:00:00.000+02:00", "replies_count": 0, "uuid": "806acf8d7acdabc28686f01172491113f13d8f5d"}, "author": "Jonathon Walker", "url": "https://www.leicestermercury.co.uk/news/uk-world-news/budget-2018-11-announcements-affect-2162375", "ord_in_thread": 0, "title": "The Budget 2018 - 11 announcements that will affect people in Leicester - Leicestershire Live", "locations": [], "entities": {"persons": [{"name": "philip hammond", "sentiment": "none"}], "locations": [{"name": "leicester - leicestershire live click", "sentiment": "none"}], "organizations": [{"name": "house of commons", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nWith Brexit approaching quickly, thoughts have turned to the future of our country.\nEconomics and our own personal finances are at the forefront of the uncertainty.\nBut Chancellor Philip Hammond set out to make the future seem clearer as he addressed the House of Commons during his Budget speech yesterday.\nHe said the \"era of austerity is finally coming to an end\", but what does that really mean?\nThe Chronicle Live highlights the top 11 announcements that will affect you: Many people will be able to keep more of the money they earn\nThe income tax threshold will increase to £12,500 in April 2019. In other words, you won’t pay any income tax at all until you earn this much.\nAssuming you have an annual income of at least £12,500, you’ll probably pay £130 less tax a year.\nAnd the threshold for the higher rate of income tax - the 40% rate - will increase to £50,000-a-year. Chancellor Philip Hammond delivering his Budget statement to MPs in the House of Commons. (Image: PA)\nIt means that some people on higher salaries (more than £46,351-a-year) will also gain. There will be a pay rise for some workers\nThe “living wage”, the effective minimum wage for people aged 25 or over, will rise to £8.21 next April, up from £7.38 an hour now. Fuel duty is frozen again\nIn 2019, fuel duty will remain frozen for the ninth year in a row, saving the average driver £1,000 since 2010, according to the Treasury. There’s some help for cash-strapped local councils struggling to pay for social care\nLocal authorities in England will receive a further £650 million in social care funding next year, shared between them. Schools will get some extra cash\nThe Chancellor announced £400 million extra for schools this year.\nThis will be £10,000 for the average primary school and £50,000 for the average secondary school. Potholes may get fixed\nLocal authorities will receive £420 million to fix potholes on roads and renew bridges and tunnels, and there will be a £150 million to improve local traffic hotspots such as roundabouts.\nAnd a £28.8 billion National Roads Fund, paid for by road tax, includes £25.3 billion for the Strategic Road Network (motorways, trunk and A roads). The largest ever investment of this kind.\nIt will also help fund the new network of local roads (known as the Major Road Network), and larger local road projects. Potholes could soon be less of a problem for drivers. There’s a promise that life will get a little easier for people on Universal Credit\nHe announced an extra £1bn over five years to aid those moving to Universal Credit, and there will be help for people repaying debts.\nThe Chancellor also announced £1.7 billion to increase existing work allowances in Universal Credit. The work allowance is the amount you can earn before your benefits start to be reduced. Read More ", "external_links": [], "published": "2018-10-30T02:00:00.000+02:00", "crawled": "2018-10-31T11:29:17.004+02:00", "highlightTitle": ""}