{"organizations": [], "uuid": "5cfb107bc393b758bfc4d47f0973a1e29aa5eae0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/business/article2064591.ece/ALTERNATES/s1200/0_Paul-Crawford-CEO-LiveWest.jpg", "site_section": "http://www.devonlive.com/rss.xml", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/business/livewest-promises-16000-homes-10-2064590", "country": "US", "title": "LiveWest promises 16,000 homes in 10-year plan to tackle housing crisis", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-02T12:55:00.000+03:00", "replies_count": 0, "uuid": "5cfb107bc393b758bfc4d47f0973a1e29aa5eae0"}, "author": "Hannah Finch", "url": "https://www.devonlive.com/news/business/livewest-promises-16000-homes-10-2064590", "ord_in_thread": 0, "title": "LiveWest promises 16,000 homes in 10-year plan to tackle housing crisis", "locations": [], "entities": {"persons": [{"name": "paul crawford", "sentiment": "none"}], "locations": [{"name": "south west", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "east devon", "sentiment": "none"}], "organizations": [{"name": "knightstone housing", "sentiment": "none"}, {"name": "dch", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get Daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nThe biggest housing provider in the South West has launched a £2billion 10-year plan to help solve the housing crisis.\nLiveWest recorded a £76million surplus this year and plans to plough the money into a programme to build 16,000 homes and pump £2billion into the local economy.\nLiveWest, formed in March after the merger of DCH and Knightstone Housing, has published its financial report up to March 2018.\nIt has invested £140million in new homes, currently owns over 36,000 homes across the region and plans to build a further 16,000 homes over the next 10 years.\nLiveWest chief Executive Paul Crawford, said: “The South West is a great place to live but equally it is a place of great pressure in terms of the number of available homes and the affordability of housing.\nLast year, the average house price in the South West was £250,000 compared to the average wage of £25,000. Read More\nHe said: “The average house costs ten times average earnings and in some areas of Exeter, South Hams and East Devon it can be 12 or 14 times. There is a desperate need for homes in the South West.”\nThe organisation originally launched as Liverty as part of its £100,000 rebrand after the merger in March.\nBut it has now changed its name to LiveWest after facing a trademark challenge by Canadian-owned student accommodation provider Liberty Living.\nMr Crawford said: “It has been a bit of a blip since the merger.\n“We did a number of checks, searches of domain names and sought legal advice but within days of going to trademark the name we received the objection.\n“We sat down and thought, we have spent £100,000 on a rebrand but if we were to defend this, it could take one to two years and if we lost we would have to pay the costs and re-name anyway. LiveWest's rural housing scheme in West Alvington\n“We see this as a tweak to our name and we are putting this behind us because we would rather invest in services than pay lawyers when there is no guarantee we would win.”\nLiveWest is within the top 15 largest building housing associations in the country having built 812 affordable homes for rent and shared ownership during the last financial year as well as 159 to sell on the open market. Read More\nAnd the company’s investment plans will sustain 6,500 jobs in the building and supply chain.\nBut it needs the right skills to build much-needed homes. LiveWest's Nelson Project that employed the skills of Plymouth military veterans on the housing scheme\nMr Crawford said: “There has to be a recognition by central government, local authorities and the LEPS that skills are a priority.\n“The 2007 recession saw a lot of those skills leaving the construction industry and around 11-17per cent of those skilled workers are currently EU migrants. There is a real concern that Brexit could denude the sector of the skills it needs.”\nLiveWest has become one of the first partnerships nationally, alongside Sovereign, to be given a £111.5million Homes England grant to build a further 2,275 new homes by 2024 – part of the government’s strategy to ensure 300,000 new homes are built year on year by 2025. Read More\nHe said: “There is a recognition that housing is pivotal to economic prosperity and that good quality affordable housing, so people can live where they work, is vital.” LiveWest repair team\nLiveWest is the one of the region’s largest employers with 1,372 staff and employed 24 apprentices across the company in the last year.\nStaff in Devon have moved into £10million flagship offices at Skypark, Exeter and LiveWest is set to open new £7million headquarters in Cornwall along with its centre in Weston Super Mare.\nIt has invested £55million in maintaining and improving homes for current customers and is investing in new IT systems so customers can access more services online.\nMr Crawford said: “Putting our customers first runs through the heart of LiveWest and our sustained efforts to meet our customers’ needs are highlighted with an 89% satisfaction rate.\nMr Crawford said: “Our future focus is very much on delivering a substantial increase in the number of new homes, continuing to deliver high-quality services and ensuring that our financial and organisational resilience underpins our ambitious plans.” Read More", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-10-02T12:55:00.000+03:00", "crawled": "2018-10-02T15:12:05.002+03:00", "highlightTitle": ""}