{"organizations": [], "uuid": "78410f0d109b19771f16c84a0aa7f522b6efa57d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1991204.ece/ALTERNATES/s1200/0_ecsImgGeneric-police-in-Devon-5602717229706004016.jpg", "site_section": "", "section_title": "", "url": "https://www.devonlive.com/news/devon-news/woman-44-gone-missing-police-2072329", "country": "US", "title": "Live updates as woman, 44, has gone missing and police are really worried about her - Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.376, "site_type": "news", "published": "2018-10-03T03:00:00.000+03:00", "replies_count": 0, "uuid": "78410f0d109b19771f16c84a0aa7f522b6efa57d"}, "author": "Jon Lewis", "url": "https://www.devonlive.com/news/devon-news/woman-44-gone-missing-police-2072329", "ord_in_thread": 0, "title": "Live updates as woman, 44, has gone missing and police are really worried about her - Devon Live", "locations": [], "entities": {"persons": [{"name": "emma adderley", "sentiment": "none"}, {"name": "emma", "sentiment": "none"}], "locations": [{"name": "torrington", "sentiment": "none"}, {"name": "bideford", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Live updates as woman, 44, has gone missing and police are really worried about her\nOfficers have launched an urgent appeal to find Emma Adderley Share Click to play Tap to play The video will start in 8 Cancel Play now\nA 44-year-old woman has gone missing from her home in Torrington.\nPolice are now appealing for help from the public to find Emma Adderley, who also has links to Bideford and Barnstaple.\nEmma is described as white, 5ft 4ins tall with very long dark brown hair usually worn in a ponytail.\nAnyone who sees her is asked to call 999 immediately quoting log 221 of Wednesday, October 3.\nHow does a missing person investigation work? Video Loading Click to play Tap to play The video will start in 8 Cancel Play now\nFollow our live blog below for the latest updates as we get them. What to do if someone goes missing?\nIt is a traumatic experience when a person goes missing.\nFortunately, most people return or are found within 48 hours. However, sometimes this is not the case. When should I report a person missing?\nYou should report a missing person to the police if: The person is a child The person is a vulnerable adult The person has been detained (sectioned) under the Mental Health Act or are legally in the care of another person You are concerned for the person’s safety Read More House of Fraser closure: Five shops which could replace the High Street department store What you should do\nThe police ask parents and carers, including staff acting in a parenting role in care homes, to undertake reasonable actions to try and establish the whereabouts of the individual.\nThis could include, but is not limited to; Attempts to contact the child or adult. Calling friends or family. Visiting areas that the child or adult is known to frequent. Visiting the place where the child or adult was known to be attending (i.e. a friend's house or party). Checking to see if any items are missing from the home. Checking social media.\nExperience has shown that these initial enquiries yield additional information that helps narrow down any police search. In several cases it has resulted in the early return of the missing person and in some cases it has resulted in there being no additional police involvement as the missing person is located before a full missing person search begins. How do I report a person missing?\nYou can report a person missing in the following ways: Call 999, if the missing person is a vulnerable adult or a child, or you believe them to be in danger, or Call 101 Go to your local police station Read More Holidaymakers need to renew passports NOW in case of no deal Brexit What happens when I report a person missing to the police?\nWe will ask you to provide as many details as possible to enable us to find the missing person quickly. This could include: Personal details: Name, date of birth Appearance including any distinguishing marks Contact details such as mobile phone number Medical conditions and whether or not these require medication Circumstances under which they went missing Details of friends and relatives Details of places they often visit\nWe will use this information to determine the level of risk the missing person is at and what the police response should be.\nThe information you give us will also be put onto the Police National Computer and circulated to all police forces. Initial inquiries will be made to try to find the missing person.\nIf they are not found the investigation is passed to a nominated officer who will deal with all further enquiries. More On ", "external_links": [], "published": "2018-10-03T03:00:00.000+03:00", "crawled": "2018-10-04T09:00:33.014+03:00", "highlightTitle": ""}