{"organizations": [], "uuid": "b1546310af1934ad2cbb7dedcf598df3e9f57b5c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15344475.ece/ALTERNATES/s1200/1_budget2.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/theresa-promised-end-austerity-budget-15344690", "country": "GB", "domain_rank": 21960, "title": "Theresa May promised to end austerity but the Budget hasn't delivered", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-29T23:11:00.000+02:00", "replies_count": 0, "uuid": "b1546310af1934ad2cbb7dedcf598df3e9f57b5c"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/theresa-promised-end-austerity-budget-15344690", "ord_in_thread": 0, "title": "Theresa May promised to end austerity but the Budget hasn't delivered", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}], "locations": [{"name": "newcastle airport", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "news", "sentiment": "negative"}, {"name": "budget", "sentiment": "negative"}, {"name": "spending review", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News opinion Theresa May promised to end austerity but the Budget hasn't delivered Theresa May's conference speech actually included a promise to end austerity next year - but she knew nobody would read the small print Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nIt’s less than four weeks since Theresa May promised an end to austerity.\nAnd today, she and her government are paying the price for that rash promise - which hasn’t come true.\nThe Prime Minister made the statement in her speech to the Conservative Party conference.\nShe never, in fact, claimed that austerity had ended, or that it was going to end in the near future. Read More Budget 2018: How passengers and Newcastle Airport could be hit by an increase in Air Passenger Duty\nInstead, she said: “When we’ve secured a good Brexit deal for Britain, at the Spending Review next year ... support for public services will go up.”\nIn other words, funding for public services will start to increase after the Chancellor’s Spending Review, which is likely to take place around March 2019, and only if the Government manages to secure a good Brexit deal.\nBut what people remember is what Mrs May said next. She told the conference: “A decade after the financial crash, people need to know that the austerity it led to is over and that their hard work has paid off.”\nLater, she said “ending austerity” was part of “the future this party will deliver”. Chancellor of the Exchequer Philip Hammond, has a cup of tea as he prepares his speech in his office in Downing Street, London, ahead of his 2018 Budget announcement (Image: Chris J Ratcliffe/PA Wire)\nMrs May knew what she was doing.\nThe newspaper headlines talked of an end to austerity - and that’s what she wanted.\nMost people never read the small print.\nWhy did she do it?\nThe Prime Minister wanted to make it clear that she had more to offer than just delivering Brexit. She wanted us all to know that she has plans the UK once it leaves the EU in March next year.\nThat’s because she wants to convince her party to let her carry on as leader and Prime Minister after Brexit takes place.\nBut in the process, she raised expectations to a ridiculous degree.\nSome people think she announced that austerity was over there and then.\nMany others might think it’s fair to give her a little time. They might be willing to accept that austerity can’t just stop overnight. Read More\nBut the trouble is that today’s Budget, the government’s big annual financial statement, appears to be the obvious moment to start ending austerity, if you’re going to do it at all.\nAnd it hasn’t happened.\nThe Budget contained some major spending announcements, such as £30 billion to improve the roads and £2 billion a year for mental health.\nBut it didn’t have the big spending increases for schools, care services or the police that could really be called an end to austerity.\nAnd Labour are making the most of this.\nThey claim that Theresa May promised austerity had ended, and she’s broken her promise. The ministerial box of the Chancellor of the Exchequer, Philip Hammond, ahead of his 2018 Budget announcement (Image: Chris J Ratcliffe/PA Wire)\nYou could argue that Labour is misrepresenting what Mrs May said just a little, but she’s handed them an open goal. You can’t blame the opposition party for taking a few shots.\nMrs May got the headlines she wanted and now she’s paying the price.\nThere’s another problem too.\nRight now, the issue is about timing. The Prime Minister made a promise which she doesn’t intend to deliver on until some time next year.\nBut if she does stay in power long enough to deliver on her pledge, she’ll discover that people have different ideas about what ending austerity means.\nFor Mrs May - based on her speech to the Tory conference - it seems to involve spending on services going up, rather than down.\nHowever, others might have much higher expectations. They might think an end to austerity actually means reversing all the cuts imposed since 2010 - a different and far more expensive proposition. Read More", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-10-29T23:11:00.000+02:00", "crawled": "2018-10-30T04:51:53.000+02:00", "highlightTitle": ""}