{"organizations": [], "uuid": "7178f8732225a45be5c9bbb55f2b00340f81af96", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15236757.ece/ALTERNATES/s1200/0_CFR_NJL_041018nissan_01.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/nissan-stalls-pay-talks-sunderland-15272977", "country": "GB", "domain_rank": 21960, "title": "Nissan stalls pay talks in Sunderland amid continuing Brexit negotiations", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-12T16:30:00.000+03:00", "replies_count": 0, "uuid": "7178f8732225a45be5c9bbb55f2b00340f81af96"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/nissan-stalls-pay-talks-sunderland-15272977", "ord_in_thread": 0, "title": "Nissan stalls pay talks in Sunderland amid continuing Brexit negotiations", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Business Nissan stalls pay talks in Sunderland amid continuing Brexit negotiations The pays talks usually take place once every two years but Nissan has confirmed they have been delayed at Sunderland Share The entrance to Nissan's plant at Washington (Image: nissan) Get business updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nPay talks have been delayed between Nissan and its workers on Wearside amid continuing talks over the UK’s Brexit deal.\nBiennial discussions between the firm’s 6,000-plus workforce and bosses had been due to start around this time, but the car manufacturer has confirmed they have been stalled until next year.\nA date for the talks has not yet been set.\nA Nissan spokesman said: “In agreement with our employee representatives, the 2019/2020 pay negotiations in our UK plant and technical centre will commence in 2019 when we have better clarity on the future business outlook.\n“Beyond this we will not be commenting on internal matters.”\nThe news comes a week after Nissan warned of “serious implications” for its Sunderland plant and the wider manufacturing industryin the event of a so-called ‘Hard Brexit’ when the UK leaves the European Union on March 29, 2019 An aerial view of Sunderland's Nissan plant (Image: nissan)\nNorth East business groups and industry leaders said the Government must react to the alarm sounded by Nissan, which has grown to employ more than 6,000 people at the Sunderland plant, with thousands more working in its supply chain.\nNissan uses its UK base to export to the EU and benefits from being able to trade freely, also importing vast volumes of components. Around 85% of its parts are no longer made in the UK and currently arrive without customs checks or extra tariffs.\nThe company’s statement said: “Since 1986, the UK has been a production base for Nissan in Europe. Our British-based R& and design teams support the development of products made in Sunderland, specifically for the European market.\n“Frictionless trade has enabled the growth that has seen our Sunderland plant become the biggest factory in the history of the UK car industry, exporting more than half of its production to the EU. Read More Nissan warns of 'serious implications' for Sunderland plant over no-deal Brexit\n“Today we are among those companies with major investments in the UK who are still waiting for clarity on what the future trading relationship between the UK and the EU will look like.\n“As a sudden change from those rules to the rules of the WTO will have serious implications for British industry, we urge UK and EU negotiators to work collaboratively towards an orderly, balanced Brexit that will continue to encourage mutually beneficial trade.” Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-10-12T16:30:00.000+03:00", "crawled": "2018-10-12T17:41:07.005+03:00", "highlightTitle": ""}