{"organizations": [], "uuid": "00974292406d1ab1e98687f824d08669f104a7b3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15343257.ece/ALTERNATES/s1200/0_Budget-2018.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/budget-2018-business-rates-reform-15343024", "country": "GB", "domain_rank": 21960, "title": "Budget 2018: Business rates reform tops North East firms' wish list", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-29T14:11:00.000+02:00", "replies_count": 0, "uuid": "00974292406d1ab1e98687f824d08669f104a7b3"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/budget-2018-business-rates-reform-15343024", "ord_in_thread": 0, "title": "Budget 2018: Business rates reform tops North East firms' wish list", "locations": [], "entities": {"persons": [{"name": "philip hammond", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "budget", "sentiment": "none"}, {"name": "lloyds bank commercial banking", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now Get business updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nA freeze on business rates has been revealed as the number one priority of North East businesses ahead of this afternoon’s annual Budget.\nOver a third (36%) of companies in the region have said they want Chancellor Philip Hammond to freeze or lower business rates as part of his final Budget plan before Brexit.\nBusiness rates have proved unpopular with many UK firms, and have been partly blamed for the country’s struggling high street retail sector.\nAccording to the research by Lloyds Bank Commercial Banking, North East firms are also calling for the UK to have the lowest corporation tax rate of the G7 countries, with 18% calling for the change. The ministerial box of the Chancellor of the Exchequer, Philip Hammond (Image: PA)\nTackling the skills gap was another area of concern for firms, with 13% of companies saying they want the Chancellor to focus on improving skills to allow them to recruit talented workers.\nSurprisingly only 9% of those surveyed wanted Mr Hammond to focus on improving transport in the region. Read More How big changes on Newcastle and Gateshead quaysides will make them the North East's 'crown jewels'\nKelly Green, regional director for the North East at Lloyds Bank Commercial Banking, said: “These results speak to the North East’s business development priorities.\n“Although we might have expected to see transport infrastructure investment higher on firms’ agendas, particularly with ongoing discussions around Northern Powerhouse Rail, businesses hope that action to ease taxes will help to create an environment that better supports their growth – especially during this period of continued uncertainty. Chancellor of the Exchequer, Philip Hammond, drinks tea as he prepares his speech in his office in Downing Street ahead of his 2018 budget announcement (Image: Getty Images Europe)\n“Meanwhile, the skills gap continues to be a significant hurdle for many across the North East.\n“Support in addressing shortfalls here will not only help boost productivity in the immediate term but also ensure the region’s workforce is equipped to tackle any challenges the future may bring.” Read More Support for ailing High Streets expected in Monday's Budget\nA further 4% wanted changes to be made to the annual investment allowance cap for SMEs, which allows them to claim tax relief on £200,000 of business equipment. Those surveyed by Lloyds Bank hoped to see this increased to £1m to encourage investment and small business growth.\nNationally, 30% of companies want the Chancellor to freeze or lower business rates, while improvements to the UK’s transport infrastructure was the second popular response with 19% of firms calling for the investment. Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-10-29T14:11:00.000+02:00", "crawled": "2018-10-29T15:12:53.017+02:00", "highlightTitle": ""}