{"organizations": [], "uuid": "cf916d0a0906ee04aa38519453176665e60a6ac8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15336759.ece/ALTERNATES/s1200/1_GWR_-NJL_261018port_01.jpg", "site_section": "http://www.thejournal.co.uk/business/?service=rss", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/new-video-shows-how-north-15335396", "country": "GB", "domain_rank": 21960, "title": "New video shows how North East port will develop - and create hundreds of jobs", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-28T10:00:00.000+02:00", "replies_count": 0, "uuid": "cf916d0a0906ee04aa38519453176665e60a6ac8"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-news/new-video-shows-how-north-15335396", "ord_in_thread": 0, "title": "New video shows how North East port will develop - and create hundreds of jobs", "locations": [], "entities": {"persons": [{"name": "blyth", "sentiment": "negative"}, {"name": "martin lawlor", "sentiment": "none"}], "locations": [{"name": "blyth", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "northumberland energy park", "sentiment": "none"}, {"name": "battleship wharf", "sentiment": "none"}], "organizations": [{"name": "port of blyth", "sentiment": "negative"}, {"name": "bates terminal", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Animations of potential developments at Port of Blyth (Image: Port of Blyth)\nPort of Blyth has commissioned a series of animations that aim to show how the port could develop into a nationally-important energy and renewables hub.\nUsing a mixture of aerial film footage shot via a drone and newly created CGI animation, the port’s film transitions shows the opportunities that it hopes will bring hundreds of jobs in the next few years.\nThe film focuses on the planned developments at three sites around the estuary, with Port bosses saying it brings to life the “full potential” of the Port site and adjoining land. Animations of potential developments at Port of Blyth (Image: Port of Blyth)\nAmong the areas features is the newly extended Bates Terminal, the Battleship Wharf and the Northumberland Energy Park.\nPort chief executive Martin Lawlor said: “We’re excited to launch this animation because it really highlights the full potential of the developments sites on the estuary. It’s a hugely exciting time for the Port, our clients and the town as we look to generate inward investment, jobs and further opportunities in the offshore energy sector.” Port of Blyth Chief Executive Martin Lawlor (Image: handout)\nThe film shows a heavy lift quay gliding into place at Bates Terminal, while engineering sheds are seen coming to life on adjacent development plots. The section on Battleship Wharf, which has recently been granted a decommissioning licence, shows steel jackets from offshore oil and gas platforms being transported on to the site for breaking down.\nThe third site to feature on the animation is the Northumberland Energy Park , where £25m will be invested in a heavy lift quay and land remediation works to ready the area for wind turbine or subsea cable manufacturing. Read More Shortlist is revealed for 2018 North East Business Executive of the Year awards\nMeanwhile, Mr Lawlor has been named as the new chairman of the British Ports Association as the industry prepares for the challenges of Brexit .\nHe said: “It’s an honour to be asked to chair the BPA at this time. Having been involved with the association as a council member for more than a decade, I’ve seen from the inside how hard chief executive Richard Ballantyne and his team work to promote the interests of all the BPA’s members and I now look forward to contributing fully to that process.”\nMr Lawlor has also been shortlisted for the 2018 North East Business Executive Awards run by The Journal. Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-10-28T10:00:00.000+02:00", "crawled": "2018-10-28T12:18:14.029+02:00", "highlightTitle": ""}