{"organizations": [], "uuid": "21d8ffa71f6052f87e625881817789bae3b6bf24", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article711151.ece/ALTERNATES/s1200/0_DSC_4823.jpg", "site_section": "", "section_title": "", "url": "https://www.leicestermercury.co.uk/news/business/next-plc-buoyed-online-shoppers-2166615", "country": "GB", "domain_rank": 48128, "title": "Next Plc buoyed by online shoppers and Directory sales as in-store spending slows - Leicestershire Live", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.264, "site_type": "news", "published": "2018-10-31T02:00:00.000+02:00", "replies_count": 0, "uuid": "21d8ffa71f6052f87e625881817789bae3b6bf24"}, "author": "Tom Pegden", "url": "https://www.leicestermercury.co.uk/news/business/next-plc-buoyed-online-shoppers-2166615", "ord_in_thread": 0, "title": "Next Plc buoyed by online shoppers and Directory sales as in-store spending slows - Leicestershire Live", "locations": [], "entities": {"persons": [], "locations": [{"name": "oxford street", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "next plc", "sentiment": "negative"}, {"name": "leicestershire", "sentiment": "none"}, {"name": "yui mok/pa wire", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Sales in Next Plc stores are down Get Business updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nOnline shoppers are fuelling profits at Leicestershire’s Next , while spending less in its bricks and mortar stores.\nWhile the Enderby-based retailer shares some of the problems affecting other high street chains, its strong online operation continues to pay dividends.\nHowever, some analysts say Christmas will prove a key period for the business.\nAlthough online sales have slowed marginally in the last three months, they were still up almost 13 per cent on the same time last year.\nA trading update showed in-store sales were down 8 per cent year-on-year over the three months. The branch of Next on Oxford Street in central London (Image: Yui Mok/PA Wire)\nTotal full-price sales were up 2 per cent on autumn 2017, as the business maintained its previous forecast of achieving pre-tax profits of £727 million for the year – on a par with last year.\nDespite significantly outperforming many of the other big high street chains, shares in the business were down 3 per cent this morning.\nRuss Mould, investment director at online trading company AJ Bell, said although Next was maintaining recent form, Christmas would be a crunch time for its trading figures. Next chief executive Lord Simon Wolfson\nHe said: “Today’s third quarter statement represents a continuation of that trend, the difference being that online sales growth has slowed markedly from the first half and investors have punished the company accordingly.\n“Guidance for the full year to January 2019 is maintained. Although it had been upgraded slightly at the half-year stage, at that point it still looked fairly conservative – less so after this update.\n“Chief executive Simon Wolfson ’s skill at managing expectations looks set to be tested as Next now heads into the most important trading period of the year against an extremely uncertain consumer backdrop.\n“The company will likely set the tone for the retail sector when it is one of the first to update on its festive sales performance on January 3.\n“A weak outturn might increase pressure on management to consider more radical solutions to the structural challenges facing its physical shops.” Read More Enderby based Next reveals biggest risk to business in case of no-deal Brexit\nTom Stevenson, investment director from Fidelity Personal Investing’s share dealing service, said Next remained a “beacon of light” in a bleak retail sector.\nBut, he said: “Third quarter full-price sales growth of 2 per cent, bang in line with expectations, was only possible thanks to ongoing strong growth in the retailer’s online and catalogue business and growth in credit income.\n“Sales on the High Street are declining as fast as everyone else’s as consumers sit on their hands and digital disruption continues to devastate the sector. Read More Next's profits down in 'difficult trading conditions'\n“Three months ago, chief executive Lord Wolfson highlighted the threat of Brexit.\n“With the summer’s World Cup and weather boost now fading in the memory, the next few months will be a significant challenge for the retail sector but no business is better placed to navigate the storm than Next.”\nIn other news, high street banking giant Santander – which has a national operation in Carlton Park, Narborough – said its UK profits had dropped 15 per cent, as it warned of stiff competition and Brexit uncertainty.\nThe Spanish-owned lender, which employs about 2,000 people in Leicestershire, said its pre-tax UK profits fell 13 per cent of £1.4 billion for the first nine months of 2018. Satander profits are slowing (Image: PA)\nParent Banco Santander said the UK performance came amid a “highly competitive environment with some remaining uncertainties over Brexit”. Read More ", "external_links": [], "published": "2018-10-31T02:00:00.000+02:00", "crawled": "2018-10-31T15:22:02.026+02:00", "highlightTitle": ""}