{"organizations": [], "uuid": "2b1abaa8d41bbb29d61825d9a2ffe0ea0fcc36b0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article2050444.ece/ALTERNATES/s1200/0_may.jpg", "site_section": "http://www.leicestermercury.co.uk/rss.xml", "section_title": "Leicestershire Live - frontpage", "url": "https://www.leicestermercury.co.uk/news/local-news/councillor-who-wrote-hang-theresa-2074269", "country": "GB", "domain_rank": 48128, "title": "Councillor who wrote 'Hang Theresa May' on Facebook will NOT resign", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-04T18:24:00.000+03:00", "replies_count": 0, "uuid": "2b1abaa8d41bbb29d61825d9a2ffe0ea0fcc36b0"}, "author": "Dan Martin", "url": "https://www.leicestermercury.co.uk/news/local-news/councillor-who-wrote-hang-theresa-2074269", "ord_in_thread": 0, "title": "Councillor who wrote 'Hang Theresa May' on Facebook will NOT resign", "locations": [], "entities": {"persons": [{"name": "richard a", "sentiment": "neutral"}, {"name": "alderman", "sentiment": "none"}, {"name": "anna soubry", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "diane abbott", "sentiment": "none"}, {"name": "richard alderman", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "facebook", "sentiment": "neutral"}, {"name": "birmingham magistrates' court", "sentiment": "none"}, {"name": "rutland county council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Councillor who wrote 'Hang Theresa May' on Facebook will NOT resign He was sentenced today Richard Alderman sent a Facebook post calling for the Prime Minister Theresa May to be hanged Get Daily\nA councillor who posted racist abuse of Diane Abbott on Facebook has pledged to remain in his post, and \"let the public\" decide his fate.\nRichard Alderman - who also called for Theresa May and Anna Soubry to be executed - walked free from court after telling a judge, through his lawyer, that regaining UK sovereignty was his primary concern.\nThe 72-year-old member of Rutland County Council pleaded guilty to four offences under the 2003 Communications Act last week and was given a six-month curfew on Thursday at Birmingham Magistrates' Court.\nThe court was told how Alderman reacted to Mrs May's handling of Brexit by posting that she should be hanged in public for \"treason\".\nThe menacing post was written next to a Brexit-related news article in July, three days after Alderman was elected to the county council.\nThe independent councillor - described in court as \"pro-Brexit and anti-immigration\" - admitted writing a total of six grossly offensive and menacing posts, including rants directed at shadow home secretary Ms Abbott and Tory MP Ms Soubry. Posts included racial abuse of Diane Abbott (Image: PA)\nOpening the facts of the case last week, prosecutor James Bruce told the court the charges related to Facebook posts made between April and July this year.\nA post in May used an African word for monkey to describe Ms Abbott, while a further message in June added: \"The monkey is out of her tree again, send it to the animal labs.\" Read More\nA further message written before Alderman's election to Rutland's Oakham South West ward, next to a meme criticising Ms Soubry, read: \"Hang, shoot and drown the witch to make sure it's dead.\" What the defence said\nAfter Alderman's posts were found colleagues on Rutland County Council and Tory MP Sir Alan Duncan called on him to quit .\nSandeep Kaushal, defending, said his client was ashamed and wished to apologise for the \"ill-thought\" comments, and the effect on those mentioned in the posts.\nAlderman felt \"back-tracking\" since the 2016 Leave vote was a major cause for concern, Mr Kaushal told the court, adding: \"He has no intention of resigning his post.\n\"He states that he intends to stand for re-election and let the public decide whether they consider him to be a fit person.\n\"His primary focus is Oakham South West.\n\"It is highly unlikely that this man will ever appear before the courts in such a way again.\"\nMr Kaushal also told the sentencing judge that he had asked Alderman what his primary concern was, and the councillor had replied: \"I just want the UK to regain its sovereignty.\"\nCouncillors can only be disqualified if they receive prison sentences of three months or more so Alderman cannot be forced off the council. Judge slams councillor\nOrdering Alderman to wear an electronic ankle tag to monitor a 7pm to 7am curfew, District Judge David Robinson told the councillor: \"It is your right to express strongly-held views over the internet.\n\"However the 2003 Communications Act sets limits on that right. You accept that between April 22 and July 15 you crossed that threshold six times.\n\"You advocated support for killing by execution and assassination (of Mrs May and Ms Soubry) because you disagreed with their views.\n\"You did so with the recent memory of the killing of a British member of parliament.\n\"I am satisfied you intended the comments to be grossly offensive and of a menacing character.\n\"I am told you have deep regret for them.\" Rutland County Councillor Richard Alderman leaving Birmingham Magistrates Court Photo credit Matthew Cooper/PA Wire\nThe judge, who heard that Alderman has a lung condition, arthritis and diabetes and was not fit for unpaid work, said he saw no reason to depart from sentencing guidelines governing the offences. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/leicestermercury/subscriptions/&quot;}"], "published": "2018-10-04T18:24:00.000+03:00", "crawled": "2018-10-04T18:56:17.025+03:00", "highlightTitle": ""}