{"organizations": [], "uuid": "b5d002e3960a291da2a15fb60545c41449d2a495", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1894765.ece/ALTERNATES/s1200/0_homebase-exeterPNG.png", "site_section": "http://www.devonlive.com/rss.xml", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/business/reason-behind-exeters-homebase-closure-2065478", "country": "US", "title": "The reason behind Exeter's Homebase closure", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-02T14:21:00.000+03:00", "replies_count": 0, "uuid": "b5d002e3960a291da2a15fb60545c41449d2a495"}, "author": "Hannah Finch", "url": "https://www.devonlive.com/news/business/reason-behind-exeters-homebase-closure-2065478", "ord_in_thread": 0, "title": "The reason behind Exeter's Homebase closure", "locations": [], "entities": {"persons": [{"name": "nick turk", "sentiment": "none"}], "locations": [{"name": "exeter", "sentiment": "none"}, {"name": "moor lane", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}], "organizations": [{"name": "homebase", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "colliers international", "sentiment": "none"}, {"name": "wesfarmers", "sentiment": "none"}, {"name": "bunnings", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News The reason behind Exeter's Homebase closure A bad management strategy that ditched soft furnishings and homeware in favour of power tools is partly to blame for the demise of the brand Share Get Daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nThe loss of Homebase in Exeter was down to bad decisions at the top, an expert has claimed.\nThe Moor Lane branch, which closed last month , was among 42 of 241 stores which have been earmarked for closure.\nAnd its demise cannot just be blamed on changing consumer trends, said Nick Turk, director in the South West retail parks team at real estate services company Colliers International.\nHe said: “The dramatic decline of Homebase has highlighted how business weaknesses in some major retail chains has made them vulnerable, and these weaknesses have precipitated their collapse rather than purely changing shopping habits,” he said. Read More\nHe explained how Homebase had been making gross annual earnings of between £20 million and £40 million until 2016, when it was bought by Wesfarmers, the company behind the Australian DIY chain Bunnings, for £340 million. Five reasons High Streets are struggling\nWe asked Lucinda Coleman, Business Recovery Partner at PKF Francis Clark and an expert in helping struggling retailers to find ways of restructuring their business to ride out the storm, to explain why the High Street has buckled under pressure.\n1. Tight wallets\nConsumer spending has had its weakest start to the year since 2012 seeing consumer spending falling -1.1% year – on- year, declining for the ninth time in ten months; face to face spend down -2.5% year- on- year and recreation and culture spending seeing its greatest decline since April 2010, according to the Visa UK Consumer Spending Index.\nIt is a stark reminder of just how tough it is for consumer-facing businesses.\n2. Rising labour costs and business rates\nRetailers and restaurants are facing a combination of costs such as the National Living Wage, Apprenticeship Levy and business rates, together with reduced consumer spending.\nMany businesses are reluctant to pass on growing costs to their customers in the form of price rises but that eats into profits.\n3. Narrow margins\nSmall and medium sized businesses operate on tighter budgets so they are likely to either lose money or raise prices which could result in a loss of custom. These tight margins and fragile finances show just how big the threat of insolvency will be in this sector.\n4. Cost of ingredients\nAs the value of sterling has fallen, it has pushed up the price of imported goods including the price of food that we import. The UK imports around 50% of its food so many restaurants rely heavily on food and wine imports. With the cost of importing ingredients now higher and the increase in the cost of labour, due to the national minimum wage rises the sector is facing the perfect storm.\n5. Competition\nThe restaurant sector is fiercely competitive with so much choice available. The rapid shift towards online shopping and meal delivery services has also taken a severe toll.\nNow, when diners do venture out for a meal with their tightened purses the restaurant needs to do something to entice the customer into their establishment.\nBy May of this year it had been sold for just £1 to restructuring firm Hilco Capital, and Wesfarmers had been left facing a financial hit of about £450 million this year after reducing the presence of homewares and soft furnishings and increasing that of building materials and power tools, in addition to changing the management and importing a mainly Australian team.\nHe said: “What has happened here is an example of huge value destruction and cannot be blamed solely upon challenging trading conditions resulting from the rise of ecommerce, or the economy being affected by concerns about Brexit.” Read More Plans for new retail park at police HQ in Exeter set to be refused\nThe chain, which was once the UK’s second-largest DIY retailer, is currently closing stores after being saved from going into administration after a deal with its landlords and creditors.\nHomebase has other outlets in Devon including Marsh Mills in Plymouth, Barnstaple, Bodmin, Honiton, Newton Abbot, Tiverton and Truro. However none of these stores have been earmarked for closure.\nBranches in Poole, Salisbury and Swindon, are among those that will close in late 2018 and early 2019. In addition, the units in Bournemouth and Swansea will see the landlords facing a 90% cut in the rent.\nOverall the CVA (Company Voluntary Arrangement) will result in an estimated 1,500 redundancies around the country. Read More", "external_links": ["https://www.pkf-francisclark.co.uk/", "https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-10-02T14:21:00.000+03:00", "crawled": "2018-10-02T15:11:30.002+03:00", "highlightTitle": ""}