{"organizations": [], "uuid": "768cdf248b626d9a39516165fb7ed1f130ef1584", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15224509.ece/ALTERNATES/s1200/0_DQP_BEM_011018TORY_29JPG.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/prime-minister-theresa-may-chequers-15222571", "country": "GB", "domain_rank": 21960, "title": "Prime Minister Theresa May: Why 'Chequers' EU deal can protect carmakers such as Nissan", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-02T07:00:00.000+03:00", "replies_count": 0, "uuid": "768cdf248b626d9a39516165fb7ed1f130ef1584"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/prime-minister-theresa-may-chequers-15222571", "ord_in_thread": 0, "title": "Prime Minister Theresa May: Why 'Chequers' EU deal can protect carmakers such as Nissan", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "boris johnson", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}], "organizations": [{"name": "nissan", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "birmingham mail", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nPrime Minister Theresa May has insisted that only her proposed “Chequers” EU deal can protect the car industry.\nAnd she said a Canada-style trade deal, such as the one proposed by Tory rival Boris Johnson, would not deal with the concerns raised by carmakers such as Nissan.\nThey have warned that they depend on “frictionless” trade with the EU, which means parts must be imported into the UK without delays at borders to prevent factories grinding to a halt.\nSpeaking exclusively to ChronicleLive at the Conservative conference in Birmingham , Mrs May said: “It is a message that has come through loud and clear.” Prime Minister Theresa May has defended her Brexit plans (Image: Birmingham Mail)\nThe manufacturing method used by big carmakers is called “just in time”, because it depends on bringing components into factories just as they are needed.\nMrs May said : “A number of industries, but particularly the automotive industry here in the West Midlands and elsewhere across the country, have been very clear about the importance of ‘just in time’ supply chains for them.\n“The only plan on the table at the moment that has at its core a way of addressing that is the Chequers plan.\n“The only plan on the table at the moment that has that core of a free trade area and frictionless trade is Chequers.”\nHer proposed EU deal is opposed by some critics within the party, and former Foreign Secretary Mr Johnson has called on the UK to ask for a trade deal similar to the one already in place between the EU and Canada. Read More Business Secretary Greg Clark warns Tories must listen to carmakers such as Nissan over Brexit\nBut Mrs May said: “The Canada-style free trade agreement actually introduces regulatory and customs checks at borders, so that doesn’t deal with the issue of taking way that potential friction and enabling that smooth running across the border as happens today.”\nHowever, Mrs May repeated her warnings that she “won’t accept a deal that is a bad deal for the UK” - including the current proposal on offer from the EU.\n“I am not prepared to see our country broken up.\n“And the offer on the table from the EU about a basic trade agreement is one that would only be for Great Britain and it would effectively carve Northern Ireland away from the rest of the UK.”\nMrs May has described an increase in violent crime as “worrying”.\nBut she said police were being given new tools to get crime down, including tougher laws to outlaw knives and other offensive weapons\nNorthumbria Police recorded 38,467 incidents of violent crime in the 12 months up to September 2017 - up 25% compared to the 29,617 incidents recorded a year previously. Prime Minister Theresa May with Philip Hammond, Chancellor of the Exchequer, visiting ADI Group in Kings Norton, Birmingham meeting apprentices (Image: Birmingham Mail)\nSpeaking to ChronicleLive, the Prime Minister said: “Overall crime has come down.\n“But obviously there is this worrying rise we’ve seen in certain areas in relation to violent crime and knife crime in particular.”\nShe said people found guilty of knife offences are now more likely to be prosecuted, and to spend longer in prison.\n“As well as the serious violence strategy, we are introducing the offensive weapons bill, which will increase some of the powers available to police and increase the ability to take action to prevent some of these particularly concerning knives getting into the hands of young people.”\nMrs May insisted police forces were enjoying an increase in funding - despite warnings from police and crime commissioners that they are facing cuts.\nNorthumbria Police and Crime Commissioner Vera Baird has warned that funding cuts could leave the force in “the vulnerable position of not being able to respond to an emergency”.\nFunding from the Home Office was cut for many years and has now been frozen, although forces can raise extra cash by increasing the police precept added to council tax bills. Read More\nMrs May insisted: “What matters to police forces is the total amount of money available to it.\n“Extra money is available to police forces this year.”\nThe Prime Minister said she was “very concerned” about the increase in the number of rough sleepers in many parts of the UK.\nShe highlighted plans announced during the party conference to increase taxes paid by foreigners who buy property in the UK.\n“We have also announced that we are going to be introducing an extra stamp duty charge on foreign buyers of property.\n“The money that is raised from that will be additional money that we will use in dealing with rough sleeping.”\nThere were 51 rough sleepers in the region in 2017, up from 45 in 2016.\nIt means the number of people sleeping in doorways and on pavements has doubled since 2013, when 25 people were recorded sleeping rough. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-10-02T07:00:00.000+03:00", "crawled": "2018-10-02T09:59:30.003+03:00", "highlightTitle": ""}