{"organizations": [], "uuid": "349376a8435316de8b20a25c2aff7aa8c0be259a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15277052.ece/ALTERNATES/s1200/1_Hate-Crime-Prevention.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/ive-been-called-terrorist-hate-15274307", "country": "GB", "domain_rank": 21960, "title": "\"I've been called a terrorist\" - Hate crime victim speaks out at gathering", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-13T18:00:00.000+03:00", "replies_count": 0, "uuid": "349376a8435316de8b20a25c2aff7aa8c0be259a"}, "author": "Lisa Hutchinson", "url": "https://www.chroniclelive.co.uk/news/north-east-news/ive-been-called-terrorist-hate-15274307", "ord_in_thread": 0, "title": "\"I've been called a terrorist\" - Hate crime victim speaks out at gathering", "locations": [], "entities": {"persons": [{"name": "taj khan", "sentiment": "none"}], "locations": [{"name": "metro", "sentiment": "none"}, {"name": "whitley bay", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}], "organizations": [{"name": "metros", "sentiment": "none"}, {"name": "newcastle university", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nAbused and mocked for being a Muslim woman, Taj Khan voiced her views on race crime as she joined others who have been through similar incidents as herself.\nLeft frightened on public transport, she is supporting the campaign to stamp out hate crime on our buses and Metros.\nOn Saturday she was one of dozens of people who joined forces to express their defiant message.\nAnd the group, including representatives from churches, mosques, schools, the Women’s Centre and Newcastle University, met at Monument station in Newcastle - on the first day of Hate Crime Awareness Week.\nThere were speeches about the campaign before they travelled on the Metro to Whitley Bay . Scores of people boarding the Metro at Monument as part of a campaign to prevent hate crime on public transport. (Image: Newcastle Chronicle)\n“It’s a triple whammy for me, I’m a Muslim, a woman and have brown skin,” said Taj, 50, of Arthur’s Hill in Newcastle’s West End.\n“I wear a hijab, I don’t always wear black, I wear bright colours, I’m a happy person, but I've been called a terrorist because of how I dress.\n“I’ve had people call me horrible names and it seems to have got worse since Brexit . I try to avoid using the bus because of what has happened to me,” added mum-of-two Taj.\n“Once the bus was crowded and I wanted to make space for people to sit down.\n“I always carry a large bag and I picked it up and put it on my lap to make space. But someone said I’m not sitting next to a terrorist.\n“When I was on another over crowded bus and I could literally see the hatred on a woman’s face. She stuck her elbow into my ribs. I just ignored her but she had a hatred look and I just shook my head and moved to the front of the bus.\n“Then when I was in my car a group of youths surrounded it and started banging on the bonnet, they ran off when my husband opened the door.\n“You never know what is going to happen to you. Just look at what happened to Jo Cox. It is frightening but hopefully this charter will lead to successful prosecutions and convictions.”\nWife's plea after Durham University student is held in UAE jail for FIVE MONTHS over spying claims\nThe event, organised by Tyne and Wear Citizens, aims to highlight the impact of hate crime. They say many people, specifically Muslim women, were regularly physically and verbally abused on public transport.\nOver the last year, the group has been fighting for action to be taken to improve safety in public spaces and has now welcomed a ‘hate crime charter’ published by transport providers. The charter includes training for bus drivers and a bystander and victim awareness campaign.\nHowever, Tyne and Wear Citizens says more work needs to be done. Scores of people at Grey's Monument before boarding the Metro at Monument as part of a campaign to prevent hate crime on public transport. (Image: Newcastle Chronicle)\nAlong with Citizens UK, they are appealing to the Government to improve hate crime legislation nationally.\nMariam Khan, 26, of Sunderland , told her story in front of more than 1,000 at the Tyne and Wear Citizens’ Launch Assembly in 2017 and has been helping with the charter.\nThe education manager said: “It happened to my sister, who was 18 at the time, and my mum. It was when my sister was starting Sunderland University last year and the pair were coming back on the bus. When they got on a man got off and called them black b ds.\n\"They told the driver and he said ‘what do you want me to do about it?’ And once they were on the bus two guys called them 'p***s' who come across here and take our jobs.\n“My sister was really distraught and was crying.\n“I reported it to the police and they said the bus driver should have stopped the bus and called them. It was quite obvious the bus driver didn’t know what to do and so this charter will tell them what procedures they should take.”\nWe're getting new Metro trains - here are the five companies bidding to build them\nTaj, who is also one of the event organisers with Tyne and Wear Citizens, added: “As a Muslim woman, I feel the current system is failing me and many like myself.\n“There should be no place for hate, but too often it happens in very public places. There must be a change to national hate crime policy to protect Muslims and women better and we urgently need action from local service providers to protect their users, whether it be on a bus, train, metro, supermarket or in a GP surgery.\n“We are pleased transport companies are publishing a hate crime charter and are asking they now do their bit by quickly putting in place more procedures to protect the public. Everyone has a right to feel safe and live without fear.” Taj Khan talks to scores of people at Grey's Monument before boarding the Metro at Monument as part of a campaign to prevent hate crime on public transport. (Image: Newcastle Chronicle)\nDr Helen Jarvis, from Newcastle University , also says more work is needed to help people feel safe.\n“It’s only right that we have non-sexist, non-racist public space and public life,” she added.\n“It frustrates me, as a mother and a teacher, that misogyny and hate incidents restrict women’s use of the public transport by causing anxiety and fear.\n“On campus we have policies that protect students and staff from racist, sexist and religion-based hate crimes. Yet, in most public spaces there is no such protection.\n“It is positive to see transport providers step up and share collective responsibility to challenge this behaviour and we thank them for working with us.”\nThe campaign has received the support of the Rt Rev Christine Hardman, Bishop of Newcastle.\nShe said: “I wholeheartedly support the Tyne and Wear Citizens’ campaign to end hate crime on public transport. It’s so important that all members of our community feel safe and do not have to go in fear when they travel. Scores of people boarding the Metro at Monument as part of a campaign to prevent hate crime on public transport. (Image: Newcastle Chronicle)\n“The meeting on October 13 is a great way to show our commitment to working for a community where everyone feels respected and valued.”\nSneak peek at plans for underground Monument Metro PUB - the first of its kind in the country\nHuw Lewis, Customer Services Director at Nexus , the public body which owns and operates Metro, said: “Public transport is there for everyone, it plays a big role in bringing communities together and no-one should be put off making journeys.\n“While the number of reported hate crimes on Metro is low we know that many people don’t choose to report them. It’s vital that any form of discrimination based on race, religion, sexual orientation or disability is reported to the police so that it can be investigated. Metro serves some very diverse communities and nobody should feel threatened or intimidated when they travel.\n“Hate crime is a problem for society which sometimes spreads to public transport because buses and Metro are part of society. The number of reported incidents is very small but we recognise that when an offence occurs it can have a big impact on the victim.\n“With our staff and passengers we are standing up to the small minority of people who commit hate crime – by raising awareness, training our people, using tools like CCTV and working with community groups and the police. Local transport operators in North East England have brought the good work we do together in one charter that states clearly our ongoing commitment on this issue.” Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-10-13T18:00:00.000+03:00", "crawled": "2018-10-13T18:41:38.040+03:00", "highlightTitle": ""}