{"organizations": [], "uuid": "f27fbc5f19896784ddd9a2903d5fa08716180b2f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15240112.ece/ALTERNATES/s1200/0_Trade-gap.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/brexit-red-tape-causing-concerns-15238115", "country": "GB", "domain_rank": 21960, "title": "Brexit and red tape causing concerns in North East business community, survey finds", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-05T02:01:00.000+03:00", "replies_count": 0, "uuid": "f27fbc5f19896784ddd9a2903d5fa08716180b2f"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/brexit-red-tape-causing-concerns-15238115", "ord_in_thread": 0, "title": "Brexit and red tape causing concerns in North East business community, survey finds", "locations": [], "entities": {"persons": [{"name": "john", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "north east england", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "business brexit", "sentiment": "neutral"}, {"name": "north east england chamber of commerce share falling", "sentiment": "none"}, {"name": "north east england chamber of commerce", "sentiment": "none"}, {"name": "chamber of commerce", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Brexit and red tape causing concerns in North East business community, survey finds The biggest independent survey of regional business views has been published by the North East England Chamber of Commerce Share Falling export sales in the North East is a clear demonstration of Brexit (Image: PA) Get business updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nFalling export sales in the North East is a clear demonstration of Brexit and red tape concerns among firms, the region’s largest business organisation has said.\nThe largest independent survey of North East business views shows a continuation of a decline in business growth with a 15% annual fall in export sales growth.\nProduced by North East England Chamber of Commerce, the Quarterly Economic Survey results for the third quarter of 2018 indicate that while firms have continued to invest during this period, lower levels of confidence are having an impact.\nThe report shows a slight fall in plant investment and a much larger decline in spending on training. Job creation has also been pared back since the last quarter. North East England Chamber of Commerce president John McCabe (Image: Handout)\nChamber president John McCabe said: “The feedback gathered from individual businesses for this survey tells us the ongoing uncertainty around Brexit is harming confidence. Government must get serious about delivering a deal that works for our businesses and enables them to grow.\n“If that is achieved, there is no reason that the slowdown we’re seeing cannot be arrested and reversed.\n“We should not be afraid to raise the concerns we hear around Brexit. If those who know best what is involved in producing and selling goods and services across Europe and the rest of the world say they’re worried about the future, then there is a duty among politicians to listen.” Read More Seven North East firms makes list of UK's top companies\nThe survey showed businesses’ confidence in the future is erratic, with scores relating to future turnover and profitability being healthier than last quarter.\nHowever, anonymous individual responses showed that this confidence is predicated on a number of outcomes beyond the control of those firms.\nAmong business concerns, Red Tape has risen to the top of the list, most likely a consequence of the Government’s publication of Brexit no deal technical notices.\nBrexit remained the most frequently mentioned factor hindering business success, chiefly expressed in terms of future market conditions, exchange rates and materials costs. Read More Newcastle Airport soars to 10-year high as passenger numbers top five million\nThe Chamber is also campaigning to raise awareness of mental health issues in the workplace and the survey asked businesses if they provide specific support to senior leaders for mental health.\nLess than a quarter of respondents (23%) replied they provided support and there was a number who were candid about their lack of knowledge of what advice and assistance was available. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-10-05T02:01:00.000+03:00", "crawled": "2018-10-05T04:00:32.002+03:00", "highlightTitle": ""}