{"organizations": [], "uuid": "2baf2259e46d332fadd1dde783a81dc1807752d2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/sport/article2087076.ece/ALTERNATES/s1200/0_SemenyoAntoine.jpg", "site_section": "http://www.westernmorningnews.co.uk/editorschoices.rss", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/sport/manchester-united-eye-bristol-city-2087095", "country": "GB", "title": "Manchester United eye Bristol City striker, David Moyes linked with Preston North End return", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-08T18:09:00.000+03:00", "replies_count": 0, "uuid": "2baf2259e46d332fadd1dde783a81dc1807752d2"}, "author": "Stuart James", "url": "https://www.devonlive.com/sport/manchester-united-eye-bristol-city-2087095", "ord_in_thread": 0, "title": "Manchester United eye Bristol City striker, David Moyes linked with Preston North End return", "locations": [], "entities": {"persons": [{"name": "preston north", "sentiment": "none"}, {"name": "david moyes", "sentiment": "none"}, {"name": "semenyo", "sentiment": "none"}, {"name": "antoine semenyo", "sentiment": "none"}, {"name": "pogba", "sentiment": "none"}, {"name": "alan pardew", "sentiment": "none"}], "locations": [{"name": "exeter city", "sentiment": "none"}, {"name": "newport county", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "bristol city", "sentiment": "none"}], "organizations": [{"name": "preston north end", "sentiment": "none"}, {"name": "manchester united", "sentiment": "none"}, {"name": "bristol city", "sentiment": "none"}, {"name": "liverpool", "sentiment": "none"}, {"name": "united", "sentiment": "none"}, {"name": "chelsea", "sentiment": "none"}, {"name": "cambridge united", "sentiment": "none"}, {"name": "efl", "sentiment": "none"}, {"name": "premier league", "sentiment": "none"}, {"name": "tottenham", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Manchester United eye Bristol City striker, David Moyes linked with Preston North End return All the latest news from the EFL Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nManchester United are monitoring the progress of Bristol City starlet Antoine Semenyo, according to TeamTalk.\nThe 18-year-old striker is currently on loan at League Two side Newport County, where he has scored twice in 12 appearances.\nThe report claims that a United scout watched Semenyo in action last month and were so impressed with his performance that they will continue to monitor his progress.\nSemenyo's two goals this season came against Chelsea's Under-21 side in the Checkatrade Trophy and then Cambridge United in the EFL Carabao Cup. Read More Liverpool star wanted by Leicester, Pogba WON'T be sold in January, Tottenham midfielder to leave for free Alan Pardew said Exeter City played well in the second-half (Image: Pinnacle)\nWhat does a former Premier League manager, an ex-England international and the owner of a Championship football club have in common?\nNo, it's not the start of some crass joke, but they are in fact all people that have donated at least £1,000 towards the funding of coaches to take people to London for a protest against Brexit on October 20.\nThe 'People's March' will take place in the capital on that day and it has emerged that several people with connections to the beautiful game have pledged a donation towards the march.\nFormer Premier League manager Alan Pardew is one person named, along with former Liverpool defender - and now Sky Sports pundit - Jamie Carragher.\nRichard Keys, the famed sports presenter, is another and so is Delia Smith, the owner of Championship side Norwich City.\nThe march is free to attend, but celebrities are paying for coach travel for people from their area to get down to London.\nThe money donated by Pardew, who was sacked by West Brom after just four months in charge last season, is going towards travel for the people of Chichester, according to the Express & Star.\nPreston North End ended their wait for a victory this season with an emphatic 4-0 thrashing of Wigan Athletic, but it may not be enough to keep Alex Neil in a job.\nReports are emerging that the Scot is in danger of losing his job with the Lillywhites lining up David Moyes for a sensational return to Deepdale.\nMoyes joined Preston as a player in 1993 and ended his playing days there before going into coaching. He then took over as manager in 1998 before leaving in 2002 to take the reins at Everton after much success with North End.\nHowever he is far from on his own on chairman Peter Ridsdale’s shortlist of potential successors to Neil, according to TeamTalk .\nLincoln City’s successful Cowley brothers, Danny and Nicky, who have guided the Imps from the National League Premier to the top of League Two, are also in the frame, although the manner of Saturday’s win could be a reprieve for the under-pressure former Norwich boss Neil.\nLeague Two strugglers Macclesfield Town have parted company with manager Mark Yates following their dreadful start to the League Two season.\nSince winning promotion as champions of the National League, Macc have struggled to make the step up and are winless in their opening 12 league games of the season.\nYates, 48, was only appointed in the summer after John Askey left to join Shrewsbury Town, but the Silkmen have decided to go in a different direction and expressed their sadness at his departure in a brief statement released today.\nManchester United want £55m Mats Hummels, Leicester target £15m Liverpool defender\n\"Mark was brought in to the club during the summer and despite a plethora [of] injuries to deal with, as well as an enormous amount of bad luck on occasions, fought gallantly in a bid to lift our league position to where we all want it to be,\" the statement read.\nYates did guide Macclesfield to the third round of the League Cup for the first time in their history, but they were humbled 8-0 by rampant West Ham United at the London Stadium. Like us on Facebook ", "external_links": ["https://www.plymouthherald.co.uk/sport/manchester-united-want-mats-hummels-2084220", "https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}", "https://www.expressandstar.com/sport/football/west-bromwich-albion/2018/10/08/alan-pardew-paying-to-help-people-attend-brexit-protest-march/", "https://www.teamtalk.com/news/exclusive-preston-target-trio-as-potential-alex-neil-replacements"], "published": "2018-10-08T18:09:00.000+03:00", "crawled": "2018-10-08T18:37:41.013+03:00", "highlightTitle": ""}