{"organizations": [], "uuid": "50d6d6b06d59c691906b0d6e1a116b651291200b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article6242098.ece/ALTERNATES/s1200/1_Wagamama_01.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15346627", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Frankie & Benny's owner to gobble up Wagamama", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-10-30T10:00:00.000+02:00", "replies_count": 0, "uuid": "50d6d6b06d59c691906b0d6e1a116b651291200b"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15346627", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Frankie & Benny's owner to gobble up Wagamama", "locations": [], "entities": {"persons": [{"name": "frankie", "sentiment": "negative"}, {"name": "benny", "sentiment": "negative"}, {"name": "parsons", "sentiment": "negative"}, {"name": "ean parsons", "sentiment": "none"}], "locations": [{"name": "sedgefield", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "wagamama jonathon manning shipping", "sentiment": "negative"}, {"name": "parsons containers", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning Virgin Media comes out worst for broadband problems in Which? survey\nVirgin Media has been named as the broadband provider customers are most likely to experience problems with, according to a Which? survey.\nThe survey cites price increases and router issues as the most complained about problems, while some customers complained they had been left without internet connection for hours or days.\nSlow speeds and connection dropouts were also listed among the grievances.\nSeven in 10 customers said they had experienced problems with Virgin Media’s broadband over the last 12 months. 64% of customers experienced problems at TalkTalk, 63% at Sky, and 62% at BT.\nZen was the least complained about service but was still complained about by a third of customers.\nAlex Neill, managing director of Which? home services, said:\nYear after year customers tell how us how they are suffering with shoddy broadband services, with problems ranging from very slow speeds to price hikes and connection dropouts.\nTo make matters worse, it’s more than likely that anyone who’s been with their provider for 18 months or more is grossly overpaying for their broadband. A sign outside a Virgin Media shop (Image: PA) 9:08 Jonathon Manning Reckitt Benckiser suffers a £70m sales hit\nHousehold goods giant Reckitt Benckiser has suffered a £70m sales hit in the third quarter due to disruptions at one of its European baby formula factories.\nThe company said the disrupution affected sales to a number of markets during a period of unusually high market growth and before its new facilities in Australia we fully launched.\nIt said the issues have now been resulved and supply was restored before the end of the quarter. However, the firm added that it expected “some residual impact” in the fourth quarter and into 2019.\nRakesh Kapoor, chief executive of Reckitt, said:\nThe quarter was impacted by a temporary manufacturing disruption at our European IFCN (infant nutrition) plant.\nThis affected sales to a number of markets, occurred during a period of unusually high market growth and before our new facilities in Australia were operational and able to diversify our supply chain.\nWe have sufficient momentum and progress in our business to absorb this temporary manufacturing disruption.\nWe therefore reiterate our 2018 target of +14% to 15% total net revenue growth at constant rates. Reckitt Benckiser KEY EVENT WH Smith snaps up InMotion to boost its airport arm\nWH Smith has struck a deal that will see it double the size of its international travel business.\nThe firm has agreed to buy US digital accessories retailer InMotion for $198m (£155m).\nInMotion is the largest airport-based digital accessories retailer in North America. It emplys 750 staff across 114 stores and 43 airports.\nThe firm specialises in accessories such as headphones, phone chargers, and GoPro cameras.\nWH Smith will use the deal to expand its retail base internationally, while also looking to grow InMotion outside of the US,\nGroup chief executive Stephen Clarke said:\nThe acquisition of InMotion is an exciting value creation opportunity for the WH Smith group and marks a major step in our international travel retail growth strategy.\nIn addition, InMotion provides us with a scalable platform to launch the WH Smith airport format into the US, the world’s largest travel retail market for news, books and convenience products.\nFinally, building on our recent successes in the digital accessories category in the UK and on InMotion’s supplier relationships and experience, we see significant potential to accelerate growth outside of the US using the InMotion format.\nThe deal comes weeks after WH Smith launched a restructure to shut a handful of UK highs street stores . A WH Smith store (Image: PA) 8:49 Jonathon Manning Shipping container company Parsons prepares for growth with £825,000 funding boost\nA growing North East shipping container company is gearing up for significant expansion following an £825,000 private equity funding boost.\nParsons Containers was established 18 years ago in Sedgefield, County Durham, by Ean Parsons, who sought to capitalise on his experience in the container business in supplying containers for shipping, freight, storage and accommodation.\nThe company is now one of the largest UK suppliers of shipping containers for sale and hire, operating on multiple sites with a growing self-storage division.\nThe firm has ambitious plans to grow over the next 12 months, including enhancing its digital presence online and opening four new sites for the self-storage brand, called U Hold the Key.\nUnder the Parsons Containers and ContainerContainer brands, the company supplies shipping containers to industries for shipping and freight and for accommodation and storage, working within the self-storage industry, construction, off-shore, local government, schools and catering sectors.\nParsons’ U Hold the Key brand, meanwhile, supplies container self-storage services for domestic and commercial use at nine UK sites including Newcastle, Gateshead, Sunderland, Bishop Auckland, Darlington, Stockton, Middlesbrough and Ferryhill.\nThose plans will be put into action after Maven Capital Partners, through its management of the Finance Durham and North East Development Capital Fund, supported by the European Regional Development Fund, provided £825,000 of funding.\nThe funds have invested £500,000 and £325,000 respectively.\nEan Parsons, managing director of Parson Containers, said:\nWe are proud to be a North East business, rooted in County Durham and with a loyal and skilled local workforce.\nWith that platform, we have established a growing national customer base and a strong demand for our products and services.\nI am pleased Maven is demonstrating confidence in the business with this investment.\nIt will enable us to take advantage of existing opportunities and I am sure we will repay this faith by strengthening our business in Durham and the North East. Left to right: Ean Parsons of Parsons Containers, Angus Allan of Clive Owen, Cllr Simon Henig and Sarah Slaven of Durham County Council, Vivienne Parsons of Parsons Containers and Michael Vassallo of Maven (Image: Keith Taylor (Cameracraft)) 8:42 Report proposes increase in offshore drilling\nA new report has set out recommendations for the development of North Sea oil wells.\nThe Oil and Gas Authority (OGA) has called for the industry to work together to increase “cost effective” drilling activity in the UK Continental Shelf.\nIt also proposes reductions in the cost of abandoning existing wells to “maximise reserves” and “sustain production”.\nThe OGA’s first Wells Insight report notes more than 7,800 wells have been drilled in the UKCS to date, producing over 44 billion barrels of oil equivalent (boe).It also found signs of an upturn in new-well activity and said there is still significant potential in the remaining resources in the area.However, it also concluded the drilling of exploration wells has declined steadily over the last decade and that development drilling has fallen 50% from 2015 to 2017.\nCommenting on the findings Gunther Newcombe, OGA director of operations, said:\nThere are many examples in the report of industry delivering performance improvements and undertaking innovative approaches to well management plus there is also an indication of an upturn in new well activity, all of which are positive indicators.\nHowever, there is also a need for a concerted effort by industry to substantially increase cost effective drilling activity, improve the management of existing well stock and reduce well abandonment costs to maximise reserves, sustain production and minimise decommissioning costs.\nThis can be achieved by leveraging lessons learned, exploiting technology and working collaboratively with the supply chain to achieve transformational performance gains. An oil rig in the North Sea (Image: PA) 8:37 Jonathon Manning BP sees profits surge on high oil prices\nBP saw its profits more than double in the third quarter of the years after riding the wave of higher oil prices.\nThe energy giant said underlying replacement cost profit - the market’s preferred measure - rose to $3.8bn (£2.9bn) over the three-month period, up from $1.86bn (£1.4bn) in the same quarter last year.\nOil and gas production during the third quarter averaged 3.6 million barrels of oil per day.\nRevenue also rose to $80.8bn.\nChief executive Bob Dudley said:\nOur focus on safe and reliable operations and delivering our strategy is driving strong earnings and growing cash flow.\nOperations are running well across BP and we’re bringing new, higher-margin barrels into production faster through efficient project execution. BP boss Bob Dudley (Image: Dominic Lipinski/PA Wire) 8:30 KEY EVENT 'More treats than tricks' - business leaders hail Budget for helping small firms and the high street\nBusiness leaders and industry organisations have hailed the Chancellor’s moves to support small businesses and help the high street in a budget which delivered “more treats than tricks” - yet some claimed it fails to address the needs of Brexit.\nIn his 2018 Budget, Philip Hammond announced a new Digital Services Tax, to ensure global, tech giants “pay their fair share towards supporting our public services”, while also announcing business rates bills will be cut by a third for firms with a rateable value less than £51,000.\nOther measures included a £675m package of support unveiled in co-funding for a Future High Streets Fund, to help authorities transform town centres, a reduction in the amount small firms pay towards the apprenticeship levy, from 10% to 5%.\nSuch measures, the CBI said, showed this was a solid budget – but that the Chancellor could have gone further still.\nCarolyn Fairbairn, CBI director-general, said:\nThis was a rock-solid budget, bringing more treats than tricks for business. It recognises the enormous contribution enterprise has made to balancing the UK’s books through jobs, pay and tax and responds to many of the recommendations that firms have made.\nBut while the Chancellor has reduced some of biggest barriers to growth, he has missed some opportunities.\nThat said, the new investment in broadband, research, housing and infrastructure will help tackle the UK’s glaring regional equalities head on.\nOngoing reform of the apprenticeship levy and collaboration with business on retraining reflects long-standing business advice and will help individuals adapt to a fast-changing world of work.\nKelly Green, regional director for the North East, Lloyds Bank Commercial Banking, agreed, saying:\nThe Chancellor’s decision to cut business rates for smaller high street operators by a third will be welcomed by many our region’s SME retailers.\nLocal commercial centres such as Newcastle have been hit by a string of recent store closures, and savings here will not only support the day-to-day cost of doing business but could also free-up cash flow for investment in developing crucial skills and tackling low productivity – both ongoing challenges for businesses in the North East.\nMeanwhile, the Government’s £30bn investment pledge on road infrastructure and its £37m commitment to Northern Powerhouse Rail will also be well received locally.\nWhen we spoke to business leaders in the run-up to the Budget, one in 10 told us they wanted the Chancellor to prioritise transport infrastructure spending today. They’ll hope that increased spending in this area will enhance connectivity, in turn helping to fuel growth and enhance prosperity.\nRead more responses here . Carolyn Fairbairn, CBI director-general (Image: Newcastle Chronicle) 8:23 Jonathon Manning Hope for North East retailers as insolvency risk plateaus ahead of Christmas shopping period\nNorth East retail firms have been given hope ahead of the Christmas shopping period amid testing times on the high street.\nNew research has found that the proportion of regional retailers with a higher than normal risk of insolvency has steadied in the third quarter of the year.\nAfter increasing significantly from 31% at the end of 2017 to 40% in June, the latest data from insolvency and restructuring trade body R3 has shown that it had risen by just a single further percentage point by September, and that it actually dropped marginally during that month.\nDespite ongoing difficulties affecting the high street, the R3 research also revealed a net increase of 80 retail businesses across the North East over the same three month period.\nThe North East retail sector, along with the region’s professional services sector, is one of just two of the 11 key industries that R3 monitors which currently has a larger proportion of companies at higher than normal risk of insolvency when compared with the national average.\nR3’s insolvency risk tracker is compiled using Bureau van Dijk’s ‘Fame’ database and measures companies’ balances sheets, director track records and other information to work out their likelihood of survival over the next 12 months.\nAndrew Haslam, chair of R3 in the North East and head of specialist business advisory firm FRP Advisory LLP’s Newcastle office, said:\nThe final quarter of the year is the most important and potentially lucrative period for retail businesses, and while no one is suggesting that things will be easy in the run-up to Christmas, our retailers will doubtless take any positive news that they can get.\nEven though a number of well-known firms have disappeared from the High Street in recent months, along with many other less high-profile retailers, the overall increase in the number of active North East retail businesses shows there are still entrepreneurs out there who believe in the concepts that they’re bringing to market.\nThe region’s leisure industries are continuing to lead the way, and it’s reasonable to expect, with the party season about to get into full swing, that the North East’s pubs and restaurants can expect a boost to their turnovers.\nAs we’re sadly continuing to see, operational problems can hit any firm at any time, no matter how new or well established they are, and owner/managers need to be ready to act fast to give themselves the widest range of options for putting things back on an even keel. It's possible to get 11 days off at Christmas using just four days of holiday (Image: Newcastle Chronicle) 8:17", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/15346627;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-10-30T10:00:00.000+02:00", "crawled": "2018-10-30T11:02:57.000+02:00", "highlightTitle": ""}