{"organizations": [], "uuid": "1974fd7505dd4d5210632591a536c610d145c6cc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13929227.ece/ALTERNATES/s1200/SGP_NEC_201117BIZ01JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-firm-announces-ireland-13929140", "country": "GB", "domain_rank": 21960, "title": "North East firm announces Ireland move following EU referendum vote", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-20T19:00:00.000+02:00", "replies_count": 0, "uuid": "1974fd7505dd4d5210632591a536c610d145c6cc"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-firm-announces-ireland-13929140", "ord_in_thread": 0, "title": "North East firm announces Ireland move following EU referendum vote", "locations": [], "entities": {"persons": [{"name": "chris owen", "sentiment": "none"}, {"name": "michel barnier", "sentiment": "none"}], "locations": [{"name": "ireland", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "dublin", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "newcastle quayside", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "sunderland ma", "sentiment": "negative"}, {"name": "north p&i group", "sentiment": "none"}, {"name": "north p&i", "sentiment": "none"}, {"name": "sunderland marine", "sentiment": "none"}, {"name": "north of england p&i association ltd", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "newcastle quayside", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business North East firm announces Ireland move following EU referendum vote North and Sunderland Marine say they need to open in Ireland to make sure they have access to EU markets Share The North of England P&I association Ltd, Newcastle Quayside (Image: Newcastle Chronicle) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nOne of the world’s largest marine insurance groups - based in the North East - is opening a base in Ireland to ensure continued access to EU markets following the Brexit vote. \nNorth and Sunderland Marine – the marine insurance businesses which came together to form North P&I Group two years ago – collectively employ around 300 people on Newcastle Quayside and are the region’s longest-established firms in their sector. \nTheir merger in 2015 also formed the biggest global firm of its kind, with Sunderland Marine focusing on insuring large ships such as freighters and North carving a niche in commercial vessels, operating in markets across the globe. \nNow, in direct response to the UK referendum on membership of the EU in June 2016, the firm’s directors have revealed they have been developing contingency plans to make sure that both companies continue to have access to EU markets, resulting in the creation of a Dublin subsidiary. \nThe firms currently rely on EU passporting rights to insure risks in the European Economic Area (EEA) and details of the future UK/EU trading relationship and its implementation are still unknown. \nHowever, the insurers said they ultimately expect to lose existing passporting rights when the UK’s EU membership comes to an end, or when the end of any agreed transition period finishes. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nIn a statement, the group said: “Due to the ongoing uncertainty surrounding the future regulatory landscape, and a realistic prospect that passporting rights could be lost as early as March 29 2019 on expiry of the current two year Article 50 notice period, it was agreed at a meeting of the North board of directors on November 8 that a subsidiary insurance company should be established in Ireland to underwrite all future EEA business of North and Sunderland Marine with effect from 20 February 2019. \n“The structure and local operations of the Irish subsidiary are subject to on-going investigation and a future announcement will be made in respect of these issues during implementation phase of our contingency plans, which is expected to commence during the first quarter of 2018.” \nNorth’s statement came as EU negotiator Michel Barnier said that Britain would lose its passporting arrangements as a result of Brexit. \nThe insurers said they chose Dublin from a number of possible locations for a raft of reasons, including the regulatory, legal and taxation framework in Ireland which is similar to the UK. \nEasy travel connections with Newcastle, the ability to conduct business in English and Dublin’s strong talent pool within the financial services sector were also deciding factors. Read More Cutting-edge Northumberland cancer treatment centre to be delivered by two Newcastle firms \nAt the moment, the firm doesn’t believe jobs in Newcastle will be impacted by the decision. \nChris Owen, group general counsel at North P&I, said: “The headcount in Ireland could be around six or seven – this is only an early indication and is subject to change. \n“The roles in Ireland will primarily be needed to deal with the additional work created by having a separately regulated entity in Ireland. \n“As such we do not anticipate a reduction in our headcount in Newcastle but roles and responsibilities in Newcastle with regard to EU business may need to be adjusted as a result of the new arrangements. \n“The headcount in Ireland includes support staff, as well as an existing member of Sunderland Marine staff who is already based in Dublin.” Like us on Facebook", "external_links": [], "published": "2017-11-20T19:00:00.000+02:00", "crawled": "2017-11-20T19:39:19.032+02:00", "highlightTitle": ""}