{"organizations": [], "uuid": "9e9c3f01304af404c551ee93db8be1435dfe94e1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13329406.ece/ALTERNATES/s1200/Theresa-May-interview.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/theresas-prepares-eight-days-trench-13886607", "country": "GB", "domain_rank": 21960, "title": "Theresa May prepares for eight days of trench warfare over Brexit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-11T07:00:00.000+02:00", "replies_count": 0, "uuid": "9e9c3f01304af404c551ee93db8be1435dfe94e1"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/theresas-prepares-eight-days-trench-13886607", "ord_in_thread": 0, "title": "Theresa May prepares for eight days of trench warfare over Brexit", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "brexit", "sentiment": "negative"}, {"name": "ken clarke", "sentiment": "none"}, {"name": "nicky soubry", "sentiment": "none"}, {"name": "catherine mckinnell", "sentiment": "none"}, {"name": "david davis", "sentiment": "none"}, {"name": "nick brown", "sentiment": "none"}, {"name": "michel barnier", "sentiment": "none"}, {"name": "davis", "sentiment": "none"}, {"name": "dominic grieve", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "nick ansell/pa wire", "sentiment": "none"}, {"name": "nicky morgan", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "bill", "sentiment": "none"}, {"name": "john bercow", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "westminster", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "united kingdom flag", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "newcastle east", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "brexit news theresa", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "newcastle north", "sentiment": "none"}, {"name": "european union flag", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "committee", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "houses of parliament", "sentiment": "none"}, {"name": "cancel play", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Theresa May prepares for eight days of trench warfare over Brexit Some MPs hope to stop Brexit going ahead unless they have approved a proposed 'deal' with the European Union Share Prime Minister Theresa May (Image: PA) Share Get daily updates   \nEight days of battle over Brexit begins at Westminster on Tuesday, as MPs debate the Government’s European Union (Withdrawal) Bill. \nPrime Minister Theresa May wants to use the Bill to carve in stone the United Kingdom’s plan to leave the European Union in March 2019. \nThe Government will add a clause to the Bill stating that “exit day” is fixed at 29 March 2019, at 11pm. \nIt will make it clear that Parliament has approved the Government’s plan to quit the EU on that day, regardless of whether a deal has been reached with the European Union. \nBut opposition parties and backbench MPs have tabled hundreds of amendments, many of them designed to tie the Government’s hands in some way. \nThese will be debated over two days next week, in what is known as the Committee Stage of the Bill. \nDebate will continue in future weeks, with the Committee stage set to last eight days in total. Newcastle North, Labour MP Catherine McKinnell (Image: Newcastle Chronicle) \nNewcastle North MP Catherine McKinnell has put her name to 99 amendments. \nOne of these is designed to ensure that the United Kingdom does not exit the European Union unless and until a new Treaty establishing a future relationship between the UK and EU has been agreed and ratified by Parliament. \nThat would not only prevent Brexit taking place unless a deal is agreed - it would also give Parliament the option of blocking Brexit if it doesn’t approve of the deal. \nA similar amendment has been proposed by the Labour front bench, including party leader Jeremy Corbyn and Chief Whip Nick Brown, MP for Newcastle East. \nIt would mean that the Government cannot name an “exit day” until the terms of the United Kingdom’s withdrawal from the European Union,have been approved by both Houses of Parliament. \nOne key difference though is that the Labour leadership’s amendment leaves open the option of qutting the EU without any deal at all, if Parliament agrees to doing that. The European Union Flag and United Kingdom Flag intertwined (Image: Getty Images Europe) \nMost of the official Labour amendments focus on ensuring existing EU legislation on issues such as employment rights and air quality remain in force even after the UK leaves the EU. \nThe European Union (Withdrawal) Bill is already designed write these measures into UK law so that they remain in force, but opposition MPs say the legislation currently makes it too easy for Ministers to repeal or significantly change the regulations. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nPerhaps the biggest headache for Mrs May will be a cross-party attempt led by Conservative MPs to block Brexit unless a final deal is approved by Parliament. \nThis amendment is backed by Conservative MPs including Dominic Grieve, former Chancellor Ken Clarke, former Education Secretary Nicky Morgan and high-profile Tory backbencher Nicky Soubry. It’s also backed by a number of Labour and Lib Dem MPs. \nIn practice, the only way any of these amendments could be approved is if the different factions in the Commons are willing to work together. The question might be whether Tory rebels can bring themselves to support an amendment proposed by Mr Corbyn - even if it’s very similar to one they’ve drawn up themselves. Education secretary Nicky Morgan (Image: Nick Ansell/PA Wire) \nIt also remains to be seen which amendments will be chosen by Speaker John Bercow to be debated. There won’t be time to discuss them all. \nAnd if the Government’s own amendment is added to the Bill, putting a firm time and date for Brexit into law, then many of the opposition and backbench amendments become irrelevant, as it would make it clear Ministers don’t need any further permission from Parliament to press ahead with Brexit. \nAttempts to agree a deal have made “some progress” but more work is needed on specific issues, the EU’s chief negotiator has said. \nFollowing the latest round of talks in Brussels, Michel Barnier said they still had to see “sufficient progress” on the arrangements for Britain’s withdrawal before they could move to the second phase of negotiations. \n“We are not asking the UK for concessions, nor are we planning to make any concessions ourselves,” he told a joint news conference with Brexit Secretary David Davis. \nMr Davis said the negotiations had narrowed to “a few outstanding - albeit important - issues”. \nHe said: “We need to see flexibility, imagination and willingness to make progress on both sides if these negotiations are to succeed and we are able to realise our new deep and special partnership.” Like us on Facebook", "external_links": [], "published": "2017-11-11T07:00:00.000+02:00", "crawled": "2017-11-11T12:30:46.000+02:00", "highlightTitle": ""}