{"organizations": [], "uuid": "500619654a52f617f8ef4ddda992237d2c760b31", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article766477.ece/ALTERNATES/s1200/RonSheppard5JPG.jpg", "site_section": "", "section_title": "", "url": "http://www.devonlive.com/news/devon-news/heartbreak-ron-ninth-bride-runs-766488", "country": "US", "title": "Heartbreak for Ron as his ninth bride runs off with another man - Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "", "spam_score": 0.538, "site_type": "news", "published": "2017-11-13T10:40:00.000+02:00", "replies_count": 0, "uuid": "500619654a52f617f8ef4ddda992237d2c760b31"}, "author": "Adam Aspinall", "url": "http://www.devonlive.com/news/devon-news/heartbreak-ron-ninth-bride-runs-766488", "ord_in_thread": 0, "title": "Heartbreak for Ron as his ninth bride runs off with another man - Devon Live", "locations": [], "entities": {"persons": [{"name": "ron", "sentiment": "none"}, {"name": "heartbreak", "sentiment": "none"}, {"name": "devon live news heartbreak", "sentiment": "none"}, {"name": "norman wisdom", "sentiment": "none"}, {"name": "cristal", "sentiment": "none"}, {"name": "kathy", "sentiment": "none"}, {"name": "neil shaw", "sentiment": "none"}, {"name": "cristel", "sentiment": "none"}, {"name": "ron shepphard", "sentiment": "none"}, {"name": "shane richie", "sentiment": "none"}, {"name": "weng", "sentiment": "none"}, {"name": "frank spencer", "sentiment": "none"}, {"name": "margaret", "sentiment": "none"}, {"name": "lesley", "sentiment": "none"}, {"name": "cristel lalec", "sentiment": "none"}, {"name": "jeanette", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "lubao", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "philippines", "sentiment": "none"}, {"name": "pampanga", "sentiment": "none"}, {"name": "pontins", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "phillipines", "sentiment": "none"}, {"name": "thailand", "sentiment": "none"}, {"name": "somerset", "sentiment": "none"}], "organizations": [{"name": "border agency", "sentiment": "none"}, {"name": "home office", "sentiment": "none"}, {"name": "the daily mirror", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "invalid email  a westcountry", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Heartbreak for Ron as his ninth bride runs off with another man Ron says he should have known something was wrong when she refused to divorce her other husband and lost her engagement ring Share Neil Shaw Head of Digital 08:40, 13 NOV 2017 Click   Thank you for subscribing!   \nA Westcountry man named the country's most married says he is heartbroken after the Filipino 28 year old he hoped would become his ninth wife ran off with another man. \n69-year-old Ron Shepphard says he should have known it wasn't going to work out with Cristel Lalec when she refused to divorce the man she is already married to in the Phillipines, lost her engagement ring and ignored his Norman Wisdom impressions. \nRon says Cristel, who had moved into his home from the Phillipines, refused to sleep with him because of her stromg Christian values. Cristel had been told by the Home Office she could no longer stay in the UK and would have to return home. \nRon, from Somerset, told The Daily Mirror : “I’m devastated by this, I did everything for that girl and she does a runner, I feel like such a mug.” \nHe added: “We had no love life, nothing whatsoever because she insisted she was a committed Christian and did not believe in sex before marriage. \n“I respected that and hoped at least she would become my carer but she just became more distant. Read More Landlord felt he was 'being burnt al... \n“She hated my Norman Wisdom impressions, she had no idea who he was. She’d just sit there with her earphones in taking selfies and I’d have to shout her name just to get her to look at me.” \nBut he added: “I should have known when she lost her ­engagement ring things were not right. Then she started going out a lot and making new friends. Even after her visa was denied I thought there might be a chance but she just grew so cold and distant. \n“Then, on Saturday, she told me she was going out. She looked at me for a long time and said she was flying home next week and wished me goodbye. \n“I now know she was saying goodbye for ever, I checked her room after she left and realised she had taken all of her luggage. \n“I can’t reach her at all and her she has blocked me on Facebook. \n“A friend has told me she met another man since she has been here and is now with him. I am devastated beyond words. \n“I loved that woman with all my heart. But I thought it was for the best I phoned the police and the Border Agency just in case she was trying to stay illegally.” \nRon met Cristal while living in Thailand with a previous wife but lost contact when that relationship collapsed. \nBut after his marriage to eighth wife Weng started to break down he struck up a friendship with Cristel in 2015. \nRon flew to the Philippines and spent that Christmas with call centre worker Cristel and her family in their rural home in Lubao, Pampanga. \nHe asked the mum-of-one to marry him and she arrived in the country last November. \nRon first tied the knot to Margaret in 1966 and the couple had three children but divorced after two years. \nWife number two was Jeanette in 1973. The marriage lasted a year. Ron wed Lesley in 1976 and they had two boys. He left her five years later and she died in 1996. \nThen came Kathy in 1982. The couple, who had a daughter, worked at Pontins as bluecoats with Shane Richie. Ron married Sue in 1986 and had two boys. She threw him out 11 years later. \nHe then married Usha from Singapore in 1999, and Wan in 2003 and Weng a year later. \nRon has been married for 44 of the past 48 years, the longest lasting 13 years and the shortest just 10 months. \nIn a Mirror interview after he met Cristel, Ron, who suffers from Parkinson’s disease amongst other ailments, said: “This one is real love. This is the last one. I promise.” \nCristel insisted she was not using the sickly pensioner just as a way to get to Britain. \nShe said: “I know what it looks like but I am not here for a ­passport. I am not here to take advantage of Ron.” \nBut despite his heartache, old romantic Ron insisted he has not given up on finding his “forever wife”. \nHe said: “Cristel won’t put me off looking for love. \n“Wife number nine is still out there, I just have to find her. \n“As far as I’m concerned I’m back on the market.“ I’m not going to say I haven’t already had women contacting me, I don’t know what it is about me, women just seem to flock to me. \n“I’m batting them off. I think it could be my natural charm and charisma. I am great at ­impressions, I can do 54 different people like Norman Wisdom and Frank Spencer. \n“Although I’ve got to be honest after all this time I sometimes think women could just be too much trouble. \n“But I am determined to not die alone, I refuse to end up in a home and I will find someone who will loves me for who I am.” \nHe said: “The Tories should get me to negotiate Brexit , after all how many people have had as many divorces as me?” \nCristel was not available for comment. Like us on Facebook", "external_links": [], "published": "2017-11-13T10:40:00.000+02:00", "crawled": "2017-11-13T10:55:34.026+02:00", "highlightTitle": ""}