{"organizations": [], "uuid": "e88169c9afba07408a5aa06ee675bddb7d872d93", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article12983696.ece/ALTERNATES/s1200/JS87999975.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13872693", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Big Banks prepare to 'move jobs abroad' due to Brexit uncertainty", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-08T10:00:00.000+02:00", "replies_count": 0, "uuid": "e88169c9afba07408a5aa06ee675bddb7d872d93"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13872693", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Big Banks prepare to 'move jobs abroad' due to Brexit uncertainty", "locations": [], "entities": {"persons": [{"name": "jonathon manning newcastle", "sentiment": "negative"}, {"name": "john hawksworth", "sentiment": "none"}, {"name": "ross", "sentiment": "none"}, {"name": "wilbur ross", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "financial times", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "corporation of london", "sentiment": "none"}, {"name": "leeds", "sentiment": "none"}, {"name": "jpmorgan chase", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "mcguinness", "sentiment": "none"}, {"name": "goldman sachs", "sentiment": "none"}, {"name": "pwc", "sentiment": "none"}, {"name": "hsbc", "sentiment": "none"}, {"name": "newcastle quayside", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "9:14 FCA launches insurance market probe \nBritain’s financial watchdog has launched an investigation into the £68bn wholesale insurance broking market following “significant changes” in the sector.The Financial Conduct Authority (FCA) said its market study is aimed at ensuring that the sector is functioning correctly and that competition works in the interests of its diverse range of clients.The London insurance market is one of the world leaders for large-scale, complex commercial and specialist risks, the FCA said, controlling more than £68bn in gross written premium.It pointed to significant changes in the wholesale insurance sector which have seen brokers developing new services and business practices.Christopher Woolard, the FCA’s executive director of strategy and competition, said: \nGiven the size of the wholesale insurance sector and the type of large-scale risks it covers, the way it functions can have a wide-ranging impact on the broader economy. \nIf businesses cannot get appropriate cover or pay more for services than they should, it can impact on their ability to operate and grow. \nBrokers play an important part in the wholesale insurance sector, ensuring clients get appropriate coverage at good value. However, following significant changes in the sector, we are looking at the dynamics to ensure competition is working well. 9:05 Jonathon Manning North East universities combine to tackle energy challenge in brand new centre \nThree North East universities and a raft of businesses are to combine their expertise in a new regional research centre , launched to tackle the grand challenge of energy. \nThe North East Centre for Energy Materials will bring together engineers, chemists, biologists and physicists to develop new high performance materials to improve efficiency in energy generation, storage and transmission systems. \nThe centre has been given a £2.25m boost by the Government’s Industrial Strategy Challenge Fund, which will provide funding for 42 months, and more than 20 staff across Newcastle, Northumbria and Durham Universities will be involved. \nAll three universities will provide bases for the centre, each running different projects and contributing their existing strengths. \nThe new centre brings together expertise in tidal and wave energy, solar, batteries, energy storage, biomass, and “smart grids” that are able to manage power simultaneously from all of these different sources. \nNewcastle University’s new £58m Urban Sciences Building at Science Central, will form one base for the centre, with its full scale energy research laboratories including the National Centre for Energy Systems Integration, in which Durham University is a partner. \nThe Durham Energy Institute, part of Durham University, will contribute particularly in the area of solar energy, simulation, and the advanced analytical tools needed to observe how materials behave at the molecular level. \nNorthumbria University will build on researchers’ recent successes in developing sustainable solar paint which could be applied to a wide range of building and automotive surfaces. A key part of the centre will be Northumbria University’s work in reaching out to school students with advanced physics. \nLeader of the project, Professor Ulrich Stimming from Newcastle University, said: \nThere is a lot of work exploring big challenges in our energy system such as how do we reduce our dependence on carbon-based fuel, or build smarter energy networks. \nThis project will address an equally important challenge which is how we work at the atomic and molecular level to make the energy sector more efficient and sustainable. 9:00 Jonathon Manning Bank of England officials hits back over accusations of 'groupthink' among staff \nA Bank of England official has hit back over accusations of groupthink among senior staff, saying that members need to have shared skills and experience in order to follow debate and spot “fatal” flaws.Martin Taylor, an external member of the Bank’s Financial Policy Committee (FPC), said MPs on the Treasury Select Committee (TSC) were “quite reasonably” preoccupied with the risks of groupthink, but cautioned against misinterpreting “unanimity” for a lack of “vigorous debate”. \nIn a prepared speech for the Institure of International Monetary Research, Mr Taylor said: \nGroupthink is not the failure of external members to argue with the Bank staff or stand up to the Governor because they are too idle, too cowardly or too thick. Let me assure you that this is very much not what goes on. \nBut if it did, it would not be groupthink. It would be spinelessness. \nThe former Barclays chief executive said that groupthink resulted from “shared assumptions”, which he admitted “may be closely correlated with the skill, experience and knowledge required to make someone a useful member of the FPC.”However, he stressed that without those shared skills, staff would fail to understand the committee’s work let alone identify its shortcomings. \nHe said: \nA colleague who couldn’t follow the debate would be unlikely to spot a fatal flaw. \nWe are all attached to the idea that diversity in its various manifestations provides one form of immunisation against this condition. It may, and the FPC could do with being more diverse. \nBut in the context of groupthink, the type of diversity needed must balance differences in underlying assumptions with shared skills and experience. The Bank of England (Image: PA) 8:55 KEY EVENT Northern Bear set to reveal increased profits \nNewcastle construction firm Northern Bear has told investors that it will reveal better than expected profits for the six months ending September 2017. \nThe firm, which is based in Prestwick Park, said that its profit growth was fueld by its acquisition of H Peel & Sons Limited earlier in the year. \nIn a trading update the firm said: \nThe Group’s continuing operations have traded strongly over H1 FY18, together with a positive contribution to results from H Peel & Sons Limited following its acquisition on 25 July 2017. \nThe board is delighted to announce that, as a result of improved trading, profit before tax from continuing operations for H1 FY18, prior to the impact of exceptional items and amortisation costs, is expected to exceed both management expectations and excellent prior period results for the six months ended 30 September 2016. \nThe corresponding period last year was considered a very strong set of results and hence we are delighted to be reporting a further improvement in trading performance. Northern Bear's headquarters in Prestwick Park, Newcastle 8:45 Jonathon Manning Sky News could be axed if Fox merger is blocked \nTV channel Sky News could be shut down if 21st Century Fox’s £11.7bn takeover bid for Sky is blocked.The deal is currently being scrutinised by the competition watchdog on the grounds of media plurality and broadcasting standards.Sky said in a submission to the Competition and Markets Authority (CMA) that the anti-trust regulator should not assume “the continued provision” of Sky News. \nSky said: \nThe CMA should not in its assessment simply assume the ‘continued provision of Sky News’ and its current contribution to plurality. \nSky would likely be prompted to review the position in the event that the continued provision of Sky News in its current form unduly impeded merger and/or other corporate opportunities available in relation to Sky’s broader business, such as the transaction (with Fox). Sky HD TV remote control (Image: PA) 8:40 KEY EVENT Want a Lego model of your house? This artist will make one for major backers of his plans \nMajor backers of a proposed North East Lego studio could receive a model of their own home made from the popular mini bricks. \nSteve Mayes has crafted a reputation as a master Lego architect, having displayed impressive small scale models of North East landmarks including St James’ Park, The Angel of the North and the International Centre for Life. \nBut Mr Mayes is now running out of room in his loft, prompting plans to set up his own studio – with help from backers. \nThe Lego artist is asking members of the public to help him raise £3,000 to set up the Brick This Studio in North Shields, North Tyneside, and those who pledge £300 or more can get a Lego building of their choice made by the man himself, including replicas of their own home. \nAs well as needing more room to create his exhibitions, Mr Mayes plans include using the studio to the launch a permanent, free gallery for his existing models. \nHe will also use the new studio to hold workshops for budding Lego architects. \nIn an email sent out to potential backers, Mr Mayes said: \nEarly in 2018 I hope to open a studio in North Shields where I can work. But I would like to do more than that. \nBrick This Studio will be a space where I can exhibit not only my work but that of other Lego artists in the North East and beyond. \nIt will be a space where workshops can be held, and even a Lego architecture club - for young and old alike! It will be somewhere where Lego fans can come to explore ideas with a varied stock of Lego sets and pieces. \nMoney for the Brick This Studio is being raised on crowdfunding website Crowdfunder , and Mr Mayes hopes to raise £3,000 in 40 days. Lego architect Steve Mayes at his home in North Shields (Image: Newcastle Chronicle) 8:35 Jonathon Manning EY and KPMG invest heavily in Newcastle after promoting 43 staff \nTwo of the world’s biggest accountancy firms have invested heavily in the North East after promoting 43 members of staff and hiring 17 new recruits . \nEY kicked off the promotions round after 22 members of staff were offered senior promotions in its Newcastle office. \nThe business’ personal tax services division received the lion’s share of the promotions after gaining 12 new managers. EY’s managed services team gained six new managers while four were added to its audit department. \nEY has grown its Newcastle office by 14% over the last year, bringing its headcount to over 600. \nFellow big four accountancy firm KPMG also promoted 21 of its team to senior positions within its Newcastle office. \nOn top of this the firm hired 17 new members of staff, comprising of graduates and school leavers. The figure also included the firm’s first intake of apprentices into the Newcastle office, with six new starters joining the training scheme. \nDavid Elliott, KPMG’s office senior partner, said: \nI’m delighted that our office has been joined by an impressive intake of recruits as we invest in the best emerging professionals. \nWe believe that recruiting a combination of graduates and apprentices encourages a wide range of people with different skills and experiences to join us – all of which contributes to the diversity of thought we are able to bring to our clients. \nIt’s also vital that we nurture talent, investing in our team at every level. Some of KPMG’s 21 newly promoted professionals, with office senior partner, David Elliott (Image: MIKE SMITH PHOTOGRAPHY LTD) 8:30 Jonathon Manning Wetherspoon toasts increase in sales but costs rise \nJD Wetherspoon has posted rising first-quarter sales but warned that its costs have risen significantly over the last year.The pubs chain said like-for-like sales rose 6.1% in the 13 weeks to October 29, with total sales growing 4.3%.But chairman Tim Martin pointed to increased labour costs, business rates, utilities and sugar taxes weighing on the firm.He said: \nAlthough it is only a short period, the company has had a positive start to the year. \nSales have continued at a slightly higher-than-expected level since we last reported on 15 September. \nCosts, as many pub and restaurant companies have indicated, have been significantly higher than last year, and further increases are expected in areas including labour, business rates, utilities and sugar taxes. \nHowever, the firm anticipates full-year trading to meet expectations and intends to open between 10 and 15 new pubs.Mr Martin, a staunch Brexit backer, also said the “lowest food prices” can be obtained by the UK by avoiding a transitional deal with the EU. \nHe said: \nThis would enable the UK to scrap EU food tariffs, as permitted under World Trade Organisation rules, on food imported from outside the EU. Under WTO rules, tariffs would not then be charged on imports from the EU either. A Wetherspoon sign (Image: PA) 8:25 KEY EVENT Stadium Group to reveal £61m turnover \nNorth East electronic firm Stadium Group is set to revealed an increase of £61m for 2017, an increase of 15%. \nIn a trading update the firm, which previously reported revenues of £53.1m in 2016, said that its turnover figures were in-line with expectations. \nHowever, Stadium did warn that its profit figures were expected to be behind previous expectations. \nIn a trading update the firm said: \nWhilst revenue growth and the development of the forward order book are in-line with expectations for the current year, the board now expects single digit percentage growth in normalised profit before tax, which is below current market expectations. \nThis is primarily due to customer delays into 2018 for certain higher margin Technology Products projects, which had originally been expected to ship before the year end. \nThe widely reported global shortage of certain electronic components, particularly memory, integrated circuitry and passive components, has compounded the situation. \nAs reported at the time of the interim results, this has also contributed to cost pressures and, despite building inventory, it has not proved possible to fully mitigate this. \nThe delayed sales are also expected to increase the firm’s net debt figure. \nStadium added that the company’s order book was very healthy and currently exceeds £32m, which is a new record. \nThe company’s financial results for the year ending December 31 2017 with be published on March 13 2018. Chief executive of Stadium Group, Charlie Peppiatt 8:20", "external_links": [], "published": "2017-11-08T10:00:00.000+02:00", "crawled": "2017-11-08T10:17:00.006+02:00", "highlightTitle": ""}