{"organizations": [], "uuid": "3403664c9ff43d9256b8c55abe94ca623b82ad7e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13959229.ece/ALTERNATES/s1200/CFR_NJL_150515forum_03.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/top-200-example-north-east-13959263", "country": "GB", "domain_rank": 21960, "title": "The Top 200 are the example North East businesses need", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-27T16:14:00.000+02:00", "replies_count": 0, "uuid": "3403664c9ff43d9256b8c55abe94ca623b82ad7e"}, "author": "Angela Upex", "url": "http://www.chroniclelive.co.uk/business/business-news/top-200-example-north-east-13959263", "ord_in_thread": 0, "title": "The Top 200 are the example North East businesses need", "locations": [], "entities": {"persons": [{"name": "nigel mills", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "invalid email", "sentiment": "none"}, {"name": "entrepreneurs forum", "sentiment": "none"}, {"name": "newcastle journal", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The Top 200 are the example North East businesses need Top 200: The North East needs to be more aspirational and self-dependent Share Nigel Mills at the Chairman of the Entrepreneurs’ Forum Share Get business updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nThe Top 200 list is an inspiration to all business people in the North East. \nTheir success demonstrates what can be achieved when our entrepreneurs and leaders work to realise their ambitions. \nOur region is home to many great businesses, large and small, so it is very satisfying so are many doing so well. \nThe Newcastle Journal recently reported that the North East has the lowest number of SME companies of any region in the UK, however it also noted that we have seen the fewest failures of SMEs compared to other areas. This points towards the conclusion that stagnation in numbers can, thanks to an almost Darwinian process of selection, be a strength as well as a weakness for our economy. \nTo put this in perspective, the latest available figures show that in 2016 there were just 200 large firms in the region, large companies being those that employ 250 or more people. Compare this to almost 39,000 SMEs in the North East, it is clear we have a huge amount of potential that can be unlocked. \nWe face significant challenges as a region, some unique to us and dating back years, others new and shared with the rest of the country, such as Brexit, a slowing economy in terms of growth, and political uncertainty. With these challenges in mind, it has never been more important for the North East to celebrate business success, and companies like those in the Top 200 must be used as examples to encourage others to be more aspirational, for their benefit as well of the region as a whole. \nThe Entrepreneurs Forum offers a unique opportunity to entrepreneurs and business owners to meet like-minded individuals who are keen to grow their companies, either through local sales opportunities or further afield nationally or internationally. Whether it is the inspirational power of storytelling or the support of a mentor, someone to advise and guide on your business journey, we are here to help, and we’re ambitious about business growth. Read More Devolution is here: It's time for the business community to get on board \nThe North East needs to be more aspirational and self-dependent if we are to further improve the standard of living of everyone that lives in our great region. \nI call on the entrepreneurs and business leaders who are celebrating their inclusion in the Top 200 list to build on this success and to encourage others to do the same. If they need further inspiration or support there are many appropriate business support groups, such as the Entrepreneurs Forum, which will help them to grow their businesses, and unlock economic and employment growth in the North East. \nBy Nigel Mills at the Chairman of the Entrepreneurs’ Forum", "external_links": [], "published": "2017-11-27T16:14:00.000+02:00", "crawled": "2017-11-27T16:48:28.002+02:00", "highlightTitle": ""}