{"organizations": [], "uuid": "eb2f5b6c317612df856a0081fadb1f9c19105d48", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13844103.ece/ALTERNATES/s1200/TMP_NEC_270417CompanyYearBizAwards30JPG.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/top-exporters-could-line-glory-13843879", "country": "GB", "domain_rank": 21960, "title": "Top exporters could be in line for glory at the North East Business Awards", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-01T17:08:00.000+02:00", "replies_count": 0, "uuid": "eb2f5b6c317612df856a0081fadb1f9c19105d48"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/top-exporters-could-line-glory-13843879", "ord_in_thread": 0, "title": "Top exporters could be in line for glory at the North East Business Awards", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Top exporters could be in line for glory at the North East Business Awards Export Award recognises companies that have made substantial strides in overseas trade Share Winner Export award Simon Farley, left and sponsor James Bryce (Image: newcastle chronicle)   \nThe companies that make the North East one of the UK’s top areas for overseas trading could be in line for recognition at the North East Business Awards. \nThe Export Award, which is currently held by Northumberland company First Square Equipment, recognises companies that have generated substantial and sustained increases in export activity. \nJudges in this category are looking for the level of exports in relation to the size of the company, products or services that have been sold without the benefit of export credits, the barriers that have had to be overcome in overseas trading and the degree to which products or services are new and the markets non-traditional. \nWinners will be announced first in heats in Tyneside and Northumberland; Durham, Sunderland and South Tyneside; and in Teesside. The three winners will then compete for the overall title at the regional finals at Hardwick Hall in County Durham on April 26. \nSponsors for the category include Make It Sunderland , PD Ports and Square One Law. \nA spokesman for Square One said: “Commercial law firm, Square One Law is pleased to support the Export Award which recognises the strength, diversity and significant contributions North East companies make to the regional and UK economy. \n“The North East is the only region in the UK which is a net exporter. It has particular strengths in automotive manufacturing and chemical processing which form the basis of its reputation as a specialist exporter, and represent considerable achievements in terms of attracting outside investment and establishing a strong presence in international markets. \n“However, the region’s exporters are potentially in a vulnerable position as the uncertainty surrounding Brexit continues. This is because North East exports to the EU are linked to complex pan European supply chains and our business community relies on exporting more than 50% of its services to EU member countries. \n“As a direct response, Square One Law recently announced a strategic alliance with Brussels-based EU law practice Kemmlers. The alliance gives clients direct access to European Institutions as well as providing a base to have influence within EU’s trading community.” Read More James Ramsbotham on the awards \nFrans Calje, chief executive Officer of PD Ports, said: “As proud owners of Teesport, one of the UK’s deepest water ports and the beating heart of the Tees Valley, PD Ports is proud to be sponsoring the Export category at the Teesside heat of the North East Business Awards. \n“For exporters within the region and the wider North, Teesport acts as a gateway to global markets and consumers. It is a catalyst for a thriving and sustainable export strategy for a huge range of businesses. \n“The North East – and the Tees region specifically – has a tremendous sense of pride in its export activity, and rightly so. This region is the only one in the UK to consistently achieve a trade surplus, exporting billions of pounds worth more of goods each year than it receives in overseas imports. \n“Having sponsored the Teesside Category in last year’s Export Awards, we at PD Ports know from experience that the standard of entries will be extremely high.” \nA spokesman for Make It Sunderland said: “Make It Sunderland are delighted once again to be part of this year’s North East Business Awards. \n“Sunderland is fast-changing, with more than £1.3bn of regeneration underway right across the city. And following an extensive programme of investment in its port, which this year marks its 300th anniversary, the city’s export credentials are going from strength to strength. \n“The city has a rich heritage in manufacturing and export. Cargo passing through the port is on the rise by 25% and with on-going infrastructure work, teamed with developments such as at the International Advanced Manufacturing Park (IAMP) and the completion of a New Wear Crossing, will all ensure the Port of Sunderland is better connected and facilitated than ever before. \n“The awards represent a fantastic opportunity for companies to showcase their skills and to benchmark and improve, it really is something that fosters healthy competition and best practice among businesses in the region.” ALL YOU NEED TO KNOW North East Business Awards 2018 \nThe awards are in association with NEECC and sponsored by a whole host of companies and organisations. The quality and the blue-chip nature of the sponsors adds to the prestige and gravitas of the awards. For more information and to become a sponsor, contact Sue Coulson, head of regional events, on 0191 201 6072. HOW TO ENTER \nCompanies and organisations can enter a maximum of three separate categories. Entries must relate to activity during 2017. Do you know of a company who deserves an award? Please let us know about them and get in touch with us. \nAwards are open to companies of all sizes and organisations with a significant presence in any of the sub-regions. The closing date for entries is 5pm on Friday 29th December 2017. Nominations can be made online at: www.nebusinessawards.co.uk . Queries can be answered by Sue Coulson, head of regional events, ncjMedia Ltd, Groat Market, Newcastle upon Tyne, NE1 1ED. Tel. 0191 201 6072 or email sue.coulson@trinitymirror.com The Judging \nEach award has a separate judging panel with an appropriate chairperson, nominated by the award sponsor. The decision of each judging panel is final and, while every effort will be made to give feedback to entrants, no specific correspondence will be entered into.", "external_links": [], "published": "2017-11-01T17:08:00.000+02:00", "crawled": "2017-11-01T17:24:13.000+02:00", "highlightTitle": ""}