{"organizations": [], "uuid": "cf532ab17f84b9714ad64e6e7165779e19a67288", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.bristolpost.co.uk/news/uk-world-news/article509686.ece/ALTERNATES/s1200/Theresa-May-Boris-Johnson-David-Davis-politics-the-Government-the-Cabinet.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/news/uk-world-news/britain-thrive-after-brexit-according-770778", "country": "US", "domain_rank": 48128, "title": "Britain will thrive after Brexit according to psychic who predicted Trump's win - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.515, "site_type": "news", "published": "2017-11-13T19:06:00.000+02:00", "replies_count": 0, "uuid": "cf532ab17f84b9714ad64e6e7165779e19a67288"}, "author": "Joshua Taylor", "url": "http://www.leicestermercury.co.uk/news/uk-world-news/britain-thrive-after-brexit-according-770778", "ord_in_thread": 0, "title": "Britain will thrive after Brexit according to psychic who predicted Trump's win - Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "brexit", "sentiment": "negative"}, {"name": "kim jong", "sentiment": "none"}, {"name": "jean-claude juncker", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "harry", "sentiment": "none"}, {"name": "craig hamilton-parker", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "kim jong-un", "sentiment": "none"}, {"name": "melania trump", "sentiment": "none"}, {"name": "donald", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "craig hamilton-parke", "sentiment": "none"}, {"name": "craig", "sentiment": "none"}, {"name": "hamilton-parker", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "naples", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "las vegas", "sentiment": "none"}, {"name": "usa", "sentiment": "none"}, {"name": "mount vesuvius", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "berlin", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "ukraine", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "antarctic", "sentiment": "none"}, {"name": "india", "sentiment": "none"}, {"name": "new zealand", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "denmark", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "caribbean", "sentiment": "none"}, {"name": "east", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "leicester mercury news", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "trump's white house", "sentiment": "none"}, {"name": "nice", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Britain will thrive after Brexit according to psychic who predicted Trump's win Medium predicts a rosy future for the UK but things won't go so well for other parts of the world, says Craig Hamilton-Parke Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nNext year could be a rocky one, according to the psychic who predicted the election of Donald Trump \nIn a blog post detailing predictions for 2018, Craig Hamilton-Parker foretells a terrorist incident on a British motorway, a chemical weapons attack by drones on a European capital and Prince Harry's engagement. \nMr Hamilton-Parker has previously predicted Brexit, Donald's Trump's White House victory and the terror attack in Nice, France, reports the Mirror. \nHe said on his blog: \"2018 will be a year of political turmoil and environmental crisis caused by dramatic and unprecedented weather.\" \nHere are the highlights from the medium and psychic teacher's list... A wild fire burns Environmental predictions Mount Vesuvius in Italy will erupt and Naples will be evacuated. There will be an increase in seismic activity - including places that have been tremor free for 1,000 years - with one very serious earthquake in New Zealand. The southern seas will be impassable in places due to a massive ice shelf breaking from the Antarctic. There will be wild fires in California and Australia, as well as flooding in India and China. There will be record hurricanes in the Caribbean. North Korean leader Kim Jong Un World conflict and terror predictions A trade embargo with North Korea will fail and the US will strike at railway line and bridge to disrupt imports. Kim Jong-un will be deposed by his own people and he will go missing, with some claiming he his living a secret new life in China. A world flu epidemic, possibly linked to biological warfare started by North Korea or a terrorist group. Japan will pay to hire American missile defense services. Ukraine will be accused of the illegal sale of missiles and nuclear technology. Read More Secret message codes young people use that all parents should know A massive Bitcoin fraud will be uncovered and thwarted that funds terrorism and war. A well-known American company will be involved in the scandal. Terrorists will make an airborne chemical weapon gas attack by multiple drones on a European capital city. This could be London or Berlin – or both. A chemical weapon attack on a school will be thwarted at the last minute. Are you going to be better off? Economic predictions An Italian banking crisis will cause chaos and many will lose their homes. The Euro will plummet and towards the end of 2018 and into 2019, there will be riots as the steep economic decline takes hold. The UK and USA will be hit by the weak Euro but their economies will bounce back quickly and the pound and dollar will be seen as safe havens for international money and investment. Denmark and Italy will pull out of the EU as the Euro crashes. President Donald Trump USA predictions An attempt to impeach Donald Trump in mid-2018 will fail and he will become more popular as a result. Trump will initiate a massive trade deal with the UK ahead of Brexit that will shake the EU. The deal will concern arms, high-tech services and the motor industry. The Mexico border wall will not be built. It will instead consist of drones and sensors. The US will lose trade in the East as China and Russia form a military and economic alliance in response to the North Korean crisis and US protectionism. Read More A US warship will be sunk by a mine or terrorist operation. The dollar will take a tumble in February but will recover. Melania Trump and her husband's grandchildren will release a song to help raise funds for charity. US will rent nuclear weapons to Japan. There will be a big fire in Las Vegas. Prime Minister Theresa May \nUK predictions There will be a hard Brexit but, pressed by Germany, Europe will relent at the last moment and allow a trade deal. And Jean-Claude Juncker will lose face and retire. There will be many strikes encouraged on by Jeremy Corbyn, who will lose support from voters. Theresa May will stay in power. The UK will thrive despite a world economic problems. poll loading Do you think Britain will thrive after Brexit? 0+ VOTES SO FAR Yes, I agree with Craig's prediction No, it's going to be a disaster Many high-tech companies will more to Britain. Britain will lead the world in innovation and a new form of energy production will be discovered in 2018. Prince Harry will announce his engagement. A new political party will be formed. There will be a terrorist attack on a British motorway in which a gunman shoots people held up by a deliberate traffic accident. Craig's website is available here. Like us on Facebook ", "external_links": [], "published": "2017-11-13T19:06:00.000+02:00", "crawled": "2017-11-13T22:57:44.004+02:00", "highlightTitle": ""}