{"organizations": [], "uuid": "4844f9993f5a42895a3a58380fb0d7e531817d5f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13858378.ece/ALTERNATES/s1200/theresa-may-john-major.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/how-tory-sleaze-always-downfall-13858380", "country": "GB", "domain_rank": 21960, "title": "How Tory sleaze is always the downfall and the Achilles heel of the party", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-05T10:00:00.000+02:00", "replies_count": 0, "uuid": "4844f9993f5a42895a3a58380fb0d7e531817d5f"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/how-tory-sleaze-always-downfall-13858380", "ord_in_thread": 0, "title": "How Tory sleaze is always the downfall and the Achilles heel of the party", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "News opinion How Tory sleaze is always the downfall and the Achilles heel of the party From Profumo to back to basics and now the latest scandal, sleaze is the Achilles heel of the party Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nWell it was back to basics for Theresa May’s government last week as anyone who remembers John Major’s time in the hot seat will recall. \nMajor was famous at first for perceived dullness when his early life revealed he had run away from the circus to become an accountant (more or less). \nHis grey image was regrettably cast aside with the news he had a fling with Edwina Currie, the thought of which to this day induces a violent body shudder. \nAnd then there was his ill thought out back to basics policy based on good morals and family values in a bid to win over the public. Inevitably, as these were politicians, there quickly followed a succession of scandals, mainly extra marital affairs. \nIt was all following a historic trend. While it’s an inability to control public finances that seems to do for Labour, it’s always sleaze that does for the Tories . (Remember the Profumo scandal). \nWhile Major was finally ousted in 1997, if could at last do for May 20 years later. Read More Who will last longest - Theresa May or Jeremy Corbyn? \nFor a time it seemed that despite mismanaging the economy, Brexit negotiations, a general election and even her own party, May might get away with it and remain ar no 10 until 2022. \nThen last week came the spreadsheet with the names of Tory MPs and allegations of sexual harassment and misconduct. \nIt briefly describes some as having affairs, being “inappropriate” with female and male staff or in other cases as “handsy in taxis”. There’s talk of Non Disclosure Agreements, women being ‘impregnated’ and some other revelations best skated over for those with a weak stomach. Theresa May and John Major \nSome allegations, if true, could end a political career, and this means by-elections, bad news for a minority government propped up by a £1bn deal with the DUP. \nNo doubt there’s now a lot of scrambling to find out if Labour MPs have transgressed and if so how many. Names are already beginning to appear. But there’s a lot of catching up to do. \nThe file had 40 names of Tory MPs on it, including around 15 ministers of various ranks. \nAfter stories of sexual harassment emerged at the beginning of the week Leader of the House of Common as Andrea Leadsom spoke earnestly to Parliament telling it the public expects the highest standards from their MPs. Read More Vince Cable admits Westminster abuse scandal is 'dark moment' for politics during Newcastle visit \nFrom outside the Commons a roar of laughter could be heard the length and breadth of the land. Let’s face it, MPs and high standards parted company a while back in the public mind’s eye. \nThe only surprise about this latest scandal was the list of MPs ensnared existed in hard copy form. Who on earth writes something like that out? In a spreadsheet? At a time when internet hacking has never been so sophisticated. It’s like having the word ‘password’ as your computer password. \nIf they are so inept at keeping their own dirty laundry under wraps, what confidence can we have in them running the country? Like us on Facebook", "external_links": [], "published": "2017-11-05T10:00:00.000+02:00", "crawled": "2017-11-05T11:11:03.005+02:00", "highlightTitle": ""}