{"organizations": [], "uuid": "af9e99bbc237d767cdb170227e0ae826408efe5d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13972910.ece/ALTERNATES/s1200/emma.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/heartbreaking-case-mum-four-children-13972855", "country": "GB", "domain_rank": 21960, "title": "Heartbreaking case of mum with four children who had no food and no money to get to a foodbank", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-30T07:00:00.000+02:00", "replies_count": 0, "uuid": "af9e99bbc237d767cdb170227e0ae826408efe5d"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/heartbreaking-case-mum-four-children-13972855", "ord_in_thread": 0, "title": "Heartbreaking case of mum with four children who had no food and no money to get to a foodbank", "locations": [], "entities": {"persons": [{"name": "lewell-buck", "sentiment": "none"}, {"name": "emma lewell-buck", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "west end foodbank", "sentiment": "none"}, {"name": "benwell lane", "sentiment": "none"}], "organizations": [{"name": "house of commons", "sentiment": "none"}, {"name": "un", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "trussell trust", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Heartbreaking case of mum with four children who had no food and no money to get to a foodbank South Shields MP tells of desperate circumstances of some constituents as she calls for laws to stop people going hungry Share Emma Lewell-Buck (left) (Image: PA) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nA woman with four children under 10 found herself without money for electricity, gas or any food for her family. \nAnd she couldn’t afford transport to get to a foodbank. \nThe case was highlighted by South Shields MP Emma Lewell-Buck, who said the woman was a constituent who came to her constituency office asking for help. \nMs Lewell-Buck told the House of Commons: “People are going hungry.” \nShe was proposing legislation that would require the Government to collect figures for the number of people struggling to afford to eat. \nIt would measure “food insecurity”, which is defined by the UN as being without reliable access to sufficient affordable and nutritious food. \nGovernment agencies already carry out surveys asking people about their lives, which is one of the sources of official figures used to shape Government policy. \nMs Lewell-Buck said a question about food insecurity should be added to surveys, with an existing question removed to ensure there are no extra costs on balance. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nSpeaking in the House of Commons, she said collecting statistics would be a step forward in ensuring the problem is dealt with. \nShe said: “We all know that what gets measured gets done.” \nMs Lewell-Buck added “Estimates from the UN in 2014 suggest as many as eight million households in the UK are food insecure. \n“That’s eight million households where people can't afford to eat or are worrying about where their next meal will come from.” \nRecent inflation figures show the overall cost of food rose by 4.2% over 12 months. \nThe cost of bread and cereals rose by 4.3%, the cost of meat rose by 3.9% and the cost of fish rose by 8.5%. \nThe cost of fruit rose by 3.4% and the cost of vegetables rose by 5.7%. Read More UK 'will be paying for years to come' if it agrees £50bn Brexit bill \nIt means that households already struggling to pay for food face rising bills. \nCharity the Trussell Trust says it handed out 586,907 three-day emergency food supplies given in the first half of this year, a 13% increase on the same period last year. \nAnd it says 208,956 of these went to children. \nNewcastle is the home of the busiest foodbank in the country. \nAround 50,000 people a year rely on the West End Foodbank, on Benwell Lane, which since opening in 2013 has grown to be the busiest in the UK. Like us on Facebook", "external_links": [], "published": "2017-11-30T07:00:00.000+02:00", "crawled": "2017-11-30T07:57:33.000+02:00", "highlightTitle": ""}