{"organizations": [], "uuid": "c6e99a5f2a0c3fdbb0a6a1d580b91f7a453bfaf5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article11349817.ece/ALTERNATES/s1200/JS90331195.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13862496", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Paradise Papers reveal Queen 'invested millions in offshore haven'", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-06T10:00:00.000+02:00", "replies_count": 0, "uuid": "c6e99a5f2a0c3fdbb0a6a1d580b91f7a453bfaf5"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13862496", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Paradise Papers reveal Queen 'invested millions in offshore haven'", "locations": [], "entities": {"persons": [{"name": "jeff j mitchell/getty", "sentiment": "none"}, {"name": "paul currie", "sentiment": "none"}, {"name": "rachel hancock", "sentiment": "none"}, {"name": "foi.john o’connell", "sentiment": "none"}, {"name": "andy cole", "sentiment": "none"}, {"name": "peter beardsley", "sentiment": "none"}, {"name": "nigel mills", "sentiment": "none"}, {"name": "jonathon manning diageo", "sentiment": "none"}], "locations": [{"name": "newcastle", "sentiment": "none"}, {"name": "threadneedle street", "sentiment": "none"}, {"name": "great britain", "sentiment": "none"}, {"name": "gosforth business park", "sentiment": "none"}, {"name": "cumbria", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "budget.charles ireland", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "france", "sentiment": "none"}], "organizations": [{"name": "bt", "sentiment": "negative"}, {"name": "bank", "sentiment": "none"}, {"name": "bank of england", "sentiment": "none"}, {"name": "newcastle united", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "diageo", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}, {"name": "kevin gibson photography ltd", "sentiment": "none"}, {"name": "bell’s-to-johnnie walker", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "brew dog", "sentiment": "none"}, {"name": "manchester united", "sentiment": "none"}, {"name": "time out usa", "sentiment": "none"}, {"name": "press association", "sentiment": "none"}, {"name": "bt sport", "sentiment": "none"}, {"name": "press association.the bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning Ladbrokes Coral to pay £2.3m penalty for failings \nLadbrokes Coral has agreed to a £2.3m penalty package for failings which saw two high-spending customers gamble away around £1.3m of stolen money.The company was sanctioned by the Gambling Commission after an investigation into sub-brand Gala Interactive found “significant flaws” in the way it deals with punters displaying problem gambling behaviour.One customer lost £837,545 over 14 months and the other lost £432,765 over 11 months while playing Gala’s online games.The first gambler was jailed for four years for stealing from an employer and the second was sentenced to four-and-a-half years for acquiring, using or possessing criminal property.The Commission said Ladbrokes Coral failed to have in place written policies and procedures that could have curbed the problem gambling behaviour.The penalty package comprises a £1m payment to fund research relating to the causes of problem gambling and £1.3m for the customers.In addition, Ladbrokes Coral has volunteered to pay a further £200,000 to fund problem gambling research.Sarah Harrison, chief executive of the Gambling Commission, said: \nWe will continue to take robust action where we see operator failures that harm consumers and the wider public. \nIt is the responsibility of all operators - particularly key decision-makers in those companies - to ensure they are protecting their customers and step in when there is behaviour that might indicate problem gambling. \nThis did not happen in this case and the £2.3m penalty package should serve as a warning to other operators. Ladbrokes on Clayton Street, Newcastle 8:59 Jonathon Manning Corbyn slams super rich following Paradise Paper leak \nJeremy Corbyn has condemned the rich and powerful, after leaked documents showed many of the world’s wealthiest individuals continue to invest money in offshore tax havens. \nThe Labour leader said the data “proves” that “there’s one rule for the super-rich and another for the rest when it comes to paying tax.” \nHis concern was echoed by Meg Hillier, the chairwoman of the House of Commons Public Accounts Committee, who said senior officials from HM Revenue and Customs (HMRC) would appear before the panel on Monday to explain its plan of action. \nThe Government responded to the disclosure by defending its record on combating tax avoidance and evasion. \nA Treasury spokeswoman said: \nSince 2010, the Government has secured an additional £160bn, more than the annual UK NHS budget, for our vital public services by tackling tax avoidance, evasion and non-compliance. \nThis includes more than £2.8bn from those trying to hide money abroad to avoid paying what they owe. \nThere are 26,000 HMRC staff tackling tax avoidance and evasion, and we have provided an extra £800m to fund their efforts. \nA fair tax system is a critical and key part of our plan to build a fairer society, and we are clear that everyone must pay what is due, at the right time. Labour leader Jeremy Corbyn (Image: PA) 8:55 Jonathon Manning Jobs will be moved unless 'soap opera' of Brexit ends, CBI warns \nBrexit is turning into a “soap opera” and hundreds of firms will take jobs abroad if a transition deal isn’t agreed in the next few months, the country’s largest business group is warning . \nIn a speech, CBI president Paul Drechsler unveiled research showing the extent to which firms are actively preparing for Brexit, with many larger companies giving the Government until March next year to agreed a transition deal or set contingency plans in motion. \nThe warning from the CBI comes as a poll revealed eight out of 10 foreign businesses with British interests are pessimistic about the outcome for the UK in the EU divorce talks, while the Bank of England said Britain’s powerhouse financial services sector could shed up to 75,000 jobs when the country leaves on the EU. \nMr Drechsler, who previously worked at ICI on Teesside, will say: \nBusiness has a responsibility to speak up and suggest solutions when we see obstacles in the way of UK prosperity. Currently, we see one major challenge – not Brexit itself: we’re 100% committed to making a success of it. But the approach to Brexit. \nWe need a single, clear strategy. A plan for what we want, and what kind of relationship we seek with the EU. \nAt the moment, I’m reminded of a prime-time soap opera, with a different episode each week. First Lancaster House, then article 50, the European Council, two dinners with Juncker – and no doubt many exciting instalments to follow. \nEach one becomes the Big Story, until the next one rolls around. And the effect is that genuine steps forward such as the Prime Minister’s Florence speech don’t get the recognition they deserve. \nThat speech represented real progress. It put the needs of the economy first. It set a co-operative tone. And it unlocked progress. \nHe will added: \nBrexit is only 508 days away. But for many businesses, their alarm clocks are set even earlier than that. They’re set to the moment they will actually enact their contingency plans. \nFor 10% of business the alarm has already rung, and they’ve begun moving staff or slowing recruitment. \nWithout a transitional deal, when EU leaders gather in Brussels for the March summit, a total of 60% of businesses will have done the same. The clock is ticking. CBI President Paul Drechsler (Image: PA) 8:49 KEY EVENT Fenwicks sales continue to fall \nFenwick department store has continued to see sales fall, as the company struggles to cope with competition from online retailers. \nSales at the company fell to £426.4m for the year ending January 2017, down from £431.7m during the previous year. \nThe reduced sales figures were also reflected in the firm’s operating profit which slumped from £25.4m to £17.9m. \nFenwick, which is headquartered on Newcastle’s Northumberland Street, has stuck to its traditional retail approach and for many years has refused to create its own online store. This has led to the firm struggling to cope with the changing spending habits of consumers, who are increasingly buying products online. \nIn the company accounts, secretary Jill Anders said: \nWhile the UK economy grew steadily in 2016, trading conditions in the retail sector continued to be challenging in the face of strong structural headwinds. New digital distribution channels and devices are giving consumers more choice than ever. At the same time, the excess capacity of many retailers is resulting in frequent discounting and price deflation, putting profit margins under increased pressure. \nConsumers are also spending more of their disposable income on services and leisure activities, as part of a behavioural shift from product-consumption to experience-consumption, requiring retailers to invest in the overall shopping experience to retain and attract customers. \nThe Board was, there fore, encouraged that sales were largely unchanged last year, highlighting its robust positioning as an established business and strong local brand that continues to provide customers in towns across the UK with high standards of product and service. The unveiling of the Fenwick Christmas window 8:38 Jonathon Manning More jobs on the way at BT call centre in Newcastle as it celebrates 20th anniversary \nA BT contact centre which employs more than 900 people in Newcastle is celebrating its 20th anniversary with plans for jobs growth . \nThe centre at the Gosforth Business Park – which handles around 2.7m calls a year, including customer service and sales of products such as broadband, TV and BT Sport - has recruited more than 150 people in   is looking to fill another 70 jobs in the next six months, including around 35 apprentice roles. \nMore than 8,500 people are directly employed by BT and its EE business in the North East – equivalent to one in three employees working in the region’s IT and communications sector. \nThe contact centre celebrated its 20th anniversary with a visit from former Newcastle United legends Andy Cole and Peter Beardsley. \nRachel Hancock, general manager of customer care at the Newcastle contact centre, said: \nI’m really proud of everything that the teams in Newcastle have achieved over the past 20 years and I’m delighted that they have reached this impressive milestone.Former Newcastle and Manchester United striker Andy Cole visits a BT contact centre in Newcastle which is celebrating its 20th anniversary (03/11/17)(Image: collect unknown) \nAfter two decades we’re still hiring and growing our presence in Newcastle and I love being a part of the centre’s ongoing success. \nThe centre is home to BT’s nuisance call bureau, a team of trained advisors who help customers affected by nuisance calls. This can involve straightforward complaints about persistent cold-callers or sales calls, but sometimes more serious cases of threatening and intimidating calls. \nAdvisors sometimes have to work with the police to help stop the calls, identify the callers and bringing them to justice. Newcastle was chosen because of the wealth of expertise and experience among the workforce. \nFor recruitment opportunities at the Newcastle contact centre please visit www.btcontactcentrejobs.co.uk . Former Newcastle and Manchester United striker Andy Cole visits a BT contact centre in Newcastle which is celebrating its 20th anniversary (03/11/17) (Image: collect unknown) 8:33 KEY EVENT Bank of England consultation over animal fat in bank notes cost £1,500 a day \nThe Bank of England has drawn fire after spending more than £1,500 a day on a consultation into the use of animal fat in new bank notes.The Old Lady of Threadneedle Street forked out £66,941 on a public consultation between March 30 and May 12 following a furious backlash from vegetarians, vegans and religious groups at the tallow found inside polymer £5 and £10 notes.The lion’s share of the money - £45,854 - was spent on external advisers and consultants, while £18,047 went into technical assessments and £3,040 on a Welsh translation.After “careful and serious consideration” the Bank said in August that it would continue using the plastic currency, despite the consultation finding that 88% of people were against the use of animal-derived additives.The money spent by the Bank of England can be revealed following a Freedom of Information (FOI) request by the Press Association.The Bank declined to comment on the FOI.John O’Connell, chief executive at the TaxPayers’ Alliance, said: \nTaxpayers will find it astonishing that the Bank of England spent tens of thousands on expensive private consultants to respond to criticism it could have anticipated. \nThrowing taxpayers’ cash at any criticism cannot become the normal response, especially when there is little realistic chance of any change ever happening. \nInstead, the Bank could have done this work in-house for a fraction of the cost. The new polymer £5 note (Image: PA) 8:28 Jonathon Manning Diageo boss warns Government against causing a Scotch sales downturn \nThe British boss of Diageo has warned the Government against triggering another downturn in Scotch whisky sales by serving up a tax hike in November’s Budget.Charles Ireland, general manager for Great Britain, Ireland and France, said the move would be counterproductive because Treasury takings from Scotch fell when the Chancellor imposed a 3.9% tax rise earlier this year.Sales of the spirit dropped by one million bottles in the first half of 2017 following March’s tax rise, which pushed the duty on an average bottle to 80%.Mr Ireland, who has worked at the Bell’s-to-Johnnie Walker group for 20 years, said the “unfair” levy not only harms the domestic market, but hampers its overseas business by encouraging countries to impose harsher tax regimes.Speaking to the Press Association, Mr Ireland said: \nOur modelling shows there would be a negative impact on the strength of the market at home. \nThe spirits market suffered a downturn when the last increase happened earlier this year and that there would be another downturn if the tax increased in the next Budget. \nOn top of that, it will make it more difficult for us to argue against increases and unfair treatment overseas. \nI think there is both a domestic impact for our industry and an international impact for our industry. \nScotch whisky is Britain’s biggest food and drink export, with Diageo holding around a third of the global market. \nThe Government is in the midst of trying to bolster UK exports by laying the groundwork for free trade deals (FTD) once Britain breaks from the European Union (EU). \nA Treasury spokesman said: \nWe recognise the importance of the Scotch whisky industry. \nIn the UK, tax on a bottle of Scotch is 90p lower now than it would have otherwise been, thanks to duty freezes and cuts introduced in the last three years. \nIn addition, both businesses and their customers have saved over £2 billion since 2013 thanks to changes to alcohol duty. A person pouring whisky into a glass (Image: Jeff J Mitchell/Getty Images) 8:23 KEY EVENT How you can own part of a whisky distillery - for as little as £10 \nMembers of the public are being offered the chance to own shares in a whisky, vodka and gin distillery for as little as £10. \nThe Lakes Distillery, which has offices in Newcastle and a distillery in Cumbria, is attempting to raise £1m through crowdfunding site Crowd Cube. Just a few days into its fundraising effort, the company has already raised more than £250,000. \nThe fundraising strategy has been inspired by that carried out by craft beer maker Brew Dog, which has now grown into a $1bn brand. The distillery has decided to offer shares to members of the public to create a range of shareholders who will act as ambassadors for the business. \nThose who invest in the business will also receive a £10 voucher that can used to purchase spirits at the Lakes Distillery’s online store. \nCo-founder and chairman Nigel Mills said: \nOur first investors, made up of high net worth individuals, continue to invest but we have decided to reach out to the public, which has been so supportive in our first few years. \nThere is now a strong order book for our spirits, an established and repeatable trade at our distillery and the very real prospect for small investors of owning a piece of English whisky history. \nI am confident this next round of investment will prove popular and successful, bringing to the spirits sector the innovation that has led Brew Dog to challenge the orthodoxy of big brewers. \nThe distillery opened in 2014, and has since sold over 160,000 bottles of gin, vodka and blended whisky. Its success has also led to it being named as one of the top five new distilleries in the world by Time Out USA. \nFollowing the crowdfunding, the cash will be used to increase its production of its first single malt whisky. Lakes Distillery managing director Paul Currie with the firm's first batch of single malt whisky (Image: Kevin Gibson Photography Ltd) 8:17", "external_links": [], "published": "2017-11-06T10:00:00.000+02:00", "crawled": "2017-11-06T10:42:23.008+02:00", "highlightTitle": ""}