{"organizations": [], "uuid": "e9e1f231c8aba521672d3420d45da98e9de4ac30", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article574945.ece/ALTERNATES/s1200/4013646.jpg", "site_section": "http://www.devonlive.com/rss.xml", "section_title": "devonlive - frontpage", "url": "http://www.devonlive.com/news/devon-news/devon-mp-demands-apology-mutineer-783214", "country": "US", "title": "Devon MP demands apology for 'mutineer' smear", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-15T19:39:00.000+02:00", "replies_count": 0, "uuid": "e9e1f231c8aba521672d3420d45da98e9de4ac30"}, "author": "Keith Rossiter", "url": "http://www.devonlive.com/news/devon-news/devon-mp-demands-apology-mutineer-783214", "ord_in_thread": 0, "title": "Devon MP demands apology for 'mutineer' smear", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Devon MP demands apology for 'mutineer' smear Sarah Wollaston: I am not trying to block Brexit Share Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nDevon MP Sarah Wollaston has demanded an apology from The Daily Telegraph over a front-page story portraying her as a “Brexit mutineer”. \nAnd she believes the government Whips’ office may have given her name, along with those of 14 other Conservative Party colleagues, to the Telegraph after private conversations. \nDr Wollaston, the Conservative MP for Totnes, is opposing a government amendment to the European Union (Withdrawal) Bill that seeks to set in stone the date when Britain will leave the EU, regardless of the state of negotiations. \n“I voted to remain, but I have always said I would respect the result of the referendum,” she said. \n“It’s complete nonsense for the Telegraph to suggest that stopping this amendment will block Brexit.” Read More South Devon's pioneering care in the community is flawed, patients claim \nThe Telegraph headline – “The Brexit mutineers” – was “hugely misleading. It gives people the impression that we are trying to frustrate or block Brexit, which is absolutely not the case. \n“The Telegraph has been irresponsible in the way it has portrayed us as a group of people trying to block Brexit. \n“I think the newspaper should apologise. It isn’t right to portray people in this way, who are doing their job of parliamentary scrutiny.” \nDr Wollaston said she was against setting a specific date in case the government needs the flexibility to negotiate the best deal for Britain. \n“Many of us have spoken to the Whips and said we don’t understand why this amendment has been added to the legislation. Read More 'How will they cope?' Devon MP warns on winter health services \n“The names of those who have had these private conversations with the Whips have been handed to the Telegraph.” \nDr Wollaston said that if the government did not change its mind on the so-called Henry VIII powers contained in the Bill, she would rebel on that issue. \nThe repeal Bill, which will transfer EU laws to Britain, has been criticised as a “power-grab” by ministers, who will be able to approve secondary legislation without parliamentary scrutiny. \nDr Wollaston said she was called for a new cross-party committee to be set up to examine this legislation and decide whether it needed to be debated in parliament. \n“This isn’t about blocking Brexit. It’s about parliament taking back control – which is what people voted for,” she said. \n“The government will have to make concessions because it will not get through as it stands. \nWe have asked for a response from The Daily Telegraph and from the Conservative Whips' Office. Like us on Facebook ", "external_links": [], "published": "2017-11-15T19:39:00.000+02:00", "crawled": "2017-11-15T20:01:38.003+02:00", "highlightTitle": ""}