{"organizations": [], "uuid": "712d070cb44b39dc68a55ae08b67b30419f6add1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13712531.ece/ALTERNATES/s1200/Conservative-Party-Conference-2017-Day-Three.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/six-reasons-theresa-mays-tory-13875770", "country": "GB", "domain_rank": 21960, "title": "The six reasons why Theresa May's Tory government is a disaster", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-08T18:00:00.000+02:00", "replies_count": 0, "uuid": "712d070cb44b39dc68a55ae08b67b30419f6add1"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/six-reasons-theresa-mays-tory-13875770", "ord_in_thread": 0, "title": "The six reasons why Theresa May's Tory government is a disaster", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "tory", "sentiment": "negative"}, {"name": "carl sargeant", "sentiment": "none"}, {"name": "priti patel", "sentiment": "none"}, {"name": "johnson", "sentiment": "none"}, {"name": "nazanin zaghari-ratcliffe", "sentiment": "none"}, {"name": "michael fallon", "sentiment": "none"}, {"name": "fallon", "sentiment": "none"}, {"name": "christopher pincher", "sentiment": "none"}, {"name": "gavin williamson", "sentiment": "none"}, {"name": "boris johnson", "sentiment": "none"}, {"name": "edward leigh", "sentiment": "none"}, {"name": "damian green", "sentiment": "none"}], "locations": [{"name": "westminster", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "tories", "sentiment": "none"}, {"name": "israel", "sentiment": "none"}], "organizations": [{"name": "house of commons", "sentiment": "none"}, {"name": "cabinet", "sentiment": "none"}, {"name": "house of commons  conservatives", "sentiment": "none"}, {"name": "budget", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "veteran conservative", "sentiment": "none"}, {"name": "defence", "sentiment": "none"}, {"name": "dup", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The six reasons why Theresa May's Tory government is a disaster This is a Government in chaos - but that doesn't mean Theresa May will have to resign Share Prime Minister Theresa May (Image: Getty Images Europe) Share Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nThis Government looks like it’s close to collapse. \nBut appearances can be deceiving. \nConservative MPs believe Theresa May can still cling on as Prime Minister - perhaps until 2019 or even 2020. \nAnd while there are exceptions, many of them want her to. They don’t think there’s anything to gain by forcing her out earlier. \nLet’s look at what’s gone wrong for the Government. It’s a long list. Incompetent Cabinet Ministers \nTwo Cabinet ministers have made terrible errors of judgment. Boris Johnson and Priti Patel both messed up royally. \nMr Johnson, the Foreign Secretary, blurted out comments in a Commons committee hearing that could lead to a Brtish-Iranian woman, Nazanin Zaghari-Ratcliffe, languishing in an Iranian jail for five years. \nBut it’s not just that he said the wrong thing. He then appeared before the House of Commons and brazenly pretended it hadn’t happened. \nEven the most cynical observers at Westminster were shocked by his behaviour. There are few people willing to defend him. \nMeanwhile, Priti Patel went freelance in her role as International Development Secretary, holding a meeting with the Prime Minister of Israel which had not been approved by Number 10. While there’s some disagreement about when exactly Theresa May was told, it does appear that the Prime Minister was in the dark until after the meeting took place. \nIn normal circumstances, these would probably be sacking offences for either of them. The fact that Mrs May did not immediately sack the pair from the Cabinet illustrates her weakness. \nBut that’s only part of it. Read More Secret Brexit papers revealing impact on the regions may never be published The sleaze scandal \nClaims of sexual harassment and assault have been made against both major parties. But only the Conservatives have seen two front-benchers resign - former Defence Secretary Michael Fallon and former whip Christopher Pincher. \nMany MPs have mixed feelings about the abuse scandal. There’s a view that genuinely shocking behaviour has been lumped in with minor indiscretions, and that some people have been accused who did nothing wrong. \nThe death of former Welsh government minister Carl Sargeant, who appears to have taken his own life days after it emerged that a number of women had made allegations of improper conduct against him, has hardened this mood. \nBut fairly or not, it’s made the Tories look sleazy. \nAnd the impression is reinforced by the fact that Mrs May’s Deputy, Damian Green, is under investigation, although he denies any wrongdoing. Promoting Gavin Williamson \nMany Conservative MPs were also furious when Mrs May replaced Mr Fallon as Defence Secretary with Gavin Williamson, her former Chief Whip. \nHe’s never been a minister in a Government department before (a Government whip is a minister but it’s different to helping run a department). \nAnd he’s not popular. Many Tories feel he used his Chief Whip role to further his own career and undermine Conservative colleagues who annoyed him. Ignoring the House of Commons \nConservatives have been reduced to abstaining on some House of Commons votes. \nThis, and the policy of ignoring motions approved by the Commons, has upset some Tories. Veteran Conservative MP Sir Edward Leigh has complained: “The road to tyranny is paved by executives ignoring parliaments.” \nThe Tory policy is designed partly to hide the fact that they might well lose votes even if they didn’t abstain. \nThe DUP has agreed to back the Conservatives, giving Mrs May a majority in the House of Commons despite leading a minority government - but only in votes about key pieces of legislation, \nSpecifically, the DUP’s pledge is to back the Government “on all motions of confidence; and on the Queen’s speech; the Budget; finance bills; money bills, supply and appropriation legislation and Estimates.” \nBut the DUP hasn’t promised to back the Tories in votes on motions presented to the Commons by opposition parties. \nHowever, the second reason the Government wants to avoid a vote on these motions is because it fears some Conservative MPs would actually support Labour on some issues. \nFor example, there are Tories who are deeply concerned about the roll-out of Universal Credit, the government’s flagship welfare reform. Universal Credit", "external_links": [], "published": "2017-11-08T18:00:00.000+02:00", "crawled": "2017-11-08T19:00:27.000+02:00", "highlightTitle": ""}