{"organizations": [], "uuid": "2d57eb3123bc9507dbddd8fe0d7f7569b22b10d9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13901086.ece/ALTERNATES/s1200/womblemain.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/special-features/collaboration-between-large-small-companies-13900860", "country": "GB", "domain_rank": 21960, "title": "Collaboration between large and small companies can produce best innovation, report says", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-15T02:01:00.000+02:00", "replies_count": 0, "uuid": "2d57eb3123bc9507dbddd8fe0d7f7569b22b10d9"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/special-features/collaboration-between-large-small-companies-13900860", "ord_in_thread": 0, "title": "Collaboration between large and small companies can produce best innovation, report says", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Advertorial Collaboration between large and small companies can produce best innovation, report says Newcastle law firm Womble Bond Dickinson hosted a roundtable event to discuss its Close Encounters report Share Business editor Graeme Whitfield chairing business roundtable event at Bond Dickinson LLP (Image: Newcastle Chronicle) Share Get daily   Thank you for subscribing!   \nThe power of collaborative innovation has been brought to the fore by a far-reaching report by commercial law firm Womble Bond Dickinson, highlighting the rewards that can be delivered when the Davids and Goliaths of business work together. \nThe firm’s research – Close Encounters: The Power of Collaborative Innovation – revealed that in the last four financial years, large organisations have ploughed £102bn into 5,447 deals with UK SMEs, far outweighing the £62bn big companies have spent on R&D. \nNow North East business leaders, advisers and lenders have come together to share their thoughts on the report’s central topics. \nIn the latest in a series of breakfast meetings hosted in Newcastle by The Journal and Womble Bond Dickinson, leaders from a range of sectors discussed everything from cultural difficulties and managing expectations to how we should look to European counterparts to make gains. \nDelegates at the event agreed that small operations were often better at coming up with innovative ideas but they often lack the heft, resource and – most importantly – the funds to bring those ideas to fruition. \nWithin large organisations these issues are reversed as they have plenty of resource plus the ability to deal with regulatory environments well, but they are not as nimble because of the levels of management and policy that lies ahead. \nWith this in mind, working together makes perfect sense – but managing expectations of both sides can often be a fraught, balancing act. \nKevin Robertson, Womble Bond Dickinson’s head of office for Newcastle and head of the projects and procurement team, said: “It’s about the dynamics of those different businesses - we act for the smaller, innovative, disrupting businesses but also the big PLCs. \n“When you speak to both parties they both want to achieve the same thing but the concerns and fears of the smaller guys as to what their intellectual property is and whether they will get swallowed up and lost in a large commercial beast, as opposed to the larger companies thinking about how they will extract value from this investment.” \nAndrew Bayliff, director at Innovia Films’ Carlisle facility, said his business had a mixed success rate at getting collaborative deals over the line. \nThe firm is best known for producing plastic for the newer Bank of England notes, and it also works within packaging markets, producing film labels for a range of markets including tobacco, food and drink, cosmetics and confectionery. \nHe said: “In the bank note side of the business we work with a lot of smaller companies who are often working on security features. \n“Our main role is making sure they can be operated at scale, which is something small companies aren’t very good at, but in which we work well. In the more general packaging market it’s hard to find firms with a realistic expectation for what they can offer, so we’ve not had many good collaborations in that space.” \nThe report highlights the importance of rising numbers of innovation centres - the likes of Newcastle’s Science Central as an innovative hub – accelerator programmes such as Ignite, which is now being replicated across the UK, and tech clusters, which are bringing the two diverse but mutually dependent sides together. \nThe North East Automotive Alliance (NEAA) is a prime example of an industry-led cluster group which is making huge strides within its sector. The business roundtable event (Image: Newcastle Chronicle) \nEstablished in March 2015 to support the economic sustainable growth and competitiveness of the sector in the North East, the cluster now has more than 230 members, making it the largest group of its kind in the UK. \nIt wasn’t easy at the start, however, said chief executive Paul Butler. \nHe said: “There is a recognition amongst larger organisations that they need to collaborate on innovation and we’ve done an awful lot of work around sharing best practice and enabling companies within the region to pick up on innovative ideas. \n“They share best practice within their organisations, but they have never done it regionally before. We do have a truly collaborative network which recognises that by coming together they are derisking the innovation and helping on financial targets. Instead of asking for £1m for a project you might have five companies putting in £100,000 and matching that through the public sector or through funding. \n“It wasn’t always like that. When we first set up, two firms were adamant they wouldn’t meet each other. \n“But they quickly recognised that by working together in areas where there were no conflict of interest that they could upskill their business and that their main competition is internal. Once business is won it’s up to the parent firm to decide where that business is placed, so their competition is actually internal. \n“By working together those companies are able to increase the cost effectiveness, their productivity and therefore they remain more competitive in their own organisational structure. That has an impact on the region as well because it makes the business more secure.” Read More Businesses should expect to be attacked by cyber criminals, experts tell Journal event \nIain Wright, chief executive of NEPIC, the membership cluster organisation working with the chemical-using industries in the North East, said: “In terms of what NEPIC and NEAA have done, the power of clusters in a nutshell is about trying to get people talking, to try to collaborate. \n“That’s key on a sectoral basis and regional basis. But I also think it’s important cross-sector. There is some clever stuff going on in the automotive sector - how can chemicals in the North East benefit from that? \n“I think we are behind the curve. The likes of NEPIC and NEAA are doing a lot but Europe in clusters get this much more and have been established much longer.” \nNewcastle’s Reece Group is a prime example of a group which is seeking to partner with outside organisations to bring forward innovative products. \nRyan Lamb, head of finance at the pioneering engineering firm, explained how its newest division Reece Group Innovation is acting as an innovation partner for larger entities, like Newcastle University and Northumbrian Water, as well as smaller firms who have come to the region to tap into the firm’s expertise. \nAs a group, it also needs to tap into different companies to get out new products – a strategy which led to it taking a majority stake in food packaging firm Continuous Retort. \nMr Lamb said: “That was a very small company with no limits on what they could do, but it has been a challenging process incorporating the two. \n“It’s getting the balance between having procedures and controls but still having that level of autonomy to not completely sit on top of it, so they can still think and do their own thing. If we just make it part of the Reece Group that completely goes. It’s quite a soft thing we do and that’s why it’s working.” Read More Newcastle conference highlighting the importance of digital disruption \nExamples like this, however, have slowed since the Brexit vote. \nThe Womble Bond Dickinson study shows a significant drop of 28% in the number of collaborations between large firms and SMEs since the vote to leave the EU. \nPeter Snaith, the law firm’s head of manufacturing, said: “It’s policy related in that people won’t make the investment if there are going to be changes down the line. You have to know the path you are embarking on will be a straight one otherwise you won’t take the risk.” \nThis is perhaps why many large firms are, instead, looking inward and trying to innovate from within. \nSandra Thompson, audit partner and office managing partner at EY’s Newcastle base, said: “I would argue that there’s a lot of innovation going on inside big companies. Allegedly we’re the leading edge of technological advancement across the Big Four, but I think the only way we’ve been able to do that is in small teams. \n“We’ve carved out divisions like EY Absolute, EY X, but essentially it’s people who have been taken out of the business to work on innovative technology, artificial intelligence - we’ve got some amazing stuff. \n“I think it has to happen in small teams. The problem is to scale it out, which is quite tricky, unless it gets the backing of everyone in the business. \n“Would EY go out to SMEs? We have done but it’s rare. It’s difficult with all the rules and regulations to remain independent. It’s such a shame because there is so much we can do.” \nCreating a collaborative culture within businesses is just as important, especially when some have large workforces who aren’t aware of their fellow colleagues duties. Read More Make Disruption Pay: Why we're supporting an event that recognises seismic digital change \nWhen Ms Thompson was first appointed EY’s Newcastle office manager she went to great lengths to create an exciting working environment, installing table tennis tables, to get people meeting and talking. \n“We also had an event in Gosforth – a fair, with a tin can alley, hoopla – and it was the first time that everyone had been together. When you become such a scale it sounds fantastic but keeping it all together and making sure everyone feels part of the same company is quite tricky.” \nMr Robertson said the legal sector has been on catch-up and, learning from other sectors, Womble Bond Dickinson created an internal innovation team. \nHe said: “It’s open to everybody. It doesn’t matter what your job is. It’s taken a while for people to realise it’s for everyone to join in. \n“When you’ve been in the same business doing the same process for so long it becomes more difficult to see a new way to do it, so in response we got some fantastic ideas in a competition, including one from a paralegal which we are taking, backing and running with. That got us to look inward and say: ‘We’ve got ideas within our own business, how do we get to them?’ \n“It’s a cultural thing. You should feel that if you have ideas you can make them heard.” \nTax credits for R&D have aided firms greatly and even kept firms in the UK, Mr Wright argued. The business roundtable event (Image: Newcastle Chronicle) \nBut Andrew Buchanan, of investment fund Tourian, said: “Research and development often just breeds more research and development, and doesn’t necessarily scale up. That’s where the gap is.” \nPhil Kite, director at EEF, former CEO at Reece Group and the leader of Team Tyne Innovation, agreed. \nMr Kite’s Team Tyne Innovation project will see him and three other rowers journey 3,000 miles across the Atlantic in the world’s toughest rowing race – a project which will involve as many North East SMEs as possible by showcasing products they provide to help them get across the ocean. \nHe said: “That’s why we have Science Central. You could produce an environment for innovation and innovative companies, but they’ve got to grow. \n“Newcastle will hopefully be the city of innovation, a great aspiration to have, but how do you invest in that to take it forward and make it the next big company? That’s where a lot of thought has to go in.” \nMr Wright said that while the UK is great at encouraging start-ups, helping them to grow is another matter – so rounded off the discussion with a very popular suggestion: the formation of a regional business cluster. \nHe said: “I think we need to play to our strengths in the North East. We are a relatively small region and most of the big players know each other. We need to encourage a regional cluster of business managing and mentoring to help potential firms really grow.” Like us on Facebook", "external_links": [], "published": "2017-11-15T02:01:00.000+02:00", "crawled": "2017-11-15T02:15:43.000+02:00", "highlightTitle": ""}