{"organizations": [], "uuid": "97909ac816951e8d9520a66c18232ccb4af5b99f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article182169.ece/ALTERNATES/s1200/33409765.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/news/business/budget-2017-more-new-homes-817279", "country": "US", "domain_rank": 48128, "title": "Budget 2017 - more new homes, boost for green cars and concessions for Universal Credit claimants - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.338, "site_type": "news", "published": "2017-11-22T18:09:00.000+02:00", "replies_count": 0, "uuid": "97909ac816951e8d9520a66c18232ccb4af5b99f"}, "author": "Tom Pegden", "url": "http://www.leicestermercury.co.uk/news/business/budget-2017-more-new-homes-817279", "ord_in_thread": 0, "title": "Budget 2017 - more new homes, boost for green cars and concessions for Universal Credit claimants - Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "phillip hammond", "sentiment": "none"}, {"name": "david richardson", "sentiment": "none"}, {"name": "jacquelyn kimber", "sentiment": "none"}, {"name": "les phillimore", "sentiment": "none"}, {"name": "mark j rees", "sentiment": "none"}, {"name": "darren bowkett", "sentiment": "none"}, {"name": "ian jones", "sentiment": "none"}, {"name": "johnny green/pa wire", "sentiment": "none"}, {"name": "westleigh", "sentiment": "none"}, {"name": "ed saunders", "sentiment": "none"}, {"name": "newby castleman", "sentiment": "none"}], "locations": [{"name": "victoria park", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "rutland", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "coalville", "sentiment": "none"}, {"name": "blaby", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "whetstone", "sentiment": "none"}, {"name": "grove park", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}], "organizations": [{"name": "leicester mercury government", "sentiment": "negative"}, {"name": "volvo cars", "sentiment": "none"}, {"name": "ibstock brick", "sentiment": "none"}, {"name": "office for budget responsibility", "sentiment": "none"}, {"name": "westleigh partnerships", "sentiment": "none"}, {"name": "universal credit", "sentiment": "none"}, {"name": "federation of small businesses", "sentiment": "none"}, {"name": "universal credit  eu", "sentiment": "none"}, {"name": "loughborough", "sentiment": "none"}, {"name": "national living wage", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Government wants 300,000 new homes like this Westleigh development in Melton Share Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nFirst time buyers, electric car drivers and Universal Credit claimants were among those taking comfort from today’s budget. \nChancellor Phillip Hammond said stamp duty was being abolished immediately for all first time buyers up to £300,000. \nHe also confirmed plans to build 300,000 new homes in England in a bid to make house prices more affordable. \nThe Chancellor said people who charge their electric company cars at work would be exempt from company car tax as of next year while drivers of the dirtiest diesel cars faced fresh taxes. \nVan owners and people buying the next-generation of cleaner diesels wouldn’t be hit though. \nHe said there would be a new £540m to support the growth of electric cars, particularly through charging points. \nAnd he bowed to pressure over Universal Credit with a £1.5 billion package to cut the waiting period for payments and to make it easier for claimants to receive an advance. Many of the country's poorest have been left waiting by failings in Universal Credit \nEU remainers won’t have appreciated the extra £3 billion being aside over the next two years – on top of £700,000 already give – to pay for Brexit. \nAnd he said more would be made available as and when needed. \nAlthough the fuel duty rise was again put on hold, smokers would be hit by tobacco duty continuing to rise at inflation plus 2 per cent, and an additional 1 per cent duty on hand rolling tobacco. \nDuties on standard ciders, wines, spirits and on beer were frozen, though the cost of super-strength ciders will go up again in 2019 under planned legislation. Don't worry - a pint of bitter down the local won't go up (Image: Johnny Green/PA Wire) \nIt all came against a grim economic backdrop, with the Office for Budget Responsibility downgrading its growth forecasts as a result of poor productivity. \nDavid Richardson, a tax consultant at Leicester chartered accountants Mark J Rees, based near Victoria Park, said next April’s increase in the personal allowance from £11,500 to £11,850 will see an extra £1.35 a week for most income tax payers. \nBut price rises due to inflation means people’s spending power may not be any different. \nMeanwhile people earning between £46,350 and £100,000 will be £270 per year better off – £5.19 per week. Read More \nHe said: “For workers aged 25 and over being paid the National Living Wage, their hourly pay will increase from £7.50 to £7.83 from April 2018 – an extra £11.55 for a 35-hour working week. \n“Younger workers will also see rises, including for apprentices paid the minimum rate. \n“Leicestershire drivers who use diesel will be relieved that the Chancellor did not raise fuel duty, as had been suggested, but unless their car engine is up to the latest standards they face a bigger car tax from next April. Volvo Cars is already introducing electrified cars across its model range \n“Leicestershire’s White Van Man – and White Van Woman – can relax though, as the changes only apply to cars and not vans. \n“First time buyers spending £250,000 will save £2,500 in stamp duty. If the purchase price is £300,000, the saving becomes £5,000.” \nEd Saunders, head of tax at accountants RSM in Grove Park, said: ‘With the Chancellor under such intense political and fiscal pressure – and with his personal future in doubt - it was difficult to know whether today’s Statement would go with a bang or a whimper. \n\"But with the OBR reducing its growth forecast from 2 per cent to 1.5 per cent for the coming year, the Chancellor had little choice but to opt for the latter.\" \nLes Phillimore – a Whetstone businessman, Blaby district Tory councillor and regional chairman of the Federation of Small Businesses – felt it was a business-friendly budget in challenging business conditions. \nHe said: “Government in its attempt to re-align tax revenues, increase minimum wages and extend pension contributions has hit the small business community very hard and with more and more incentives to take risks being removed. Read More Driverless cars developed in Leicestershire on public roads for the first time \n“Government needs to get to grips with the seemingly endless stream of increased cost pressures being imposed on small and medium businesses, the very businesses that it is looking towards to drive and build the UK’s future economy.” \nHe added: “We welcome the careful approach to protect diesel van drivers while at the same time addressing air quality. \n“We also welcome the fuel duty freeze, which is vital to so many local and rural Leicestershire and Rutland businesses for customers, suppliers and staff.” (Image: PA) \nBut he said the economic outlook remained “extremely troubled” with high costs of doing business and inflationary pressures hitting confidence and deteriorating productivity and growth. \nThe Government, he said, needed to address in its Industrial Strategy. \nDarren Bowkett, operations director at brick maker Ibstock Brick, near Coalville, said more homes – coupled with Help to Buy – was a good thing. \nHe said: “We also welcome news of the new £34m fund to develop construction skills across the UK. This is clearly an essential investment if we are to collectively achieve the Government’s ambitious housing goals.” \nIan Jones is managing director of Westleigh Partnerships, in Whetstone, which specialises in building affordable homes for housing associations and also builds private homes. Westleigh managing director Ian Jones \nHe said: “The abolishment of Stamp Duty for most first-time buyers is fantastic news for those hoping to get their foot on the property ladder. \n“The news will mean that buyers will save up to £5,000 from the cost of their new home, which will make the process of moving more affordable for many. \n“We also welcome the initiative to build 300,000 new homes per year by the mid-2020s in an effort to tackle the housing shortage and we will continue to play our part to build homes of all tenures across the wider Midlands.” \nJacquelyn Kimber, tax partner at Leicester and Loughborough accountants Newby Castleman, said, “Given the pressures on the economy, this was never going to be a massive budget, but first time buyers should be delighted with the prospect of not having to spend Stamp Duty on properties under £300,000.” Like us on Facebook ", "external_links": [], "published": "2017-11-22T18:09:00.000+02:00", "crawled": "2017-11-22T20:58:16.004+02:00", "highlightTitle": ""}