{"organizations": [], "uuid": "5db60c930582b54e0d717e8357e32759b0e358ac", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13902119.ece/ALTERNATES/s1200/IBP_NEC_120314greys_02JPG.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/northern-powerhouse-close-failing-business-13902105", "country": "GB", "domain_rank": 21960, "title": "Northern Powerhouse close to failing, business leaders tell Prime Minister", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-15T02:01:00.000+02:00", "replies_count": 0, "uuid": "5db60c930582b54e0d717e8357e32759b0e358ac"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/northern-powerhouse-close-failing-business-13902105", "ord_in_thread": 0, "title": "Northern Powerhouse close to failing, business leaders tell Prime Minister", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Business Northern Powerhouse close to failing, business leaders tell Prime Minister Federation of Small Businesses says 'we won't have a Northern Powerhouse' unless EU funding to the region is replaced Share Part of the Newcastle City Centre skyline (Image: Newcastle Journal) Share Get business   Thank you for subscribing!   \nFrustration has broken out in the business community over the lack of Government action on the Northern Powerhouse . \nSmall businesses in the North East are calling for increased infrastructure investment, more effective integration of public bodies and the creation of a Council of the North in a new report urging accelerated delivery of the Northern Powerhouse. \nThe call from members of the Federation of Small Businesses (FSB) follows anger over the downgrading of a major Northern rail project in the summer and comes as one of the architects of the Northern Powerhouse urged Prime Minister Theresa May to show proper commitment to the project. \nFSB North East chairman Ted Salmon said it was “hard to find concrete manifestations” of the Northern Powerhouse three years from it being launched by then Chancellor George Osborne . \nAnd he said the Government needed to urgently commit to replacing the EU funding that had done so much to help businesses in the North East create jobs in recent years or the Northern Powerhouse would not exist. Ted Salmon, North East regional chairman of the Federation of Small Businesses (Image: handout from FSB) \nHe said: “Three years on from the first mention of the Northern Powerhouse and it’s still hard to find concrete manifestations of it. With a week to go until the Budget, we’d like to see the Chancellor take some meaningful steps towards getting the show on the road. \n“We need cast iron guarantees about EU funding post-Brexit. Firms across the North East are benefitting from EU support to the tune of millions every year. One thing’s for sure, we won’t have a Northern Powerhouse unless that money’s replaced. \n“Our LEPs and growth hubs are doing some fantastic work in supporting small firms across the region. However, we do have some challenges around awareness of what these bodies offer and duplication of services. Moving to a pan-regional model could help tackle these issues. \n“The success of the Northern Powerhouse starts with having the right infrastructure in place. We need greater focus on the local road routes and rail lines that matter to small businesses. Headline-grabbing projects have their place, but incremental investment in small-scale projects would provide a bigger boost to productivity over the long term.” Read More New £2m warehouse will create 25 new jobs in County Durham \nThe FSB report - An Entrepreneurial North - calls for a small business support model to be a central part of the Northern Powerhouse project, pointing out that that more than half of funding to the two Local Enterprise Partnerships (LEPs) in the North East currently comes from EU sources. \nThe report suggests that Government plans to bring together different funding streams into a single UK Shared Prosperity Fund marks an opportunity to more effectively integrate small business support services across the North. \nThe FSB also wants the Government to commit to duelling the A1 north of Newcastle, increasing direct rail services from Sunderland and Middlesbrough and reducing air passenger duty, which is seen as a threat to airports in the region. \nThe FSB report will raise the pressure on Ministers to show more of a commitment to the North East after former Treasury Minister Lord O’Neill, one of the original architects of the Northern Powerhouse, called for greater Government commitment to the region. \nThe Institute for Civil Engineers has also criticised Ministers for their approach to the North, following a decision to downgrade a major rail project in the North just days before committing to a similar scheme in London. \nMrs May used a visit to Teesside earlier this year to say that the Northern Powerhouse is a “key component of our Industrial Strategy”. Like us on Facebook", "external_links": [], "published": "2017-11-15T02:01:00.000+02:00", "crawled": "2017-11-15T02:15:46.000+02:00", "highlightTitle": ""}