{"organizations": [], "uuid": "5ff2a851d0841714f22f05525c49966953b63b7b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13858685.ece/ALTERNATES/s1200/SGP_NEC_021017VINCE05JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/liberal-democrat-leader-vince-cable-13857683", "country": "GB", "domain_rank": 21960, "title": "Liberal Democrat leader Vince Cable on Brexit, devolution and the party's chances in the North East", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-05T10:00:00.000+02:00", "replies_count": 0, "uuid": "5ff2a851d0841714f22f05525c49966953b63b7b"}, "author": "Sean Seddon", "url": "http://www.chroniclelive.co.uk/news/north-east-news/liberal-democrat-leader-vince-cable-13857683", "ord_in_thread": 0, "title": "Liberal Democrat leader Vince Cable on Brexit, devolution and the party's chances in the North East", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "News Liberal Democrat leader Vince Cable on Brexit, devolution and the party's chances in the North East The veteran politician sat down with ChronicleLive ahead of his address to the North East Chamber of Commerce Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \n“There is a real spirit in this area but it’s not being channelled properly.” \nThat’s Liberal Democrat leader Vince Cable’s assessment of the North East - heading for Brexit without a significant devolution deal and facing rocky times. \nSince the EU referendum , his party has been going the length and breadth of the country warning Britain is clumsily idling towards disaster. \nIn the chaos which is looming, he says, the North East needs to stand up for itself - and that isn’t happening. \nThe 74-year-old made the comments to ChronicleLive ahead of his address to the North East Chamber of Commerce on November 2. \nHe said: “I think one of the great disasters of modern local government history is when the North East voted against having its own assembly and regional Government because that would have really put the North East on the map in the way that Scotland is. \n“That’s been, that’s history. Vince Cable (Image: Newcastle Chronicle) \n“Since then, what’s happened is Teesside has got itself well organised, they’re very effective and have reached a deal with Government. \n“What you’re now seeing is other areas - like Manchester, Birmingham, Liverpool, Leeds and Bradford - have got their acts together and got interesting devolution deals from central Government over skills, innovation and housing in some cases. \n“The North East, partly because of friction between different local councils, isn’t even at that point.” Read More Vince Cable admits Westminster abuse scandal is 'dark moment' for politics during Newcastle visit \nCouncil bosses from Newcastle, North Tyneside and Northumberland are currently in discussions over a ‘north of the Tyne’ devolution deal but nothing has been agreed yet. \nThis matters now more than ever, he says, because the region and the country at large could be about to enter a period of unprecedented economic disruption. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nThe region’s manufacturing base is his biggest concern: the government’s Nissan deal won’t mean much if companies like Hitachi and Sage fall through the cracks, he says. \nMr Cable said: “There’s no reason why [the North East] should suffer disproportionately more - actually, the main casualty is likely to be in areas like financial services which are not a big industry up here. \n“But this area starts from, in a way, a lower base - certainly income levels and levels of training and education are less than other parts of the UK so people are less adaptable and less able to move. \n“There are positives - you have very good universities, provided they’re not damaged by Brexit and don’t lose access to research funding and staff. Vince Cable chats with Chronicle reporter Sean Seddon at the Crowne Plaza Newcastle (Image: Newcastle Chronicle) \n“Some of the manufacturing industries are global industries so I want to be positive, I think the region has got actually quite a lot going for it, it’s not as negative as people up here often describe it to me. \n“But Brexit is not good news generally for parts of the country which were already struggling. It’s going to be hit hard.” \nCable has been advocating a second referendum to give people the chance of having an “exit from Brexit” once they’ve assessed the consequences of the Leave vote. \nBut how does he square his belief that the North East will suffer outside of the EU with the fact that, other than Newcastle, the whole region voted to Leave and rejected his party in June when it was led by Tim Farron? Read More Amber Rudd attacks police bosses like Dame Vera Baird for asking for more money \nHe described the leave vote as a “protest” inspired by anger over stagnating wages and says his party need to convince people that living standards will decline more dramatically once we leave the EU. \nThe last general election came too early for the party, he said, and a Labour resurgence cancelled out any chance they had of making gains. \nBut he’s confident that will change: once the consequences of Brexit filter into people’s decision making and once the Corbyn bubble bursts, there will be a window for Cable and his party in places like the North East where they’ve shrunk in recent years but once had a strong base. \nThen, he says, the party can make their pitch: “I think what’s happening in the country generally is people are getting very alarmed by the way in which British politics has become very polarised between the hard-right and the hard-left and a lot of people just want a common sense, middle of the road alternative. \n“We’re practical people, we believe in running things well, we believe in sound money but also in having a social conscience, we’re concerned about inequality, about have good public services. \n“I think that mix of things is missing in British politics.” \nVince Cable truly believes the Liberal Democrats are on the cusp of a comeback in parts of the country like the North East. \nStranger things have happened - most of them in the past few years. Like us on Facebook", "external_links": [], "published": "2017-11-05T10:00:00.000+02:00", "crawled": "2017-11-05T11:11:04.003+02:00", "highlightTitle": ""}