{"organizations": [], "uuid": "d49568aeace7c739d4ca4ec18fc8494700a21e99", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article762871.ece/ALTERNATES/s1200/The-Robinson-family-Joshua-Kat-Lottie-Hermione-and-Matt-outside-their-home-at-Sherford.jpg", "site_section": "http://www.middevongazette.co.uk/news.rss", "section_title": "devonlive - News", "url": "http://www.devonlive.com/news/devon-news/one-devons-newest-towns-welcomes-762880", "country": "GB", "title": "One of Devon’s newest towns welcomes their first baby", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-11T17:40:00.000+02:00", "replies_count": 0, "uuid": "d49568aeace7c739d4ca4ec18fc8494700a21e99"}, "author": "Zoe Stevens", "url": "http://www.devonlive.com/news/devon-news/one-devons-newest-towns-welcomes-762880", "ord_in_thread": 0, "title": "One of Devon’s newest towns welcomes their first baby", "locations": [], "entities": {"persons": [{"name": "lottie robinson", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "matt", "sentiment": "none"}, {"name": "robinson", "sentiment": "none"}, {"name": "lottie rose robinson", "sentiment": "none"}, {"name": "jesse chevrolle", "sentiment": "none"}, {"name": "sherford", "sentiment": "none"}, {"name": "hermione", "sentiment": "none"}, {"name": "kat robinson", "sentiment": "none"}, {"name": "lottie", "sentiment": "none"}, {"name": "joshua", "sentiment": "none"}, {"name": "kat", "sentiment": "none"}], "locations": [{"name": "sherford  mum kat", "sentiment": "none"}, {"name": "heybrook", "sentiment": "none"}, {"name": "cornwall", "sentiment": "none"}, {"name": "sherford", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "sherford share    one of devon", "sentiment": "none"}, {"name": "dubai", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}, {"name": "derriford hospital", "sentiment": "none"}], "organizations": [{"name": "bovis homes", "sentiment": "none"}, {"name": "sherford", "sentiment": "none"}, {"name": "bovis", "sentiment": "none"}, {"name": "plymouth herald", "sentiment": "none"}, {"name": "devon royal marine", "sentiment": "none"}, {"name": "robinsons", "sentiment": "none"}, {"name": "stratton creber countrywide", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "One of Devon’s newest towns welcomes their first baby Little Lottie Robinson has claimed the title as the first Sherford baby Share The Robinson family Joshua, Kat, Lottie, Hermione and Matt outside their home at Sherford Share Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nOne of Devon’s newest communities has just welcomed its latest arrival - the first Sherford baby. \nThe new town, which is on the outskirts of Plymouth, saw a milestone for the new development when Lottie Rose Robinson arrived at 8lbs 3oz at Derriford Hospital. \nLottie is now back at home in Sherford with her parents, Kat and Matt and 11-year-old twin brother and sister, Joshua and Hermione, reports The Plymouth Herald . Lottie and her parents Kat and Matt who live at Sherford \nMum Kat said: “Lottie was 15-days late and kept us waiting. \n“We are over the moon with our new arrival and it’s nice to be part of something so special for Sherford.” \nThe Robinson family moved into a new Bovis home in June 2017 and are now looking forward to bringing Lottie and the twins up in the exciting environment of a developing new community. Read More Tributes paid to ‘brave’ Devon Royal Marine found dead onboard navy ship in Dubai \nThe newborn is expected to go to school in the area. Kat said: “Work will be starting on Sherford’s first primary school soon, and it’s amazing to think that this is where Lottie will be going to school. \n“We are also really excited about the forthcoming sports centre, as we are a very active family and the development of the high street looks amazing – especially for a local shop to get those nappies and wine – of course.” \nThe arrival of Lottie in Sherford sparked interest in the Bovis homes sales office - the whole team have got to know the Robinsons well this year and monitored Kat’s progress intently. Lottie and Kat Robinson with Bovis Homes sales advisor, Jesse Chevrolle \nSales advisor, Jesse Chevrolle said: “We’re so delighted to be welcoming Lottie into the Sherford family. \n“Now the community is taking shape we are seeing a number of milestones – but having our first baby arrive back at the development is definitely one of the most exciting.” \nChoosing Sherford as a place to bring up their children was an easy decision for Matt who is a regional manager at Go Outdoors and Kat, who is the branch manager for Stratton Creber Countrywide estate agents. Read More 4,605 apply to be UK citizens in South West after Brexit vote \nThe new town will feature an array of one and two-bedroom apartments as well as five and six-bedroom homes. \nMoving into a four-bed Heybrook house at Sherford, the couple will have plenty of space for their growing family. \n“We wanted to buy a new home and his was a great location for my husband’s job”, explained Kat. Read More More than 1,600 banned from road in Devon and Cornwall in a year \n“We loved the unique style of the houses at Sherford, particularly the high ceilings in traditional Georgian style.” \nMatt said: “It has been quite amazing how quickly the town is taking shape already after only a year. The consortium organised a housewarming event for all the residents to meet which was great. \n“All that’s missing now is a pub.” Like us on Facebook ", "external_links": [], "published": "2017-11-11T17:40:00.000+02:00", "crawled": "2017-11-11T17:58:34.012+02:00", "highlightTitle": ""}