{"organizations": [], "uuid": "388b1ad21aa684b879b12e268b580e193910d1eb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13643066.ece/ALTERNATES/s1200/Graduations.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/universities-ask-government-help-stop-13898052", "country": "GB", "domain_rank": 21960, "title": "Universities ask Government to help stop a Brexit brain drain happening", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-13T20:00:00.000+02:00", "replies_count": 0, "uuid": "388b1ad21aa684b879b12e268b580e193910d1eb"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/universities-ask-government-help-stop-13898052", "ord_in_thread": 0, "title": "Universities ask Government to help stop a Brexit brain drain happening", "locations": [], "entities": {"persons": [{"name": "david davis", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "bill", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "davis", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}, {"name": "withdrawal bill", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "share newcastle university", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "russell group", "sentiment": "none"}, {"name": "commons home affairs committee", "sentiment": "none"}, {"name": "european economic area", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Universities ask Government to help stop a Brexit brain drain happening Top universities say almost a quarter of their academics are EU nationals - and they are concerned about the future Share Newcastle University students celebrate their achievements at the summer graduation ceremonies (Image: UGC TNE) Share Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nTop universities including Durham and Newcastle have warned they face a brain drain after Brexit. \nThey urged the Government to recognise that academics are highly skilled, even though they may not have high salaries. \nAnd they said that EU staff and students currently face “an uncertain future” because it still isn’t clear what their status will be after Brexit. \nThe warning came from the Russell Group, which represents 24 leading UK universities, in a paper submitted to the Commons Home Affairs Committee. \nThey said 25,000 EU nationals are currently employed by Russell Group universities, and they made up 23% of academics, almost a quarter. \nThere are also more than 60,000 EU students studying at the universities. \nThe universities warned: “Introducing visa restrictions for EU nationals in the future would serve as a barrier to prospective staff and students and would increase administration and recruitment costs. This could threaten the ability of our universities to recruit the skills they need in an efficient and cost-effective way.” \nAt the moment, future expected earnings are taken into account when UK Visas and Immigration, a Home Office agency, considers applications for work permits from people outside the European Economic Area. \nA partner’s salary is also a factor in determining whether a spouse from overseas will be allowed to move to the UK. \nBut the universities said a future immigration system should recognise that some academics may have specialised skills without being well paid. \nIt should “acknowledge that earnings thresholds alone are not fit for purpose as a proxy for the level of skill and specialisation necessary to undertake research, teaching and technical support in universities,” the Russell Group said. \n“Universities are non-for-profit organisations and are subject to various funding constraints. \n“They are also often unable to vary the salary offered for particular roles because of nationally agreed pay scales and government pay constraints for publicly funded roles. \n“Salary thresholds also fail to capture the package of benefits that staff at our universities receive, including generous employer pension contributions. For these reasons, salaries alone should not be used as a proxy for skill level or to identify the highly expert roles in universities.” \nBrexit Secretary David Davis told the House of Commons that MPs will have a debate and vote on a Withdrawal Agreement and Implementation Bill, which will cover issues such as citizens rights, any financial settlement and the details of any implementation period agreed between both sides. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nThis will come on top on a vote on a final deal. \nHowever, he also told MPs that the UK would leave the EU even if the Bill was rejected. \nAnd he confirmed that there would be no vote if there is no deal, because there would be nothing to vote on - although Brexit would still go ahead. \nAmid suggestions that pro-EU Tories are willing to rebel on the Withdrawal Bill this week to ensure a meaningful vote on the Brexit deal, Mr Davis said in a House of Commons statement: “It’s clear that we need to take further steps to provide clarity and certainty both in the negotiations and at home, regarding the implementation of any agreement into United Kingdom law. Read More Theresa May prepares for eight days of Brexit battle \n“I can now confirm that once we have reached an agreement we will bring forward a specific piece of primary legislation to implement the agreement.” \nHe went on: “This confirms that the major policy set out in the withdrawal agreement will be directly implemented into UK law by primary legislation, not by secondary legislation with the Withdrawal Bill. \n“This also means that Parliament will be given time to debate, scrutinise and vote on the final agreement we strike with the European Union. Like us on Facebook ", "external_links": [], "published": "2017-11-13T20:00:00.000+02:00", "crawled": "2017-11-13T20:30:55.000+02:00", "highlightTitle": ""}