{"organizations": [], "uuid": "1d73c250b45537ef655a8518b79946312dff412f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13858106.ece/ALTERNATES/s1200/Budget-2017.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/autumn-budget-2017-date-time-12621043", "country": "GB", "domain_rank": 21960, "title": "The Autumn Budget 2017 - when is it and what could be in it for the North East?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-16T15:39:00.000+02:00", "replies_count": 0, "uuid": "1d73c250b45537ef655a8518b79946312dff412f"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/autumn-budget-2017-date-time-12621043", "ord_in_thread": 0, "title": "The Autumn Budget 2017 - when is it and what could be in it for the North East?", "locations": [], "entities": {"persons": [{"name": "philip hammond", "sentiment": "neutral"}, {"name": "david cameron", "sentiment": "none"}, {"name": "hammond", "sentiment": "none"}, {"name": "jeremy hunt", "sentiment": "none"}, {"name": "paul whiteman", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "will hammond", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "newcastle airport", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}, {"name": "newcastle international airport", "sentiment": "none"}], "organizations": [{"name": "house of commons", "sentiment": "none"}, {"name": "national health service", "sentiment": "none"}, {"name": "newcastle airport", "sentiment": "none"}, {"name": "democratic unionist party", "sentiment": "none"}, {"name": "national insurance", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "institute for fiscal studies", "sentiment": "none"}, {"name": "budget", "sentiment": "none"}, {"name": "naht", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily   Thank you for subscribing!   \nPhilip Hammond is preparing to deliver his first Autumn Budget and it comes as he is under increasing pressure to put some money into planning for a no-deal Brexit . \nBut demands for extra cash are coming at him from all angles - for health, education, benefits and housing to name but four - and that’s before we get to the regions. \nSo what is likely to be in the Chancellor’s budget and when do we find out? \nBelow, we take a look at what could happen and what it is likely to bring to the North East and the rest of the UK. Firstly, when is budget going to take place? \nPhilip Hammond will deliver his second budget of the year on Wednesday, November 22. What will it set out to do? \nThe budget, presented in the House of Commons, will set out the Government’s economic plan for the country. It is the first time in more than 20 years the budget will be presented in the Autumn when in previous years it has been called the Autumn Statement. \nWhat’s the difference between the Budget and the Autumn Statement? \nTraditionally, the Budget was used to outline plans for taxation, and the Autumn Statement featured spending plans and financial forecasts. Read More MP says North East schools are falling behind and warns they are underfunded by £360 million Why has there been a change? \nThe Autumn Statement was scrapped by Hammond in 2016. At the recommendation of the Institute for Fiscal Studies (IFS), there is now a Spring Statement instead, with the Budget presented later in the year. \nThe Government has said that changing the tax system once a year, rather than twice, will lead to greater financial stability. What could be in it? \nDuring the Tory party conference Theresa May announced a freeze on tuition fee rises, as well as an increase in the threshold where graduates have to pay back their loans - we may see more detailed plans on tuition fees in Hammond’s speech. Graduates (Image: PA) Could there be good news for people who work? \nThe Conservatives’ election manifesto promised a personal allowance of £12,500 and a higher rate threshold of £50,000 by 2020. That implies increases of £1,000 and £5,000 spread over the next three tax years. There might be movement here. Is there any good news for home owners? \nThere were a couple of housing announcements recently too - including a £10bn commitment to fund Help To Buy mortgages and £2bn more for new social and council housing. Again, these are already out there, but we may see more detail. Read More £300m for high-speed rail in the North dismissed as 'drop in the ocean' Aren’t we missing something here? Begins with a ‘B’. \nOK, Brexit. The Prime Minister has already announced £250 million in extra departmental spending for preparations - which includes planning for “no-deal” scenarios. The Brexit legislative programme will mean Hammond is unlikely to risk any controversial proposals that could upset backbenchers, such as major revisions to pension tax relief or other tax increases. What other constraints are there on Mr Hammond? \nOn the expenditure side, Hammond must find an extra £0.5bn a year over the next two years that was pledged to Northern Ireland as part of the Democratic Unionist Party’s “confidence and supply” deal following this year’s election. Chancellor Philip Hammond (Image: PA) How will he manage that? \nAlready millions of self-employed workers have been deprived of a £148 cut to their National Insurance bills after Mr Hammond went back on a pledge. \nClass 2 National Insurance contributions were due to be abolished next April. But the Government said the move would be delayed by a year. It is a blow to 3.4million workers. Delaying the move will save the Government around £200million. Will there be extra cash for schools? \nHeadteachers have warned MPs that school budgets in England are facing “breaking point” after a combined £2.8bn in cuts and costs imposed upon them by the government. Paul Whiteman, the NAHT’s general secretary, has said: “The autumn budget is the last chance for money to make it to schools this year., or schools.” Will Hammond listen? The jury’s out on that one. What about the NHS? \nHealth secretary Jeremy Hunt has said that the National Health Service needs more money. The government has already said that it will lift the 1 per cent cap on public sector pay rises for some workers, including NHS staff, although it has emphasised the role of independent pay review bodies in determining increases for other public employees. To pay for all NHS staff by 3 per cent - the rate of inflation - would cost about £1bn. Newcastle Airport (Image: Handout, publicity picture) What to expect for the North? \nThere are long term demands for the abolition of Air Passenger Duty to counterbalance moves already under way in Scotland. It will mean cheaper fares over the border which could impact on Newcastle International Airport and the local economy. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nDespite lobbying by business leaders and a commitment in 2015 by then Prime Minister David Cameron not to allow the devolution of APD to impact on regional airports, it doesn’t seem to be on Hammond’s radar just yet. Although he might surprise us. Read More The little known tax that could impact on your holidays out of Newcastle Airport So not looking good there. Anything else? \nIn a document submitted to the government for consideration in the Autumn Budget, the Northern Powerhouse Partnership (NPP) underlined fully costed, evidence-based proposals for four areas of Northern excellence which could, with government funding and business support, “rival the best countries and regions in the world”. \nAmong them was the enhancement of the region’s digital clusters, which it believes can generate GVA of £41.1bn (in 2011 prices) in 2050. Perhaps the region can get something out of this. Like us on Facebook", "external_links": [], "published": "2017-11-16T15:39:00.000+02:00", "crawled": "2017-11-16T15:58:27.005+02:00", "highlightTitle": ""}