{"organizations": [], "uuid": "0109e7793a55d31c0dcc97e719a932443f867103", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article459274.ece/ALTERNATES/s1200/Ben-Bradshaw-2PNG.png", "site_section": "http://www.middevongazette.co.uk/politics.rss", "section_title": "devonlive - News", "url": "http://www.devonlive.com/news/devon-news/ben-bradshaw-judge-led-inquiry-740077", "country": "GB", "title": "Ben Bradshaw: Judge-led inquiry must probe ‘Russian role’ in EU Referendum and 2017 General Election", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-07T16:00:00.000+02:00", "replies_count": 0, "uuid": "0109e7793a55d31c0dcc97e719a932443f867103"}, "author": "Zoe Stevens", "url": "http://www.devonlive.com/news/devon-news/ben-bradshaw-judge-led-inquiry-740077", "ord_in_thread": 0, "title": "Ben Bradshaw: Judge-led inquiry must probe ‘Russian role’ in EU Referendum and 2017 General Election", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ben Bradhsaw after increasing his majority in May   \nAn influential Westcountry MP says a judge-led inquiry must be set up investigate alleged Russian interference in the EU Referendum and 2017 General Election campaigns. \nBen Bradshaw says the Government can no longer remain silent amid “mounting evidence” of the Kremlin’s intrusion in the democratic process. \nThe Exeter Labour MP said it was welcome that the House of Commons Culture Select Committee has announced an inquiry into Russian generated and funded social media interference in the EU Referendum. But what was needed was a formal inquiry process that could demand and hear evidence under oath, as the United States has with the Mueller Investigation led by their Justice Department’s special counsel. Read More Nine Exeter City football fans in court after 'mass brawl' in city centre \n“There is mounting evidence that the Russians interfered in the US Presidential Election.That is a fact that nobody now seriously doubts and the evidence has been emerging of the connections on this side of the Atlantic,” said Mr Bradshaw. \n“There is mounting evidence that they did it here in our democratic process too. This needs an inquiry led by a judge. \n“There is no doubt the Mueller Investigation will unearth more evidence. This is making the [UK] Government look secretive and flat-footed.” Read More Tourist cleared of Sandy Bay caravan park attack \nMr Bradshaw said that when he began pushing the Government on the issue a year ago he was merely asking “innocent questions” based on his knowledge of how the Kremlin works. \nBefore entering Parliament in 1997 he was a BBC reporter based in the former East Germany, part of the Russian dominated Eastern Bloc of countries. His first government role was as security minister under Tony Blair in 2001. \n“The questions I have been asking started a stream of information and tip-offs to me from people close to the intelligence community, financial investigators and investigative journalists. This has snowballed. I have had information come in from Australia, America, Germany and Italy. Read More Exeter City Council chief executive Karime Hassan named a 2017 'Face of Growth' \n“Evidence to the Mueller Investigation is coming from Britain and people based here. \n“We have learned that the Electoral Commission reported Ukip to the Metropolitan Police for receiving impermissible donations in the run-up to the EU Referendum and nothing happened. \n“It is welcome that the commission has announced two formal investigations, something I called for months ago. It is welcome that the Culture Select Committee is launching an investigation, which I asked them to do six months ago,” said Mr Bradshaw, who was Secretary of State for Culture, Media and Sport from 2009 to 2010 in Gordon Brown’s government. Read More Police search for two missing teenagers in Devon \n“But we need a judge-led inquiry.” \nThe Electoral Commission had fined the Democratic Unionist Party (DUP) – which is supporting Theresa May’s minority government – for accepting an impermissible donation and the potential of “dark money” particularly in the EU Referendum campaign had to be investigated, he said. \nThe inquiry would not undermine the Government’s negotiations on Brexit if questions were raised on the integrity of the EU Referendum campaign or result. Read More \n“I personally do not think that Brexit will happen, but not for that reason – that is to do with economic and strategic issues and the damage done to the NHS. \n“This is not about the outcome of the EU Referendum. \n“This is about the security and integrity of our democracy and evidence of interference by a foreign power. Read More Firefighters rescue stranded sheep and cows 'up to their necks' in water on island \n“Whether we voted Leave or Remain that is something that we should all be concerned about. \n“This is picking up traction,” said Mr Bradshaw who has written to the parliamentary commissioner for standards, asking her to investigate the DUP donation from the Constitutional Research Council, a group that helped to fund the Brexit referendum campaign, but about which little is known.” Like us on Facebook", "external_links": [], "published": "2017-11-07T16:00:00.000+02:00", "crawled": "2017-11-07T16:09:25.000+02:00", "highlightTitle": ""}