{"organizations": [], "uuid": "33c899f6399026b607e095c99c57fea50f83d735", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article627116.ece/ALTERNATES/s1200/Storm-damage-at-Dawlish-damage-to-the-railway-tracks-and-road-at-Riviera-Terrace-and-Sea-lawn-Terrace-Dawlish-2014.jpg", "site_section": "http://www.westernmorningnews.co.uk/editorschoices.rss", "section_title": "devonlive - frontpage", "url": "http://www.devonlive.com/news/business/how-westcountry-been-left-hanging-818747", "country": "GB", "title": "This is how the Westcountry has been left hanging in the Chancellor's Budget", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-22T21:48:00.000+02:00", "replies_count": 0, "uuid": "33c899f6399026b607e095c99c57fea50f83d735"}, "author": "Hannah Finch", "url": "http://www.devonlive.com/news/business/how-westcountry-been-left-hanging-818747", "ord_in_thread": 0, "title": "This is how the Westcountry has been left hanging in the Chancellor's Budget", "locations": [], "entities": {"persons": [{"name": "chris garcia", "sentiment": "none"}, {"name": "michael beadel", "sentiment": "none"}, {"name": "sajid javid", "sentiment": "none"}, {"name": "sarah heald", "sentiment": "none"}, {"name": "cllr john hart", "sentiment": "none"}, {"name": "chris loughlin", "sentiment": "none"}, {"name": "susan davy", "sentiment": "none"}, {"name": "hammond", "sentiment": "none"}, {"name": "tim jones", "sentiment": "none"}, {"name": "bill martin", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "mark duddridge", "sentiment": "none"}, {"name": "heald", "sentiment": "none"}, {"name": "cllr hart", "sentiment": "none"}, {"name": "bruce keogh", "sentiment": "none"}, {"name": "john hart", "sentiment": "none"}, {"name": "philip hammond", "sentiment": "none"}], "locations": [{"name": "westminster", "sentiment": "none"}, {"name": "exeter science park", "sentiment": "none"}, {"name": "cinderella south west", "sentiment": "none"}, {"name": "cornwall", "sentiment": "none"}, {"name": "devon share click", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}, {"name": "petroc", "sentiment": "none"}, {"name": "st austell", "sentiment": "none"}, {"name": "great south west", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "midlands engine", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}, {"name": "south west  chris garcia", "sentiment": "none"}, {"name": "somerset", "sentiment": "none"}], "organizations": [{"name": "viridor", "sentiment": "none"}, {"name": "south devon college", "sentiment": "none"}, {"name": "devon county council", "sentiment": "none"}, {"name": "city college plymouth", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}, {"name": "industrial strategy", "sentiment": "none"}, {"name": "office for budget responsibility", "sentiment": "none"}, {"name": "exeter college", "sentiment": "none"}, {"name": "pennon group plc", "sentiment": "none"}, {"name": "stephens scown llp", "sentiment": "none"}, {"name": "midlands engine", "sentiment": "none"}, {"name": "lep", "sentiment": "none"}, {"name": "northern power house", "sentiment": "none"}, {"name": "hm treasury", "sentiment": "none"}, {"name": "northern powerhouse", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "devon colleges group", "sentiment": "none"}, {"name": "cornwall business council", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "This is how the Westcountry has been left hanging in the Chancellor's Budget There is virtually nothing for us in Devon Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nThe Westcountry has been snubbed in major funding pledges for the UK regions. \nIn his budget statement yesterday, Chancellor Philip Hammond gave special mention to the Northern Power House, Midlands Engine, and high speed rail HS2 with half of a £1.7bn transforming cities pots pledged to six elected metro mayor regions. \nBut virtually nothing for the South West. Tim Jones, Chairman of Devon and Cornwall Business Council \nTim Jones, chairman of the Devon and Cornwall Business Council, said: “We have been snubbed and I’m afraid to say it, but it’s the Cinderella South West yet again.” Read More How 'robots' will transform every business in Devon within 10 years \nBut it may not be all bad for the region. \nThough not announced in Hammond’s speech, HM Treasury has confirmed there will be £79million investment in a brand-new link road connecting the A30 to St Austell. \nBut the biggest prizes in Hammond’s regional Industrial Strategy are areas that have a devolution deal, based on the elected mayor system, or areas like the Midlands Engine that have presented leadership on strong priorities for investment. Sarah Heald, pictured far left, Chris Loughlin, Bill Martin, Susan Davy, Mark Duddridge, Sajid Javid and Chris Garcia at the inaugural Growth Summit 2016. \nNow it’s the job of the #BackTheSouthWest campaigners, who have led the Great South West initiative, to put the region top of the Government’s priority list. Read More Nine reasons why Devon, Cornwall and... \nA key partner in the campaign is Pennon Group plc, owners of South West Water and waste management company Viridor. \nSarah Heald, Director of Corporate Affairs and Investor Relations, said:“We are disappointed that there is little explicitly mentioned for the South West, especially when other parts of the UK are receiving sizeable sums and significant support. This regional disparity has to be rebalanced to give all parts of the UK a fair chance of improving their prosperity and productivity. Together, as part of Back the South West campaign, we must all redouble our efforts to ensure the Government listens to and acts on the needs of the Westcountry.” Read More How you can help us boost productivity for long term prosperity in the South West \nChris Garcia, Chief Executive of the HoSW LEP said that region is primed with potential to help create the “global Britain” that the Chancellor referred to in his speech. \n“However, we were disappointed not to be name checked in the speech or the budget, and that the focus is very much on specific cities with particular emphasis on those that have opted for an elected Mayor. \n“It’s our aim, along with our partners in business, the local authorities and the other south west LEPs, to demonstrate the immense contribution that can be delivered from our potentially thriving region: The Great South West – which can rival the economies of the Northern Powerhouse and Midlands Engine. We need to drive this message home to the front benches of Westminster and show the country what we’re worth.” Devon County Council leader John Hart \nAnd Cllr John Hart, leader of Devon County Council said that the announcements were encouraging for Devon. In September, Cllr Hart pressed the case for a devolution deal for Devon and Somerset with ministers at Westminster. Read More 'Abolish Devon district and borough councils to create super authority', study says \nThe two counties currently have an annual economy worth over £34 billion – more than Britain’s second city, Birmingham. \nHe said: “I was heartened to see the Government looking at more devolution packages and we are telling them consistently, give us the powers and we will deliver.” Read More \nAnd there was some good news in the budget for Devon and Cornwall. \nThe region could well tap into a £31billion productivity fund with £1.2billion for research and development. \nA £500million pledge has also been made to support AI, 5G mobile connectivity and Full Fibre Broadband. Read More The first street at Exeter Science Park is about to take shape \nMichael Beadel, chairman of Stephens Scown LLP, one of the partners in the Back the South West campaign said: “Our exciting digital and tech sector is a great asset for the area, so the investment in 5G mobile networks, fibre broadband and AI is welcome. Efforts to reinvigorate the economy by injecting more money into R&D and supporting the development of electric cars again hold promise.” \nThere has also been money to support skills to fuel the new digital economy, including £40million to train additional maths teachers, a £600 pupil premium for post 16 maths students the creation of a further 12,000 computer science teaching roles. \n£30million is also being made available for digital distance learning courses. \nA spokesman for Devon Colleges Group made up of City College Plymouth, Exeter College, Petroc and South Devon College, said the budget goes some way to redressing the current inbalance when funding drops for students as they move into sixth form. \nShe said: “Today’s budget created an opportunity to address this inequality, but the further education sector has been largely overlooked. As a group we are disappointed that overall levels of funding per learner have not been uplifted. \n‘That said, we welcome the budget’s proposed investment in science, maths, digital and technical education and training. \n“We are particularly pleased that the additional £20 million for colleges to deliver T-levels recognises our important role at the heart of technical education.” \nThe government vision of th future of the economy and how it intends to boost productivity are expected to come in the Industrial Strategy white paper next week. \nMs Heald said: “We welcome the continued focus on investment in new and more resilient infrastructure to drive growth and improve connectivity”. \nEfforts to boost productivity are vital as the chancellor revealed a predicted downturn of GDP growth for each of the next five years as a result of the UK’s poor productivity performance. What is productivity? \nProductivity refers to the amount of work produced either per worker or per hour worked. \nLooking at the wider economy, productivity refers to the value of the goods and services produced over a period of time. This is referred to as GDP (Gross Domestic Product). \nFor example, an electrical engineer can travel from place to place fixing six appliances a day. \nBut if she comes across barriers to her productivity - her output will be hindered. \nPoor management may mean her working day is badly organised, poor road networks may mean she gets snarled up in traffic and if diagnostic technology is unable to function because of poor mobile or internet connectivity, she will be unable to reach as many customers as she would like - leading to poor productivity and a downturn in profit. \nWhy does it matter? \nProductivity growth reflects how efficiently we are all working. If productivity rises, workers get paid more and the spending helps to boost the economy. \nThe Treasury’s official watchdog, the Office for Budget Responsibility, downgraded its estimate of the UK’s future productivity growth below the 2% forecast to 1.5% in 2017, 1.4% in 2018, 1.3% 2019 and 2020 increasing to 1.5% in 2021 and 1.6%in 2022. \nHow can we raise our productivity? \nInvestments in technology, infrastructure, research and skills are seen as the main ways we can boost productivity. \nThe OBR now expects to see GDP grow 1.5% in 2017 – down from the 2% forecast in March – 1.4% in 2018, 1.3% in both 2019 and 2020, before picking back up to 1.5% in 2021, and 1.6% in 2022. \nDespite the tight backdrop, Mr Hammond announced significant investments including an additional £15 billion for housing in a bid to reach the target of building 300,000 extra new homes a year by the mid-2020s. \nThere will be an extra £7.5 billion for the NHS over the next five years and £3 billion to prepare for the impact of Brexit. \nDespite suggestions that his second Budget of 2017 marked the end of the age of austerity in place during seven years of Conservative-led governments, they stressed that the OBR believes Mr Hammond is still on track to meet his fiscal targets – including balancing the nation’s books by the middle of the next decade. \nThe extra cash for health includes £2.8 billion for day-to-day spending to help NHS England deal with pressures this winter and make progress on hitting targets, as well as £3.5 billion of capital funding for new equipment and infrastructure. Mr Hammond also promised to fund any increase in health staff pay resulting from current negotiations on improving efficiency. \nBut NHS England national medical director Professor Sir Bruce Keogh said that the extra money would “definitely” not fill funding gaps in the service, warning that longer waits for care now seem “likely/unavoidable”. Like us on Facebook ", "external_links": [], "published": "2017-11-22T21:48:00.000+02:00", "crawled": "2017-11-22T22:50:12.000+02:00", "highlightTitle": ""}