{"organizations": [], "uuid": "97528d2899f8572c0e57a3d6eb6bb9c802298779", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13906457.ece/ALTERNATES/s1200/TMP_NEC_270417CompanyYearBizAwards28JPG.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/growing-companies-line-recognition-north-13906414", "country": "GB", "domain_rank": 21960, "title": "Growing companies in line for recognition at North East Business Awards", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-15T20:00:00.000+02:00", "replies_count": 0, "uuid": "97528d2899f8572c0e57a3d6eb6bb9c802298779"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/growing-companies-line-recognition-north-13906414", "ord_in_thread": 0, "title": "Growing companies in line for recognition at North East Business Awards", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Growing companies in line for recognition at North East Business Awards Let's Grow category is open to companies that have shown big growth in turnover and profitability Share Winner Let's Grow Award, Double Eleven, pictured Kimberley Turner with sponsor Graeme Mason (Image: newcastle chronicle) Share Get business   \nCompanies that have shown outstanding growth could be in line for recognition at next year’s North East Business Awards . \nThe Let’s Grow category at the awards recognises companies that have shown significant growth in turnover and profitability, and is currently held by Teesside computer game developer Double Eleven. \nThe category is open to businesses that have been trading for at least 12 months and which have shown rapid growth over the last year. Entrants will need to demonstrate an increase in sales, profit, market share or headcount, or point to a move into bigger premises or expanded to another region. \nJudges will be looking for growth in turnover and profitability, but also innovation in products, a solid plan for continuing growth and customer and staff engagement. \nWinners will be announced first in heats in Tyneside and Northumberland; Durham, Sunderland and South Tyneside; and in Teesside. The three winners will then compete for the overall title at the regional finals at Hardwick Hall in County Durham on April 26. \nSponsors for the category include ​FW Capital, Newcastle International Airport and Square One Law. \nAirport chief executive Nick Jones said: “We are thrilled to sponsor the awards again for 2017. This award is about celebrating companies that have shown strong business results and have a clear plan for sustained growth in the future. \n“Awards like this not only highlight the many fantastic businesses that are based in the region but also serve as an inspiration for other companies in the North East to strive to achieve great things too. Good luck to all the entrants!” \nA Square One spokesman said: “We are delighted to be supporting the Let’s Grow Award. \n“The North East economy has always relied on the growth of local businesses to create jobs and wealth for the region, but the continuing uncertainty surrounding the Brexit negotiations presents new and specific challenges to all UK businesses. \n“Add the fact that most sectors in the region face a well-documented skills shortage and that every business is only as strong as the next link in their supply chain, any business that is still able to grow and develop deserves to win an award!” \nJoanne Whitfield, fund manager at FW Capital, said: “Our expanding team of 10 executives is dedicated to making a positive impact on the regional economy by helping ambitious businesses access the capital they need to evolve, and we are proud to be working with the British Business Bank, the Tees Valley Combined Authority, the North East LEP, and Santander to help these firms succeed. \n“The Let’s Grow Award recognises hard work, commercial creativity and tenacity, as well as talent and business acumen, and the standard set by previous entrants has been extremely high.” \nThe awards are in association with NEECC and sponsored by a whole host of companies and organisations. The quality and the blue-chip nature of the sponsors adds to the prestige and gravitas of the awards. For more information and to become a sponsor, contact Sue Coulson, head of regional events, on 0191 201 6072. Read More", "external_links": [], "published": "2017-11-15T20:00:00.000+02:00", "crawled": "2017-11-15T20:04:55.004+02:00", "highlightTitle": ""}