{"organizations": [], "uuid": "ca1019436eb93dab6086532605834f7c46e1077c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article9801065.ece/ALTERNATES/s1200/JS49668848.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-opinion/young-old-who-am-supposed-13850710", "country": "GB", "domain_rank": 21960, "title": "The young or the old - who is it that I am supposed to hate?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-02T20:00:00.000+02:00", "replies_count": 0, "uuid": "ca1019436eb93dab6086532605834f7c46e1077c"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-opinion/young-old-who-am-supposed-13850710", "ord_in_thread": 0, "title": "The young or the old - who is it that I am supposed to hate?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Get business updates   \nAs someone who is neither young nor particularly old, I believe I am well placed to despise just about everyone else in the world. \nYoung people? A bunch of easily-offended snowflakes who bang on about how badly done to they are while buying £5 cups of fancy coffee and having the sort of lifestyle that their forebears could only dream of. \nThe old? Selfish swine who got free university education, affordable housing and jobs for life and thanked us all by voting for Brexit . \nIncreasingly I am coming to the realisation that the only people you can trust are 45-year-olds, though some of them I’m not so keen on either. 45-year-old ginger blokes living in Gosforth are OK but everyone else is a danger to society. \nIt’s easy to take against entire sections of the population, but judging people on their age is every bit as stupid as judging people on their gender, their race or anything else they can’t control. It is, to put it bluntly, a zero-sum game that singles you out as a Class A ding-a-ling. Read More The men making the headlines at the end of 2017 are pretty wretched: it's time for a change \nTo dismiss young people as “snowflakes” is lazy, patronising and stupid yet I hear people who should know better saying it all the time. The challenges of debt, housing costs and an ever-shifting employment scene make being in your twenties right now uniquely challenging. The fact that most of the people who use the term got a much better deal only makes it more irksome. \nSimilarly, it’s not right to blame older people for Brexit. Until we introduce a driving-licence style system where people have to re-apply for the ability to vote at the age of 75, oldies have every right to vote in the way they see fit. Read More The productivity problem that is a major issue for the North East \nWhat makes the generation war so daft is the ridiculous degree to which it generalises. Yes, more older people than young voted for Brexit but millions didn’t. Yes, some young people have daft beards and silly tattoos but that doesn’t stop them being hardworking, intelligent people. \nPigeon-holing people by their age groups is also hugely damaging. The world of work will increasingly need people of all ages and it needs the generations to work together more than ever. We need school leavers with better life skills and older people able to re-train and meet the needs of the digital revolution. \nRespecting our elders and being generous to the young are both good ideas. \nGraeme Whitfield is business editor of The Journal Like us on Facebook", "external_links": [], "published": "2017-11-02T20:00:00.000+02:00", "crawled": "2017-11-02T20:15:59.000+02:00", "highlightTitle": ""}