{"organizations": [], "uuid": "614aebcf2a827dc1b46919872a3f6e43d47cefc1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13938238.ece/ALTERNATES/s1200/1800px-x-810px-Splash.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/north-tyne-devolution-deal-live-13945677", "country": "GB", "domain_rank": 21960, "title": "What next for North East devolution after this week's Budget announcement?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-24T10:00:00.000+02:00", "replies_count": 0, "uuid": "614aebcf2a827dc1b46919872a3f6e43d47cefc1"}, "author": "Kathryn Riddell", "url": "http://www.chroniclelive.co.uk/news/north-east-news/north-tyne-devolution-deal-live-13945677", "ord_in_thread": 0, "title": "What next for North East devolution after this week's Budget announcement?", "locations": [], "entities": {"persons": [{"name": "tyne", "sentiment": "neutral"}, {"name": "phillip hammond", "sentiment": "none"}, {"name": "kathryn riddell", "sentiment": "none"}, {"name": "devo", "sentiment": "none"}, {"name": "philip hammond", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "south tyneside", "sentiment": "none"}, {"name": "river tyne", "sentiment": "none"}, {"name": "north tyneside", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}], "organizations": [{"name": "budget", "sentiment": "neutral"}, {"name": "northumberland county council", "sentiment": "none"}, {"name": "newcastle city council", "sentiment": "none"}, {"name": "universal credit", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}, {"name": "metro", "sentiment": "none"}, {"name": "budget recap", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "north tyneside council", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "north of tyne combined authority", "sentiment": "none"}, {"name": "wear metro", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Live updates as North of Tyne devolution deal is announced The 'North of Tyne' devolution deal is set to go ahead this week following the Chancellor's announcement - so what happens next? Share Click to play Tap to play The video will start in 8 Cancel Play now \nChancellor Philip Hammond announced in the Budget on Wednesday that the North of Tyne devolution deal, worth an initial £600m and months in the planning, will be officially launched this week. \nIt is a major announcement for the North East and means that three councils serving communities north of the River Tyne will join together to create a new North of Tyne Combined Authority, which will be led by a regional mayor to be elected in 2019. \nThose councils are Northumberland County Council, North Tyneside Council and Newcastle City Council. \nFormal agreement to the deal from the councils involved is expected to be announced this week , and includes funding of £600 million for the new authority paid over 30 years. \nThe creation of the North of Tyne Combined Authority raises questions about future funding for the councils not involved, including Gateshead, Sunderland, South Tyneside and County Durham. \nHere, we take you through the complexities of what has been announced so far, and we will bring you the latest updates as the councils move towards formal agreement. Read More Sean Seddon What will the deal mean for education? \nThe North of Tyne will launch an Education Improvement Challenge, a programme to raise standards across the area. \nIt was carried out in London in 2003 and was credited by some education experts as critical for turning around schools. \nThis will be the first time it has been done outside of the capital. \nHere’s a video explainer with more: 13:58 Sean Seddon When will we get a new mayor? \nElections for the new Mayor of the North of Tyne region will take place in May 2019. \nAn interim mayor will be appointed in summer 2018 until those elections take place. \nWe don’t know who’s going to run yet but it promises to be one of the most interesting political races in years. 12:40 Sean Seddon Could houses be built more quickly? \nThe establishment of a Housing and Land Board will allow the combined authority to acquire and dispose of land, agree a joint housing strategy and give the mayor the ability to issue compulsory purchase orders. \nIt’s hoped these powers will lead to more houses being built and getting it done more quickly. 12:32 KEY EVENT Will we be getting more money? \nYes - the government has agreed to provide £600m over 30 years but the final sum could be a lot more. \nAccording to the Treasury, the deal will boost the local economy by £1.1 billion and attract £2.1 billion in private investment. 12:26 Sean Seddon Benefits of a new mayor \nWe’ve had a look at what benefits we could see by having a regional mayor. \nBut will those south of the Tyne be missing out? 12:09 Sean Seddon Doubts over deal expressed by Liberal Democrats \nNewcastle’s Liberal Democrats have shown some doubts about the deal and what it will achieve. \nIn a statement they said: \nThe region’s political establishment has failed to make a notable success of the North East Combined Authority. We are sceptical that this new structure will enable Newcastle, North Tyneside, and Northumberland to keep pace with the likes of Manchester and Birmingham. \nIt lacks the more substantive powers on offer to other city-regions in respect of health and social care, and transport that look set to make a big difference to the growth and success of major city-regions like Greater Manchester and the West Midlands. \nThis Deal makes it more likely that the North East will compete with itself rather than the rest of the country, as North of Tyne, the South of Tyne rump of NECA, and Tees Valley vie to secure investment. \nThe Lib Dems are committed to the principle of greater devolution to the region, but we believe devolution be most effective when it is given the powers to realise our region’s true potential. \nWe will do what we can to scrutinise the Deal and to hold its office holders to account, and want to see Opposition representatives leading the new authority’s scrutiny function. \nWe hope that over time the structure and scope of the Deal can be expanded if progress is achieved. 12:00 South of Tyne not included in deal \nAndrew Hodgson from the LEP with some strong words for the south of Tyne authorities. \nSays they need to “think very hard”about their decision to not to go ahead with devolution. 11:54 Sense of relief as deal is signed \nAnd there it is - the North of Devolution is signed. \nThis devolution process started back in 2004. \nIt has taken an awfully long time to get to this photo opportunity. The sense of relief in the room from some is palpable. Devolution deal signed by council leaders and MPs 11:46 Sean Seddon 'Fighting fit for Brexit' \nNorthumberland County Council leader, Peter Jackson, has spoken about how the deal will get the region fighting fit for Brexit. Peter Jackson, Nick Forbes and Norma Redfearn \nHe also says he wants this to be the start and wants more devolution to follow. 11:36 Sean Seddon Devolution deal reached 'at last' \nThe mayor of North Tyneside Norma Redfearn has spoken about the devolution deal being reached ‘at last’. 11:28 Sean Seddon Aim to create jobs and growth \nNewcastle City Council leader Nick Forbes says the core aim of the deal is to create jobs and put the region at the centre of the modern digital economy. Nick Forbes, leader of Newcastle City Council, Norma Redfearn, directly-elected Mayor of North Tyneside and Councillor Peter Alan Jackson, leader of Northumberland County Council (Image: Newcastle Chronicle) \nHe also says this deal is all about exclusive growth - offering everyone opportunities for the future. 11:12 Sean Seddon North 'entering a golden age' \nJake Berry, minister for the Northern Powerhouse and Local Government, and Andrew Jones MP, Exchequer Secretary to the Treasury, are representing the government today. Northern Powerhouse Minister, Jake Berry MP (Image: Newcastle Chronicle) \nMr Berry says the North is entering a golden age. \nAndrew Jones MP from the Treasury is outlining the detail of the devolution agreement. He says it will give the North of Tyne “control over its own future”. 11:06 What will this mean for jobs? \nThe Treasury estimate the deal will create as many as 10,000 jobs. \nAn Inclusive Growth Board will be set up, bringing together council, government representatives and business figures to integrate skills and employment programmes. \nOn top of that, they’ll take over the £23m Adult Education Budget, a huge pot of money which will be used to make sure people have the skills they need to get jobs in the modern economy. Exterior of the County Hall in Morpeth, Northumberland (Image: J Catherall & Co Limited) \nThe North of Tyne has also been selected as the first area to pilot a new scheme to boost the rural economy. That’s good news for Northumberland . 10:55 Sean Seddon What will the new North of Tyne Combined Authority do? \nThe government has devolved a number of new powers to the North of Tyne Combined Authority (NTCA) which are all about boosting the economy, building houses, getting people into work and improving education. \nThe detail is broken down in sections below but, in broad terms, the NTCA is all about tackling systemic issues like housing shortages and unemployment in a more joined up way than has been possible before. North of Tyne devolution \nIt will have substantial powers and responsibilities which, until now, have been exercised by government officials in Whitehall on our behalf. 10:49 Northern Powerhouse minister in Newcastle to launch deal \nThe changes brought by the devolution deal has been summarised in this document. \nJake Berry MP, Minister for the Northern Powerhouse and Local Growth, and Andrew Jones MP, Exchequer Secretary to the Treasury, are in Newcastle today to officially launch the deal. 10:36 KEY EVENT What does this devolution deal change? \nThe North of Tyne devolution agreement will create a new combined authority comprised of Newcastle City Council, North Tyneside Council and Northumberland County Council. \nThat sounds a bit dull but it’s actually a massive shake-up to how we’re governed and brings the North of Tyne into line with places like Manchester and Liverpool which have already pressed ahead with devolution. \nIt won’t take any powers away from the councils, instead adopting powers which the region has never had before. Nick Forbes, leader of Newcastle City Council, Norma Redfearn, directly-elected Mayor of North Tyneside and Councillor Peter Alan Jackson, leader of Northumberland Council (Image: Newcastle Chronicle) \nWorking alongside the three council leaders will be a North of Tyne Mayor, an elected figure who will represent the new combined authority. 10:30 KEY EVENT Devolution deal launched today \nIt’s official - the North of Tyne has agreed a devolution deal with the government which will see the introduction of an elected mayor and a whole raft of new powers for the region. \nIt’s a big deal - this is the biggest change to how the region is run in decades and it comes with new powers and money. \nThe announcement raises a lot of questions: When will we get a mayor? What will the new North of Tyne authority do? Will this create jobs and boost housing? \nWe’re finding out more as the devolution deal is launched today. 10:22 Kathryn Riddell North of Tyne mayor on the cards \nAnother key announcement for the North East was the creation of a “North of Tyne” devolution deal . \nIt means that the three councils serving communities north of the Tyne, Northumberland, Newcastle and North Tyneside, will join forces to create a new combined authority to be chaired by an elected regional mayor, to be elected in 2019. Who could be the first North East Mayor? \nThe deal, which still requires formal agreement from the councils involved, includes funding of £600 million for the new authority paid over 30 years, designed to improve the economy. \nAnd the Treasury says the mayor will have “powers over important economic levers including planning and skills”. 10:07 KEY EVENT More funding after devolution deal? \nIn practice, there is likely to be more funding for the North of Tyne, as the Government is funnelling money to regions with mayors. \nFor example, Mr Hammond announced that regional mayors will automatically get money from a new £1.7 billion transport fund, with £59 million going to Tees Valley, which elected a mayor last year. \nOther regions, by contrast, will have to submit bids for a share of the cash. Nick Brown (Image: Newcastle Chronicle) \nNewcastle East MP Nick Brown said: “The money announced as part of the North of Tyne Devolution Deal over a thirty year period does not match the amount cut by the Government from these areas since 2010. \n“It does not deliver the fair funding needed for local government and our local public services and is not an end to the unfair treatment of our region by the Tory Government.” 09:42 Bad news for smokers \nThe price of cigarettes has gone up again after Thursday’s budget . \nThe average price of a pack of 20 cigarettes was £9.91 before Philip Hammond’s speech, \nBut now it’s an extra 49p - making the average price of a pack of 20 £10.40. The price of cigarettes has increased following the Autumn Budget (Image: Getty Images Europe) \nFor a 20 a day smoker, that adds up to an extra £178.85 a year. \nAnd you can’t stock up at the old price because the new rate came into force on Thursday night. \nThe UK is already the most costly place in Europe to be a smoker. \nIt was the second increase in a year following the switch from a spring budget to an autumn budget. 09:16 KEY EVENT Stamp duty scrapped for most first time buyers \nIf you’re a first time buyer, you’ll need to know about the stamp duty changes. \nIs it good news or will house prices go up as a result? 08:52 KEY EVENT Price of new Metro trains revealed \nThe price North East councils will have to pay to get new Metro trains has been revealed. \nAs reported on November 22, Philip Hammond, the Chancellor of the Exchequer, announced £337m worth of funding to replace the increasingly unreliable stock in the Budget . Newcastle's Central Station Metro (Image: Newcastle Chronicle) \nNow transport secretary Chris Grayling has confirmed the total amount of the local contribution to the project: £25m. \nIt’s not a surprise for the councils or Nexus - they were fully expecting to have to provide a local contribution and money has already been earmarked to pay for it.", "external_links": [], "published": "2017-11-24T10:00:00.000+02:00", "crawled": "2017-11-24T10:17:22.003+02:00", "highlightTitle": ""}