{"organizations": [], "uuid": "722480517c38b0c5cb1ed3651bbdcaa4092ab706", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13946895.ece/ALTERNATES/s1200/Sean-Sneddon.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/north-tyne-northumberland-devolution-deal-13946866", "country": "GB", "domain_rank": 21960, "title": "The North of Tyne region announces multi-million pound devolution deal", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-24T12:30:00.000+02:00", "replies_count": 0, "uuid": "722480517c38b0c5cb1ed3651bbdcaa4092ab706"}, "author": "Sean Seddon", "url": "http://www.chroniclelive.co.uk/news/north-east-news/north-tyne-northumberland-devolution-deal-13946866", "ord_in_thread": 0, "title": "The North of Tyne region announces multi-million pound devolution deal", "locations": [], "entities": {"persons": [{"name": "tyne", "sentiment": "negative"}, {"name": "norma redfearn", "sentiment": "negative"}, {"name": "coun forbes", "sentiment": "none"}, {"name": "peter alan jackson", "sentiment": "none"}, {"name": "nick forbes", "sentiment": "none"}], "locations": [{"name": "north tyneside", "sentiment": "none"}, {"name": "neca", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "teesside", "sentiment": "none"}], "organizations": [{"name": "ntca", "sentiment": "none"}, {"name": "northumberland county council", "sentiment": "none"}, {"name": "newcastle city council", "sentiment": "none"}, {"name": "department for international trade", "sentiment": "none"}, {"name": "liverpool", "sentiment": "none"}, {"name": "north east combined authority", "sentiment": "none"}, {"name": "budget", "sentiment": "none"}, {"name": "joint committee", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Norma Redfearn, the Mayor of North Tyneside, said it was time local councils put aside their differences and started working together more closely. \nShe said: “We are elected to do the best for our residents. \n“We need to rise above negativity and look for positive things we can do to benefit the region. \n“It makes sense for us to work together. \n“People don’t care about boundaries between council areas in their life - they just care about getting good jobs and looking after their families. \n“We all have very similar needs.” Nick Forbes, leader of Newcastle City Council, Norma Redfearn, directly-elected Mayor of North Tyneside and Councillor Peter Alan Jackson, leader of Northumberland County Council (Image: Newcastle Chronicle) \nOther stand out features of the agreement include a government pilot scheme to boost the rural economy, the ability of the new mayor to issue compulsory purchase orders to speed up house building and assistance for the region’s burgeoning digital start-up sector. \nThe area will also undergo an “Education Improvement Challenge”, similar to the programme which is credited with driving up school standards in London, and is the first place outside the capital to carry out the process. \nNegotiations over a combined authority for all seven North East councils collapsed last year due to internal divisions on the amount of funding being offered by government and the government’s insistence on the adoption of an elected mayor. \nCoun Forbes said the sort of arrangement that will see the creation of the NTCA has been shown to work across the country over the past few years. \nHe said: “This is completely new money and new powers coming directly from government to us. \n“Last time we had this debate it was entirely theoretical but now we can see these arrangements across the country, driving the economic agenda and getting investment. \n“Plus, we can now see that areas who have committed to devolution and have elected mayors get preferential treatment when it comes to bidding for government funds. \n“We won’t be handing powers over to a strong executive mayor, we’ll be working collaboratively and I hope people will welcome that grown up approach. \n“This will give us a real voice and means we will get our fair share.” \nBrexit looms over this deal as it looms over everything else in British politics and the three leaders said they want to “shape government policy on Brexit”. \nThe deal includes a commitment for a closer working relationship between the Department for International Trade and NTCA to protect the region’s crucial export market. \nWith North of Tyne pressing ahead with devolution - and a similar set-up already firmly in place on Teesside - the future of the four south of the Tyne authorities is unclear. \nWhen talks for a combined authority for the entire region collapsed in 2016, the northern part of the region continued discussions with government for a bespoke deal. \nThe seven councils were kept loosely hanging together via the North East Combined Authority, a watered down body primarily concerned with transport. \nBut the North of Tyne councils are due to leave NECA in mid-2018 and transport is set to become the domain of a new Joint Committee with representation from all seven councils. \nCoun Forbes said he still believes a devolved body for the whole of the North East is possible: “This is an inclusive deal that was negotiated with three councils but I’d be delighted if other parts of the North East joined eventually.” \nThere is also a hope that this deal is just the first power transfer and more will follow before the May 2019 mayoral elections. \nBoth Liverpool and Teesside received commitments for further devolution in this week’s Budget and the leader’s say they will be pushing government for more over the coming years. Like us on Facebook", "external_links": [], "published": "2017-11-24T12:30:00.000+02:00", "crawled": "2017-11-24T13:06:56.009+02:00", "highlightTitle": ""}