{"organizations": [], "uuid": "ed327a1c9a095f20b3dd19c2ece398dcd7e958c1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article733592.ece/ALTERNATES/s1200/DP20by20Sheehan20favourite20credit20if20used_preview1jpeg.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/news/leicester-news/chariots-fire-film-producer-david-733566", "country": "US", "domain_rank": 48128, "title": "Chariots of Fire film producer David Puttnam coming to Leicester to give talk - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.081, "site_type": "news", "published": "2017-11-06T16:04:00.000+02:00", "replies_count": 0, "uuid": "ed327a1c9a095f20b3dd19c2ece398dcd7e958c1"}, "author": "Fiona Dryden", "url": "http://www.leicestermercury.co.uk/news/leicester-news/chariots-fire-film-producer-david-733566", "ord_in_thread": 0, "title": "Chariots of Fire film producer David Puttnam coming to Leicester to give talk - Leicester Mercury", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Chariots of Fire film producer David Puttnam coming to Leicester to give talk Talk will discuss the changing world of the media in the digital age Share Lord David Puttnam who produced films including Midnight Express and Chariots of Fire Share Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nAward-winning producer behind Bugsy Malone, Chariots of Fire and Midnight Express Lord David Puttnam is set to visit the University of Leicester. \nHe will bring a bit of Hollywood magic to the university’s lecture theatres when he drops in to give a talk tomorrow on the changing world of the media in the digital age. Read More ‘We lost so many young men - let us think of them’ \nThe lecture, called The times they are a’Changin', takes place at 6pm in the Peter Williams Lecture Theatre, and is free and open to the public. \nIn his talk, Lord Puttnam will draw upon his experience as a life peer and his role as chairman of the joint scrutiny committee on the Communications Bill in 2002 to consider the developing social responsibilities of online media in the digital age. \nIn particular, he will consider their impact on conventional media, on attitudes to issues as disparate as climate change and Brexit, as well as the political implications of recent developments in the technologies that drive these services. \nWhether it is the strains of Vangelis from Chariots of Fire or the sight of ‘splurged’ gangsters in Bugsy Malone, or others, many will have fond memories of the popular and award-winning films that Lord Puttnam helmed during his substantial career as a film producer. \nThis isn’t the first time that Lord Puttnam has visited the University of Leicester, having received an honorary Doctor of Letters degree from the university in 1986. He later gave the second annual lecture for the then Richard Attenborough Centre, now Attenborough Arts, in 2001 and Graduates’ Association Lecture in 2004. \nLord Puttnam is the Chair of Atticus Education, an online education company founded in 2012 that delivers audio-visual seminars to students all over the world. In addition to this, he is a member of the House of Lords where he pursues an active role in a variety of areas, from educational and environmental issues to digital skills. \nHe spent 30 years as an independent producer of award-winning films including The Mission, The Killing Fields, Chariots of Fire, Midnight Express, Bugsy Malone and Local Hero. Together these films have won ten Oscars, ten golden globes, twenty-five Baftas and the Palme D'Or at Cannes. From 1986 to 1988, he was chairman and CEO of Columbia Pictures. He returned to the UK to produce The Memphis Belle, The War of the Buttons and My Life So Far. From 1994 to 2004, he was vice president and chair of Trustees at the British Academy of Film & Television Arts (BAFTA) and was awarded a BAFTA Fellowship in 2006. He is also a Fellow of the British Film Institute. Read More These are the Christmas events happening in Leicester this year \nThe Rt. Hon. Lord Grocott, chancellor of the university, said: “I am delighted that my friend David Puttnam has accepted our invitation to speak for the university's Distinguished Lecture Series. David communicates his passions whether they be film, education, parliamentary democracy or the media, with great knowledge and infectious enthusiasm. No wonder he is such a popular and admired member of the House of Lords. We can all look forward to what I know will be a stimulating and entertaining evening.” \nTickets must be booked via www.le.ac.uk/distinguished-lectures. Like us on Facebook ", "external_links": [], "published": "2017-11-06T16:04:00.000+02:00", "crawled": "2017-11-06T16:29:05.002+02:00", "highlightTitle": ""}