{"organizations": [], "uuid": "e0aae49ad75b17d9952008e598b4be39ed516ba1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article747528.ece/ALTERNATES/s1200/Austin_Duchess_02JPG.jpg", "site_section": "http://www.middevongazette.co.uk/news.rss", "section_title": "devonlive - News", "url": "http://www.devonlive.com/news/devon-news/darts-farm-westpoint-receives-royal-747507", "country": "GB", "title": "Darts Farm and Westpoint receives royal visit", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-08T18:28:00.000+02:00", "replies_count": 0, "uuid": "e0aae49ad75b17d9952008e598b4be39ed516ba1"}, "author": "Jamie Hawkins", "url": "http://www.devonlive.com/news/devon-news/darts-farm-westpoint-receives-royal-747507", "ord_in_thread": 0, "title": "Darts Farm and Westpoint receives royal visit", "locations": [], "entities": {"persons": [{"name": "westpoint", "sentiment": "none"}, {"name": "sophie", "sentiment": "none"}, {"name": "agrifest", "sentiment": "none"}, {"name": "dracup", "sentiment": "none"}, {"name": "john dracup", "sentiment": "none"}, {"name": "westpoint share sophie", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "robert venner", "sentiment": "none"}, {"name": "richard austin", "sentiment": "none"}], "locations": [{"name": "dorset", "sentiment": "none"}, {"name": "agrifest south west", "sentiment": "none"}, {"name": "cornwall", "sentiment": "none"}, {"name": "topsham", "sentiment": "none"}, {"name": "wales", "sentiment": "none"}, {"name": "south west and meat south west", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "gloucestershire", "sentiment": "none"}, {"name": "westpoint", "sentiment": "none"}, {"name": "wiltshire", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}, {"name": "somerset", "sentiment": "none"}], "organizations": [{"name": "wessex", "sentiment": "none"}, {"name": "cancer research uk", "sentiment": "none"}, {"name": "pgi", "sentiment": "none"}, {"name": "devon county agricultural association", "sentiment": "none"}, {"name": "agrifest exeter", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "darts farm", "sentiment": "none"}, {"name": "sisters food group", "sentiment": "none"}, {"name": "nba", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "national beef association", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Darts Farm and Westpoint receives royal visit The Countess of Wessex attended the annual Agrifest at Westpoint Share Sophie, Countess of Wessex was in Devon on Tuesday (Image: Richard Austin) Share Get Daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nA royal visitor was in Devon on Tuesday to support the annual Agrifest. \nFormerly known as Beef South West, Agrifest was attended by Sophie, Countess of Wessex, who is a keen supporter of British agriculture and current president of the Devon County Agricultural Association. \nShe met local farmers during her two-hour visit at Westpoint, as well as watching the pink pedigree sheep charity auction for Cancer Research UK and farm safety demonstrations. The Countess at Agrifest Exeter (Image: Richard Austin) \nRobert Venner, chairman of Agrifest South West said: “The show is truly growing and we are honoured with the presence of the Countess of Wessex this year. Recognition of the show by a member of the royal family highlights how the show is rising in eminence.” Read More \nSophie left in a helicopter for lunch at Darts Farm, the award-winning farm shop complex near Topsham just a short flight away. The Countess at Darts Farm Topsham - at the cider making dept (Image: Richard Austin) \nElsewhere, John Dracup, red meat procurement director at the recently scandal-ridden 2 Sisters Food Group, said greater action must be taken to promote the unique qualities of Westcountry beef and lamb to a global marketplace, as the industry prepares to face significant challenges in a post-Brexit environment. \nAddressing livestock farmers at the event, he said producers in the region are “hugely fortunate” to have the Westcountry Protected Geographical Indication (PGI) badge for their beef and lamb products, but stressed that not enough is currently being made of this exclusive branding opportunity. Read More Here's how to get paid for dressing up as Father Christmas \n“We have a unique proposition,” said Mr Dracup, “… green rolling hills and quality producers who are doing a great job in sustaining a marvellous environment which we all enjoy, but it is down to us to demonstrate that to our consumers and put it in a form that they can understand and enjoy when they’re eating the product. \n“It has worked particularly well in Wales and Scotland, and I believe we can make considerably more of it down here in the South West,” he added at the Westpoint event, formerly known as Beef South West but extended this year to showcase prime cattle and sheep from across the region. \nThe awarding of PGI status for Westcountry beef and lamb in January 2014 means that producers in the region have an exclusive right to use that name and logo for their products. In order to qualify, beef and lamb must come from stock born, raised and finished in Cornwall, Devon, Somerset, Dorset, Gloucestershire or Wiltshire and fed at least a 70% forage-based diet. \nBut Mr Dracup warned that the PGI status, along with other protected food names, is “clearly at risk” from changes to legislation as Britain negotiates its exit from the European Union. “Who’s to say our European colleagues won’t become very difficult and try to find some means of stopping us from using that branding and maintaining the market advantage it creates for us as producers and processors in the South West,” he said. \n“It’s one of the things that I would encourage the National Beef Association (NBA) in the South West and Meat South West to continue to focus on finding an alternative for the PGI, which maintains that status but puts it under British control, so that we are in the driving seat as to where and how we use the branding to promote and develop our product.” Read More Devon fish and chip shop travels the world and serves 11,000 portions \nMr Dracup went on to say that 2 Sisters, which hit headlines last month after an undercover investigation revealed a string of health and safety breaches, was proud to be one of the last British-owned red meat companies. “We wish to play on that very heavily, working far more closely with our farming suppliers, the wider industry and our customers and consumers so that they know, understand and appreciate why they are paying some of the highest prices in the world for our product,” he said. \n“It is about provenance, traceability and trust in the supply chain, but most importantly it is about how that product performs on the plate. It is how it delivers for the consumer when they are eating it, and it needs to be in a form which is quick, easy and convenient.” Like us on Facebook ", "external_links": [], "published": "2017-11-08T18:28:00.000+02:00", "crawled": "2017-11-08T18:42:15.004+02:00", "highlightTitle": ""}