{"organizations": [], "uuid": "db79811fead7b49df0e9f846282bcde930404442", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article808135.ece/ALTERNATES/s1200/Helena-Tibbitts-ValuationJPG.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/news/business/helena-tibbitts-fisher-german-ashby-808132", "country": "US", "domain_rank": 48128, "title": "Helena Tibbitts of Fisher German in Ashby named a RICS Matrics Young Surveyor of the Year - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.833, "site_type": "news", "published": "2017-11-21T12:07:00.000+02:00", "replies_count": 0, "uuid": "db79811fead7b49df0e9f846282bcde930404442"}, "author": "Tom Pegden", "url": "http://www.leicestermercury.co.uk/news/business/helena-tibbitts-fisher-german-ashby-808132", "ord_in_thread": 0, "title": "Helena Tibbitts of Fisher German in Ashby named a RICS Matrics Young Surveyor of the Year - Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "helena", "sentiment": "negative"}, {"name": "ashby", "sentiment": "negative"}, {"name": "helena tibbitts", "sentiment": "negative"}, {"name": "fisher german", "sentiment": "negative"}, {"name": "matthew trewartha mrics", "sentiment": "none"}, {"name": "saira khan", "sentiment": "none"}, {"name": "john anderson", "sentiment": "none"}], "locations": [{"name": "ashby", "sentiment": "none"}, {"name": "east midlands airport", "sentiment": "none"}], "organizations": [{"name": "rics", "sentiment": "none"}, {"name": "arnold & baldwin", "sentiment": "none"}, {"name": "ups", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "hilton london bankside hotel", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Helena Tibbitts of Fisher German in Ashby named a RICS Matrics Young Surveyor of the Year Helena won top prize in valuation category at annual awards for inspiring surveyors aged 35 and under Share (l to r) Host Saira Khan, Helena Tibbitts, of Fisher German and John Anderson, of Arnold & Baldwin solicitors Share Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nA surveyor has been rewarded for her achievements in the property industry at the 2017 Royal Institution of Chartered Surveyors Matrics Young Surveyor of the Year Awards. \nHelena Tibbitts, 34, an Associate Partner at Fisher German in Ashby, won top prize in the valuation category at the annual awards, which recognise the most inspiring surveyors aged 35 and under. \nAs a trusted member of the Fisher German team, Helena has experience in agricultural and equestrian surveying to public access woodland and nature reserves. \nA RICS statement said in addition to championing the profession, delivering valuations on time with an exceptional depth and knowledge, Helena constantly strives to diversify the profession. Read More \"Brexit won’t stop East Midlands Airport expansion\" \nIt said: \"As a working mother, she has first-hand experience of the challenges of balancing family and career. \n\"Working closely with human resources in the firm, Helena is looking at ways to encourage flexible or locum based working to balance family life and provide time off for child care and school holidays. \n\"She is keen that knowledge and skill is retained in the profession and hopes this is one way that the firm can help the profession do that.\" Read More UPS wants to build new £114m parcel depot near East Midlands Airport - and it could create OVER 1,000 jobs \nFisher German partner Matthew Trewartha MRICS, said: \"Helena is incredibly focused on her profession and delivers to a standard rarely seen. \n\"She goes beyond what is reasonably expected to deliver for clients to enhance the reputation of herself, the firm and most importantly the profession.\" \nThe nine category awards up for grabs on the night covered a variety of surveying sectors and disciplines, and five females and four males won the accolades \nThe winners were announced in front of over 350 guests at a black-tie ceremony at the Hilton London Bankside Hotel, and were hosted by TV presenter Saira Khan. Like us on Facebook ", "external_links": [], "published": "2017-11-21T12:07:00.000+02:00", "crawled": "2017-11-21T12:24:09.000+02:00", "highlightTitle": ""}