{"organizations": [], "uuid": "b0508920e8c4aa7ff572de8ea4863e233d6121ca", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13947240.ece/ALTERNATES/s1200/Sean-Sneddon.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/north-tyne-devolution-simple-guide-13950697", "country": "GB", "domain_rank": 21960, "title": "North of Tyne devolution: A simple guide to what is in the deal", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-24T20:00:00.000+02:00", "replies_count": 0, "uuid": "b0508920e8c4aa7ff572de8ea4863e233d6121ca"}, "author": "Sean Seddon", "url": "http://www.chroniclelive.co.uk/news/north-east-news/north-tyne-devolution-simple-guide-13950697", "ord_in_thread": 0, "title": "North of Tyne devolution: A simple guide to what is in the deal", "locations": [], "entities": {"persons": [{"name": "tyne", "sentiment": "negative"}, {"name": "peter alan jackson", "sentiment": "none"}, {"name": "nick forbes", "sentiment": "none"}, {"name": "norma redfearn", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "north tyneside", "sentiment": "none"}], "organizations": [{"name": "ntca", "sentiment": "none"}, {"name": "newcastle city council", "sentiment": "none"}, {"name": "institute of technology", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "land board", "sentiment": "none"}, {"name": "north of tyne education improvement challenge", "sentiment": "none"}, {"name": "department for international trade", "sentiment": "none"}, {"name": "british business bank", "sentiment": "none"}, {"name": "adult education budget", "sentiment": "none"}, {"name": "northumberland council", "sentiment": "none"}, {"name": "local housing need", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe North of Tyne devolution deal agreed with the government is 20 pages long and packed with technical detail. \nNewcastle, Northumberland and North Tyneside will now embark on a months-long process of getting everything in place before it starts operating mid-2016. \nWe’ve gone through the fine print so you don’t have to - here is what’s in the landmark deal signed this week. The new Mayor \nFrom May 2019 onward, the North of Tyne will have an elected mayor who will be able to exercise a range of powers and borrow money within a certain limit. \nA precept on local council tax bills could be introduced to pay for the mayor’s work and an interim mayor will do the job from summer 2018. Read More Who will be the North of Tyne region mayor? We look at the likely options Creating jobs \nThe focus of the deal is to create “more and better” jobs in the North East , with initial analysis finding 10,000 jobs could be created, 25% of which would be south of the Tyne. \nThis will be done via the establishment of an Inclusive Growth Board, with representation from council, education, government and business, which will integrate skills and employment programmes. \nThe North of Tyne has also been selected as the first area to pilot a new scheme to boost the rural economy, which is good news for Northumberland. Nick Forbes, leader of Newcastle City Council, Norma Redfearn, directly-elected Mayor of North Tyneside and Councillor Peter Alan Jackson, leader of Northumberland Council (Image: Newcastle Chronicle) Education and skills \nThe NTCA will take over the £23m Adult Education Budget , a pot of money which will be used to make sure people have the skills they need to get jobs in the modern economy. Read More The North of Tyne region announces multi-million pound devolution deal \nIn terms of young people, the NTCA will launch a North of Tyne Education Improvement Challenge, a concerted, region wide programme to drive up standards in schools. \nThe NTCA will put together a proposal to bring an Institute of Technology to the region to train people more modern jobs. Housing \nThe establishment of a Housing and Land Board will allow the combined authority to acquire and dispose of land and help develop a joint housing strategy. \nThe new mayor will also have the power to issue compulsory purchase orders in order to free up land more quickly for development. \nTalks are ongoing over the expansion of specialist housing provision and plans to “accelerate the delivery of new homes in the area above Local Housing Need figures. \nIn short, this should mean more houses being built more quickly. Energy and digital \nGovernment has committed to working with the region on developing low carbon technology, a “key sectoral strength” for North of Tyne. \nMuch of the economic growth activity will focus on the digital sector, already an important part of the local economy. \nNorth of Tyne has more digital start-ups than any area outside London - this deal is designed to build on that. Internationalisation and competitiveness \nHeading into a post-Brexit environment, the deal includes a commitment to set up enhanced advice services and closer work with the Department for International Trade to boost the region’s export market. \nThere is also a pledge for the British Business Bank to help SMEs in the North of Tyne grow their businesses. Like us on Facebook ", "external_links": [], "published": "2017-11-24T20:00:00.000+02:00", "crawled": "2017-11-24T20:50:39.000+02:00", "highlightTitle": ""}