{"organizations": [], "uuid": "664aea149c7756192cd21888bdeaff93d6d78fa9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13575577.ece/ALTERNATES/s1200/Sedgefield-MP-Phil-Wilson-at-the-Hitachi-opening-ceremony.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/employers-need-know-what-happen-13850337", "country": "GB", "domain_rank": 21960, "title": "Employers need to know what will happen after Brexit, MPs insist", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-03T07:00:00.000+02:00", "replies_count": 0, "uuid": "664aea149c7756192cd21888bdeaff93d6d78fa9"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/employers-need-know-what-happen-13850337", "ord_in_thread": 0, "title": "Employers need to know what will happen after Brexit, MPs insist", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "negative"}, {"name": "alan beith", "sentiment": "none"}, {"name": "hilary benn", "sentiment": "none"}, {"name": "andrea leadsom", "sentiment": "none"}, {"name": "mundell", "sentiment": "none"}, {"name": "catherine mckinnell", "sentiment": "none"}, {"name": "valerie vaz", "sentiment": "none"}, {"name": "david davis", "sentiment": "none"}, {"name": "david mundell", "sentiment": "none"}, {"name": "phil wilson", "sentiment": "none"}, {"name": "leadsom", "sentiment": "none"}, {"name": "philip hammond", "sentiment": "none"}, {"name": "davis", "sentiment": "none"}], "locations": [{"name": "sedgefield", "sentiment": "none"}, {"name": "north east of england", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "commons treasury committee", "sentiment": "none"}, {"name": "eu select committee", "sentiment": "none"}, {"name": "newcastle north", "sentiment": "none"}, {"name": "house of lords", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "house", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}, {"name": "scottish parliament’s europe committee", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Employers need to know what will happen after Brexit, MPs insist Warning to Ministers as they prepare to hand over long awaited studies into the impact of Brexit on the economy Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nBusinesses desperately want to know what will happen after Brexit , North East MPs have warned Ministers. \nBut the Government’s refusal to provide information is causing “further distrustt” after last year’s EU referendum divided the nation, according to one MP. \nThe region’s politicians joined calls for the Government to publish a series of “impact assessments” which it has drawn up looking at the impact of Brexit on different sectors of the economy, such as the automotive industry, aerospace and the electricity and gas markets. \nAnd they said the reports were particularly vital for the North East , because exports are vital to the region’s economy. \nSedgefield MP Phil Wilson warned Ministers: “Many of our companies and businesses want to know what the impact will be of leaving the single market and the customs union in March 2019. \n“More than 60% of the trade in the North East of England is with the EU. My constituency has the biggest business park in the region, with more than 500 companies based there employing between 10,000 and 12,000 people. Read More Electric cars - they are the future and 'now' their time has come \n“A few weeks ago, I was at a Brexit seminar on the industrial estate, and the one thing that I kept hearing about was the uncertainty. People kept saying, ‘What happens next?’ Some said: ‘What are the questions that we need to ask?’.” \nHe insisted: “The one thing they needed was access to the impact assessments. We need to be able to work out how the sectors of our industry will be affected.” \nNewcastle North MP Catherine McKinnell pointed out that Chancellor Philip Hammond has told the Commons Treasury Committee that the Government had produced “models” showing the impact of Brexit on different regions. Labour candidate for Newcastle North, Catherine McKinnell wins (Image: Newcastle Chronicle) \nShe said: “It has been reported that the Department for Exiting the European Union has carried out analysis that concludes that the North East of England and Scotland will be the region and country worst affected. It stands to reason, because 60% of our exports go to the EU and we rely on millions of pounds in agricultural, structural, social and university funding.” \nThe Government has promised to make sector documents available to MPs but they are likely to be heavily censored. \nBrexit Secretary David Davis said the Government intends to be “as open as we can be”. \nAnd he said he was already talking to Hilary Benn, chairman of the Exiting the EU Select Committee , about handling the release of the studies. \nThe Government had previously refused to release them but Labour used an arcane parliamentary procedure to pass a motion to have the studies provided to the select committee. Read More Lord Alan Beith's plan to stop the House of Lords growing out of control \nMr Davis said: “I will reiterate the point made by my honourable friend, that is these documents are not some sort of grand plan, they’re data about the regulations and the markets of individual sectors which inform our negotiation. \n“Of course we will be as open as we can be with the select committee, I fully intend to.” \nCommons Leader Andrea Leadsom was pressed in the Commons by her Labour shadow Valerie Vaz to explain what the time limit was for releasing the studies. \nMs Leadsom replied: “It is absolutely accepted that the motion passed by the House yesterday is binding and that the information will be forthcoming. \n“But, as I think as has been made very clear, it is the case that it is difficult to balance the conflicting obligation to protect the public interest through not disclosing information that could harm the national interest and the public interest whilst at the same time ensuring that the resolution of the House passed yesterday is adhered to.” \nOn Thursday, Scotland Secretary David Mundell said no separate piece of work has been done on the impact of leaving the EU on Scotland, despite Chancellor Philip Hammond acknowledging last month the Treasury had analysed regional effects. \nMr Mundell told the Scottish Parliament’s Europe Committee: “There is not a Scotland-specific analysis, there is analysis of these sectors and how they apply within Scotland.” Like us on Facebook", "external_links": [], "published": "2017-11-03T07:00:00.000+02:00", "crawled": "2017-11-03T07:16:14.004+02:00", "highlightTitle": ""}