{"organizations": [], "uuid": "aa6fc25080301d2c444424b10dae35f3c215c979", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13848849.ece/ALTERNATES/s1200/TMP_NEC_111017OwenPughMachinery01JPG.jpg", "site_section": "http://www.thejournal.co.uk/business/?service=rss", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/owen-pugh-collapse-sparks-calls-13848736", "country": "GB", "domain_rank": 21960, "title": "Owen Pugh collapse sparks calls for different approach to public contracts", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-02T15:38:00.000+02:00", "replies_count": 0, "uuid": "aa6fc25080301d2c444424b10dae35f3c215c979"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/owen-pugh-collapse-sparks-calls-13848736", "ord_in_thread": 0, "title": "Owen Pugh collapse sparks calls for different approach to public contracts", "locations": [], "entities": {"persons": [{"name": "owen pugh", "sentiment": "negative"}, {"name": "john dickson", "sentiment": "none"}, {"name": "alexander", "sentiment": "none"}, {"name": "jeff alexander", "sentiment": "none"}, {"name": "blaydon", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "dickson", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "dudley", "sentiment": "none"}, {"name": "silverlink", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "cramlington", "sentiment": "none"}, {"name": "north tyneside", "sentiment": "none"}], "organizations": [{"name": "surgo construction", "sentiment": "none"}, {"name": "construction alliance northeast", "sentiment": "none"}, {"name": "owen pugh", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Owen Pugh collapse sparks calls for different approach to public contracts The collapse of the North Tyneside firm cost 250 jobs and the Construction Alliance Northeast wants a new approach Share Owen Pugh machinery at Silverlink roadworks (Image: newcastle chronicle) Share Get business updates   Thank you for subscribing!   \nThe collapse of a North East firm with the loss of 250 jobs has led to calls for a Government re-think on the way it runs public contracts. \nConstruction lobbying organisation Construction Alliance Northeast (CAN) wants Ministers to examine the way they handle public sector procurement in the wake of the recent demise of North Tyneside firm Owen Pugh and the continuing financial difficulties faced by some of the UK’s largest building contractors. \nThe collapse of Owen Pugh led chairman John Dickson to complain of ‘bully boy tactics’ from the main contractors that dominate contracts for large infrastructure projects. \nMr Dickson said those firms would frequently withhold payments from Owen Pugh, sparking the cash flow problems that led to his company being wound up. \nCAN was established almost two years ago to highlight the need for ‘intelligent procurement practice’ so that small businesses in the North East got a better chance to compete for contracts. Jeff Alexander of Surgo Construction \nThe organisation’s chair Jeff Alexander said: “The region cannot afford to lose major employers like Owen Pugh. \n“CAN’s aim is to encourage the use of regional SME contractors whenever possible so that project profits are kept in the region. This will create the positive cashflow to invest in training and apprenticeships which are so essential for future growth. Read More Owen Pugh boss blames 'bully boy tactics' for collapse of firm and loss of 250 jobs \n“The Government says it is keen to promote innovation, efficiency and skills. I think it is high time the Government totally overhauled the procurement process and did not just focus on the issue of retentions. \n“With our departure from the EU it is a good time to start thinking about the sustainability of an industry which is so vital to the UK economy, particularly in a region like the North East.” Read More Mortgage payments set to rise around £15 a month after interest rates put up \nOwen Pugh went into administration last month after receiving winding-up orders from a number of creditors. More than 250 jobs were lost with the closure of sites at Dudley, Cramlington , Blaydon and Stockton-on-Tees. \nThe company, which dates back to 1946, had worked on some of the region’s most prominent construction schemes in recent years. \nMr Alexander said: “The recent demise of Owen Pugh, which is very sad, has focused attention again on the importance of a strong regional construction industry. Although there were a few factors at play here, John Dickson, the firm’s chairman, has been quoted as saying that ‘bully boy tactics’ were adopted by the main contractor. \n“Many public bodies including local authorities rely heavily on these firms and when they are squeezed for cash, this goes all the way down the supply chain. Brexit could provide the perfect opportunity to think again about procurement practice.” \nCAN’s comments come at a time when the Government has expressed an intention to launch a consultation on the practice of cash retentions under construction contracts. \nRecently published research suggests that larger firms are holding onto payments to smaller companies for months at a time, despite Government guidance that invoices on public work should be paid within a maximum of 30 days. Like us on Facebook", "external_links": [], "published": "2017-11-02T15:38:00.000+02:00", "crawled": "2017-11-02T16:15:48.003+02:00", "highlightTitle": ""}