{"organizations": [], "uuid": "bbf67bbfe7f18afc5fe19a5564a95934f49e5a3e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article12725577.ece/ALTERNATES/s1200/Government-Ministers-Attend-Cabinet-After-David-Cameron-Announces-Airstrike-Vote.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/budget-2017-6-key-messages-13919013", "country": "GB", "domain_rank": 21960, "title": "Budget 2017: The Metro and Universal Credit - 6 key messages that matter to the North East", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-19T07:00:00.000+02:00", "replies_count": 0, "uuid": "bbf67bbfe7f18afc5fe19a5564a95934f49e5a3e"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/budget-2017-6-key-messages-13919013", "ord_in_thread": 0, "title": "Budget 2017: The Metro and Universal Credit - 6 key messages that matter to the North East", "locations": [], "entities": {"persons": [{"name": "invalid em", "sentiment": "negative"}, {"name": "phillip hammond", "sentiment": "none"}, {"name": "jim o’neill", "sentiment": "none"}, {"name": "ian mearns", "sentiment": "none"}, {"name": "tyne", "sentiment": "none"}, {"name": "hammond", "sentiment": "none"}, {"name": "helen goodman", "sentiment": "none"}, {"name": "stephen purvis", "sentiment": "none"}, {"name": "ippr north ed cox", "sentiment": "none"}, {"name": "philip hammond", "sentiment": "none"}, {"name": "scrooge", "sentiment": "none"}], "locations": [{"name": "north east get", "sentiment": "none"}, {"name": "northumbria", "sentiment": "none"}, {"name": "south east", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}, {"name": "north east england", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "wales", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "west midlands", "sentiment": "none"}, {"name": "durham tees valley", "sentiment": "none"}, {"name": "brexit  north east", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}, {"name": "cayman islands", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "north east of england", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "north", "sentiment": "none"}, {"name": "edinburgh", "sentiment": "none"}, {"name": "north tyneside", "sentiment": "none"}, {"name": "tees valley", "sentiment": "none"}, {"name": "newcastle international airport", "sentiment": "none"}], "organizations": [{"name": "metro and universal credit", "sentiment": "negative"}, {"name": "newcastle international", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "ippr", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}, {"name": "wear metro", "sentiment": "none"}, {"name": "northern powerhouse partnership", "sentiment": "none"}, {"name": "gateshead labour", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}, {"name": "pfi", "sentiment": "none"}, {"name": "universal credit", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "middlesbrough", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "whitehall", "sentiment": "none"}, {"name": "bishop auckland", "sentiment": "none"}, {"name": "north east chamber of commerce", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nChancellor Philip Hammond is to deliver his Budget statement on Wednesday, November 22. \nIt will be the first Budget since the Conservatives lost their majority in the House of Commons in June. \nBut what does the North East want to hear from Mr Hammond? Tyne and Wear Metro \nOne of the most pressing issues the Chancellor could deal with is the need to replace the aging fleet on the Tyne and Wear Metro . \nPassengers know only too well that the 40-year-old trains are not up to the job, leading to cancellations and delays. \nTransport body Nexus is hoping the Treasury will pay for 84 new trains, either by providing a grant of up to £400m or by allowing Nexus to borrow the money. \nBut the Government could instead opt for a Private Finance Initiative (PFI) deal to fund the work, which would mean a private investor paid for the fleet and then leased them to Nexus over a period likely to be 35 years. \nThis is unpopular with Labour MPs and with Nexus, which warns it would add years to the time it takes to procure a new fleet, but would at least mean new trains are provided eventually. \nEither way, an announcement is expected soon. More transport funding Chanceller Phillip Hammond (Image: Getty Images Europe) \nMr Hammond is likely to highlight Government investment in the North in some form, after Ministers last week confirmed plans to turn a new transport authority, Transport for the North, into a statutory body - giving it legal rights and responsibilities. \nIt will prepare a 30-year transport strategy for the North. And it is also drawing up plans for “Northern Powerhouse Rail”, a planned major new rail network. \nHowever, critics say it will have little real power, as its role is largely to advise Government ministers. \nThey include former Conservative Minister Lord Jim O’Neill, now a Board Member of think tank the Northern Powerhouse Partnership said. \nHe said: “It is unacceptable once Transport for the North becomes a statutory body for them to constantly need to seek permission from Whitehall officials.” \nGateshead Labour MP Ian Mearns argues that the Chancellor must invest in the region’s transport network. Read More \n“We need major transport infrastructure investment in the North East of England and that is n rail and on roads in particular. \n“The track speeds in the region are pitiful compared to London and the South East. \n“For a rail journey of 40 miles between Newcastle and Middlesbrough to take an hour and 20 minutes is an unmitigated disgrace.” Universal Credit \nIt’s been reported that the Chancellor could announce action to reduce the six-week delay in payments under the Universal Credit scheme. \nThis will have an impact across the country, but particularly in places where Universal Credit is about to come into effect, such as parts of County Durham . \nBishop Auckland MP Helen Goodman told the House of Commons last week: “In my constituency, 10,700 households will be moved on to universal credit. That is 21,000 people, which is almost a quarter of my constituents. Read More Cutting Universal Credit wait for payments won't solve the crisis, Ministers warned \n“On 13 December, those with new claims and changes of circumstance will be moved across to Universal Credit, and over Christmas many people will face a six-week gap in their income. \n“That is not so much a merry Christmas as a Victorian Christmas that even Scrooge did not think of.” Air Passenger Duty Newcastle International Airport \nThe region’s two airports, Newcastle International and Durham Tees Valley, have been pushing the Government to ensure there is a level playing field as the Scottish government cuts Air Passenger Duty, which is to be renamed Air Departure Tax north of the border. \nIt means taxes on flights from Edinburgh will be lower than taxes on flight from Newcastle. \nWhether the Government will listen is another matter. Ministers once promised to protect English regional airports, but have repeatedly delayed taking any action. \nThink tank Policy North highlighted air passenger duty as an issue they hoped the Chancellor would address. \nPolicy North chairman, Stephen Purvis, said: “Connectivity is another key priority for the region and we would like to see the Government take a proactive stance in relation to air passenger duty and Newcastle airport.” Brexit \nNorth East employers argue that exporters in particular need support as the UK prepares to leave the European Union . \nIn a letter sent to the Chancellor in advance of the Budget, North East Chamber of Commerce said: “North East England is a region with an enviable track record of exporting, but there are still too few companies trading internationally while potential new markets remain unexploited. \n“To build on our export performance, there needs to be a sizable increase in the support available to help companies break into new overseas markets as we prepare to leave the European Union, including through involvement in trade missions and overseas exhibitions.” Devolution \nThe Chancellor is expected to announce a second devolution deal for the West Midlands. \nNorth East employers are keen to see Mr Hammond offer more powers to the Tees Valley elected mayor and combined authority. \nAnd they want to see progress on plans for a “North of the Tyne” mayor and authority, which will serve Newcastle, Northumbria and North Tyneside. \nThink tank IPPR North highlighted the need to give the North a larger voice. \nDirector of IPPR North Ed Cox said: “It’s time for the North to take back control from Whitehall. We would welcome an announcement to establish a Council of the North to drive industrial strategy across the North to really unlock our potential. \n“On Brexit too, we need a formal seat at the negotiation table. Scotland, Wales, Northern Ireland and even UK overseas islands such as the Cayman Islands have a formal seat at the table. It’s about time that the North was given a seat too.” Like us on Facebook", "external_links": [], "published": "2017-11-19T07:00:00.000+02:00", "crawled": "2017-11-19T08:37:18.001+02:00", "highlightTitle": ""}