{"organizations": [], "uuid": "bfa81949b4caa80f91d151fa26162bd66c5cbfa0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article804319.ece/ALTERNATES/s1200/QC.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/special-features/dont-panic--tried-tested-804185", "country": "US", "domain_rank": 48128, "title": "Don’t panic – tried and tested investment leads the way in Brexit uncertainty - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.54, "site_type": "news", "published": "2017-11-20T15:13:00.000+02:00", "replies_count": 0, "uuid": "bfa81949b4caa80f91d151fa26162bd66c5cbfa0"}, "author": "Tess Rushin", "url": "http://www.leicestermercury.co.uk/special-features/dont-panic--tried-tested-804185", "ord_in_thread": 0, "title": "Don’t panic – tried and tested investment leads the way in Brexit uncertainty - Leicester Mercury", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Don’t panic – tried and tested investment leads the way in Brexit uncertainty Share Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nIt’s been a volatile period in the markets following the decision by UK voters to leave the European Union and much uncertainty remains, given that we are only just setting out on what is a long and arduous road to Brexit. \nWhile Article 50 is now set to be invoked by the end of March 2017, this will be followed by two years of intense negotiations about the exact terms of the UK’s exit and what our future relationship with the EU will look like. \nWith the full consequences of Brexit still unknown and an additional layer of complexity added into the equation because we effectively have an entirely new Government in power, investors are, understandably, nervous. \nAt times like these, our challenge as investment specialists is to ensure we are providing exactly the right advice to clients so they have the best chance to preserve and grow their wealth in what are absolutely unchartered waters. \nIn periods of uncertainty, tried and tested investment principles come to the fore. \nA proven approach \nTried-and-tested principles are the bedrock of Quilter Cheviot’s investment policy. We focus on: \nGlobal investors: Our investment managers seek the best investment opportunities globally. We don’t limit ourselves to the UK domestic market. \nThis diversification protects against localised shocks. We’re well placed to do this thanks to our well-resourced, fully qualified, dedicated research team, which is devoted to seeking out the best investments wherever they may be. \nDiversified asset classes: Investing in fixed-income assets, such as bonds, as well as equities helps to cushion against market volatility. \nDiversified sectors: Investing across a broad spectrum of sectors also protects against any shocks in specific industries. \nFor example, we invest in pharmaceuticals, telecoms, beverages, commodities as well as banks and real estate companies. \nPlanning for the long term: Our investment managers always plan for the long term, rather than for one-off events such as the UK referendum on EU membership. \nIt’s important not to be distracted from long-term investment goals by the short-term noise created by the markets. \nThis last point is incredibly important. An investor who correctly predicted a vote for Brexit may have been tempted to make sweeping changes to their portfolio, or even cashed it in entirely, ahead of an expected financial storm. \nSuch an investor would have been left licking their wounds. \nConfounding the optimists \nThat’s because carefully chosen investments have since confounded even the most optimistic of views. \nReacting to short-term events is ill-advised because it’s not just about guessing the outcome of a vote, it’s also about guessing the market’s reaction to that outcome, and making the right call in these circumstances is often notoriously difficult. \nHaving a regular dialogue and direct line of contact with your investment manager will help to provide that extra level of reassurance required in times of flux. \nAt Quilter Cheviot, clients benefit from a combination of in-depth analysis provided by our dedicated research teams, whose sole purpose is to identify, research and evaluate investment opportunities across the whole of the market, and the support of an experienced, client facing investment manager to help guide them on their investing journey. \nThe truth is that most advisers can make a fist of investment when times are good and times are certain; it’s only during upheaval that the true mettle of an investment adviser is really tested. And that time is right here and right now. Like us on Facebook ", "external_links": [], "published": "2017-11-20T15:13:00.000+02:00", "crawled": "2017-11-20T17:07:09.002+02:00", "highlightTitle": ""}