{"organizations": [], "uuid": "77f36e22f0a2ded6754984efdcc23be5572367fc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article776462.ece/ALTERNATES/s1200/Cheryl-Cottle-Hunkin.jpg", "site_section": "http://www.devonlive.com/rss.xml", "section_title": "devonlive - frontpage", "url": "http://www.devonlive.com/news/devon-news/political-chiefs-assure-worried-devon-776148", "country": "US", "title": "Political chiefs assure worried Devon farmer that post-Brexit future is bright", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-14T18:38:00.000+02:00", "replies_count": 0, "uuid": "77f36e22f0a2ded6754984efdcc23be5572367fc"}, "author": "Lauren Harris", "url": "http://www.devonlive.com/news/devon-news/political-chiefs-assure-worried-devon-776148", "ord_in_thread": 0, "title": "Political chiefs assure worried Devon farmer that post-Brexit future is bright", "locations": [], "entities": {"persons": [{"name": "james morrish", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "david george", "sentiment": "none"}, {"name": "rob tibbles", "sentiment": "none"}, {"name": "ben bradshaw", "sentiment": "none"}, {"name": "morrish", "sentiment": "none"}, {"name": "meurig raymond", "sentiment": "none"}, {"name": "john hart", "sentiment": "none"}], "locations": [{"name": "torridge district", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "torrington", "sentiment": "none"}, {"name": "torridge", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "farming community network", "sentiment": "none"}, {"name": "devon county council", "sentiment": "none"}, {"name": "nfu", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "south molton vintage rally club", "sentiment": "none"}, {"name": "royal agricultural benevolent institution", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Man denies abusing boy, four, in 1990s \nJames Morrish, lead member for economy at Torridge District Council, said there is no question that Brexit is going to happen and in his opinion the government will support farmers. \nHe said: “In Torridge we are the only district in the south west that has agriculture as our biggest employer and biggest economic driver. Whenever a system changes people do get apprehensive but I do not believe our government will forget about the farming industry. They will have to replace the single farm payment that comes from the EU and they have said they will do that. \n“We need to produce food and feed our ever-growing population. There is no person who grows food and looks after animals to a better standard than our British farmers. We only have our farmers to thank for food and milk and the work they do. Read More Hard work pays off as Dartmoor riding stables collect prestigious tourism award \n“There is a risk if they put a tariff on lamb being exported from Britain that farmers will have to absorb say £10 to £15 to make them viable. But I think we are a long long way away from that. I think the French do buy so much of our lamb because they do understand our produce is of a good standard. I don’t think they would want to lose a good product like British lamb, beef or pork. \n“It’s vitally important for us to do what we can do to help our farmers. I will continue to do what I can for the farming community in Torrington. The future looks good for agriculture. I am adamant and confident that there will be a Brexit and that there will be a good deal for our farmers.” \nMr Morrish added that any farmers looking for extra support or a way to diversify can contact the Farming Community Network, the Royal Agricultural Benevolent Institution, and the Samaritans, or look into North Devon+ and Leader 5 programmes. Read More 4,605 apply to be UK citizens in South West after Brexit vote \nJohn Hart, Devon County Council leader, said: \"Farming is a vital industry for our county and Devon's meat and produce are rightly recognised as some of the best in the world. That's why the county council has maintained its farms estate to give the next generation of farmers an opportunity to begin their careers. We will work with our farmers, our MPs and the Government to ensure that our agriculture industry remains vibrant after Brexit.\" \nDavid George, south west regional communications adviser for the NFU, said since the referendum result, the NFU has been lobbying hard to make sure the UK's farmers get the best possible outcome from Brexit. \nHe said: “Your young farmer can rest-assured we are aware of all those possible complications. While undoubtedly there are big challenges and no one knows exactly what the outcome will be, this is an opportunity for a new domestic agricultural policy that is geared to the needs of British farmers and not driven by Brussels.” Read More Ben Bradshaw: Judge-led inquiry must probe ‘Russian role’ in EU Referendum and 2017 General Election \nThe NFU recently published its document about what such a policy should look like to ensure UK farming is profitable, productive and competitive in the future. \nIt builds on the key themes the NFU sees as being integral to an agricultural policy: volatility, productivity and the environment, and identifies a number of actions that are vital in delivering a bold and ambitious future for the farming sector. \nNFU President Meurig Raymond said it’s what farming and Britain needs and urged the Government to adopt the measures to help make a success of Brexit for the nation. Farmers chatting at the South Molton Vintage Rally Club's ploughing day (Image: Rob Tibbles) \nHe said: “Once we leave the EU, we will have the opportunity to develop a new deal for British farmers and citizens – one in which farm businesses are provided with the incentives, rewards and means to become more profitable and resilient and to better meet the expectations and needs of society at large. \n“We believe that in the future farmers should be able to draw down bespoke assistance from within our three cornerstones of productivity, environment and volatility. Crucially, the outputs from these measures are not mutually exclusive; they all work together to enable farming to be competitive, profitable and progressive – a sustainable partner within a dynamic British food supply chain. \n“There is rightly an exciting and energetic debate at the moment about how farm support should be delivered once we have left the EU. Our framework makes the strongest possible case for a coherent approach that means farmers can continue to do what they do best – producing safe and affordable food to the high standards the public expects, while caring for the environment in which they operate.” Like us on Facebook", "external_links": [], "published": "2017-11-14T18:38:00.000+02:00", "crawled": "2017-11-14T18:54:14.023+02:00", "highlightTitle": ""}