{"organizations": [], "uuid": "e2e903cc404da679220c07d5e75eb0855762c568", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13914204.ece/ALTERNATES/s1200/JS75834423-1.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13914141", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Carillion issues profit warning after being hit by delays", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-17T10:30:00.000+02:00", "replies_count": 0, "uuid": "e2e903cc404da679220c07d5e75eb0855762c568"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13914141", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Carillion issues profit warning after being hit by delays", "locations": [], "entities": {"persons": [{"name": "byron", "sentiment": "none"}, {"name": "mcaleer", "sentiment": "none"}, {"name": "john", "sentiment": "none"}, {"name": "john waterworth", "sentiment": "none"}, {"name": "dalata", "sentiment": "none"}, {"name": "bridgepoint", "sentiment": "none"}, {"name": "byron burger", "sentiment": "none"}, {"name": "will fulton", "sentiment": "none"}, {"name": "rushe", "sentiment": "none"}, {"name": "dennis holt", "sentiment": "none"}, {"name": "ian", "sentiment": "none"}, {"name": "ian bull", "sentiment": "none"}, {"name": "lynn shearing", "sentiment": "none"}, {"name": "joe garner", "sentiment": "none"}, {"name": "burger king", "sentiment": "none"}], "locations": [{"name": "eldon square", "sentiment": "none"}, {"name": "newgate street", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "metrocentre", "sentiment": "none"}, {"name": "wallsend", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "maldron hotel", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "parkdean", "sentiment": "none"}, {"name": "midlands", "sentiment": "none"}], "organizations": [{"name": "jonathon manning nationwide", "sentiment": "negative"}, {"name": "google", "sentiment": "none"}, {"name": "nationwide building society", "sentiment": "none"}, {"name": "burger king europe gmbh", "sentiment": "none"}, {"name": "unite group plc", "sentiment": "none"}, {"name": "jonathon manning burger king", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "jonathon manning newcastle", "sentiment": "none"}, {"name": "dalata", "sentiment": "none"}, {"name": "caspian uk group", "sentiment": "none"}, {"name": "newgate shopping centre", "sentiment": "none"}, {"name": "standard life investments", "sentiment": "none"}, {"name": "newcastle 9:00 co-op bank", "sentiment": "none"}, {"name": "mcdonald", "sentiment": "none"}, {"name": "handmade burger company", "sentiment": "none"}, {"name": "co-op bank", "sentiment": "none"}, {"name": "restaurant brands international", "sentiment": "none"}, {"name": "newgate", "sentiment": "none"}, {"name": "onex", "sentiment": "none"}, {"name": "parkdean resorts", "sentiment": "none"}, {"name": "uk commercial property trust limited", "sentiment": "none"}, {"name": "onex corporation", "sentiment": "none"}, {"name": "leeds university", "sentiment": "none"}, {"name": "ms shearing", "sentiment": "none"}, {"name": "burger king", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KEY EVENT Ambitious plans to transform Newcastle city centre are unveiled \nAmbitious plans to transform the heart of Newcastle city centre into a world-class shopping destination have been unveiled. \nNewcastle City Council plans to spend an initial £3m to improve the area around Northumberland Street, which attracts 13m visitors a year and supports hundreds of jobs. \nPlans to be discussed next week would see the closure of Blackett Street to traffic, the creation of new event space around Northumberland Street and a huge cleaning operation in the city centre. \nBut council bosses hope those plans will eventually lead to a larger £20m programme that could see Blackett Street entirely pedestrianized and the three-acre vacant plot on Pilgrim Street used to entice some of the world’s top retailers to Tyneside. \nThe council will open consultation in the New Year on an experimental scheme to ban buses and taxis from the busy Blackett Street. \nIt is hoped the move would make the area around Fenwick and the Monument safer for shoppers and improve air quality. \nGed Bell, the council’s cabinet member for inclusive growth, said: \nNewcastle is a great city and one that never stands still. Our plans for the city centre set the scene for the type of place we want to be, and we need to be bold and ambitious for its future. \nAs the regional capital of the North East, our vision for the city centre can only be realised by taking a long term and collaborative approach, working with partners to deliver lasting economic growth that everyone can benefit from. This puts people at the heart of our plans, and helps to make Newcastle a truly accessible city for all. Newcastle city centre improvements: artists' impressions (Image: Newcastle City Council) 9:28 Jonathon Manning Kykloud gears up for growth after appointing new CFO \nA North East property technology businesses has appointed a new chief finance officer as it gears up for future growth. \nKykloud, which provides software to property surveyors and asset managers, has hired Michael Norden as its new CFO. \nMr Norden has previously worked as financial director at Hayes Travel, Parkdean Holidays, and telecoms firm Callstream. \nCommenting on his new role, Norden said: \nI’ve worked with some great businesses and have helped to achieve their goals. I’m certainly attracted by fast growth, highly ambitious businesses which is why I was drawn to the opportunity at Kykloud. \nI spent the past six years helping to grow VC backed, fast moving, telecoms business Callstream, originally north east based Bluebell Telecom; there are huge similarities between the two recurring revenue business models so I am confident of what I can bring to the table. \nHe added: \nBeing part of a disruptive technology business that is having a huge impact within its sector is without a doubt a hugely exciting challenge for any experienced finance professional. CFO Michael Norden Jonathon Manning Mountain Warehouse says inflation has peaked as profits rise \nThe boss of outdoor clothing retailer Mountain Warehouse said the UK’s surging inflation has peaked as he unveiled a near-20% rise in half-year profits.Chief executive Mark Neale said that he was not surprised that inflation held steady last month and said some of the firm’s price tags were already starting to fall.He said: \nI think (inflation) has peaked ... I certainly see no more inflation in the system from our point of view and I cannot see much more currency-related inflation in anybody else’s (businesses) really. \nThe Consumer Prices Index (CPI) was widely expected to reach 3.1% in October, up from 3% in September, intensifying the squeeze on consumer spending power ahead of the Christmas season.Instead, CPI held steady at 3%, leaving economists split on whether inflation has finally topped out or will continue to push higher, with the Bank of England forecasting the cost of living to reach 3.2% during the autumn.It comes as Mountain Warehouse brushed aside the woes enveloping the British high street, lifting pre-tax profits 18% to £4.7m and opening 18 new stores in the UK and overseas.Sales rose 19% to a record £91.6m for the six months to August 27, with its international business proving a standout performer, with sales surging 50% and counting for around 25% of total revenues.The retailer, which has more than 270 shops and employs around 2,250 people, said online sales climbed 19% over the period.Mr Neale also revealed plans to expand Zakti - a sister brand aimed at younger customers - into Mountain Warehouse stores in an attempt to rake in more sales.He said: \nWe are investing in new stores, expanding our online offer and exploring new territories. \nWe have also taken the decision to extend roll out of our popular Zakti brand to stores across the country. We believe this will help widen our appeal still further and reach new customers. Mountain Warehouse KEY EVENT First Chinese business accelerator scheme to open in Newcastle \nA major accelerator programme backed by Chinese investors is to launch in Newcastle , offering start-ups the chance to expand into one of the world’s largest economies. \nThe UK-China venture - called Forge - is the first of its kind to take place in the UK and was created through a collaboration between Northern accelerator company Dotforge and Tus Holdings, which is the largest incubator network in China. \nTus has a presence in 40 of the biggest cities in China, meaning the organisation can provide a major route to market for successful UK tech firms. \nColin Tan, programme director at Forge and head of operations at TusPark Newcastle, said: \nForge is a scale-up accelerator focused on the Internet of Things. We invest £50,000 into 10 companies, and bring them on a three-month programme. The first two months are spent here in TusPark Newcastle, where engineers from Foxconn (the makers of the iPhone) come to mentor our entrepreneurs. \nIn the third month, we go to China - Beijing, Shenzhen and other cities - to scale-up business connections and fundraising for our companies. \nWe have access to 40 cities in China through the TusPark Network, and Forge is the best way for any startup in the world to enter the Chinese market. \nForge’s first programme has been created specifically for start-ups specialising in technology for the Internet-of-Things. This includes firms that are involved in artificial intelligence, data, energy, clean tech, robotics, and smart hardware. \nMr Tan added that the organisation would be looking for tech companies whose products included an element of hardware, although software companies would also be considered. As Forge is aimed at scale-up companies, businesses that have already received investment in the past are being encouraged to apply for the scheme. TusPark Newcastle, on Grainger Street (Image: NCJ Media) 9:10 Jonathon Manning Nationwide sees first-time buyer mortgages hit record high \nNationwide said it was “alert” to the squeeze on household spending power and was bracing for tougher trading despite rolling out a record number of mortgages to first-time buyers.The building society said conditions could become more challenging in the second half of the year and it expected Brexit uncertainty to apply the brakes to UK economic growth.It came as the firm said the number of mortgages it approved to first-time buyers hit an all-time high of 39,000 in the six months ending in September, up from 38,600 for the period last year.Prime mortgage gross lending picked up 2% to £15bn despite a continued slowdown in buy-to-let lending - down 39% to £1.7bn for the half year - after the Government stiffened the rules.Half-year pre-tax profit reached £628m, boosted by the £26m sale of the company’s stake in Vocalink.However, it came in shy of the £696m recorded for the six-month period last year when the firm benefited from the £100m sale of a stake in Visa.Total underlying income also dipped slightly to £1.639bn, down from £1.642bn.Chief executive Joe Garner said: \nWe’ve demonstrated the value of mutuality in the period by returning £245m to members in the form of better-than-average interest rates, lower fees and higher incentives. \nLooking ahead, the UK economy should continue to grow, albeit at a slower rate due to the uncertainties around Brexit. \nDespite the recent base rate rise, borrowing costs overall remain low. \nHowever, we know that low wage growth and inflation are putting pressure on household budgets and we remain alert to signs of financial strains on consumers. \nNationwide is in very good shape after another strong set of results. The second half may bring tougher trading conditions, but we remain well placed to stand by our members in these uncertain times. Nationwide Building Society in Wallsend (Image: Google) 9:05 Jonathon Manning Newcastle city centre hotel comes a step closer with £32m deal \nThe construction of a luxury hotel in Newcastle city centre has come a step closer with a £32m deal to finance the development . \nUK Commercial Property Trust Limited , which owns a diverse portfolio of commercial property around the UK, is to fund the construction of a 265-bedroom, four-star Maldron Hotel as part of the redevelopment street of the former Newgate shopping centre site. \nIrish hotel operator Dalata will run the hotel, which is slated to open early in 2019, under its Maldron brand. The hotel will also have a conference centre, business meeting rooms and restaurant space. \nShops, student housing and bars/restaurants will also be included in the Newgate Street development. \nWill Fulton, fund manager at Standard Life Investments, said: \nDalata and its flagship Maldron brand are an exciting, well managed, high quality, competitive hotelier with good board level experience of operating in the UK hotel market. \nIts business plan is strong and I believe this hotel will compete well in the Newcastle market - home to leading universities and a thriving business community - whilst providing a high quality long and increasing income stream at an attractive yield on cost. \nDevelopers McAleer and Rushe purchased the two-acre city centre site for £18.2m in 2006, and the 1960s Newgate Shopping Centre was demolished in 2016 to make way for a new £100m mixed use development. \nAlongside the flagship hotel will be 185,000 sq ft of student accommodation operated by the Unite Group Plc, delivering more than 500 beds. A CGI of how the Maldron Hotel will look in Newcastle 9:00 Co-op Bank launches search for new chairman as Dennis Holt set to retire The Co-op Bank (Image: Getty Images Europe) 8:55 KEY EVENT Newcastle's Parkdean resorts appoints M&A director to lead expansion \nCaravan park company Parkdean Resorts is stepping up its national expansion plans after appointing its first mergers and acquisition (M&A) director. \nChartered accountant Lynn Shearing has been hired for the position after joining from big four accountancy firm PwC. \nMs Shearing graduated from Leeds University with a First Class degree in Accounting and Fiannce BA before sitting her ICAEW exams at PwC. She has since won both regional and national awards for her work. \nMs Shearing said: \nI’m looking forward to working closely with John, Ian and the team from Onex to put our ambitious plans into action. Growth is high on our agenda so this is an incredibly exciting time to be joining the team. \nWe would therefore be delighted to hear from anyone who thinks they have an acquisition opportunity which might be of interest to us. \nLast year Parkdean Resorts was acquired by Canadian private equity fund Onex Corporation for £1.35bn. During the deal Ms Shearing was placed on secondmend within Parkdean to oversee the work. \nParkdean Resorts’s future M&A deals will be overseen by CEO John Waterworth, CFO Ian Bull, Onex, and Ms Shearing. A Parkdean Resorts holiday park 8:50 Jonathon Manning Burger King set to expand around the country after winning major financial backing \nPrivate equity giant Bridgepoint is to spearhead Burger King’s expansion across the country after becoming the restaurants chain’s master UK franchisee, sources have said. \nIt is understood that the private equity group has struck a deal with Burger King Europe GmbH (BKE) to gain exclusive rights to the brand so it can launch new Burger King sites throughout Britain. \nIn a double swoop, Bridgepoint has also seized control of one of the largest UK franchisees - Caspian UK Group - which is home to 74 restaurants, mostly in the south and the Midlands. \nBurger King has more than 500 UK sites, but trails rival McDonald’s which has around 1,200. \nIt is understood that BKE, part of Restaurant Brands International, will continue to hold a minority stake in the new organisation, with Bridgepoint having over all control. \nBridgepoint declined to comment. \nThe burger market is seen as an increasingly lucrative - but increasingly competitive market - with a new operators springing up around the country and big American firms rolling out their networks around the country. \nChains including Five Guys, Byron Burger and Smashburger have all opened prominent sites in Newcastle over the last 18 months, but Byron closed its restaurant in the Metrocentre after falling into troubles while the Handmade Burger Company shut its operations in Eldon Square, the Metrocentre and The Gate. Burger King (Image: PA)", "external_links": [], "published": "2017-11-17T10:30:00.000+02:00", "crawled": "2017-11-17T11:14:54.019+02:00", "highlightTitle": ""}