{"organizations": [], "uuid": "2d38ad56469392789e943dd53a8b9f9d00417708", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/business/article713394.ece/ALTERNATES/s1200/WMN_FastGrowth75web.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "devonlive - frontpage", "url": "http://www.devonlive.com/news/here-top-75-fastest-growing-713254", "country": "GB", "title": "Here are the Top 75 Fastest Growing businesses in Devon and Cornwall", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-01T16:39:00.000+02:00", "replies_count": 0, "uuid": "2d38ad56469392789e943dd53a8b9f9d00417708"}, "author": "Hannah Finch", "url": "http://www.devonlive.com/news/here-top-75-fastest-growing-713254", "ord_in_thread": 0, "title": "Here are the Top 75 Fastest Growing businesses in Devon and Cornwall", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Here are the Top 75 Fastest Growing businesses in Devon and Cornwall The FG75 is now in its ninth year and is a snapshot of the regional economy Share Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nWelcome to the FG75 2017, your definitive guide to the fastest-growing companies across Devon and Cornwall. \nThe annual guide is a snapshot of the regional economy – it shows who is leading the way and the sectors that are reaping the rewards for all the investment they have put in to innovation, identifying new markets, people and infrastructure to build their businesses. Search the interactive guide to the FG75 2017 View fullscreen \nTopping the list is Falmouth superyacht company Pendennis and in second place is Midas Commercial Developments in Exeter. \nThere are seven Devon companies in the top ten and three from Cornwall. \nAndy Gordon, managing director for KPMG in Plymouth, said: “Over half the companies who feature in this year’s list were not in the top 75 last year. Some of the names appearing on the list for the first time are being the disruptors, unsettling traditional businesses, while others have remained on the list by focusing on their core strengths and striving for constant improvement.” \nOur sister publication, the Western Morning News , has teamed up with KPMG, who have compiled the list based on the Bureau van Dijk’s FAME database, law firm Stephens Scown and Shawbrook Bank. WMN Fast Growth 75 supplement sponsors L-R Ian Brokenshire - KPMG, Terry Wolfendale - Shawbrook Bank & David Culshaw - Stephens Scown. \nThe Fast Growth 75 list is compiled based on the average sales growth across the last four years of publicly reported results. \nTopping the rankings this year is Falmouth luxury yacht makers, Pendennis. \nClimbing to the top spot from 22 last year, the firm is reaping the benefit of historic investment decisions and continued focus on world leading quality. \nBut it is not just big global names that feature. \nMr Gordon said: “It is positive to see the fastest-growing businesses range considerably in size with the sub £10 million turnover category making up almost 40% of the Top 75. This demonstrates the agility that a number of smaller businesses benefit from, being able to react quickly to new opportunities and meet changing customer demands. \n“As would be expected of a league table based on revenue growth, the companies who appear in the Fast Growth 75 list can change significantly year-on-year as they strive to maintain growth against a background of macro-economic factors, changing consumer tastes and the impact of disruptors.” \nConstruction-related businesses have shown the strongest average growth and dominate the top ten with residential property performing strongly thanks to the ongoing demand for new homes. \nManufacturing has also demonstrated strong growth across a wide range of products from specialist vehicles through to pharmaceuticals and IT components. Mr Gordon said: “The South West has always had a strong manufacturing presence and the range of industries they serve help protect us from downturns in any one particular area.” \nHe said that the start of the increased benefit to exporters of the weak pound post Brexit referendum may also be seen. \nHe said: “Wholesale and retail trade companies feature strongly in the Top 75. \n“While the average growth achieved at 8% is less than half of that enjoyed by the construction based businesses, the 13 businesses from that sector account for 43% of the total revenue of the Top 75 combined.” \nChris Dawson’s The Range empire remains the largest individual company and continues its impressive growth profile. \nHe said: “All the companies on the list should be congratulated for what they have achieved. \n“Well done to you all. \n“It recognises those companies who are not prepared to stand still and instead focus on where they can grow their markets and push themselves forward.” Like us on Facebook", "external_links": [], "published": "2017-11-01T16:39:00.000+02:00", "crawled": "2017-11-01T16:45:01.000+02:00", "highlightTitle": ""}