{"organizations": [], "uuid": "8d5c09931c55041fd9cb06cfe22956dee2a29480", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article9414622.ece/ALTERNATES/s1200/JS63894039.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/sage-profits-power-up-10-13937765", "country": "GB", "domain_rank": 21960, "title": "Sage profits power up 10% after two-year strategy to 'perform and transform'", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-22T14:36:00.000+02:00", "replies_count": 0, "uuid": "8d5c09931c55041fd9cb06cfe22956dee2a29480"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/sage-profits-power-up-10-13937765", "ord_in_thread": 0, "title": "Sage profits power up 10% after two-year strategy to 'perform and transform'", "locations": [], "entities": {"persons": [{"name": "stephen kelly", "sentiment": "negative"}, {"name": "sage", "sentiment": "none"}, {"name": "kelly", "sentiment": "none"}], "locations": [{"name": "fairsail", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "intacct", "sentiment": "none"}], "organizations": [{"name": "sage business cloud", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Stephen Kelly, chief executive of Sage Share Get business updates   Thank you for subscribing!   \nNewcastle software giant Sage has posted a 10.3% leap in operating profits following a strong year to complete its two-year strategy to “perform and transform”. \nThe company, which provides a range of software solutions to SMEs around the world, announced a transformation strategy at the Capital Markets Day in 2015, a two-pronged attack to restructuring its core business, then invest and accelerate through key acquisitions. \nCEO Stephen Kelly said the strategy has now been completed, announcing full year results for the year ended September 2017 which showed revenue growth of 6.6% to £1.69bn, with profits also leaping 10.3% to £475m. \nLooking ahead, the firm said it expects top-line growth to increase to 8% this year as it accelerates the business. \nKey highlights for the year were software subscription revenue growth of 30.3% which now represents 37% of total revenue - up from last year’s 30% - and it also saw double digit organic revenue growth in half of the eight regions in the year. \nThe SME software provider also said that, from virtually no cloud presence in 2014, the firm now has a comprehensive suite of cloud solutions, unified under Sage Business Cloud with £300m of annualised recurring revenue, growing at over 80% in the year. Read More Top North East employer AkzoNobel ends merger talks with US rival Axalta \nIn his review of the financial year, Mr Kelly said that following the first phase of the transformation in its 2015 and 2016 financial years, management was more active in accelerating the strategy by disposing of the North American Payments business, and through the acquisitions of Compass, Fairsail and Intacct, saying more firms will be added to the Sage group in the future. \nHe said: “For each of the past three years we have delivered management’s guidance for at least 6% organic revenue growth and 27% underlying operating margins, whilst fundamentally transforming Sage. \n“We now have the leadership, organisational alignment, brand and comprehensive suite of cloud solutions, to accelerate momentum in our markets. Read More Brexit uncertainty won't stop investment into Quorn and Cauldron foods, bosses declare \n“The launch of Sage Business Cloud in October 2017 gives our customers the most comprehensive business management cloud platform in the market and provides the platform for this acceleration. \n“We will continue to drive efficiencies and productivity throughout the organisation and this is now ‘business as usual’.” \nSignificant emphasis has been placed on the successful integration of these acquisitions and Mr Kelly said the businesses acquired had showed strong momentum since joining the Sage family . \nHe added :“Going forward, Sage will look to continue to invest and accelerate the execution of the strategy, with bolt-on acquisitions of complementary technology and partnerships to further reinforce the golden triangle and enhance the Sage Business Cloud market leadership position. \n“We look forward to sharing the plans for Sage’s future accelerated growth journey at the Capital Markets Day in London on January 25 2018.” Like us on Facebook", "external_links": [], "published": "2017-11-22T14:36:00.000+02:00", "crawled": "2017-11-22T15:18:19.001+02:00", "highlightTitle": ""}