{"organizations": [], "uuid": "1f76bfb8371e1f1b622b90e58ccfee3b9f013e38", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13902323.ece/ALTERNATES/s1200/Brian-Palmer-with-a-robot-specially-designed-for-Ocado.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/northumberlands-tharsus-prepares-next-stage-13902251", "country": "GB", "domain_rank": 21960, "title": "Northumberland's Tharsus prepares for next stage of growth after joining Stock Exchange programme", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-14T18:30:00.000+02:00", "replies_count": 0, "uuid": "1f76bfb8371e1f1b622b90e58ccfee3b9f013e38"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/northumberlands-tharsus-prepares-next-stage-13902251", "ord_in_thread": 0, "title": "Northumberland's Tharsus prepares for next stage of growth after joining Stock Exchange programme", "locations": [], "entities": {"persons": [{"name": "luca peyrano", "sentiment": "none"}, {"name": "brian palmer", "sentiment": "none"}, {"name": "ocado", "sentiment": "none"}], "locations": [{"name": "northumberland", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "blyth", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "cambridge", "sentiment": "none"}], "organizations": [{"name": "northumberland", "sentiment": "negative"}, {"name": "stock exchange", "sentiment": "negative"}, {"name": "elite uk", "sentiment": "none"}, {"name": "london stock exchange", "sentiment": "none"}, {"name": "elite", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "lse", "sentiment": "none"}, {"name": "ocado", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Northumberland's Tharsus prepares for next stage of growth after joining Stock Exchange programme The Northumberland business is the first robotics firm to be accepted into the LSE's Elite network Share Click to play Tap to play The video will start in 8 Cancel Play now Get business   \nNorthumberland robotics company Tharsus is gearing up for its next phase of growth after being accepted into the London Stock Exchange’s Elite programme. \nTharsus is the first robotics firm to be included in the Elite programme, which is designed to support international businesses, provide advice, and help companies raise capital. \nThe North East firm was accepted into the network to help represent the growing robotics industry. It joins a network of over 750 international businesses, include more than 100 that are based in the UK. \nEach member business is considered an expert in its field and are able to offer specialist advice about their respective sectors. Read More Robotics firm Tharsus provides horsepower for Ocado’s new warehouse \nTharsus is best known for manufacturing robots that are used to pick groceries within a warehouse for online retailer Ocado. The two firms have worked together since 2013 and Ocado recently revealed it would be introducing Tharsus robots at more of its UK sites. \nTharsus’ membership to Elite, along with its extended partnership with Ocado, is set to kick off the next phase of the firm’s growth strategy. Brian Palmer with a robot specially designed for Ocado (Image: Unknown) \nCEO Brian Palmer said: “We are extremely proud to be part of the London Stock Exchange’s Elite UK programme. Tharsus has experienced monumental growth in recent years and we’re looking forward to driving that forward with Elite. \n“I think that this scheme, with access to the advisory support and leading capital markets network, will be instrumental to our continued growth and success.” Read More Japanese ambassador warns that Brexit uncertainty could see companies invest elsewhere \nThe Elite programme aims to support firms in raising capital but it is unknown whether Tharsus will seek to raise this cash through a stock market flotation, or through other external financing options. \nTharsus currently operates three UK site, which are based in Blyth , Durham and Cambridge, and employs a team of highly-skilled engineers and designers. \nLuca Peyrano, chief executive officer of Elite, said: “I am delighted to welcome the latest group of UK companies to Elite. \n“Innovative, inspiring and fast growing businesses are essential for the British economy driving growth, innovation and employment. We look forward to supporting 20 more UK businesses scale up and achieve their growth ambitions.” Like us on Facebook", "external_links": [], "published": "2017-11-14T18:30:00.000+02:00", "crawled": "2017-11-14T19:11:51.002+02:00", "highlightTitle": ""}