{"organizations": [], "uuid": "71c2e05155111beb034151cba9c58efec550a287", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13333344.ece/ALTERNATES/s1200/JS118116250.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/whats-on/whats-on-news/sunderland-win-city-culture-2021-13976630", "country": "GB", "domain_rank": 21960, "title": "Will Sunderland win City of Culture 2021? Here's when the decision will be announced", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-30T16:39:00.000+02:00", "replies_count": 0, "uuid": "71c2e05155111beb034151cba9c58efec550a287"}, "author": "David Whetstone", "url": "http://www.chroniclelive.co.uk/whats-on/whats-on-news/sunderland-win-city-culture-2021-13976630", "ord_in_thread": 0, "title": "Will Sunderland win City of Culture 2021? Here's when the decision will be announced", "locations": [], "entities": {"persons": [{"name": "rebecca ball", "sentiment": "none"}, {"name": "bob stokoe", "sentiment": "none"}, {"name": "paisley", "sentiment": "none"}, {"name": "joseph swan", "sentiment": "none"}, {"name": "alice", "sentiment": "none"}, {"name": "rebecca", "sentiment": "none"}, {"name": "frankie", "sentiment": "none"}, {"name": "keith merrin", "sentiment": "none"}, {"name": "roker", "sentiment": "none"}, {"name": "hull", "sentiment": "none"}, {"name": "john glen", "sentiment": "none"}], "locations": [{"name": "stoke-on-trent", "sentiment": "none"}, {"name": "sunderland uk city", "sentiment": "none"}, {"name": "wonderland", "sentiment": "none"}, {"name": "uk city", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "wales", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "tyneside", "sentiment": "none"}, {"name": "teesside", "sentiment": "none"}, {"name": "swansea", "sentiment": "none"}], "organizations": [{"name": "sunderland", "sentiment": "neutral"}, {"name": "bbc", "sentiment": "none"}, {"name": "liverpool", "sentiment": "none"}, {"name": "department of digital", "sentiment": "none"}, {"name": "digital", "sentiment": "none"}, {"name": "coventry", "sentiment": "none"}, {"name": "sunderland civic centre", "sentiment": "none"}, {"name": "vaux breweries", "sentiment": "none"}, {"name": "sunderland culture", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "hull", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "What's On Will Sunderland win City of Culture 2021? Here's when the decision will be announced The Wearside city is up against four rivals from England, Scotland and Wales in the race to follow Hull's 12 months in the spotlight Share Sunderland UK City of Culture 2021 Share Get what's on updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nIs Sunderland to follow Derry/Londonderry and Hull as the third UK City of Culture in 2021? All will be revealed next Thursday. \nThe Department of Digital, Culture, Media and Sport has announced that the winner will be revealed on The One Show on BBC One between 7pm and 7.30pm on December 7. \nThe announcement will be made on an edition of the programme broadcast live from Hull as the city celebrates its successful 12 months in the cultural spotlight. \nRevealing the winner will be arts and culture minister John Glen. \nIn the run-up to the winner being announced, each of the five shortlisted contenders has been allotted a special day on the social media channels of the Depertment of Digital, Culture, Media and Sport. \nSunderland’s special day is to be Tuesday, December 5, with the other hopefuls being Swansea, Coventry, Paisley and Stoke-on-Trent. Rebecca Ball, director of Sunderland 2021 (Image: Newcastle Chronicle) \nThose behind the Sunderland UK City of Culture bid are urging supporters to use the day to express how much they want the title. \nAnd although the written bids have been submitted and the judges have visited the city, there is still a chance for the Sunderland bid team to make an impression. \nRebecca Ball, director of the Sunderland bid, said: “Our final presentation to the judges is in Hull next Thursday morning, so we won’t have too long to wait for a decision. \n“We’ve come a long way since first announcing the bid and the support shown by the city and the wider region has been tremendous.” \nRebecca and colleagues are requesting a Sunderland “social media takeover” from 9am next Tuesday. Read More \nPeople are being urged to showcase people, places, songs and stories that best capture Sunderland using the hashtages #Sunderland2021 and #UKCityofCulture2021 and the tag @DCMS. \nRebecca added: “This city has inspired so much great art, sport and stories. \n“To celebrate this we’d like everyone to share their favourite photos and most inspiring facts about our city. \n“On Tuesday we want everyone to tell the country who and what their Sunderland cultural icons are. \n“It’s our last push and I hope as many people as possible can support us and show how much this city wants to win this.” The 2021 City of Culture flag flying above Sunderland Civic Centre (Image: Newcastle Chronicle) \nJoseph Swan, Roker beach, Vaux Breweries, Alice in Wonderland, FA Cup-winning football boss Bob Stokoe, Frankie and the Heartstrings and Penshaw Monument are among the things the team would like to see shared on Instagram or Facebook. \nAnd those who view the region through the natural rivalry of football might like to consider that a successful Sunderland bid could benefit the wider region, including Tyneside and Teesside. \nKeith Merrin, chief executive of Sunderland Culture, the company set up to deliver the bid, put the UK CIty of Culture contest in perspective. \n“Next Thursday is an important day for the city and we’re all hoping and praying that the result goes our way,” he said. \n“But win or lose, the city is in a much different position now than it was when we first declared our intention to bid for the title. \n“Not just in terms of infrastructure and substantial investment into our arts and culture sector, and not just in a change of how our city is seen – the bidding process and our shortlisting has given us all a huge confidence boost. \n“Others now recognise the journey we’re on and the momentum that the bid has built will continue whether we’re successful next week or not.” The 2021 City of Culture flag flying above Sunderland Civic Centre (Image: Sunderland2021) \nBack in 2003, when Liverpool pipped NewcastleGateshead to the title of European Capital of Culture 2008 – a contest no longer open to the UK as it paves the way for Brexit – the air of despondency did not last long. \nThe cry soon went up: “2008? Why Wait” The NewcastleGateshead bid team immediately declared that much of its programme would happen anyway with a focus on 2005. \nThe interest generated by that contest was what spurred the Government to come up with the UK’s own culture contest to be awarded every four years. Read More On a big night for Sunderland here's a look at The Fire Station, reborn as a cultural centre \nDerry/Londonderry was first in 2013 and Hull followed this year with a programme that has boosted the city’s profile and brought economic benefits. \nSunderland was shortlisted for the 2021 edition of the competition in July and the judges visited early in November. \nThe bid has been backed by local and regional businesses, councils, MPs, colleges, universities, celebrities and very many residents of the city. Like us on Facebook", "external_links": [], "published": "2017-11-30T16:39:00.000+02:00", "crawled": "2017-11-30T16:58:16.010+02:00", "highlightTitle": ""}