{"organizations": [], "uuid": "1266ecb2f3373e63c9d4eb619e3cb263043e6db5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article718591.ece/ALTERNATES/s1200/3655879.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/news/business/how-bank-england-interest-rate-718547", "country": "US", "domain_rank": 48128, "title": "How will Bank of England interest rate rise affect you? - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.471, "site_type": "news", "published": "2017-11-02T16:06:00.000+02:00", "replies_count": 0, "uuid": "1266ecb2f3373e63c9d4eb619e3cb263043e6db5"}, "author": "Sam Dimmer", "url": "http://www.leicestermercury.co.uk/news/business/how-bank-england-interest-rate-718547", "ord_in_thread": 0, "title": "How will Bank of England interest rate rise affect you? - Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "zavvi", "sentiment": "none"}, {"name": "chris hobson", "sentiment": "none"}, {"name": "chris gordon", "sentiment": "none"}, {"name": "adrian macdiarmid", "sentiment": "none"}, {"name": "doug crawford", "sentiment": "none"}], "locations": [{"name": "greece", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "grove park", "sentiment": "none"}, {"name": "enderby", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}], "organizations": [{"name": "bank of england", "sentiment": "neutral"}, {"name": "leicester mercury news how will bank of england", "sentiment": "neutral"}, {"name": "my home move", "sentiment": "none"}, {"name": "monetary policy committee", "sentiment": "none"}, {"name": "barratt developments", "sentiment": "none"}, {"name": "credit crunch", "sentiment": "none"}, {"name": "mfi", "sentiment": "none"}, {"name": "confederation of british industry", "sentiment": "none"}, {"name": "share sam dimmer digital development", "sentiment": "none"}, {"name": "debenhams", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}, {"name": "woolworths", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "east midlands chamber", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News How will Bank of England interest rate rise affect you? If you've got a mortgage or a savings account the 0.25 per cent rise will have an impact Share Sam Dimmer Digital Development Editor 14:06, 2 NOV 2017 Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe Bank of England base rate rose from 0.25 per cent to 0.5 per cent today – the first time it has gone up in more than a decade. \nIt takes the base rate – the official figure banks and building societies set their own rates by – back to where it was in August last year. \nAt a time when the UK is bracing itself for the financial upheavals of Brexit , it is a gamble the BofF has not taken lightly. \nToday’s move – widely anticipated by the markets – means a homeowner with a variable rate deal will take an immediate hit, while those on fixed rates due to end soon will feel the pinch when remortgaging. \nAccording to analysts, someone with a variable mortgage of £250,000, and an average monthly payment of £1,125, should expect to see a monthly rise of around £32. \nBecause fewer than one in 10 homeowners are on variable rates, most people won’t be immediately affected. Read More 75 Christmas jobs going at Debenhams in Leicester, here's how to apply \nHousebuilders were quick to point out today that the small rate hike shouldn’t have a crippling effect on home owners or put a stop to people about to get on the housing ladder. \nAdrian MacDiarmid is head of mortgages at Coalville-based Barratt Developments, the UK’s biggest housebuilder, which completed more homes last year than at any time in almost a decade. He said: “Our message is simple. Just because there has been a small rate rise, that shouldn’t put people off buying a home. \n“Over the last four years interest rates for a typical 85 per cent mortgage have dropped by two whole percentage points, so even if they now go up a little bit, historically they are still very low. \n“We are not expecting a swift return to the high rates of the 1980s and 1990s, although we always advise people to take independent mortgage advice from a broker who can advise on affordability. \n“And with the government announcing new funding to the tune of £10 billion to support Help to Buy, now really is a good time to get on the property ladder with just a 5 per cent deposit.” Read More £7million hotel \nMillions of savers who have seen returns on their savings accounts stagnate for the past decade, are likely to see their returns edging up. \nSomeone with £5,000 in a typical savings account – currently collecting about £7 a year in interest – will potentially gain another £12-or-so. \nOver in the business community, most captains of industry have been prepared for the rise, though some feel that with the uncertainty of Brexit looming large, now might not have been the best time to mess with the status quo. \nChris Hobson is director of policy at East Midlands Chamber, which represents the interests around 800 Leicestershire businesses. \nHe said: “Our preferred outcome was for a further period of monetary stability, with interest rates retained at their historic low for the near term. \n“However, today’s quarter of a percentage point rise may have little effect on most companies, although some will view this as the first step in a longer policy movement, which could defer investment. \n“These are challenging times for monetary policymakers. You could feel the pinch if you're about to remortgage (Image: Chris Gordon) \n“The BofE’s Monetary Policy Committee had the unenviable task of weighing future risks to inflation, from a tight – and tightening – labour market, pass-through from a weaker pound and rising commodity prices. \n“Against this, they needed to consider the future risks to undershooting the inflation target from weak growth, fragile business confidence, and the effects of uncertainty. \n“These are finely-balanced judgements. \n“While interest rates will need to return to historic averages at some point, it should be done slowly and with reference to the ever-changing economic context. \n“With the Bank of England’s latest forecasts of sluggish growth for the next few years, the Government must use the upcoming Budget to boost business confidence for investment and reduce burdens such as business rates hikes.” Read More It's official - this Leicestershire restaurant produces the best pasta dish in the country \nRain Newton-Smith, chief economist at the Confederation of British Industry, which represents 190,000 UK businesses, said the decision came as no surprise. \nShe said: “While it’s the first rate rise in over a decade, it is only taking the rate back to the level seen in August 2016 and at 0.5 per cent it remains near rock bottom. \n“Businesses will be watching the reaction of consumers closely and what’s important is the pace of any future rises. \n“As rates creep up, it’ll be important to keep an eye on the impact for those at the lower end of the income scale.” \nInterest rates started to fall to their historic low 10 years ago when Leicestershire was in the thick of the Credit Crunch, which ushered in the worst recession for a generation. \nBanks went bust, the housing market tanked, manufacturers were forced to lay off staff and the economies of countries such as Spain and Greece fell off a cliff. \nLeicester itself, was hit by the loss of big brand retailers such as Woolworths, Zavvi and MFI as “to let” and “for sale” signs started appearing outside more and more empty shops. \nIn a bid to stem the impact of the global economic contraction the Bank of England started cutting its base rate. \nThe result has been a decade of cheap borrowing that allowed the housing marker to battle its way through the storm. \nMillions of homeowners were helped. \nDoug Crawford, chief executive of My Home Move, a property conveyancing specialist in Grove Park, Enderby, said mortgage holders should be encouraged to remember that 0.5 per cent was still a historically low rate. \nHe said: “For people saving a deposit to purchase a home, the rate rise should be welcomed news, as they should see a slightly better return on their savings. \n“For the housing market, the developments and risk controls that lenders have in place will continue to protect investment in housing and ensure that the market remains stable for the foreseeable future. \n“As always, banks and building societies will continue to offer their new and existing customers highly competitive rates and brokers will continue to find their customers the best deal for them.” Like us on Facebook ", "external_links": [], "published": "2017-11-02T16:06:00.000+02:00", "crawled": "2017-11-02T18:48:39.001+02:00", "highlightTitle": ""}