{"organizations": [], "uuid": "55c8048f2299f94beb9a5764c76ad9f9f54b3870", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article10586852.ece/ALTERNATES/s1200/JS77966375.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/nissan-could-make-future-models-13887771", "country": "GB", "domain_rank": 21960, "title": "Nissan could make future models in the EU after Brexit, warns academic", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-12T15:00:00.000+02:00", "replies_count": 0, "uuid": "55c8048f2299f94beb9a5764c76ad9f9f54b3870"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/nissan-could-make-future-models-13887771", "ord_in_thread": 0, "title": "Nissan could make future models in the EU after Brexit, warns academic", "locations": [], "entities": {"persons": [{"name": "renaultnissan", "sentiment": "none"}, {"name": "carlos ghosn", "sentiment": "none"}, {"name": "david bailey", "sentiment": "none"}, {"name": "bailey", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "qashqai", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}], "organizations": [{"name": "nissan", "sentiment": "negative"}, {"name": "aston business school", "sentiment": "none"}, {"name": "customs union", "sentiment": "none"}, {"name": "smmt", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "vauxhall astra", "sentiment": "none"}, {"name": "continental europe", "sentiment": "none"}, {"name": "honda civic", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "energy and industrial committee", "sentiment": "none"}, {"name": "international advanced manufacturing park", "sentiment": "none"}, {"name": "kpmg", "sentiment": "none"}, {"name": "society of motor manufacturers", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Nissan could make future models in the EU after Brexit, warns academic Automotive experts will tell Parliament that manufacturers may look to increase efficiency at car plants outside of the UK Share Click to play Tap to play The video will start in 8 Cancel Play now Get business   Thank you for subscribing!   \nNissan and other UK car manufacturers could decide to make new models overseas because of Brexit uncertainty , a leading academic has warned the Government. \nProfessor David Bailey, an economics lecturer at Aston Business School, has warned that major car manufacturers may shift production of new models to factories in Continental Europe because of the uncertainty surrounding Brexit. \nProfessor Bailey argues that uncertainty could lead to new models being made in overseas plants where there is spare capacity on production lines. \nHis warning - which echoes comments made from senior Nissan executives - has come in evidence to the Commons Business, Energy and Industrial Committee, which is liaising with representatives from the UK automotive industry to discuss the implications of Brexit. \nIn his evidence to the committee, Professor Bailey said: “It should be noted that the UK auto industry’s success rests in large part on its productivity. The UK auto industry boasts plant utilisation running at over 70%, with several plants running 24/7 operations (KPMG, 2014). This compares favourably to European nations such as Italy, where utilisation runs at just over 50%. \n“Nissan’s Sunderland car plant was the UK’s most productive in 2015, building one-in-three of all new vehicles. \n“The risk is that some firms will try to take advantage of spare capacity on the continent, shifting production from the UK at the time of new model launches, especially if uncertainty can be used to justify it.” (Image: Owen Humphreys/PA Wire) \nNissan is to manufacture its Qashqai and XTrail models in Sunderland after entering into talks with the Government. \nBut in January, then RenaultNissan CEO Carlos Ghosn said he could not rule out moving future models to the company’s other plants, stating “important investment decisions will not be made in the dark”. \nRenaultNissan operates two factories in Spain and one in France. Read More Revealed: The multimillion pound deals which see overseas firms buy North East property \nOther car manufacturers will also be considering where to build their vehicles. The production of future generations of the Vauxhall Astra, Honda Civic, Toyota Auris, and Range Rover Sport are all due to be made in the next few years. \nProfessor Bailey added: “Those investment decisions will be made in what looks to be at least a two-year window of uncertainty.” \nThe Society of Motor Manufacturers and Traders, an umbrella group for automotive industry, also provided written evidence to the Select Committee, outlining the automotive sector’s priorities during Brexit negotiations. \nThese include having an interim arrangement with the EU, keeping the single market, free-trade, access to workers, and certainty on automotive regulations. Read More 'Drive for free' offer from Nissan and renewable energy firm Ovo \nThe free movement of goods between the EU and the UK was one of the biggest concerns raised because the automotive sector operates a just-in-time system, which requires parts to arrive at factories exactly when required. \nIn its evidence SMMT said: “The automotive industry operates both lean and just-in-time procedures, which rely upon highly efficient logistics and the elimination of delays at the border. As a member of the Customs Union delays are very rarely incurred on trade between the EU and UK. \n“SMMT seeks continuity in the trade of goods across borders between the UK and EU with customs arrangements that maintain the free, frictionless and non-burdensome flow of goods. \n“Government should prioritise delivering the ‘freest’ possible trading zone with minimal procedural and compliance costs.” \nThe automotive industry is a key sector for the North East economy, with authorities hoping to build on the success of the Nissan plant and the supply chain that has built up around it with the creation of the International Advanced Manufacturing Park. \nBut a number of experts in the industry have warned that the automotive sector could be hugely damaged by a hard Brexit, because of the number of times that parts cross national borders in the manufacturing processes of most vehicles. Like us on Facebook", "external_links": [], "published": "2017-11-12T15:00:00.000+02:00", "crawled": "2017-11-12T15:35:35.010+02:00", "highlightTitle": ""}