{"organizations": [], "uuid": "28a8c0b5a20ce9e7f486acc361f54b38abde2662", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article519681.ece/ALTERNATES/s1200/johnhartJPG.jpg", "site_section": "http://www.westernmorningnews.co.uk/news.rss", "section_title": "devonlive - News", "url": "http://www.devonlive.com/news/devon-news/abolish-devon-district-borough-councils-790015", "country": "GB", "title": "'Abolish Devon district and borough councils to create super authority'", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-17T02:01:00.000+02:00", "replies_count": 0, "uuid": "28a8c0b5a20ce9e7f486acc361f54b38abde2662"}, "author": "devonlive", "url": "http://www.devonlive.com/news/devon-news/abolish-devon-district-borough-councils-790015", "ord_in_thread": 0, "title": "'Abolish Devon district and borough councils to create super authority'", "locations": [], "entities": {"persons": [{"name": "baroness jane scott", "sentiment": "none"}, {"name": "lady scott", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "phillip blond", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "john hart", "sentiment": "none"}, {"name": "blond", "sentiment": "none"}], "locations": [{"name": "devon", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "cornwall", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "surrey", "sentiment": "none"}], "organizations": [{"name": "local government", "sentiment": "none"}, {"name": "wiltshire council", "sentiment": "none"}, {"name": "county council network", "sentiment": "none"}, {"name": "county councils network", "sentiment": "none"}, {"name": "devon county council", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "'Abolish Devon district and borough councils to create super authority' Report says scrapping two-tier local government system will boost economy by £31bn Share Devon County Council leader John Hart Share   Thank you for subscribing!   \nThe Government could deliver a £31 billion boost to the economy over five years by abolishing 201 district and borough councils in England and handing over their powers to county halls, a new report has said. \nThe report from think tank ResPublica calls for the abolition of the historic two-tier system of local government, which sees most rural areas of England covered by both a county council and a smaller district or borough authority with sometimes overlapping responsibilities. \nResPublica director Phillip Blond said the system is causing “needless confusion”, as businesses and developers find their plans frustrated by “parochial” decision-making on strategic issues. \nDitching the two-tier system and following the example of unitary councils adopted by most cities would help iron out wide variations in productivity which see workers in Cornwall take five days to produce the same value that can be delivered in three days in Surrey, he said. Read More These are Devon's 10 biggest planned housing developments \nWith uncertain economic conditions after Brexit, the report said it was “vital” for counties to be prepared to weather the possible storm, particularly as those which voted most strongly to leave the EU are thought to be most vulnerable to any decline in trade resulting from it. \n“The needless confusion that frustrates the ambitions of business and government alike in our county areas must end now,” Mr Blond said. \n“With Brexit on the horizon and our city-regions already benefiting from devolution, we can’t afford the waste and complication that the current system creates. \n“Single councils at the county scale are the future and we call on the Government to move rapidly to encourage them.” \nBaroness Jane Scott, the leader of Wiltshire Council, said the move to a unitary authority in the county in 2009 had been a “great success” and warned that counties which fail to follow its lead face “the real risk of ... being left behind”. \n“Streamlining counties will contribute billions to the national economy and will be good for business,” said Lady Scott, the County Councils Network’s spokeswoman on reform. Read More \n“But the real winners are local residents who will benefit from improved public services, less bureaucracy, and access to more housing and facilities that meet local need and demand.” \nThe report will be launched at the County Council Network’s annual conference on November 20. \nA spokesman for the Department for Communities and Local Government said: “Moving to a single tier large unitary authority can often give residents a better deal for their local taxes, improved local services, less bureaucracy and stronger and more accountable local leadership. \n“However, we are clear that any such move must be both locally led and have support from the community.” Like us on Facebook", "external_links": [], "published": "2017-11-17T02:01:00.000+02:00", "crawled": "2017-11-17T02:23:43.014+02:00", "highlightTitle": ""}