{"organizations": [], "uuid": "a418391f36683efd41ab65f54a975b467554fa63", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13972131.ece/ALTERNATES/s1200/catherine.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/uk-will-paying-years-come-13972033", "country": "GB", "domain_rank": 21960, "title": "UK 'will be paying for years to come' if it agrees £50bn Brexit bill", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-29T18:19:00.000+02:00", "replies_count": 0, "uuid": "a418391f36683efd41ab65f54a975b467554fa63"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/uk-will-paying-years-come-13972033", "ord_in_thread": 0, "title": "UK 'will be paying for years to come' if it agrees £50bn Brexit bill", "locations": [], "entities": {"persons": [{"name": "catheri", "sentiment": "negative"}, {"name": "liz truss", "sentiment": "none"}, {"name": "barnier", "sentiment": "none"}, {"name": "priti patel", "sentiment": "none"}, {"name": "jean-claude juncker", "sentiment": "none"}, {"name": "catherine mckinnell", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "mckinnell", "sentiment": "none"}, {"name": "nigel farage", "sentiment": "none"}, {"name": "michel barnier", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "dublin", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "newcastle north", "sentiment": "negative"}, {"name": "cabinet", "sentiment": "none"}, {"name": "ms truss", "sentiment": "none"}, {"name": "house", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}, {"name": "european commission", "sentiment": "none"}, {"name": "berlin security conference", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "european council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News UK 'will be paying for years to come' if it agrees £50bn Brexit bill Newcastle North MP Catherine McKinnell says the country is going to hand over billions in return for a worse deal than it has now   Thank you for subscribing!   \nThe UK will be paying “for years to come” if it agrees to a £50bn Brexit bill for leaving the European Union. \nThat’s the warning from Newcastle North MP Catherine McKinnell , who said the nation would be paying the money to get a worse deal than it has now. \nIt follows reports that trade talks between the EU and UK are set to begin at last, after the UK agreed to hand over the massive sum. \nMs McKinnell said the EU was the North East’s largest market. Newcastle North MP Catherine McKinnell (right) \nShe said: “We know that leaving the EU is going to be a costly process in many ways – and it’s right that the UK stands by commitments it has already made. \n“However, I don’t think anyone voting to leave last year ever imagined the final bill would be quite so high, nor that we’d still be paying it for years to come. \n“And people who thought leaving the EU would result in hundreds of millions of pounds a week more being spent on our public services may end up being very disappointed indeed. \n“What’s deeply concerning is that we are effectively paying for reduced access to what is the North East’s largest market, whilst giving up all of our rights to shape or influence its rules.” Read More What is Article 50? \nAny “divorce bill” for Brexit will be contingent on getting a good deal on future trade, Treasury Minister Liz Truss insisted. \nMs Truss, the Chief Secretary to the Treasury, was speaking to MPs after it was reported that UK negotiators in Brussels have agreed a broad framework for a financial settlement which could see Britain pay up to £50bn. \nShe dismissed the reports as “media speculation”, and said that Prime Minister Theresa May had made clear that the remaining 27 EU member states would not be left out of pocket because of UK withdrawal. \nBut she insisted that any divorce bill would be smaller than the cost of ongoing contributions to EU budgets if Britain remained, telling MPs: “Whatever happens, we will not be paying anything like what we would have paid as an EU member, and that represents a considerable saving for the taxpayer.” \nResponding to an urgent question in the House of Commons, Ms Truss said: “What we have seen today is simply media speculation and we will update the House when there is more detail to give.” \nShe added: “As we have said, nothing is agreed until everything is agreed. Any settlement that we make is contingent on us securing a suitable outcome.” Read More After Grenfell disaster, Newcastle council boss warns it's hard to find out whether housing is safe \nOfficials close to the Brexit negotiations have been reported as saying broad agreement has been reached on a framework for the UK to settle liabilities expected to total around 45-55 billion euros (£40-£49bn). \nIf confirmed, the move could clear the way for Mrs May to finally achieve her goal of moving Brexit negotiations onto the issue of trade. \nHowever, differences with Dublin over the status of the border in Ireland could still block progress at the European Council summit on December 14-15. \nThe EU’s chief negotiator Michel Barnier stressed on Wednesday that agreement on the key divorce issues of the financial settlement, the Irish border, and citizens’ rights was “not there yet”. \nSpeaking at the Berlin Security Conference, he said: “We are awaiting sufficient progress from London ... We are not there yet. The work on the three main subjects continues this week in a constructive spirit with the UK. \n“The next European Council will take place in 15 days’ time. If real ‘sufficient progress’ is actually made, the European Council will be able to open the discussion of a possible transitional period.” \nMrs May is due to meet European Commission president Jean-Claude Juncker on Monday for make-or-break talks which could determine whether Mr Barnier is able to declare that sufficient progress has been made to move the talks onto their second phase. \nA recommendation from the French diplomat would spark intensive discussions in EU capitals over the 10 days before the European Council summit, at which any of the 27 remaining member states could wield a veto. \nThe reported deal on the divorce bill was denounced by former Ukip leader Nigel Farage as a “sellout”. \nAnd former Cabinet minister Priti Patel said on Monday that the EU should be told to “sod off with their excessive financial demands”. Like us on Facebook", "external_links": [], "published": "2017-11-29T18:19:00.000+02:00", "crawled": "2017-11-29T18:42:30.001+02:00", "highlightTitle": ""}