{"organizations": [], "uuid": "8c99dfe07c8ff0bfc00150df10de329fb57d5bc4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13843262.ece/ALTERNATES/s1200/Boarded-up-shops-in-UK-High-Streets-a-sign-of-the-recession.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13893469", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: UK high street closures drop to lowest levels since 2010", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-13T10:30:00.000+02:00", "replies_count": 0, "uuid": "8c99dfe07c8ff0bfc00150df10de329fb57d5bc4"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13893469", "ord_in_thread": 0, "title": "Business Breakfast LIVE: UK high street closures drop to lowest levels since 2010", "locations": [], "entities": {"persons": [{"name": "humber", "sentiment": "negative"}, {"name": "jervis", "sentiment": "none"}, {"name": "ben", "sentiment": "none"}, {"name": "jerry", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "great britain", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "east midlands", "sentiment": "none"}], "organizations": [{"name": "yorkshire", "sentiment": "negative"}, {"name": "local data company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KEY EVENT Notebook brand Moleskine looking for partner to open UK cafés \nMoleskine, famed for its iconic notebooks and diaries, has been in talks with potential business partners in London over the global expansion of its eponymous cafe that first opened its doors in Milan last year.Chairman Arrigo Berni said that the Italian company has yet to find a good fit for its plans, but is confident that the Moleskine Cafe will soon make its way to Britain and further afield. \nHe said: \nWe’ve been having a number of conversations regarding locations in the UK over these past few months. \nWe would love to find someone that would be able to help us on a global basis but until now we haven’t found them, and we’re having conversations with local groups in different areas of the world. \nAfter German-speaking countries, the UK is the brand’s second largest market in Europe, the chairman said, making it an attractive location for its expansion. \nHe said: \nThe UK is an important market for us and is certainly one of the major metropolitan areas in the world and it continues to be like that even in the case of Brexit. \nIt’s not a matter of ‘if’ - it’s only a matter of ‘when’ we’ll be there with a Moleskine Cafe. \nThe company launched in 1997, resurrecting the design of a black notebook made by a family-owned French-bindery and made famous by well-known users such as Picasso, Hemingway and Matisse.It has since branched out and diversified its revenue streams, introducing a range of bags, wallets, laptop, iPhone and tablet cases alongside its classic planners and notebooks.Added to that is its Milan cafe, which opened in June 2016 as a test site for further locations, and more technologically advanced products such as a Smart Pen that syncs a “smart” physical planner with online schedulers like iCal and Google Calendar.Moleskine - which was delisted from the Milan stock exchange following takeover by Belgium’s luxury car importer and services firm D’Ieteren last year - reported a 13% rise in sales to €145.2m (£128.2m) last year. The Moleskine Smart Set KEY EVENT Realsafe Technologies takes motorbike safety app to Malaysia \nNewcastle’s Realsafe Technologies is continuing its international expansion after it revealed it is rolling out its motorbike safety app across Malaysia. \nThe RealRider app protects motorcyclists by detecting whether the rider has had a crash and then notifying the emergency services with the rider’s last known location. \nThe technology is already being used in the UK and Canada, but the firm is now taking its products to Asia after striking a deal with Malaysian telematics Company VTOS. \nIt will be the first app of its king to be connected to the emergency services in South East Asia when it launches in the first quarter of 2018. \nCEO of Realsafe Technologies, Zoe Farrington, said: \nWorking with VTOS is an exciting new chapter for the company that sees us realise aspirations for growth in new territories. \nWe have been defining and refining plans with VTOS for several months and are confident that with their proven track record and contacts in the industry our partnership will be mutually beneficial while providing much needed protection for vulnerable riders. \nMalaysia is expected to have more than 11 million motorbike riders, and a further 135 million are present across South East Asia. \nAfter launching in Malaysia the service will then be rolled out across Singapore, Thailand, Indonesia and Vietnam. The expansion will take between 24 and 36 months to complete. Zoe Farrington of Realsafe Technologies at the Northern Design Centre, Gateshead (Image: Newcastle Chronicle) 9:20 Historic tea firm Ringtons opens new distribution centre in Newcastle \nHistoric tea brand Ringtons has become the latest tenant at a growing Newcastle trading park . \nByker based Ringtons has signed a five-year lease on a 5,701 sq ft unit at Brough Park trading park, which has recently undergone a comprehensive refurbishment. \nBNP Paribas Real Estate and HTA Real Estate acted as joint letting agents for Canmoor Asset Management and secured the deal before the makeover works were completed. \nThe trade park, which is based on Fossway, Newcastle, was acquired by BlackRock Industrial Trust in 2014 in conjunction with Canmoor Asset Management, which oversaw the recent refurbishments. \nAidan Baker, director of agency in BNP Paribas Real Estate’s Newcastle office, who brokered the deal, said: \nSince the acquisition of the estate by BlackRock and proactive asset management by Canmoor, we are delighted to have completed this most recent letting on the estate and reduced voids to a minimum. \nUpon original instruction, we had seven vacant units to dispose of and following a full refurbishment of the vacant units by Canmoor we have secured six new lettings in the last 12 months. \nStephen Drysdale, head of Ringtons Beverages, said: \nRingtons Beverages division and online store have seen substantial growth over the last few years and distribution for both services will be managed from our new site in Brough Park. \nThe site is just around the corner from Ringtons’ head office in Byker, making it an ideal location, and the refurbished space includes a warehouse, packing facility, office space and trade counter. \nThe new site not only allows us to continue to provide a fast and efficient service to existing customers, but it also gives us plenty of scope for growth. Ringtons Tea, Algernon Place, Byker (Image: Steve Ellwood) 9:15 Jonathon Manning Watch a Nissan car roll off the production line \nNissan’s Sunderland plant manufactures around a third of all cars built in the UK. Here is how one of its Infiniti Q30 models is made: 9:10 KEY EVENT Nissan could make future models in the EU after Brexit, warns academic \nNissan and other UK car manufacturers could decide to make new models overseas because of Brexit uncertainty , a leading academic has warned the Government. \nProfessor David Bailey, an economics lecturer at Aston Business School, has warned that major car manufacturers may shift production of new models to factories in Continental Europe because of the uncertainty surrounding Brexit. \nProfessor Bailey argues that uncertainty could lead to new models being made in overseas plants where there is spare capacity on production lines. \nHis warning - which echoes comments made from senior Nissan executives - has come in evidence to the Commons Business, Energy and Industrial Committee, which is liaising with representatives from the UK automotive industry to discuss the implications of Brexit. \nIn his evidence to the committee, Professor Bailey said: \nIt should be noted that the UK auto industry’s success rests in large part on its productivity. The UK auto industry boasts plant utilisation running at over 70%, with several plants running 24/7 operations (KPMG, 2014). This compares favourably to European nations such as Italy, where utilisation runs at just over 50%. \nNissan’s Sunderland car plant was the UK’s most productive in 2015, building one-in-three of all new vehicles. \nThe risk is that some firms will try to take advantage of spare capacity on the continent, shifting production from the UK at the time of new model launches, especially if uncertainty can be used to justify it. \nNissan is to manufacture its Qashqai and XTrail models in Sunderland after entering into talks with the Government. \nBut in January, then RenaultNissan CEO Carlos Ghosn said he could not rule out moving future models to the company’s other plants, stating “important investment decisions will not be made in the dark”. \nRenaultNissan operates two factories in Spain and one in France. Staff working at Nissan's car plant in Sunderland. About 80% of the cars produced at Sunderland are exported, primarily to Europe, which has created thousands of jobs. (Image: Newcastle Chronicle) 9:05 Jonathon Manning Ladbrokes Coral secures rising revenues as digital business races ahead \nRevenues at Ladbrokes Coral have bounced back as strong growth from the digital business offset a drop in takings at the betting giant’s retail stores.The FTSE 250 firm said group net revenue had grown 3% for the four months to October 29, with the digital arm clocking a 12% rise thanks to an 18% jump from online gaming firm Sportsbook.It proved a brighter performance compared to the second quarter and the half year when revenues fell 2% and rose 1% respectively.While the digital business recorded a double-digit jump over the period, revenues at the retail stores fell by 1% as like-for-like revenue from betting machines came in flat.Shares were down more than 1% in morning trading, as the firm said its performance was in line with its annual targets.Chief executive Jim Mullen said: \nOur digital performance is strong and the Ladbrokes brand in Australia and the Eurobet brand in Italy continue to post very strong revenue growth. \nIn the UK, the Coral and Gala brands also posted very pleasing growth, and we continue to transition our approach to customer acquisition and retention in Ladbrokes.com to focus on improved profit conversion. \nIn UK Retail, performance improved in line with our expectations primarily driven by the return of all horse-racing content to our shops. Ladbrokes on Clayton Street, Newcastle 9:00 Jonathon Manning Taylor Wimpey upbeat on high demand for new housing \nHousebuilder Taylor Wimpey has cheered a high demand for new housing and said it was on track to hit annual targets as it shrugged off industry concerns over a market slowdown.The FTSE 100 firm said the UK housing market was “positive” in the second half of 2017 and Central London was “stable”, but flagged that it was aware of potential political and economic risks.The sales rate for the financial year to date was “strong” at 0.81, with net cash expected to reach £500m for the end of the 2017 financial year.However, order books dipped slightly at 8,751 homes and £2.2bn, down from 8,981 and £2.3bn over the same period last year.It comes after shares in UK housebuilders came under pressure last week following recent gloomy reports from rivals and industry data pointing to slowing sales and prices.Pete Redfern, chief executive of Taylor Wimpey, said the firm had “performed strongly” in the second half of 2017.He said: \nWhile we are alert to potential political and economic risks, demand for new housing remains high across the UK and market conditions are favourable. \nThe Government’s Help to Buy Scheme and a robust market competition had underpinned demand, the firm said, with annual results expected to meet expectations.Despite industry fears that this month’s interest rate rise from 0.25% to 0.5% - the first for a decade - could add to Brexit uncertainty to put off buyers, Mr Redfern said the group had continued to see “stability in trading patterns”. \nHe added: \nLooking ahead, we are on track to meet our full year expectations and deliver further growth and performance improvement in 2018. Taylor Wimpey signs at a housing development 8:55", "external_links": [], "published": "2017-11-13T10:30:00.000+02:00", "crawled": "2017-11-13T11:06:11.002+02:00", "highlightTitle": ""}