{"organizations": [], "uuid": "caa5448eb8f399686a42fbcde4f634883880d75b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.liverpoolecho.co.uk/incoming/article13853113.ece/ALTERNATES/s1200/JS132053179.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/after-grenfell-disaster-newcastle-council-13966334", "country": "GB", "domain_rank": 21960, "title": "After Grenfell disaster, Newcastle council boss warns it's hard to find out whether housing is safe", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-28T20:00:00.000+02:00", "replies_count": 0, "uuid": "caa5448eb8f399686a42fbcde4f634883880d75b"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/after-grenfell-disaster-newcastle-council-13966334", "ord_in_thread": 0, "title": "After Grenfell disaster, Newcastle council boss warns it's hard to find out whether housing is safe", "locations": [], "entities": {"persons": [{"name": "grenfell", "sentiment": "negative"}, {"name": "nick forbes  grenfell", "sentiment": "none"}, {"name": "phillip hammond", "sentiment": "none"}, {"name": "coun forbes", "sentiment": "none"}, {"name": "hammond", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "rick", "sentiment": "none"}, {"name": "nick forbes", "sentiment": "none"}], "locations": [{"name": "grenfell tower", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}], "organizations": [{"name": "grenfell", "sentiment": "negative"}, {"name": "newcastle", "sentiment": "negative"}, {"name": "commons treasury committee", "sentiment": "none"}, {"name": "local government association", "sentiment": "none"}, {"name": "newcastle city council", "sentiment": "none"}, {"name": "department for communities and local government", "sentiment": "none"}, {"name": "grenfell tower", "sentiment": "none"}, {"name": "cabinet", "sentiment": "none"}, {"name": "grenfell towers", "sentiment": "none"}, {"name": "office of budget responsibility", "sentiment": "none"}, {"name": "daily mirror", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "After Grenfell disaster, Newcastle council boss warns it's hard to find out whether housing is safe Newcastle City Council leader Nick Forbes reveals the challenges of confirming whether city housing is safe Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nNewcastle City Council leader Nick Forbes says the period after the Grenfell Tower disaster was the worst four weeks of his time in local Government. \nCity residents wanted to know whether their own homes were safe, but the council didn’t have records of safety checks carried out on privately-owned blocks of flats. \nAnd, in many cases, it didn’t even know for sure who owned the properties - because they belonged to overseas investors who were hard to track down. \n“I was unable as a council leader to give guarantees about safety, and that really worried me,” said Coun Forbes. \nBut this was just one example of the way that local councils struggle to cope with the demands being placed on them, according to evidence given by Coun Forbes to a House of Commons inquiry. \nHe was in London to talk to the Commons Treasury Committee about the impact of last week’s Budget on housing. \nHe was there in his role as senior vice-chair of the Local Government Association, the national body that represents councils from across the country. \nBut he also spoke about his own experiences in Newcastle . Newcastle City Council leader Nick Forbes \nGrenfell highlighted the gap between what people expect from their local council and what authorities are actually able to do. \nBecause while residents turned to the local authority for assurances that their homes are safe, the council had little information about homes owned by housing associations and next to nothing about the ones rented from private landlords. \n“What it did was flush out some huge and systemic failures in our system,” Coun Forbes said. \n“One of the things that really horrified me was we knew the situation in the tower blocks the council owns but we didn’t know the situation in other tower blocks in the city.” \nHe added: “A number of local authorities had difficulties dealing with housing association providers.” \nBut the real problem was privately-owned properties. \n“It’s quite difficult to track down who actually owns the building,” said Coun Forbes. \nCouncils should have oversight for all residences in their area, including a record of who owns each building and the power, alongside the fire services, to conduct inspections without notice, he said. Search and rescue teams work inside the gutted Grenfell Towers (Image: Daily Mirror) \nNewcastle City Council is committed to ensuring beyond doubt that its buildings are 100% safe. \nBut the Government has failed to follow through on promises to provide funding for upgrades. \nAnd as a result, Newcastle is being forced to borrow money. \nCoun Forbes told the inquiry: “There were a number of public statements made ... which implied Government would fund any fire safety measures needed.” \nThe Department for Communities and Local Government has now told councils that local funding will be “the first call”, which means cash will only come from central Government if there is no other option. \n“That presents a challenge. In my authority i know that in three years time we will breach our internal borrowing cap in order to ensure we are putting those fire safety measures in place.” \nThis also means that there is less scope for borrowing to build new homes, Coun Forbes said. Grenfell Tower in west London (Image: Rick Findler/PA Wire) \nChancellor Phillip Hammond announced plans in last week’s Budget to increase the number of homes built each year across the country by 300,000. \nCoun Forbes said this could only be achieved if local authorities were allowed to raise money to build. \nThe Government has said that authorities will be invited to bid for the right to increase their ‘Housing Revenue Account’ borrowing cap, allowing them to borrow more money for building, in areas where “affordability” is an issue - in other words, where prices are high. \nHowever, Coun Forbes pointed out that some areas, including parts of the North East, required new homes even though house prices were relatively low. \n“It’s possible to have high demand in areas of high affordability,” he said. \n“Rather than having a competitive process its better to just lift the borrowing cap for all local authorities so that we can all get on with it.” Read More What's in the Government's Industrial Strategy and what does it mean for the North East? \nMr Hammond is reported to believe that the key to increasing the nation’s housing supply is relaxing planning restrictions, so that it becomes easier to build on green belt land. \nHe was apparently prevented from announcing changes to planning rules by Cabinet colleagues including Prime Minister Theresa May. \nBut Coun Forbes said councils were already allowing building on the green belt. \n“We’ve already had local authorities make difficult and often controversial decisions”, he said. \nA more pressing problem was that developers were receiving planning permission and then sitting on the land instead of building, he said. \nAnd a solution could be to allow councils to collect council tax on land after a set period of time, even if the houses weren’t there - forcing developers to get building or to pay the tax themselves. Read More North urged to walk tall and end talk of decline as region unites to fight for billions in funding \nCoun Forbes also criticised Mr Hammond’s plan to reduce stamp duty, which independent watchdog the Office of Budget Responsibility has said will push up prices. \n“Putting money into schemes that simply drive up house prices and help people that would have bought anyway doesn’t help.” \nInstead he said the Chancellor should focus on “the supply side” by making money available to build homes in the first place. \nThere’s a problem with this, however, and that’s Brexit - and the prospect of a labour shortage immigrants currently working in the building trade move to other parts of Europe. \n“That would decimate the housebuilding industry in parts of the country where the sector isn’t quite so strong,” said Coun Forbes. Like us on Facebook", "external_links": [], "published": "2017-11-28T20:00:00.000+02:00", "crawled": "2017-11-28T20:30:53.006+02:00", "highlightTitle": ""}