{"organizations": [], "uuid": "2db9c13f5052cf4fdb6bb08ca9c2bd072f809438", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article12336450.ece/ALTERNATES/s1200/TMP_NEC_171216PaulWatson04JPG.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/cancer-brexit-austerity-leader-sunderland-12336434", "country": "GB", "domain_rank": 21960, "title": "Paul Watson's candid words about cancer, Brexit and austerity before his death", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-08T12:32:00.000+02:00", "replies_count": 0, "uuid": "2db9c13f5052cf4fdb6bb08ca9c2bd072f809438"}, "author": "Sean Seddon", "url": "http://www.chroniclelive.co.uk/news/north-east-news/cancer-brexit-austerity-leader-sunderland-12336434", "ord_in_thread": 0, "title": "Paul Watson's candid words about cancer, Brexit and austerity before his death", "locations": [], "entities": {"persons": [{"name": "paul watson", "sentiment": "negative"}, {"name": "brexit", "sentiment": "negative"}, {"name": "coun watson", "sentiment": "none"}, {"name": "remainer", "sentiment": "none"}, {"name": "watson", "sentiment": "none"}, {"name": "paul", "sentiment": "none"}, {"name": "pennywell", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "seychelles", "sentiment": "none"}, {"name": "silksworth", "sentiment": "none"}], "organizations": [{"name": "sunderland council", "sentiment": "none"}, {"name": "sunderland city council", "sentiment": "none"}, {"name": "rvi", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "chronicle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Paul Watson's candid words about cancer, Brexit and austerity before his death The Sunderland City Council has died at the age of 63 after a year-and-a-half battle with cancer Share Sunderland Council leader Paul Watson at home (Image: newcastle chronicle) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nBack in December 2016, Paul Watson gave a candid interview to ChronicleLive about battling cancer while leading Sunderland City Council through turbulent times. \nToday after the sad news the 63-year-old has passed away , we’re republishing those words in full. \nEarly in the morning of June 24, 2016, the Brexit result threw Sunderland into the international spotlight like never before. \nAround the same time, the leader of the city council, Paul Watson, was diagnosed with cancer. \nIn July of this year it was established that the disease which had started in his bowel had spread to his liver and lungs. \nAs economists and politicians lined up to consider what the vote meant for Sunderland , the 62-year-old from Pennywell was mulling over his own bleak prognosis. \nHe said: “The doctor told me ‘Paul, look, it’s not good news - you’re going to die’. \n“I said ‘how long?’ - it was me and wife sitting there - and he told me that without any further treatment I would have three months to live. \n“He offered to refer me to an oncologist and said they may or may not decide to give me chemotherapy or radiotherapy and that I’ll have to convince them. \n“With that, he said I could live an extra year but that he wasn’t going to see me anymore and that he would put me on palliative care to see me out to the end of my life. Sunderland Council leader Paul Watson at home \nThankfully, Councillor Watson sought a second opinion: “I went to an oncologist at the RVI who said ‘It’s up to you how long you can live’ - it just gave you so much faith in yourself.” \nSince then the spread of the cancer has been halted and the outlook is better but the odds of a full recovery are low. \nHe said: “You’ve got to be pragmatic about life - I’m 62, I will die sometime. \n“I could have died 10 years ago when I had a kidney transplant. \n“If it happens, it happens, there’s not much you can do about it.” \nWork and routine, he says, have become a big part of his recovery by providing the structure he needs to avoid despair. \nHe said: “I know the tablets I have to take, I know the hospitals I have to go to, I know the adjustments to my life I have to make. \n“If I dwelt on it and just took to my bed I think I would pass away in a matter of a few months. \n“I have something which is testing and troubling and pushing me all the time. \n“It’s part of what is keeping me alive.” \nThat quality of rugged persistence and pragmatism is a recurring theme when speaking to Coun Watson - and as the leader of Sunderland City Council, it’s a quality he has need in spades. \nThe former shipyard worker entered politics after completing a degree in law in his early forties. Sunderland Council leader Paul Watson at home \nFirst elected in 1997 as part of a wave of centre-left optimism against the backdrop of a booming economy, the timing of his rise to become leader could hardly have been less fortuitous. \nHe said: “I became leader of the council in 2008 which coincided quite nicely with the world economic crash and the subsequent austerity so I’ve led this city council through probably the darkest economic times we’ve had since the war. \n“There isn’t great pleasure in having to reduce budgets but, as a socialist, I feel there is an element of satisfaction in being able to manoeuvre the situation to ensure we still look after the least well off as best we can.” \nRunning a council suffering fresh budget cuts every year requires, he says, a “pragmatic socialism”: “You come with a direction of travel and I think in terms of empowering people. \n“You just look at each issue and problem as it comes to you and look for solutions. \n“By and large, when you’ve got a choice between the devil and the deep blue sea, you have to eschew the devil and learn to swim.” \nAnd through this adapt or die mentality, Coun Watson says, he and his colleagues have managed to avoid drowning: “We’ve got a lot of experience at this now - we can shimmy and shake and twist and turn to make the best out of what we’ve got. \n“We’ve learned to do that - we have had to manoeuvre and manipulate otherwise we would have been dead.” \nSunderland provided the country’s first decisive Leave result on referendum night, an event which saw the city become international news. \nVia a sports hall in Silksworth, Sunderland’s voters caused the value of the currency to plummet, sent the world media into meltdown and perhaps prompted a Prime Minister to start considering his resignation speech. \nSince then, the staunch Remainer has tried to understand why his constituents shunned the status quo so vigorously. Paul Watson (Image: The Chronicle) \nSunderland born and bred, he knows that people he grew up with probably didn’t vote the same way as him. \nHe said: “It’s something that I try and rationalise and grasp: how do people whose livelihoods depend on being in that economic area say they don’t want to be in it? \n“But it’s a city of 280,000 people or so and the people who are employed around Nissan are not a majority. \n“Nissan take the best people we have - they’re fit and intelligent and they don’t feel like they should kowtow to an inward investor like Nissan. \n“People like us, strategically, look at it and think ‘Thank the Lord for Nissan’ but the people down there at the site see it as a place to work and get a wage from - they don’t see it as their whole world.” \nAnd when it comes to the lower end of the socio-economic spectrum, Coun Watson saw the vote as a cry of anguish. \nHe said: “The vast majority, who are not engaged in these places and not making a great living, think to themselves ‘What are you talking about? I don’t work at Nissan’. \n“The success of that economy wasn’t reaching them.” \nOnce again, it boils down to finding practical solutions, regardless of the circumstances: “Absolutely above socialism or anything is that we’re democrats and the people have voted. \n“I believe we will come out of Europe, although that’s not my decision, and we will cope with that and make the best of that.” Read More Paul Watson, the leader of Sunderland City Council, dies following cancer battle aged 63 \nThrough it all, Coun Watson will be engaged in another battle with the malignancy in his own body, a battle he intends to win. \nHe said: “You look at the facts and listen to the doctors but that’s not my point of view. \n“I’m determined not to die and to try and beat this illness and every fibre of my being is concentrated on doing that. \n“And I believe I’ll win. \n“Against the odds? I’ll still win. \n“Until I breath my last breath I’ll still believe it. \n“You have to be positive - if I was negative I would go and spend the last six months in the Seychelles and live it up. \n“I come to work instead.” Like us on Facebook", "external_links": [], "published": "2017-11-08T12:32:00.000+02:00", "crawled": "2017-11-08T13:01:57.004+02:00", "highlightTitle": ""}