{"organizations": [], "uuid": "bf83b225111f6c3af24e389f9f31e67bb58f7999", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13848214.ece/ALTERNATES/s1200/Bank-of-England-diversity.jpg", "site_section": "", "section_title": "", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13958076", "country": "IE", "domain_rank": 21960, "title": "Business Breakfast LIVE: UK banks pass financial stress tests for the first time - Chronicle Live", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.047, "site_type": "news", "published": "2017-11-28T11:31:00.000+02:00", "replies_count": 0, "uuid": "bf83b225111f6c3af24e389f9f31e67bb58f7999"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13958076", "ord_in_thread": 0, "title": "Business Breakfast LIVE: UK banks pass financial stress tests for the first time - Chronicle Live", "locations": [], "entities": {"persons": [{"name": "jonathon manning ocado", "sentiment": "none"}, {"name": "jaap stuut", "sentiment": "none"}, {"name": "steve turner", "sentiment": "none"}, {"name": "robbie", "sentiment": "none"}, {"name": "peter pritchard", "sentiment": "none"}, {"name": "katie", "sentiment": "none"}, {"name": "gavin sewell", "sentiment": "none"}, {"name": "steve mayes", "sentiment": "none"}, {"name": "naouri", "sentiment": "none"}, {"name": "regis duval", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "monro", "sentiment": "none"}, {"name": "adam fenwick", "sentiment": "none"}, {"name": "mayes", "sentiment": "none"}, {"name": "feather", "sentiment": "none"}, {"name": "kellett", "sentiment": "none"}, {"name": "robbie feather", "sentiment": "none"}, {"name": "jonathon manning lego", "sentiment": "none"}, {"name": "steve turner jonathon manning fenwick", "sentiment": "none"}, {"name": "tim steiner", "sentiment": "none"}, {"name": "jonathon manning", "sentiment": "none"}, {"name": "boldon", "sentiment": "none"}, {"name": "richard pennycook", "sentiment": "none"}, {"name": "j sainsbury", "sentiment": "none"}, {"name": "jonathon manning pets", "sentiment": "none"}, {"name": "mr feather", "sentiment": "none"}, {"name": "fenwick", "sentiment": "none"}, {"name": "stuut", "sentiment": "none"}, {"name": "john lewis", "sentiment": "none"}, {"name": "ocado", "sentiment": "none"}, {"name": "pennycook", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "west sussex airport.blair nimmo", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "gatwick", "sentiment": "none"}, {"name": "erith", "sentiment": "none"}, {"name": "adzuna", "sentiment": "none"}, {"name": "andover", "sentiment": "none"}, {"name": "greater paris", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "luxembourg", "sentiment": "none"}, {"name": "north shields", "sentiment": "none"}, {"name": "gatwick airport", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "south tyneside", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "dartford", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "immunodiagnostic systems", "sentiment": "none"}, {"name": "company", "sentiment": "none"}, {"name": "leven estates", "sentiment": "none"}, {"name": "united", "sentiment": "none"}, {"name": "feather & black", "sentiment": "none"}, {"name": "boldon business park", "sentiment": "none"}, {"name": "boldon's immunodiagnostic systems", "sentiment": "none"}, {"name": "morrisons", "sentiment": "none"}, {"name": "team valley trading estate", "sentiment": "none"}, {"name": "hta real estate", "sentiment": "none"}, {"name": "asda", "sentiment": "none"}, {"name": "monarch airline", "sentiment": "none"}, {"name": "department", "sentiment": "none"}, {"name": "groupe casino", "sentiment": "none"}, {"name": "argos", "sentiment": "none"}, {"name": "metro", "sentiment": "none"}, {"name": "hauts de france regions.groupe casino", "sentiment": "none"}, {"name": "kpmg", "sentiment": "none"}, {"name": "unite", "sentiment": "none"}, {"name": "groupe casino.ocado", "sentiment": "none"}, {"name": "iag  british airways", "sentiment": "none"}, {"name": "european investment bank", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}, {"name": "iag", "sentiment": "none"}, {"name": "luton", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "home jonathon manning job", "sentiment": "none"}, {"name": "st james", "sentiment": "none"}, {"name": "mal", "sentiment": "none"}, {"name": "pets at home", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}, {"name": "ba", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KEY EVENT App aimed to revolutionise car insurance in £650,000 crowdfunding appeal \nA Newcastle tech business is turning to crowdfunding to raise £650,000 after EU funds allocated to support the launch of its new app were put on indefinite hold. \nThe honcho app aims to create the UK’s first ‘reverse auction’ market-place for car insurance in a bid to reduce costs for motorists and decrease the dependence on price comparison websites. \nThe app enables insurers to bid for consumers’ business, competing with each other to offer the best value package in real time. Insurers pay honcho £1 for the right to bid, enabling them to reduce premiums for consumers. \nhoncho turned to crowdfunding platform CrowdCube when it became apparent that funds from the European Investment Bank, contributed to by all members of the EU, would not be released for the foreseeable future. \nRather than delay the launch of its app, the team at honcho approached CrowdCube to help them realise their ambitions and objectives, and to offer UK investors the chance to take a stake in the company. \nThe campaign aims to raise £650,000 to help bring the app to market and, with 27 days until it closes, it has so far raised £266,360 from 115 investors. \nGavin Sewell, CEO of honcho, believes that crowdfunding will be a vital source of capital for many new and expanding businesses after Brexit. \nHe said: \nBusinesses cannot afford to wait for political negotiations to decide if funds allocated to UK regions will be released. \nCrowdfunding is the logical and immediate solution for innovative tech start-ups such as honcho looking for alternative funds, and also gives UK investors the chance to support enterprises and get in on the ground floor of exciting new ventures. The honcho app aims to revolutionise the car insurance market (Image: honcho) 9:29 Jonathon Manning Pets at Home top dog to depart \nThe chief executive of Pets at Home is to leave the company as he steps away from corporate life, with the firm’s retail head to replace him as top dog.Ian Kellett informed the group’s board of his intention to pursue his own personal business interests, Pets said in a stock market statement.Retail boss Peter Pritchard will succeed Mr Kellett, who will remain as chief executive until the end of May 2018 to ensure a smooth transition.Mr Kellett joined Pets at Home in 2011 as commercial director and moved to the role of chief executive in 2015.He oversaw the establishment of the firm’s sourcing office in China, the launch of the so-called “VIP club” for pets and the development of the group’s digital strategy. \nHe said: \nThe actions we have taken this year to reposition retail pricing have landed well, and we have a clearly defined plan that will deliver further results. It is with this in mind that I feel able to move on and pursue my own personal business interests, which will provide me with a different type of challenge at this point in my career. Pets at Home Jonathon Manning Job vacancies fall to nine-month low of 1.1 million in October \nJob vacancies have hit a nine-month low, although they remain over one million, a new study shows.There were 1.1 million vacancies last month, down by 10,000 on September, said jobs site Adzuna.Despite the fall, there were still more jobseekers than advertised vacancies, while salaries on offer averaged £32,174, an increase of 0.8% from September, but 1.7% lower than a year ago.Average salaries for retail jobs increased by 7.3% over the past year to £25,661, the research found.Doug Monro, co-founder of Adzuna, said: \nWe’ve seen plenty of false starts in terms of salary improvements as incremental increases have been undone in following months. \nNevertheless, those on the hunt for a new job will be hoping this improvement is for good and not just for Christmas. \nDespite a record-low unemployment rate, advertised vacancies have hit a nine-month low, showing we can’t be complacent about the jobs market and we still need a steady supply of new roles to supplement its strength. \nWe’ve heard plenty in Budget week about the millions of jobs created by the current Government, but this is no time to be resting on our laurels. Two business Colleagues conducting a job interview (Image: Getty Images) 9:23 Jonathon Manning Lego architect's dream studio comes closer to being built \nAn artist who builds replicas of North East landmarks out of Lego has nearly received enough investment to open his own studio. \nLego Architect Steve Mayes is best known for creating models of a Metro train, St James’ Park and the Team Valley Trading Estate but is planning to open the Let’s Brick This Studio in North Shields. \nMr Mayes is aiming to raise £3,000 to fund the studio through crowdfunding website crowdfunder.co.uk. \nWith 18 days still to go until the campaign ends Mr Mayes has raised £1,895 from 19 supporters, with many people investing hundreds in the business. \nThose who invest £300 are able to get a custom made 5x5 inch model of a landmark of their choice. \nThose wishing to invest can do so here . Lego architect Steve Mayes at his home in North Shields (Image: Newcastle Chronicle) 9:14 Jonathon Manning Ocado jumps on international deal in France \nShares in online grocer Ocado rocketed after it announced a long-awaited international partnership, signing a deal with French supermarket giant Groupe Casino.Ocado said the deal will see it construct an automated warehouse, or customer fulfilment centre, that will serve the Greater Paris area, as well as the Normandie and Hauts de France regions.Groupe Casino will pay Ocado upfront and ongoing fees as part of the deal.Investors warmed to the news, with shares advancing 24% in morning trading to 318p.FTSE 250-listed Ocado announced the deal in early June, although at the time it said the customer wanted to remain anonymous.The online firm has been under pressure over its delay in striking a deal after missing a self-imposed deadline of the end of 2015 to expand overseas.Ocado said it expects the Groupe Casino tie-up, which will see it develop what it calls “Ocado Smart Platform”, to be earnings neutral in 2018 and profitable by 2019.Groupe Casino sub-brand Monoprix.fr will be the first to benefit from the deal, and Ocado also expects to sign similar deals with other retailers.Jean-Charles Naouri, chief executive of Groupe Casino, said: \nThis agreement is a major leap in terms of quality: 50,000 food items will be offered in the first stage to customers in the Greater Paris area with precise and speedy delivery at home and through a platform which makes it achievable to do this profitably. \nOcado started out life delivering food from upmarket grocer Waitrose but has since struck a deal with Morrisons.In its most recent trading update, the group posted a 13.1% rise in retail revenues to £312.7m for its third quarter to August 27.Including earnings from its tie-up with Morrisons, group revenues lifted by 14.3% to £344.5m.It is also increasing the capacity at its new centre in Andover, while also working on its fourth and biggest centre in Erith, Dartford, which is set to open next year.Ocado boss Tim Steiner said of the French deal: \nWe believe that the scalable, modular end-to-end solutions provided by the Ocado Smart Platform will allow retailers such as Groupe Casino to build their online grocery offer in a way that is profitable and sustainable, creating value for customers, suppliers and shareholders. \nWe continue to make investments to commercialise our proprietary platform and expect this deal to be one of many successful collaborations with leading retailers to use it the world over. An Ocado home delivery van (Image: Katie Collins/PA Wire) 9:12 Jonathon Manning New CEO at Boldon's Immunodiagnostic Systems ready to drive growth \nThe new chief executive at South Tyneside medical firm Immunodiagnostic Systems has said he is looking forward to driving growth at the business , after the loss of a major customer affected half year sales. \nImmunodiagnostic Systems (IDS) has seen its financials for the six months ended September 30 2017 suffer with half year like-for-like sales falling by 11%. \nOverall the Boldon medical technology company, which develops testing kits for the healthcare sector, saw its turnover fall by 4.1%, dropping from £19.5m to £18.7m. \nAdjusted EBITDA was £3.4m, a reduction of £0.8m compared to last year. \nThe main reason for the fall was the loss of the major antibody customer which was announced by the company in October, leading to revenue falling in IDS’s licensing and technology division. \nNew chief executive Jaap Stuut said he is confident that the business will see improvement. \nMr Stuut, who previously headed up the firm’s global marketing and corporate development team, was appointed last month following the announcement that \nRegis Duval was stepping down from his role to spend more time with his family in Luxembourg. \nMr Stuut said: \nHaving worked at IDS for four years, I was pleased to be asked by the board to take over as group CEO. \nMy focus in the coming months will be on the sales organisation in both our automated and manual businesses. I will strive to improve the quality and training of the sales team, as well as the tools available to enable them to successfully engage with both existing and new customers. \nThe first half results show that underlying revenues in the IDS business, excluding the licensing and technology segment, remain stable. However I am confident that we can improve on this performance moving forward, and I look forward to returning the business to growth. The Immunodiagnostic Systems (IDS) unit at Boldon Business Park which has been sold to Leven Estates in a double investment deal (Image: HTA Real Estate) 9:03 KEY EVENT Unions call on more defence spending to go to British factories \nThe Government’s defence procurement strategy will come under attack on today when union leaders will question why so much spending on defence equipment goes to factories in the United States.Officials from the Unite union will tell a committee of MPs that by 2020, almost a quarter of all defence spending will support jobs in the US.The UK’s ability to independently design and manufacture defence equipment could be lost unless the Government steps in and backs programmes such as the advanced Hawk jet aircraft, Unite officials will tell the Defence Select Committee.Commenting ahead of the session, Unite assistant general secretary Steve Turner said: \nThe Government appears to be actively undermining the UK’s ability to independently manufacture defence equipment. \nBy 2020, nearly 25p in every pound of defence spending will go to supporting jobs in US factories rather than here in the UK. \nNot only does it undermine the UK’s sovereign defence capability, it also undermines the Government’s desire to have a joined up industrial strategy. \nThe crossover between defence and civilian manufacturing is well known and the economic benefits of defence manufacturing to communities across the UK significant. \nFor every pound of defence spend spent here in the UK, 36p flows back to Treasury, even before your consider the multiplier effect of such investment. \nThe UK Government should be backing Britain’s world class defence workers by spending the defence budget here in the UK and investing in world beating projects such as the advanced Hawk programme. \nA failure to do so will result in the defence of the realm being outsourced to overseas nations and our defence being subject to the whim of foreign powers and corporations. Steve Turner Jonathon Manning Fenwick appoints new chief executive Robbie Feather amid plan to modernise \nDepartment store chain Fenwick has appointed retail veteran Robbie Feather to lead the firm as its new chief executive. \nMr Feather starts his new role at the Newcastle headquartered firm next year, fresh from his role commercial director of Argos, where he has helped to grow the brand under its owners J Sainsbury. \nHe becomes the second non-Fenwick family member to take up a position on the 134-year-old firm’s board, joining former Co-op chief Richard Pennycook who became non-executive chairman last year. \nHis appointment comes after the departure of managing director Adam Fenwick who left the board last month, the last remaining member of the Fenwick family who was on the company’s statutory board as it bids to modernise and compete in what it has described as “some of the most volatile and challenging market conditions” experienced in its history. Mr Fenwick remains with the company as director of corporate affairs. \nMr Feather will work alongside the board from January 1 2018 to develop further Fenwick’s strategy for growth, bringing together a new senior executive team combining internal management and new hires, and he will lead the execution of the strategy. \nIn a career spanning 25 years, Mr Feather has worked at Asda, John Lewis and J Sainsbury and in 1999, he co-founded the lifestyle multichannel bedroom furniture retailer, Feather & Black. \nHe said: \nIt’s a real privilege to be joining the Fenwick team. This is a rare opportunity to work with an iconic British retail brand, underpinned by strong family and social values. There is huge potential to build on the company’s heritage and I very much look forward to getting on board. \nMr Pennycook said: \nI’m delighted that Robbie has decided to join Fenwick. He brings with him an intuitive understanding of retail, the drive and creativity of an entrepreneur and a proven track record in leadership. He arrives at a key point in the development of the Company and I wish him every success. Robbie Feather, chief executive at Fenwick (left) 8:52 Jonathon Manning Failed carrier Monarch's Gatwick runway slots bought by BA owner IAG \nBritish Airways owner IAG is buying the prized take-off and landing slots at Gatwick Airport put up for sale by the administrator of collapsed airline Monarch.The multi-million-pound swoop will see IAG secure the ill-fated carrier’s winter and summer slots at Britain’s second-busiest airport.It is understood IAG had tabled a significant bid, trumping a host of rival airlines eyeing a potential deal for Monarch’s most coveted assets.Monarch’s slots at Gatwick and Luton are reportedly worth in the region of £60m, with the most valuable at the West Sussex airport.Blair Nimmo, partner at KPMG and joint administrator, said: \nAs well as representing an excellent recovery for creditors from one of Monarch Airline’s significant assets, the clarity that this sale will bring is very positive for other stakeholders such as Gatwick Airport and its customers. \nOur continuing focus is now on MAL’s Luton slots, as well as exploring potential rescue opportunities for MAL and its residual assets including its brand and associated licenses. A Monarch plane landing", "external_links": [], "published": "2017-11-28T11:31:00.000+02:00", "crawled": "2017-11-28T11:34:36.001+02:00", "highlightTitle": ""}