{"organizations": [], "uuid": "638ee863b0f317a6f113efff846eef59c8e36642", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.bristolpost.co.uk/incoming/article241683.ece/ALTERNATES/s1200/Christmas-dinner.png", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/whats-on/food-drink/fifteen-ways-save-money-time-852302", "country": "US", "domain_rank": 48128, "title": "Fifteen ways to save money and time when preparing Christmas dinner - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.539, "site_type": "news", "published": "2017-11-29T18:26:00.000+02:00", "replies_count": 0, "uuid": "638ee863b0f317a6f113efff846eef59c8e36642"}, "author": "Kate Lally", "url": "http://www.leicestermercury.co.uk/whats-on/food-drink/fifteen-ways-save-money-time-852302", "ord_in_thread": 0, "title": "Fifteen ways to save money and time when preparing Christmas dinner - Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "caroline bloor", "sentiment": "none"}], "locations": [{"name": "leicester mercury fifteen", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "turkey", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "iceland", "sentiment": "none"}], "organizations": [{"name": "lidl", "sentiment": "none"}, {"name": "money advice trust", "sentiment": "none"}, {"name": "wales online", "sentiment": "none"}, {"name": "marks & spencer", "sentiment": "none"}, {"name": "morrisons", "sentiment": "none"}, {"name": "aldi", "sentiment": "none"}, {"name": "liverpool echo", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Fifteen ways to save money and time when preparing Christmas dinner One in five Brits will be putting their festive food on credit this year Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nEveryone loves Christmas dinner - but we all also know it doesn't come cheap. \nAnd it's only getting more expensive with a recent survey of supermarkets finding the cheapest one will cost 18% more than it did last year. \nThe spiralling cost is being blamed on inflation and Brexit, Wales Online reports. \nAccording to the Money Advice Trust, one in three Britons will be putting their Christmas on credit this year. \nOne in five of the 2,000 people surveyed will be putting their Christmas food on credit. \nGood Housekeeping tracked the price of 11 Christmas dinner essentials, including a turkey, mince pies and cranberry sauce, across 10 supermarkets. \nThe budget basket from Lidl cost per head is £2.94 which is an increase of more than 18% since last year. \nThe supermarket is still the cheapest with dinner for eight costing on average £25.53 and £25.68 at rival supermarket Aldi. \nBaskets from nine of the 10 supermarkets are more expensive than last year, with Aldi, Morrisons and Iceland all increasing their prices by more than 13%. \nMarks & Spencer is the only supermarket whose basket is cheaper than last year - decreasing by 20% to cost £38.43 but is still the second priciest. \nThe most expensive overall was Waitrose at £41.47. \nThe annual yuletide food survey by Good Housekeeping magazine found that the cost of the cheapest set-piece meal on Christmas Day – for eight people and including 11 ingredients from turkey to fresh vegetables and cranberry sauce – had risen from £19.82 to £23.53, or from £2.48 a head to £2.94. \nNine of the 11 cheapest items cost more than last year, including turkey, which is now £8.99 from last year’s £8, and sage and onion stuffing mix, which has increased from 30p to 34p. \nGood Housekeeping said the increased cost was due to the pound’s fall since last year’s referendum, which it said has pushed up the cost of food imports, and an inflation rate that has hit 3%. Christmas Dinner \nCaroline Bloor, Good Housekeeping’s consumer director, said: \"There’s been a significant rise in food prices across the board over the last year as a result of the weakening of the pound following the Brexit vote. \n\"Add to this inflation being stuck at a five-year high, and it’s no surprise to see the Christmas grocery bill has increased too.\" \nThankfully, the Liverpool Echo have put together a list of 15 ways you can save not just time but also money when cooking this year's festive fayre. Make a list - and check it twice \nIt's all too easy to come out of the supermarket with an aisle's worth of food if you go in blindly. \nA list of all the items you really need is your friend here. Do NOT buy anything that isn't on the list. Read More Budget \nAs above, forearmed is forewarned. \nDecide in advance how much you're willing to spend and pay cash not credit in order to stick to it. Turkey \nFor a delicious turkey, cook the legs separately from the crown. Not only will this cut down on your cooking time, it'll also make sure the meat is cooked to perfection. \nIn fact, if you want to be super-efficient, you can cook the legs the day before as they won't dry out if reheated. Read More Vegetables \nMost veg can be prepared in advance, to save you stress on the day. \nRoast potatoes can be cooked before, while any vegetables that are steamed or boiled can also be par-cooked in advance. \nJust remove them from the heat when they’re still a bit crunchy and rinse with some cold water so they don’t carry on cooking. You can even cook them all in the one pot to save on washing up. Christmas Eve jobs \nFail to prepare, prepare to fail. Doing the following tasks on Christmas Eve will take the pressure off Christmas Day: Set the table. A great way to make sure you have everything. Sort all the cooking and serving dishes, the glasses, silverware and napkins for the dinner. Put white wines and Champagne to chill. Remove all frozen foods from the freezer. Trim the Brussels Sprouts and refrigerate. Make the Dill Sauce for the salmon, if not already done. Stuff the turkey. Get to bed at a reasonable time, always helps to start Christmas Day refreshed and well rested. Swerve the starter \nThis might sound crazy, but it makes total sense. With all the Christmas gluttony, it's not like anyone's going to miss it. \nConcentrating on the main event will save you so much extra grief. And you can always bring out a cheese board later. Read More ", "external_links": [], "published": "2017-11-29T18:26:00.000+02:00", "crawled": "2017-11-29T19:53:18.018+02:00", "highlightTitle": ""}