{"organizations": [], "uuid": "9bac59f77db5034249a5537c2017b395fb38db71", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13944629.ece/ALTERNATES/s1200/Office-Building-2.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/commercial-property/commercial-property-sector-looking-very-13944406", "country": "GB", "domain_rank": 21960, "title": "Commercial property sector is looking very positive for 2018", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-23T19:21:00.000+02:00", "replies_count": 0, "uuid": "9bac59f77db5034249a5537c2017b395fb38db71"}, "author": "chroniclelive.co.uk", "url": "http://www.chroniclelive.co.uk/business/commercial-property/commercial-property-sector-looking-very-13944406", "ord_in_thread": 0, "title": "Commercial property sector is looking very positive for 2018", "locations": [], "entities": {"persons": [{"name": "ruskin", "sentiment": "none"}, {"name": "patrick matheson", "sentiment": "none"}, {"name": "gavin black", "sentiment": "none"}, {"name": "vaux", "sentiment": "none"}, {"name": "victoria", "sentiment": "none"}, {"name": "jane armitage", "sentiment": "none"}, {"name": "david allan photography", "sentiment": "none"}, {"name": "matheson", "sentiment": "none"}, {"name": "lambert smith hampton", "sentiment": "none"}, {"name": "david allan", "sentiment": "none"}, {"name": "michael downey", "sentiment": "none"}, {"name": "jessica simpson  jessica simpson", "sentiment": "none"}, {"name": "chris donabie", "sentiment": "none"}, {"name": "bradley hall", "sentiment": "none"}, {"name": "downey", "sentiment": "none"}, {"name": "bob fletcher", "sentiment": "none"}, {"name": "neil atkinson", "sentiment": "none"}, {"name": "jacksons law", "sentiment": "none"}, {"name": "bill lynn", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "tim aisbitt", "sentiment": "none"}, {"name": "simpson", "sentiment": "none"}], "locations": [{"name": "central square", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "follingsby park", "sentiment": "none"}, {"name": "middlehaven", "sentiment": "none"}, {"name": "bradley hall", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "inglot eldon square", "sentiment": "none"}, {"name": "trinity gardens", "sentiment": "none"}, {"name": "sunderland city centre", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "middlesbrough", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "tyneside", "sentiment": "none"}, {"name": "follingsby", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "stockbridge house", "sentiment": "none"}, {"name": "science central st james boulevard", "sentiment": "none"}, {"name": "team valley", "sentiment": "none"}, {"name": "south", "sentiment": "none"}, {"name": "redcar", "sentiment": "none"}, {"name": "brewin dolphin", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "durham tees valley airport", "sentiment": "none"}, {"name": "tees valley", "sentiment": "none"}], "organizations": [{"name": "marrico", "sentiment": "none"}, {"name": "newcastle city council", "sentiment": "none"}, {"name": "naylors", "sentiment": "none"}, {"name": "newcastle-based naylors", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "l&g", "sentiment": "none"}, {"name": "h&m", "sentiment": "none"}, {"name": "gavin black partners", "sentiment": "none"}, {"name": "hta real estate", "sentiment": "none"}, {"name": "standard life", "sentiment": "none"}, {"name": "taras properties", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "tees valley combined authority", "sentiment": "none"}, {"name": "newcastle brown ale brewery", "sentiment": "none"}, {"name": "middlesbrough", "sentiment": "none"}, {"name": "dalla house", "sentiment": "none"}, {"name": "northern powerhouse", "sentiment": "none"}, {"name": "newcastle university", "sentiment": "none"}, {"name": "toffee factory", "sentiment": "none"}, {"name": "standard life’s central square south", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}, {"name": "middlesbrough council planning committee", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Commercial property sector is looking very positive for 2018 MARK LANE looks at what prospects are in store for the North East commercial property sector in 2018, with the help of a stable of leading regional experts in the field Share Offices within the Collingwood Buildings, Newcastle are available to let through Bradley Hall (Image: RUSKIN PHOTOGRAPHY) Share Get business   Thank you for subscribing!   \nThese are tough times for the UK economy, and the watchword for the North East economy as we head into 2018 would appear to be caution – which, to be fair, has been the case for several years now. \nThe legacy of the financial crash, Brexit, uncertainty in the US due to the incumbent gung-ho, protectionist president and the onward march of the Chinese economic powerhouse are just a few of the reasons why the economy has been unable to gather any kind of sustained momentum for several years now. \nOn top of all these things, there is another factor we can throw into the mix as far as the commercial property sector, which of course is affected by all of these factors, is concerned: the internet. More and more retailers are cutting down on bricks and mortar and shifting business online; indeed, the likes of H&M have even been explicit in their public statements that online commerce will be the primary focus moving forwards. \nAll of which would suggest that those working in the commercial property sector could be forgiven for heading into the festive season with a pint glass half empty mindset for 2018. \nAs I found out when talking to some of the region’s key commercial property movers and shakers, however, the truth is somewhat different. \nTim Aisbitt, associate director at Bradley Hall, the chartered surveyors and estate agents with six offices in the region, is upbeat about office rentals for the coming year. \n“Office rents will steadily increase due to a lack of new stock, and I also predict retail rents will rise as the industry picks up again, but only in prime locations,” he says. “Sectors which I think are most likely to see high demand in commercial property include offices thanks to growth in the tech sector as well as professional and research services. In the industrial sector I predict that logistics companies may require larger warehousing thanks to industry growth. \n“The North East is currently particularly attractive to national and overseas investors thanks to good returns and a steadily rising market. The market peaks and troughs are more sustained in the region in comparison to other major cities and especially London.” \nGavin Black, of Jesmond-based Gavin Black Partners, also believes 2018 will see rent rises for good quality commercial property, again due mainly due to demand-supply issues. Indeed, the fact there are too few prime spots to go around is leading to some eye-catching rentals. \nBlack says: “The Central Square South development by Standard Life is to quote £25 psf and there are a number of deals in the pipeline both in the centre of Newcastle and on the Quayside that will set new rental levels. \nIf that rise is sufficient to justify new development coming on stream in 2019 that will further underline the improvement in rents.” \nAsked to pick out some landmark deals to look forwards to, Black points to several projects which illustrate that Newcastle’s commercial property sector is alive and kicking as we head into 2018. \nHe says: “Standard Life’s Central Square South as above, 40,000 sq ft on site ready by the end of the year. The first building at Science Central St James Boulevard where Legal and General are speculatively developing 120,000 sq ft on site ready later next year. \n“On a smaller scale we would highlight the two suites we are marketing in Trinity Gardens and over 28,000 sq ft in Stockbridge House. All top quality space, newly available. \n“We will also be marketing a modernised floor of over 14,000 sq ft at Time Central on behalf of Brewin Dolphin. With restricted supply we are confident over letting prospects.” \nOffering an equally bullish view of the next 12-18 months for Newcastle city centre is Michael Downey, surveyor, office agency with Lambert Smith Hampton in Newcastle. \nLike others, Downey predicts that a new office headline rental level will be set in Q4 2017. “I anticipate the headline rent will increase further in 2018 - £23.50 or £24.00 per sq ft due to a clear lack of Grade A stock (135,000 sq ft to be precise),” he says. “The supply will tighten to circa 50,000-75,000 sq ft by the end of 2018. Grade B, refurbished space, office rents are also set to rise further in 2018.” \nAnd what about particular development projects on the horizon? Despite these testing times for the economy, Downey’s colleague, Bill Lynn, director, capital markets, Lambert Smith Hampton believes there is plenty to whet the appetite. \nHe says: “While there are no developments currently underway there are a number of exciting schemes in the pipeline. \n“On the former Newcastle Brown Ale Brewery site a joint venture between L&G, Newcastle University and Newcastle City Council will deliver up to 500,000 sq ft of office and lab space within that development. The first of the two 100,000 sq ft Grade A buildings is due to commence in Q1 2018 and once this is 60 per cent let plans are in place to deliver a further 100,000 sq ft. Alongside this, Marrico’s Strawberry Place site is another proposed development in the offing with outline consent now in place to include 107,000 sq ft of Grade A Space. Elsewhere Taras Properties is to submit a planning application for 100,000 sq ft of offices on the site adjacent to Pilgrim Street albeit the scheme is 2-3 years away. \n“Two main factors are that with the change in the price of sterling it is now cheaper for an overseas investor to invest in the UK. You get a better yield for investing in the provinces and generally the North East is no different.” \nWhile prime spots in central Newcastle’s retail sector will always attract a premium price and significant demand, the industrial property landscape in the region is less hard to predict and, to an extent, more heavily influenced by the international economic landscape, given the export-heavy nature of many of the region’s manufacturers. \nNeil Atkinson is a director with Newcastle’s HTA Real Estate. Like anybody with an interest in industrial property in the region, he finds it hard to look past the burgeoning automotive sector when discussing prospects for 2018. \n“The Nissan supply chain will generate significant new requirements for Washington and the wider market, so IAMP will be particularly relevant,” he says. “We will be seeing major new development at Gateshead’s Follingsby Park, which has the land and infrastructure to satisfy large-scale requirements. \n“Automotive will definitely continue to generate high demand, as well as parcel delivery, particularly with an increasing percentage of retail sales moving from the High Street to e-commerce. \n“We have seen EU manufacturers who currently export to the UK looking to set up UK manufacturing plants. This could be a hedge against Brexit and exchange rates. A specific attraction of the North East is the supply and cheaper cost of labour as well as lower land and property costs.” \n£24 psf appears to be a figure which most of the main protagonists in the region’s commercial property agree upon over the coming 12 months, with Patrick Matheson, partner, office agency, Knight Frank pointing out that the established headline rent in Newcastle at present is £23.00 psf, “which is the lowest of all UK regional cities… but this level is likely to be moved on by some deals taking place at the moment. We would expect by the end of 2018 that prime rents will be around £24.00 psf”. The Beam, Vaux, Sunderland 1 (David Allan Photography) (Image: ©2017 David Allan - All Rights Reserved) \nMatheson throws Vaux in Sunderland into the mix as being one of the main developments for next year, not least due to its innovative, distinctive nature. \n“It is a ground-breaking mixed use scheme being delivered in a prime location in Sunderland City Centre, offering offices, retail, leisure, hotel and residential opportunities,” he says. “It is the only new major mixed use scheme currently being developed in the region and will raise the bar in terms of the office market in Sunderland City Centre.” \nAsked to pick out a particular sector which will impact on commercial property activity, Matheson points to region’s burgeoning technology industry. He says: “We have seen a significant increase in activity over the last two to three years, but as the region continues to grow its reputation as one of the hot spots for tech we anticipate this sector to become even more important to our market. \n“Tech start-ups will continue to be a valuable source of demand for some of the very successful incubator/cluster buildings (Core, Toffee Factory, Hoults Yard), and we expect more operators of such buildings to enter the North East market going forward. But we also expect more demand from high growth tech firms, both already based in the North East and new entrants looking to take benefit from the talent we have here, looking for larger premises to aid their expansion. \n“The challenge for the market is to continue to provide the space and environment that these tech firms desire.” Jessica Simpson \nJessica Simpson, a senior surveyor with Newcastle-based Naylors, also picks out tech when looking ahead to growth areas in 2018. \n“The office market will continue to be dominated by the TMT sector (Technology, Media and Telecommunications) but we also expect to see co-working operators acquire North East office space to satisfy a growing demand for more flexible and collaborative workplaces,” she says. \nGoing back to the issue of rental yields, while the consensus is for growth in commercial rents on Tyneside, the picture is not so clear further south in the region. \nSimpson’s colleague at Naylors, Chris Donabie, says: “We expect to see further rental growth at prime industrial locations such as Team Valley and Follingsby, particularly in the 20-50,000 sq ft size bracket, thanks to healthy levels of demand and very limited supply. There will be further design and build and speculative development, which will also prompt further rental growth. \n“The options available to occupiers are limited and developers will only deliver bespoke solutions for them if there is sufficient financial incentive. \n“[More generally] the North East region will continue to offers investors better value when compared with the South and this is illustrated in the yield gap across most sectors.” A RETAIL PERSPECTIVE Inglot Eldon Square (Image: Dalla House Photography) \nBob Fletcher, director of Newcastle-based @retail, answers our questions on potential developments in the North East retail commercial property scene Will retail property rents rise in 2018 and if so, why? \nThere is at present too much supply and not enough demand, so I would expect rents in weaker locations to decline further. \nInternet sales continue to take business away from the high street and additionally out of town destinations with high street brands continuing to attract more custom from traditional town and city centre locations. \nThe top tier shopping destinations will manage to hold rental levels but the tiers below are likely to be the losers and 2018 will be very challenging indeed unless a remarkable breakthrough in the Brexit negotiations is made soon. Will we see the disappearance of more high street retailers in 2018? \nYes inevitably we will see more retailers disappear from the ‘High Street’ next year, an inevitable consequence of the rise in internet sales, indifferent marketing and place making and competition from out-of-town locations. \nPerhaps the most at risk are the brands operating in the highly competitive mass food and beverage market, which has seen the competition intensify during the past three to four years. In your view, what are the main things to look out for in the retail property sector in 2018? \nSome new names on the high street in the best destinations. Victoria’s Secret and Pink are to some extent bucking the trend and continue to march north. Watch out for their openings in some North East destinations during 2018. THE TEES VALLEY VIEW (Image: golf) \nThere is much more surplus office stock in Tees Valley so we are not seeing the same demand [as in Newcastle] and rents are very competitive and we would be surprised to see much of a rise. There is a demand for warehousing around Tees Valley and we have seen some increase in rents which may continue. \nMajor commercial developments on the horizon include possible development around Durham Tees Valley Airport and the development at Central Square, Middlesbrough. \nThere is also the likely development at Middlehaven in Middlesbrough which received unanimous approval from Middlesbrough Council Planning Committee and the proposed development of the former SSI site at Redcar which are likely to feature heavily in the news. \nIn 2018, the development of snow dome in Middlesbrough could see further development in leisure and retail around it. \nThe impact of the Northern Powerhouse and Tees Valley Combined Authority will also be interesting for the region. \n* Jane Armitage, a partner in Jacksons Law’s commercial property team, previews the upcoming year in the Tees Valle Like us on Facebook", "external_links": [], "published": "2017-11-23T19:21:00.000+02:00", "crawled": "2017-11-23T20:43:29.000+02:00", "highlightTitle": ""}