{"organizations": [], "uuid": "bda9560bda846513dcae1144c4142da3f73e8eee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article11814808.ece/ALTERNATES/s1200/GPs-appointments.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/10-minutes-long-enough-doctors-13891156", "country": "GB", "domain_rank": 21960, "title": "Is 10 minutes long enough for a doctor's appointment? Fed up patients are sick of waiting", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-12T13:00:00.000+02:00", "replies_count": 0, "uuid": "bda9560bda846513dcae1144c4142da3f73e8eee"}, "author": "Katie Dickinson", "url": "http://www.chroniclelive.co.uk/news/north-east-news/10-minutes-long-enough-doctors-13891156", "ord_in_thread": 0, "title": "Is 10 minutes long enough for a doctor's appointment? Fed up patients are sick of waiting", "locations": [], "entities": {"persons": [{"name": "helen stokes-lampard", "sentiment": "none"}, {"name": "lily lamb", "sentiment": "none"}, {"name": "lamb", "sentiment": "none"}], "locations": [{"name": "canada", "sentiment": "none"}, {"name": "usa", "sentiment": "none"}, {"name": "sweden", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "ponteland medical centre", "sentiment": "none"}, {"name": "bmj", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}], "organizations": [{"name": "nhs", "sentiment": "none"}, {"name": "british medical journal", "sentiment": "none"}, {"name": "rcgp", "sentiment": "none"}, {"name": "royal college of gps", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Is 10 minutes long enough for a doctor's appointment? Fed up patients are sick of waiting Ponteland GP Dr Lily Lamb says the current 10-minute consultations are not enough to deal with increasingly complex patients Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nPatients are turning up at their GPs with a “shopping list” of ailments after waiting weeks for an appointment, a North East doctor has warned. \nPonteland GP Dr Lily Lamb says the current 10-minute consultations are no longer “fit for purpose” as stretched NHS services put more pressure on family doctors. \nShe has warned that currently GPs face a choice between not dealing with their patients’ problems properly, or running late and leaving people waiting longer. \nA new study in the British Medical Journal (BMJ) has found that GP consultations in the UK are among some of the shortest in Europe, lasting just under 10 minutes on average. Dr Lily Lamb GP at Ponteland Medical Centre (Image: newcastle chronicle) \nThe Royal College of GPs (RCGP) says that 92% of consultations in England are completed in under 15 minutes. \n“Maybe 10 minutes was fine 30 years ago but we are seeing increasingly complex patients these days,” Dr Lamb said. Read More NHS chief - Pass on Brexit saving to NHS or risk the public losing faith in democracy \n“People are being discharged quite quickly from hospital as well. \n“With something like a heart attack, at one time all your follow-up appointments would be in secondary care, now people are getting discharged back to the care of their GP. \n“We’re seeing lots of complex patients and people with lists of 15 medications. That can take two minutes and then you’ve got eight minutes left to deal with all of those problem. \n“It’s far from ideal - what often happens is either you don’t deal with the problem properly and patients don’t get the best care or you run late, which upsets other patients and increases stress on the GP. Dr Lily Lamb GP at Ponteland Medical Centre (Image: newcastle chronicle) \n“The other option is asking them to re-book, but getting another appointment can be very challenging.” \nDr Lamb said it is “fairly standard” for patients to be waiting for between two and three weeks for an appointment. \nShe has backed the RCGP’s calls for longer consultation times, saying it would lead to longer waits for appointments initially but is “the right thing to do in the long term”. \n“If you invest the time that’s needed in that first appointment then you don’t need to bring people back.” poll loading Is 10 minutes long enough for a GP appointment? 0+ VOTES SO FAR Yes No \nThe BMJ study found that with an average appointment time of 9.22 minutes, British patients see their family doctor for less time than patients in the USA, Sweden, Canada, Spain and Japan. Read More How to get through the winter and reduce the strain on the NHS, by a senior North East manager \nResponding to the study, Professor Helen Stokes-Lampard, Chair of the Royal College of GPs, said: “The time GPs have to spend with our patients is precious, and the more time we are able to spend with them, the better patient-centred care we are able to provide. \n“We urgently need to see NHS England’s GP Forward View, which includes £2.4bn extra a year for general practice and 5,000 more GPs by 2020, delivered in full.” Like us on Facebook", "external_links": [], "published": "2017-11-12T13:00:00.000+02:00", "crawled": "2017-11-12T14:00:02.002+02:00", "highlightTitle": ""}