{"organizations": [], "uuid": "f063a167357fe99614fd2d40be5f53f00b8bee77", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article799376.ece/ALTERNATES/s1200/pwc1.jpg", "site_section": "http://www.westernmorningnews.co.uk/news.rss", "section_title": "devonlive - News", "url": "http://www.devonlive.com/news/jobs/major-jobs-blow-devon-world-799369", "country": "GB", "title": "Major jobs blow for Devon as world-leading firm set 'to close Plymouth office'", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-19T10:09:00.000+02:00", "replies_count": 0, "uuid": "f063a167357fe99614fd2d40be5f53f00b8bee77"}, "author": "Daniel Clark", "url": "http://www.devonlive.com/news/jobs/major-jobs-blow-devon-world-799369", "ord_in_thread": 0, "title": "Major jobs blow for Devon as world-leading firm set 'to close Plymouth office'", "locations": [], "entities": {"persons": [{"name": "devon", "sentiment": "none"}, {"name": "heather", "sentiment": "none"}, {"name": "heather ancient", "sentiment": "none"}], "locations": [{"name": "plymouth", "sentiment": "none"}, {"name": "cornwall", "sentiment": "none"}, {"name": "princess street", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}, {"name": "newton", "sentiment": "none"}, {"name": "belfast", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "bristol", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "edinburgh", "sentiment": "none"}], "organizations": [{"name": "business insider", "sentiment": "none"}, {"name": "leeds", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "plymouth herald", "sentiment": "none"}, {"name": "university of exeter", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "  Thank you for subscribing!   \nOne of the world's leading accountancy firms has reportedly drawn up plans to axe its Plymouth office. \nPwC, who employ scores of people in Plymouth, could potentially be axing five other offices in the UK as well. \nBusiness Insider reports the plans, unveiled in two internal memos circulated on Thursday, would affect around 400 workers across the six sites. \nA company spokesman reportedly said the move was \"not about Brexit,\" but \"the way in which PwC is expanding its presence outside London, and new ways of working,\" the Plymouth Herald reports. \nIt comes despite praise being lavished on PwC in Plymouth in 2015 - and the contributions it was making to the local economy - as the firm officially unveiled revamped facilities at its site in Princess Street. Read More \nAt the time, the firm - which has had a presence in Plymouth since 1981, increased its uptake of graduate trainees to six a year and the refurbishment was part of a national improvement programme. PwC has been based in Plymouth since 1981 \nSenior partner Heather Ancient told attendees at a reception marking the occasion: “I’m passionate about the city and the region. This is a great company to work for with a terrific team. \n“Why wouldn’t we want to do business down here? The region has two great universities, great education providers, a fantastic business community that rivals the best in Europe.\" \nHeather Ancient added: “Last year ,we launched our 2020 strategic vision for Devon and Cornwall. We are committed to this region Read More University of Exeter injects £1billion into economy and generates 11,000 jobs \n“This refurbishment work demonstrates our on-going investment both in the city and in the region.” \nHeather added: “The redesigned office already had a significant impact on the team as it allows everyone to work together in a more integrated and collaborative way.” \nShe said she hoped the new offices would become a hub not just for staff but for clients too. PwC has been based in Plymouth since 1981 \nPwC has a strong health sector team and works across both the private and public sectors. Its roster of clients include small start-ups to large corporates and family-owned businesses. \nThe Plymouth office is known for four main areas of specialism - that is, tax, deals, assurance and consulting. Read More This is the major plan for a new town on the edge of Newton Abbot \nAn official PwC statement on the proposals said: \"PwC is evolving its presence across the UK to match the changing footprint and needs of clients. \n\"We've committed to new or additional office space to boost our regional headcount by a further 1,250 people. More than half of our graduate intake now join the firm in roles outside London and this will rise to 60% next year. \n\"We're opening new flagship offices in Manchester in November and Birmingham in 2018, and have significantly expanded offices in cities such as Belfast, Bristol, Edinburgh, Leeds and Reading. \n\"As part of this, we are merging a small number of offices into larger ones while offering roles to all of our people impacted, many of whom already work flexibly from client sites and other remote locations.\" \nA statement on PwC's website trumpets how much the firm loves Plymouth. Read More How today's rail strike will affect trains in Devon \nIt says: \"Plymouth is a dynamic and forward thinking city, and a great place to live. At our office, based in Princess Court, we’re working with a diverse range of local, national and global clients across all industries. You’ll be able to develop your experience with organisations ranging in size and get a real insight into the value we add in solving our client’s complex challenges. \n\"Our work with a local charity has a great impact on the community, and our social committee organise events for everyone to enjoy including an annual office tour to various places in Europe. \n\"The team around you will make you feel right at home from the offset.\" Like us on Facebook", "external_links": [], "published": "2017-11-19T10:09:00.000+02:00", "crawled": "2017-11-19T10:57:48.000+02:00", "highlightTitle": ""}