{"organizations": [], "uuid": "4b1d4173131f5ebb40bb29258db325dde7c53e97", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article12574618.ece/ALTERNATES/s1200/President-Trump-Holds-Listening-Session-With-County-Sheriffs.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/mps-parties-accuse-donald-trump-13976329", "country": "GB", "domain_rank": 21960, "title": "MPs from all parties accuse Donald Trump of spreading hatred", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-30T15:34:00.000+02:00", "replies_count": 0, "uuid": "4b1d4173131f5ebb40bb29258db325dde7c53e97"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/mps-parties-accuse-donald-trump-13976329", "ord_in_thread": 0, "title": "MPs from all parties accuse Donald Trump of spreading hatred", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "negative"}, {"name": "stuart mcdonald", "sentiment": "none"}, {"name": "adolf hitler", "sentiment": "none"}, {"name": "peter bone", "sentiment": "none"}, {"name": "amber rudd", "sentiment": "none"}, {"name": "rudd", "sentiment": "none"}, {"name": "tyne central", "sentiment": "none"}, {"name": "neville chamberlain", "sentiment": "none"}, {"name": "sajid javid", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "paul brannen", "sentiment": "none"}, {"name": "chi onwurah", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "tim loughton", "sentiment": "none"}, {"name": "brannen", "sentiment": "none"}, {"name": "onwurah", "sentiment": "none"}, {"name": "javid", "sentiment": "none"}, {"name": "hitler", "sentiment": "none"}], "locations": [{"name": "netherlands", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "twitter", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "house of commons", "sentiment": "negative"}, {"name": "snp", "sentiment": "none"}, {"name": "newcastle central", "sentiment": "none"}, {"name": "muslim children in newcastle", "sentiment": "none"}, {"name": "twitter", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MPs from all parties accuse Donald Trump of spreading hatred The House of Commons heard one MP after another condemn US President Donald Trump after controversial tweets Share US President Donald Trump (Image: Getty Images North America) Share   \nTwitter should be stopped from allowing Donald Trump to spread hatred of Muslims, according to a North East MP. \nChi Onwurah, Labour MP for Newcastle upon Tyne Central, was one of many MPs to condemn the US President in a remarkable House of Commons debate. \nPoliticians from all parties lined up to condemn the leader of the United States, the UK’s traditional ally. \nConservative Peter Bone urged Mr Trump to delete his Twitter account, while fellow Tory MP Tim Loughton said Twitter should ban the President. Newcastle Central MP, Chi Onwurah (Image: Newcastle Chronicle) \nSNP MP Stuart McDonald said Mr Trump’s planned state visit to the UK should be scrapped - though Home Secretary Amber Rudd said it had not been cancelled. \nShe told MPs: “An invitation for the visit has been extended and accepted, but the dates and the precise arrangements have yet to be agreed.” \nMs Rudd also suggested that she agreed with calls for Mr Trump to delete his Twitter account, saying “I’m sure many of us might share his view” \nMr Trump caused outrage on Wednesday by retweeting three posts by Britain First to his 43.6 million followers, including footage from the Netherlands showing a man attacking another man on crutches. The text accompanying the Tweet claimed the attacker was a Muslim migrant, although reports from Netherlands suggest this is not true. \nThe Prime Minister’s official spokesman said on Wednesday that the President had been “wrong” to share the posts. \nMr Trump responded by sending a Twitter message addressed personally to the Prime Minister, saying: “@Theresa-May, don’t focus on me, focus on the destructive Radical Islamic Terrorism that is taking place within the United Kingdom. We are doing just fine!” Prime Minister Theresa May meeting US President Donald Trump (Image: PA) \nMs Onwurah said children in Newcastle would feel they were under attack from the US President. \nShe told MPs; “When I think of Muslim Children in Newcastle waking up to find themselves being attacked by the President of the most powerful nation on earth, because that is how it will appear to them, then my heart bleeds. \n“However the 45th president is not accountable to the children of Newcastle. It’s hard to see to whom he does hold himself accountable. Read More Heartbreaking case of mum with four children who had no food and no money to get to a foodbank \n“But the social media giants are, through the Home Secretary. So what is the Home Secretary going to do to to demonstrate that accountability?” \nMs Rudd said the UK was trying to gets “this hate and sometimes illegal information that is sometimes put online” taken down. \nBut she pointed out that the UK actually needed the help of the American government to do this, as the companies supplying social media services such as Twitter were based in the US. \nOne North East politician compared Donald Trump to Adolf Hitler. \nLabour MEP Paul Brannen made the comparison as he responded to a report on Twitter from a journalist who said: “Amber Rudd has warned MPs not to overreact to Trump, asking them to focus on ‘the bigger picture’ of US-UK relations.” \nReplying to this, Mr Brannen said: “Neville Chamberlain has warned MPs not to overreact to Hitler, asking them to focus on ‘the bigger picture’ of British-German relations.” Read More UK 'will be paying for years to come' if it agrees £50bn Brexit bill \nOne of the most powerful responses to Mr Trump came from senior Government Minister Sajid Javid, the Communities Secretary. \nMr Javid, a Muslim, referred to POTUS - President Of The United States - saying: “So POTUS has endorsed the views of a vile, hate-filled racist organisation that hates me and people like me. He is wrong and I refuse to let it go and say nothing.” Like us on Facebook", "external_links": [], "published": "2017-11-30T15:34:00.000+02:00", "crawled": "2017-11-30T15:45:52.007+02:00", "highlightTitle": ""}