{"organizations": [], "uuid": "373b2787272d9d55c08840e2022ff33e244219db", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article444434.ece/ALTERNATES/s1200/Mel.png", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "devonlive - frontpage", "url": "http://www.devonlive.com/authors/mel-stride/past-been-highly-critical-new-716237", "country": "GB", "title": "I have in the past been highly critical of the NEW CCG and their lack of engagement but progress has definitely been achieved", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-02T11:04:00.000+02:00", "replies_count": 0, "uuid": "373b2787272d9d55c08840e2022ff33e244219db"}, "author": "Mel Stride", "url": "http://www.devonlive.com/authors/mel-stride/past-been-highly-critical-new-716237", "ord_in_thread": 0, "title": "I have in the past been highly critical of the NEW CCG and their lack of engagement but progress has definitely been achieved", "locations": [], "entities": {"persons": [{"name": "mel stride", "sentiment": "none"}, {"name": "mel stride  budget", "sentiment": "none"}, {"name": "bill", "sentiment": "none"}], "locations": [{"name": "central devon", "sentiment": "none"}, {"name": "okehampton", "sentiment": "none"}, {"name": "matford", "sentiment": "none"}, {"name": "powderham castle", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "exminster", "sentiment": "none"}, {"name": "ashburton", "sentiment": "none"}], "organizations": [{"name": "ccg", "sentiment": "none"}, {"name": "finance", "sentiment": "none"}, {"name": "customs bill", "sentiment": "none"}, {"name": "new ccg", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "    \nMel Stride is the Conservative MP for Central Devon and has been since 2010 \nBUSY \nLast week I was flat out right across our vast constituency. It takes an hour and a half to drive from one side to the other. \nMuch of my focus was on local healthcare. I held discussions with the NEW CCG who are responsible for commissioning services across much of Central Devon and later chaired a meeting with the local CCG and a number of stakeholders in Okehampton to discuss where we are on the proposed rollout of new health services for the local community. \nI have in the past been highly critical of the NEW CCG and their lack of engagement but progress has definitely been achieved since my last meeting with them – a successful information day has recently been held in the town and a group is now working hard on identifying local health needs with a report due in the New Year at which point the CCG has committed to providing a clear action plan for the roll out of these new services. I will continue to keep a close eye on progress. The more positive engagement of late must be kept up and accelerated. Read More It is easy to fall prey to the lure of nostalgia and to think that things were better in the old days. Well they weren’t. \nI dropped into Powderham Castle to review some of the challenges they face in renovating this medieval treasure. The oldest parts of the castle date back to the later 14th century when it was effectively a fortified house. It has been the home of the Earl’s of Devon since then - right up to the present day. \nIn order to keep the castle up together the doors have been opened to the public since 1959. Over a million people have visited since then and today visitors enjoy themed tours amongst many other events. Weddings are also a major part of the castle’s modern-day offering. Read More \nI held a surgery in Exminster and spoke at a lunch club event at Matford where there was a vigorous debate about taxation for which I have responsibility as Financial Secretary to the Treasury. Mel Stride \nBudget \nI am continuing to work hard on assisting the Chancellor finalise the coming Budget. This will be presented to Parliament on 22nd November. I have received a number of representations on both taxation and spending. \nI am always keen to hear the thoughts of constituents on any issues that are of concern or interest to them but especially keen to hear about any thoughts on tax that you might have at the moment. Tax and duty always plays an important part in any Budget – so do please share your views with me over the next couple of weeks. Read More MP Mel Stride supports Ashburton cricket club after vandals target their clubhouse \nTaxes that I cover included all direct taxes (income tax, corporation tax, business rates, national insurance etc) and indirect taxes (VAT and a variety of levies and charges). \nMy constituents can best contact me at mel.stride.mp@parliament.uk. Along with my work on the budget I am also busy taking the Finance Bill through the Commons and will also move onto the Customs Bill shortly. This will ensure that we are ready for our new customs arrangements post Brexit. Like us on Facebook", "external_links": [], "published": "2017-11-02T11:04:00.000+02:00", "crawled": "2017-11-02T11:18:21.000+02:00", "highlightTitle": ""}