{"organizations": [], "uuid": "6f4abd971bf2949b273113c7399dee265915f88d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13936286.ece/ALTERNATES/s1200/Budget-2017.jpg", "site_section": "", "section_title": "", "url": "http://www.chroniclelive.co.uk/news/north-east-news/budget-2017-live-stream-updates-13936784", "country": "IE", "domain_rank": 21960, "title": "Budget 2017 LIVE: The NHS, housing and Universal Credit top of the agenda - Chronicle Live", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2017-11-22T14:29:00.000+02:00", "replies_count": 0, "uuid": "6f4abd971bf2949b273113c7399dee265915f88d"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/budget-2017-live-stream-updates-13936784", "ord_in_thread": 0, "title": "Budget 2017 LIVE: The NHS, housing and Universal Credit top of the agenda - Chronicle Live", "locations": [], "entities": {"persons": [{"name": "spea", "sentiment": "neutral"}, {"name": "chris grayling", "sentiment": "none"}, {"name": "hammond", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "andrew marr", "sentiment": "none"}, {"name": "nick forbes", "sentiment": "none"}, {"name": "frances o’grady", "sentiment": "none"}, {"name": "john bercow", "sentiment": "none"}, {"name": "philip hammond", "sentiment": "none"}], "locations": [{"name": "gosforth", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "nhs", "sentiment": "neutral"}, {"name": "universal credit", "sentiment": "neutral"}, {"name": "budget", "sentiment": "neutral"}, {"name": "metros  newcastle city council", "sentiment": "none"}, {"name": "tuc", "sentiment": "none"}, {"name": "the chronicle", "sentiment": "none"}, {"name": "transport", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Massive budget moment: the Chancellor just committed £337m for new Metros. \nThat’s massive news - but no news yet on what form the funding will take. \nWe’ll have much more on this soon. Behind the scenes at the Nexus metro depot in Gosforth (Image: Newcastle Chronicle) 13:04 \nThe Chancellor announces a new £20million fund to allow colleges to prepare for technical ‘T-levels’. \nThe Teaching for Mastery of Maths programme will be expanded to thousands more schools. \nAnd there will be a £600 cash bung for every school that gets an extra pupil doing maths A-level, or equivalent. 13:00 All eyes on the future \n“Boring Phil” has gone all sci-fi. \nThe big theme so far is support for the businesses of the future. \nSo there’s £500m funding for tech initiatives like AI and something called “geo-spacial data commission”, unlocking £20bn for knowledge intensive businesses and support for driverless cars. \nThis budget is brought to you by Philip K Dick, not Philip Hammond. \nThere’s also funding for environmental initiatives and a levy on high-polluting diesels. 12:52 KEY EVENT The important bit \nHere come the big economic forecasts from the Office of Budget Responsibility - here’s the key numbers. There are 1.4m unemployed - but the Office for Budget Responsibility predict 600,00 jobs will be created by 2022. The OBR have revised down productivity forecasts and GDP growth (GDP down to 1.5% this year and 1.3% in 2019/20). Inflation is expected to peak at 3% this quarter and then fall. Debt as a percentage of GDP is expected to peak this year and gradually shrink in coming years. Government borrowing is at nearly £50bn a year but OBR say it will fall over coming years. \nYou wouldn’t call those great numbers for the Chancellor but nor is there a big shock in there. 12:51 Jonathan Walker Hammond suggests we need to be ready for a bad Brexit - just in case \nThe Chancellor announced a £3 billion “Brexit fund” to ensure the UK is prepared for leaving the EU. \nHe said life after Brexit will be “full of change, full of new challenges and above all full of new opportunities”. \nBut he also said the country must be prepared “for every possible outcome”. \nThat seems to mean preparing to leave the EU without a comprehensive deal, if necessary. 12:49 Austerity isn't over \nThe Chancellor said the deficit had fallen. \nBut he added: “Our debt is still to high and we need to get it down.” \nIt means austerity will continue. 12:44 Budget video explainer \nBefore he gets into the real substance, here’s a video explainer containing everything you need to know about this announcement. 12:43 Brexit funding \nThe Chancellor just announced he’s setting aside £3bn for “Brexit preparations” and will spend more if necessary. \nHe says there should “be no doubt about [government’s] resolve” on preparing for our departure from the EU. \nThe government has already spent £700m on Brexit. It ain’t going to come for free. 12:40 Here we go \nThe Chancellor, Philip Hammond, comes out fighting. \nSays the economy continues to grow, create jobs and “confound those who seek to talk it down”. \nSays the future will be about building a new relationship with the EU. \nYou get the feeling he needs to have a big afternoon, even if he doesn’t have much to announce. 12:34 Pay rise for nurses? \nThis is interesting - the BBC’s political editor thinks there could be some good news in store for nurses. 12:25 When will the Budget start? \nTraditionally PMQs ends at 12.30, and the Budget will follow. \nBut Speaker John Bercow tends to let PMQs carry on for a good ten or 15 minutes longer than scheduled - to the annoyance of some MPs 12:10 KEY EVENT Metro funding announcement? \nThere could be a massive announcement for the North East in today’s Budget: funding for new Metros \nNewcastle City Council leader Nick Forbes told The Chronicle earlier this months that it was “possible” we get here something during the Chancellor’s speech. \nThat would be absolutely massive for the North East - but nothing is certain. Behind the scenes at the Nexus metro depot in Gosforth (Image: Newcastle Chronicle) 11:44 KEY EVENT New railcard to be announced \nOne thing we’re almost certain to hear in the budget today is the introduction of a 26-30 railcard. \nWe published a full guide to how it will work and what it will mean for travelers last month. Transport Secretary Chris Grayling (Image: PA) 11:30 \nThe symbolism is just too much. 11:16 Downing Street speak \nSome pre-Budget briefing coming out of Number 10 this morning. \nThe Chancellor’s neighbours will be watching this announcement extremely closely and there was plenty of tittle-tattle in the national press about discontentment with Hammond’s performance in recent weeks (including the “there are no unemployed people” gaffe on Andrew Marr’s show). \nIt’s the worst kept secret in British politics that Theresa May might have quite liked to have sacked Hammond if she had won a big majority in the June general election. \nThe response of people close to her in the hours and days after the budget will be fascinating. 11:03 PMQs \nAs always on a Wednesday afternoon, Prime Minister’s Question will happen at 12pm even though it’s not the main event today. \nTheresa May is en route. 11:00 Public sector pay \nThe TUC have published their analysis of what impact the public sector pay squeeze has had on the North East. TUC general secretary Frances O’Grady (Image: Daily Mirror) 10:46 What the budget means for you \nGood morning, welcome to our live blog of today’s Budget. \nThe Chancellor will be making his statement in the Commons at 12:30 and we’ll be bringing you live updates, analysis and all the reaction. \nSo what can we expect from it? And what will it mean for you and your family? Chancellor of the Exchequer Philip Hammond (Image: PA) More On", "external_links": [], "published": "2017-11-22T14:29:00.000+02:00", "crawled": "2017-11-22T14:31:37.005+02:00", "highlightTitle": ""}