{"organizations": [], "uuid": "f9c2fee3ddec582a916013d9d5b2f1b6e7741ccb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.bristolpost.co.uk/incoming/article815323.ece/ALTERNATES/s1200/1024px-Albinen.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/news/property/50k-being-offered-families-move-815420", "country": "US", "domain_rank": 48128, "title": "£50k being offered to families to move to picturesque Alpine village - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.02, "site_type": "news", "published": "2017-11-22T14:55:00.000+02:00", "replies_count": 0, "uuid": "f9c2fee3ddec582a916013d9d5b2f1b6e7741ccb"}, "author": "Daniel Smith", "url": "http://www.leicestermercury.co.uk/news/property/50k-being-offered-families-move-815420", "ord_in_thread": 0, "title": "£50k being offered to families to move to picturesque Alpine village - Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "julie andrews", "sentiment": "none"}], "locations": [{"name": "leicester mercury", "sentiment": "none"}, {"name": "valais", "sentiment": "none"}, {"name": "alps", "sentiment": "none"}, {"name": "leukerbad", "sentiment": "none"}, {"name": "albinen", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "£50k being offered to families to move to picturesque Alpine village Residents could make amazing offer to save the future of Albinen in Switzerland Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nEver fancied living in Europe? With Brexit looming it could be about to get a lot more difficult. \nBut if you're quick you might be able to take up an incredible offer from a picturesque Alpine village. \nPeople living in Albinen, located in the southwestern part of Switzerland, are taking a vote on whether they should pay for others to join them. \nThe village has been struggling to cope with an exodus of permanent residents, reports Finance.co.uk. \nMany of the properties left have been bought up as holiday homes. Read More Man's wife 'shocked' after he decorates his house with TIN FOIL for Christmas \nAnd when three families recently moved out, taking eight children with them, the local school had to close down. \nBut those left have come up with a plan - an offer that some might find it difficult to turn down. The hills could be alive for you just like Julie Andrews \nResidents are to vote on the idea of PAYING new families to come and live in the village, situated in the Alps near Leukerbad in Valais. \nFamilies who decide to build or buy a house in the village could be given a payment amounting to £19,000 for each adult and £7,600 for each child. Read More \nSo a family of four could net themselves £53,000 to make the relocation. What's the catch? \nThere are a few conditions. New residents must be under the age of 45, and they must stay for at least ten years. \nThe house they build or buy has to be worth at least £152,000, and it must be their primary residence. Albinen \nVillagers hope the they would benefit in return from the initial outlay through construction contracts and taxes. \nLooking for a new house closer to home? Click here to see what's on the market. Like us on Facebook ", "external_links": [], "published": "2017-11-22T14:55:00.000+02:00", "crawled": "2017-11-22T17:21:56.008+02:00", "highlightTitle": ""}