{"organizations": [], "uuid": "bbe41475351cf539611f2f07fbe7c650039f56df", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article775181.ece/ALTERNATES/s1200/Im-a-Celebrity.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "devonlive - frontpage", "url": "http://www.devonlive.com/news/who-stanley-johnson-im-celebrity-803996", "country": "GB", "title": "Who is Stanley Johnson on I'm A Celebrity... Get Me Out of Here", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-20T15:25:00.000+02:00", "replies_count": 0, "uuid": "bbe41475351cf539611f2f07fbe7c650039f56df"}, "author": "Becky Sheaves", "url": "http://www.devonlive.com/news/who-stanley-johnson-im-celebrity-803996", "ord_in_thread": 0, "title": "Who is Stanley Johnson on I'm A Celebrity... Get Me Out of Here", "locations": [], "entities": {"persons": [{"name": "stanley johnson", "sentiment": "none"}, {"name": "jo", "sentiment": "none"}, {"name": "jamie vardy", "sentiment": "none"}, {"name": "st paul", "sentiment": "none"}, {"name": "rachel", "sentiment": "none"}, {"name": "paul of wurttemburg", "sentiment": "none"}, {"name": "myleene klass", "sentiment": "none"}, {"name": "julia", "sentiment": "none"}, {"name": "maximilian", "sentiment": "none"}, {"name": "stanley", "sentiment": "none"}, {"name": "kompromat", "sentiment": "none"}, {"name": "james saligari", "sentiment": "none"}, {"name": "georgia toffolo", "sentiment": "none"}, {"name": "rebekah vardy", "sentiment": "none"}, {"name": "leo", "sentiment": "none"}, {"name": "karolina von rothenburg", "sentiment": "none"}, {"name": "boris", "sentiment": "none"}, {"name": "william hill", "sentiment": "none"}, {"name": "boris johnson", "sentiment": "none"}, {"name": "richard martin", "sentiment": "none"}, {"name": "marc hill", "sentiment": "none"}], "locations": [{"name": "cornwall", "sentiment": "none"}, {"name": "afghanistan", "sentiment": "none"}, {"name": "charlotte", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "cambridge", "sentiment": "none"}, {"name": "venice", "sentiment": "none"}, {"name": "india", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "sweden", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "teignmouth", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "antarctica", "sentiment": "none"}, {"name": "winsford", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "penzance", "sentiment": "none"}, {"name": "oxford", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}, {"name": "holland", "sentiment": "none"}], "organizations": [{"name": "gorilla organisation", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "eton", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Who is Stanley Johnson on I'm A Celebrity... Get Me Out of Here Stanley Johnson, 77, is the wild card in this year’s jungle. The politician and father of Boris Johnson lives on Exmoor and was born in Cornwall. Here's his story and how he has ended up Down Under... Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nStanley has strong Westcountry roots He was born in Penzance and now lives on Exmoor in the village of Winsford. \nHe is currently odds-on to win I'm a Celebrity William Hill are offering 11/4 for Stanley to beat fellow South West celeb Georgia Toffolo. Stanley Johnson arriving in Australia for I'm a Celebrity (Image: James Saligari) \nHe had to do the first Bushtucker Trial “My hand is totally recovered. I got a couple of pecks from a lobster I should have thought, or a prawn, or maybe a squid. By the way, did you know squids have very nasty beaks?” he said after plunging his arm into a box of live seafood. \nHe’s true blue politically He was a Conservative MEP from 1979 to 1984 and stood for Teignbridge in the 2005 General Election. He later admitted that spelling Teignbridge without a “d” in his campaign leaflets and calling for “more talk and less action” (oops) didn’t help. He lost to the Lib Dems. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nHe was the first into the jungle shower Viewers were treated to the sight of Stanley stripping to his pants for the I’m a Celebrity rainfall shower, made famous by Myleene Klass in a white bikini. \nStanley has no idea who most of the other celebs are in the jungle Rebekah Vardy told him: “I’m the wife of Jamie Vardy. He plays for England.” To which Stanley replied “Now is he going to be out for the Ashes? ‘Cause the first match is next week.” He didn’t even seem to recognise Ant and Dec. Photograph by Marc Hill - 22.04.2005 - Boris and Stanley Johnson on the campaign trail in Teignmouth, Devon. \nUnlike his son Boris, he voted Remain in the Brexit referendum But just recently he has changed his mind: “Looking back, say, 50 years from now, from the UK’s (and even the EU’s?) perspective Brexit may indeed seem to have been the right move at the right time.” Read More Watch Georgia Toffolo squealing with terror in her first Bushtucker Trial \nHe comes from a very posh family He’s a direct descendent of Karolina von Rothenburg who was the illegitimate daughter of Prince Paul of Wurttemburg, so he is related to the British Royal family, the monarchies of Sweden and Holland and the Russian Royal family, the Romanoffs. \nHe doesn’t think Boris will find out he is in the jungle “I don’t think Boris knows. We were told strictly not to tell anybody. I haven’t told anyone and I stick by the rules, I can tell you. I very much doubt he will ever hear about it. Don’t tell me he’s going to hear about it, it’s very unlikely. Knowing Boris he may never find out.” Stanley's daughter Rachel is a journalist and novelist \nThis isn’t his first adventure As a student in the 1960s he travelled by motorbike and sidecar from Oxford to Venice and on to India and Afghanistan. \nHe has six children and they all went to Oxford or Cambridge With his first wife, Charlotte, he had Boris, Rachel, Jo and Leo. He later married again and had Julia and Maximilian. “What do you expect if you send your kids to Eton and St Paul's? I assumed that's where they would go... If they can’t come top, who can?” \nHis kids have done pretty well Boris is Foreign Secretary, Rachel is a journalist and novelist, Jo is a government minister and Leo is an environmentalist. Julia is a musician and Maximilian works in Asian finance. Read More How three friends from Devon set up a multi-million pound foodie business \nThe environment is his passion He is a trustee of the Gorilla Organisation. In 1983 he received the RSPCA Richard Martin Award for Outstanding Services to animal welfare, and in 1984 he received the Greenpeace Award for Outstanding Services to the Environment. \nHe’s written 30 books about everything from poetry to Antarctica His latest, Kompromat, is a thriller about Russian involvement in the EU referendum. \nHe has never seen I’m a Celebrity “I have never watched the show. It’s all totally new to me, I know absolutely nothing about it but I’ve been told about it and obviously I am ready to give it a go. I don’t think I am dreading anything. I am looking forward to being with the fellow competitors, contestants. I say that because it is a competition isn’t it?” Like us on Facebook ", "external_links": [], "published": "2017-11-20T15:25:00.000+02:00", "crawled": "2017-11-20T15:37:49.000+02:00", "highlightTitle": ""}