{"organizations": [], "uuid": "5f4810424147362ae8fcebb646ba185e6a35d25b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13919864.ece/ALTERNATES/s1200/psm_SCU_110816proton_03.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/health/nhs-breaking-point-gp-numbers-13919692", "country": "GB", "domain_rank": 21960, "title": "NHS at 'breaking point' as GP numbers fall and patients soar in North East", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-18T15:00:00.000+02:00", "replies_count": 0, "uuid": "5f4810424147362ae8fcebb646ba185e6a35d25b"}, "author": "David Ottewell", "url": "http://www.chroniclelive.co.uk/news/health/nhs-breaking-point-gp-numbers-13919692", "ord_in_thread": 0, "title": "NHS at 'breaking point' as GP numbers fall and patients soar in North East", "locations": [], "entities": {"persons": [{"name": "chaand nagpaulm", "sentiment": "none"}, {"name": "helen reynard", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "easington", "sentiment": "none"}, {"name": "sedgefield", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "durham dales", "sentiment": "none"}, {"name": "south tees", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "south tyneside", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "north tyneside", "sentiment": "none"}, {"name": "north durham", "sentiment": "none"}], "organizations": [{"name": "nhs", "sentiment": "negative"}, {"name": "british medical assoc", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "nhs england cumbria", "sentiment": "none"}, {"name": "middlesbrough", "sentiment": "none"}, {"name": "bma", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "british medical association", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NHS at 'breaking point' as GP numbers fall and patients soar in North East The British Medical Association warns a chronic shortage of doctors is putting patient care at risk Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe NHS is at “breaking point”, medics have warned, as fresh figures shed light on the scale of the GP shortage in the North East . \nData published by the NHS reveals the region had 1,454 full-time equivalent GPs at the end of June this year, compared to 1,564 in March 2016 - a loss of more than 100 GPs in a little over a year. \nThe downturn comes as the number of patients who registered with a GP in the North East rose by more than 18,000 during the same period. \nNow, the British Medical Association (BMA), the organisation representing the country’s GPs, has warned a chronic lack of doctors is putting patient care at risk. Chaand Nagpaulm, of the British Medical Association (Image: BMA) \nDr Chaand Nagpaulm, BMA council chairman, said: “We know that many doctors are struggling with unsustainable workloads in an NHS that is understaffed and chronically underfunded. \n“This has a huge impact on their morale and well-being, often leading to stress and burnout. \n“Brexit also poses a new risk, with almost half of EU doctors considering leaving the NHS following the referendum result. \n“With an NHS at breaking point, if the Government doesn’t get to grips with this workforce crisis, the NHS will struggle to attract and retain highly trained staff, and patient care will suffer as a result.” \nThe data shows that South Tees saw the biggest percentage decline in full-time equivalent GPs during the 15-month period. \nThe area, which covers Middlesbrough, had 161 staff in March 2016 but only 140 at the end of June this year - a 14% drop. \nThat means South Tees lost the equivalent in one in seven of its GPs in just 15 months. \nPatient numbers in the area were up by 1,646 over that period, leaving the average GP catering for 2,112 people. Read More More than one in 20 nurses have taken out a payday loan to pay bills, survey claims \nThe number of GPs fell from 213 to 186 in Northumberland - equivalent to 13% - and from 158 to 141 in Sunderland - or 11% - during the same period. \nNewcastle and Gateshead lost 8% of GPs from 302 to 274, Durham Dales, Easington and Sedgefield saw a drop from 167 to 156 - or 7% - but staff levels stayed at 129 in North Durham. \nDespite declines across the majority of the region, North Tyneside saw a rise in the number of full-time equivalent GPs from 30 to 137, while South Tyneside was up from 85 to 93. \nThe total number of patients registered with a GP in the North East stood at 2,732,690 in March 2016 but increased to 2,751,031 15 months later. \nHelen Reynard, primary care transformation manager for NHS England Cumbria and the North East, said: “NHS England recognises the challenges faced by general practice. \n“The General Practice Forward View, which was introduced last year to help address these challenges, delivers schemes to help support GP recruitment and retention. \n“Examples of initiatives in our region include the international GP recruitment programme, recruiting other clinicians, including pharmacists, therapists and physiotherapists to work in GP practices to help reduce GP workload and supporting GPs by providing mental health support, when required, and opportunities to access bespoke training to encourage personal development and retention.” Like us on Facebook", "external_links": [], "published": "2017-11-18T15:00:00.000+02:00", "crawled": "2017-11-18T15:33:39.004+02:00", "highlightTitle": ""}