{"organizations": [], "uuid": "4e0a7a4ff2283255f832163d56e622161e7d4bfe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13453395.ece/ALTERNATES/s1200/ScS-results.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/sunderlands-scs-reports-rise-orders-13937475", "country": "GB", "domain_rank": 21960, "title": "Sunderland's SCS reports rise in orders after tough end to year", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-22T13:58:00.000+02:00", "replies_count": 0, "uuid": "4e0a7a4ff2283255f832163d56e622161e7d4bfe"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/sunderlands-scs-reports-rise-orders-13937475", "ord_in_thread": 0, "title": "Sunderland's SCS reports rise in orders after tough end to year", "locations": [], "entities": {"persons": [{"name": "smith", "sentiment": "none"}, {"name": "alan smith", "sentiment": "none"}, {"name": "house of fraser", "sentiment": "none"}], "locations": [{"name": "chelmsford", "sentiment": "none"}], "organizations": [{"name": "scs", "sentiment": "negative"}, {"name": "sunderland", "sentiment": "negative"}, {"name": "business sunderland", "sentiment": "negative"}, {"name": "invalid email  sofa", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "house of fraser", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Sunderland's SCS reports rise in orders after tough end to year The firm's core business saw orders rise 3.6% but there were tougher trading conditions in its House of Fraser concessions Share ScS furniture store (Image: PA) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nSofa chain ScS has seen orders bounce back after a slump in the second half of its last financial year and assured it was well-positioned to weather “continued economic uncertainty” . \nThe group said like-for-like orders rose 2.9% in the 16 weeks to November 18, while two-year like-for-like orders jumped 8%. \nWhen accounting for its core business alone, orders rose 3.6% for the period, with that number rising to 7.9% for two-year orders, both on a like-for-like basis. \nThe order figures mark an improvement on the company’s half-year trading statement released in August, having reported a 5% slump in second-half orders after being hit by more difficult retail conditions and failing to match up to strong sales a year earlier. \nHowever, the performance of its House of Fraser concessions - which made up 6.2% of its orders over the 16-week period - suffered, with orders declining 6.4%. \nScS, which made the update as it holds its annual general meeting for shareholders, said the drop was due to “very strong” comparative figures in the same period a year earlier. \nOn a two-year measure, like-for-like concession orders were up 10%. \nChairman Alan Smith said he was “pleased to report” that ScS had made a good start to the financial year. \nHe said: “Whilst it is still early in the current financial year, the group continues to trade in line with our expectations.” Read More \nHe added that the company was still on track to launch a new store in Chelmsford on December 26, bringing its portfolio up to 101 stores and 27 House of Fraser concessions. \nMr Smith said ScS was in a position to ride out challenging market conditions. \nHe said: “We believe the Group’s increasing resilience and value proposition will enable us to manage the continued economic uncertainty and take advantage of opportunities.” \nA number of retailers have raised concerns around softening consumer confidence amid surging inflation, which has been sparked by the post-Brexit vote collapse of the pound. \nThe Consumer Price Index (CPI) measure of inflation is currently at 3%. Like us on Facebook", "external_links": [], "published": "2017-11-22T13:58:00.000+02:00", "crawled": "2017-11-22T14:21:51.008+02:00", "highlightTitle": ""}