{"organizations": [], "uuid": "32f6a63baf2286076882501cb265a468dbeb3aee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13877109.ece/ALTERNATES/s1200/Priti-Patel-Israeli-holiday.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/priti-patel-sacked-israel-live-13877131", "country": "GB", "domain_rank": 21960, "title": "Priti Patel flies back to UK LIVE: Theresa May set to meet disgraced Tory minister after Israel meetings scandal", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-08T19:45:00.000+02:00", "replies_count": 0, "uuid": "32f6a63baf2286076882501cb265a468dbeb3aee"}, "author": "Tom Eden", "url": "http://www.chroniclelive.co.uk/news/north-east-news/priti-patel-sacked-israel-live-13877131", "ord_in_thread": 0, "title": "Priti Patel flies back to UK LIVE: Theresa May set to meet disgraced Tory minister after Israel meetings scandal", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "patel", "sentiment": "negative"}, {"name": "priti patel", "sentiment": "negative"}, {"name": "alistair burt", "sentiment": "none"}, {"name": "vince cable", "sentiment": "none"}, {"name": "alan", "sentiment": "none"}, {"name": "alan duncan", "sentiment": "none"}, {"name": "oj simpson", "sentiment": "none"}, {"name": "philip", "sentiment": "none"}, {"name": "stewart", "sentiment": "none"}, {"name": "netanyahu", "sentiment": "none"}, {"name": "vince", "sentiment": "none"}, {"name": "john major", "sentiment": "none"}, {"name": "theresa villiers", "sentiment": "none"}, {"name": "brad pitt", "sentiment": "none"}, {"name": "benjamin netanyahu", "sentiment": "none"}, {"name": "rory stewart", "sentiment": "none"}, {"name": "michael fallon", "sentiment": "none"}, {"name": "gavin williamson", "sentiment": "none"}, {"name": "boris johnson", "sentiment": "none"}, {"name": "anne milton  she", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}, {"name": "philip hammond", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "israel", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "westminster", "sentiment": "none"}, {"name": "guildford", "sentiment": "none"}, {"name": "heathrow", "sentiment": "none"}, {"name": "africa", "sentiment": "none"}, {"name": "downing street  priti patel", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "kenya", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}, {"name": "downing street", "sentiment": "none"}, {"name": "golan heights", "sentiment": "none"}, {"name": "santa", "sentiment": "none"}, {"name": "nairobi", "sentiment": "none"}, {"name": "iran", "sentiment": "none"}, {"name": "uganda", "sentiment": "none"}, {"name": "iraq", "sentiment": "none"}], "organizations": [{"name": "bbc", "sentiment": "neutral"}, {"name": "boeing", "sentiment": "none"}, {"name": "kenya airways", "sentiment": "none"}, {"name": "dfid-foreign office", "sentiment": "none"}, {"name": "cabinet", "sentiment": "none"}, {"name": "department for education", "sentiment": "none"}, {"name": "penrith", "sentiment": "none"}, {"name": "flightradar", "sentiment": "none"}, {"name": "un general assembly", "sentiment": "none"}, {"name": "black watch", "sentiment": "none"}, {"name": "foreign office", "sentiment": "none"}, {"name": "downing street", "sentiment": "none"}, {"name": "international development", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "pa", "sentiment": "none"}, {"name": "oxford union", "sentiment": "none"}, {"name": "department for international development", "sentiment": "none"}, {"name": "state", "sentiment": "none"}, {"name": "oxford university", "sentiment": "none"}, {"name": "press association", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "defence", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Here is Priti Patel’s letter to Theresa May offering her resignation: 19:24 Two ministers gone in a week \nPatel is the second cabinet minister to resign from May’s cabinet in a week, after Defence Secretary Michael Fallon resigned amid allegations about inappropriate sexual behaviour. 19:17 \nPriti Patel has resigned as International Development Secretary following her meeting with Theresa May. 19:07 Priti Patel has left Number 10 \nPatel has left Number 10 through the back door, according to journalists outside Number 10. \nThe meeting lasted about 30 minutes, but still no news on the outcome. 19:03 Will she jump before she's pushed? \nThe BBC’s political editor has heard that Ms Patel could resign, before being sacked. 18:33 May arrives at Number 10 \nThe Prime Minister has now arrived back at Number 10 to address Priti Patel. (Image: PA) \nMs Patel has entered Downing Street through the back entrance, rather than the famous black door of Number 10, for talks with Theresa May which could spell the end of her cabinet career. \nThe International Development Secretary was summoned back from an official visit to Africa for a showdown with the Prime Minister. \nMs Patel had been intending to spend three days in Kenya and Uganda, but was forced to cut short her trip and return home from Nairobi to explain the disclosure of further unauthorised meetings with Israeli politicians. 18:25 Priti Patel arrives at Downing Street \nPriti Patel has reportedly arrived at Downing Street for her meeting with Theresa May: 18:21 Downing Street denies claims May knew about meetings \nDowning Street has denied a report in the Jewish Chronicle that Ms Patel told Mrs May in the run-up to the UN General Assembly in September that her meetings in Israel had included talks with prime minister Benjamin Netanyahu. (Image: PA) \nNo 10 also dismissed a claim by the newspaper that the Prime Minister had instructed Ms Patel not to include one of the latest meetings in the list she released on Monday, so as not to embarrass the Foreign Office. \n“It is not true that the Prime Minister knew about the International Development Secretary’s meeting with PM Netanyahu before Friday November 3,” a No 10 spokesman said. \n“It is equally untrue to say that No 10 asked DfID to remove any meetings from the list they published this week.” 18:09 KEY EVENT What has Priti Patel done? \nPriti Patel is expected to be sacked as international development secretary as more embarrassing details emerged of her off-the-books meetings with Israeli politicians. (Image: PA) \nIt has emerged she had failed to disclose several meetings with senior Israelis, including the Israeli public security minister in Parliament in September and a senior official from the Israeli foreign ministry in New York a week later. \nIt also emerged she visited an Israeli field hospital in the Golan Heights on her “holiday” - the UK does not recognise the Israeli-occupied area. \nThe Foreign Office and Downing Street were unaware the meetings had taken place and diplomatic officials were not present. \nIt follows days of questions over her having apparently “gone rogue” during a “family holiday” in Israel in August. \nMs Patel was forced to apologise after holding 12 meetings with Israeli Prime Minister Benjamin Netanyahu and other top officials during the trip, without telling Downing Street, the Foreign Office or British diplomats in the region. \nUntil late Tuesday afternoon, Number 10 had insisted Mrs May still had “full confidence” in Ms Patel, had accepted her apology and considered the matter “closed”. \nBut it emerged last night Theresa May only learned Ms Patel may have discussed giving money to the Israeli army with officials when it was reported in the media yesterday morning. 17:56 May's earlier comments on Priti Patel \nOn Monday, Theresa May spoke about Westminster abuse and reprimanding Priti Patel. \nHere’s what she had to say: 17:56 Vince Cable calls for resignation \nLiberal Democrat leader Sir Vince Cable added his voice to the chorus calling for Ms Patel’s sacking. \n“I think probably, on the basis of what we have heard, Priti Patel should certainly be sacked. \n“She has gone round the back of the Prime Minister and has engaged in private diplomacy in an extraordinarily delicate issue concerning the armed forces. \n“I find it inconceivable that she could stay in the Government.” \nSir Vince also said the Prime Minister should sack Foreign Secretary Boris Johnson after he wrongly claimed a British mother imprisoned in Iran had been training journalists there.He said: \n“If Priti Patel has to go I find it difficult how he (Boris Johnson) can stay, because what he did in his casual and unscripted, thoughtless comments about a young woman who is currently in prison in Iran was absolutely unforgivable. \n“The old adage that careless talk costs lives applies above all to Britain’s chief diplomat.” (Image: Newcastle Chronicle) 17:53 May facing cabinet chaos \nThe question marks over Priti Patel’s future as International Development Secretary have added to the sense of turmoil surrounding Theresa May’s Cabinet. (Image: PA) \nIf Ms Patel is sacked on her return to the UK from Africa, she would become the second member of the Prime Minister’s top team to lose their job in a week, after Sir Michael Fallon walked the plank last Wednesday over allegations of improper advances to female journalists. \nMrs May presented herself at the June general election as the “strong and stable” candidate, but critics say that events since then have exposed a weakness and inability to impose authority on a fractious and divided Government. \nAn expected reshuffle following the Conservative annual conference failed to materialise, as the PM found herself buffeted between the demands of rival sides of her party for the heads of Chancellor Philip Hammond or Foreign Secretary Boris Johnson. \nAnd the sexual harassment scandal swirling around Westminster has cost her one loyal supporter and raised doubts about the future of other Government members. 17:51 Who could replace her? \nIf Priti Patel loses her Cabinet job it would leave Theresa May facing a tricky second reshuffle in successive weeks.The Prime Minister faced a backlash after replacing Sir Michael Fallon as Defence Secretary with Gavin Williamson and will hope that her latest enforced change is met with a more positive response from the Tory ranks. \nThe Press Association have compiled a list of some of the potential contenders for the International Development Secretary post: Sir Alan Duncan \nCurrently Boris Johnson’s deputy in the Foreign Office, Sir Alan was at Oxford University at the same time as Mrs May and preceded her husband Philip as president of the Oxford Union. He has previously been a minister in the Department for International Development (DfID). As a Remain supporter, his appointment could upset Brexiteers. Penny Mordaunt \nThe Work and Pensions Minister had been viewed as a contender for the Defence Secretary role and would give Mrs May the opportunity of replacing Ms Patel with another female Brexit-backer, maintaining the sensitive political balance in Cabinet and the current split in terms of male and female ministers. The Portsmouth North MP wore her swimsuit to appear on ITV diving competition Splash in 2014 to raise money for charity. Rory Stewart \nA former soldier, diplomat and writer, the Penrith and the Border MP’s life has been so colourful that Brad Pitt’s production company reportedly bought the rights for a biopic. Currently a joint DfID and Foreign Office minister, Mr Stewart had a short stint as an officer in the Black Watch before a diplomatic career which saw him become deputy governor of two provinces in Iraq following the 2003 invasion. Backed Remain in the EU referendum. Anne Milton \nShe has held frontbench roles in opposition and government since 2006, rising to Minister of State in the Department for Education, and could be viewed as having the necessary experience for a Cabinet job. The Guildford MP did not disclose which side she supported during the EU referendum battle. Alistair Burt \nA veteran with a ministerial career which began under John Major. He is currently a joint DfID-Foreign Office minister and was sent out to respond to MPs’ questions on Ms Patel’s controversial “holiday” to Israel on Tuesday while his boss flew to Africa for her soon-to-be-curtailed trip. Backed Remain in the referendum. Theresa Villiers \nResigned from government when Mrs May took office and replaced her as Northern Ireland secretary, offering her a more junior role instead. A prominent Brexit-backer, a return to the Cabinet would help maintain the current balance in Mrs May’s top team. 17:49 Thousands track Priti Patel's flight \nSo, this is what it’s come to. \nThousands of people watched the progress of Priti Patel’s flight from Nairobi as she flew back to Britain under orders from Prime Minister Theresa May. \nFollowing the news of Ms Patel’s return, website Flightradar 24 reported on Twitter that more than 22,000 people were tracking the Boeing 787-8 Dreamliner’s flight on its site, although it was not absolutely certain Ms Patel was aboard the KQA100 Kenya Airways flight to Heathrow. \nUsually flights on the website are tracked by one to 200 people. \nTwitter users tweeted their thoughts on the flight tracker, comparing it to watching OJ Simpson attempt to outrun police in his car in 1994, or tracking Santa around the globe on Christmas Eve. 17:48 KEY EVENT Who is Priti Patel? \nWatch our video explainer all about the International Development Secretary and the scandal that has engulfed her and Theresa May’s embittered government: More On", "external_links": [], "published": "2017-11-08T19:45:00.000+02:00", "crawled": "2017-11-08T20:58:17.003+02:00", "highlightTitle": ""}