{"organizations": [], "uuid": "f9ffcbfef5618da7ee1982d508b547a32a2143d4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article839671.ece/ALTERNATES/s1200/JS129157965.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/news/uk-world-news/tory-minister-grilled-piers-morgan-839543", "country": "US", "domain_rank": 48128, "title": "Tory minister grilled by Piers Morgan for refusing to answer 'yes or no' - even to his name - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.14, "site_type": "news", "published": "2017-11-27T17:31:00.000+02:00", "replies_count": 0, "uuid": "f9ffcbfef5618da7ee1982d508b547a32a2143d4"}, "author": "Mikey Smith", "url": "http://www.leicestermercury.co.uk/news/uk-world-news/tory-minister-grilled-piers-morgan-839543", "ord_in_thread": 0, "title": "Tory minister grilled by Piers Morgan for refusing to answer 'yes or no' - even to his name - Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "piers morgan", "sentiment": "negative"}, {"name": "greg clark", "sentiment": "none"}, {"name": "margaret thatcher", "sentiment": "none"}, {"name": "morgan", "sentiment": "none"}, {"name": "clark", "sentiment": "none"}, {"name": "tunbridge wells", "sentiment": "none"}, {"name": "susanna reid", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "reid", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}], "organizations": [{"name": "european union", "sentiment": "none"}, {"name": "university of birmingham's institute of translational medicine", "sentiment": "none"}, {"name": "piers morgan", "sentiment": "none"}, {"name": "council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nA Tory minister appearing on TV this morning wouldn't answer yes or no even to confirm his own name. \nBusiness Secretary Greg Clark was taken to task by Piers Morgan on Good Morning Britain. \nHe is launching the Government’s new industrial strategy and was appearing on the show to publicise this. Business Secretary Greg Clark speaks at the launch of the life sciences industrial strategy at the University of Birmingham's Institute of Translational Medicine, in Birmingham. \nBut the MP for Tunbridge Wells became stuck in a series of Brexit questions and his evasive answers appeared to frustrate Morgan. \nClark refused to answer whether he would vote for Brexit if there was another referendum, saying it was a “hypothetical question that I haven’t given a moment’s thought to.” \nHost Susanna Reid asked him if Brexit was the best thing for the UK, he again failed to give a straight answer, saying: “I believe that we have to get the best deal through these negotiations and I think it’s possible to do that.” Read More Are you killing your dog with kindness? Here's how much you SHOULD be feeding your pets \nMorgan asked him if that was a ‘yes’, to which he repeated: “I think we can get a good deal. It’s in everyone’s interests to get a good deal.” \nFinally, Morgan challenged the Tory minister to give a straight, yes or no answer to one question - “the allegation that you are named Greg Clark.” \nAfter some laughter, and a long, uncomfortable pause, Clark said: “Well, I think you’ve got that.” \nMorgan seemed satisfied with his answer, saying: “We’ve established at least one convincing answer.” Read More Is this the end for Leicester’s dingiest alley? Council reveals £1.5m plan to open up city \nBut Reid was left unconvinced, adding: “I’m not sure we did. I think there was room for doubt there.” \nThe Government says their new industrial strategy, published today, aims to intervene in key sectors to tackle dreary productivity forecasts and bolster businesses to counter any new problems caused by Brexit. \nTheresa May first flagged the plan in January, seven months after Britain voted to leave the European Union, adopting a hands-on approach to business that had largely been abandoned by her predecessors from the time of Margaret Thatcher in the 1980s. Read More ", "external_links": [], "published": "2017-11-27T17:31:00.000+02:00", "crawled": "2017-11-28T09:47:50.003+02:00", "highlightTitle": ""}