{"organizations": [], "uuid": "c6aec8512f510673fba15ece7c99bc0f9bfd368e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13886002.ece/ALTERNATES/s1200/GLP_SAH_WK170879_43JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/how-your-wages-compare-your-13885860", "country": "GB", "domain_rank": 21960, "title": "How do your wages compare to your neighbours? North East earnings revealed", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-12T10:00:00.000+02:00", "replies_count": 0, "uuid": "c6aec8512f510673fba15ece7c99bc0f9bfd368e"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/how-your-wages-compare-your-13885860", "ord_in_thread": 0, "title": "How do your wages compare to your neighbours? North East earnings revealed", "locations": [], "entities": {"persons": [{"name": "sam smethers", "sentiment": "none"}], "locations": [{"name": "north west", "sentiment": "none"}, {"name": "greater manchester", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "south tyneside", "sentiment": "none"}, {"name": "hertfordshire", "sentiment": "none"}, {"name": "north tyneside", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "tees valley", "sentiment": "none"}], "organizations": [{"name": "office for national statistics", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}, {"name": "surrey advertiser", "sentiment": "none"}, {"name": "fawcett society", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "kpmg", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News How do your wages compare to your neighbours? North East earnings revealed Official figures tell us how much the highest earners, lowest earners and people right in the middle get paid Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nHow much do other people get paid? \nIf you’ve ever wondered, you’re in luck. \nBecause a Government body has just published a detailed breakdown of what people earn. \nIt shows how salaries differ across the country. \nAnd it exposes the large gap in pay between men and women. \nIt’s called the Annual Survey of Hours and Earnings and it’s published by the Office for National Statistics, the UK’s official statistics agency. \nIn the North East, the median salary for a person with a full time job is £26,095 a year. Bank notes (Image: Surrey Advertiser) \nThat’s the total amount, so it includes any bonuses or overtime pay. \nMedian means that if you lined up everyone with a full time job in order of their salary and pointed to the person right in the middle, you’d be pointing at someone who earns £26,095 a year. \nAnother way of looking at it is that half of full time workers earn less than £26,095, and half earn this much or more. Read More Ofsted results for North East schools: How do inspectors say they are performing? \nNorth East in this case means County Durham, Gateshead, Newcastle , North Tyneside, Northumberland, South Tyneside and Sunderland. \nIf you earn £34,070 a year in the North East then you are in the top 30 per cent of full-time workers. In other words, less than a third of people with full-time jobs earn this much. \nAnd if you earn £40,000 a year in the region then you’re in the top 20 per cent. That’s the top one in five. \nA significant number of people in the region earn less than £20,000 a year. In fact, 25 per cent of North East workers with full time jobs - a quarter of the total - have a total salary of £19,632 or less. The view of the Newcastle/Gateshead Quayside from the offices of KPMG (Image: Newcastle Chronicle) \nSalaries can vary depending on where you live. \nWhile the median full time North East salary is £26,095 a year, it’s a bit lower in Tees Valley at £25,844. \nIt’s a little higher in the North West. In the area known as Greater Manchester, the figure is £26,315. \nWages are higher in London and the surrounding area. The median full time salary in Hertfordshire, just north of London, is £34,199. \nBut the difference is biggest at the top of the pay scale. \nThe top ten per cent of full-time employees in the North East are paid £49,556 a year or more. \nBut the top ten per cent in London get £79,089 a year or more. \nEven within regions, there are significant differences. \nThe best-paid place in the North East is North Tyneside, where the median salary for a person with a full time job is £28,011. \nThe lowest wages are in Sunderland , where the figure is £24,951. \nThese statistics just show what people are paid. They don’t take into account the jobs they are doing. \nSo it’s possible that a shop worker in one place is paid exactly the same as a shopworker in another place. The difference might be that one area has a lot of low-paid shopworker jobs while another has more well-paid skilled engineering jobs. \nThe statistics also reveal the gap between what men and women earn. Read More \nThe median wage for full time male employees in the North East is £28,087 a year. \nBut for women, it’s £23,410. \nThat’s a wage gap of £4,677 a year. \nAgain, this doesn’t mean that women and men are being paid different amounts for doing exactly the same jobs. \nBut just because the reasons are more complex doesn’t make it acceptable, say campaigners such as the Fawcett Society. \nIt says that simple discrimination is one factor. Others include a tendency to undervalue roles predominantly done by women, the dominance of men in the best paid positions and unequal caring responsibilities. \nThe Fawcett Society has run a campaign, backed by many MPs, to highlight the issue. It named Friday November 10 Equal Pay Day, on the basis that women effectively stop being paid on this day, if their labour is equal in value to men’s. Read More Secret Brexit papers revealing impact on the regions may never be published \nSam Smethers, Fawcett Society Chief Executive, said: “The pay gap is widest for older women as it grows over our working lives but we are now seeing a widening of the pay gap for younger women too, which suggests we are going backwards and that is extremely worrying. \n“At a time when we are breaking the taboo of talking about sexual harassment in the workplace we need to wake up to the fact that a culture which tolerates or even fosters sexual harassment isn’t going to pay women properly either, and we know that younger women are particularly likely to experience harassment.” Like us on Facebook", "external_links": [], "published": "2017-11-12T10:00:00.000+02:00", "crawled": "2017-11-12T10:11:02.000+02:00", "highlightTitle": ""}