{"organizations": [], "uuid": "15815a1593a85af19ce2bcadb0831537ad9467e8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article232492.ece/ALTERNATES/s1200/Leicester-City-fans.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/news/business/leicester-one-best-places-britain-746355", "country": "US", "domain_rank": 48128, "title": "Leicester is officially one of the best places to live in Britain - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.605, "site_type": "news", "published": "2017-11-09T07:00:00.000+02:00", "replies_count": 0, "uuid": "15815a1593a85af19ce2bcadb0831537ad9467e8"}, "author": "Tom Pegden", "url": "http://www.leicestermercury.co.uk/news/business/leicester-one-best-places-britain-746355", "ord_in_thread": 0, "title": "Leicester is officially one of the best places to live in Britain - Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "boden", "sentiment": "none"}, {"name": "paul norbury", "sentiment": "none"}, {"name": "peter soulsby", "sentiment": "none"}], "locations": [{"name": "leicester mercury news leicester", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "king power stadium", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}, {"name": "invalid email  leicester", "sentiment": "none"}, {"name": "midlands", "sentiment": "none"}, {"name": "braunstone frith", "sentiment": "none"}, {"name": "newcastle share leicester city", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "east midlands airport", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "east midlands", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}, {"name": "glenfield", "sentiment": "none"}], "organizations": [{"name": "e.on", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "samworth brothers", "sentiment": "none"}, {"name": "barratt developments", "sentiment": "none"}, {"name": "pwc", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Leicester is officially one of the best places to live in Britain When it comes to growth, the city outperforms far bigger rivals such as London, Manchester, Birmingham and Newcastle Share Leicester City fans (Image: Plumb Images) Share Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nLeicester is one of the best places to live in Britain for key aspects of life such as jobs, health, wages, skills and housing. \nWhen it comes to growth, the city is outperforming far bigger rivals such as London, Manchester, Birmingham and Newcastle. \nIn fact, according to national accounting firm PWC’s latest annual index of economic wellbeing, the Midlands as a whole is steadily narrowing the gap with south-east England. \nThe PWC report looks at factors such as health, housing affordability and quality of life, as well as jobs, skills and incomes to work out which cities are doing well. \nIt placed Leicester in third place nationally when it comes to most improved city, and ninth overall. \nLeicester Mayor Sir Peter Soulsby said: \"This survey is excellent news though I’m not surprised. \n\"Over recent years a lot of public sector energy and funding has gone in to making Leicester an attractive place to visit, to live and to invest. \n\"Sometimes this has been very controversial – but it is paying off many times over in business confidence, investment and jobs.\" \nPWC said growth across the board had been underpinned by strong employment within the city and surroundings, which had continued despite the uncertainties following the Brexit vote . \nOnly last month, national energy supplier E.ON said it needed up to 100 more full-time customer service staff at its Leicester operation, near the King Power Stadium. \nMeanwhile, Samworth Brothers said it hoped to create 120 jobs at its new £12 million food distribution hub in Braunstone Frith, while online fashion chain Boden hopes to create 200 jobs at its new warehouse just outside the city in Glenfield. \nHowever the report warned that the price of success was being seen in reduced housing affordability and longer commuting times, while there was still a “critical need” for local industrial strategies that address housing, transport and skills gaps. \nFor instance, Leicestershire-based national housebuilder Barratt Developments recently announced the average selling price of its homes had risen by 6 per cent to £275,200, up from £259,700 last year. King Power Stadium (Image: Plumb Images) \nPaul Norbury is PwC’s senior partner for the East Midlands, based at the Leicestershire offices next to East Midlands Airport. \nHe said: “The Good Growth for Cities Index, is great news for the East Midlands region. \n“ Leicester , Derby and Nottingham are performing at or above the UK average on all measures. \n“The region's economy is diverse and resilient, and it is great to see our cities performing so well in jobs, growth and quality of life measures. Read More E.ON needs 100 full time staff in Leicester - find out how to apply here \n“Delivering good growth cannot be achieved by any one person working alone, but goes hand-in-hand with place based transformation, where local government, central government and the private sector act together and work collaboratively, to facilitate local economic growth, prosperity and wellbeing.” \n“We’ve seen broad-based improvements in our good growth index across the Midlands, driven in particular by falling unemployment rates. \n“Some areas that had lagged behind in the recovery from the financial crisis are now showing clear improvements, so the recovery and some early signs of economic re-balancing are spreading across the UK and particularly in the same areas of the Midlands.” \n“However, we are also seeing the price of prosperity in terms of growing pressures on scarce resources of housing, transport and skills. If regional cities are to sustain the strong recovery and performance of recent years, it will be critical to address these challenges as part of cities’ growth strategies. \n“Key national and regional infrastructure projects combined with private sector development, such as HS2, will add momentum to the Midlands for the next decade.” Like us on Facebook ", "external_links": [], "published": "2017-11-09T07:00:00.000+02:00", "crawled": "2017-11-09T07:57:15.004+02:00", "highlightTitle": ""}