{"organizations": [], "uuid": "b34cae234279c6724979ec5ee3de1eef7f09098a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13946943.ece/ALTERNATES/s1200/DMR_NEC_130317tyne_01.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/north-tyne-devolution-heres-everything-13946878", "country": "GB", "domain_rank": 21960, "title": "North of Tyne devolution: here's everything you need to know about the announcement", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-24T12:30:00.000+02:00", "replies_count": 0, "uuid": "b34cae234279c6724979ec5ee3de1eef7f09098a"}, "author": "Sean Seddon", "url": "http://www.chroniclelive.co.uk/news/north-east-news/north-tyne-devolution-heres-everything-13946878", "ord_in_thread": 0, "title": "North of Tyne devolution: here's everything you need to know about the announcement", "locations": [], "entities": {"persons": [{"name": "tyne", "sentiment": "none"}, {"name": "nick forbes", "sentiment": "none"}], "locations": [{"name": "neca", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "south tyneside", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}], "organizations": [{"name": "ntca", "sentiment": "none"}, {"name": "department for international trade", "sentiment": "none"}, {"name": "newcastle city council", "sentiment": "none"}, {"name": "north east combined authority", "sentiment": "none"}, {"name": "north of tyne council", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Who could be the first North East Mayor? What will this mean for housing? \nThe establishment of a Housing and Land Board will allow the combined authority to acquire and dispose of land, agree a joint housing strategy and give the mayor the ability to issue compulsory purchase orders. \nIt’s hoped these powers will lead to more houses being built and getting it done more quickly. Will this help us out post-Brexit? \nThe council leaders certainly think so because the Department for International Trade has committed to work with the new authority to ensure North East trade thrives in a post-Brexit world. So far so good - does this mean we’re getting loads of good stuff from the government? \nIt could do. As part of the agreement, the government say the North of Tyne will have the ability to secure funding for pilots to boost employment and will get support to do things like improve broadband, help the digital economy and invest in low carbon energy. \nIn the words of Nick Forbes, the leader of Newcastle City Council , it will give the region “a seat at the table” and open up opportunities that weren’t there before. That all sounds like it’s going to cost a lot of money - will we be getting any? \nYes - the government has agreed to provide £600m over 30 years but the final sum could be a lot more. \nAccording to the Treasury, the deal will boost the local economy by £1.1 billion and attract £2.1 billion in private investment. So will this all be sorted out soon? \nNot exactly. The deal will have to go through a long process of being formally adopted and implemented and the NTCA won’t actually be set up until summer 2018. When will we elect the new mayor? \nElections for the new Mayor of the North of Tyne region will take place in May 2019. \nAn interim mayor will be appointed in summer 2018 until those elections take place. \nWe don’t know who’s going to run yet but it promises to be one of the most interesting political races in years. Hold on. Why are none of the councils south of the Tyne involved? \nIn short, they didn’t want to be. \nThere had been months of negotiations about a deal for all seven councils but those talks collapsed in 2016 because the other councils didn’t want to press ahead with it. \nThey felt the funding being offered wasn’t good enough and objected to the role of an elected mayor. \nWhat South Tyneside, Sunderland, Gateshead and Durham do in the future is up in the air but residents of those places won’t get to vote for the new mayor. \nBut the North of Tyne council leaders say the deal is good news for the whole North East and think up to 25% of the 10,000 jobs created will actually be south of the Tyne. Wait - don’t we already have a combined authority? \nKind of - we already have the North East Combined Authority but that doesn’t have a mayor or nearly as much power or funding. \nOnce the whole deal has been formally adopted by all the councils - which won’t happen until well into 2018 - the three North of Tyne councils will leave NECA and then it will be up to the other four councils south of the Tyne to decide what role the remainder of NECA will have. So what will happen to transport? \nThe transport functions currently carried out by NECA, which are probably its most important feature, will be taken over by a new joint committee which will include the NTCA and the rest of the councils. Like us on Facebook", "external_links": [], "published": "2017-11-24T12:30:00.000+02:00", "crawled": "2017-11-24T13:06:56.026+02:00", "highlightTitle": ""}