{"organizations": [], "uuid": "9b8fc9e7650b6666daf6bc892e8af15dffc18ff9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13045702.ece/ALTERNATES/s1200/IBP_NEC_160517labour_rally_13JPG.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/gateshead-labour-mp-explains-keynote-13902713", "country": "GB", "domain_rank": 21960, "title": "Gateshead Labour MP explains why he was a 'keynote speaker' at a rival party's conference", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-14T20:00:00.000+02:00", "replies_count": 0, "uuid": "9b8fc9e7650b6666daf6bc892e8af15dffc18ff9"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/gateshead-labour-mp-explains-keynote-13902713", "ord_in_thread": 0, "title": "Gateshead Labour MP explains why he was a 'keynote speaker' at a rival party's conference", "locations": [], "entities": {"persons": [{"name": "ian mearns", "sentiment": "negative"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "ed miliband", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "mearns", "sentiment": "none"}], "locations": [{"name": "gateshead", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "gateshead labour", "sentiment": "negative"}, {"name": "socialist coalition", "sentiment": "none"}, {"name": "tory", "sentiment": "none"}, {"name": "socialist party", "sentiment": "none"}, {"name": "tusc", "sentiment": "none"}, {"name": "trade union", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Gateshead Labour MP explains why he was a 'keynote speaker' at a rival party's conference Ian Mearns attended the recent Socialist Party event as it was an organisation Labour should 'engage with' Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily   Thank you for subscribing! Could   \nA Labour MP has explained why he was a keynote speaker at an annual conference organised by another political party. \nIan Mearns , who represents Gateshead , said he appeared at the event held by the Socialist Party as it was an organisation Labour should “engage with”. \nIt was once known as Militant which operated within the Labour Party before breaking away in 1991 and becoming a distinct party in its own right. \nIt is part of the Trade Union and Socialist Coalition (TUSC) , which has stood candidates in local and national elections in opposition to candidates from other parties including Labour. Ian Mearns (Image: Newcastle Chronicle) \nThe TUSC declined to stand candidates in this year’s general election, saying instead it was “working all out to try to get Jeremy Corbyn into Number Ten on 8th June”. \nMr Mearns said the TUSC was moving away from standing candidates against Labour, following the election of Jeremy Corbyn as the party’s leader in 2015. \nHe said: “They have stood candidates in some places. But that’s tended to dry up. \n“That is a work in progress from their perspective and they, like everyone else, are coming to terms with the changed political landscape.” \nHe added: “They are people on the left of politics. There are many things we have in common with them in terms of campaigning on particular issues. \n“So I think they are a group of people we should engage with.” \nThe event, called the Socialism 2017 conference, was held at a university venue in London and advertised as one for “students, trade unionists, Corbynistas, socialists and those who are socialist-curious”. Ian Mearns \nPublicity material listed Mr Mearns as a “keynote speaker”, describing him as a “Corbynist MP”. \nThe official Twitter account of the Socialist Party tweeted a photo of the MP addressing the event, and reported he said: “In the Labour Party nationalisation is no longer a dirty word and you know what, neither is socialism”. Read More Universities ask Government to help stop a Brexit brain drain happening \nA statement on the Socialist Party’s website before the election stated: “TUSC has continued to contest local elections against right-wing Labour councillors carrying out Tory cuts but it has not stood candidates - including this Thursday - against Labour politicians who have resisted austerity in the council chambers.” \nIt also said the TUSC supported “the election of a Corbyn-led Labour government”. \nIt marked a change from the policy before Mr Corbyn became Labour leader. The TUSC stood candidates in 135 constituencies in the 2015 general election and the Socialist Party website ran an article before polling day attacking Labour and Ed Miliband, the party’s leader at the time, saying: “Under Ed Miliband’s leadership the last vestiges of a working class voice within Labour have been destroyed.” \nIt continued: “The need for a new mass workers’ party that can provide a voice for the 99% against austerity has never been greater.” Like us on Facebook", "external_links": [], "published": "2017-11-14T20:00:00.000+02:00", "crawled": "2017-11-14T20:15:01.000+02:00", "highlightTitle": ""}