{"organizations": [], "uuid": "ab2cc69552cd0a6cba419569b140c024ac69ab90", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.hulldailymail.co.uk/incoming/article758510.ece/ALTERNATES/s1200/National-Lottery-balls.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/news/leicester-news/how-national-lottery-set-change-808804", "country": "US", "domain_rank": 48128, "title": "This is how the National Lottery is set to change in 2018 - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.099, "site_type": "news", "published": "2017-11-21T13:23:00.000+02:00", "replies_count": 0, "uuid": "ab2cc69552cd0a6cba419569b140c024ac69ab90"}, "author": "James Rodger", "url": "http://www.leicestermercury.co.uk/news/leicester-news/how-national-lottery-set-change-808804", "ord_in_thread": 0, "title": "This is how the National Lottery is set to change in 2018 - Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "jo taylor", "sentiment": "none"}, {"name": "camelot", "sentiment": "none"}, {"name": "railton", "sentiment": "none"}, {"name": "nigel", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "east midlands airport", "sentiment": "none"}, {"name": "camelot", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}], "organizations": [{"name": "national lottery", "sentiment": "negative"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "This is how the National Lottery is set to change in 2018 Its aim is to give players \"a better winning experience\" Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nDo you play the National Lottery? \nWell, operator Camelot has signalled changes to Lotto on the back of \"feedback from players\". \nThe operator said it is currently testing a number of options for changes next year to its best-selling game. \nIts aim is to give players \"a better winning experience\", all of which could be introduced without needing to change the \"price or number matrix\". \nIt announced the changes alongside a 3.2% drop in overall ticket sales on last year's first-half performance to £3.2 billion for the six months to September 23. \nIt follows total ticket sales falling 8.8% to £6.9 billion for 2016/17 from a record £7.5 billion the previous year. \nChanges to the Lotto draw in 2015 saw the number of balls increase from 49 to 59 and the chance of winning the jackpot decrease from one in 14 million to one in 45 million. Could you be celebrating a huge cash windfall? \nThe cost of playing EuroMillions increased by 50p to £2.50 a line and players had to choose from an extra number under changes introduced in September last year that decreased the odds of winning the jackpot but promised bigger prizes and double the number of UK millionaires. \nCamelot said it planned to position EuroMillions, Lotto and Thunderball as distinct products with \"prizes and prices to suit different needs and pockets\", the introduction of a Tuesday Thunderball draw in the new year \"to address the needs of players who value smaller, more frequent wins\" and the launch early next year of a EuroMillions HotPicks, a variation on Lotto HotPicks. Read More \"Brexit won’t stop East Midlands Airport expansion\" \nThere are also plans for shoppers to be able to buy National Lottery games at self-checkouts, as well as in discounters whose market share has grown considerably in recent years. \nCamelot chairman Jo Taylor said: \"Under Nigel's leadership, the new executive team at Camelot has recently concluded a thorough strategic review and designed a clear execution plan to put the business on a path to responsible and sustainable growth.\" Read More Huge £2.75million grant could transform popular Leicestershire woodland \nMr Railton said: \"Coming off the back of last year's disappointing sales performance -- and in the face of the very real threat posed by intensifying competition from the wider gambling sector, which benefits from significant taxation advantages, and continuing doubts over the economy - I don't underestimate the challenge ahead of us. It is going to take some time to turn things around. \n\"However, given the areas for improvement that we've identified during the strategic review, Camelot's impressive track record of success over the long term and the first-class team that I'll be working with, I firmly believe that we have an excellent platform to get the National Lottery back where it should be next year - in growth, creating more winners than ever before, and delivering even more money for the millions of people and thousands of communities for whom National Lottery funding is so crucial.\" Like us on Facebook ", "external_links": [], "published": "2017-11-21T13:23:00.000+02:00", "crawled": "2017-11-22T07:20:05.003+02:00", "highlightTitle": ""}