{"organizations": [], "uuid": "f827c45125e7b8bf2c21a5e99ad9914e6b266696", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article242670.ece/ALTERNATES/s1200/Andy-Cliffe-managing-director-of-East-Midlands-Airport.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/news/business/brexit-wont-stop-east-midlands-805894", "country": "US", "domain_rank": 48128, "title": "\"Brexit won’t stop East Midlands Airport expansion\" - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.197, "site_type": "news", "published": "2017-11-21T07:01:00.000+02:00", "replies_count": 0, "uuid": "f827c45125e7b8bf2c21a5e99ad9914e6b266696"}, "author": "Tom Pegden", "url": "http://www.leicestermercury.co.uk/news/business/brexit-wont-stop-east-midlands-805894", "ord_in_thread": 0, "title": "\"Brexit won’t stop East Midlands Airport expansion\" - Leicester Mercury", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "News \"Brexit won’t stop East Midlands Airport expansion\" Business Editor Tom Pegden finds out why EMA boss Andy Cliffe remains positive about the future - despite EU uncertainties Share Andy Cliffe, managing director of East Midlands Airport Share Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe boss of East Midlands Airport says is still confident of expansion over the coming years, despite the uncertainties of Brexit, writes Leicester Mercury Business Editor Tom Pegden. \nThe Castle Donington airport wants to double passenger numbers by 10 million a year within 20 years or less. \nIt also hopes to triple freight shipments to one million tonnes a year within 10-20 years. \nAirport managing director Andy Cliffe hopes the planned growth, alongside plans to grow the existing Pegasus Business Park next door and investment by companies such as UPS could lead to thousands of new jobs. \nAnd it is all under the shadow of complex Brexit negotiations which are yet to give any clear assurances to the aviation sector or, for that matter, to holidaymakers, importers, exporters, overseas workers and big UK employers. \nDespite that, East Midlands Airport finds itself on a solid footing whatever happens next. (Image: Getty) \nIn the last five years, it has invested £50 million including a new £15 million runway last year and £16 million of terminal improvements in 2014. \nLast year, DHL opened a £90 million extension to its huge depot on the site, while UPS want to build a similar-sized depot there creating more than 1,000 jobs. Read More \nIn fact, the airport has just had its busiest summer since 2008 with 3.3 million passengers in the six months to September 30. \nThe annual passenger figure is just under 4.7 million. \nIn its most recent accounts, revenue grew by 3.6 percent to £62.4 million. \nHowever, Mr Cliffe said the current politician situation was providing little confidence for big businesses, particularly those with overseas operations. \nRenegotiating flight routes into and out of Europe, for instance, is one of many big issues that still need to be addressed. \nThen there are EU workers’ rights, customs and duty arrangements, border security or the impact Brexit could have on the millions on pounds worth of cargo shipments passing through the airport to and from Europe each week. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nMr Cliffe, who becomes regional chair of the CBI in January, said: “The uncertainty is the critical issue with Brexit. \n“Uncertainty is something that, collectively as an aviation industry and more broadly within industry, needs addressing. \n“The other thing we are having to think about is the actual risk to flights under a ‘no deal’ Brexit. \n“There are no World Trade Organization regulations to fall back on, like there are in some other sectors. \n“We need a bespoke agreement for flight routes between the UK and Europe and vice-versa. \n“We come out [of the EU] in March 2019, and that doesn’t give us long to get it resolved. \n“It’s entirely possible that there are discussions going on. (Image: Shawn Ryan) \n“On the EU side they have some sense of how this might pan out, but dialogue may not start until next year so there’s going to be quite a lot to sort out. \n“In a more broader sense, I will be covering the CBI regionally from January, and the uncertainty out there is hugely damaging. \n“There are increasing numbers of businesses now starting to activate ‘no deal’ plans and lots of examples of firms trying to hire overseas talent with people saying they may not take the job because they may not be able to remain here in 18 months time. \n“We employ about 600 people here and the whole site employs around 7,000 people, so this is probably the biggest single employment site in Leicestershire. \n“There are a whole range of nationalities employed here. That seems to be OK at the moment, but it is something we are concerned and worried about as we look forward.” \nMr Cliffe said it was difficult to say how passengers might be affected by the changes – but as a principally European airport, East Midlands would have to adapt. \nHe said: “Until the arrangements are defined, it’s very possible that there is going to be an impact on queues and customer service.” \nHe said the Operation Stack queues on the M20 illustrated what happened elsewhere when things went wrong. \nBut Mr Cliffe still has a positive outlook. \nHe said: “There are still very positive growth conversations at the airport. \n“UPS has recently submitted £100 million plans for a new parcel distribution facility here. \n“That’s a significant addition to what they already have at the airport and we take transatlantic flights for those guys and from all over Europe. \n“DHL have their extension, while on the passenger side we are still in growth mode. \n“I would describe this as a time of enormous opportunities, but at the same time some of the risks are very significant.” Read More Fancy a white Christmas? Read these money saving hacks for booking flights over the festive season \nHe said he expected passenger figures next summer to be on a par with 2017, while most carriers that use the airport have expanded. \nMr Cliffe said: “There are reasons to be cheerful, and we all need to be positive in our outlook. \n“We have live growth conversations in a number of areas that give us a positive outlook, but the risks are still there. Busy scenes at East Midlands Airport \n“Plans to expand the Pegasus Business Park are still there. \n“That can double in size and could even expand beyond that. \n“It is the perfect location. It is principally professional services now, but it could have advanced manufacturing because there is so much happening in that area with the likes of Leicester and Loughborough universities. Read More Leicester is officially one of the best places to live in Britain \n“There is also biomedicine in Nottingham and the transport and automotive sector in Derby – there are huge opportunities out there. \n“And you can start to see ingredients to growing freight with the recent DHL expansion and UPS’s plans. \n“Those are positive steps and part of the growth vision.” Like us on Facebook ", "external_links": [], "published": "2017-11-21T07:01:00.000+02:00", "crawled": "2017-11-21T07:40:41.011+02:00", "highlightTitle": ""}