{"organizations": [], "uuid": "52c501bb35a9b37cfdd84c3c92ab0878ea4e8fa8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13938957.ece/ALTERNATES/s1200/Chancellor-Leaves-Downing-Street-For-Budget-Speech.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/budget-2017-need-to-know-13932902", "country": "GB", "domain_rank": 21960, "title": "Everything you need to know about Budget 2017 is right here", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-22T17:38:00.000+02:00", "replies_count": 0, "uuid": "52c501bb35a9b37cfdd84c3c92ab0878ea4e8fa8"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/budget-2017-need-to-know-13932902", "ord_in_thread": 0, "title": "Everything you need to know about Budget 2017 is right here", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "News Everything you need to know about Budget 2017 is right here The key points from Phillip Hammond's 2017 Autumn Budget - and there's good news for the North East too Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily   Thank you for subscribing!   \nChancellor Phillip Hammond has delivered his Autumn 2017 Budget statement - and it included plans to help people afford a home, money for the NHS and improvements to the Government’s controversial Universal Credit policy. \nSo what did we learn from the Budget ? He's remembered the North East \nCredit where it’s due, the announcement of £337 million to pay for new Tyne and Wear Metro trains is good news. \nAnd there’s also £600 million over 30 years for the new “North of Tyne” combined authority, to be led by a directly-elected mayor. \nThe Chancellor is worried about the cost of buying a home \nMr Hammond’s big announcement was abolishing stamp duty altogether for all first-time buyer purchases up to £300,000. \nIt means an effective reduction of £5,000. Read More How social media reacted \nStamp Duty is only charged on properties which cost more than £125,000, which means that this will help people in areas where prices are high but may not provide help in places where housing is cheaper - so it’s unclear whether it will help many people in the North East. \nMr Hammond also announced plans to provide at least £44 billion of capital funding, loans and guarantees over five years to get more homes built. \nThis will deliver 300,000 net additional homes a year on average by the mid-2020s, Mr Hammond said, calling it “the biggest annual increase in housing supply since 1970.” \nBut he said the Government would focus on “making best use of our urban land” - and not make it easier to build on the green belt. It's good to have a mayor \nA new £1.7 billion “Transforming Cities Fund” will pay for local transport schemes. \nHalf the money will go to the areas with elected metro mayors while cities across England will be invited to bid for the rest. \nIn other words, you’re more likely to get the cash if you have a mayor. Read More North East business leaders welcome Budget announcements on devolution and Metro \nIt may be good news for the three “North of Tyne” councils, Newcastle, North Tyneside and Northumberland, who are to create their own combined authority, led by a mayor. \nBut it’s not so good for places like Sunderland, South Tyneside, Gateshead and County Durham, which aren’t getting one. He's listened to concern about Universal Credit \nThe Chancellor announced measures to try to stop people getting into debt when they start receiving Universal Credit, a new benefit. \nThe problem is that they have to wait six weeks for their first payment. In some cases, that means people can’t pay their rent and get into arrears. \nHe said the Government would remove the seven day waiting period applied at the beginning of a benefit claim - which basically means cutting the wait from six weeks to five. \nAnd he said any new Universal Credit claimant who currently gets Housing Benefit will continue to receive the Housing Benefit for two weeks. \nIn total, the Government is spending £1.5 billion to try to improve Universal Credit. There's more money for the NHS \nAn extra £2.8 billion for the NHS in England was announced. \nIt includes £350 million immediately, to allow trusts to plan for this winter, and £1.6 billion in 2018-19, with the balance in 19-20. \nOn top of money already announced, it takes the extra money into the NHS next year to £3.75 billion in total. \nAnd there was a hint that nurses will get a good pay increase in future. But austerity isn't over \nMr Hammond suggested austerity would continue, as he said: “Our debt is still too high, and we need to get it down.” The Government is ready for a bad Brexit \nAn extra £3 billion was announced for Brexit preparations - on top of the £700 million already allocated. \nThe Chancellor said the Government would make getting a deal with the EU a top priority. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nBut he added: “While we work to achieve this deep and special partnership we are determined to ensure that the country is prepared for every possible outcome.” \nIt suggests the Government is taking the prospect of leaving the EU without a deal seriously. We need more maths teachers \nMr Hammond announced £40 million to train maths teachers across the country and a “Maths Premium” for schools, giving them £600 for every additional pupil who takes A level or Core maths. \nThe Chancellor also said the Government would triple the number of trained computer science teachers to 12,000. There's no money for extra tax cuts \nThe Chancellor didn’t announce any new tax cuts or increases to the minimum wage, but instead he highlighted measures already taking place. \nThe National Living Wage (effectively the minimum wage for many workers) will rise 4.4% in April from £7.50 an hour to £7.83, handing full-time workers a further £600 pay increase. \nFrom April, the personal allowance for income tax will rise to £11,850, cutting taxes for many people, and the higher rate threshold to £46,350. Mr Hammond wants us all to have a very merry Christmas \nThe Chancellor announced higher taxes for “super strength” white ciders \nMr Hammond said: “Excessive alcohol consumption by the most vulnerable people is all too often through cheap, high strength, low quality products – especially so-called white ciders.” \nHe said the Government “will legislate to increase duty on these products from 2019”. But there's no increase on other booze taxes \nDuties on other ciders, wines, spirits and on beer will be frozen. Cheers! Like us on Facebook", "external_links": [], "published": "2017-11-22T17:38:00.000+02:00", "crawled": "2017-11-22T18:16:13.002+02:00", "highlightTitle": ""}