{"organizations": [], "uuid": "a43bbc0f9e3bbcdf1b6ce400ccc69cd0ad6af9fd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article242711.ece/ALTERNATES/s1200/Aerial-view-of-East-Midlands-AiportJPG.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/news/business/ups-wants-build-new-114m-793091", "country": "US", "domain_rank": 48128, "title": "UPS wants to build new £114m parcel depot near East Midlands Airport - and it could create OVER 1,000 jobs - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2017-11-20T13:30:00.000+02:00", "replies_count": 0, "uuid": "a43bbc0f9e3bbcdf1b6ce400ccc69cd0ad6af9fd"}, "author": "Tom Pegden", "url": "http://www.leicestermercury.co.uk/news/business/ups-wants-build-new-114m-793091", "ord_in_thread": 0, "title": "UPS wants to build new £114m parcel depot near East Midlands Airport - and it could create OVER 1,000 jobs - Leicester Mercury", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "'We need stricter airport alcohol rules' \nA design and access statement submitted as part of a planning application show the 24 hour operation could employ 936 people within two years and 1,392 within eight years. \nThe site, between the airport and M1 is next to Pegasus Business Park, and currently used for parking. Artist's impression of planned new UPS complex \nUPS documents say it would speed up its operations at the airport and provide it with room for growth. \nThe main hub would have more than 450,000sq ft of floor space. \nA smaller office building to the east of the main hub would have 28,000 sq ft of floor space. \nThe business is staying tight lipped about the plans, but documents submitted to North West Leicestershire District Council show it would include: \n• Parcel sortation and distribution \n• Offices, meeting rooms, training rooms, conference rooms \n• IT comms rooms, control room \n• Vehicle and aircraft maintenance facilities Read More Expansion and new destinations could be on the way at East Midlands Airport \nIn a statement a UPS spokeswoman said: “UPS is always looking to make strategic investments that provide opportunities to grow our business and to strengthen the services and solutions that we bring to our customers. \n“We can confirm that planning permission has been submitted for expansion of our operations at the East Midlands Airport. \n“Given that the planning stage is not finalised at this time, we are not able to provide further specifics.” Graphic of new UPS offices which it wants to erect next to vast new sorting and delivery complex \nEast Midlands Airport is already the UK’s busiest pure cargo airport, second only to Heathrow – handling more than 320,000 tonnes of flown cargo every year. \nThe airport hopes to triple freight shipments to one million tonnes a year within the next 10-20 years. Read More \nIt is already a UK hub for UPS, and provides support operations for TNT and Royal Mail. \nLast year DHL opened a £90 million extension to its huge depot on the site. \nAirport managing director Andy Cliffe said the whole site employs around 7,000 people – including 600 staff directly employed by the airport – and there were big expansion plans, despite the uncertainties of Brexit. \nHe said: “There are still very positive growth conversations at the airport – UPS has recently submitted £100 million plans for a new parcel distribution facility here. \n“That’s a significant addition to what they already have at the airport and we take transatlantic flights for those guys and from all over Europe. \n“DHL have their extension, while on the passenger side we are still in growth mode. \n“I would describe this as a time of enormous opportunities, but at the same time some of the risks [associated with Brexit] are very significant.” Read More ", "external_links": [], "published": "2017-11-20T13:30:00.000+02:00", "crawled": "2017-11-20T17:06:52.005+02:00", "highlightTitle": ""}