{"organizations": [], "uuid": "95b53b039d0cc8e29d0758458142be5293db2a58", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13765484.ece/ALTERNATES/s1200/SGP_NEC_151017ANGEL05JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/grim-up-north-what-life-13881333", "country": "GB", "domain_rank": 21960, "title": "Grim up North? This is what life in the region will look like by 2030", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-09T18:14:00.000+02:00", "replies_count": 0, "uuid": "95b53b039d0cc8e29d0758458142be5293db2a58"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/grim-up-north-what-life-13881333", "ord_in_thread": 0, "title": "Grim up North? This is what life in the region will look like by 2030", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "News Grim up North? This is what life in the region will look like by 2030 So-called 'millennials' are set to inherit the North but they will face huge challenges, according to think tank IPPR North Share The Angel of the North (Image: Newcastle Chronicle) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nA new generation is set to inherit the North - but they’ll face huge challenges including climate change, robots in the workplace and the need to provide social care to a growing population of old people. \nBut the North will also have advantages in the years to come, because it is home to many leading digital businesses and firms specialising in low-carbon technology. \nThis is the verdict of the annual “State of the North” report, published by leading think tank IPPR North. \nResearchers published predictions about life in the North of England in the 2030s, when the region will be run by so-called “millennials”. \nThese are people currently aged between 22 and 37. \nAnd along with so-called Generation Z, people currently aged 21 and younger, they will make up a majority of voters and the overwhelming majority of the workforce by 2030. \nThe report warns: “They will inherit a North rich in assets but poor in opportunity. Previous generations have hoarded economic power in central government: England has no regional government, unlike almost every other developed country, and central governments of all political colours have failed to invest in the North’s strengths. \n“Instead they have left this once-thriving region with creaking infrastructure and people, young and old, without the chance to thrive in a rapidly changing world.” \nBut it’s not all bad news. The Tyne Bridge and Sage Gateshead taken through a silhouetted High Level Bridge (Image: Newcastle Chronicle) The population will become older and more diverse \nPeople are living longer, but will spend more of their lives with health problems – and these problems will be more expensive to treat. \nAt the moment, the North has 3.35 people of working age for every person over the age of 65. \nBut by 2030, this is on course to fall to 2.6 people of working age for everyone over 65, according to IPPR North. \nThe North will also become more diverse. \nIn 2016, 4.1% of the population was non-white, but this is set to increase to 15% by 2030. \nAnd more people will live in rural areas. The population will rise everywhere, but it will rise more slowly in the big cities than in other parts of the North. The North suffers from low economic growth \nOne of the biggest challenges facing the North is low economic growth, which has contributed to poverty. \nIn 2014 the North’s economy was only 3.4% bigger in real terms than in 2005, while the country grew by 9.5% over the same period. \nThere are exceptions, and the economy of Greater Manchester grew up 9% during this period. \nBut the report warns: “The North has felt the consequences of this low growth, and of the recession especially. Post-recession employment only started to rise significantly in 2013, and has grown slower than all areas except Wales and Scotland since 2007; real wages are 3.3% lower than in 2007. \n“As a result, there are now 2 million working-age people living in households below the poverty line, 300,000 more than there were in 2003/4–2005/6.” Brexit could affect the North more than the south of England \nBrexit may have nearly twice the impact on the North’s GDP as it will on London’s. \nThat’s because the economies of northern regions are relatively more dependent on trade with the EU. \nThe good news is that employers in the North are less dependent on EU migrant workers than those in the south, so they’ll find it easier to cope if immigration falls once we leave the EU. \nThe report said: “This does mean that the North will be a little more sheltered from the migration consequences of leaving the EU, but there are likely to be challenges in particular industries and areas: the manufacturing industry is especially reliant.” Read More Secret Brexit papers revealing impact on the regions may never be published Robot in the workplace are a threat but could also create new jobs \nAcross the UK, an estimated 15 million jobs could be automated in the next 10 to 20 years. \nIPPR North warns that the North appears to be at higher risk of automation than other regions, with 47.8% of jobs in the region in threatened occupations. \nThe good news is that the North already leads the way in digital technology, and digital skills will be more vital than ever. \nIPPR North said: “Sunderland has the highest rate of digital tech business startups in the country, while Newcastle, Leeds, Liverpool, Manchester and Middlesbrough all have higher birth rates than the national average.” Video Loading Click to play Tap to play The video will start in 8 Cancel Play now The fight against climate change could also create jobs \nThe North can benefit from the fight against climate change, because it is a centre of low-carbon industries such as energy efficiency products and waste processing. \nIPPR North said: The North has a higher than average concentration of all sectors in the low-carbon economy, but especially in low-carbon electricity in the North West and the North East. \n“These strengths are underpinned by the North’s unique local assets, and specialisms in complementary sectors such as advanced manufacturing and data processing.” Read More The six reasons why Theresa May's Conservative government is a disaster Millennials will inherit huge challenges, say report’s authors \nReport author Luke Raikes and senior research fellow at IPPR North said; “In just over a decade the North’s millennials will make up the majority of the region’s electorate and more than two-thirds of the working-age population. \n“They already clipped Theresa May’s wings in this year’s General Election and will have no qualms in condemning the government’s watered-down plans for the North or the country. \n“They will inherit a number of huge challenges from the older generations. Climate change is likely to have severe effects, robots and automation could threaten their job opportunities, and they will have to pay for the care of older people who live much longer than ever before. \n“They didn’t cause these problems but they will have to find the solutions. \n“The North has some of the assets they need to do this, but they have been wasted and run down by central government over the last century. In this century the North’s millennials will take charge”. Like us on Facebook", "external_links": [], "published": "2017-11-09T18:14:00.000+02:00", "crawled": "2017-11-10T01:36:13.057+02:00", "highlightTitle": ""}