{"organizations": [], "uuid": "22a174732b93eee64287b28b4b21d6c1dd348cdb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.plymouthherald.co.uk/incoming/article722794.ece/ALTERNATES/s1200/Dairy-cows-2.jpg", "site_section": "http://www.middevongazette.co.uk/news.rss", "section_title": "devonlive - News", "url": "http://www.devonlive.com/news/news-opinion/opinion-fundamentals-affect-dairy-farming-722651", "country": "GB", "title": "Opinion: Fundamentals that will affect dairy farming after our EU exit", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-03T13:16:00.000+02:00", "replies_count": 0, "uuid": "22a174732b93eee64287b28b4b21d6c1dd348cdb"}, "author": "Athwenna Irons", "url": "http://www.devonlive.com/news/news-opinion/opinion-fundamentals-affect-dairy-farming-722651", "ord_in_thread": 0, "title": "Opinion: Fundamentals that will affect dairy farming after our EU exit", "locations": [], "entities": {"persons": [{"name": "pat tomlinson", "sentiment": "none"}, {"name": "david silverman", "sentiment": "none"}, {"name": "michael gove", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "philip wolfgang", "sentiment": "none"}, {"name": "richard austin", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}], "organizations": [{"name": "farmers", "sentiment": "none"}, {"name": "getty images", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Farmers, including those working in the dairy sector, will be among the hardest hit by Britain's decision to leave the European Union (Image: David Silverman / Getty Images) Share   Thank you for subscribing!   \nIt is over a year since the vote and we know nothing more about the impact of Brexit on the UK economy, let alone farming. A whole host of conjecture in the form of reports, articles and conferences has been produced but we have few tangible facts to go on. \nI doubt whether we will know much more for at least another year or two. It brings back memories of dairy farmers altering their businesses for what might happen to milk quotas on several occasions throughout their 30-year life. \nMy experience is that it is always best to manage a farming business for known facts, not “ifs, buts and maybes” – second-guessing policy makers is a form of gambling and so down to luck as to whether it makes you more or less money. Facing up to the future for dairy after Brexit should be based on facts, not guesswork, says Pat Tomlinson \nThere are three and a bit fundamentals that will impact farming’s fortunes as a result of Brexit: The price of what is produced; The costs of producing it; The availability of labour; Farming subsidies (the “bit”). \nIf we look at basic economics, the price of what is produced by UK farmers will largely be affected by supply and demand on a global level. Brexit will have no impact on world supply and demand for farm products. Read More Philip Wolfgang: Get clued up on farm tenancies and licenses to avoid falling into traps \nIt is true that it could make trading with some countries more expensive and it could also make trading with some others less expensive. In the absence of any tangible developments to the contrary, I am assuming that there will be no net impact on farm prices. \nAfter supply and demand, exchange rates will be the next major impact. For example, all the products we produce from farming in this country are produced by member countries of the euro currency group. If the pound devalues against the euro, our exports become more competitive and imports become more expensive – thus improving domestic prices. \nIt would probably be dangerous to rely on a long-term weaker pound to improve UK farm prices and the costs of farming are sadly affected the wrong way in that the devalued pound causes imported goods (protein feed, oil, machinery) to be more expensive. Dairy farming is a mainstay for the South West's agricultural economy (Image: Richard Austin) \nEU workers currently fill a large number of roles in dairy farming, which are varied and largely permanent. But post-Brexit, we could see access to that labour disappear. This could have a catastrophic effect on many UK farms, as without the EU labour, they would simply not operate – arguably the greatest challenge faced by British farmers at this time. \nThen comes “the bit” – subsidies. I think it safe to assume that the Basic Payment Scheme will disappear at the first possible opportunity (2022 – if this parliament lasts the distance) and recommend that any lowland farmer prepare for that eventuality. Michael Gove has made it clear that he wants future subsidies to be almost entirely directed to environmental impact not commercial farming. \nThe importance of subsidies was overplayed in the pre-Brexit debate in that it is not just the subsidies, it is the much wider political influence that farmers and farming have in the EU compared to the UK. Read More Roll out of safety training essential to keep next generation of farmers safe, charity urges \nFor many years, UK farmers have benefited from the lobbying influence of EU farmers in diluting the far-less-supportive stance repeatedly taken by UK governments towards our farmers. This will be the real (albeit intangible) loss for UK farming after Brexit. \nOf course, if the UK government did protect farmers from the threat of cheaper, lower-quality food imports that are produced with the benefit of significant subsidies, then we could probably live without the Basic Farm Payment. \nMy fear is that we will end up with no protection from such imports and no subsidies because cheap food in the UK will remain the preferred strategic objective rather than security of food supply and support of domestic production. Continued full access to all EU markets and more non-EU markets is one of Pat Tomlinson's requirements to ensure dairy farming's survival post-Brexit \nThis does appear to be quite a morose picture for UK farming but of course, nothing has been decided. I was comforted on a client’s farm (500 dairy cows) recently when we worked out that if the exchange rate impact was sustained and fully translated into milk price then income would improve by £95,000. The Basic Farm Payment was £60,000 so there could be a net benefit of £35,000. \nMy hope list for UK dairy farming post-Brexit is: Continued full access to all EU markets and more non-EU markets for all our products; A long-term devalued pound; Transparent pricing for what our farms produce to fully reflect market forces and exchange rate movements; Continued access to EU immigrant labour; A UK government that recognises and steers policy away from the dangers to UK farming of removing subsidies, while contemporaneously making our farmers compete on a different playing field for the same markets and the same products. \nTime will tell, and the safe message is to make decisions based on what you currently know, not what may or may not happen. Like us on Facebook", "external_links": [], "published": "2017-11-03T13:16:00.000+02:00", "crawled": "2017-11-03T13:28:51.003+02:00", "highlightTitle": ""}