{"organizations": [], "uuid": "11af1cbd08b23a6fc9f077ad497622347f31cbce", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13934452.ece/ALTERNATES/s1200/PRP_MGA_210717mgaQuorn_18JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/brexit-uncertainty-wont-stop-investment-13934237", "country": "GB", "domain_rank": 21960, "title": "Brexit uncertainty won't stop investment into Quorn and Cauldron foods, bosses declare", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-21T19:12:00.000+02:00", "replies_count": 0, "uuid": "11af1cbd08b23a6fc9f077ad497622347f31cbce"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/brexit-uncertainty-wont-stop-investment-13934237", "ord_in_thread": 0, "title": "Brexit uncertainty won't stop investment into Quorn and Cauldron foods, bosses declare", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Business Brexit uncertainty won't stop investment into Quorn and Cauldron foods, bosses declare The owners of the meat free foods made the comments as latest accounts were filed, showing a big growth in global sales Share Click to play Tap to play The video will start in 8 Cancel Play now Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe owner of meat free food brands Quorn and Cauldron has no plans to curtail investment plans to grow its name around the globe, despite the uncertainty of Brexit negotiations . \nMarlow Foods Ltd makes, distributes and sells a host of products under the Quorn and Cauldron names from sites including Billingham and Stokesley, employing more than 650 people. \nThe firm’s meat substitutes – which includes a gluten free and vegan range, sausages, mince and breaded and crispy coated foods – sell across the UK, Europe, Australia, South Africa, South East Asia and the US, with further markets set to come following the firm’s acquisition by Monde Nissin in 2015 in a £550m deal. \nDirectors at the firm said the uncertainty of Brexit makes it difficult to assess the future impact over future trade in Europe , but that it is continuing to assess the situation and has “no plans to limit our planned investment to grow our international business”. Quorn Foods, Stokesley \nThe comments come in latest accounts filed by Marlow Foods, covering 2016, in which directors add: “The board will continue to monitor and evaluate the situation as the future trading relationship with Europe becomes clearer”. \nEarlier this year Quorn CEO Kevin Brennan announced plans for a further £150m investment at the Billingham site, saying growth in Asia, Australia and the US will help the firm thrive whatever the results of EU talks. Read More \nThe accounts now published at Companies House show 2016 was a strong year for the business, with revenues growing 11.4% to £176.1m, while pre-tax profit rose 38% from £18.057m to £24.88m. \nOperating profit, however, dropped 9% from £27.5m to £24.8m. \nIn the UK, the business invested significantly in consumer and customer marketing activities, including advertising, to drive up sales growth in a UK food market which it said has seen little growth overall. \nInternationally all markets grew and volume growth in the US, the Nordics and Germany was especially strong, despite experiencing cost inflation in a number of areas. Read More Major makeover for top Newcastle office as Grade A supply dwindles \nA geographical breakdown of turnover shows the UK continues to account for the lion’s share of sales, taking in £136.7m in sales, up from £127.3m, but significant increases were seen in Europe, which grew from £20.3m to £24.05m, and the rest of the world, which rose from £10.4m to £15.3m. \nThis growth comes amid challenging conditions and growing competition, directors said. \nThe report accompanying the accounts said: “The UK food industry is highly competitive and the group’s brands face competition from both branded products and the own label products of multiple retailers. \n“The group also faces competition from a variety of products in international markets. \n“The group continued to invest to improve the efficiency and reliability of the supply chain and is making investments in capacity where required. The business invested in research and development projects to help protect its future competitive position.” Like us on Facebook", "external_links": [], "published": "2017-11-21T19:12:00.000+02:00", "crawled": "2017-11-21T19:39:18.005+02:00", "highlightTitle": ""}