{"organizations": [], "uuid": "092617bf9f41bd4cad38a8c6a58700f6eb76a675", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13874110.ece/ALTERNATES/s1200/Brexit.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/secret-brexit-papers-revealing-impact-13874083", "country": "GB", "domain_rank": 21960, "title": "Secret Brexit papers revealing impact on the regions may never be published", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-08T18:00:00.000+02:00", "replies_count": 0, "uuid": "092617bf9f41bd4cad38a8c6a58700f6eb76a675"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/secret-brexit-papers-revealing-impact-13874083", "ord_in_thread": 0, "title": "Secret Brexit papers revealing impact on the regions may never be published", "locations": [], "entities": {"persons": [{"name": "david davis", "sentiment": "negative"}, {"name": "hammond", "sentiment": "none"}, {"name": "catherine mckinnell", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "mckinnell", "sentiment": "none"}, {"name": "philip hammond", "sentiment": "none"}, {"name": "davis", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "treasury committee", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}, {"name": "committee", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "european union committee", "sentiment": "none"}, {"name": "newcastle north", "sentiment": "none"}, {"name": "department", "sentiment": "none"}, {"name": "department for international trade", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "home office", "sentiment": "none"}, {"name": "the treasury", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Secret Brexit papers revealing impact on the regions may never be published David Davis has promised to hand over data on the impact on sectors of the economy within three weeks, but we know the Government has more than this Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe Government has been forced to promise that it will hand over the results of studies looking at how Brexit will affect the UK’s economy. \nBut it has also analysed the effect Brexit will have on specific regions of the United Kingdom - and there’s a danger this information will remain hidden. \nBrexit Secretary David Davis has told MPs that the Department for Exiting the European Union (DExEU) will provide a House of Commons committee with information about the impact of Brexit on different sectors of the economy. \nIn a written statement, he said it would take time to “bring together this information in a way that is accessible”, but promised: “We currently expect this to be no more than three weeks.” An EU and a UK flag (Image: PA) \nHowever, this promise only seems to apply to the Government’s analysis of affect of Brexit on sectors of the economy, such as the automotive sector, retail sector, tourism and so on. \nWe know that the Government has more than that. \nChancellor Philip Hammond made it clear that there is also work looking at the impact of Brexit on different regions of the United Kingdom, when he spoke to the Treasury select committee on October 11. \nHe told MPs on the Committee: “The Treasury is working with DExEU, DIT [Department for International Trade] and the Home Office on a cross-departmental model to look to model different scenarios. It is a wholly new model that has been built to do that. It is ongoing work that is continually being refined.” \nThis appears to be a reference to the work that DExEU is now set partly to release. Mr Davis and other Ministers have always said that the work was carried out across departments. Catherine McKinnell (Image: Newcastle Chronicle) \nAnd it’s pretty comprehensive. Mr Hammond told the inquiry: “This is a model that looks at impacts on different parts of our economy, on different economies of the EU 27, and on sectors of economies in the EU 27, as well as third countries.” \nHe also said that the Government’s “model” has been used to consider the impact of Brexit on different regions of the UK. \nHere’s an exchange between Mr Hammond and Newcastle North MP Catherine McKinnell , a member of the Treasury Committee: \nMs McKinnell: “Okay, so what economic assessment has the Treasury undertaken of the impact of leaving the single market and customs union on different parts of the United Kingdom?” \nMr Hammond: “As I said earlier, we have a model that can look at sectoral impacts, as well as impacts on bilateral trade pairings with different countries.” \nMs McKinnell: “But not particularly regions of the UK?” \nMr Hammond: “Regions of the UK as well, yes.” \nMs McKinnell: “And has that assessment been undertaken?” \nMr Hammond: “Yes, we are constantly using this model. It is not a single assessment; the model is a working tool. We constantly use it to test different ideas and potential solutions. For example, output from that model will have informed some of the thinking that has gone into preparing the 14 papers that have been published.” Read More Westminster sleaze scandal could lead to 'historic' change in men's attitudes \nIt seems clear from Mr Hammond’s responses that the Government’s “model” is capable of looking at the impact on regions - and has indeed been used to do exactly that. \nThe Government may not have a handy report entitled “the effect of Brexit on the North East” sitting in a draw just waiting to be published. But it does have the information in some form. \nMinisters are being forced to publish their findings - or at least, to give information to the Commons Exiting the European Union Committee, which will then publish something - as a result of a motion approved by the House of Commons on November 1. \nUnfortunately, the motion specifically ordered the Government to hand over impact assessments arising from the analysis of sectors (retail, tourism etc). It said nothing about the impact on different parts of the country. \nIn the interests of transparency, perhaps Ministers should make regional data available too. Read More Treasury spends £6 on rail in London for every £1 in the North East \nBut transparency is not something the Government has shown much commitment to, given that it had to be forced by Parliament to publish anything of the data at all. \nMr Hammond told the inquiry: “We are not planning to publish this work. It is sensitive in the context of the negotiation. We have said from the outset that we will be as transparent as we can during this process.” \nWhile the House of Commons has forced the Government into a partial climbdown, it’s possible that analyses showing how Brexit will affect different regions of the UK will remain secret. Like us on Facebook", "external_links": [], "published": "2017-11-08T18:00:00.000+02:00", "crawled": "2017-11-08T19:00:24.000+02:00", "highlightTitle": ""}