{"organizations": [], "uuid": "ba1a87ca6eaf910d140e8e1a71badac85de0b3a7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13857821.ece/ALTERNATES/s1200/Kevin-Robertson.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/newcastles-legal-landscape-changing-real-13856654", "country": "GB", "domain_rank": 21960, "title": "Newcastle's legal landscape is changing but where is the real battle being fought?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-05T13:00:00.000+02:00", "replies_count": 0, "uuid": "ba1a87ca6eaf910d140e8e1a71badac85de0b3a7"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/newcastles-legal-landscape-changing-real-13856654", "ord_in_thread": 0, "title": "Newcastle's legal landscape is changing but where is the real battle being fought?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Newcastle's legal landscape is changing but where is the real battle being fought? Bond Dickinson has pulled off its coveted US merger, while other local firms are also evolving Share Kevin Robertson -Partner and Head of Office, Bond Dickinson LLP (Image: Mark Savage Photography) Share   \nThe creation of Womble Bond Dickinson has added a new dimension to the North East’s legal market place. Jonathon Manning explores how the region’s firms are handling their identity in a sector that is continuing to evolve \nIt isn’t often that a merger of law firms causes interest outside of legal circles. \nBut the creation of Womble Bond Dickinson raised eyebrows not just for the new firm’s unusual name, but for the creation of a global player in the legal market through the merger of Newcastle’s Bond Dickinson - still remembered by many in these parts as Dickinson Dees before its last marger - and US firm Womble Carlyle Sandridge and Rice. \nThe merger is the latest evolution of the city’s legal market, which now consists of local, national, and transatlantic firms. \nBut as Newcastle’s legal market grows, a battle has started to capitalise on the region’s local clients. This can be a particular challenge for the region’s biggest firms, who often want to be known as local while having all the benefits of being a multi-office giant. Read More Womble Bond Dickinson merger goes live creating £340m law firm \nWomble Bond Dickinson now has 24 offices spread across the UK and US, but one of its largest offices remains on Newcastle’s Quayside. Office head Kevin Robertson still sees himself as a local lawyer, but believe his new position inside a transatlantic firm will now allow him promote the North East to an even wider audience. \n“In addition to building the personal relationships and putting clients in touch with each other, part of my role as head of office is to promote this region to the US, to businesses we come in contact with, and to Womble Bond Dickinson partners,” he said. \n“When groups have come here we talk to them about the region, the history of the region, and what we as business have grown up with. It is interesting talking to them as Womble as a business have very much grown up in their regions too. \n“They are not a business that says: ‘We want to be in New York, we want to be in LA’. They are very much in their heartlands, where they have grown their business out of. But the synergy then with us, and the heritage of this office, means there is quite a lot of commonality there.” \nBond Dickinson’s merger does have the ability to help bring new business to the North East, especially from Womble Carlyle’s head office in Atlanta, which shares a similar manufacturing and digital economy as the region. \nThe similarities led to Atlanta and Newcastle becoming twinned cities in 1977, when then US president Jimmy Carter visited the UK. More recently, Newcastle tech giant Sage helped organise a visit from Atlanta mayor Kasim Reed to the North East, designed to once again promote trade between the two areas. \nBond Dickinson hopes its transatlantic merger has the potential to grow the North East’s economy, though for that to be successful it needs to work with businesses that are confident enough to export to the US. \nThe current economic climate and unpredictable foreign exchange rates may be enough to put many small business off international trade. When it comes to legal advice there is also a certain amount of intimidation that comes with walking into the huge international law firm. \nFor local businesses in the North East, the international players are not the only law firms in the market. Many have deliberately implemented a strategy that involves remaining fiercely independent to attract local clients. \nAs one the city’s biggest single office law firms, Muckle, has dedicated itself to the region, and believes that its competitors’ expansion has left it with a gap in the market. \nHugh Welch, senior partner at Muckle, said: “We value our independence, The partners here, who are owners, value that we are not answerable to London or New York. \n“There is now a very clear market position for us, in terms of our regional position, that no one else can fill.” Hugh Welch, Muckle LLP \nHe added: “I am absolutely convinced that there is enough work that we can win in the corporate and business market place in the broad North East to sustain our strategy for growth and profit generation.” \nMr Welch admits that over the years Muckle has attracted the attention of other firms that wish to enter the Newcastle market. He even goes as far as to say that Muckle considered merger opportunities, but in the end rebuffed their advances as they “didn’t add anything” to Muckle’s business. \nMuckle’s strategy is very much focused on helping local businesses and promoting the region. This corporate responsibility is embedded within its business plan, which sets out that the firm will support North East communities. Read More Legal giant Norton Rose Fulbright to create 100 jobs after Newcastle office launch \n“I think the vast majority of business owners also care about this region in the same way that we do,” says Mr Welch. \n“If we are providing them with the very best legal service, aren’t they going to gravitate to a firm with the same commitment to the region that they have got?” \nWhile Newcastle is now home to both international legal giants a single office local firms, it also holds the headquarters of a third type of law firm with a unique strategy. \nWard Hadaway is often keen to make itself known as a local law firm, though it also has offices in Manchester and Leeds. Though founded and based in Newcastle, it now sees itself as a firm that can service the whole of the North. Ward Hadaway managing partner Jamie Martin \n“You don’t need to be an economic genius to know that the North, from Liverpool across to Hull and Newcastle, is a potential economic entity,” says Ward Hadaway managing partner Jamie Martin. \n“We decided to service the whole of that, and we decided to have offices in those three cities.” \nHe added: “Just because we have an office in Leeds and Manchester doesn’t mean we are not committed to our clients in the North East. Many of our clients have activities in the North West. As long as you don’t lose sight of your marketplace, clients like to see ambition and success.” \nWard Hadaway’s reputation as a local firm came under scrutiny earlier in the year when it entered into merger talks with Weightmans. The deal ultimately fell through, but if it had been a success it would have seen Ward Hadaway transformed into a national firm, adding another nine offices to its business. \nBut for Mr Martin the merger would not have compromised its reputation as a local firm. \n“Weightmans is a Northern firm. Their headquarters are in Liverpool,” he said. “It would have changed the nuance of it in the sense that they have offices elsewhere and we are not in Liverpool. \n“But they have an office in Manchester and in Leeds. A merger with them was consistent with developing those two offices.” \nBoth Womble Bond Dickinson and Ward Hadaway have strategies that allow the firms to operate and grow locally, but also allow them to focus on other markets. \nIn the background however, competition for local work is still hotting up, and new-kid-on-the-block Square One Law is at the forefront of this increased competition. \nSquare One was founded in 2011 but has continued to expand year-on-year. It now has a headcount of around 70 members of staff and is understood to be on track to see its turnover hit £9m in its next accounts. Square One founding partner Ian Gilthorpe \nFounding partner Ian Gilthorpe claims that his firm’s success is a result of it choosing to operate differently from others in the market. This involved liaising with its clients to find out what they disliked about working with lawyers, and adapting the practice to suit their clients. By doing this Square One branded itself as a local firm from the outset. \nBut unlike Muckle, Square One Law does not seem content to keep itself to a single office, with Mr Gilthorpe hinting that the firm may expand its base of operations in the future, \n“We are doing an increasing amount of work on Teeside and I think that it is really interesting the way that the mayor and the combine authority are doing a great job at promoting Teeside,” said Mr Gilthorpe. \n“I think this is an area where we have an interest. Although at the moment we can cover it from here. But I am not ruling out broadening our base.” \nSquare One has also recently struck a strategic alliance with Brussel-based firm Kemmlers. The relationship is designed to help clients gain EU legal advice in the run up to Brexit. \nWith the region’s major law firms evolving and keeping an eye on growing competition from within the region and outside, expect more change in the legal market. Like us on Facebook", "external_links": [], "published": "2017-11-05T13:00:00.000+02:00", "crawled": "2017-11-05T14:46:00.003+02:00", "highlightTitle": ""}