{"organizations": [], "uuid": "8a7ecc092d1f75ed36fd7ea01fa7211d70ac0202", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13792761.ece/ALTERNATES/s1200/BELGIUM_EU_115488.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13878532", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: UK set to make day of Brexit 'crystal clear' in new law", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-10T10:00:00.000+02:00", "replies_count": 0, "uuid": "8a7ecc092d1f75ed36fd7ea01fa7211d70ac0202"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13878532", "ord_in_thread": 0, "title": "Business Breakfast LIVE: UK set to make day of Brexit 'crystal clear' in new law", "locations": [], "entities": {"persons": [{"name": "jonathon manning tyne", "sentiment": "negative"}, {"name": "barnier", "sentiment": "none"}, {"name": "jonathon manning hummus", "sentiment": "none"}, {"name": "stella creasy", "sentiment": "none"}, {"name": "peterlee", "sentiment": "none"}, {"name": "jonathon manning lakes distillery", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "mills", "sentiment": "none"}, {"name": "kerr", "sentiment": "none"}, {"name": "robin finley", "sentiment": "none"}, {"name": "jonathon manning brexit", "sentiment": "none"}, {"name": "burke", "sentiment": "none"}, {"name": "andrew", "sentiment": "none"}, {"name": "bakkavor", "sentiment": "none"}, {"name": "zf peterlee", "sentiment": "none"}, {"name": "david davis", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "jonathon manning", "sentiment": "none"}, {"name": "michel barnier", "sentiment": "none"}, {"name": "steve birkett", "sentiment": "none"}, {"name": "george guivalu nacewa", "sentiment": "none"}, {"name": "tyne", "sentiment": "none"}, {"name": "linda farish", "sentiment": "none"}, {"name": "andrew readman", "sentiment": "none"}, {"name": "lydur gudmundsson", "sentiment": "none"}, {"name": "bill", "sentiment": "none"}, {"name": "readman", "sentiment": "none"}, {"name": "jonathon manning buyers", "sentiment": "none"}, {"name": "nigel mills", "sentiment": "none"}, {"name": "jonathon manning durham", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "west denton shopping centre", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}, {"name": "bakkavor", "sentiment": "none"}, {"name": "gosforth", "sentiment": "none"}, {"name": "north sea", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "peterlee", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "morley wood", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "teesside", "sentiment": "none"}, {"name": "denton park shopping centre", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "cumbria", "sentiment": "none"}, {"name": "esg", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "cobalt business park", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "jersey", "sentiment": "none"}, {"name": "west denton", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "north east property  companies", "sentiment": "none"}, {"name": "lexo limited", "sentiment": "none"}, {"name": "m steel cycles", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "newcastle journal", "sentiment": "none"}, {"name": "morrisons", "sentiment": "none"}, {"name": "morrisons store", "sentiment": "none"}, {"name": "baupost", "sentiment": "none"}, {"name": "rmt accountants", "sentiment": "none"}, {"name": "tyne & wear", "sentiment": "none"}, {"name": "marks & spencer", "sentiment": "none"}, {"name": "rmt accountants & business advisors", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "trw", "sentiment": "none"}, {"name": "tesco", "sentiment": "none"}, {"name": "jonathon manning foreign", "sentiment": "none"}, {"name": "finance", "sentiment": "none"}, {"name": "kwasa super newcastle limited", "sentiment": "none"}, {"name": "border to coast pensions partnership", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "sainsbury", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "pension committee", "sentiment": "none"}, {"name": "rmt", "sentiment": "none"}, {"name": "zf group", "sentiment": "none"}, {"name": "land registry", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning Tyne & Wear councils invests £473m of their pensions fund in fossil fuel firms \nThe extent of North East councils’ investment in fossil fuel firms has been revealed after campaigners highlighted £473m from pension funds were invested in non-renewable energy companies . \nThe investment in coal, oil and gas companies, which represents 6.09% of the area’s total pension fund, has been criticised by climate change campaigners. \nA spokesperson for the Tyne and Wear Local Government Pension Fund, said: \nThe approach to investing the fund is set out in the pension committee’s investment strategy Statement. \nThis document covers the extent to which social, environmental and ethical considerations are taken into account in the selection, retention and realisation of investments. \nInvestment managers consider social, environmental and ethical issues as integral parts of their investment process and act accordingly where such issues may have a financial impact on investment. \nThe Investment Strategy Statement explains that the Pension Committee takes the environmental, social and governance (ESG) issues “very seriously”. ESG issues are ethical considerations that are taken into account when investing in a business, such as its carbon footprint. \nTyne & Wear is one of 12 pension pots that are overseen by the Border to Coast Pensions Partnership. The partnership also includes Teesside, Durham, Cumbria, and Northumberland among its members. \nOf the 12 funds Teesside relied the most on fossil fuels, investing 7.17% of its £3.8bn in non-renewable energy companies. Northumberland invested 6.85% of its funds in coal, oil and gas companies, Tyne and Wear 6.09% and Durham 3.72%. \nClimate change campaigner George Guivalu Nacewa said: \nWe need to keep fossil fuels in the ground. We no longer have time to talk. Now is the time to act. An oil rig in the North Sea (Image: PA) 9:01 Jonathon Manning Lakes Distillery hits £1m crowdfund target in two days - and now wants more \nLakes Distillery has smashed its £1m crowdfunding target in less than 48 hours and is now looking to raise even more cash to fuel its expansion. \nThe company, which has offices in Newcastle and its distillery in Cumbria, took to fundraising site Crowdcube earlier this week to raise cash to help it increase its production of single malt whisky and grow its business. \nThe company hit its target within two days and is now expanding its initial fundraising target to £1.75m to support further growth. \nFounder Nigel Mills said: \nIt was really pleasing to have raised the money 48 hours after it was announced to the public. \nIt’s quite common for people raising money to extend beyond the minimum. So if people are wanting to invest they can do so. \nLakes Distillery will use the additional cash to invest further in its whisky stock, which costs the business £1m per year. It will also allow it to push ahead with its growth plans, buy a new warehouse, and focus on its exporting activity. \nMr Mills added: \nWe are buying an 80,000sq ft warehouse in Cumbria where the whisky will be stored and where we will do the whisky blending. \nIt will create jobs. I am not sure how many at this stage, we have 85 members of staff at this point, but we will also create jobs as the sales of the brands grow. \nIn terms of job creation, as long as we continue to grow in the right way we intend to employ more people. \nAs well as storing the whisky, the new warehouse will also house a state-of-the-art laboratory that will be used to blend its brands of spirits. Nigel Mills, Chairman of The lakes Distillery (Image: Newcastle Journal) 8:55 Jonathon Manning Durham pub reopens after £100,000 investment \nA local Durham pub will reopen this afternoon after it received a £100,000 investment from Admiral Taverns. \nThe pub was formerly known as the Morley Wood but will now be called ‘The Brawns Den’, which is the pub’s original name. \nIts doors will open under new licensee Andrew Readman, who previously managed The Brawns Den. \nMr Readman said: \nI am thrilled to be back at The Brawns Den and I am incredibly excited by the opportunity to re-establish the pub as a hub for the local community. \nWe have developed a great quality customer offer with delicious food and an excellent range of beer and I’m looking forward to welcoming back both our regulars and some new faces when we reopen our doors on Friday. \nThe pub has received an internal and external refurbishment. It has also expanded its range of drinks and will now sell a range of cask ales, wines, and a new gin and whisky meny. \nThe Brawns Den will also serve food, hold a quiz every Thursday night, and will hold regular acoustic nights. \nSteve Birkett, business development manager for Admiral Taverns, said: \nIn Andrew we have a very experienced and dedicated licensee who is well respected in the area. From the start of our relationship he has had a very clear vision for the pub and we have been delighted to support him to bring that to life, putting his own unique stamp on this great pub business. \nThe transformation is really impressive and on behalf of the team at Admiral, I would like to congratulate Andrew and his team and wish them all the best for the grand opening night. A pint of beer (Image: PA) 8:50 Jonathon Manning Buyers sought for M Steel Cycles name and assets following historic firm's collapse \nBuyers are being sought who could continue the name of a historic Newcastle cycle shop which suddenly shut its doors . \nThe shutters came down at M Steel Cycles in Gosforth last month, 123 years after the firm first began trading. \nThe bike manufacturer and retailer, which has been a part of the fabric of the North East cycle scene for generations, had been trading as usual just a day before closing. \nNow the firm has been officially liquidated at a virtual meeting of creditors hosted by RMT Accountants, based in Gosforth, Newcastle, which revealed how the firm had battled to survive in a tough trading market, made more difficult by the rise of internet shopping. \nHowever, there is hope that the identity of the firm could be saved with RMT seeking people who want to buy the M Steel Cycles name or its assets. \nThe accountants also said every effort is being made to return bikes which had been in the shop for repair when it closed. \nLinda Farish, head of recovery and insolvency at RMT Accountants & Business Advisors, said: \nOver the last few years, the growth in the number of cycling retailers that has been driven by the popularity of the sport and the ever-increasing prevalence of internet buying has made it increasingly difficult for M Steel Cycles to hold its own. \nThe directors looked at every possibility to adjust the business to suit the evolving market, but these changes did not have a sufficient-enough impact on its cashflow situation, and on further investigation, it became evident that the business was no longer viable. \nThe directors had no alternative than to seek advice with regard the business’s financial position, and the decision was then made to commence liquidation proceedings which have sadly resulted in the loss of seven jobs. \nSince being instructed on 17 October, RMT Accountants has been working to maximise the available returns for all creditors, and we were confirmed as liquidator at a meeting of creditors held on November 7. \nWe are continuing to work with a number of creditors who have claimed Retention of Title to some of the stock held in the M Steel Cycles shop, and to also deal with asset realisations. Anyone interested in the M Steel Cycles name or assets should contact RMT for further information. The shutters are down at M Steel Cycles in Gosforth after 123 years (Image: staff photo) 8:45 Jonathon Manning Hummus maker regains appetite for stock market listing \nBakkavor, food supplier to a host of supermarket giants, has now decided to press ahead with a flotation, just a week after supposedly canning it due to market “volatility”.Exactly a week ago the company, which is also the UK’s biggest maker of hummus, said that “proceeding with the transaction would not be in the best interests of the company, or its shareholders, given the current volatility in the IPO market”.However, on Friday Bakkavor said that it is now embarking on an initial public offering (IPO) that will raise around £100m, value the firm at £1bn and see around 25% of its capital floated on the London Stock Exchange.It is understood that the group U-turned on its decision after discussions with investors.The new terms will also see the offer price slashed from a mooted 195p per share to 180p share.Bakkavor supplies Tesco, Sainsbury’s, Marks & Spencer, and Waitrose and claims to account for 30% of the UK market for freshly prepared meals, pizza and desserts.The firm’s Icelandic founders Agust and Lydur Gudmundsson and US hedge fund Baupost will retain a majority 75% stake following admission to trading next week, with institutional investors also set to join the share register.Simon Burke, chairman of Bakkavor, said: \nThe board and I are delighted to welcome our new shareholders. \nIt is particularly pleasing that our initial register has such a strong presence of well-respected long-term investors, reflecting an appreciation of the quality of the business and its long-term prospects. Bakkavor logo Jonathon Manning Foreign owned property in the UK \nTake a look at some of the buildings in the North East that are owned by overseas companies. 8:36 KEY EVENT Revealed: The multimillion pound deals which see overseas firms buy North East property \nCompanies registered overseas have been involved in some multimillion-pound property deals in the North East , newly released data shows. \nData released for the first time by the Land Registry has revealed that foreign-registered companies own properties in the region worth at least £568m - and likely far more. \nThe most expensive real estate bought by an offshore company in the North East was West Denton Shopping Centre and Morrisons Store in Newcastle, which was bought by Kwasa Super Newcastle Limited - registered in Jersey - for £31.6m. \nSimilarly, a unit in Cobalt Business Park in Newcastle was bought for £27.5m by Lexo Limited, a company which is registered in the Isle of Man. \nBut those deals could just be the tip of the iceberg as not all the ownership details released by the Land Registry disclose the purchase price. \nThere is no ban on foreign companies buying UK property, and no suggestion that these companies are doing anything wrong. \nBut while a UK individual or company will have to pay corporation tax when they make money selling commercial real estate, foreign companies do not. \nIt is estimated that a third of all commercial properties in the UK are owned by offshore companies - which are typically based in countries with more favourable tax regimes to the UK - and closing the loophole could raise between £5bn and £8bn in tax a year. \nLabour MP Stella Creasy, who has been leading a campaign to close the legal loophole on foreign ownership, said: \nIt’s not fair that when British businesses sell commercial properties \nthey pay tax on the gains they have made, but overseas companies don’t. \nThese eye-watering figures show it’s a tax loophole that’s costing British taxpayers billions of pounds, as these trusts pocket massive profits tax free - enough to fund a proper pay rise for public sector workers, or tackle the waiting lists in the NHS. \nMost other countries do tax these profits but our Government refused, voting down a recent amendment to the Finance Bill and saying it was too complicated for them to introduce. \nThis data shows we can’t let them get away with such paltry excuses for letting these foreign companies do this - British businesses deserve a level playing field and British public services deserve proper funding. Morrisons at Denton Park Shopping Centre in West Denton (Image: Newcastle Chronicle) 8:28 Jonathon Manning 70 new jobs to be created at Durham factory making cameras for driverless cars \nAround 70 new jobs are to be created with a £30m investment in a North East factory that makes cameras for driverless cars. \nGerman firm ZF Group already employs 880 people at its plant in Peterlee, County Durham , and wants to increase that to 950 by the end of next year as it looks to increase production to 10,000 units a day. \nZF - which in 2015 took over the TRW plant that had been in Peterlee since 1988 - will be recruiting engineers, production specialists and apprentices as it adds new production lines for the hi-tech cameras that are an essential part of driverless car technology. \nProduction at the plant currently stands at around 33,000 units each week, but the company wants to increase that to 70,000. \nPlant director Robin Finley said: \nThe team spirit of the people and their determination to continuously improve has made Peterlee an incredible success. \nThe contribution of many people has enabled our operations to grow and to meet the new opportunities that the introduction of automated vehicles presents. ZF is investing in the development of local talent at Peterlee, expanding its apprentice scheme and working with local education organizations to support the changing training needs of our workforce. \nZF is a global automotive parts company which employs more than 135,000 people in 40 countries around the world. \nIts Peterlee factory is one of only three ZF locations that produces in-car cameras which support driver assistance, automatic breaking and lane assitance functions. Each camera has around 420 components but takes only 23 seconds to assemble. Robin Finley, ZF Peterlee (Image: ZF Automotive) 8:21 Jonathon Manning Brexit can be reversed and voters 'should not be misled', article 50 architect says \nThe British people are in danger of being “misled” by Government claims that Brexit cannot be reversed, the architect of the Article 50 process is warning.Lord Kerr, the former UK ambassador to the European Union, will insist that Theresa May’s decision to send the letter triggering the Article 50 withdrawal process does not mean Brexit was inevitable. \nHe will say: \nWe can change our minds at any stage of the process. \nBrexit Secretary David Davis and the EU’s chief negotiator Michel Barnier will meet in Brussels on the second day of the latest round of talks before a crunch summit of European leaders next month which could decide whether to move on to the next stage of the process covering a future trade deal.Lord Kerr, who played a key role in drafting Article 50, the legal mechanism for a country to leave the EU, will use a speech in London to contradict the Government’s view that the process is irreversible now that it has begun.At an event hosted by the pro-EU Open Britain campaign the crossbench peer will say “we are not required to withdraw just because Mrs May sent her letter” to Brussels. \nThe fact is that a political decision has been made, in this country, to maintain that there can be no going back. \nActually, the country still has a free choice about whether to proceed. As new facts emerge, people are entitled to take a different view. \nAnd there’s nothing in Article 50 to stop them. \nI think the British people have the right to know this - they should not be misled. \nBefore his meeting with the Brexit Secretary, Mr Barnier said the moment was approaching for a “real clarification” of Britain’s position on issues like citizens’ rights, the Irish border and the UK’s financial settlement.If the EU27 agree next month that sufficient progress has been made on these issues, they will give a green light for negotiations to move on to the questions of trade and transition to a new post-Brexit negotiation. Lord Kerr", "external_links": [], "published": "2017-11-10T10:00:00.000+02:00", "crawled": "2017-11-10T11:41:11.031+02:00", "highlightTitle": ""}