{"organizations": [], "uuid": "42d1da964fe18c2ecc71034fa3ed20947f8f82fe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13899041.ece/ALTERNATES/s1200/England-school-league-tables.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/your-child-need-learn-mandarin-13898994", "country": "GB", "domain_rank": 21960, "title": "Why your child will need to learn Mandarin and Arabic after Brexit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-14T10:44:00.000+02:00", "replies_count": 0, "uuid": "42d1da964fe18c2ecc71034fa3ed20947f8f82fe"}, "author": "nechronicle", "url": "http://www.chroniclelive.co.uk/news/north-east-news/your-child-need-learn-mandarin-13898994", "ord_in_thread": 0, "title": "Why your child will need to learn Mandarin and Arabic after Brexit", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "none"}, {"name": "vicky gough", "sentiment": "none"}, {"name": "pippa morgan", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "pa", "sentiment": "none"}, {"name": "british council", "sentiment": "none"}, {"name": "cbi", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Why your child will need to learn Mandarin and Arabic after Brexit A report from the British Council has revealed Mandarin and Arabic will play a vital role in trade along with Spanish, French and German Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nMandarin and Arabic will be of key importance to the UK’s future prosperity after Brexit, according to a new report. \nThe nation will need the two languages, as well as European tongues including Spanish, French and German, in order to be “a major international trading partner beyond Europe”, it says. \nBut the British Council report warns that currently, the UK is facing a “languages deficit” and more must be done to upgrade the country’s skills. \nThe study identifies Spanish as the top language the UK will need once it leaves the EU, followed by Mandarin Chinese, French, Arabic and German - based on a range of economic, geopolitical, cultural and educational factors. Secondary school pupils (Image: PA) \nMandarin has moved up in importance since 2013, the last time the analysis was conducted to find the languages the UK needed most, taking second place, compared to fourth four years ago, while Arabic dropped slightly from second to fourth. \n“Brexit has given urgency to the UK’s quest to be a major international trading partner beyond Europe, while at the same time highlighting the importance of our continuing interconnectedness with our European neighbours,” it says. \n“Among the skills and capabilities the UK will need, an understanding of other cultures and languages will continue to be important for successful international relationships at all levels. \n“Both within and beyond Europe, we will need to reach out beyond English, not only to maintain and improve our economic position but to build trust, deepen international influence and cultural relationships, and to keep our country safe.” Read More Carmakers employing more than 16,000 warn Brexit could do huge damage to their businesses \nThe report says it is a concern that just over one in three Britons say they are able to hold a conversation in another language. \nOfficial figures have shown a continued drop off in French and German A-level entries this summer, while the numbers taking Spanish rose slightly. There were increases in entries for a number of other foreign languages, including Arabic, Chinese and Italian. \nAt GCSE , there was a 9.9% fall in entries for French this year, compared to last, with numbers plummeting by more than a quarter (down 26.5%) since 2010, while German saw a 13.2% fall compared to last year, and the numbers are down by more than a third (38%), since 2010. \nThe report calls for “a bold new policy” to improve foreign language learning, and suggests that languages be given the same priority as maths and science in schools Read More Parents, did you know how to find out if you're living on the same street as a paedophile? \nVicky Gough, of the British Council, said: “Languages are invaluable for a generation growing up in an increasingly connected world. If the UK is to be truly global post-Brexit, languages must become a national priority. There are few more important languages for the UK’s future prosperity than Spanish, Mandarin Chinese, French, Arabic and German. \n“At a time when global connections matter more than ever, it is worrying that the UK is facing a languages deficit. We cannot afford the apathy around the need for languages to continue and must champion these skills. If we don’t act to tackle this shortfall, we’re set to lose out both economically and culturally.” \nPippa Morgan, CBI head of education and skills policy, said: “Language skills are often a valuable asset to businesses that export around the world and for those young people equipped with modern languages, it can open up real opportunities. We need to find ways to encourage more students to take-up modern languages by showing just how useful it can be to their careers.” Like us on Facebook", "external_links": [], "published": "2017-11-14T10:44:00.000+02:00", "crawled": "2017-11-14T10:56:54.001+02:00", "highlightTitle": ""}