{"organizations": [], "uuid": "064be42e9922d001050ef736a95e976e09ca9de5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13957710.ece/ALTERNATES/s1200/JS115501421-1.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13957683", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Financial services pay out record sum in UK tax", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-27T10:30:00.000+02:00", "replies_count": 0, "uuid": "064be42e9922d001050ef736a95e976e09ca9de5"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13957683", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Financial services pay out record sum in UK tax", "locations": [], "entities": {"persons": [{"name": "hungryhouse", "sentiment": "none"}, {"name": "merlin entertainments", "sentiment": "none"}, {"name": "necastle", "sentiment": "none"}, {"name": "grainger", "sentiment": "none"}, {"name": "johnson", "sentiment": "none"}, {"name": "patisserie valerie", "sentiment": "none"}, {"name": "jonathon manning shares", "sentiment": "none"}, {"name": "peter kenyon", "sentiment": "none"}, {"name": "jonathon manning", "sentiment": "none"}, {"name": "philpotts", "sentiment": "none"}, {"name": "helen gordon", "sentiment": "none"}, {"name": "luke johnson", "sentiment": "none"}, {"name": "valerie", "sentiment": "none"}, {"name": "hanro", "sentiment": "none"}, {"name": "milton keynes", "sentiment": "none"}, {"name": "ramsdens", "sentiment": "none"}, {"name": "hyett", "sentiment": "none"}, {"name": "adam serfontein", "sentiment": "none"}, {"name": "alnwick", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "doxford park", "sentiment": "none"}, {"name": "republic of ireland", "sentiment": "none"}, {"name": "leeds", "sentiment": "none"}, {"name": "pontoon dock", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}, {"name": "grainger street", "sentiment": "none"}, {"name": "salford", "sentiment": "none"}, {"name": "heaton", "sentiment": "none"}, {"name": "grey street", "sentiment": "none"}, {"name": "bristol", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "scotswood road", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "trimdon street", "sentiment": "none"}, {"name": "wessington way", "sentiment": "none"}, {"name": "jesmond", "sentiment": "none"}], "organizations": [{"name": "key event ramsdens", "sentiment": "negative"}, {"name": "volvo", "sentiment": "none"}, {"name": "competition and markets authority", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "patisserie holdings", "sentiment": "none"}, {"name": "honda", "sentiment": "none"}, {"name": "aldi", "sentiment": "none"}, {"name": "topps tiles", "sentiment": "none"}, {"name": "board", "sentiment": "none"}, {"name": "grainger plc", "sentiment": "none"}, {"name": "cma", "sentiment": "none"}, {"name": "hanro", "sentiment": "none"}, {"name": "holdings", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "alton towers", "sentiment": "none"}, {"name": "cabot square capital", "sentiment": "none"}, {"name": "hargreaves lansdown", "sentiment": "none"}, {"name": "patisserie valerie", "sentiment": "none"}, {"name": "barclays", "sentiment": "none"}, {"name": "london stock exchange", "sentiment": "none"}, {"name": "b&q", "sentiment": "none"}, {"name": "local pensions partnership", "sentiment": "none"}, {"name": "druckers, baker & spice", "sentiment": "none"}, {"name": "sainsbury", "sentiment": "none"}, {"name": "madame tussauds", "sentiment": "none"}, {"name": "vodafone", "sentiment": "none"}, {"name": "seaworld", "sentiment": "none"}, {"name": "instagram", "sentiment": "none"}, {"name": "jonathon manning grey street", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KEY EVENT Labour and Tory politicians come together to launch Northern Powerhouse Parliamentary group \nMPs, councillors and peers from around the North will today launch a parliamentary group that aims to get fresh impetus to the Northern Powerhouse . \nThe Northern Powerhouse All Party Parliamentary Group - which will will be made up of Labour and Conservative MPs, council leaders, members of the House of Lords and elected mayors - aims to provide a concerted voice from the region. \nThe group has been set up by the Northern Powerhouse Partnership established by former Chancellor George Osborne. It will focus on raising education standards, improving rail and other transport infrastructure, increasing productivity and exploring further devolution deals for the region. \nIt comes as some business groups have questioned the Government’s commitment to the Northern Powerhouse initiative, warning that failure to match the European funds that have sparked a number of regeneration schemes in recent years could be disastrous for the region. \nNewcastle City Council leader Nick Forbes and Teesside mayor Ben Houchen will speak at the group’s launch, while Sunderland Central MP Julie Elliott has backed the group. \nFormer Treasury Minister Lord O’Neill said: \nThe setting up of this APPG is another important cog in the ongoing exciting evolution of the Northern Powerhouse. Just judging by the list of those attending our first get together shows the degree of interest in this crucial mission for the North of England and necessary long term rebalancing of the UK economy. \nI am grateful to all those that have worked to put this together, and I look forward to continued progress of the Northern Powerhouse and the Northern Powerhouse Partnership, one of the most exciting things I have been lucky enough to be involved in. \nJulie Elliott said: \nI’m delighted to take part in the APPG as it will give the opportunity to bring together all people involved in governing the North and businesses. Part of the Newcastle City Centre skyline (Image: Newcastle Journal) 9:20 Jonathon Manning Pearson sells teaching unit to private equity firm \nTroubled education group Pearson is to offload its language teaching unit Wall Street English to private equity firms Baring and Citic Capital for $300m (£225m).Wall Street English operates 70 teaching centres in China, nine in Italy and has 321 franchised centres across 27 territories.The move comes after Pearson said in February that it is exploring strategic options to shift away from large-scale direct delivery services as it looks to bulk up its balance sheet.Pearson said the deal will see a $100m improvement in its net debt position as around $150m dollars of operating cash will be retained in the disposed business.Wall Street English contributed £175m to Pearson’s revenue last year and booked an adjusted operating profit of £7m and a statutory operating profit of £4m.The teaching unit had approximately 3,600 full time employees at the end of June and the deal is expected to close in the first half of 2018, subject to regulatory approval.Pearson chief executive John Fallon said: \nThe sale of Wall Street English is part of our continued effort to focus on a smaller number of bigger opportunities in global education and to become simpler and more efficient. \nThe sale follows a string of recent profit warnings and a record £2.6bn full year loss in February for the former Financial Times owner.It also comes after Pearson offloaded a 22% stake in its publishing unit Penguin Random House to Germany’s Bertelsmann for around $1bn (£761m) last month. Penguin Books KEY EVENT Ramsdens reports 50% profit growth during half-year results \nNorth East pawnbrokers Ramsdens has reported strong half-year results, during its first financial report since listing on the London Stock Exchange. \nTurnover soared by 18.5% to £21.8m during the six months ending September 30 2017. During the same period last year the firm brought in £18.4m. \nRamsdens’ operating profit also soared by almost 50%, from £3.5m in 2016 to £5.2m last year. \nCommenting on the results chief executive Peter Kenyon said: \nRamsdens has had a strong first half of the financial year with foreign currency exchange, pawnbroking and retail jewellery all showing good growth. The sterling gold price has been ahead of expectations and continues to benefit the purchase of precious metals and pawnbroking scrap proceeds. \nWe have made a good start to the second half of the year and have good momentum as we head into the seasonally important Christmas period for jewellery retail. \nRamsdens has a clear growth strategy which is underpinned by our trusted brand, first-class team and well-invested core branch estate and the Board remains confident of delivering further progress. Ramsdens chief executive Peter Kenyon (Image: Publicity Pic) 9:05 Jonathon Manning Just Eat on track for FTSE 100 promotion \nJust Eat is set to munch its way into the FTSE 100 Index as Merlin Entertainments bows out when the latest market reshuffle is announced on Wednesday.The online takeaway firm has seen shares jump 43% over the past year, with relentless revenue growth and a string of deals keeping its stock in demand.The company’s heady rise has pushed its stock market value to £5.5bn, outstripping supermarket giant Sainsbury’s (£5bn) and in line with no frills airline easyJet.A promotion to the top flight would be another bright spot for the firm after seeing its £240m takeover of rival Hungryhouse given the green light by the Competition and Markets Authority (CMA) earlier this month.Nicholas Hyett, equity analyst at Hargreaves Lansdown, said: \nReshuffles in and out of the FTSE 100 are somewhat symbolic but can highlight companies whose stars are in the ascendancy, Just Eat being a good example having only floated a little over three years ago. \nIt might take payments by card, but when it comes to shareholders, Just Eat, like all good online businesses, is a cash machine. \nHectic lifestyles mean more meals are bought in rather than cooked at home, which keeps underlying demand firm. \nCustomers are fast adopting online ordering as their default order route and Just Eat has been growing orders and revenues at a rate of knots. \nIn a contrast of fortunes, Alton Towers owner Merlin Entertainments is expected to be demoted to the FTSE 250 after enduring a stock price slump and weaker trading following a series of UK terror attacks.The group behind Madame Tussauds and the London Eye has seen visitor numbers tail off in response to the heightened UK threat level, with the blame also being pinned on poor late summer weather across the UK and northern Europe.Merlin, which dismissed takeover talks with SeaWorld last month, has seen its share price fall by a third since it peaked at 537p in May this year. Just Eat app Jonathon Manning Grey Street student housing plans dropped as new owner buys Newcastle property \nNewcastle property firm Hanro has snapped up a historic city centre building as part of a £120m property spending spree. \nOver the last two years the commercial property company has sold off a vast chunk of its portfolio after carrying out a strategic review. \nAdam Serfontein, managing director, of Hanro, said the time was right to sell those properties, which included Sainsbury’s in Heaton in a £44.5m land deal. \nNow the company is investing in new stock, with a sharp focus on the growing leisure sector as well as offices. \nHanro plans to invest a total of £120m on properties across the North East, with £70m already ploughed into a range of schemes. \nOver the last few months the firm has acquired the Waitrose supermarket in Jesmond, a Vodafone retail unit in Leeds, Noble Street industrial estate in Newcastle, Alnwick’s Aldi supermarket and Topps Tiles store, the Barclays call centre at Doxford Park, the Mill Volvo garage on Necastle’s Scotswood Road and the Honda Car centre on Wessington Way, Sunderland and B&Q warehouse on Trimdon Street in Sunderland and the Royal Mail depot in Sunderland. \nHanro managing director Adam Serfontein said: \nIn 2016 we carried out a review that led to us seling off £120m of property, prior to the referendum – and we started to acquire again last autumn. \nWe had a significant portfolio that we’d owned for some time and through development of the stock we had added as much value as we could to it, so the time was right to sell. \nThis time we have been looking at out-of-town retail, commercial retail and also city centre retail, based where there are big markets for tourists and students – we are essentially targeting the leisure, industrial and offices markets. \nWe are getting into real Brexit negotiations and there are more downsides than ups but there are always opportunities to be had in property, so long as you have the right sector, in the right location. The old Turks Head Hotel on Grey Street, Newcastle 8:55 KEY EVENT Patisserie Valerie eyes Manchester production plant as profits rise \nThe owner of Patisserie Valerie has reported a rise in full-year sales and profits as tight cost controls helped it overcome soaring inflation, with the group also considering opening a new production plant in Manchester.Revenue at Patisserie Holdings, chaired by serial entrepreneur Luke Johnson, grew 9.7% to £114.2m in the 12 months to September 30, while pre-tax profit rose 17.1% to £20.2m.The bakery, which has a branch on Newcastle’s Grainger Street, pointed to inflationary wage and ingredient cost pressures over the period, although it said this appears to be “easing”.British businesses have been hammered by rising costs following the collapse in sterling after the Brexit vote.But Mr Johnson said: \nOur indulgent, affordable treats remain attractive to customers, and our flexible business model has enabled us to mitigate inflationary cost pressures. \nPatisserie Holdings also said that it is reviewing options for an additional production facility in the Manchester area with capacity to serve 70 stores, as well as baking goods within all of its stores. \nThe firm said: \nBoth of these initiatives will provide additional capacity to the group as well as releasing savings and efficiency and improving product quality. \nStores are currently serviced from its main bakery in Birmingham and from seven satellite bakeries across the UK.Online sales rose 26% to £4.8m in the period as the company said its engagement with consumers via social medial platforms such as Facebook, Instagram and Twitter is reaping rewards.Patisserie Holdings, which also operates Druckers, Baker & Spice and Philpotts, opened 20 new stores in the period, including further forays into Scotland and Ireland.The company trades from a total of 199 stores and is targeting 20 new stores for 2018.Patisserie Holdings also entered into a supply-only agreement with Sainsbury’s during the year, and will operate from 18 of the supermarket’s counters by year end.Mr Johnson said: \nWe have delivered another year of excellent financial results, achieving our targets in a challenging environment. \nWe opened 20 new stores many of which are performing ahead of expectations, and the performance of our new bakeries in the Republic of Ireland is encouraging. Patisserie Valerie in Newcastle. Jonathon Manning Shares in Newcastle's Grainger Plc soar 31% in a year amid property spending spree \nShares in North East property giant Grainger have soared by 31% in a year following the firm’s pledge to invest millions in the growing build-to-rent market. \nAt the start of last year, Grainger’s chief executive Helen Gordon said the company planned to invest more than £850m into PRS (private rented sector) assets, as part of a strategy to drive up rental income. \nThis year alone the Newcastle business has spent at least £210m on a series of investments, forward funding many projects while also launching joint ventures with other investors. \nKey purchases include an £80m spend to acquire a PRS development in Salford, Manchester, a 139-home build PRS development in Milton Keynes for £30.5m, a joint venture between Grainger and the Local Pensions Partnership to acquire a PRS build-to-rent development in Pontoon Dock, London and a similar £46m scheme to deliver 200 homes in Bristol. \nAs a result, shares have grown 31%, from 219p this time last year to 288p, hitting a five-year high on Tuesday of 219p. \nIn the firm’s latest acquisition, it has announced a £26m deal for a PRS scheme in Manchester. \nThe firm, the UK’s largest listed residential landlord, has acquired a portfolio of three blocks in Manchester, comprising 192 private rented sector homes, from Cabot Square Capital. \nHelen Gordon, chief executive of Grainger, said: \nWe are pleased today to announce our latest investment in one of our key target locations, Manchester, which delivers 192 high quality rental homes, building on our existing portfolio in and around the area, leveraging off our operational platform and local management office. Helen Gordon, CEO Designate of Grainger plc (Image: Publicity Pic) 8:45", "external_links": [], "published": "2017-11-27T10:30:00.000+02:00", "crawled": "2017-11-27T11:21:48.006+02:00", "highlightTitle": ""}