{"organizations": [], "uuid": "bc3f32be1051a90077746cc185caa247213d2da1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13851387.ece/ALTERNATES/s1200/TMP_NEC_311017StThomasStreet02JPG.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/government-intervene-battle-between-newcastle-13851101", "country": "GB", "domain_rank": 21960, "title": "Government to intervene in battle between Newcastle homeowners and charity", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-03T07:00:00.000+02:00", "replies_count": 0, "uuid": "bc3f32be1051a90077746cc185caa247213d2da1"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/government-intervene-battle-between-newcastle-13851101", "ord_in_thread": 0, "title": "Government to intervene in battle between Newcastle homeowners and charity", "locations": [], "entities": {"persons": [{"name": "crescent", "sentiment": "none"}, {"name": "holy jesus trust", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "onwurah", "sentiment": "none"}, {"name": "alok sharma", "sentiment": "none"}, {"name": "chi onwurah", "sentiment": "none"}, {"name": "ms onwurah", "sentiment": "none"}, {"name": "mary magdalene", "sentiment": "none"}], "locations": [{"name": "newcastle", "sentiment": "none"}, {"name": "newcastle city centre", "sentiment": "none"}, {"name": "st thomas street", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "house of commons", "sentiment": "none"}, {"name": "st mary magdalene & holy jesus trust", "sentiment": "none"}, {"name": "charity commission", "sentiment": "none"}, {"name": "department for communities and local government", "sentiment": "none"}, {"name": "holy jesus trust", "sentiment": "none"}, {"name": "newcastle central", "sentiment": "none"}, {"name": "commission", "sentiment": "none"}, {"name": "the commission", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}, {"name": "the charity commission", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Government to intervene in battle between Newcastle homeowners and charity Officials will speak with Mary Magdalene and Holy Jesus Trust to try to resolve dispute about leaseholds in Newcastle Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nHouseholders facing a nightmare battle with a Newcastle charity over the future of their homes have been thrown a lifeline by the Government. \nThe Department for Communities and Local Government is intervene in the dispute between the Mary Magdalene and Holy Jesus Trust and residents, after their case was raised by city MP Chi Onwurah . \nHomeowners in a number of houses in the St Thomas’ area and elsewhere in Newcastle cannot sell their properties, because the charity owns the freehold and is refusing to extend it. \nMany have paid off an expensive mortgage, or are still making payments, for a property which is effectively valueless. \nLeading a House of Commons debate, Ms Onwurah said: “My constituents, who have worked their whole lives and invested in property, as they have been encouraged to do, are now facing their greatest asset becoming their greatest liability.” Labour MP for Newcastle Central, Chi Onwurah (Image: Newcastle Chronicle) \nA property with less than 80 years on its lease steadily loses value, and lenders will generally refuse to provide a mortgages until the lease is renewed. \nThis is not a problem for most leaseholders because they have a legal right to renew the lease, typically adding an extra 90 years to it, although this can cost thousands of pounds. \nHowever, the 1985 Housing Act states that there is an exception for charities which own freeholds, which are not obliged to extend a lease or sell the freehold for houses on their land. \nAnd the Mary Magdalene and Holy Jesus Trust is refusing to extend leases on the grounds that its responsibility is to the beneficiaries of the charity, not to the householders. \nMs Onwurah said that homeowners were not told this would be an issue when they bought the homes. St Thomas Street, Crescent and Square in Newcastle City Centre (Image: newcastle chronicle) \nOne couple in their 70s wanted to move out of their home and move into a property more suitable for the elderly, but were stuck where they are. \nMs Onwurah said the couple had told her: “We are devastated to find that our house is unsalable and our nest-egg is worthless because the charity that owns the freehold is refusing to extend our lease.” Read More Employers need to know what will happen after Brexit, MPs insist \nShe said the Mary Magdalene and Holy Jesus Trust claimed it faced legal action from the Charity Commission if it did extend the leases - but the Charity Commission has insisted it is not to blame. \nAnd she told the House of Commons: “Will the Minister also join me in imploring the Charity Commission to make it clear that while charities must act in the interests of their beneficiaries, that should not be at the cost of making life a misery for others?” \nAlok Sharma, the Minister for Housing and Planning, said officials from the Department for Communities and Local Government would contact the Mary Magdalene and Holy Jesus Trust to find a way for the leases to be extended or the freeholds to be sold. St Thomas Street, Crescent and Square in Newcastle City Centre (Image: newcastle chronicle) \nHe said: “I have asked my officials to be in direct contact with the trust to see what help can be provided to leaseholders with regard to their desire to exercise their right to buy in terms of the freehold. \n“We will cover what flexibilities there may be for the trust to apply existing legislation to help to resolve some of the issues raised ... especially where the trust and the leaseholders are both willing and agree to progress either lease extensions or the purchase of the house freeholds.​” \nA Charity Commission spokeswoman said: “The Charity Commission is aware of the issue that has arisen regarding the extension of leaseholds to tenants living on land owned by the St Mary Magdalene & Holy Jesus Trust. Read More Electric cars - they are the future and 'now' their time has come \n“The Commission has previously corresponded with Ms Onwurah twice on this matter, clarifying that issues of this nature are not within the regulatory remit of the Charity Commission. As our letters to Ms Onwurah state, the charity must seek professional advice if they are not suitably experienced in this particular issue, and it would seem that they have sought and followed such advice. \n“It is important to note that trustees are responsible for making decisions that are in the best interest of their charity; sometimes these decisions may be difficult ones to make, but such matters ultimately lie with trustees. The Commission is unable to interfere or overrule a validly taken decision. As such, there is no further role for the Commission at this time.” Like us on Facebook", "external_links": [], "published": "2017-11-03T07:00:00.000+02:00", "crawled": "2017-11-03T07:16:16.000+02:00", "highlightTitle": ""}