{"organizations": [], "uuid": "348f7986efdb261b14bc037085490e5826a6cefb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/news/article667885.ece/ALTERNATES/s1200/GettyImages-511377626.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/news/uk-world-news/smokers-fear-second-tax-rise-804085", "country": "US", "domain_rank": 48128, "title": "Smokers fear a second tax rise on tobacco in a year could be announced this week - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.238, "site_type": "news", "published": "2017-11-20T15:03:00.000+02:00", "replies_count": 0, "uuid": "348f7986efdb261b14bc037085490e5826a6cefb"}, "author": "Mikey Smith", "url": "http://www.leicestermercury.co.uk/news/uk-world-news/smokers-fear-second-tax-rise-804085", "ord_in_thread": 0, "title": "Smokers fear a second tax rise on tobacco in a year could be announced this week - Leicester Mercury", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "News Smokers fear a second tax rise on tobacco in a year could be announced this week The Tobacco Manufacturers Association reckons it could push the price of a premium packet of cigarettes above £10 Share Woman smoking a filter tip cigarette with her hand resting on a slatted wooden table (Image: Getty Images) Share Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nTobacco industry giants are concerned this week's Budget could see smokers hit with a rise in prices. \nThis would be the second rise in 2017 if it is announced in Conservative Chancellor Philip Hammond's Budget on Wednesday. \nThe cost of living is already putting pressure on plenty of households in the run-up to this week's Government budget announcement, with the fact that prices are rising faster than wages, giving people a real-terms cut in earnings. \nThe announcement this week will set out how the Government will spend the nation's money. Read More \nAnd often, this can go hand in hand with money-making announcements like increasing taxes on tobacco, alcohol, fuel and other products. So what has the Chancellor increase the tax on tobacco? \nAnnouncements have already been made over plans a string of measures to boost productivity and create higher-skilled, higher wage jobs. \nThese include plans to get 300,000 homes built a year, a relaxation in regulations for the testing of driverless cars, a £1.7 billion boost for transport within cities, and high-tech investment in artificial intelligence and 5G mobile networks. \nBut there has not been any news on smoking taxation rising. Is it likely to rise? \nExperts believe it probably won't be hit - the stakes are high for Mr Hammond ahead of this Budget, following his quickly-abandoned Spring Budget plans to hike national insurance contributions for the self-employed, and given the Government's need for stability during Brexit negotiations. \nThis will likely mean a Budget aimed at pleasing as many people as possible. Read More Merry Christmas in 10 languages other than English Who's saying it will? \nMostly the tobacco industry. The Tobacco Manufacturers Association, a lobbying group for the industry - which counts British American Tobacco, Gallagher and Imperial Tobacco among its members - reckons it could push the price of a premium packet of cigarettes above £10. \nAnd British American Tobacco, who make Lucky Strikes, Benson and Hedges and Pall Mall today complained that smokers had already been hit with three increases this year. Three increases? \nKind of. \nTobacco is subject to an automatic, annual increase in duty - it increases every year by 2% above the rate of inflation. \nOn top of that, the Chancellor introduced a minimum level of tax that can be charged on a pack. \nThe tobacco industry also count the banning of packs smaller than 20 cigarettes as a price increase, which it's not really, but that's how they get to three. Read More East Midlands Trains announces £15 first class tickets to London Black Friday deal So why will Philip Hammond probably not put the price of fags up on Wednesday? \nBecause he's already done that once this year, in his March Budget, and this Budget is a weird one. \nIn his last Budget, Hammond announced the end of the spring Budget - and a move to an autumn Budget. As a result, we're in the odd situation of having two Budgets in one year. Opened pack full of cigarettes (Image: Getty Images) \nIt's happened before, but rarely on purpose. Usually if there's a second Budget in the same year, it's the result of a change in government. \nBut this year, Hammond has already announced the annual escalator increase. It's possible he'll whack it on for a second time, but it's more likely he'll save it until the 2018 Budget. Like us on Facebook ", "external_links": [], "published": "2017-11-20T15:03:00.000+02:00", "crawled": "2017-11-20T17:06:43.004+02:00", "highlightTitle": ""}