{"organizations": [], "uuid": "4faae3d1cb10bb88adf93aefbd1045da1614f64f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13875623.ece/ALTERNATES/s1200/Marks-and-Spencer-store-shake-up.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/closures-loom-marks-spencer-difficult-13875571", "country": "GB", "domain_rank": 21960, "title": "Closures loom at Marks and Spencer as 'difficult' times continue for high street favourite", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-08T16:46:00.000+02:00", "replies_count": 0, "uuid": "4faae3d1cb10bb88adf93aefbd1045da1614f64f"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/closures-loom-marks-spencer-difficult-13875571", "ord_in_thread": 0, "title": "Closures loom at Marks and Spencer as 'difficult' times continue for high street favourite", "locations": [], "entities": {"persons": [{"name": "spencer", "sentiment": "negative"}, {"name": "helen weir", "sentiment": "none"}, {"name": "steve rowe", "sentiment": "none"}, {"name": "rowe", "sentiment": "none"}, {"name": "laith khalaf", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "teesside", "sentiment": "none"}], "organizations": [{"name": "invalid email  retail giant marks & spencer", "sentiment": "none"}, {"name": "hargreaves lansdown", "sentiment": "none"}, {"name": "simply food", "sentiment": "none"}, {"name": "simply food chain", "sentiment": "none"}, {"name": "m&s", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Closures loom at Marks and Spencer as 'difficult' times continue for high street favourite M&S said it will slow expansion of its Simply Food chain and close under-performing clothing stores, but has not said which sites are affected Share A Marks and Spencer store (Image: PA) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nRetail giant Marks & Spencer is speeding up plans to close under-performing clothing stores and will slow expansion of its Simply Food chain as its battles to restore its high street fortunes. \nThe group said it would further “reshape” the clothing and home arm to focus on the most successful locations, while also driving more online sales. \nIt will also slam the brakes on its Simply Food store opening programme amid “difficult” trading and launch a “significant” cost review under the next push of its turnaround plan. \nHalf-year figures showed a 5.3% fall in underlying pre-tax profits to £219.1m for the six months to September 30. \nBottom line profits jumped to £118.3m from £25.1m a year earlier thanks to a boost from its international arm after exiting loss-making markets. \nLike-for-like sales improved in its embattled clothing and home arm, down by a better-than-feared 0.1% in its second quarter after a 1.2% fall in the previous three months. \nM&S said revenues overall had stopped falling in the division, while its action to cut the number of clearance sales saw full-price sales surge by 5.3%. \nFood sales came as a disappointment though, down 0.1% in the second quarter, as the group admitted it needed to review prices and ranges. CEO Steve Rowe (Image: Publicity Picture) \nChief executive Steve Rowe said: “The business still has many structural issues to tackle as we embark on the next five years of our transformation, in the context of a very challenging retail and consumer environment.” \nThe group also confirmed it has launched the hunt for a successor to finance chief Helen Weir, who is leaving to pursue a “plural career” and seek a variety of board positions and advisory roles. \nShe will remain in the role until a successor is found. \nThe group’s plans to step up its overhaul comes a year after it first announced that it would shut 30 of its larger UK stores, with a further 45 being downsized or converted to food-only, while also axing 53 loss-making international stores. \nIt has so far completed six of the 30 announced UK closures. \nMr Rowe remained tight-lipped on which further outlets would close and the number of staff impacted, saying they were taking it on a “store by store basis”. \nBut he sought to assure that staff affected would be offered the chance to relocate wherever “feasible”. Read More Square One Law managing partner hints at Teesside office opening \nHe said only a handful of employees had chosen to take redundancy so far under the store overhaul. \nThe group’s curtailed plans for the food business will now see it open 80 Simply Food shops this financial year, having previously aimed for 90 stores. \nShares sunk as much as 4% at one stage on worries over a flagging food operation, although the stock later regained its poise. \nMr Rowe said the chain’s food range was “too complicated and availability is still not good enough”. \nHe added that pressure from the Brexit-hit pound on food profit margins had played a part in deciding to slow down openings over this year and next. Read More Persimmon shares slide as trading updates hints at flat sales \nBut he insisted the move was “prudent”. \nLaith Khalaf, senior analyst at Hargreaves Lansdown, said: “This is not a pretty set of results for M&S, which has seen its turnaround plan undermined by changing consumer shopping habits and a weaker pound.” \nHe added: “The food business has been keeping M&S afloat in recent years, but now progress seems to be flagging here, the clothing division needs to start pulling its own weight.” Like us on Facebook", "external_links": [], "published": "2017-11-08T16:46:00.000+02:00", "crawled": "2017-11-08T17:18:58.003+02:00", "highlightTitle": ""}