{"organizations": [], "uuid": "6025e5f4dd8dc622feb5164eeb8a3e0d9538eea0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article789974.ece/ALTERNATES/s1200/Stanley-Johnson.jpg", "site_section": "http://www.westernmorningnews.co.uk/news.rss", "section_title": "devonlive - News", "url": "http://www.devonlive.com/news/devon-news/stanley-johnson-says-defend-son-789966", "country": "GB", "title": "Stanley Johnson says he will defend son Boris in the I’m A Celebrity camp", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-17T00:30:00.000+02:00", "replies_count": 0, "uuid": "6025e5f4dd8dc622feb5164eeb8a3e0d9538eea0"}, "author": "devonlive", "url": "http://www.devonlive.com/news/devon-news/stanley-johnson-says-defend-son-789966", "ord_in_thread": 0, "title": "Stanley Johnson says he will defend son Boris in the I’m A Celebrity camp", "locations": [], "entities": {"persons": [{"name": "boris", "sentiment": "none"}, {"name": "stanley johnson", "sentiment": "none"}, {"name": "mrs zhagari-ratcliffe", "sentiment": "none"}, {"name": "stanley", "sentiment": "none"}, {"name": "nazanin zaghari-ratcliffe", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "geordie", "sentiment": "none"}, {"name": "boris johnson", "sentiment": "none"}, {"name": "boris johnson  he", "sentiment": "none"}], "locations": [{"name": "new zealand", "sentiment": "none"}, {"name": "iran", "sentiment": "none"}, {"name": "mount kilamanjaro", "sentiment": "none"}, {"name": "tehran", "sentiment": "none"}], "organizations": [{"name": "facebook", "sentiment": "none"}, {"name": "foreign", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Stanley Johnson says he will defend son Boris in the I’m A Celebrity camp Dad says Foreign Secretary's blundering involvement in the Nazanin Zaghari-Ratcliffe affair may have helped Share Click to play Tap to play The video will start in 8 Cancel Play now   Thank you for subscribing!   \nStanley Johnson says he will defend son Boris in the I’m A Celebrity camp and insisted his involvement in the Nazanin Zaghari-Ratcliffe affair may have helped her, the Mirror reports . \nBlundering Stanley also insisted Boris was excellent at his job, despite fierce criticism in recent weeks. \nBoris Johnson said during a Commons committee hearing that Mrs Zhagari-Ratcliffe was in Iran to “train journalists” - which could lead to her five-year jail term being doubled. \nHe has since apologised for the remarks and retracted “any suggestion she was there in a professional capacity”. \nBut told Boris had now been forced to apologise in the Commons for his comments, Stanley suggested Boris’ initial intervention was actually a good thing. Boris Johnson \nHe said: “I am very glad to hear this has all gone swimmingly. As a matter of fact it does seem to me to have been a terrifically good idea from the point of view of that Iranian woman because it has now become a diplomatic affair of the first order and I suspect that there might be a very strong case for a mission at high level. \nMan, 49, arrested on suspicion of murder after clothing found in field amid search for missing Gaia \n“I can imagine you might have a mission from the British foreign secretary to Tehran. So out of this kerfuffle maybe something very good will come in terms of UK/Iran relationships. \n“I am going to plea a little bit of ignorance for the detail here. But my whole feeling is that this is absolutely moving in the right direction.” \nThe 77-year-old told the Mirror that he would also defend Boris from any detractors in the camp. \n“You have no idea how much I will defend Boris, I will be 100 percent on his side because I think he is doing a fantastic job,” he says. “But I doubt they are going to be spending much time talking about brexit. I think they are going to be spending a lot of time talking about whether it is too hot or too cold or whether they are getting enough to eat or drink.” \nStanley is arguably the biggest shock name heading into the jungle this weekend. The Mirror told yesterday how he had turned down the show in the past due to his family banning him from taking part. But this year he signed up without telling most of them and flew in from New Zealand without even being rumoured as a contestant. \nThese are Devon's 10 biggest planned housing developments \nStanley insisted despite being 77 he had no concerns that he would struggle with the demands on the show. \nHe said: “I have climbed Mount Kilamanjaro twice in the last five years. I don’t have any worries about my health in the slightest. I am told by the people that organise these things that the Australian health and safety people have a watchful eye and they are very tough. \n“I am not so sure I would like to do a bungee jump. I don’t know if they have a bungee jump in store for us but I think I would think twice about that. I don’t think I would have any problem jumping out of plane, but I would prefer it if the parachute were to open. That’s obvious! \n“All things being equal I would like the parachute open but I cant think of anything else I wouldn’t like to be doing. \n“The jungle crown is very much worth winning. You tell me I am the oldest contestant so that already is a bit of a first but it would certainly be nice to be one of the three finalists. I think I would settle for that.” \nHe also claimed to be unfazed by the prospect of being mostly known for being Boris’ dad despite a successful writing career and jobs as an expert on environmental and population issues. \nFormer MEP Stanley said: “My view is this. Lots of famous people have fathers, that is point one. \nBut not all fathers are famous people, y’know get recognition. Yes of course I am known as Boris’ dad but it might just be that there are some other things that come in there. Y’know I have written 25 books and won lots of environmental prizes. \n“Maybe I am deluded myself, who can tell. But if I am, it is a very sweet delusion.” \nStanley has never watched the show but insisted he did know who presented I’m A Celebrity although he is clearly not a huge fan of the Geordie duo. \nHe said: “There are two people and one is called and Ant and one is called Dec. I am pretty sure I have got that right. I have seen a photo of them, but which is which? That I am not 100 percent sure.” \n* I’m A Celebrity starts on Sunday night at 9pm on ITV. Like us on Facebook", "external_links": [], "published": "2017-11-17T00:30:00.000+02:00", "crawled": "2017-11-17T00:40:23.001+02:00", "highlightTitle": ""}