{"organizations": [], "uuid": "68902b479396a304c9323913d7b7fa5263c3df6c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article714532.ece/ALTERNATES/s1200/Plastic-bottles.jpg", "site_section": "http://www.middevongazette.co.uk/politics.rss", "section_title": "devonlive - News", "url": "http://www.devonlive.com/news/devon-news/council-urged-ban-throw-away-714654", "country": "GB", "title": "Council urged to ban throw-away plastic bottles", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-01T18:39:00.000+02:00", "replies_count": 0, "uuid": "68902b479396a304c9323913d7b7fa5263c3df6c"}, "author": "Keith Rossiter", "url": "http://www.devonlive.com/news/devon-news/council-urged-ban-throw-away-714654", "ord_in_thread": 0, "title": "Council urged to ban throw-away plastic bottles", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nDevon County Council is being pushed to ban from its premises all plastic items that are used once and then discarded. \nA motion to be considered by the Cabinet next week calls on the county to support the Surfers Against Sewage campaign Plastic Free Coastlines. \nThe council should commit to plastic free alternatives and support plastic free initiatives in Devon, its author, Cllr Frank Biederman, says. \nHe urges the council to lead by example by removing single-use plastic items from its premises. \nAlso it must encourage plastic-free initiatives, promoting the campaign and supporting its events. \nA representative of Devon County Council will become a member of the Plastic Free Coastlines steering \ngroup if the county supports the motion. \nIt is estimated that up to 13 million tonnes of plastic leak into the global marine environment every year. \nSome of it escapes from waste management systems, and some is thrown away deliberately. A 10-metre long whale is unveiled by Sky Ocean Rescue at Potters Fields Park in London. (Image: Matt Alexander/PA Wire) Read More A wet wipe monster and giant seagulls have invaded Teignmouth \nPlastic items kill wildlife by entangling or suffocating them, and are responsible for the death of more than a million sea birds and mammals every year. \nBut the plastics go on killing. They break down into microplastics, getting into the food chain and eventually ending up on our own plates, with potential to harm human health. \nThe microplastics do not degrade further, and can remain in the environment for hundreds of years, harming \nThe direct economic costs of marine litter to maritime industries, the cost of clean-up and on tourism in the UK are estimated at £103million a year. \nThe government has introduced a levy on plastic bags, and microbeads will be banned from most cosmetics from June next year. An exfoliating daily wash containing micro-beads \nBut these two sources make up just 2% of the problem. \nA third of marine plastic litter is single-use drinks containers. \nA widespread source of polltion is nurdles – plastic granules which are shipped around the world as the raw product in plastics factories. \nDevon County Council has already made strides in reducing plastics use. Read More We need to make a 'Green Brexit' work - Neil Parish MP column \nA switch away from desktop printers has cut the number of printer cartridges bought by the council more than 9,000 in 2009 to 500 in 2016. \n10,000 fewer disposable cups have been used for hot drinks in its first 6 months after the introduction of a reusable cup. Like us on Facebook", "external_links": [], "published": "2017-11-01T18:39:00.000+02:00", "crawled": "2017-11-01T19:52:20.002+02:00", "highlightTitle": ""}