{"organizations": [], "uuid": "ecd49d8a18cb7ee1d2a263dd53f9304d8b1c66c4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13393777.ece/ALTERNATES/s1200/Brexit.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/brexit-could-mean-north-east-13945353", "country": "GB", "domain_rank": 21960, "title": "Brexit could mean North East charities miss out on share of £260m EU yearly funding", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-23T20:00:00.000+02:00", "replies_count": 0, "uuid": "ecd49d8a18cb7ee1d2a263dd53f9304d8b1c66c4"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/brexit-could-mean-north-east-13945353", "ord_in_thread": 0, "title": "Brexit could mean North East charities miss out on share of £260m EU yearly funding", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "negative"}, {"name": "john stillwell/pa wire", "sentiment": "none"}, {"name": "jean-claude juncker", "sentiment": "none"}, {"name": "daniel ferrell-schweppenstedde", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "derek groves", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "downing street", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "social change", "sentiment": "none"}, {"name": "north east autism society", "sentiment": "none"}, {"name": "dsc", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "directory of social change", "sentiment": "none"}, {"name": "hm treasury", "sentiment": "none"}, {"name": "european commission", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Brexit could mean North East charities miss out on share of £260m EU yearly funding Research by Director of Social Change says a 'no-deal' Brexit would see funding cut off immediately Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily   Thank you for subscribing!   \nNorth East charities face losing out on their share of around £260 million in EU funding a year because of Brexit, a new study revealed. \nPublished by the Directory of Social Change (DSC), it found that a no-deal Brexit could see “an even sharper shock to the system” if currently awarded funds are suddenly cut off. \nIts research paper, called ‘What does Brexit mean for UK charities’ European Union funding?’, said charities benefited from £258.4m in EU funding in 2015, with £210.9m of that figure awarded to 295 charities in funds administered directly by the European Commission. EU and Union flags (Image: PA) \nThe paper, which is based on data published through the European Commission’s financial transparency system and by the UK government in 2015, found another £47.5m was awarded to 113 UK charities from European structural and investment funds which were from the EU but allocated by the UK government. \nThe report said the figures are minimum levels of funding because only one year’s worth of funding was analysed and because charities often benefit indirectly from other forms of EU investment. \nCo-author of the research, Daniel Ferrell-Schweppenstedde, said: “It’s nearly 2018 - but the future of EU funding after Brexit remains extremely murky. \n“Government needs to clarify the situation urgently, because uncertainty is already affecting budgetary outlooks for many charities across the sector. Prime Minister Theresa May greets European Commission President Jean-Claude Juncker ahead of a working dinner at 10 Downing Street, London (Image: John Stillwell/PA Wire) \n“Trustees and executives are being left in limbo, not knowing the future of current funding and needing to find alternatives which are thin on the ground. \n“As funding plans which looked secure for years threaten to dissolve almost overnight, the threat of disruption to vital services grows day by day.” \nIt’s a concern that is shared by a number of charities in this region, including the North East Autism Society. \nIts Employment Futures Manager, Derek Groves, said: “Currently many employment programmes receive full or part funding from EU funding sources. \n“While there is a short term commitment from the UK Government to maintain existing commitments there remains uncertainty regarding future funding of projects beyond 2020. \n“Uncertainty over funding results a reluctance to invest in resources and infrastructure.” Read More Brexit under threat - has a serious movement to overturn the result begun? \nThe DSC has called on the Government to make clear what level of funding for charities will be maintained throughout the Brexit process, including a detailed definition of the conditions under which present EU funding levels will be guaranteed. \nThe charity also wants ministers to set out a “clear and credible commitment” on how EU funding will be replaced in full after Brexit. \nThe DSC study pointed out that charities were not included among the 58 sectors that have been consulted on the impact of Brexit. \nIn 2016 HM Treasury pledged to continue to support projects which are agreed up to the point at which the UK departs the EU – subject to being ‘value for money’ and ‘in line with government’s priorities’. Read More Carmakers employing more than 16,000 warn Brexit could do huge damage to their businesses \nThe 2017 Conservative Party manifesto also promised to use EU funds that come back to the UK after Brexit to create a ‘Shared Prosperity Fund.’ \nWhat priorities such a fund would have, what causes it would support and how it would function remains totally unclear, said the DSC. Like us on Facebook", "external_links": [], "published": "2017-11-23T20:00:00.000+02:00", "crawled": "2017-11-23T20:43:01.002+02:00", "highlightTitle": ""}