{"organizations": [], "uuid": "d6259783be13984aa3cfb590dd4a76720b198734", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13939719.ece/ALTERNATES/s1200/Budget-2017.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-leaders-welcome-13939681", "country": "GB", "domain_rank": 21960, "title": "North East business leaders welcome Budget announcements on devolution and Metro", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-22T18:13:00.000+02:00", "replies_count": 0, "uuid": "d6259783be13984aa3cfb590dd4a76720b198734"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-leaders-welcome-13939681", "ord_in_thread": 0, "title": "North East business leaders welcome Budget announcements on devolution and Metro", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "North East business leaders welcome Budget announcements on devolution and Metro Business groups welcome measures on transport and tax changes, but gloomy economic forecasts spark concerns Share Click to play Tap to play The video will start in 8 Cancel Play now Get business   \nBusiness leaders around the North East have welcomed the Budget announcements of a devolution deal for the North East and funding to replace the Tyne and Wear Metro fleet . \nThe two measures confirmed by Chancellor Philip Hammond had been the main priorities from the business community in the run-up to the Budget , with extensive lobbying of Ministers taking place in recent months. \nThere was also a welcome from many in the business community for other measures announced by Mr Hammond, though gloomy forecasts for growth in the economy have concerned some company bosses. \nAmong the measures being welcomed was a £2.3bn reprieve on controversial business rates as part of a string of tax changes the Chancellor said proved the Government was “listening to concerns”. \nMr Hammond brought forward plans to swap the way it determines the annual increase of business rates from the higher Retail Price Index (RPI) measure of inflation to the lower Consumer Price Index (CPI), which will result in a 3% rise in business rates rather than a 4% increase had it been indexed to RPI. Read More Business leaders welcome Budget decision \nThe Chancellor also said he would tackle the “staircase tax”, which hits companies with operations on multiple floors in the same building. Mr Hammond has pledged to change the law, allowing businesses impacted by the Supreme Court ruling to have their original bill reinstated and backdated, if they choose. Jonathan Walker, head of policy and campaigns, North East England Chamber of Commerce (Image: Handout) \nReacting to the Budget, Jonathan Walker, head of policy and campaigns at the North East England Chamber of Commerce said: “We wanted new Metro trains as a matter of priority and are delighted these are now on their way. \n“As part of our desire to see a more influential North East we had asked for more funding and powers for Tees Valley and completion of a North of Tyne devolution deal. It is great news that the Chancellor has listened on both of these issues. Read More Brexit uncertainty won't stop investment into Quorn and Cauldron foods, bosses declare \n“Ahead of the Budget we called on the Government to get serious about the need to change the distribution of investment and economic activity in the UK. The announcements today are a big step forward but we await the long term shift in Government thinking which will hopefully come forward in the publication of the Industrial Strategy.” \nThe devolution deal was also welcomed by the CBI in the North East, which said it was “a real opportunity to rekindle the pioneering flame here in the North East to improve our skills base, our local infrastructure and create new jobs throughout the region.” Chief Executive for NE1 Ltd Sean Bullick \nSean Bullick, chief executive of NE1 Limited, Newcastle’s Business Improvement District, said: “Businesses in Newcastle will be happy that the region will now have a stronger voice in regional affairs and national policy, with transport infrastructure and investment being a high priority. There is a growing sense of ambition and confidence in the region, there are big plans for the future, and this is just the beginning. \n“The three authorities have done a sterling job securing this deal, and deserve our congratulations. \n“To finally get the tired Tyne and Wear Metro rolling stock replaced really is the icing on the cake, meaning that running cost will be cut considerably, and the whole experience for the millions of passengers that use the system annually will be greatly improved.” \nBur Mr Hammond also had to give out a gloomy outlook for the UK economy, as forecasts revealed downgrades to growth ahead of Britain’s divorce from the European Union. Read More Top North East employer AkzoNobel ends merger talks with US rival Axalta \nBritain’s fiscal watchdog, the Office for Budget Responsibility (OBR) downgraded gross domestic product forecasts (GDP) from 2% to 1.5% for this year, and said growth would continue to fall for the next three years. \nStephen Martin, director general of the Institute of Directors, said: “The Chancellor dipped his toe in the water with this Budget, but failed to make a splash with business. Next year’s Budget is too close to point of Brexit to make a difference, so this was his last chance to give business the boost it desperately needs. With an unpredictable future looming, it was absolutely essential that businesses be given the confidence and incentive to invest in their equipment and employees. \n“Philip Hammond faced a difficult task today, with ugly growth forecasts, and plenty of demands on the Treasury, but companies will still be disappointed with what they got. Individually there were some positive measures, but overall, the Budget was more defined by what it omitted than what it included. \n“Investment in maths and computer science in schools, re-training, and transport for the Northern Powerhouse are all positive. But the Budget was simply too tepid in other areas. Adjusting the up-rating of business rates was welcome, but too little relief was provided for small businesses now.” \nThe Federation of Small Businesses said SMEs would welcome what it called a “business-friendly Autumn Budget”. Like us on Facebook", "external_links": [], "published": "2017-11-22T18:13:00.000+02:00", "crawled": "2017-11-22T19:13:46.001+02:00", "highlightTitle": ""}