{"organizations": [], "uuid": "7cd5906993b31417d8dfbe52e0e326e5c7828c23", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article715297.ece/ALTERNATES/s1200/AH_001-01-11-17-129JPG.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/news/business/leicestershire-rutland-rich-list-biggest-803527", "country": "US", "domain_rank": 48128, "title": "", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.2, "site_type": "news", "published": "2017-11-21T09:00:00.000+02:00", "replies_count": 0, "uuid": "7cd5906993b31417d8dfbe52e0e326e5c7828c23"}, "author": "Leicester Mercury", "url": "http://www.leicestermercury.co.uk/news/business/leicestershire-rutland-rich-list-biggest-803527", "ord_in_thread": 0, "title": "", "locations": [], "entities": {"persons": [{"name": "invalid em", "sentiment": "negative"}, {"name": "david samworth", "sentiment": "none"}, {"name": "vichai srivaddhanaprabha", "sentiment": "none"}, {"name": "graham", "sentiment": "none"}, {"name": "ian strachan", "sentiment": "none"}, {"name": "gary lineker", "sentiment": "none"}, {"name": "freddie linnett", "sentiment": "none"}, {"name": "smith", "sentiment": "none"}, {"name": "storer", "sentiment": "none"}, {"name": "hilary devey", "sentiment": "none"}, {"name": "wolfson", "sentiment": "none"}, {"name": "englebert humperdinck", "sentiment": "none"}, {"name": "john bloor", "sentiment": "none"}, {"name": "will adderley", "sentiment": "none"}, {"name": "edelin davies", "sentiment": "none"}, {"name": "douglas woolf", "sentiment": "none"}, {"name": "dinesh patel", "sentiment": "none"}, {"name": "david wilson", "sentiment": "none"}, {"name": "peter ogden", "sentiment": "none"}, {"name": "john deacon", "sentiment": "none"}, {"name": "tom joule", "sentiment": "none"}, {"name": "robert jelley", "sentiment": "none"}, {"name": "murphy", "sentiment": "none"}, {"name": "andrew hancock", "sentiment": "none"}, {"name": "alison bell", "sentiment": "none"}], "locations": [{"name": "leicester city", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "rutland", "sentiment": "none"}, {"name": "donington", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}], "organizations": [{"name": "rutland rich list", "sentiment": "none"}, {"name": "motorsport vision", "sentiment": "none"}, {"name": "leicester mercury business monthly", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get Daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nForget all the talk of the Brexit impact or economic uncertainty. \nIf you’re at the top of the wealth pile things are going pretty well. \nThe richest people in Leicestershire have increased their combined fortunes by more than £1.5 billion according to the 2017 Leicestershire and Rutland Rich List . \nThere are winners and losers, of course, but those involved in construction, property, transport and logistics and food production have all seen an increase in their wealth over the past year. \nYou can see the list of the top 50 here from 11am on Tuesday. \nOur biggest winner is housebuilder John Bloor who has seen a £200 million increase in his fortune. \nRetail is struggling nationwide as life on the high street gets tougher and the online/offline battle between bricks and clicks continues. \nLord Wolfson’s Next chain and the Smith family’s Shoe Zone have faced challenging times. \nIn the retail business, only Tom Joule has prospered, having carved out a niche in the fashion marketplace. \nNonetheless, the entrepreneurship of Leicestershire people and the hard graft and determination of those who have chosen to make our county their home have combined to ensure that the money keeps rolling in for the wealthiest individuals and families. Desire to be better \nOnce again, many on this year’s league table of the super-rich weren’t born here, or indeed in the UK. \nSome came here from overseas to make their fortunes, often under enormous hardship. \nOur Rich List demonstrates the contribution made to the wealth of the county by people who have chosen to make Leicestershire their home. \nFor many on our list, life has been a story of risk-taking and a desire to better themselves. \nMany on our list came from a humble background, but have used their talents, combined with hard work, to join the exclusive club of multi-millionaires. Good causes \nAnother striking feature which crops up year after year is philanthropy, with most on our list giving generously to charities and good causes, much of it locally. \nOnly one person in our roll call of the 50 wealthiest – the Duke of Rutland – has inherited their fortune through ancestral accident. \nThis list is largely a chronicle of ordinary people who, through extraordinary talent, a great idea, or hard work have reaped the rewards of enviable wealth. \nThe amassed fortunes of our richest 50 add to up to a remarkable total of £13.92 billion – compared to last year’s £12.4 billion. Billionaire trio \nThe region again has its trio of billionaires – Leicester City owner Vichai Srivaddhanaprabha, retail king Will Adderley, of Dunelm, and motorcycles-to-housebuilding magnate John Bloor. \nProperty remains king in the wealth stakes – building it, investing in it or selling it. \nThe Murphy family, David Wilson, Robert Jelley, Douglas Woolf and Edelin Davies all fly the flag for the property and construction sectors. \nFood once again plays a big part in the list thanks to pie makers Sir David Samworth and the Storer family, as well as confectionary millionaire Andrew Hancock and Dinesh Patel, whose family has given us Cofresh Asian snacks. \nMusic is represented by Englebert Humperdinck and John Deacon while Gary Lineker and Leicester City’s owners fly the football flag. New arrivals \nWe have some new entrants this year – the highest being Sir Peter Ogden, joint owner of MotorSport Vision which now operates the Donington race circuit. \nOther newcomers include Graham and Alison Bell, the husband and wife team behind Available Car. \nAgain there are few women in our list. \nFreddie Linnett, Alison Bell and Hilary Devey are listed. \nHowever, it is fair to say that many of the men have made their fortunes with the indispensable help of wives and partners. \nThe entry price for making the list has gone up again. \nYou’ll need a personal fortune of at least £30 million to qualify for a place. Ian Strachan is the author of the 2017 Leicestershire and Rutland Rich List . Click here to read a countdown of the top 50 from 11am on Tuesday - or pick up a copy of the Leicester Mercury Business Monthly in today's paper. Like us on Facebook ", "external_links": [], "published": "2017-11-21T09:00:00.000+02:00", "crawled": "2017-11-21T12:24:11.002+02:00", "highlightTitle": ""}