{"organizations": [], "uuid": "5d08cc2ecd6a0e3dbf01d719dce13ef8d74c4df3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13722918.ece/ALTERNATES/s1200/John-McCabe.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-leader-tells-13856474", "country": "GB", "domain_rank": 21960, "title": "North East business leader tells Government to 'stop playing politics' on Brexit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-03T19:23:00.000+02:00", "replies_count": 0, "uuid": "5d08cc2ecd6a0e3dbf01d719dce13ef8d74c4df3"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-leader-tells-13856474", "ord_in_thread": 0, "title": "North East business leader tells Government to 'stop playing politics' on Brexit", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "North East business leader tells Government to 'stop playing politics' on Brexit John McCabe, president of the North East England Chamber of Commerce, says Ministers need to act urgently Share North East England Chamber of Commerce president John McCabe Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe head of the North East’s largest business organisation has issued a “get on with it” warning to the Government over Brexit. \nJohn McCabe, president of the North East England Chamber of Commerce, made the plea for clarity on issues including customs procedures, immigration, regulation and funding opportunities at the Chamber’s annual dinner in Newcastle. \nThe Chamber did not take a formal stance on Brexit before the 2016 referendum, though a poll shortly before the vote showed almost two-thirds of members wanted to stay in the EU while around a third wanted to leave. \nMr McCabe said Ministers needed to now “stop playing politics” and address the challenges of Brexit. \nHe said: “Chamber members were split on the issue of Brexit before the referendum, and just as we didn’t take sides in advance of the vote, we’re not about to call for the electorate’s decision to be reversed. \n“But business urgently demands clarity and certainty, so our message to Government is plain and simple: stop playing politics with our futures and get on with the biggest policy challenge this country has faced in generations. \n“And business needs to be fully engaged in this. It is no good us standing back and criticising from the sidelines. We have to contribute our knowledge and expertise to give Government the best possible chance of getting a positive outcome from the negotiations.” \nMr McCabe’s plea for clarity on Brexit echoes similar warnings from other business groups, including the CBI and the Federation of Small Businesses (FSB). \nHe was followed on stage at the Chamber dinner by guest speaker Sir Vince Cable, the Liberal Democrat leader, who said he believed there was even a small possibility Brexit might not happen. Vince Cable interview at the Crowne Plaza Newcastle (Image: Newcastle Chronicle) \nSir Vince said: “Even though Brexit hasn’t yet happened, we’re already beginning to see the impacts, such as the very rapid draining away of European nationals, a lot of whom don’t think they’re wanted any more. That’s proving damaging for businesses and our universities. \n“Businesses in general are starting to sit on their cash and why would you invest large amounts of money when you don’t know what the hell’s going to go happen? The risks of us crashing out of the EU with no deal are becoming very real. Indeed, the Government announced yesterday that they’re spending £600m of our money preparing for that scenario. Read More Vince Cable admits Westminster abuse scandal is 'dark moment' for politics during Newcastle visit \n“If that does happen there will be very serious consequences. In a supply chain industry, like motor vehicles, you would have tariffs every time a widget crossed a national barrier. \n“There’s more than the possibility that this whole thing might not even happen. It’s not a big possibility, perhaps around 25%, but I can see a situation in a year’s time where the Government tries to find a way out.” \nMeanwhile, a poll of foreign businesses which have invested in Britain found that around eight out of 10 are pessimistic about the outcome for the UK in the divorce talks with the European Union, polling has found. Read More Agricultural firm H&H sees profits fall in 'sluggish' market \nMost firms, 55%, believe Brexit will have a “negative” impact on their future investments in the UK, while just 8% said the vote to leave the bloc has had a positive effect on their company. \nThe survey of members of 13 foreign Chambers of Commerce, including the US, China, France and Germany, found 82% were either “not very” or “not at all confident” of a positive result for Britain in the exit talks compared to 13% who expressed optimism. Like us on Facebook", "external_links": [], "published": "2017-11-03T19:23:00.000+02:00", "crawled": "2017-11-03T20:24:15.000+02:00", "highlightTitle": ""}