{"organizations": [], "uuid": "32973fda8dbb45a7bf5f27022e84a7b29f1f0ce5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article802688.ece/ALTERNATES/s1200/LECG20171102D-048_C.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/news/business/built-leicester-noble-supercar-boss-802610", "country": "US", "domain_rank": 48128, "title": "Built in Leicester - Noble supercar boss Peter Boutwood's dream of creating an \"affordable\" model - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.662, "site_type": "news", "published": "2017-11-20T13:36:00.000+02:00", "replies_count": 0, "uuid": "32973fda8dbb45a7bf5f27022e84a7b29f1f0ce5"}, "author": "Tom Pegden", "url": "http://www.leicestermercury.co.uk/news/business/built-leicester-noble-supercar-boss-802610", "ord_in_thread": 0, "title": "Built in Leicester - Noble supercar boss Peter Boutwood's dream of creating an \"affordable\" model - Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "peter boutwood", "sentiment": "negative"}, {"name": "nick mason", "sentiment": "none"}, {"name": "paul mccartney", "sentiment": "none"}, {"name": "jack nicholson", "sentiment": "none"}, {"name": "simon le bon", "sentiment": "none"}, {"name": "boy george", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "derek bell", "sentiment": "none"}, {"name": "tom cruise", "sentiment": "none"}, {"name": "carol vorderman", "sentiment": "none"}, {"name": "david bowie", "sentiment": "none"}, {"name": "hugh grant", "sentiment": "none"}, {"name": "pink floyd", "sentiment": "none"}, {"name": "noble", "sentiment": "none"}, {"name": "duran duran", "sentiment": "none"}, {"name": "damon hill", "sentiment": "none"}, {"name": "lee noble", "sentiment": "none"}, {"name": "michael jackson", "sentiment": "none"}, {"name": "chris hoy", "sentiment": "none"}, {"name": "george michael", "sentiment": "none"}, {"name": "justine halifax", "sentiment": "none"}, {"name": "chris gordon", "sentiment": "none"}, {"name": "le mans", "sentiment": "none"}, {"name": "derek", "sentiment": "none"}, {"name": "peter", "sentiment": "none"}, {"name": "roger taylor", "sentiment": "none"}, {"name": "elton john", "sentiment": "none"}], "locations": [{"name": "leicester", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "hungary", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}, {"name": "centurion way", "sentiment": "none"}, {"name": "barwell", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "rolling stones", "sentiment": "none"}, {"name": "meridian business park", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nIn an industry that thrives on mass production, it’s unusual to find a manufacturer that still makes cars completely by hand. Noble Automotive is one of only a few which does that – and appears to be doing it extremely well, writes Justine Halifax. \nWith a base price of £200,000 to £300,000, its M600 Coupe, Speedster and CarbonSport models are out of the reach of the everyday car enthusiast... for now at least. \nBut despite the hefty price tags, it’s not short of orders. \nNoble’s bespoke supercars continue to be snapped up by the rich and famous at home and overseas with this year being particularly “rewarding”. \nFor the past decade, managing director Peter Boutwood has been at the helm of the firm, which was founded by former racing car driver Lee Noble in Barwell in 2000. \nPeter said: “Although we don’t release production figures, I can say we are doing well. \n“This year particularly has been very rewarding. It’s hugely gratifying that we appear to have a reputation far outstripping our actual market share.” Peter Boutwood, the boss of Noble Automotive, in Leicester, sitting pretty in an M600 Sportster (Image: Chris Gordon) \nPeter believes that Noble’s personal touch is key to its success. \nClients love the fact that each car is hand-built to their exact specifications and they can also view the progress of their unique supercar being built at the Centurion Way factory on Meridian Business Park, just outside Leicester, as well as meet the engineers and personnel involved. \nAn astonishing fact, he said, is that no-one who has ever bought one of Noble’s cars has ever sold it on. \nPeter said: “It is our corporate policy never to divulge the identities of our clientele. \n“That said, depending on location, the attendance to view the build of their new ‘baby’ is a very popular option. It also allows us all to bond with our clients. \n“Getting to know them personally is a very important part of the Noble experience. \n\"Almost all our clients, going right back to car number one – still in the hands of its original owner – have become great friends. \n“It is an interesting fact that none of our clients have sold their cars. Made in Leicester - a Noble M600 supercar \n“They have all kept their cars – this for us is a flattering and positive fact.” \nWhile the firm can’t identify buyers, Peter was able to give an insight into who had taken one of their cars for a test drive. \nThey include actors Tom Cruise and Hugh Grant, Duran Duran’s Simon Le Bon, Queen’s Roger Taylor, Pink Floyd’s Nick Mason, TV’s Carol Vorderman, Olympic cycling legend Sir Chris Hoy, Le Mans winner Derek Bell and ex- F1 world champion Damon Hill. \nPeter, whose background is in graphic design, is no stranger to rubbing shoulders with pop stars and celebrities during his career. \nHe was a former partner in shops in London designing clothes for the likes of David Bowie, George Michael, Michael Jackson, Boy George, Jack Nicholson, the Rolling Stones, Sir Paul McCartney and Sir Elton John. \nAsked who had made the biggest impression during his time at Noble, he cited ex-British racing driver Derek Bell MBE. \nThe father-of-two said: “I suppose the best feedback as far as understanding our ‘supercar’ would probably be Derek Bell. \n“When someone drives your car who has won Le Mans five times, and gives you feedback, you listen with interest. \"Where does this bit go?\" - every Noble is handbuilt to perfection \n“In fact Derek told me, ‘Ten years ago I could have driven in the M600 to Le Mans, taken my luggage out, put a number on, won the race, then driven home again’.” \nWith business booming for Noble and its 15-strong team of employees, are there any plans to expand? \nIt has opened a UK dealership at High Wycombe and is also looking to set up European service centres, potentially in Germany and Italy, but that’s the extent of the company’s ambitions at present. \nThis is due to the fact that while clients are happy to have cars serviced outside the factory, Peter says they are “less keen to forfeit the buying pleasure of a direct sale with us at our Leicester facility”. \nHe said: “I think it’s part of the buying low volume, bespoke experience to deal directly with us here. \n“The relationship of client/factory is very important to us.” \nPeter, whose favourite M600 is the “beautiful and unique” CarbonSport, is tight lipped over whether there are any new models in the pipeline though, saying: “We cannot at this stage give any information regarding the development or not of a new model.” \nBut Peter, whose favourite M600 is the “beautiful and unique” CarbonSport, which has only just been fully released and delivers a “spectacular uniqueness”, went on to reveal that if it did develop a new model it would be down a more affordable route. \nHe said: “If we did create a new model, it would not supersede the M600 but partner it, perhaps targeting a slightly less affluent market. \n“We realise that the M600 is an aspirational car that has a great deal of appeal to those who enjoy a rewarding and pure driving experience, sadly missing in many of today’s supercars. \n“However, it is unfortunate that it is beyond the reach of many. \n“It has been my fervent wish to be able to create a more affordable car which retains the DNA and attributes of the M600. \n“However, manufacturing low volume hand built cars in the UK is, by nature, a costly business. That said we’d love to explore that option, maybe sometime in the future it will happen.” \nNoble strives to keep as many of its components British, currently at 75 per cent, as well as local to bolster the region’s economy, so is it worried about the impact Brexit could have? \nPeter said: “Obviously as a business with an export/import market we are deeply concerned about the Brexit negotiations. \n“Personally I wanted to, and still want to, remain in the EU. Read More Tickets for Leicester Christmas ice rink go on sale today and this is how much it costs \n“Without appearing too political, I think that not enough information regarding our exit was given, I also think that many ‘remainers’ were complacent as to a successful result. \n“This, unfortunately for the stability and growth of business, has resulted in an unexpected and confusing position and rather put the UK on the left foot. Read More One-in-four shops stands empty in this city centre street, despite £1.3m road improvements \n“It surely would have made more sense to ensure a suitable exit policy and/or agreement was in place before leaving?.” \nNoble is currently busy working on “two special cars” – a CarbonSport for a client in Hungary, and a Speedster for a Chinese client, which will take them into 2018. \nWith care and attention to detail of paramount importance, each car has 20 build stages that take around three months to get through – at least – depending on client specs. \nSo it’s no wonder Noble’s supercars are on many people’s wish lists. Like us on Facebook ", "external_links": [], "published": "2017-11-20T13:36:00.000+02:00", "crawled": "2017-11-20T15:11:42.002+02:00", "highlightTitle": ""}