{"organizations": [], "uuid": "dfe14aa19d85d566d1ceac5b25d08bc4f26c1c38", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13848214.ece/ALTERNATES/s1200/Bank-of-England-diversity.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/mortgage-payments-set-rise-around-13848186", "country": "GB", "domain_rank": 21960, "title": "Mortgage payments set to rise around £15 a month after interest rates put up", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-02T14:15:00.000+02:00", "replies_count": 0, "uuid": "dfe14aa19d85d566d1ceac5b25d08bc4f26c1c38"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/mortgage-payments-set-rise-around-13848186", "ord_in_thread": 0, "title": "Mortgage payments set to rise around £15 a month after interest rates put up", "locations": [], "entities": {"persons": [{"name": "dave ramsden", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "jon cunliffe", "sentiment": "none"}, {"name": "mark carney", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "business mortgage", "sentiment": "negative"}, {"name": "bank of englan", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "mpc", "sentiment": "none"}, {"name": "bank", "sentiment": "none"}, {"name": "bank of england", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "bank's nine-strong monetary policy committee", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Mortgage   Bank of England committee votes for 0.25% rise in the first such move since July 2007 and hints more rises could be on the way Share Click to play Tap to play The video will start in 8 Cancel Play now Get   Bank of England has hiked interest rates to 0.5% in the first rise for over a decade and signalled more increases are on the way as it looks to cool surging inflation. \nPolicymakers on the Bank's nine-strong Monetary Policy Committee (MPC) voted 7-2 in favour of the quarter point rise, which marks the first rates increase since July 2007. \nThe move comes as the Bank looks to dampen Brexit-fuelled inflation, which it predicts will now peak at around 3.2% this autumn. \nThe Bank's quarterly inflation report also suggested two more rate hikes are likely over the next three years to return inflation back to its 2% target, which could see rates hit 1% by the end of 2020. Read More Warning signs on North East economy highlighted in two new reports \nThe milestone rate hike comes as the Bank cut its forecast for growth to 1.6% for 2017 from the 1.7% previously predicted, but held forecasts at 1.6% for 2018 and 1.7% for 2019. \nMillions of borrowers on variable rate deals will be impacted by the rates decision, which will add around £15 a month to the cost of the average mortgage, while it will offer some relief to savers hit by surging inflation and negligible returns. \nBut a quarter point rise will only reverse the emergency cut seen in the aftermath of the Brexit vote shock in 2016 as the Bank sought to head off turmoil in the economy. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nAnd the Bank said the impact on mortgage borrowers would be modest and gradual, with around 60% on fixed rate deals. \nSterling plunged over 1% against both the dollar and the euro to 1.31 US dollars and 1.12 euro respectively as financial markets were left unconvinced about further rate rises. \nIn minutes of the MPC meeting, the Bank said that debt costs would remain \"historically very low\" despite the quarter point rise. \nIt stressed that monetary policy would \"continue to provide significant support to jobs and activity\", and any further rate rises would be \"at a gradual pace and to a limited extent\". \nExperts estimate that eight million Britons have never seen interest rates rise in their adult lives, with borrowing costs having languished at rock-bottom lows since the financial crisis. \nThere are fears over the timing of the cut, given the uncertainty amid Brexit negotiations and as Britons are being squeezed by paltry wage growth and sharply rising inflation. \nThe Bank said the majority of policymakers who voted for the rise felt they could no longer tolerate above-target inflation despite Brexit uncertainty, with signs that other pressures were also building. \nOil prices in particular have risen sharply in recent months. \nBut for the two MPC members who voted to hold rates at 0.25%, Sir Jon Cunliffe and Sir Dave Ramsden, there were doubts over these domestic inflation pressures and fears over muted wage growth. \nIn the Bank's latest set of forecasts, it said the economy would continue to expand \"modestly\" over the next few years, with growth of 1.7% pencilled in for 2020. \nThe economy has performed better than feared since the EU referendum despite the pound's plunge, with growth edging up to 0.4% in the third quarter from 0.3% in the previous three months, according to last week's official figures. \nBut the Bank warned over \"considerable risks\" to the outlook ahead of Brexit, while its own forecasts are based on a smooth transition period to the UK's withdrawal from the EU. \nIt said the Brexit vote was already having a \"noticeable impact\" on the economy, but that growth was being supported by \"resilient\" consumer confidence, a robust global economy and its emergency rate cut from last August. \nBank governor Mark Carney said the move to hike rates was driven by the need to bring inflation down to target. \nHe said: \"It's not so much where inflation is now, but where it's going that concerns us.\" \nHe added: \"In many respects the decision today is straightforward: with inflation high, slack disappearing and the economy growing at rates above its speed limit, inflation is unlikely to return to the 2% target without some increase in interest rates. \n\"Of course, these are not normal times. Brexit will redefine the UK's relationship with our largest trade and investment partner. Like us on Facebook", "external_links": [], "published": "2017-11-02T14:15:00.000+02:00", "crawled": "2017-11-02T15:43:20.023+02:00", "highlightTitle": ""}