{"organizations": [], "uuid": "d0f15b5c6c1661e94a7f1050cae7bb28cfeadfae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article738135.ece/ALTERNATES/s1200/padd1JPG.jpg", "site_section": "http://www.westernmorningnews.co.uk/entertainment-news.rss", "section_title": "devonlive - What's On News", "url": "http://www.devonlive.com/whats-on/whats-on-news/marks--spencer-reveals-christmas-738094", "country": "GB", "title": "Marks & Spencer reveals Christmas 2017 advert - and it features Paddington Bear", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-07T13:25:00.000+02:00", "replies_count": 0, "uuid": "d0f15b5c6c1661e94a7f1050cae7bb28cfeadfae"}, "author": "Abbie Bray", "url": "http://www.devonlive.com/whats-on/whats-on-news/marks--spencer-reveals-christmas-738094", "ord_in_thread": 0, "title": "Marks & Spencer reveals Christmas 2017 advert - and it features Paddington Bear", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nMarks and Spencer has finally revealed its Christmas advert for 2017 and it is simply magical. \nThe 90-second ad sees Paddington Bear interrupt a Christmas Eve burglar, whom he mistakes for Father Christmas, before helping him deliver a bag of stolen presents back to their rightful homes. \nMistaking a bearded burglar wearing a red coat and red stocking on his head for Santa, Paddington assists him in returning all of the pinched presents back to where they belong. \nScoffing the odd mince pie along the way, he innocently helps the thief embrace the true spirit of festive period and recognise the error of his ways. Read More The Coca Cola truck is coming to Devon for Christmas \nM&S’s global brand and marketing director, Rob Weston, said they wanted an ad that appealed to the whole family and that was “fun” after a year packed with “lots of unsettling news”. \n“People are looking forward to escaping into the Christmas bubble, and our aim is to provide you with a story that is charming and leaves you feeling good at the end,” he said. \nDescribing the partnership, Mr Weston said the marmalade-loving bear from Peru is a “much-loved British icon”, adding: “There are few things more British than Paddington and M&S.” \nThe retail giant partnered with StudioCanal to bring to life this year’s offering ahead of the release of the latest film, Paddington 2 on November 10. Read More Here's what you can eat and drink at Exeter's Christmas Market \nCreated by Grey London, the ad features Ben Whishaw as the voice of Paddington, and also sees a cameo-appearance by veteran newsreader Angela Rippon. \nDeclining to comment on the cost of the ad, Mr Weston said it is “down on last year”, and described the release of retailers’ Christmas campaigns as “UK advertising’s Super Bowl time”, in which you “have to stand out from the crowd”. \nM&S chief executive Steve Rowe is overseeing an overhaul of the group’s strategy that involves closing under-performing stores and cutting back on clothing while boosting its food arm. \nMr Rowe has also been rocked in recent weeks by the departure of Jo Jenkins, a senior member of its troubled clothing division, just weeks after she started a new role. Read More Exeter Christmas Market 2017: When does it open and what is the line-up? \nTo compound matters, retailers across the board have been stung by rising costs and falling consumer confidence as Brexit fuelled inflation hits the sector hard. \nM&S has already warned of tough conditions on the high street and the results will also be the first under new chairman Archie Norman. \nDespite this, as part of the campaign and in a first for M&S, around 200,000 copies of a limited edition children’s storybook which tells the tale of the Christmas ad will be published. \nAll profits raised through sales of the illustrated book, written by Timothy Knapman, will be donated to the NSPCC to help fund Childline over the festive period, the retailer said. Read More ", "external_links": [], "published": "2017-11-07T13:25:00.000+02:00", "crawled": "2017-11-07T13:46:17.003+02:00", "highlightTitle": ""}