{"organizations": [], "uuid": "0fbdafc35fbcff8bf2e30f10c78cbdc68c84641e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13961074.ece/ALTERNATES/s1200/CFR_NJL_271117honcho_01.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/app-aimed-revolutionise-car-insurance-13961012", "country": "GB", "domain_rank": 21960, "title": "App aimed to revolutionise car insurance in £650,000 crowdfunding appeal", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-27T18:00:00.000+02:00", "replies_count": 0, "uuid": "0fbdafc35fbcff8bf2e30f10c78cbdc68c84641e"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/app-aimed-revolutionise-car-insurance-13961012", "ord_in_thread": 0, "title": "App aimed to revolutionise car insurance in £650,000 crowdfunding appeal", "locations": [], "entities": {"persons": [{"name": "gavin sewell", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "sewell", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "invalid email", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "european investment bank", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "App aimed to revolutionise car insurance in £650,000 crowdfunding appeal Newcastle tech firm honcho has already raised more than £260,000 in its bid to launch the app Share The honcho app aims to revolutionise the car insurance market (Image: honcho) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nA Newcastle tech business is turning to crowdfunding to raise £650,000 after EU funds allocated to support the launch of its new app were put on indefinite hold. \nThe honcho app aims to create the UK’s first ‘reverse auction’ market-place for car insurance in a bid to reduce costs for motorists and decrease the dependence on price comparison websites. \nThe app enables insurers to bid for consumers’ business, competing with each other to offer the best value package in real time. Insurers pay honcho £1 for the right to bid, enabling them to reduce premiums for consumers. \nhoncho turned to crowdfunding platform CrowdCube when it became apparent that funds from the European Investment Bank, contributed to by all members of the EU, would not be released for the foreseeable future. \nRather than delay the launch of its app, the team at honcho approached CrowdCube to help them realise their ambitions and objectives, and to offer UK investors the chance to take a stake in the company. \nThe campaign aims to raise £650,000 to help bring the app to market and, with 27 days until it closes, it has so far raised £266,360 from 115 investors. \nGavin Sewell, CEO of honcho, believes that crowdfunding will be a vital source of capital for many new and expanding businesses after Brexit. \nHe said “Businesses cannot afford to wait for political negotiations to decide if funds allocated to UK regions will be released. \n“Crowdfunding is the logical and immediate solution for innovative tech start-ups such as honcho looking for alternative funds, and also gives UK investors the chance to support enterprises and get in on the ground floor of exciting new ventures.” Read More Insolvency risks rise for North East industries, latest R3 research reveals \nThrough the CrowdCube platform, investors, both large and small, can take a stake in honcho. \nMr Sewell said that honcho will initially act as a ‘matchmaker’ between customers and insurers, initially for car insurance, but ultimately across a range of other insurance products and markets. \nHe added: “We believe honcho can revolutionise the insurance market. It benefits both customers and insurance companies, helping to end the blight of spiralling insurance costs which are causing misery for many, especially young motorists. \n“We believe that through crowdfunding, our future customers have a chance to take a stake in a company that will make their lives better as well as hopefully offering a healthy return on their investment.” Like us on Facebook", "external_links": [], "published": "2017-11-27T18:00:00.000+02:00", "crawled": "2017-11-27T18:24:48.017+02:00", "highlightTitle": ""}