{"organizations": [], "uuid": "11fa9c50f4afbeb6a1a8ce618188b70511541a5d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13866755.ece/ALTERNATES/s1200/FILE-Tube-Union-Threatens-Boxing-Day-Strike.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13862938", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: London to receive 10 times more transport investment than northern regions", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-07T10:00:00.000+02:00", "replies_count": 0, "uuid": "11fa9c50f4afbeb6a1a8ce618188b70511541a5d"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13862938", "ord_in_thread": 0, "title": "Business Breakfast LIVE: London to receive 10 times more transport investment than northern regions", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "KEY EVENT Action needed on 'cowboy client' culture, former Owen Pugh boss demands \nThe chairman of collapsed civil engineering group Owen Pugh has called for firmer leadership to stamp out an endemic culture of “bully-boy tactics” within the construction sector . \nOwen Pugh went into administration last month following winding-up orders from a number of creditors, resulting in the loss of more than 250 jobs with the closure of sites at Dudley,Cramlington, Blaydon and Stockton-on-Tees. \nChairman John Dickson complained of bullying from the main contractors that dominate contracts for large infrastructure projects, saying they would often withhold payments from the company, actions which triggered the cash-flow problems that led to the company’s demise. \nNow Mr Dickson has called for tougher action from the top down, to eradicate bullying tactics he says have become a part of the construction trade’s culture ever since the credit crunch of 2008. \nHe was speaking after new research from the Federation of Master Builders (FMB), which found that three quarters of construction SMEs say ‘cowboy clients’ are hampering their business. \nMr Dickson said: \nPeople think that it’s small outfits doing this but these are big, national and sometimes international companies who use ‘bully-boy tactics’ to force their supply chain to do really difficult things, and this sort of thing is absolutely common. It is endemic. \nI have got example after example where our cowboy client has made a mistake and not got the site management right and forced their supply chain to pay for their mistakes. \nClients have lied and cheated about work that has been done, told us to produce thousands of records and threatened us with not paying if we don’t. It’s just an excuse for them not to pay. \nHe added: \nIn April I raised this issue at the highest level at a CBI Construction Council meeting in London, and all the major companies’ CEOs were around the table, agreeing it was a disgrace, and report after report has been published saying how we have to behave better in the supply chain. \nBut there is a real failure in leadership within the industry to tackle this. We need better leadership and some legal work too. John Dickson of Owen Pugh 8:55 Jonathon Manning Imperial gearing up for vaping rush \nImperial Brands has signalled it is “stepping up” its expansion into the vaping market as the tobacco industry comes under pressure from falling cigarette sales.The company, which owns the blu e-cigarette brand, said it will press ahead with new e-vapour launches in new and existing markets and consumer trials of “heated tobacco products” as it looks to cash in on “significant growth opportunities”. The group added: \nE-vapour remains our priority: in our view this is by far the largest next generation product opportunity and we believe it offers the greatest current potential for long-term sustainable growth. \nImperial, behind Davidoff and Lambert and Butler cigarettes, is the latest in a long line of tobacco firms searching for additional revenue streams as traditional cigarette consumption continues to fall.The company sold 265.2 billion cigarettes last year, a decline of 4.1%.The firm made the vaping announcement alongside full-year results which saw revenue nudge up from £7.1bn to £7.76bn.However, the figures were flattered by foreign exchange fluctuations and sales were in fact down 2.6% on a constant currency basis.Pre-tax profit came in at £1.86bn, up from £907m, after it reaped the benefit of lower finance costs.Operating profit rose from £2.23bn to £2.28bn.Boss Alison Cooper said: \nAs anticipated, whilst the increased investment impacted current year revenue and profit, it is strengthening the business to support improved top-line growth going forward from both tobacco and next generation products. \nWe will also be stepping up our activities in next generation products, with new e-vapour launches in new and existing markets and consumer trials of heated tobacco products. We have continued to take decisive cost action to mitigate a tough trading environment and to protect our investments. Vaping (Image: Getty Images Europe) 8:50 Jonathon Manning New Look swings to loss as the high street continues to suffer \nStruggling fashion chain New Look has swung to a half-year loss as it became the latest retailer to fall victim to tough conditions on the high street.New Look, owned by South African investment group Brait, booked an underlying operating loss of £10.4m in the six months to September 23, which compares with a £59.3m profit in the same period last year.The retailer’s UK like-for-like sales crashed 8.4% in the period, while total revenue fell 4.5% to £686m.Retailers across the board, such as Next, have been stung by rising costs and falling consumer confidence as Brexit-fuelled inflation hits the sector hard.The results come as growth in non-food sales hit a record low in October ahead of the critical Christmas trading season, according to figures from the British Retail Consortium (BRC).Alistair McGeorge, who has been parachuted in to the role of executive chairman for another stint at New Look, said the results reflect a “challenging retail environment on the UK high street”.Mr McGeorge returned to the firm following the abrupt departure of chief executive Anders Kristiansen in September.At the time, Brait said that Mr Kristiansen’s departure was “mutually agreed”.Mr McGeorge said: \nThe immediate focus in this period of transition will be to deliver stability and get the business back to basics by reconnecting with the New Look customer and recovering our broad appeal. \nWhilst we’re not anticipating a reversal in fortunes overnight, I am confident we will implement the necessary changes to get the company back on track. \nThe group is also struggling under a £1.2bn debt mountain and is reportedly in talks with its lenders about restructuring.But New Look said that it has an “adequate liquidity and cash position” with £242.5m in cash, liquidity and operating facilities available. New Look of one of their stores, as the high street chain revealed tumbling sales and earnings in a \"difficult\" market and warned trading would remain under pressure into 2018 (Image: New Look/PA Wire) 8:45 Jonathon Manning Chief executive at Boldon's Immunodiagnostic Systems steps down after eight months \nThe chief executive who has been spearheading a turnaround at North East medical testing kit company Immunodiagnostic Systems has stepped down seven months into his role . \nThe company announced that Regis Duval has left his role as a director of the company and all associated directorships of the Boldon-based business with immediate effect, stepping down for personal reasons in order to spend more time with his family in Luxemburg. \nThe firm said that since his appointment as chief executive officer in March of this year, Mr Duval has led several initiatives to halt the decrease in revenues the firm has been experiencing, in particular working on employee engagement across the company, improving the operations and filling several important management positions. \nA year ago Immunodiagnostic Systems Holdings (IDS) said it had a goal of stabilising revenues on a like-for-like basis and, in an update released on October 20, directors said its core laboratory business came close to this with a decrease of 1% year on year. \nFollowing the departure of Mr Duval, Jaap Stuut has taken up the chief executive officer with immediate effect. \nMr Stuut has been with the company since 2013, and was previously responsible for its global marketing and corporate development, as well as having the direct sales responsibility for the USA and Brazil. \nPrior to joining IDS, Jaap worked at SHO Centra for Medical Diagnostics, where he held the position of chief operating officer, responsible for sales, marketing and operations. \nDr Burkhard Wittek, non-executive chairman of IDS, said: \nIDS would like to thank Regis for his contribution to IDS during the time he spent with us. \nThe improvement in employee engagement achieved in his time is testimony to his leadership skills. He is also leaving us a simplified organization with all key positions filled. We wish him all the best in his family life and future career. \nI would like to welcome Jaap as the new CEO. When I became chairman of the company, Jaap was a key member of the marketing department. \nIn the years since, he was first promoted to lead the marketing department, then added the corporate development function to his remit, and finally taking on certain direct sales responsibilities. Immunodiagnostic Systems products KEY EVENT Newcastle to Edinburgh rail journeys of less than an hour envisaged in Scottish study \nNewcastle to Edinburgh rail journey times of less than an hour have been outlined in a new study being commissioned by the Scottish Government. \nScottish First Minister Nicola Sturgeon used a a speech in the North East today to announce a study into faster rail journeys between Scotland and England, saying both parts of the UK stand to benefit from closer links. \nMrs Sturgeon confirmed that feasibility studies were being commissioned to identify options to help improve train journey times, capacity, resilience and reliability on services between Scotland and England. \nStudies would be taking place on both east and west coast rail routes, with the first looking at how the route between Dunbar, in the south east of Scotland, and Newcastle could be improved to effectively decrease journey times by a third. \nThe announcement was made as the First Minister spoke to North East England Chamber of Commerce members in Gateshead, saying her administration was also looking at improvements to the A1 and A68 roads to provide better transport between Scotland and the North East. \nMrs Sturgeon said: \nI am determined for us to take the necessary steps to secure Scotland’s future and improve our connectivity with England. \nThis work will provide us with the knowledge to make informed investments in the next ten years and move us towards our goal of a three hour journey time to London and substantially reduced journey times to the cities in between. \nIt is fitting that I am able to make this announcement while speaking to the North East England Chamber of Commerce. This work could have significant benefits for people and businesses on both sides of the border. \nFor example, it is expected that these studies will confirm we will be able to reduce the journey time between Edinburgh and Newcastle by a third, down to only one hour, and also reduce journey times between Glasgow and Edinburgh and Carlisle. Nicola Sturgeon speaks to the North East England Chamber of Commerce lunch (Image: publicity handout from North East England Chamber of Commerce) 8:35 Jonathon Manning Webuyanycar.com opens new branch in Kingston Park \nWebuyanycar.com is opening its first branch in Newcastle today, as the firm opens its doors in Kingston park. \nThe new branch adds to the firm’s presence in the region, with the Manchester firm already holding outlets in Gateshead and Washington. \nWebuyanycar.com has created two new jobs following the Manchester firm’s expansion. In total the company employes over 500 members of staff. \nRichard Evans, head of technical services at webuyanycar.com, said: \nOur latest opening in Kingston Park is testament to the continued growth of webuyanycar.com and our support for customers in the North East who we have been buying many thousands of cars from over the years. With the new branch we hope to reduce customer travelling time by opening in a more central location. \nWe’re looking forward to welcoming many new customers in branch and continuing to be the area’s top consumer choice for selling cars in a convenient and hassle free way. \nHe added: \nWe are continuing to grow and put customers back in the driving seat, as more and more motorists realise they can negotiate a better deal by not part-exchanging. Our Kingston Park branch will be open seven days a week and will offer instant bank transfers to motorists, saving valuable time. Webuyanycar.com branch Jonathon Manning Canada-style Brexit deal 'would come up short for British business' \nA Brexit deal similar to the agreement struck between the European Union and Canada risks coming up short for UK businesses, a leading industry body has said.ICAS, which represents chartered accountants, studied the trade deal and said that while it could be a “useful point of reference” for UK negotiators, the benefits of the deal “fall short” of those Britain has as a result of its membership of the EU.The report was prepared by James Ogilvy, a former adviser to the Alberta provincial government who observed negotiations for the Comprehensive Economic and Trade Agreement (CETA) deal.The cumulative impact of the agreement on Canadian GDP is “anticipated to be 0.4% or less”, the report said.It added: \nThese amounts of gain are small compared to the projections for loss to the UK’s economy should it revert to the WTO (World Trade Organisation) agreements. The CETA, although it improves Canada’s economic relationship with the EU, clearly falls short of the benefits that the UK enjoys with EU membership. \nThe ICAS report highlights that Canada still does not have a ratified deal on financial services, and shows that the CETA deal only secured temporary entry for professional services into Europe.It took eight years to reach that agreement, with the paper warning Britain’s negotiators will be a “relatively inexperienced, almost ad hoc group” in comparison with a “well-seasoned and focused EU negotiating team that is fully familiar with the processes and its own objectives, and confident of its targets”.The negotiations between Europe and Canada lasted seven years from the start of the formal engagement process in October 2009, with both sides needing time “to bring in their constituent members” early in this period.After the deal was signed almost another year was needed to get to the point where CETA came into effect provisionally in September this year - with ratification and implementation still needing to be carried out, the report said. Anti-Brexit protesters waving EU flags outside the Houses of Parliament in London (Image: PA) 8:25 Jonathon Manning One in four North East employees are in poverty despite working, new study says \nNearly a quarter of people in the North East are trapped in poverty despite being in work, according to new research by KPMG. \nThe report estimates that around 222,000 employees are being paid below the real Living Wage of £8.45 per hour. The figure represents 23% of the those working in the North East, and means that many families are in poverty despite working. \nPart-time workers in the region were found to be most at risk of being underpaid, with 132,000 employees - 46% of part-time staff - being paid below the Living Wage. In comparison 96,000 full-time workers, or 14%, were paid less than £8.45. \nCurrently businesses are only required to pay their workers the National Minimum Wage, which is £7.50 for 25-year-olds, but drops to £5.60 for those aged between 18 and 20. The minimum wage for apprentices is £3.50 per hour. \nAccording to the Living Wage Foundation, this amount does not provide people with enough money to live on. \nDavid Elliot, Newcastle senior partner at KPMG, added his voice to those calling for higher pay for staff. \nHe said: \nToday’s figures show that more work needs to be done if we are to eradicate in-work poverty. It’s unfortunate that in 2017 more than 222,000 working people in the North East are earning below the real Living Wage and cannot enjoy the standard of life so many of us take for granted. \nIt is clear that it may not be possible or practical for everyone, but businesses need to do what they can to address the problem of low pay. \nOf course, change cannot happen instantly, but making an initial assessment is an important first step. KPMG Newcastle senior partner David Elliott (Image: KPMG) 8:20 ", "external_links": [], "published": "2017-11-07T10:00:00.000+02:00", "crawled": "2017-11-07T11:04:22.003+02:00", "highlightTitle": ""}