{"organizations": [], "uuid": "5aa52cd4eabcd20ec29613577af3dba38cd75a25", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article459267.ece/ALTERNATES/s1200/BEN-BRADSHAW-MINISTER-FOR-CULTURE.jpg", "site_section": "http://www.devonlive.com/rss.xml", "section_title": "devonlive - frontpage", "url": "http://www.devonlive.com/news/devon-news/countrys-sake-simply-cant-go-766688", "country": "US", "title": "For the country’s sake, it simply can’t go on.", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-13T11:27:00.000+02:00", "replies_count": 0, "uuid": "5aa52cd4eabcd20ec29613577af3dba38cd75a25"}, "author": "Ben Bradshaw", "url": "http://www.devonlive.com/news/devon-news/countrys-sake-simply-cant-go-766688", "ord_in_thread": 0, "title": "For the country’s sake, it simply can’t go on.", "locations": [], "entities": {"persons": [{"name": "priti patel", "sentiment": "none"}, {"name": "johnson", "sentiment": "none"}, {"name": "ben bradhsaw", "sentiment": "none"}, {"name": "ben bradshaw", "sentiment": "none"}, {"name": "ben bradshaw", "sentiment": "none"}, {"name": "ben", "sentiment": "none"}, {"name": "henry viii", "sentiment": "none"}, {"name": "john major", "sentiment": "none"}, {"name": "norman lamont", "sentiment": "none"}, {"name": "michael fallon", "sentiment": "none"}, {"name": "gavin williamson", "sentiment": "none"}, {"name": "steven erlanger", "sentiment": "none"}, {"name": "boris johnson", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}], "locations": [{"name": "iran", "sentiment": "none"}, {"name": "africa", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "israel", "sentiment": "none"}], "organizations": [{"name": "financial times", "sentiment": "none"}, {"name": "foreign office", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "new york times", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "defence", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News opinion For the country’s sake, it simply can’t go on \"In office but not in power” - that would be too kind a description of the state of our current administration Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nBEN BRADSHAW IS THE LABOUR MP FOR EXETER AND HAS BEEN SINCE 1997 \n\"In office but not in power” was the famous description by sacked Chancellor, Norman Lamont, of John Major’s Conservative Government as it lurched from one crisis to another in the mid 1990s. \nIt would be too kind a description of the state of our current administration. \nAt the time of writing, the International Development Secretary, Priti Patel is “in the air” having been ordered back from Africa by Mrs May. By the time you read this, she will surely be the “ex” International Development Secretary for her freelance policy-making with Israel, lying about it and trying to cover it up afterwards. Read More This is not “project fear”. It is project fact. \nOur gaffe-prone Foreign Secretary Boris Johnson couldn’t quite bring himself to apologise in Parliament on Tuesday for wrongly claiming a British woman imprisoned in Iran was teaching journalism, when in fact she was on holiday. Johnson’s mistake could lead to the poor woman receiving a longer jail term. His latest blunder prompted that well known socialist propaganda sheet, the Financial Times, to describe Johnson as “the least distinguished figure to occupy the Foreign Office since the Second World War.” If May’s position wasn’t so weak, she would have already sacked him. Ben Bradshaw, former Culture Secretary \nThe “sex pest” scandal sweeping Westminster forced the resignation of the Defence Secretary, Michael Fallon, last week, with other Ministers under investigation and rumours of more revelations to come. \nMeanwhile, following a binding Commons vote, the Speaker ordered the Government to hand over the Brexit impact assessments it has been keeping secret to the Brexit Select Committee “within days” or risk being “in contempt of Parliament”. The Government is resisting, saying it needs at least three weeks to make the documents “suitable” for publication. Expect contempt proceedings to begin next week unless the Government relents. Potential punishments for contempt include expulsion from Parliament and even incarceration in the clock tower under Big Ben. Read More EU repeal bill 'biggest power grab since Henry VIII' \nNext week the EU withdrawal bill returns to the Commons, where a growing number of Conservative MPs, enraged by the promotion of the completely unsuitable Gavin Williamson to Defence Secretary, have indicated a willingness to rebel. \nAll of this at a time when Britain faces the most complicated and challenging negotiation undertaken by any country in modern history. Ben Bradhsaw after increasing his majority in May \nIf businesses do not get some certainty, at least on transitional arrangements for Brexit, before Christmas, the great exodus of jobs and investment will begin. But that will require Mrs May’s Cabinet to make some difficult decisions and compromises and unite behind them. Can anyone seriously see them doing that? \nOur friends and allies around the world are looking on in bewilderment and, increasingly, despair. The departing New York Times correspondent in London, Steven Erlanger, wrote in his valedictory article this week that Britain, “renowned for its pragmatism, common sense and political stability” seemed now to be embracing “an introverted irrelevance.” Read More How much did your MP claim in expenses for rent, hotels and travel? \nJohn Major’s Government managed to stagger on for four more years after Norman Lamont’s famous put down. But that was against an economic backdrop that was relatively benign, with a comfortable majority and no Brexit to deal with. \nThis is much more serious, with much more at stake. For the country’s sake, it simply can’t go on. Like us on Facebook", "external_links": [], "published": "2017-11-13T11:27:00.000+02:00", "crawled": "2017-11-13T11:32:32.004+02:00", "highlightTitle": ""}