{"organizations": [], "uuid": "99a4b8095ee62cea45be1d8115cdb8f01356a87b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13977900.ece/ALTERNATES/s1200/Clikd-won-the-award-for-greatest-innovation-at-the-UK-Dating-Awards.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/clikd-dating-app-joins-tinder-13977825", "country": "GB", "domain_rank": 21960, "title": "Clikd dating app joins Tinder and Match.com as winner of top award", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-30T18:14:00.000+02:00", "replies_count": 0, "uuid": "99a4b8095ee62cea45be1d8115cdb8f01356a87b"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/clikd-dating-app-joins-tinder-13977825", "ord_in_thread": 0, "title": "Clikd dating app joins Tinder and Match.com as winner of top award", "locations": [], "entities": {"persons": [{"name": "clikd", "sentiment": "positive"}, {"name": "michael blakeley", "sentiment": "none"}, {"name": "rupert coney", "sentiment": "none"}, {"name": "charly lester", "sentiment": "none"}, {"name": "slytherin", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "love island", "sentiment": "none"}], "organizations": [{"name": "invalid email", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Clikd won the award for greatest innovation at the UK Dating Awards (Image: Unknown) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nA dating app designed by a North East entrepreneur has won a major industry award which has previously been given to Tinder and Match.com. \nClikd, which was co-founded by Gateshead-born Michael Blakeley, won the award for greatest innovation in the UK dating industry at this year’s UK Dating Awards. \nThe app sets itself apart from others in the market by allowing users to create their own personality tests by asking unique questions. \nThose responding to the questions are then able to select a picture to represent their answer. This feature allows the company to combine the popularity of sharing pictures on social media with the online dating industry. (L-R) clikd co-founders Michael Blakeley and Rupert Coney (Image: clikd) \nIn the past the award has been won by a number of dating industry heavyweights including Tinder, Bumble, and Match.com. \nJudges at the awards were impressed with Clikd’s original concept and its ability to let users create their own content and filters. \nCharly Lester, head judge of the UK Dating Awards said: “The judges were particularly impressed by the way Clikd took an existing functionality of dating apps, and brought it forward to 2017. The user-generated content on the app is fresh and creative, and useful to daters. The standard of this year’s Awards was particularly high this year so Clikd should be very proud of their win.” \nClikd originally launched in April this year and is nearing 20,000 downloads. Read More New picture-based dating app launched by North East legal hotshot \nAfter being used nearly 200,000 times the business has also been able to reveal some of the most popular questions used to whittle down potential love interests. These include: “Did you vote Brexit or Remain?”, “Would you rather watch Love Island or paint dry?”, and “are you more Gryffindor of Slytherin?”. Like us on Facebook ", "external_links": [], "published": "2017-11-30T18:14:00.000+02:00", "crawled": "2017-11-30T18:34:41.030+02:00", "highlightTitle": ""}