{"organizations": [], "uuid": "01529746a75333d3ab7b318c953def63b8cbb00e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article566817.ece/ALTERNATES/s1200/Nicky-Morgan.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/news/local-news/russian-bots-terrifying-twitter-threat-791162", "country": "US", "domain_rank": 48128, "title": "Russian bot's terrifying Twitter threat to Loughborough MP Nicky Morgan over Brexit stance - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.901, "site_type": "news", "published": "2017-11-20T11:19:00.000+02:00", "replies_count": 0, "uuid": "01529746a75333d3ab7b318c953def63b8cbb00e"}, "author": "Dan Martin", "url": "http://www.leicestermercury.co.uk/news/local-news/russian-bots-terrifying-twitter-threat-791162", "ord_in_thread": 0, "title": "Russian bot's terrifying Twitter threat to Loughborough MP Nicky Morgan over Brexit stance - Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "nicky morgan", "sentiment": "negative"}, {"name": "jo cox", "sentiment": "none"}, {"name": "mrs morgan", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "mrs cox", "sentiment": "none"}, {"name": "batley", "sentiment": "none"}, {"name": "anna soubry", "sentiment": "none"}, {"name": "thomas mair", "sentiment": "none"}, {"name": "jo cox-style", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "mair", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "broxtowe", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "loughborough", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "european union mrs morgan", "sentiment": "none"}, {"name": "daily telegraph", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Russian bot's terrifying Twitter threat to Loughborough MP Nicky Morgan over Brexit stance The MP and her 'rebel' colleagues are again being targeted online Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nNicky Morgan says a Russian Bot was behind a death threat she received on Twitter. \nThe Loughborough MP suffered Jo Cox-style threats online earlier this summer over her stance on Brexit. \nAfter campaigning to remain in the European Union Mrs Morgan reported tweets from two accounts in July to the police. \nOne of the tweets read: “We voted. When your vote is ignored all you are left with is violence. Nobody wants another Jo Cox episode but...” \nMrs Cox was Labour MP for Batley and Spen when she was murdered last June by a man who shot and stabbed her in the street while shouting “Britain first”. Read More \nHer attacker, Thomas Mair, was jailed for life for Mrs Cox’s murder in November last year. \nProsecutors said Mair was motivated by hate and his crimes were “nothing less than acts of terrorism”. \nTwitter suspended the accounts after her complaint. \nMrs Morgan told the Leicester Mercury : “The police traced one of the accounts to an address in London but there was no one there so they wrote a letter. \n“An investigative journalist also looked into this and found that the account was a Russian Bot.” \nBots are software that autonomously perform actions such as tweeting, re-tweeting, liking, following, unfollowing, or direct messaging other accounts. \nThere has been growing concern that Russia has been attempting to influence and interfere in key political events in Western politics, such as Brexit and the election of US president Donald Trump. Russian bots have been linked to the election of Donald Trump (Image: Getty Images) \nMrs Morgan was speaking after suffering a fresh wave of online abuse following a front page of the Daily Telegraph this week that used pictures of her and 14 other Tory pro-Remain MPs under the headline “The Brexit Mutineers” for rebelling against the Government on the EU withdrawal bill. \nMrs Morgan said: “As so often happens these days there has been abuse online but I have had plenty of support to from people who are concerned about the direction we are heading with Brexit. \"I am going to continue to scrutinise the Government. That is part of the job of every MP on issues that are as important as this.” \nSome of the MPs on the Telegraph front page have described it as an attempt to bully them into silence. \nMrs Morgan called out the Daily Mail for ringing Conservatives in her constituency in the aftermath of the front page. \nShe tweeted: “So the Daily Mail is now calling round our constituencies & local parties asking how we represent our constituents - of course not interested when response is supportive & entirely missing the point that we were all elected or re-elected just 5 months ago #AntiBullyingWeek” Anna Soubry says she and colleagues are being bullied \nAnna Soubry, the Tory MP for neighbouring Broxtowe and an ally of Mrs Morgan, also featured on the Telegraph front page. \nMs Soubry addressed the matter in the Commons this week. Read More Britain will thrive after Brexit according to psychic who predicted Trump's win \nShe said: “According to my office, they have just reported about five, if not more, tweets to the police issuing threats against myself following the front page article in the Daily Telegraph. \n\"Would you [the Speaker] therefore make it clear to everybody, in whatever capacity, that they have an absolute duty to report responsibly - make sure they use language that actually brings our country together and makes sure we have a democracy that welcomes free speech and an attitude of tolerance.\" Like us on Facebook ", "external_links": [], "published": "2017-11-20T11:19:00.000+02:00", "crawled": "2017-11-20T12:20:12.011+02:00", "highlightTitle": ""}