{"organizations": [], "uuid": "4f5beef0802ec5520c919a85aea1c34587952376", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article11698564.ece/ALTERNATES/s1200/CS30125823.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13925017", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE:British Gas owner Centrica announces raft of reforms to bring down energy bills", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-20T10:30:00.000+02:00", "replies_count": 0, "uuid": "4f5beef0802ec5520c919a85aea1c34587952376"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13925017", "ord_in_thread": 0, "title": "Business Breakfast LIVE:British Gas owner Centrica announces raft of reforms to bring down energy bills", "locations": [], "entities": {"persons": [{"name": "phillip hammond", "sentiment": "none"}, {"name": "justin ash", "sentiment": "none"}, {"name": "ferguson", "sentiment": "none"}, {"name": "john", "sentiment": "none"}, {"name": "coreena ford", "sentiment": "none"}, {"name": "linda kozlowski", "sentiment": "none"}, {"name": "mediclinic", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "david ord", "sentiment": "none"}, {"name": "visa", "sentiment": "none"}, {"name": "john waterworth", "sentiment": "none"}, {"name": "conn", "sentiment": "none"}, {"name": "garry watts", "sentiment": "none"}, {"name": "iain conn", "sentiment": "none"}, {"name": "etsy", "sentiment": "none"}, {"name": "kozlowski", "sentiment": "none"}, {"name": "ian bull", "sentiment": "none"}, {"name": "ian", "sentiment": "none"}, {"name": "lynn shearing", "sentiment": "none"}, {"name": "jonathan walker", "sentiment": "none"}, {"name": "coreena ford etsy", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "north east england", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "south africa", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "northumberland street", "sentiment": "none"}, {"name": "newcastle city centre", "sentiment": "none"}], "organizations": [{"name": "centrica", "sentiment": "negative"}, {"name": "friends of ferguson heritage", "sentiment": "none"}, {"name": "bbc radio", "sentiment": "none"}, {"name": "hexham mart", "sentiment": "none"}, {"name": "office for national statistics", "sentiment": "none"}, {"name": "british gas", "sentiment": "none"}, {"name": "north east england chamber of commerce", "sentiment": "none"}, {"name": "london stock exchange", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "coreena ford parkdean resorts", "sentiment": "none"}, {"name": "etsy", "sentiment": "none"}, {"name": "ihs", "sentiment": "none"}, {"name": "ons", "sentiment": "none"}, {"name": "spire healthcare", "sentiment": "none"}, {"name": "mediclinic international", "sentiment": "none"}, {"name": "onex", "sentiment": "none"}, {"name": "lynn shearing", "sentiment": "none"}, {"name": "parkdean resorts", "sentiment": "none"}, {"name": "coreena ford spire healthcare", "sentiment": "none"}, {"name": "hexham auction mart", "sentiment": "none"}, {"name": "ms shearing", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "A vintage tractor restored by enthusiasts in the North East has sold for nearly £10,000 . \nThe 1948 Ferguson P3 tractor had been restored by the North East of England branch of The Friends of Ferguson Heritage organisation under the chairmanship of David Ord and was shown at a number of village shows in the region. \nIt was raffled off by the organisation but the winner decided he didn’t need it and allowed the group to auction it off. \nIts sale at Hexham Auction Mart saw it beat the guide price of £5,000 to £6,000, with bids coming in from around the UK and Ireland. Vintage tractor sold at Hexham Mart for nearly £10,000 (Image: Copyright unknown) 8.55 Coreena Ford Parkdean Resorts signals major growth plans \nParkdean Resorts has announced it is stepping up its expansion plans after creating a new post to oversee the firm’s mergers and acquisitions. \nThe Newcastle caravan park company, which was bought by Canadian private equity firm Onex last year, has appointed chartered accountant Lynn Shearing as its new mergers and acquisitions director. \nIn her new position, Ms Shearing will take a major role in overseeing the holiday giant’s expansion plans. She will sit on a panel that includes chief executive John Waterworth and chief financial officer Ian Bull. \nMs Shearing, who is originally from Sunderland, said: “I’m looking forward to working closely with John, Ian and the team from Onex to put our ambitious plans into action. Growth is high on our agenda so this is an incredibly exciting time to be joining the team. \n“We would therefore be delighted to hear from anyone who thinks they have an acquisition opportunity which might be of interest to us.” Lynn Shearing, merger and acquisition director (Image: Unknown) 8.50 Coreena Ford Revealed: The five Budget demands made by North East businesses \nThe North East England Chamber has laid out a series of economic demands for the region in an open letter sent to the government . \nThe letter, sent to Chancellor Phillip Hammond, says the government needs to make good on its promise to redistribute investment to Northern cities and outlines which areas of spending would best improve the North East. \nIn it Jonathan Walker, the Chamber’s head of policy and campaigns, says: “Your party’s election manifesto stated that the opportunity to close the economic performance gap between London and other towns and cities is ‘the biggest prize in Britain today’. \n“If the government is serious about securing this prize, there is major work needed to change the distribution of public and private investment, and economic activity in the UK, from a trend that has built up over several decades. Listening to the calls of businesses in our region is essential to achieve this. \n“This letter does not set out the full extent of our members’ needs. Instead, this letter focuses on the measures we believe could be implemented in this year’s Budget to help us achieve our long term ambitions. I urge you to consider and consult the messages contained in both this letter and the Chamber Manifesto.” Jonathan Walker, head of policy and campaigns, North East England Chamber of Commerce (Image: Handout) 8.44 Coreena Ford Etsy to expand London office \nEtsy is set to expand its London office despite company-wide staff cuts, as the artisan platform looks to centralise much of its international operations in the UK. \nThe online craft and artisan marketplace unveiled the first phase of its efficiency drive at the end of April and further cuts in June that will together result in the loss of 245 staff or 23% of its headcount versus the end of 2016, as well as the closure and consolidation of certain international offices. \nBut chief operating officer Linda Kozlowski says Etsy’s future in London is secure and plays into a larger corporate strategy to streamline its overall operations. \nThe company does not break out UK figures, but reported revenues of just under £231m for the nine months to September 30, up from £193m during the same period in 2016, and managed to swing to a profit of £28m compared with a loss of £6.4m a year earlier. \nIt said international growth was particularly driven by business between buyers and sellers in the same country, a trend that Ms Kozlowski said Etsy was trying to capitalise on, and cater to, in the UK. \n“The latest focus specifically in the UK is making sure people have access to the local products first and giving them the opportunity to buy there,” she explained. \n“Specifically we’re looking at how in the UK can we make sure that UK buyers who have a very, very strong propensity to want to buy from UK sellers can do that in a very seamless experience that feels very local and feels very relevant and connected to them.” 8.40 KEY EVENT Christmas spending set to fall for first time in five years \nChristmas spending is set to fall for the first time since 2012 as a drop in real wages and Brexit uncertainty weigh on UK households, research suggests. \nThe news could spell trouble for retailers, many of whom rely on a spike in sales in the last months of the calendar year to help boost revenues. \nResearch compiled by IHS for Visa forecasts that consumer spending during the festive period is set to fall 0.1% in real terms compared with the same period last year, when spending grew 2.8%. \nIt would be the first time that spending has dropped over the November-December shopping period since 2012, when it declined 1.3%. \n“The expected subdued performance in the final weeks of 2017 is in principal a product of the current economic environment currently characterising the UK,” the report explained. \n“Economic output has been undermined by Brexit uncertainty, whilst the past depreciation of sterling continues to feed through to rising consumer prices, leading to a further squeeze on household disposable income.” \nThe report also laid the blame on a drop in real wages. \nFigures from the Office for National Statistics (ONS) last week showed that the Consumer Prices Index (CPI) measure of inflation held at five-year highs in October at 3%. Visa said higher prices have contributed to a “period of belt-tightening amongst consumers in recent months”. The high street alone is expected to suffer a 2.1% drop in spending, making it the third straight year that shopping at bricks-and-mortar stores has fallen over the period. Christmas shoppers on Northumberland Street in Newcastle City Centre. 8.35 What's the FTSE latest? \nThe FTSE-100 index opened at 7380.68. \nThe pound at 8am was 1.3247 dollars compared to 1.3220 dollars at the previous close. The euro at 8am was 0.8880 pounds compared to 0.8923 pounds at the previous close. Screen displaying the FTSE 100 at the London Stock Exchange (Image: Yui Mok/PA Wire) 8.33 Coreena Ford Spire Healthcare takeover talks collapse \nTakeover talks between private hospital group Spire Healthcare and South Africa’s Mediclinic International have broken down. \nMediclinic said it was “disappointed” a deal could not be reached and would not make a further offer for the company. \nGarry Watts, chairman of Spire Healthcare, said: “We note Mediclinic’s confirmation that it no longer intends to make an offer for Spire. “The board carefully considered Mediclinic’s approach but determined that it did not reflect the true value of the company and was not in the best interests of shareholders as a whole. “The board is highly confident in the future of Spire as an independent company under the leadership of Justin Ash and the potential to drive shareholder value over the medium term. “We welcome Mediclinic’s intention of remaining a supportive shareholder of Spire.” Spire Healthcare has rejected a takeover bid from South Africa's Mediclinic 8.30 KEY EVENT Centrica to bring in string of reforms to cut bills \nThe chief executive of British Gas owner Centrica has said the firm will scrap standard gas and electricity tariffs (SVT) for new customers. \nThe move forms part of reforms designed to be “significantly more effective” than a Government price cap on energy bills. \nThe energy giant said it would also offer simpler bills and a new fixed-term competitive tariff, which will include a fixed-term default tariff for customers. \nCentrica’s group chief executive Iain Conn said the reforms were not triggered by the Government’s threat to cap energy prices, despite claiming that price controls would set the energy market back. \nIt comes as the UK’s Big Six brace for a raft of regulatory changes after the Government announced that a price cap will be imposed on poor-value energy tariffs. \nSpeaking on BBC Radio 4’s Today programme, Mr Conn said: \nWe have actually been working on these proposals for many months now. \nWe have been saying for the last 18 months that we think the best solution for this market is to end evergreen contracts, contracts that don’t have an end date. \nWe obviously had to pause when Theresa May announced her intention to cap the market but we have now announced today a comprehensive set of actions to reform the market, starting in our case with the removal of the standard variable tariff. British Gas is owned by Centrica More On", "external_links": [], "published": "2017-11-20T10:30:00.000+02:00", "crawled": "2017-11-20T11:09:00.000+02:00", "highlightTitle": ""}