{"organizations": [], "uuid": "0d29616e9ed6b8a372cd26efde56249590af99db", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13393615.ece/ALTERNATES/s1200/NW_Sun-3.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/current-affairs-getting-you-down-13917792", "country": "GB", "domain_rank": 21960, "title": "Current affairs getting you down? Here are some reason to be cheerful", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-19T10:00:00.000+02:00", "replies_count": 0, "uuid": "0d29616e9ed6b8a372cd26efde56249590af99db"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/current-affairs-getting-you-down-13917792", "ord_in_thread": 0, "title": "Current affairs getting you down? Here are some reason to be cheerful", "locations": [], "entities": {"persons": [{"name": "tyne", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "great britain", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "share research", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Current affairs getting you down? Here are some reason to be cheerful It's not all bad news on the politcal front, folks. Here are some of the things that are going well Share Research shows the North East is warmer than ever (Image: NCJ Archive) Share Get daily   Could   \nThere’s a lot of bad news around at the moment. \nWestminster is mired in sleaze, Brexit negotiations are making slow progress and it’s not clear whether anyone is actually running the country. \nBut it’s not all doom and gloom. Perhaps this is the right time to focus on the good news for once. \nAfter all, there are plenty of reasons to be cheerful. \nUnemployment is down. In fact, in the North East it fell by 10 per cent in the past year. That’s a fall from 79,000 people to 71,000 people. \nAnd the number of people with a job actually rose in the North East by 25,000 people, up to 1.23 million. \nAnd our pay has gone up. Just a little bit, but it has. \nOfficial figures show that average total pay for employees in Great Britain increased from £376 per week in January 2005 to £509 per week in September 2017; an increase of 35.3%. Okay, but what about inflation? \nWell, over the same period the Consumer Prices Index, including housing costs, increased by 33.2%. In other words, pay has risen slightly even after inflation is taken into account. \nAnd a note about inflation. Some reports have suggested inflation is shooting up. But in fact, it’s still pretty low at 2.8%. \nThe target (originally set by the last Labour government) is 2%. That’s because a bit of inflation is good for the economy. \nAnd it’s a target - not an upper limit. So we’re actually closer to the 2% target now than we were when inflation was close to zero. Read More What about housing? Too many people struggle to find an affordable home \nBut new homes are being built. \nIn fact, in Tyne and Wear the number of homes increased by 5,207 in the past year. This is the total number of new homes minus any demolitions. \nAnd that figure is higher than ever. Go back to 2007 and it was just 2,545. Read More But what about Brexit? Doesn’t the rest of Europe hate us now? \nWell, no. \nThe latest official figures show that 248,000 people from EU countries chose to move to the UK over 12 months (between March 2016 and March 2017). \nAt the same time, 122,000 EU citizens left. \nIt’s true that the number leaving has increased, compared to the years before the referendum. But it’s still far lower than the number choosing to come here. \nAnd it suggests the UK is still seen as a great place to live and work. Like us on Facebook", "external_links": [], "published": "2017-11-19T10:00:00.000+02:00", "crawled": "2017-11-19T10:40:59.000+02:00", "highlightTitle": ""}