{"organizations": [], "uuid": "cafffdcee3abaace30088c4c9726f1d865a78e10", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13901357.ece/ALTERNATES/s1200/SMR_NEC131117Greggs_03.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/greggs-now-shelved-plans-nail-13917584", "country": "GB", "domain_rank": 21960, "title": "Have Greggs now shelved plans to nail a pasty to a cross for Easter?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-18T13:00:00.000+02:00", "replies_count": 0, "uuid": "cafffdcee3abaace30088c4c9726f1d865a78e10"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/greggs-now-shelved-plans-nail-13917584", "ord_in_thread": 0, "title": "Have Greggs now shelved plans to nail a pasty to a cross for Easter?", "locations": [], "entities": {"persons": [{"name": "greggs", "sentiment": "neutral"}, {"name": "jesus", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "joseph", "sentiment": "none"}, {"name": "geordie", "sentiment": "none"}, {"name": "kim jong-un", "sentiment": "none"}, {"name": "katie price", "sentiment": "none"}, {"name": "oscar wilde", "sentiment": "none"}, {"name": "mary", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News opinion Have Greggs now shelved plans to nail a pasty to a cross for Easter? The North East baker famous for its pies upset the pious with its ill judged nativity scene Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nLaughs and Greggs are happening more often these days than with other bakers of note. \nA few weeks back it launched a diet plan with its grub which we were told could help us lose weight. Hmmm. \nThen last week it outdid itself with its personalised nativity scene. \nInstead of baby Jesus in the cradle there was a Greggs sausage roll looking like it been plonked there by a kid who had taken a sneaky bite out of it. \nIt was either Oscar Wilde or Katie Price who said: “There is only one thing in life worse than being talked about, and that is not being talked about.” \n‘Given the choice....’ you can imagine bosses at Greggs thinking ruefully last week. \nThe company was contrite but you’ve got to wonder about the thought processes of what went into it in the first place. \nYou can imagine the ‘artistic director’ talking it through at the meeting. Greggs has come under pressure following their latest advert \n‘We’re looking for something festive, I’m thinking nativity scene, I’m thinking Joseph and Mary, I’m thinking cradle, but I’m not thinking Jesus. I’m thinking sausage roll!’ \nAt which point anybody with a grain of common sense should have asked: “Is this wise, man? \nI suspect plans to have a pasty nailed to a cross at Easter have now been binned. Read More 'In bad taste' or 'a bit of Geordie humour'? Readers react to Greggs advert \nTo be fair, as many people were amused or not bothered as they were outraged. And even the outrage was a bit lethargic. \nMaybe because in the grand scheme of things if Jesus was born today he is more likely to get a Gregg’s pastry as a gift than gold, frankincense and myrrh. \nStill for me it offered a bit of light relief in another week in politics at both a national and international level that has become a moral obstacle course to form a view on. Read More Howay, in a manger? Fury as Greggs' savoury replaces 'Saviour' in nativity scene \nWith each passing day the consequences of Brexit is looking to be worse than predicted before the referendum by the Four Horsemen of the Apocalypse. And though I live in the same flaming building of a country as those who voted to leave the EU, it’s amusing to see them deny the evidence of their own eyes with the yawningly familiar ‘fake news’ tag before reaching for their tin foil hats. \nThen when North Korea pronounced the ‘death sentence’ on Donald Trump for calling Kim Jong-un short and fat in a rare moment of lucidity, the bad taste part of me had a little chuckle at the thought of it. \nAnd then there’s Russia. It is being blamed for subverting democracy via social media by amongst others the US and UK intelligence services who, let’s face it, really know what they’re talking about when it comes to subverting democracy in other countries. \nIn other words hoist by their own petard in the most literal sense of the phrase which gets its meaning from the fact a ‘petard’ is a small bomb. Like us on Facebook", "external_links": [], "published": "2017-11-18T13:00:00.000+02:00", "crawled": "2017-11-18T13:24:39.004+02:00", "highlightTitle": ""}