{"organizations": [], "uuid": "d8b897e2a106d16d55de538833daf30490cf57e2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/whats-on/family-kids/article832025.ece/ALTERNATES/s1200/Dick-Whittington-Steve-Bennett-as-Dame-Sarah-Suet-Photo-Matt-Asutin-cakes3-4000x4000.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "devonlive - frontpage", "url": "http://www.devonlive.com/whats-on/family-kids/great-british-panto-love-how-831987", "country": "GB", "title": "Great British panto: why we love it and how you absolutely have to join in", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-26T14:31:00.000+02:00", "replies_count": 0, "uuid": "d8b897e2a106d16d55de538833daf30490cf57e2"}, "author": "Phil Goodwin", "url": "http://www.devonlive.com/whats-on/family-kids/great-british-panto-love-how-831987", "ord_in_thread": 0, "title": "Great British panto: why we love it and how you absolutely have to join in", "locations": [], "entities": {"persons": [{"name": "joe grimaldi", "sentiment": "none"}, {"name": "dawlish", "sentiment": "none"}, {"name": "tony", "sentiment": "none"}, {"name": "john inman", "sentiment": "none"}, {"name": "dan leno", "sentiment": "none"}, {"name": "judy", "sentiment": "none"}, {"name": "sarah suet", "sentiment": "none"}, {"name": "tony lidington", "sentiment": "none"}, {"name": "shakespeare", "sentiment": "none"}, {"name": "matt austin", "sentiment": "none"}, {"name": "emily essery", "sentiment": "none"}, {"name": "les dawson", "sentiment": "none"}, {"name": "northcott", "sentiment": "none"}, {"name": "dick", "sentiment": "none"}, {"name": "dick-whittington", "sentiment": "none"}, {"name": "pantaloon", "sentiment": "none"}, {"name": "tom", "sentiment": "none"}, {"name": "steve", "sentiment": "none"}, {"name": "dick whittington", "sentiment": "none"}, {"name": "dame sarah suet", "sentiment": "none"}, {"name": "jaz morley", "sentiment": "none"}, {"name": "jerry", "sentiment": "none"}, {"name": "steve bennett", "sentiment": "none"}, {"name": "mark dawson", "sentiment": "none"}], "locations": [{"name": "tudor", "sentiment": "none"}, {"name": "new zealand", "sentiment": "none"}, {"name": "preston street", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "harelequin", "sentiment": "none"}], "organizations": [{"name": "columbine", "sentiment": "none"}, {"name": "keystone cops", "sentiment": "none"}, {"name": "spacex", "sentiment": "none"}, {"name": "exeter northcott theatre", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "h&m", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nPanto season is upon us. Oh yes it is! Time to take your seats and prepare for sly digs, saucy jokes, slapstick routines and, most important of all, to join in with the show. \nOur love of this bawdy irreverent and popular entertainment is instilled in us as children and lasts a lifetime but how much do we really know about this quintessentially British theatrical form? \nExeter’s Northcott Theatre – now thriving and celebrating its 50 anniversary after teetering on the brink of closure seven years ago – is preparing to raise the curtain on its first pantomime since 2009. \nDirector and authority on pantomime Tony Lidington, from Dawlish, and Exeter-born actor and accomplished Dame, Steve Bennett, are set to move rehearsals of Dick Whittington, which they co-wrote together, to the theatre this week. \nThe pair told DevonLive.com they are mindful of the need to deliver the traditional fast-paced comic routines and songs that audiences expect but also to reflect modern-day concerns and push the jokes as close to the edge as possible without causing real offence. Tony Lidington in rehearsal \n“It has to be light enough not to give offence but barbed enough to have what Shakespeare would call a palpable hit,” Tony says. \n“Pantomime has always had the ability to parody and satirize things that are part of contemporary life. It is not pantomime’s job to proselytize or takes sides but to make barbed comments about local, national and international issues. \n“Any presentation on stage has a political meaning – we had a whole load of discussions about Dick Whittington being shipwrecked and ending up in an exotic, foreign location; how to do that without it being offensive or awkward but fun. We think we have found a solution though the proof of the pudding will be in the eating.” Read More There's a 'Buddy the Elf' themed party being at this Devon nightclub \nSteve Bennett, a RADA-trained veteran who plays his 15th dame in cook Sarah Suet, says pantomime started to go through a bad time when unskilled TV stars took on roles in the 1970s and 1980s but has now returned to its rightful place as “wholesome family entertainment”. \nStill, he makes references the 70s to explain his preferred Dame style – Les Dawson’s “bloke in a frock” rather than John Inman’s femininity – and says stand-up comedy tends to inspire the performance. \n“You only have to look at the size of me to see that I can’t be feminine so I do tend to go for the bloke in a frock,” he adds. Steve Bennett in rehearsal \n“I think a lot of actors admire stand-up comics and it’s the one show where you get the chance to do a little bit of that; to step of the script for a moment and relate to the audience, to break through the fourth wall and chat. \n“That for a performer is a great feeling; it is also a scary feeling.” Read More Paddington Bear is coming to Exeter - and here's how your kids can meet him \nTony Lidington, an expert on British popular entertainment, says the dame is a “travesty of a female character” dating back to medieval times but in panto the character must also be a warm, trusted and motherly presence. \n“That idea of men dressing up and playing them in a ludicrous fashion is in just about every carnival or lord mayor’s procession you have ever seen,” he adds. Steve Bennett as Dame Sarah Suet, photo by Matt Austin \n“The rugby club are always dressing up like that; it is a trope of humour but embodied within it the conventional dame is a loving, motherly, absorbing, warm figure whom we must trust.” \nTony explains how British pantomime has its roots in war-torn 18th and 19th century Europe, though the characters came from the travelling troupes which toured from Tudor times. \nAnd he argues that the current hysteria around Brexit has parallels with that time, when war severed links with mainland Europe and fears of the continent originated. Read More Exeter's H&M reveal BIG changes to high street store - including makeup counters \n“We have a lot of our fears about Europe, which we even see today with things like the whole argument over Brexit the fear of the Continent – the whole idea of being an island breed – those ideas are in part forged by the fears there are of Europe from that period,” he explains. \n“British culture of that time evolved some its own indigenous performance forms – the most easily recognisable being pantomime and Punch and Judy, both which have their roots in the Italian Commedia dell'arte. Emily Essery, who plays Dick-Whittington at the Northcott \nIn England, pantomime took the comic trio of Harelequin, Columbine, and Pantaloon and added a new character called clown, who created a knockabout comedy in the style of the Keystone Cops. \nThis Harlequinade and was done in dumb show, a version of Tom and Jerry with slapstick routines, music and comedy effects. \nThese routines followed a fairy tale, told in verse by narrators The Immortals, and were signalled by the banging of a “slapstick”. \nAt this point, the papier-mâché heads and costumes would fly off to reveal the four characters. Read More This Exeter hotel is serving up a Christmas-themed afternoon tea - and there's champagne and gin involved \nThis evolved here and during the 19th century, the fairy story shrank while the knockabout expanded to eventually take over this Harlequinade, which died out by 1920. \nAnd this was when that the skirted character or Dame, created by Dan Leno, takes over Joe Grimaldi’s 18 century creation, Clown. \n“That format from the late 19 century when we have the involvement of music hall acts and variety routines, that is the basis for what we call the modern pantomime,” Tony adds. \nSteve says it has evolved into a “purely British” tradition which is incomprehensible to outsiders. \n“If you show it to someone from another country they just don’t seem to get it. \n“As a dame you call out to somebody from New Zealand and so-and-so from Australia and you think ‘do they get it?’ because it is such a British tradtion. \n“The other thing about panto – great fun though it is – is that it is really hard work. I think we are doing 62 shows this year – twice a day – now I know it’s not coal mining but you do know you have done it by the end.” Read More \nFor the return to a Northcott tradition, Tony and Steve have created a locally based story which they hope will strike a chord with audiences, whose reaction is as important to the play as the actors or the script. Jaz Morley in rehearsal by Mark Dawson \n“We reference Dick coming from Exeter throughout the performance and I think that’s very important,” Steve added. \n“I was lucky enough to do 14 shows at the Northcott and to be back again after eight years is a real treat. \n“It’s very important for me that panto is in Exeter and that panto is at home.” \nThis week rehearsals will move from the studio at Spacex in Exeter's Preston Street to the theatre and a specially built set. \nAs the production enters its final week, Tony says he is excited at the prospect of seeing the show evolve as the audience reacts. \n“What we have is a very strong story: it’s fast, it’s funny, the performers, the musicians and the designers are all very skilled and bring it to life,” he adds. Read More These 5 places in Devon are guaranteed to get families in the festive spirit \n“The exciting thing for me is we are nearly at the point when I can put it in front of people who have not seen it and watch them. It will change again because the audience is the element of completion that any pantomime needs. \n“Many plays can take place irrespective of whether there is an audience there or not; they simply sit in the dark and have no direct participation. \n“But a pantomime begs participation; it is an immersive experience but it is an engaging one that requires the direct involvement, physically and vocally, of the audience. \n“The timing of those jokes, the timing of those routines, can’t be complete until the audience is there. \n“However brilliantly I may feel I have it here, it will be more brilliant once it has sat in front of an audience and bedded itself in.” \nDick Whittington runs from December 2 to January 7 at Exeter Northcott Theatre. \nTickets are available from the box office on 01392 726363 or by clicking here Like us on Facebook ", "external_links": [], "published": "2017-11-26T14:31:00.000+02:00", "crawled": "2017-11-26T15:09:39.004+02:00", "highlightTitle": ""}