{"organizations": [], "uuid": "18fbc323823b77ecffe46000c9a64573357729e7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article8318845.ece/ALTERNATES/s1200/turksheadhotel.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/grey-street-student-housing-plans-13950603", "country": "GB", "domain_rank": 21960, "title": "Grey Street student housing plans dropped as new owner buys Newcastle property", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-26T13:00:00.000+02:00", "replies_count": 0, "uuid": "18fbc323823b77ecffe46000c9a64573357729e7"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/grey-street-student-housing-plans-13950603", "ord_in_thread": 0, "title": "Grey Street student housing plans dropped as new owner buys Newcastle property", "locations": [], "entities": {"persons": [{"name": "necastle", "sentiment": "none"}, {"name": "serfontein", "sentiment": "none"}, {"name": "hanro", "sentiment": "none"}, {"name": "adam serfontein", "sentiment": "none"}, {"name": "alnwick", "sentiment": "none"}, {"name": "frank", "sentiment": "none"}], "locations": [{"name": "grey street", "sentiment": "none"}, {"name": "doxford park", "sentiment": "none"}, {"name": "heaton", "sentiment": "none"}, {"name": "leeds", "sentiment": "none"}, {"name": "science central", "sentiment": "none"}, {"name": "scotswood road", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "trimdon street", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "wessington way", "sentiment": "none"}, {"name": "jesmond", "sentiment": "none"}], "organizations": [{"name": "hanro", "sentiment": "negative"}, {"name": "grey street", "sentiment": "negative"}, {"name": "newcastle", "sentiment": "negative"}, {"name": "volvo", "sentiment": "none"}, {"name": "barclays", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "b&q", "sentiment": "none"}, {"name": "honda", "sentiment": "none"}, {"name": "aldi", "sentiment": "none"}, {"name": "sainsbury", "sentiment": "none"}, {"name": "vodafone", "sentiment": "none"}, {"name": "topps tiles", "sentiment": "none"}, {"name": "barclays house", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Grey Street student housing plans dropped as new owner buys Newcastle property Hanro has snapped up the Grey Street building as part of a £120m spending spree Share The old Turks Head Hotel on Grey Street, Newcastle Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nNewcastle property firm Hanro has snapped up a historic city centre building as part of a £120m property spending spree. \nOver the last two years the commercial property company has sold off a vast chunk of its portfolio after carrying out a strategic review. \nAdam Serfontein, managing director, of Hanro, said the time was right to sell those properties, which included Sainsbury’s in Heaton in a £44.5m land deal. \nNow the company is investing in new stock, with a sharp focus on the growing leisure sector as well as offices. \nHanro plans to invest a total of £120m on properties across the North East, with £70m already ploughed into a range of schemes. \nOver the last few months the firm has acquired the Waitrose supermarket in Jesmond, a Vodafone retail unit in Leeds, Noble Street industrial estate in Newcastle, Alnwick’s Aldi supermarket and Topps Tiles store, the Barclays call centre at Doxford Park, the Mill Volvo garage on Necastle’s Scotswood Road and the Honda Car centre on Wessington Way, Sunderland and B&Q warehouse on Trimdon Street in Sunderland and the Royal Mail depot in Sunderland. The building was formerly home to The Royal Turks Head Hotel \nHanro managing director Adam Serfontein said: “In 2016 we carried out a review that led to us seling off £120m of property, prior to the referendum – and we started to acquire again last autumn. \n“We had a significant portfolio that we’d owned for some time and through development of the stock we had added as much value as we could to it, so the time was right to sell. \n“This time we have been looking at out-of-town retail, commercial retail and also city centre retail, based where there are big markets for tourists and students – we are essentially targeting the leisure, industrial and offices markets. \n“We are getting into real Brexit negotiations and there are more downsides than ups but there are always opportunities to be had in property, so long as you have the right sector, in the right location.” \nThe firm’s key purchase in Newcastle city centre is Barclays House, a building that was subject to a controversial planning scheme under previous ownership three years ago. Adam Serfontein - Hanro \nApproval then was granted to convert the grand listed building on Grey Street, which had previously been the Royal Turks Head hotel, into student accommodation. \nHowever, that scheme never proceeded, paving the way for Hanro to step in, buy the building and put its plans into action. \nMr Serfontein is adamant that no student accommodation will feature, condemning the amount already in existence in the city, and will instead oversee Hanro’s plans to convert it into swish new offices, with around 21,000sqft of available space. \nThe firm paid just over £4m for the building, which comes with its own parking area, and work is just beginning on a £2m refurbishment programme devised to entice scaleup firms into the city. \nMr Serfontein said: “We think that Grey Street is heading for a new high and Barclays House is in a great location. \n“As someone who cares about Newcastle I do not want to see anymore student accommodation in Newcastle city centre, where there is actually over supply. Read More Plans mooted for Newcastle aparthotel and apartment scheme near Science Central \n“For smaller businesses with growth potential there is a real value in ‘clustering’ and we think our new offices will provide them with the location we need, and we are undertaking quite a big programme of works to make some great new offices ready for the Spring, and Knight Frank will be marketing them for us. \n“As well as its great location it has car parking on site – 60 spaces on two levels in part of the building that was added in the late 1980s when Barclays were still tenants. \n“We are completely renovating the whole building and creating a new reception area, which will potentially take in the site of the former hairdressers’ that was based in the building until recently. \n“What we really want to do is create a buzz in the building with scaleup businesses who can be complementary to one another.” \nThe firm is also looking to introduce shorter term leases, from three years, as opposed to the traditional, longer leases which have constrained many businesses who have outgrown premises. \nHe said: “Rather than try to fight the tide, this is a building where we are happy to accept that the more flexible we are with leases, the more demand we will have from occupiers.” Like us on Facebook ", "external_links": [], "published": "2017-11-26T13:00:00.000+02:00", "crawled": "2017-11-26T14:40:45.000+02:00", "highlightTitle": ""}