{"organizations": [], "uuid": "fb01081ce79915c066651d30390ef18c73526579", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bostonstandard.co.uk", "main_image": "https://res.cloudinary.com/jpress/image/fetch/w_300,f_auto,ar_3:2,c_fill/https://www.skegnessstandard.co.uk/webimage/1.8269829.1512044254!/image/image.jpg", "site_section": "http://www.skegnessstandard.co.uk/rss/cmlink/1.346949", "section_title": "Skegness Standard MSKP.news.feed", "url": "https://www.bostonstandard.co.uk/news/boston-and-skegness-mp-accuses-government-members-of-scaremongering-and-weaponising-people-s-futures-in-eu-nationals-debate-1-8269830", "country": "GB", "title": "Boston and Skegness MP accuses Government members of ‘scaremongering’ and ‘weaponising’ people’s futures in EU Nationals debate", "performance_score": 0, "site": "bostonstandard.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-30T14:17:00.000+02:00", "replies_count": 0, "uuid": "fb01081ce79915c066651d30390ef18c73526579"}, "author": "", "url": "https://www.bostonstandard.co.uk/news/boston-and-skegness-mp-accuses-government-members-of-scaremongering-and-weaponising-people-s-futures-in-eu-nationals-debate-1-8269830", "ord_in_thread": 0, "title": "Boston and Skegness MP accuses Government members of ‘scaremongering’ and ‘weaponising’ people’s futures in EU Nationals debate", "locations": [], "entities": {"persons": [{"name": "warman", "sentiment": "none"}, {"name": "mrs atkins", "sentiment": "none"}, {"name": "victoria atkins", "sentiment": "none"}, {"name": "drew hendry", "sentiment": "none"}, {"name": "daniel jaines", "sentiment": "none"}, {"name": "colin clark", "sentiment": "none"}, {"name": "matt warman", "sentiment": "none"}], "locations": [{"name": "boston", "sentiment": "none"}, {"name": "latvia", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "louth horncastle", "sentiment": "none"}, {"name": "poland", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "lithuania", "sentiment": "none"}], "organizations": [{"name": "eu nationals", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "snp", "sentiment": "none"}, {"name": "skegness", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Boston and Skegness MP accuses Government members of ‘scaremongering’ and ‘weaponising’ people’s futures in EU Nationals debate Boston and Skegness MP Matt Warman ANL-171117-072818001 Daniel Jaines Published: 12:17   \nThe MP for Boston and Skegness has accused members of Parliament of ‘scaremongering’ over the futures of foreign nationals in the UK and ‘weaponising’ the lives and livelihoods of people who come to this country. \nMP Matt Warman was speaking during a debate yesterday (Wednesday) on EU Nationals in which the Government called for the introduction of legislative proposals to safeguard the rights of EU nationals living in the UK. \nHe attacked several previous speakers who claimed their surgeries were ‘flooded’ by migrant members worried about their future, and had said migrants were still uncertain. \nHe told the chamber: “It is with some sadness that I rise to speak in this debate, because my constituency has received proportionally more migrants from eastern Europe than anywhere else in the country. Of all places, Boston and Skegness knows the value that people from Poland, Latvia, Lithuania and elsewhere bring to our local economy. \n“Today we have heard a great deal about surgeries being flooded with people worried about their livelihoods. If I may be blunt, surgeries may be flooded if Members scaremonger and tell people that they might not be welcome here. \n“Being prepared to weaponise the lives and livelihoods of people who have come to this country in good faith, and who the Prime Minister has said are welcome to stay, is not good politics or good democracy. Frankly, it is shameful conduct over a genuinely important matter for constituents on the part of people with other political motives.” \nHe told members they had a ‘responsibility’ to reassure people and reiterated comments from the Front Bench that the Government ‘want people to stay’. \nHe added that people who asked EU nationals to leave did not represent the mainstream of Brexit voters, or a large number of people. \n“In my constituency, the only people who ask for ‘foreigners to go home’, as it is often put, are either those who seek to misrepresent the views of Brexit voters or those who have their own nakedly racist proposition.” \nHe said that less than 10 people had come to his own surgeries seeking reassurance on the future of EU Nationals but said all had ‘received just that’ \n“They have gone away knowing that this Government seek to provide them with what they need,” he said. \nHe concluded by saying: “I will end by asking, what can Members of this House do? Well, we can do things such as invite the Polish ambassador to our constituency, as I have done. We can stand on a platform with him and say, ‘This Government welcome the contribution of EU nationals. We want you to stay, and we will deliver that deal as best we can’.” \nDrew Hendry, the shadow SNP spokesman later accused Mr Warman of a ‘stunning lack of empathy’, saying that living with the uncertainty brought a lot of stress. \nHowever, he was supported by Conservative MPs Colin Clark and Victoria Atkins. \nMrs Atkins, who oversees the Louth Horncastle constituency said Mr Warman had ‘the honour of representing a constituency with one of the largest eastern European populations in the country’. \nShe said: “He set out very robustly the views of his constituents, not only those who are ‘yellowbellies’ born and bred, but those who have had the good sense to move to his constituency from the European Union. \n“Since the result of the referendum last summer, the Government have made absolutely clear how important it is for us to secure the status of EU citizens here as soon as possible.” Sign in", "external_links": [], "published": "2017-11-30T14:17:00.000+02:00", "crawled": "2017-11-30T14:44:17.039+02:00", "highlightTitle": ""}