{"organizations": [], "uuid": "68f3f0fd54678790dd52ad0e91ec0daf079d7902", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article747764.ece/ALTERNATES/s1200/LEW_9853JPG.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "devonlive - frontpage", "url": "http://www.devonlive.com/news/devon-news/born-castle-threatened-nigeria-now-747739", "country": "GB", "title": "Born in a castle, threatened in Nigeria and now elected; meet Mid Devon's latest member Anthony Bush", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-08T19:42:00.000+02:00", "replies_count": 0, "uuid": "68f3f0fd54678790dd52ad0e91ec0daf079d7902"}, "author": "Lewis Clarke", "url": "http://www.devonlive.com/news/devon-news/born-castle-threatened-nigeria-now-747739", "ord_in_thread": 0, "title": "Born in a castle, threatened in Nigeria and now elected; meet Mid Devon's latest member Anthony Bush", "locations": [], "entities": {"persons": [{"name": "mid devon", "sentiment": "none"}, {"name": "anthony", "sentiment": "none"}, {"name": "anthony bush", "sentiment": "none"}, {"name": "croner", "sentiment": "none"}, {"name": "frank the mad axeman mitchell", "sentiment": "none"}, {"name": "mitchell", "sentiment": "none"}, {"name": "bush", "sentiment": "none"}, {"name": "cecil hoare", "sentiment": "none"}, {"name": "kray", "sentiment": "none"}, {"name": "cllr bush", "sentiment": "none"}], "locations": [{"name": "nigeria", "sentiment": "none"}, {"name": "buckinghamshire", "sentiment": "none"}, {"name": "paris street", "sentiment": "none"}, {"name": "devon live", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "wales", "sentiment": "none"}, {"name": "camden town", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "lagos", "sentiment": "none"}, {"name": "greyhound pub", "sentiment": "none"}, {"name": "moretonhampstead", "sentiment": "none"}, {"name": "tiverton", "sentiment": "none"}, {"name": "tiverton castle", "sentiment": "none"}, {"name": "fullfords", "sentiment": "none"}, {"name": "westexe south", "sentiment": "none"}, {"name": "bickleigh bridge", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}], "organizations": [{"name": "american express", "sentiment": "none"}, {"name": "krays", "sentiment": "none"}, {"name": "fulfords college", "sentiment": "none"}, {"name": "country gentleman’s association", "sentiment": "none"}, {"name": "tiverton town council", "sentiment": "none"}, {"name": "trade international digest", "sentiment": "none"}, {"name": "district council", "sentiment": "none"}, {"name": "mount radford school", "sentiment": "none"}, {"name": "western daily press", "sentiment": "none"}, {"name": "bath chronicle", "sentiment": "none"}, {"name": "business association", "sentiment": "none"}, {"name": "dartmoor prison", "sentiment": "none"}, {"name": "mid devon", "sentiment": "none"}, {"name": "mid devon district council", "sentiment": "none"}, {"name": "country landowners’ association", "sentiment": "none"}, {"name": "press association", "sentiment": "none"}, {"name": "export times", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Born in a castle, threatened in Nigeria and now elected; meet Mid Devon's latest member Anthony Bush Councillor Anthony Bush was elected onto Mid Devon District Council in September this year winning the seat for the Conservatives Share Councillor Anthony Bush who lives in Tiverton Share Get   Thank you for subscribing!   \nBorn in a castle, threatened in Nigeria and now recently elected to Mid Devon District Council – Devon Live caught up with the latest councillor to add to the Conservative majority on the authority, Anthony Bush. \nCllr Bush, 69, was born in Tiverton Castle, which at the time was owned by his grandparents. He later went on to be educated at Mount Radford School in Exeter with the dream on one day becoming a journalist. \nHe said: “I had just gotten a handful of O-Levels and keep badgering the editor. It was very difficult to get a job in journalism as so many people wanted to be a journalist as I expect it is today. \n“It was a man called Cecil Hoare who did all he could to keep me at bay. He sent me off to learn how to type at Fulfords College, and I joined up there. When I went back to tell him how I was getting on, he said I should learn shorthand as well, so I took another course at Fullfords. Eventually, he phoned my mother and said ‘as I am now seeing more of your son than you are, I’m going to give him a job.’ \n“I started as a junior for three years - indentures as they called it – and went to do the whole gambit of local reporting stuff, from councils magistrates, courts and then going out with your notepad open to meet and get stories from people.” Anthony Bush was born at Tiverton Castle \nAt the time, Cllr Bush also wrote for the Western Morning News who shared an office with the Express & Echo above the Greyhound Pub on Paris Street. He also had stints with the Western Daily Press and the Bath Chronicle before joining the Press Association. \n“In those days you had to pass an exam to work for the PA which lasted for a day,” Cllr Bush said. \n“It was a very rigorous test of sub-editing, general knowledge, and law. I managed to pass that and was offered a job. I was very excited as I had always wanted to be on PA.” \nCllr Bush’s determination stemmed from a story he covered following an escape at Dartmoor Prison. \n“I remember so well that I was impressed by them when I was a junior on the Express and Echo after one of the Kray’s associates, 'Frank the Mad Axeman Mitchell’ broke out of Dartmoor Prison, and his clothing had been found alongside the road near Moretonhampstead. I and a photographer rushed out there to speak to some people who had found the clothing and such, then whizzed back to our office, and I wrote a story as quickly as I could. I ran in to see the chief sub-editor to tell him more would follow and he told me ‘forget it, lad, we’ve had it from PA.’ \nAs a side note, it was the Krays who organised Mitchell’s escape in 1966 before murdering him. Frank the Mad Axeman Mitchell (Image: Dartmoor Prison) \nCllr Bush moved to London with his wife who he had married aged 21 in 1969 before heading out to Buckinghamshire. \n“I thoroughly enjoyed my time with the Press Association but wanted to specialise in international trade. At the time, Britain was shedding its empire that came with a trade ‘monopoly’ and was seeking new markets as well as ways to be increasingly competitive. \n“I had a cousin who worked for a magazine called Export Direction who worked on the sales side and he showed me the magazine which I fell in love with it. I was fascinated by its aims, to foster, nurture and encourage British exports, and when I saw a vacancy for the deputy editor, I applied and got it. I later went on to become the editor.” \nThe magazine was published in Camden Town next to a garage in “some rickety old building” as Anthony describes it. \n“A lot of chums at the Press Association were shocked that I was leaving Fleet Street to go to a trade magazine - and it’s true I was - but it leads to the best time of my life, and I then was able to travel around the world,” he added. Read More Council accused of prejudice as Westexe businesses bemoan at lack of parking permits \nOf the dozens of stories Cllr Bush can recall, one stands out – and it’s a little scary. \n“I was in what was known as the exporter’s western front; Lagos in Nigeria. My hotel room was robbed, and one of the things they took was my American Express card; in those days you really needed one of those. \n“I went down to the office in Lagos and asked to see the manager who I was told had gone. I told them I would sleep on the sofa until the manager came back and I stretched out on the sofa and made myself comfortable. The man at reception proclaimed ‘no, no, I think the manager has just come back’ and he opened a door and there he was. \n“We got all that resolved, then the day when I was leaving it was absolutely thrashing down with rain, and we were on one of the most dangerous roads in the world, with people sticking guns in your face and oil drums on the road so you never quite knew where you were. \n“On the way back my taxi had a crash, and the two drivers got out and started fighting. I was sitting at the back feeling like the man in the Hamlet Cigar adverts hoping my man won. The police came, and we got to the airport where somebody came up to me dressed as a porter who wanted to take my bag. On the way into the departure lounge, he suddenly grabbed me by the throat and shoved me up against the wall. He was in he was a mugger in disguise and as I was only 32 at the time, I managed to fight him off. I saw this policeman who had a stick and a gun and asked him why he didn’t help me. He told me ‘you were lucky, you could have been killed.’ \n“He explained that these people lived locally and if anyone interfered they threatened their family, so that was how they got away with it. Read More War heroes remembered as youngsters discover Tiverton's war memorial \n“I then went to the airport and was speaking to this Italian exporter, and suddenly all the lights went out, and there were shouts to grab your briefcase which I did. When the lights came on again, I was told that sometimes that happens and that somebody would come whizzing through to get what he could. \n“Then as we got on the British Caledonian plane, we got to a point known as V2 just before take off when all the runway lights failed, and we had to skid to a halt.” \nWith the experience of setting his budget and responsibility for selecting a typesetter, printer and mailing house, and insight into a government ministry as well as a sense of running a business, Cllr Bush went on and formed a partnership to launch another magazine, Export Times. \nHowever during the late 1970s, and early 1980s advertising revenue started to tumble. \n“We didn’t go bust, but it couldn’t continue because we had the recession and it was a dreadful period,” he said. \n“Advertising just collapsed, advertising agencies went to the wall, and in one case one agency took a lot of our money with it. \n“During that period of ownership, I also launched three other titles and continued to oversee them until the business was sold and I became a freelance working for a variety of publications in some different fields. \n“At that point, I was to have involvement with rural affairs when, successively, I became editor of the Country Gentleman’s Association magazine and another published by the Country Landowners’ Association (now the Country land and Business Association). The latter is a membership organisation for landowners, farmers and businesses in rural England and Wales.” Read More Call to identify drivers who cause Bickleigh Bridge damage after more repairs \nDuring this time, Anthony was a magistrate for 18 years, 16 of which were spent as chairman of the Bench. \nSeven years ago he returned to Devon with his wife June, who was born in Exeter, as the couple wanted to re-set their roots. \n“It was such a pleasure going back to places that we had last visited so far back in our past. I remember saying to the landlord of one pub that it was the first time I had been into his bar for more than 30 years, but he didn’t seem particularly interested. \n“’That isn’t too surprising’ said my wife ‘you’re hardly a regular are you?’” \n“Today I still undertake a little journalistic work, including writing three articles a month for Trade International Digest and acting as update editor for Croner’s Reference Book for Exporters. Read More Parent who got child to take poo to the canal is fined £80 \nSadly, June died in 2015 after being married for 46 years, having two sons and six grandchildren. \nIt was soon after the death of his wife that Anthony was asked to go for co-option on Tiverton Town Council representing Westexe South. \n“Somebody came to see me asking if I would be interested,” he said. “I saw it as a challenge, and I was looking for something else in my life and thought that would appeal to me. \n“I was then approached to stand on Mid Devon earlier this year. It was a fascinating experience to look around both North and South Westexe. I set myself a target to knock on doors and to meet as many people as possible, and I was taken aback at how exceedingly gracious people were – I had expected some to slam their door in my face for turning up out of the blue, but that never happened. \n“As for politics, I didn’t discuss that at all, nobody even mentioned it or the word Brexit, but people are either with you are they aren’t. It’s no point arguing on the doorstep as you’re never going to convert anyone having a chat in the middle of their tea. I tried to do it in a rather jolly way. \n“I have devised a method to deal with the queries, keeping things logged, marking the date and following things up to see if they have been resolved. I can’t believe how different it all is, from recycling, parking, speeding, people concerned about the flats that they live in and complaints about agricultural machinery using the roads. \n“It’s early days with the District Council, but it’s hard to see why I wouldn’t want to continue during elections in the future.” Like us on Facebook", "external_links": [], "published": "2017-11-08T19:42:00.000+02:00", "crawled": "2017-11-08T19:52:32.003+02:00", "highlightTitle": ""}