{"organizations": [], "uuid": "56266559d015e790a82e70a556dcba9ae6289469", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/business/article784782.ece/ALTERNATES/s1200/SHSWGS.jpg", "site_section": "http://www.devonlive.com/rss.xml", "section_title": "devonlive - frontpage", "url": "http://www.devonlive.com/news/business/how-devon-south-west-pulling-784722", "country": "US", "title": "How Devon and the South West is pulling together to boost prosperity by becoming more productive", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-16T12:15:00.000+02:00", "replies_count": 0, "uuid": "56266559d015e790a82e70a556dcba9ae6289469"}, "author": "Hannah Finch", "url": "http://www.devonlive.com/news/business/how-devon-south-west-pulling-784722", "ord_in_thread": 0, "title": "How Devon and the South West is pulling together to boost prosperity by becoming more productive", "locations": [], "entities": {"persons": [{"name": "devon", "sentiment": "none"}, {"name": "david hynd", "sentiment": "none"}], "locations": [{"name": "south west", "sentiment": "none"}, {"name": "south west lep", "sentiment": "none"}, {"name": "south west growth hub", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "bristol", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}, {"name": "hinkley", "sentiment": "none"}], "organizations": [{"name": "lep", "sentiment": "none"}, {"name": "agm", "sentiment": "none"}, {"name": "growth hub", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "hotsw lep", "sentiment": "none"}, {"name": "somerset & torbay", "sentiment": "none"}, {"name": "cbi", "sentiment": "none"}, {"name": "somerset cricket club", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Sponsored How Devon and the South West is pulling together to boost prosperity by becoming more productive The Heart of the South West LEP is prioritising productivity to make life better in the region Share Click to play Tap to play The video will start in 8 Cancel Play now   Thank you for subscribing!   \nLast Friday we held our third Conference and AGM at Somerset Cricket Club, and welcomed over 300 people from the local business community and the public sector. \nProductivity was the theme of the day, and is the key to prosperity in the 21st century economy. Basically, by raising productivity - that is - being more efficient in what we produce per hour worked; we can raise living standards and boost business growth. \nThis can be done in a number of ways, such as improving connectivity, increasing skills, innovation and automation; all of which reduce costs and raise profit. At the same time, improving prosperity has a positive effect on the health and wellbeing of the community, which in turn reduces costs to the public purse and therefore helps business by maintaining a buoyant workforce and keeping a measure on tax and rates. \nProductivity has been in the news a lot lately and it appears that others share our view that investment is the key to raising output. Some MPs and the CBI are calling on the chancellor increase public investment, the UK’s five leading business organisations this week urged the government to “put the economy first” in Brexit talks. \nLet’s see what next week’s budget announcement for us. We’re hoping to be given the tools to grow our way towards prosperity through diligent investment and sector deals with government. \nThe draft Productivity Strategy for the area is still out for consultation, which I know many of you have been involved in developing. Anyone not having made comments has until 30 November to do so, and we want as much input as possible from a broad range of business interests and all stakeholders in this economy. It can be found here Delegates gather for the HoSW Conference and AGM \nWe’re operating in a fast-moving political and economic environment, with many unknowns on the horizon – which could present many opportunities if we’re swift off the mark to harness them. There are also potential risks in a changing landscape that we may need to mitigate and manage. \nIt’s more important now than ever that we work together as business leaders, local authorities, education establishments, social enterprises, politicians and communities as a common voice to champion our area. \nNow, top line strategy is very important, but at HotSW LEP we're in the business of leading and delivering as well as thinking and analysing. \nWhen I addressed our first conference in 2015, we'd just signed one Growth Deal with government that was to put in place a set of strategic infrastructure needs that were to kickstart the regeneration process for area. Heart of the South West Growth Hub exceeds targets to help local businesses \nAt the Heart of the South West (HotSW) LEP Conference and AGM, the Heart of the South West Growth Hub, the LEP’s main mechanism for engaging with businesses in the area, hosted a series of informative sessions on key topics for businesses. These included; a workshop on implementing the upcoming General Data Protection Regulation, exporting for businesses, accessing finance, digital transformation in the workplace and increasing productivity. It was also announced that the Growth Hub is exceeding the targets it has been set to deliver support to businesses in the area. \nProgramme and Partnerships Manager for the Growth Hub, David Hynd, said: “We have not only met but are exceeding our targets to engage with businesses and to support them to make the most of funded schemes and support. The LEP Conference was a great event to showcase the tremendous network of local organisations able to offer workshops, advice and guidance to businesses. This is crucial to the work of our locally-based Growth Hub advisory team and means that we are able to deliver a support service that can be used by and is of benefit to any business in the area.” \nSince starting in early 2016, the Growth Hub has helped over 2,872 local businesses. Growth Hub business advisers provide a free, impartial advisory service as well as a personal introduction to relevant business support providers who have specialist knowledge on topics such as finance, exporting, sales and marketing, developing your business, etc. \nThe Growth Hub has so far introduced over 650 businesses to the most appropriate funded and part-funded business support available, both regionally and nationally. This is over and above the thousands who access factsheets, guidance and other support. \nThe Heart of the South West Growth Hub is available to any business of any size operating in any sector within Devon, Plymouth, Somerset & Torbay. Find your local Growth Hub here \nOnly a handful of these projects had started on site, so our impact wasn't very evident to see. Now we have three Growth Deals in the bag – including the biggest allocation in the country – which, along with our other pots of funding gives us a programme of investment of nearly three quarters of a billion pounds. This is surely testament to our success and shows consistent confidence from government in our ability to deliver. \nAnd delivering we are. Of our 57 projects, 11 are already completed, 27 are underway and a further 19 are in the pipeline to start soon. These funds are matched by a range of public, private a third sector partners, which again demonstrates confidence in the LEP and the HotSW area itself. \nDetails of our projects and their progress are available on our website, where you can sign up for our newsletter and social media streams to keep abreast of what’s going on. Our project portfolio includes a diverse range of schemes ranging from transport improvements to skills raising, innovation to supply chain development. \nGenerating investment isn’t just about securing grants and handouts though, it’s showing our worth to UK plc and raising our profile in a national and international marketplace. \nHere at the Heart of the South West – the epicentre of the peninsula with the thriving neighbouring catchments of Bristol and the southern England – we already have a bigger economy than Birmingham and the potential to grow at a faster rate than the UK average. \nIncreasingly there’s a critical mass of success factors that are converging to make the south west a prime business location . \nThe region has long been hindered by its geography and connectivity being detached from the industrial cities; but that’s all changing. Investments in road, rail and broadband; the development of higher level skills, more affordable housing and the offer of favourable investment opportunities through our multi-site Enterprise Zones, all add up to creating the right conditions for growth and maximising on our opportunities. \nThrough the measured interventions of the LEP partnerships and the commitment and enthusiasm of the business community and local authorities, we’re attracting increasing levels of investment in new companies and expansions coming from outside of HotSW and overseas. \nThere’s been investment in a range of innovative sectors such as advanced electronics, marine, nuclear and aerospace. We’ve had a catalyst of investment in nuclear with the largest engineering project in Europe taking shape at Hinkley, which is presenting enormous supply chain and careers opportunities across the region. And a renewed global focus on agriculture heralds a dawning of a new age of rural productivity in which we have the potential to be a world leader if we collaborate and adopt new technologies. \nWe’d like to thank our colleagues at the Heart of the South West Growth Hub, who hosted some insightful business support events throughout the afternoon of our conference. And I would like to remind all businesses of this free and impartial service that’s there to help all businesses grow. Read More", "external_links": [], "published": "2017-11-16T12:15:00.000+02:00", "crawled": "2017-11-16T12:50:06.003+02:00", "highlightTitle": ""}