{"organizations": [], "uuid": "b1aed4cc16983b6d9985b696c81065c43966d7a8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article796886.ece/ALTERNATES/s1200/migrant-workersPNG.png", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "devonlive - frontpage", "url": "http://www.devonlive.com/news/jobs/looming-migrant-worker-crisis-devon-796871", "country": "GB", "title": "Looming migrant worker crisis as Devon gets ready for EU worker shortage", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-18T11:09:00.000+02:00", "replies_count": 0, "uuid": "b1aed4cc16983b6d9985b696c81065c43966d7a8"}, "author": "Daniel Clark", "url": "http://www.devonlive.com/news/jobs/looming-migrant-worker-crisis-devon-796871", "ord_in_thread": 0, "title": "Looming migrant worker crisis as Devon gets ready for EU worker shortage", "locations": [], "entities": {"persons": [{"name": "devon", "sentiment": "none"}, {"name": "brian meaden", "sentiment": "none"}, {"name": "stefan rousseau/pa wire", "sentiment": "none"}, {"name": "ben bradhsaw", "sentiment": "none"}, {"name": "ben bradshaw", "sentiment": "none"}, {"name": "john bickley", "sentiment": "none"}, {"name": "malcolm bell", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}, {"name": "mark goodwin", "sentiment": "none"}, {"name": "tim jones", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "minette batters", "sentiment": "none"}, {"name": "bickley", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "cornwall", "sentiment": "none"}, {"name": "west", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "moorland garden hotel", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "office for national statistics", "sentiment": "none"}, {"name": "exeter university", "sentiment": "none"}, {"name": "university of exeter", "sentiment": "none"}, {"name": "exeter labour", "sentiment": "none"}, {"name": "ons", "sentiment": "none"}, {"name": "global justice", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "visit cornwall", "sentiment": "none"}, {"name": "national farmers’ union", "sentiment": "none"}, {"name": "cornwall business council", "sentiment": "none"}, {"name": "nfu", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Looming migrant worker crisis as Devon gets ready for EU worker shortage Migrants are staying for now, but MP warns worst yet to come   \nWest businesses are facing up to a looming migrant worker crisis – by holding onto staff from across the EU or recruiting British employees to fill the gaps. \nEmployers with strong reputations are able to continue to attract key people from across the EU while others in the region have adopted a policy of attracting a local workforce. \nThere are fears that some sectors, particularly agriculture, will struggle as Brexit bites and foreign workers head for home. Read More 'Abolish Devon district and borough councils to create super authority', study says \nOfficial figures released by the Office for National Statistics (ONS) this week showed a record number of EU citizens are working in the UK. The hospitality sector, thought to be at risk from a shortage of skilled local labour should EU workers depart, is said to be holding up and in education, Exeter University said it had recruited 100 EU staff since last year’s vote for Brexit. \nHowever, worries about a loss of migrant labour were voiced by the National Farmers’ Union. And Exeter Labour MP Ben Bradshaw said that Brexit had not happened yet and “in the event of a bad deal or no deal at all, all bets are off. Ben Bradhsaw after increasing his majority in May \n“While Exeter University may not have a problem yet, there has been a big drop in EU nationals coming to work in our NHS and social care system and a big increase in the number leaving, adding to the staffing crisis they are already suffering from,” he said. \nHowever, Ukip’s John Bickley said Remainers who warned of dire Brexit consequences had got it wrong as a “positive picture” continued. “This was going to be the end of the world, Project Fear told us. That is embarrassingly wrong,” said Mr Bickley, immigration spokesman for the party that is headquartered in Devon. If problems developed within agriculture, increasing automation and technological advances would solve them, he added. Read More How Devon and the South West is pulling together to boost prosperity by becoming more productive \nHowever, Minette Batters, the deputy president of the NFU, told an audience in Cornwall: “The NFU’s labour survey for horticulture has shown that the number of EU seasonal workers coming to the UK was down consistently between 13% and 17% over this summer’s harvest period, so it is critical a seasonal workers scheme is re-introduced.” Without this, increased mechanisation would not be much help. “We have the technology to pick a strawberry, but who will invest in it?” she said. Migrant workers picking daffodils \nAway from farming and horticulture, the picture appears to be brighter. The University of Exeter – which pumps £1.1 billion into the South West economy annually – has gained 100 staff from EU countries, despite the referendum vote. “Our reputation is such that we can add and retain staff,” Professor Mark Goodwin, a deputy vice-chancellor of the university said. \nBrian Meaden, of the Moorland Garden Hotel, near Plymouth, said they now had no EU workers among the 60-plus staff and there had been “no difficulty” finding skilled local labour. Protesters from Another Europe Is Possible and Global Justice outside Parliament (Image: Stefan Rousseau/PA Wire) \nMalcolm Bell, chief executive of Visit Cornwall, said migrant labour had “not been a huge issue this summer. We have freedom of movement at the moment. There is more of a worry about the future.” Read More Devon MP demands apology for 'mutineer' smear \nTim Jones, chairman of Devon and Cornwall Business Council, said the region might be resilient due to the relationships built up with European partners through EU projects. \nHe added: “We need to see the break down on the ONS numbers sector by sector. There are concerns among farmers. And the building sector is heavily reliant on EU workers. We need to train up [local] people there.” Like us on Facebook", "external_links": [], "published": "2017-11-18T11:09:00.000+02:00", "crawled": "2017-11-18T11:34:55.000+02:00", "highlightTitle": ""}