{"organizations": [], "uuid": "e77b576d443044066eeeb1e94398a91e25fa28de", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13943746.ece/ALTERNATES/s1200/JS137085530.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-apprentices-bucking-trend-13943738", "country": "GB", "domain_rank": 21960, "title": "North East apprentices bucking the trend as more youngsters secure long-term careers", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-23T20:00:00.000+02:00", "replies_count": 0, "uuid": "e77b576d443044066eeeb1e94398a91e25fa28de"}, "author": "Amy Tinmouth", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-apprentices-bucking-trend-13943738", "ord_in_thread": 0, "title": "North East apprentices bucking the trend as more youngsters secure long-term careers", "locations": [], "entities": {"persons": [{"name": "ann watson", "sentiment": "negative"}, {"name": "sophie milliken", "sentiment": "negative"}, {"name": "mcleish", "sentiment": "none"}, {"name": "whittaker", "sentiment": "none"}, {"name": "paul graham", "sentiment": "none"}, {"name": "darren coombs", "sentiment": "none"}, {"name": "luke", "sentiment": "none"}, {"name": "semta", "sentiment": "none"}, {"name": "watson", "sentiment": "none"}, {"name": "steve grant", "sentiment": "none"}, {"name": "hankey", "sentiment": "none"}, {"name": "milliken", "sentiment": "none"}, {"name": "luke bell", "sentiment": "none"}, {"name": "mark lane", "sentiment": "none"}, {"name": "brenda mcleish", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "darren hankey", "sentiment": "none"}, {"name": "seymour", "sentiment": "none"}], "locations": [{"name": "semta", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "semta", "sentiment": "none"}], "organizations": [{"name": "hartlepool college", "sentiment": "none"}, {"name": "northern skills group", "sentiment": "none"}, {"name": "hartlepool college of further education", "sentiment": "none"}, {"name": "industry apprentice council", "sentiment": "none"}, {"name": "seymour engineering", "sentiment": "none"}, {"name": "tte technical training group", "sentiment": "none"}, {"name": "iac", "sentiment": "none"}, {"name": "hartlepool", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "learning curve group", "sentiment": "none"}, {"name": "smart resourcing solutions", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Ann Watson, SEMTA, and right, Sophie Milliken, Smart Resourcing Solutions Share Get business   Thank you for subscribing!   \nMark Lane seeks expert opinion on the issues surrounding apprenticeships in the North East region and uncovers a compelling case for this excellent route into employment from both an employee and employer perspective \nFigures released recently showed a worrying national trend with regards to apprenticeships, with a 61% decline in apprenticeships across the UK. \nMany believe this reduction is partly down to the levy reform, while there are suggestions a stagnating national economy, with uncertainty about Brexit, is making employers reluctant to take on young people. \nRegardless of the reasons, there is at least one area of the North East which is bucking this trend. \nHartlepool College of Further Education has recently reported a rise in apprenticeship starts by 6%, and that figure is still growing. \nWhile delighted, principal Darren Hankey acknowledges the broader challenges facing the apprenticeship landscape. Darren Hankey, Hartlepool College \nHe said: “The recent reforms have brought huge challenges to the industry and will continue to do so as they are rolled out across the country. \n“It appears the industry as a whole has used the uncertainty of the reforms to market their brands, from one-man training providers to entire companies set up overnight to cold call levy-paying companies. \n“Instead of branching out and using the levy as a marketing tool, we chose instead to work directly with our organisations to explain what it means, educate them on what it means to them as a company and how the college could help them solve any future problems. \n“From the onset, we created a working group to bring together each different element of the college, including heads of department for marketing, recruitment, business development, curriculum and apprenticeships. \n“From there, we devised a strategy around the reforms.” \nDiscussing broader apprentice take-up issues in the region, Hankey said: “One in four firms do not consider apprenticeships and around four in five firms don’t take on apprentices at all in the North East. \n“In our experience that’s usually down to perception and a little bit of fear. \n“Many companies look at employees as a cost that needs to be controlled and kept to a minimum, instead of looking employees and in particular apprentices as a long-term asset. \n“To counteract this we must continue to educate, it’s what we do every day with our students, now we need to be doing it with our partnering businesses. \n“Apprenticeships are a brilliant way of ensuring firms can address workforce development needs and ensure they have a skilled workforce for the future.” \nOne area where this need for future-proofing is widely recognised is engineering. As the employer-led skills body for advanced manufacturing and engineering, Semta is an organisation which strongly values apprenticeships. \n“It’s our job to raise the status of apprenticeships in our sector as a key way of employers getting the skills they need,” said Ann Watson, chief executive officer of Semta. \n“We need a million engineers over a decade and we need a million of the current engineering workforce to be digitally upskilled to make the most of the opportunities offered by technological change – apprenticeships are going to be key to doing this.” \nThese are startling figures. But are the numbers there? \nMoreover, is there a concern that some youngsters shy away from apprenticeships? \nWatson said: “The recent Industry Apprentice Council annual report, which Semta supported the production of, showed we still have work to do when it comes to ensuring parents and educational institutions are giving young people the right messages about apprenticeships – only 21% of 1,200 apprentices said they had been encouraged to do their apprenticeships at school. \n“70% said their friends’ and families’ perceptions of apprenticeships had changed for the better since they became apprentices, so it’s clear that the often outdated perceptions many have simply don’t match with the reality. \n“But the reality is that the IAC report also shows that 98% of apprentices are happy with the choice they made, which is a fantastic endorsement for apprenticeships. \n“I would encourage young people to think about how they best enjoy learning new skills – if you like to learn by doing, and if you’d like to be paid to do it, then an apprenticeship could be the best route into work for you.” \nBrenda McLeish agrees perceptions around apprenticeships are often quite different from the reality. \nMcLeish is CEO of the Learning Curve Group, a national company headquartered in County Durham which offers a vast array of fully-funded training programmes, apprenticeship schemes, construction skill centres, pre-uniformed services training and pathways to employment. \n“I think most people still think of an apprenticeship as a training programme for someone who is leaving school and starting out in their career – typically going into a trade,” she said. “And often it is thought of as a lesser alternative to university and something for low achievers. \n“With an apprenticeship, you can achieve the same level qualification, not rack up the student debt and have that all important work skills and experience that employers often seek.” \nWhittaker has seen first-hand the impact of the introduction of the Apprenticeship Levy. \nThat said, she and her colleagues see it as an opportunity for businesses to “really think about training and development for their current and future business needs”. \nShe said: “The apprenticeship levy is a fantastic opportunity for employers to upskill their existing workforce and to bring in new talent. \n“We’ve had a tremendous amount of success so far and are working with some fantastic employers who are very diverse in the range of activities they’re involved in. \n“Some employers already have their own development programmes and the levy is seeing them have to adapt to ensure they get a return. \n“Others have not yet implemented training programmes for their business and so it is supporting the development of these.” \nSophie Milliken is managing director of Newcastle-based Smart Resourcing Solutions, an early-careers consultancy supporting employers, universities and schools. Sophie Milliken, Smart Resourcing Solutions \nAsked about the main benefits of apprenticeships, Milliken said: “With the wide range of apprenticeships available, employers can address any skill shortages they have as well as introduce new talent that they can support and shape to benefit the organisation. \n“Apprenticeships complement other entry routes and can also be used to retrain or upskill existing employees.” \nNotable successes aside – Hartlepool being an obvious example – Milliken thinks the region could be doing more in terms of utilising and promoting apprenticeships. \nShe said: “There needs to be a mindset change for apprenticeships to be seen as a credible option. Careers advice in schools is still biased towards the university route. \n“Improving the knowledge of those providing careers advice in schools would be a welcome development and allow a wider perspective to be shared with students considering their options. \n“Parents will also need to be swayed that an apprenticeship is worth consideration. \n“Once we start to hear the success stories where students have chosen to complete an apprenticeship that has given them a sponsored degree as part of the programme (without the associated debt) and that they have experienced the same opportunity for career progression as the graduate route, then parents will be more positive too.” \nWhile there are undoubtedly some challenges around the issue of apprenticeships right now, the overall message was positive and upbeat. \nPaul Graham of the Northern Skills Group, which has three offices across the North East, spells out a compelling case for employers. \n“Apprenticeships not only increase productivity but also ensure your workforce is highly skilled and ahead of latest developments in the industry,” he said. \nHe also suggested some other benefits to apprenticeships. They can help future-proof a business plug skills gaps, develop existing staff, boost motivation across teams and slash training and recruitment costs. Perhaps most importantly, apprentices bring serious bottom line benefits. \n“On-the-job training means employees gain valuable skills and knowledge directly relevant to your business,” he concluded. \n“They are able to immediately put their knowledge and learning into practice, making a real contribution to improving productivity.” \nCASE STUDY: Seymour Engineering \nDespite the overall drop in apprenticeship starts since the introduction of the apprenticeship levy, this year Seymour Engineering has matched its 2016 intake of three apprentices – while also making key alterations to its apprenticeship programme with provider Hartlepool College of Further Education. \nThese alterations allow the new apprentices to spend three days a week in college and give them more of a balance between education and work-based learning. \nLuke Bell was taken on this year under the new program, alongside fellow student Darren Coombs. \nLuke said: “I first found out about Seymour when they came to speak at my school. \n“Making the effort to connect with me and my classmates was exactly what I needed to make the decision to apply for an apprenticeship, which has turned out to be the perfect decision for me.” \nDarren Coombs, another new starter, said: “The Seymour apprenticeship consists of a mix of time working in a number of different areas within the business. “It’s really reassuring to know through my apprenticeship I have secured a promising future for myself and won’t have that feeling of panic about what I’m going to do when I leave college.” \nBy Steve Grant, managing director of TTE Technical Training Group \nFor the UK economy to remain competitive, it is vital the workforce is armed with the correct skills and competencies. This is not a new argument but one which was somewhat neglected in recent decades, particularly in industry-based sectors where the drive to send students towards academic post-16 learning, impacted on the development of a practical, vocational skilled workforce. \nHowever, in more recent times, apprenticeships and vocational learning have gained more respect, both among young people, but also with businesses understanding that investing in their future workforce, as early as possible, is the key to creating sustainable operations. \nThe government’s commitment to vocational training was made clear by its aim to create three million apprenticeships by 2020 and, of course, by in the introduction of the apprenticeship levy. \nUnfortunately, since its introduction in April of this year, the levy appears to have been the cause of a massive drop off in new apprenticeships, which is quite concerning. \nThere are several reasons why this may be the case. \nAmong them is confusion within companies about how the levy operates, which has caused delays in accessing the funds. \nFor those businesses with wage bills above £3m, which have to contribute to the levy, that aren’t accessing the funds for apprenticeships, they are effectively paying a tax instead. \nIt is essential to get the support from specialist providers, such as TTE, who can help navigate businesses through the levy to get best use of their contribution. \nThe same is true for SME businesses who don’t have to contribute but can use some of the levy pot to fund their apprenticeship programmes. \nAt a time when the country is still experiencing skills shortages it is concerning businesses are missing out on an opportunity to develop the future workforce. Grasping the benefits the levy brings now will have long-term benefits for businesses, employment and the wider economy. Like us on Facebook", "external_links": [], "published": "2017-11-23T20:00:00.000+02:00", "crawled": "2017-11-23T20:42:51.010+02:00", "highlightTitle": ""}