{"organizations": [], "uuid": "f4e9ea665105670ff5b506b9f3c507661f3f682b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.plymouthherald.co.uk/incoming/article814582.ece/ALTERNATES/s1200/Crop-Disease-Detector-app.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "devonlive - frontpage", "url": "http://www.devonlive.com/news/devon-news/philip-wolfgang-nothing-feared-advances-814515", "country": "GB", "title": "Philip Wolfgang: Nothing to be feared from advances in farm technology", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-22T13:39:00.000+02:00", "replies_count": 0, "uuid": "f4e9ea665105670ff5b506b9f3c507661f3f682b"}, "author": "Athwenna Irons", "url": "http://www.devonlive.com/news/devon-news/philip-wolfgang-nothing-feared-advances-814515", "ord_in_thread": 0, "title": "Philip Wolfgang: Nothing to be feared from advances in farm technology", "locations": [], "entities": {"persons": [{"name": "philip wolfgang", "sentiment": "none"}, {"name": "roger", "sentiment": "none"}, {"name": "roger prior", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "richard cobb", "sentiment": "none"}], "locations": [{"name": "exeter", "sentiment": "none"}, {"name": "michelmores", "sentiment": "none"}, {"name": "exebridge", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "chudleigh", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "mason kings", "sentiment": "none"}, {"name": "roger prior of masons kings", "sentiment": "none"}, {"name": "masons kings", "sentiment": "none"}, {"name": "michelmores llp", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "james mason limited", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "11:39, 22 NOV 2017 Sponsored Agriculture is becoming increasingly data-driven, and sensing technology is becoming instrumental to the way farmers grow crops Share   Thank you for subscribing!   \nTechnology is advancing at a very fast pace and it is hard to see what areas of our lives will not be influenced by it in the very near future. \nDriverless cars, delivery drones, computers that can turn off the lights in your house and tell you what to do next and even the world of dating ain't what it used to be! \nFarming is seen by many as a steady, traditional industry, but even in agriculture, technology is developing rapidly. Some may see the advance of technology as something to fear, something which will leave workers out of work or detract from its natural roots, but others think of it as an exciting new world, where the opportunities are boundless and technology can raise standards and increase efficiencies. Agricultural solicitor, Philip Wolfgang \nOne such thinker is Roger Prior of Masons Kings and so I went to meet him at his Chudleigh depot for a chat. \nRoger left the city in 2005 and seized the opportunity to acquire James Mason Limited, agricultural engineers with the assistance of Richard Cobb, one of my partners at Michelmores. Since then, the annual turnover of Masons Kings, with its three depots across the South West, has grown from £6 million to £26 million today. Read More Looming migrant worker crisis as Devon gets ready for EU worker shortage \nMasons Kings is committed to agriculture, selling high end machinery, parts and equipment and providing bespoke support and service to its customers 365 days a year. \nRoger is evidently proud of Masons Kings and was keen to tell me how far his staff would go to ensure that customers were back up and running as quickly as possible in the event of mechanical failure. He recounted the tale of when a tractor replacement gearbox had to be transported over from Germany in the back of a caravan so that it could be delivered to the customer and installed as quickly as possible to ensure that the customer was back up and running. Masons Kings managing director Roger Prior, far right, has helped grow the company's annual turnover from £6 million to £26 million \nAnother example was where the support team had received a call at 5:30pm from a distressed farmer with a failed blower bearing. Many businesses would have held off supporting the customer until the following day but not Masons Kings! The machine was brought straight into the workshop where the team worked until 2am to get the job done and the forager back up and running for use the following morning. \nRoger explained some of the exciting on-farm services that his company can help to deliver through their FarmSight service. This includes yield maps produced by combines, which can inform the farmer where to apply fertilisers and sprays to best effect and the use of GPS driven tractors, ensuring that tractors can be positioned to 2mm accuracy. Read More Philip Wolfgang: Get clued up on farm tenancies and licenses to avoid falling into traps \nHe also talked about how machines on farms across the region are linked up to his service depots via JD Link so that they can monitor their performance using real time machine and field data, often delivering support before the farmer even knows that there is a problem. These systems and advances in technology provide the farming industry with modern solutions to age old problems, driving efficiencies and reducing waste. \nIn a world where we need to produce food in a more environmentally sensitive way whilst keeping the cost to the consumer down, and when the future of agricultural subsidies is uncertain, efficiency is the only way to keep businesses afloat and therefore technology is going to be ever more important in achieving those efficiencies and maximising farm profits. And it is businesses like Masons Kings that can help to support the industry through these uncertain times by introducing and optimising technology. Developing technology, such as precision farming systems, could present boundless opportunities for farmers to raise standards and increase efficiencies \nHowever, it struck me that success not only lies with the technology but also with good old fashioned customer service; something which endures the passing of time and which we can all appreciate. \nRoger’s team is expert at delivering cutting edge support to their customers, whilst equally adept at creating a solution to a problem by taking an old piece of metal and fashioning it into something that works. Read More Roll out of safety training essential to keep next generation of farmers safe, charity urges \nAgriculture may be facing many uncertainties and challenges in this pre-Brexit era, but it is a fantastic and diverse industry with deep routed traditions and culture but which is also at the cutting edge of technology. For those who are brave and open to challenge and change, it offers a bright and exciting future. \nAs I was leaving Roger mentioned the open days at Mason Kings' depots in Chudleigh on November 28 and Exebridge on November 30, where you're invited to go and see them and find out more about their 'Premium Product and Premium Support'. I think I might just go along! \nPhilip Wolfgang, partner at Michelmores LLP, Exeter direct dial 01392 687720 or email Philip.wolfgang@michelmores.com Like us on Facebook", "external_links": [], "published": "2017-11-22T13:39:00.000+02:00", "crawled": "2017-11-22T13:48:04.020+02:00", "highlightTitle": ""}