{"organizations": [], "uuid": "cbd8bc5f673119d7e1de0cd049c9ce5a6d36b00e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13677898.ece/ALTERNATES/s1200/GWR_-NJL_260917hedgehog_01.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-businesses-cash-tech-13886094", "country": "GB", "domain_rank": 21960, "title": "North East businesses cash in on tech sector's record breaking investments", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-10T16:15:00.000+02:00", "replies_count": 0, "uuid": "cbd8bc5f673119d7e1de0cd049c9ce5a6d36b00e"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-businesses-cash-tech-13886094", "ord_in_thread": 0, "title": "North East businesses cash in on tech sector's record breaking investments", "locations": [], "entities": {"persons": [{"name": "michael vassallo", "sentiment": "none"}, {"name": "mark forster", "sentiment": "none"}, {"name": "logincident", "sentiment": "none"}, {"name": "pearce", "sentiment": "none"}, {"name": "sarat pediredla", "sentiment": "none"}, {"name": "graham pearce", "sentiment": "none"}, {"name": "bob paton", "sentiment": "none"}], "locations": [{"name": "county durham", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "silicon valley-based", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "maven capital partners", "sentiment": "none"}, {"name": "cress", "sentiment": "none"}, {"name": "newton aycliffe", "sentiment": "none"}, {"name": "north shields’ broadband satellite services", "sentiment": "none"}, {"name": "ii-vi", "sentiment": "none"}, {"name": "partech ventures", "sentiment": "none"}, {"name": "seventure partners", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "kpmg", "sentiment": "none"}, {"name": "northern powerhouse investment fund", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "North East businesses cash in on tech sector's record breaking investments Over £207m was invested in Northern tech firms during the last three months Share Maven Investment Director Michael Vassallo, hedgehog lab co-founder and Chief Product Officer Mark Forster, hedgehog lab co-founder and CEO Sarat Pediredla, and hedgehog lab Non-Executive Director Bob Paton (Image: unknown) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nA record quarter of investment in Northern tech firms has allowed six North East businesses to receive huge amounts of cash from investors. \nNorthern tech firms received a total of £207.6m in investment during the third quarter of 2017, more than double the £101.5m invested in the sector in Q2. \nSix North East tech firms received investment during the last three months. North Shields’ Broadband Satellite Services received the biggest sum, after raising £2.48m. \nNewcastle mobile app developer hedgehog lab received the second largest investment after raising £1m from private equity house Maven Capital Partners. Read More \nThe funding is being used to support hedgehog lab’s growth strategy, which involves increasing its sales and marketing function, boosting its delivery capabilities, growing its presence overseas, and creating new jobs. \nTech giant Sage also raised a £710,000 through a share sale. \nThe research was compiled by accountancy firm KPMG and showed a growing interest in the region’s tech and digital sectors. Graham Pearce, KPMG’s tech sector lead for the North (Image: Unknown) \nGraham Pearce, KPMG’s tech sector lead for the North, said: “With over £200m of invested funds, this is the most heavily invested quarter since we began our analysis a year ago. \n“Testament to the fact that a rise in northern tech investment is not just down to one or two extraordinary ventures, Q3 has also seen the highest number of transactions of the past 12 months.” \nElsewhere in the North East, energy company Cress gained £400,000 of funding from the Northern Powerhouse Investment Fund. Meanwhile, software firm SSLPost and app developer Logincident received £197,000 and £40,000 respectively, from undisclosed sources. \nThe increased activity in the region suggests that confidence is returning to the sector, after initially faltering after the Brexit vote. Read More \nThree M&A transactions also took place in the North East, with the largest being the takeover of Newton Aycliffe’s Kaiam Lasers. \nThe County Durham facility was purchased for £61.4m by US firm II-VI. \nOverseas businesses are increasingly interested in investing in UK tech firms and many are now looking outside of London, where investment has traditionally been the greatest. \nMr Pearce added: “Overseas investment in UK tech has historically been London centric, but a number of recent investments have seen significant overseas interest, with funds flowing in from tech enterprises and financial investors across the US, Europe and Asia. \n“The size of these investments is not minor; for example, the recent £20.2m PushDoctor fundraise in Manchester saw participation from Silicon Valley-based Partech Ventures and Paris-based Seventure Partners.” Like us on Facebook", "external_links": [], "published": "2017-11-10T16:15:00.000+02:00", "crawled": "2017-11-10T16:38:55.003+02:00", "highlightTitle": ""}