{"organizations": [], "uuid": "434da6e643754873b0de7f35cd16297994412309", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13123064.ece/ALTERNATES/s1200/Bond-Dickinson-managing-partner-Jonathan-Blair-with-Womble-Carlyle-CEO-Betty-Temple.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/womble-bond-dickinson-merger-goes-13839071", "country": "GB", "domain_rank": 21960, "title": "Womble Bond Dickinson merger goes live creating £340m law firm", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-01T02:01:00.000+02:00", "replies_count": 0, "uuid": "434da6e643754873b0de7f35cd16297994412309"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/womble-bond-dickinson-merger-goes-13839071", "ord_in_thread": 0, "title": "Womble Bond Dickinson merger goes live creating £340m law firm", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Womble Bond Dickinson merger goes live creating £340m law firm Newcastle firm Bond Dickinson has merged with US business Womble Carlyle Sandridge & Rice Share Bond Dickinson managing partner Jonathan Blair with Womble Carlyle CEO Betty Temple (Image: Unknown) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nNewcastle law firm Bond Dickinson’s merger with US firm Womble Carlyle Sandridge & Rice has officially gone live in a move that has created one of the world’s top 100 biggest law firm’s. \nWomble Bond Dickinson, as the business is now known, has an annual turnover of £340m ($410m), and more than 1,000 lawyers working out of 24 offices across the UK and US. \nThe transatlantic merger was originally announced in June, a year after the two firms revealed they had struck a strategic alliance to promote collaboration between the businesses. \nThe merger has allowed Bond Dickinson to increase its overseas reach in a number of regions with similar economies to the North East of England, such as the Carolinas, which have a strong history of manufacturing. Read More Road safety firm that helps set up the Great North Run creates 30 jobs \nAccording to Newcastle-based partner Peter Snaith, the deal has already helped the law firm attract new clients and work. \nMr Snaith, who is also head of manufacturing , said: “The number of opportunities in terms of invitation to tender that have came across our desk from US businesses has gone up, and we have only just scratched the service at the moment. \n“That is reflected in the opportunities that have come our way. But what we are doing is identifying businesses where we know they have a presence in the North East and a presence in the US and going out to them to talk to them about what we can do for them, and support them on both sides.” \nNewcastle office head Kevin Robertson said that the merger also provided the opportunity to promote the North East as a region to do business. \nHe said: “Another aspect of this is, in my role as head of office, is to promote this region to the US and businesses we come in contact with. When groups and partners come here we will talk to them about the history of the region, and what we as a business grew up doing. \n“It’s interesting talking to them, as Womble as a business have very much grown in their regions too. They are not a business that have said we need to be in New York and LA, they are very much in their heartlands, where they have grown their business out of.” \nThe transatlantic merger has coincided with the publication of Bond Dickinson’s last full year accounts as a standalone business. \nTurnover at the firm fell marginally, from £103.5 in 2016 to £103.5m for the year ending April 30. Net profit at the firm also fell by 8.4%, from £29m to £26.6m. Read More Bond Dickinson reports flat turnover in final results before US merger \nCommenting on the financial results, managing partner Jonathan Blair said the results were impacted by a fall in M&amp;A work caused by Brexit. \nMr Blair said: “The firm’s performance in the last financial year was stable despite a dip in M&amp;A activity for several months due to Brexit. \n“It was a good year for a number of different business groups, particularly private wealth which saw a very strong performance. Real estate also performed well. Our corporate and commercial team experienced a dip but activity for that team came back strongly. \n“The focus for the firm for the FY 2016/17 was investing in the business. This included planning for the combination with our US alliance partner Womble Carlyle, a new Edinburgh office that opened earlier this year, our recalibrated client programme and our new CRM system OnePlace.” \nHe added that the firm had a “strong pipeline for growth” after it won a number of major panel appointments over the last year. These include acting for the Crown Commercial Services national panel, AIG, Crown Estate and Lloyds Banking Group. Like us on Facebook ", "external_links": [], "published": "2017-11-01T02:01:00.000+02:00", "crawled": "2017-11-01T02:29:11.008+02:00", "highlightTitle": ""}