{"organizations": [], "uuid": "da173e3226014dd8ac2db962f5df788444e3cb77", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.birminghammail.co.uk/incoming/article13881139.ece/ALTERNATES/s1200/penny1.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/who-penny-mordaunt-former-magicians-13882137", "country": "GB", "domain_rank": 21960, "title": "Who is Penny Mordaunt? The former magician's assistant turned Cabinet Minister", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-09T19:30:00.000+02:00", "replies_count": 0, "uuid": "da173e3226014dd8ac2db962f5df788444e3cb77"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/who-penny-mordaunt-former-magicians-13882137", "ord_in_thread": 0, "title": "Who is Penny Mordaunt? The former magician's assistant turned Cabinet Minister", "locations": [], "entities": {"persons": [{"name": "penny mordaunt", "sentiment": "negative"}, {"name": "keith duffy", "sentiment": "none"}, {"name": "priti patel", "sentiment": "none"}, {"name": "william hague", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "danielle lloyd", "sentiment": "none"}, {"name": "mordaunt", "sentiment": "none"}, {"name": "una foden", "sentiment": "none"}, {"name": "john major", "sentiment": "none"}, {"name": "david willetts", "sentiment": "none"}, {"name": "andrea leadsom", "sentiment": "none"}, {"name": "george w. bush", "sentiment": "none"}, {"name": "anne-marie trevelyan", "sentiment": "none"}], "locations": [{"name": "romania", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "boyzone", "sentiment": "none"}], "organizations": [{"name": "cabinet", "sentiment": "negative"}, {"name": "invalid email", "sentiment": "none"}, {"name": "navy", "sentiment": "none"}, {"name": "tory", "sentiment": "none"}, {"name": "armed services", "sentiment": "none"}, {"name": "diabetes uk", "sentiment": "none"}, {"name": "national lottery", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "royal navy", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Who is Penny Mordaunt? The former magician's assistant turned Cabinet Minister Penny Mordaunt has been appointed International Development Secretary following the resignation of Priti Patel Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe announcement that Penny Mordaunt has become the new International Development Minister has been welcomed by a North East MP. \nMs Mordaunt takes responsibility for the UK’s £12 billion aid budget following the resignation of her predecessor, Priti Patel. \nThe appointment was welcomed by Berwick-upon-Tweed MP Anne-Marie Trevelyan, who said on Twitter it was “great news”, adding that Theresa May had made a “great choice”. \nMs Mordaunt used to be the minister for disabled people in the Department for Work and Pensions. Before that, she was an armed forces minister. \nBut she’s perhaps best known for appearing on national telly in her swimsuit. \nShe did not support Theresa May in the 2016 Tory leadership contest, opting for rival Andrea Leadsom instead. \nAnd she’s a big supporter of Brexit . \nMs Mordaunt, aged 44 and a Royal Navy reservist, hit headlines when she appeared on national telly in her swimsuit for ITV diving competition Splash in 2014 to raise money for charity. \nThe MP, who was elected in 2010, defended her decision to take part in the TV contest alongside Boyzone singer Keith Duffy, model Danielle Lloyd and The Saturdays singer Una Foden, and insisted that she did not want to be famous. \n“There have been suggestions that I shouldn’t be appearing in a swimsuit. I don’t know whether people had visions that I’d be jumping off the boards with strategically placed rosettes,” she said. Read More \nOf her £10,000 appearance fee, £7,000 went towards the renovation of her local lido. \nThe rest was given to four Armed Services charities. \nShe caused controversy in 2014 when she admitted she had peppered a parliamentary speech with double entendres for a dare. \nShe said “cock” five times and “lay” or “laid” six times as well as mentioning the names of many of her Navy pals. \nThe Portsmouth North MP went to her local comprehensive and was the first person in her family to go to university. \nAfter school she worked in a factory and as a magician’s assistant to save up before university. Read More The six reasons why Theresa May's Conservative government is a disaster \nMs Mordaunt has said she gained an interest in politics after working in hospitals and orphanages Romania, for the year before and during university. \nShe was director of communications for the National Lottery, head of campaigns for Diabetes UK, head of foreign Press for George W. Bush’s 2000 and 2004 presidential election campaigns and chief of staff for former MP David Willetts. \nShe was also “head of youth” under former Conservative leader John Major, and former Tory leader William Hague’s head of broadcasting. Like us on Facebook", "external_links": [], "published": "2017-11-09T19:30:00.000+02:00", "crawled": "2017-11-10T00:39:14.003+02:00", "highlightTitle": ""}