{"organizations": [], "uuid": "3a480dfc7610d41a9c3e2df20ae8d72fca0f0de3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13898397.ece/ALTERNATES/s1200/GWR_NJL_131117japan_01.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/japanese-ambassador-warns-brexit-uncertainty-13898305", "country": "GB", "domain_rank": 21960, "title": "Japanese ambassador warns that Brexit uncertainty could see companies invest elsewhere", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-13T20:58:00.000+02:00", "replies_count": 0, "uuid": "3a480dfc7610d41a9c3e2df20ae8d72fca0f0de3"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/japanese-ambassador-warns-brexit-uncertainty-13898305", "ord_in_thread": 0, "title": "Japanese ambassador warns that Brexit uncertainty could see companies invest elsewhere", "locations": [], "entities": {"persons": [{"name": "kōji tsuruoka", "sentiment": "negative"}, {"name": "kasim reed", "sentiment": "none"}, {"name": "josh hardie", "sentiment": "none"}, {"name": "prof bailey", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "david bailey", "sentiment": "none"}, {"name": "nick forbes", "sentiment": "none"}, {"name": "thatcher", "sentiment": "none"}, {"name": "sage", "sentiment": "none"}, {"name": "alan laing", "sentiment": "none"}, {"name": "tsuruoka", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "atlanta", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "newcastle city council", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "cbi", "sentiment": "none"}, {"name": "hitachi", "sentiment": "none"}, {"name": "continental europe", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}, {"name": "commons business committee", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Japanese ambassador warns that Brexit uncertainty could see companies invest elsewhere Kōji Tsuruoka was speaking at a CBI conference on global growth in Newcastle Share Japanese ambassador Kōji Tsuruoka (Image: CBI) Share Get business updates   \nJapan’s most senior diplomat in the UK has told a conference in the North East that progress on Brexit talks is crucial if companies from his country are to continue to invest in the UK. \nSpeaking at the CBI’s Global Growth conference in Newcastle , Japanese ambassador Kōji Tsuruoka said that lack of certainty around the UK’s future trading position would deter Japanese firms from investing further in regions like the North East. \nHighlighting major North East employers like Nissan and Hitachi, Mr Tsuruoka said more than 160,000 jobs in the UK were directly supported by Japanese companies with thousands more in supply chains \nBut he said that Japanese companies had “other options” if the British Government could not provide them with the certainty businesses need for future planning. \nMr Tsuruoka said that, thanks to the efforts of the Thatcher government in the 1980s, the UK currently has around half of all Japanese investment into the EU. \nBut he warned that there could be “early departures and damaging outcomes” if the current chaos around Brexit continued. \nMr Tsuruoka’s warning came as European business leaders met with Prime Minister Theresa May to say that progress is urgently needed in Brexit talks if UK jobs and investment are not be lost. \nHe said: “Unfortunately, Brexit today does not provide any of us with predictability or clarity on what you can expect. \n“This is quite damaging. The 1,000 Japanese companies operating in the UK are seeking to have indications, direction and perspective on what they can expect when Brexit happens because we all know it’s not going to be the same. \n“We know there will be changes. That doesn’t mean you just shut the door and leave. In the case of Nissan in Sunderland, they employ 7,000 people in their factory and you don’t just send them home because of what happens in Brexit. \n“Japanese companies enjoy working here and they want to continue to do this. Therefore they’re seeking to find out how they will be able to continue their operation, how they they can continue to survive. \n“Survivability of a company depends on profitability. You don’t have to profit each and every year but a perspective for the mid to long-term that convinces them to continue is a minimum requirement. \n“You will all know that many of these companies have other options. \n“Out of the 28 EU countries, 50% of Japanese investment is in the UK. That was a decision by choice and it was a decision reached through very effective persuasion by the British Government. \n“This has benefited both of our countries greatly but we should also remember that there are other choices elsewhere in the world. The investors will look into diverging if that is necessary for them to survive because that is the way business is done. \n“In order to avoid any early departures and damaging outcomes for the UK, the minimum that needs to be presented is some comfort based on predictability.” \nMr Tsuruoka’s come just after a day after autmotive expert Professor David Bailey warned that major car manufacturers could shift production of new models to factories in Continental Europe because of the uncertainty surrounding Brexit. \nProf Bailey is among people who will give evidence to the Commons Business Committee today on how Brexit could affect the car industry. \nMr Tsuruoka was speaking at a conference on global growth in Newcastle organised by the business group CBI. \nThe event heard from a range of speakers, including Atlanta mayor Kasim Reed, Sage’s managing director for the UK Alan Laing, Newcastle City Council leader Nick Forbes and CBI deputy director-general Josh Hardie. Like us on Facebook", "external_links": [], "published": "2017-11-13T20:58:00.000+02:00", "crawled": "2017-11-13T21:55:43.000+02:00", "highlightTitle": ""}