{"organizations": [], "uuid": "bf45480eca42a48b0d04b34fa219c8ba02b55c47", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article361746.ece/ALTERNATES/s1200/Anne-Marie-Morris-MPppPNG.png", "site_section": "http://www.middevongazette.co.uk/politics.rss", "section_title": "devonlive - News", "url": "http://www.devonlive.com/news/devon-news/rumours-anne-marie-morris-having-713059", "country": "GB", "title": "Rumours of Anne Marie Morris having Tory Whip restored quashed by her office", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-01T15:57:00.000+02:00", "replies_count": 0, "uuid": "bf45480eca42a48b0d04b34fa219c8ba02b55c47"}, "author": "Daniel Clark", "url": "http://www.devonlive.com/news/devon-news/rumours-anne-marie-morris-having-713059", "ord_in_thread": 0, "title": "Rumours of Anne Marie Morris having Tory Whip restored quashed by her office", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "News Rumours of Anne Marie Morris having Tory Whip restored quashed by her office The Newton Abbot MP's office say that have not been told any information from the whips office on her suspension Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nAnne Marie Morris’ office have denied rumours that the Newton Abbot MP is about to have to Conservative Party Whip restored to her. \nMs Morris, who has been the MP for Newton Abbot since 2010, described the UK leaving the EU without a deal as a “real n r in the woodpile” at the launch of a report into the future for the UK’s financial sector after Brexit. \nShe apologised for the remarks, saying: “The comment was unintentional and I apologise unreservedly for any offence caused.” \nBut she has had the whip suspended by her party, which means that although she is still an MP, she is no longer a Conservative MP. \nMartyn Oates, the Political Editor at BBC South West, on Wednesday afternoon took to Twitter to say that good Westminster sources say that Anne Marie Morris is likely to have the Tory whip restored soon. \nHe added that one source said it would be within the next month. Anne Marie Morris MP \nBut, a spokesman in Anne Marie Morris’ office told DevonLive.com: “We have had no further information from the whips office on Anne Marie’s suspension.” Read More Boundary Commission changes - what it means for Devon's residents \nIt follows on from Prime Minister Theresa May refused to answer the question as to whether Ms Morris would be allowed made into the Conservative Party in the future when she was asked explicitly by ITV’s Political Correspondent David Wood at her party's annual conference in Manchester. \nShe said: “You know why we took the decision that we did and she is suspended, and obviously from time to time we will look at the situation. Read More PM Theresa May refuses to say if Anne Marie Morris can return to the Conservative Party \n“We have suspended her because what she said was wrong and it was inappropriate for her to say what she said. \n“I was concerned when I heard about the remarks which is why I took the action I did.” \nBut when asked whether as an elected official she could return to the Conservative Party after using the language that she did, the Prime Minister reiterated that the Newton Abbot MP is 'suspended'. Anne Marie Morris MP \nNewton Abbot Conservatives have backed Ms Morris and said that although her remarks were inappropriate, they won’t be calling for her resignation, although Cllr John Hart, the Conservative leader of Devon County Council did say that she needed to ‘consider her position’ as a result of her comments. Read More \nAnne Marie Morris' office had said: \"The suspension remains in place. The length of the suspension remains a matter for the party. As the situation has not changed we have got no further comment at this time.\" Like us on Facebook", "external_links": [], "published": "2017-11-01T15:57:00.000+02:00", "crawled": "2017-11-01T16:20:02.013+02:00", "highlightTitle": ""}