{"organizations": [], "uuid": "1b77a9feeb3dc3fe817db3dd895d07a966655830", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article12866728.ece/ALTERNATES/s1200/Talk-Talk-cyber-attack.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13903804", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: TalkTalk swings into loss after drive to secure customers", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-15T10:30:00.000+02:00", "replies_count": 0, "uuid": "1b77a9feeb3dc3fe817db3dd895d07a966655830"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13903804", "ord_in_thread": 0, "title": "Business Breakfast LIVE: TalkTalk swings into loss after drive to secure customers", "locations": [], "entities": {"persons": [{"name": "harrison", "sentiment": "none"}], "locations": [], "organizations": [{"name": "talktalk", "sentiment": "negative"}, {"name": "ebitda", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Carillion joint venture signs £240m deal in Oman \nCarillion has signed a £250m deal to build a new hospital in Oman. \nThe deal is was reached between Carillion Alawi - Cariliion’s 50:50 Joint Venture with the Zawawi family - and the Oman Ministry of health. \nIt will see the joint venture design and build the New Sultan Qaboos Hospital in Salalah. \nIn a trading update Carillion said: \nThe contract will consist of a two stage design and build process. The initial design and mobilisation phase, which will be directly funded by the customer, will commence immediately. \nThe second phase would commence in 2018 once the design has been completed, the contract executed and funding finalised. \nCarillion Alawi is also set to receive a further contract to build a similar hospital in Khasab. If this is approved the deal will be worth around £120m. 9:23 Jonathon Manning Strong global sales help Premier Foods trim losses \nAmbrosia custard and Bisto gravy maker Premier Foods has narrowed its losses after securing a hefty jump in sales from its international business.The group has served up a half-year pre-tax loss of £1.2m for the six months ending in September, a significant drop from the £8.7m loss recorded for the same period last year.Revenues also picked up by 1.5% to £353.3m, driven by a strong second quarter and a 23% jump in sales from its international operation.Global growth came from strong demand for Mr Kipling and Cadbury in Australia, with the group eyeing a boost from a further expansion of Asian food brand Sharwood’s across the United States.The group said it was on track to hit its annual financial targets for the year, and had seen net debt fall 4% to £535.3m.Shares in the firm were up more than 6% in early morning trading on the London Stock Exchange, as investors cheered a brighter performance from the firm.Chief executive Gavin Darby said: \nWe are pleased to report a return to revenue growth of 1.5% in the first half of the year. \nA key highlight was our strong performance in the second quarter, with volume driven revenue up 6.2% after a challenging first quarter. \nThe cost efficiency programme we launched earlier this year is on track to deliver the expected benefits. \nWe completed the issue of a new £210m high yield bond in June and our Net debt was£21m lower than the same point last year; a little ahead of our plans. Premier Foods Jonathon Manning Northumberland's Tharsus prepares for next stage of growth after joining Stock Exchange programme \nNorthumberland robotics company Tharsus is gearing up for its next phase of growth after being accepted into the London Stock Exchange’s Elite programme . \nTharsus is the first robotics firm to be included in the Elite programme, which is designed to support international businesses, provide advice, and help companies raise capital. \nThe North East firm was accepted into the network to help represent the growing robotics industry. It joins a network of over 750 international businesses, include more than 100 that are based in the UK. \nEach member business is considered an expert in its field and are able to offer specialist advice about their respective sectors. \nTharsus is best known for manufacturing robots that are used to pick groceries within a warehouse for online retailer Ocado. The two firms have worked together since 2013 and Ocado recently revealed it would be introducing Tharsus robots at more of its UK sites. \nTharsus’ membership to Elite, along with its extended partnership with Ocado, is set to kick off the next phase of the firm’s growth strategy. \nCEO Brian Palmer said: \nWe are extremely proud to be part of the London Stock Exchange’s Elite UK programme. Tharsus has experienced monumental growth in recent years and we’re looking forward to driving that forward with Elite. \nI think that this scheme, with access to the advisory support and leading capital markets network, will be instrumental to our continued growth and success. Brian Palmer with a robot specially designed for Ocado (Image: Unknown) 9:14 Jonathon Manning Newcastle's Venturefest attracts record crowds to celebrate North East innovation \nAn annual celebration of innovation in the North East has attracted hundreds of business leaders from around the region. \nThe fifth annual VentureFest North East took place at St James’ Park in Newcastle with around 700 delegates being told that innovation is vital for businesses to survive in the modern global economy. \nThe necessity to remain relevant, profitable and competitive in a global economy was the common theme connecting speeches, workshops and panel discussions at the event. \nAmong those speaking was Professor Alan Lowdon, chair of the innovation board at the North East LEP , who said: \nThe North East of England has a history of adapting to change and it’s more important than ever that our businesses stay ahead of the curve in today’s globally competitive environment. \nThe region’s unique power of community gives us real competitive advantage. \nToday has been a demonstration of our willingness to work together and a joined-up support system that doesn’t exist anywhere else in the UK. By coming together at events like VentureFest the region’s businesses have a fertile test bed for new ideas and exciting new ways to collaborate with others across sectors. \nThe full-day conference included a series of ‘live’ innovation challenge sessions that gave businesses the chance to win work from organisations that are seeking input into real projects. Venturefest North East at St James' Park, Newcastle (Image: Copyright unknown) 9:05 Jonathon Manning Barratt and Crest Nicholson cast aside property market fears \nHousebuilders Barratt Developments and Crest Nicholson have become the latest firms to shrug off property market fears as they insisted buyer demand remains strong.The building giants said the “wide availability” of mortgage finance was helping support the new-build market, despite Brexit uncertainty and the squeeze on household finances.Their cheery updates follow an upbeat outlook on trading from rival Bovis on Tuesday as the latest clutch of updates from the sector appear to cast aside recent gloom in the housing market.Shares in the sector were sent lower last week after Persimmon andRedrow sparked fears of a slowdown, following a survey from the Royal Institution of Chartered Surveyors showing house sale levels were flat or falling across large swathes of the UK.Barratt - the UK’s largest housebuilder - said it had seen a “strong start” to its financial year, having held its sales rate firm at 0.74 reservations per development per week, or 268 reservations on average a week, with forward sales up 8.4% at £2.9bn.It said: \nMarket conditions remain good, and the group has delivered a strong performance since the start of the financial year, with customer demand for new homes supported by wide availability of attractive mortgage finance. \nBoss David Thomas said the group remains “confident in delivering a good performance” over the full year, although it expects “modest” growth in wholly-owned completions.In its full-year trading update, Crest said the housing market was “generally” robust, although it added that central London was seeing sales slow and prices weaken.But its figures showed a solid performance for the year to October 31, which has continued so far since then, with forward sales for completions up 14.8% at £265.3m. Barratt Homes City Edge development in Blakelaw (Image: Newcastle Chronicle) 9:00 KEY EVENT Utilitywise pushes back results announcement \nNorth Tyneside utility consultancy firm Utilitywise has pushed back the release of its annual results after being asked to bring in an additional accountancy firm to review its practices. \nEarlier this year Utilitywise - which arranges discounts for individual companies in return for taking their contracts to one energy supplier - \nwas forced to repay £7.6m to an energy supplier, after its contracts overestimated the amount of energy being used. \nThe problem related to contracts put in place before August 2016, and the consultancy firm has since overhauled its methodology for estimating future energy usage. \nBut now the firm’s external auditor, BDO, has asked Utilitywise to bring in extra accountants to look over the firm’s calculations for its estimates. \nIn a statement to the shareholders, Utilitywise said: \nAs part of its audit procedures, the Group’s external auditor, BDO LLP, has now requested that the Group obtains additional advice from an independent accounting firm in respect of the Group’s estimation methodology for expected consumption levels on live contracts. \nAs a result of this request, the Board has now appointed a third-party accounting firm to carry out that additional review. It is anticipated that the additional review will conclude in early December 2017. \nThe firm said it would issue a further trading update once a release date had been agreed for its full-year results. Utilitywise CEO, Brendan Flattery Jonathon Manning New £2m warehouse will create 25 new jobs in County Durham \nA logistics firm in County Durham is investing £2m to develop a new distribution centre and create around 25 jobs. \nStiller Warehousing and Distribution is creating the new 50,000sq ft facility at its 22-acre site on Aycliffe Business Park. \nThe palletised distribution centre will be the largest of its type in the North East and will allow Stiller to load 30 vehicles at any one time. \nStiller plans to create 25 jobs following the site’s opening, which will take the firm’s headcount to 190. It follows on from the Newton Aycliffe firm’s recent recruitment drive, which saw it hire 26 members of staff this year. \nManaging director Matthew Stiller said: \nMoving the distribution side of the business to its new home is primarily to enable us to better cope with the rate of growth we’re currently experiencing. \nIt will also mean we’ll no longer have trucks running through one of our larger warehouses, but it will also give us the opportunity to develop what is now being used as a distribution centre into extra warehousing space, while upgrading it to a higher standard. \nWe’re looking to improve our storage facilities and bring them all up to the standard of the new warehouses we’ve invested in over the last few years. (L-R) Wharton Construction site manager Andrew Honeyman, Stiller's fleet and facilities manager Herbie Blaser, pallet distribution manager Michael Garnett, and estimator Stewart Crinson (Image: Unknown) 8:50 Jonathon Manning GoCompare rejects takeover bid that 'undervalues' price comparison group \nGoCompare has confirmed that it “unanimously and unequivocally” rejected an unsolicited takeover offer by ZPG, the company behind sites including uSwitch and Zoopla, earlier this month.The price comparison group said the potential deal “fundamentally undervalues GoCompare and does not reflect the strong growth prospects of the company”.It marks the latest unsolicited approach by ZPG this year, according to GoCompare, which said that it received an initial offer that valued the company at 110p per share back in May.That proposal was also rejected by GoCompare’s board on grounds that it “undervalued the business and its prospects”.GoCompare said that the most recent proposal by ZPG offered 110p per share in a combination of cash and shares.This represented a 16% premium to GoCompare’s closing share price of 95p on November 7, and a 3% premium to the three-month volume weighted average share price as of that date, which was one day before the proposal was received.But GoCompare said it also represented a discount to its closing share price of 110.5p on October 11, which was less than one month before ZPG put forward its proposal.GoCompare said that it has made “significant progress” in the year since its separation from esure Group, and that the board is “confident” in GoCompare’s full-year prospects.Chairman Sir Peter Wood said: \nThe board and I are extremely pleased with the transformation of the business that the management team has delivered since the demerger. \nThe continuing evolution into an entrepreneurial, innovation-focused technology company which we expect will create significant value for shareholders over the medium term by saving people everywhere time and money. \nZPG’s proposal is highly opportunistic and fundamentally undervalues the company and its prospects. Welsh Tenor Wynne Evans who is the face of price comparison website Gocompare.com 8:45", "external_links": [], "published": "2017-11-15T10:30:00.000+02:00", "crawled": "2017-11-15T10:50:15.003+02:00", "highlightTitle": ""}