{"organizations": [], "uuid": "590708551f796814f8b99bc095f139a9e9ef5c52", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article12008248.ece/ALTERNATES/s1200/JS41234350.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/local-news/north-east-news-live-latest-13900963", "country": "GB", "domain_rank": 21960, "title": "North East news LIVE: Latest breaking news, sport, weather, traffic and travel", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-15T08:30:00.000+02:00", "replies_count": 0, "uuid": "590708551f796814f8b99bc095f139a9e9ef5c52"}, "author": "Tom Eden", "url": "http://www.chroniclelive.co.uk/news/local-news/north-east-news-live-latest-13900963", "ord_in_thread": 0, "title": "North East news LIVE: Latest breaking news, sport, weather, traffic and travel", "locations": [], "entities": {"persons": [{"name": "tom eden", "sentiment": "negative"}, {"name": "johnson", "sentiment": "none"}, {"name": "cork", "sentiment": "none"}, {"name": "nazanin zaghari-ratcliffe", "sentiment": "none"}, {"name": "neighbour len power", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "mrs zaghari-ratcliffe", "sentiment": "none"}, {"name": "ratcliffe", "sentiment": "none"}, {"name": "nazanin zaghari-ratcliffe  bungling boris johnson", "sentiment": "none"}, {"name": "tom eden man", "sentiment": "none"}, {"name": "tom eden johnson", "sentiment": "none"}, {"name": "turnbull", "sentiment": "none"}, {"name": "george osborne", "sentiment": "none"}, {"name": "wayne", "sentiment": "none"}, {"name": "martha johnson", "sentiment": "none"}, {"name": "richard ratcliffe", "sentiment": "none"}, {"name": "wayne clarke", "sentiment": "none"}, {"name": "ted salmon", "sentiment": "none"}, {"name": "malcolm turnbull", "sentiment": "none"}], "locations": [{"name": "gateshead", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "redheugh bridge", "sentiment": "none"}, {"name": "kenton", "sentiment": "none"}, {"name": "thinford", "sentiment": "none"}, {"name": "south shields", "sentiment": "none"}, {"name": "new south wales", "sentiment": "none"}, {"name": "liverpool", "sentiment": "none"}, {"name": "darlington road", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "victoria", "sentiment": "none"}, {"name": "tenerife", "sentiment": "none"}, {"name": "iran", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "northern", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "marsden road", "sentiment": "none"}, {"name": "canberra", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "tyneside", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "newcastle airport", "sentiment": "none"}, {"name": "parliament of australia", "sentiment": "none"}, {"name": "fsb north east", "sentiment": "none"}, {"name": "newcastle central", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "neville’s cross bank", "sentiment": "none"}, {"name": "newcastle journal", "sentiment": "none"}, {"name": "durham  traffic", "sentiment": "none"}, {"name": "south tyneside council", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "federation of small businesses", "sentiment": "none"}, {"name": "fsb", "sentiment": "none"}, {"name": "bulmer drive", "sentiment": "none"}, {"name": "northern powerhouse", "sentiment": "none"}, {"name": "australian capital territory", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Tom Eden Congestion near the Redheugh Bridge \nIt’s still foggy in Newcastle and Gateshead and motorists — quite understandably — seem to be travelling slower than usual: Newcastle Airport Tom Eden Man dies on Jet2 flight \nPassengers have described their horror as an elderly man died in mid-air on a Jet2 flight from Tenerife to Newcastle. \nThe holidaymakers were returning to Tyneside on Sunday night when the 81-year-old passed away en route causing the plane to be diverted to Cork in Ireland. \nWitnesses reported seeing a medical team try to resuscitate the passenger in his aeroplane seat as his horrified wife looked on. \nWayne Clarke, 47, from Kenton, was sitting towards the middle of the plane as the tragedy unfolded. \nWayne said the flight was about an hour away from Newcastle when the man’s condition deteriorated and medics tried to resuscitate him. \nHe said: \n“From what people were saying this man must have taken ill in Tenerife because he had medical staff on the plane with him. \n“He was sat at the front with them and his wife.” \n“He was in his seat and I could see them working on him, doing chest compressions. \n“The staff told us the plane would have to be diverted because of a medical emergency. \n“I was absolutely devastated. I wasn’t bothered about the delay but my heart went out to the poor woman who had lost her husband. What a way for it to happen.” Politics Tom Eden Johnson to meet husband of jailed Nazanin Zaghari-Ratcliffe \nBungling Boris Johnson will meet the husband of jailed British mother Nazanin Zaghari-Ratcliffe to discuss the possibility of her being offered “diplomatic protection” as part of efforts to secure her return from Iran. (Image: Getty Images Europe) \nRichard Ratcliffe believes a change in the status of his wife’s case would allow ministers to act “much more stridently” to support her. \nThe Foreign Secretary has apologised for the “distress” and “suffering” that he caused by his claim that Mrs Zaghari-Ratcliffe was training journalists in Iran, which has exposed her to the threat of her five-year jail sentence being doubled. \nMr Ratcliffe is expected to raise the continued coverage of Mr Johnson’s comments in the Iranian media and will seek to clarify the position on any new charges she faces. \nMr Johnson’s comments had led to calls for him to quit, but Mr Ratcliffe has said it is not in his wife’s interests for there to be any resignations, and instead the Foreign Secretary should clean up the mess he had created. \nThe Foreign Secretary told MPs on Monday there were “overwhelming” humanitarian grounds for her release and stressed that she was in Iran on holiday despite farcical scenes last week where he incorrectly said she was training journalists. 08:21 Heavy traffic in Durham \nTraffic in Durham city centre is heavy this morning: Slow traffic on the A690 Neville’s Cross Bank northbound at A167 Darlington Road, on the approach to the roundabout. Congestion on the A167 in both directions at the A688 — traffic is queuing on all approaches to Thinford roundabout. South shields KEY EVENT Temporary crossing introduced after pensioner's death \nA temporary crossing has been installed at an accident blackspot following the death of a pensioner. \nPedestrian Martha Johnson, 88, was killed after being in collision with a car on Marsden Road in South Shields on August 30. A police investigation into the incident remains ongoing. \nTemporary barriers have now been put in place to narrow the road along with traffic signals, while a bus stop has been relocated to accommodate the crossing. \nThe move has come as South Tyneside Council considers potential measures to improve safety on the stretch of road. \nTraffic and pedestrian surveys have been carried out and the data is now being collated and analysed. A number of permanent options will be suggested and then consulted on. \nNeighbour Len Power is pleased to see the crossing introduced but feels it is not in the best position on Marsden Road. \nHe said: \n“I know the older people are using it, but I think the vast majority are still coming down the lane (Bulmer Drive) instead and crossing the road. \n“School children are also coming up Harton Rise and turning right before crossing the road unaided.” International Australia votes in favour of same-sex marriage \nAustralia has voted in favour of legalising same-sex marriage by 61.6% to 38.4%. \nThe results of the non-binding survey were met with celebrations from Yes campaign events across the country - as Prime Minister Malcolm Turnbull said it was time for Parliament to act on the wishes of the nation. \nAcross all six states in Australia, the yes vote won - ranging from 64.9% in Victoria to 57.8% in New South Wales - while both the Northern Territory (60.6%) and Australian Capital Territory (74%) voted in favour of the proposal. \nSpeaking in Canberra, Mr Turnbull said: \n“Australians have voted yes for fairness, they have voted yes for commitment, they have voted yes for love. \n“Now it’s up to us here in the Parliament of Australia to get on with it, to get on with the job the people have asked us to do and get it done this year, before Christmas. \n“That must be our commitment. \n“I know that many people - a minority obviously - voted no. \n“But we are a fair nation - there’s nothing more Australian than a fair go, than equality, than mutual respect.” \nWith a turnout of 79.5%, the vote had a bigger turnout than the Brexit referendum and US presidential election. 07:46 Tom Eden More train problems \nThere are a smattering of delays to trains due to leave Newcastle Central, with one to Liverpool also cancelled: Business KEY EVENT 'Northern Powerhouse close to failing' \nFrustration has broken out in the business community over the lack of Government action on the Northern Powerhouse . (Image: Newcastle Journal) \nSmall businesses in the North East are calling for increased infrastructure investment, more effective integration of public bodies and the creation of a Council of the North in a new report urging accelerated delivery of the Northern Powerhouse. \nThe call from members of the Federation of Small Businesses (FSB) follows anger over the downgrading of a major Northern rail project in the summer and comes as one of the architects of the Northern Powerhouse urged Prime Minister Theresa May to show proper commitment to the project. \nFSB North East chairman Ted Salmon said it was “hard to find concrete manifestations” of the Northern Powerhouse three years from it being launched by then Chancellor George Osborne . \nAnd he said the Government needed to urgently commit to replacing the EU funding that had done so much to help businesses in the North East create jobs in recent years or the Northern Powerhouse would not exist. 07:34", "external_links": [], "published": "2017-11-15T08:30:00.000+02:00", "crawled": "2017-11-15T11:30:58.001+02:00", "highlightTitle": ""}