{"organizations": [], "uuid": "c0136dbc8bc7ff3818e67c493ffa9ba88834909f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13976644.ece/ALTERNATES/s1200/Sherry-Coutu-CBE.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/new-scholarship-launched-help-young-13976341", "country": "GB", "domain_rank": 21960, "title": "New scholarship launched to help young women kick-start their careers", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-30T16:02:00.000+02:00", "replies_count": 0, "uuid": "c0136dbc8bc7ff3818e67c493ffa9ba88834909f"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/new-scholarship-launched-help-young-13976341", "ord_in_thread": 0, "title": "New scholarship launched to help young women kick-start their careers", "locations": [], "entities": {"persons": [{"name": "sherry coutu", "sentiment": "negative"}, {"name": "vicki hearn", "sentiment": "none"}, {"name": "maitri panchal", "sentiment": "none"}, {"name": "boldon", "sentiment": "none"}, {"name": "workfinder", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "workfinder", "sentiment": "none"}], "organizations": [{"name": "scaleup institute", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "nominet trust", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "boiler shop", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Sherry Coutu CBE with students (Image: Unknown) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nA new scholarship that uses a mobile app to help young women kick-start their careers has launched in Newcastle. \nEducation charity Founders4Schools has launched the £200,000 scheme, which aims to offer girls aged 16 to 18 valuable work experience in the tech sector. \nStudents will be able to find work placements through a new mobile app called Workfinder. The app links the young women with digital firms in the region that are offering work placements. \nThe creation of the unique app was inspired by 16-year-old Maitri Panchal, who helped come up with the idea while on work experience at the charity. \nWorkfinder offers a range of features that allow students to filter preferences, share recommendations and connect with companies in as little as five minutes. Sherry Coutu CBE (Image: Unknown) \nAt a launch event for the scholarship scheme, which was held at Newcastle’s Boiler Shop, Founders4Schools chair Sherry Coutu explained how she hoped the app would help end the North East’s digital skills gap. \nBoldon contact centre creates 56 jobs after winning new energy work \nShe said: “The current work experience model is broken. According to the ScaleUp Institute, 90% of UK scale-up businesses are concerned about a lack of skills post-Brexit but existing structures do not allow UK plc to foster home-grown skills. \n“93% of teachers say that work experience boosts student attainment and aspirations. Great companies are learning environments and need talent to grow; young people need help to find their passion in life. It’s the challenge of a generation, and I hope Workfinder will give them the power to discover their route to a meaningful career.” \nBusiness such as NRG, printed.com, and hedgehog lab have all signed up to the programme and will be offering work placements to students. \nThe scheme has been funded by social tech investor Nominet Trust, who has invested £200,000 into the programme. \nClimb Newcastle launches second indoor climbing centre following funding \nVicki Hearn, director of Nominet Trust, said: “Nominet Trust’s purpose is to transform lives with tech - but that’s only possible if we give the next generation, regardless of their background and circumstance, the opportunity to develop digital skills. \n“We’re excited about continuing our partnership with Founders4Schools by funding 5,000 placements available through Workfinder in major UK cities, because of the opportunity it gives to young women to develop careers in STEM subjects, boosting their contribution to the UK’s growing digital economy.” Like us on Facebook", "external_links": [], "published": "2017-11-30T16:02:00.000+02:00", "crawled": "2017-11-30T16:37:53.002+02:00", "highlightTitle": ""}