{"organizations": [], "uuid": "14736c01de38e5e1d4f38f0aeb5b9b9c180cd273", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13853835.ece/ALTERNATES/s1200/Farming-subsidies.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/farming/farmers-north-east-urged-take-13853751", "country": "GB", "domain_rank": 21960, "title": "Farmers in North East urged to take advantage of £40m grant scheme", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-03T14:30:00.000+02:00", "replies_count": 0, "uuid": "14736c01de38e5e1d4f38f0aeb5b9b9c180cd273"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/farming/farmers-north-east-urged-take-13853751", "ord_in_thread": 0, "title": "Farmers in North East urged to take advantage of £40m grant scheme", "locations": [], "entities": {"persons": [{"name": "david hume", "sentiment": "none"}, {"name": "gove", "sentiment": "none"}, {"name": "michael gove", "sentiment": "none"}, {"name": "hume", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "george f. white", "sentiment": "none"}, {"name": "tim sedgewick", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "cumbria", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north", "sentiment": "none"}, {"name": "alnwick", "sentiment": "none"}, {"name": "langwathby", "sentiment": "none"}], "organizations": [{"name": "farmers", "sentiment": "negative"}, {"name": "invalid email  farmers", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Farmers in North East urged to take advantage of £40m grant scheme Countryside Productivity Programme aims to back schemes which could harness technology on farms Share Combine harvester in a field near Langwathby in Cumbria (Image: PA) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nFarmers in the North East are being urged to take advantage of a £40m grant scheme announced by the Government to improve productivity in the agricultural sector. \nEnvironment Secretary Michael Gove this week announced the Countryside Productivity Scheme, saying that money is available to help livestock, dairy, arable and horticultural farmers improve farm productivity through investing in new technology, such as robotics, to reduce cost or improve product quality. \nThe funding can be used on diverse investments, from robotic milking machines to green technology. \nDavid Hume, a farm consultant at Alnwick -based land agents George F. White, said the grants could be a welcome to boost to farmers in the North as they struggle to adapt for the uncertainty of Brexit. \nHe said: “It’s been tough going these past few years for farmers who have had to deal with volatile market prices, weather changes, and also preparation for the impact Brexit will have on the industry. The demand for more sustainable and efficient farming businesses is greater than ever, and this new grant scheme can really help farmers to do this. \n“The minimum grant contribution is £35,000 which (assuming a grant rate of 40%) makes the minimum project cost £87,500. This grant is therefore very much focused on larger projects that will aid business expansion or significantly reduce production costs.” \nMr Hume said the scheme could help farms diversify and find new revenue streams, as well as become food processors as well as producers. \nHe said: “The main objective of the scheme is to facilitate and support the growth of progressive businesses, to create a sustainable rural community that is using the latest technology and techniques and making the most of opportunities available to improve profitability. \n“We’re working with farmers across the region to help them move their business forward and secure greater sustainability, and this new funding opportunity will be central to how we approach this. It’s a very welcome boost for our rural economy and we’re looking forward to helping clients diversify with help from the scheme, to secure their long-term future.” \nThe fund has also been welcomed by H&H Land and Property, which has offices across the North. \nSurveyor Tim Sedgewick said: “This funding is there to support any farmer, farm business or food processor looking to invest in technology which will help them to increase output and improve productivity. \n“The Farming industry is becoming increasingly dependent upon technology at all levels and therefore it is important that businesses identify opportunities to help ensure long term sustainability.” \nAll grant applications under the improving productivity part of the scheme must be submitted electronically by December 3. Expressions of interest for the adding value to agri-food programme must be in by June 29 next year. \nMr Gove said: “Farmers truly are the backbone of our rural economy and as the original friends of the earth, we want to support them to grow more, sell more and export more great British produce – all while doing good for our environment. \n“This new funding is a wonderful opportunity for our farmers and food processors to invest in the technology they need to boost productivity, competition and, of course, sustainability as a key factor in future proofing our world leading food and farming industry.” \nMore details on the scheme are available at https:// www.gov.uk/guidance/countryside-productivity-scheme . Like us on Facebook", "external_links": [], "published": "2017-11-03T14:30:00.000+02:00", "crawled": "2017-11-03T14:50:57.000+02:00", "highlightTitle": ""}