{"organizations": [], "uuid": "9505c7465488febd7ea4520a0044a78ddc7679b0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13613365.ece/ALTERNATES/s1200/Greenpeace-Re-brands-Boris-Johnsons-Brexit-Battlebus.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/nhs-chief-pass-brexit-saving-13874159", "country": "GB", "domain_rank": 21960, "title": "NHS chief - Pass on Brexit saving to NHS or risk the public losing faith in democracy", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-08T13:45:00.000+02:00", "replies_count": 0, "uuid": "9505c7465488febd7ea4520a0044a78ddc7679b0"}, "author": "Simon Meechan", "url": "http://www.chroniclelive.co.uk/news/north-east-news/nhs-chief-pass-brexit-saving-13874159", "ord_in_thread": 0, "title": "NHS chief - Pass on Brexit saving to NHS or risk the public losing faith in democracy", "locations": [], "entities": {"persons": [{"name": "simon stevens", "sentiment": "none"}, {"name": "stevens", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "boris johnson", "sentiment": "none"}, {"name": "dominic cummings", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "spectator", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "nhs", "sentiment": "negative"}, {"name": "bbc", "sentiment": "none"}, {"name": "cabinet", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "health foundation", "sentiment": "none"}, {"name": "nuffield trust", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe Vote Leave campaign pledge which stated that Brexit means more cash for the NHS must be honoured or the public will lose faith in politics, an NHS chief will warn. \nNHS England chief executive Simon Stevens will mention Vote Leave’s claim that Brexit will bring £350m a week back into the British treasury when he speaks at an NHS providers conference today. The Vote Leave campaign bus famously made the claim and carried the phrase: “Let’s fund our NHS instead”. \nProminent Brexiteers like Boris Johnson were among those who travelled around the country on the bus, while campaign director Dominic Cummings’ own analysis in Spectator says Britain would have voted to remain in the EU if that pledge was not made. A 'Vote LEAVE' battle bus (Image: Getty Images Europe) \nMr Stevens will not specifically ask for the £350m figure to be added to NHS coffers. But he will warn that the public could lose faith in democracy if this month’s budget does not promise extra money for the NHS, due to economic uncertainty caused by Brexit. \nMr Stevens is expected to say: “The NHS wasn’t on the ballot paper, but it was on the Battle Bus. Vote Leave for a better funded health service - £350 million a week.” Read More Two Newcastle GP surgeries have been saved but another one will close after NHS review \nHe is set to add: “Rather than our criticising these clear Brexit funding commitments to NHS patients - promises entered into by Cabinet ministers and by MPs - the public want to see them honoured. \n“By the end of the NHS’s next financial year - March 2019 - the United Kingdom will have left the European Union. \n“Trust in democratic politics will not be strengthened if anyone now tries to argue: ‘You voted Brexit, partly for a better funded health service. But precisely because of Brexit, you now can’t have one.’ \n“A modern NHS is itself part of the practical answer to the deep social concerns that gave rise to Brexit. \n“At a time of national division, an NHS that brings us together. An institution that tops the list of what people say makes them proudest to be British. Ahead of the army, the monarchy or the BBC. Unifying young and old, town and country, the struggling and the better off.” \nThink tanks warn NHS funding is due to hit on of its lowest rate in history next year. The Health Foundation, the King’s Fund and Nuffield Trust reckon the health service needs a £4bn injection to prevent care from declining. Like us on Facebook", "external_links": [], "published": "2017-11-08T13:45:00.000+02:00", "crawled": "2017-11-08T14:16:50.000+02:00", "highlightTitle": ""}