{"organizations": [], "uuid": "0993face97ec23e44c27564d201c6ea002a00d27", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13108231.ece/ALTERNATES/s1200/Daily-Record-Road-Record.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/carmakers-employing-warn-brexit-could-13896994", "country": "GB", "domain_rank": 21960, "title": "Carmakers employing warn Brexit could do huge damage to their businesses", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-14T10:00:00.000+02:00", "replies_count": 0, "uuid": "0993face97ec23e44c27564d201c6ea002a00d27"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/carmakers-employing-warn-brexit-could-13896994", "ord_in_thread": 0, "title": "Carmakers employing warn Brexit could do huge damage to their businesses", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "negative"}, {"name": "colin lawther", "sentiment": "none"}, {"name": "dunton", "sentiment": "none"}], "locations": [{"name": "merseyside", "sentiment": "none"}, {"name": "bedfordshire", "sentiment": "none"}, {"name": "wales", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "swindon", "sentiment": "none"}, {"name": "morocco", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "berkshire", "sentiment": "none"}, {"name": "halewood", "sentiment": "none"}, {"name": "serbia", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "bridgend", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}, {"name": "luton", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "cheshire", "sentiment": "none"}, {"name": "turkey", "sentiment": "none"}, {"name": "dagenham", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "south africa", "sentiment": "none"}, {"name": "ellesmere port", "sentiment": "none"}, {"name": "bracknell", "sentiment": "none"}], "organizations": [{"name": "honda honda", "sentiment": "none"}, {"name": "ford credit europe", "sentiment": "none"}, {"name": "customs union", "sentiment": "none"}, {"name": "house of commons business, energy and industrial strategy committee honda", "sentiment": "none"}, {"name": "fce", "sentiment": "none"}, {"name": "honda", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "european union customs union", "sentiment": "none"}, {"name": "vauxhall", "sentiment": "none"}, {"name": "wto", "sentiment": "none"}, {"name": "mfn", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "single market and customs union", "sentiment": "none"}, {"name": "european customer contact centre", "sentiment": "none"}, {"name": "ford", "sentiment": "none"}, {"name": "world trade organisation", "sentiment": "none"}, {"name": "essex", "sentiment": "none"}, {"name": "ford motor company", "sentiment": "none"}, {"name": "vauxhall vauxhall astra", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}, {"name": "ford ford fiesta titanium", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Carmakers employing more than 16,000 warn Brexit could do huge damage to their businesses More car firms have followed Nissan in warning that a bad Brexit would devastate their businesses Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nMotor manufacturers employing more than 16,000 people in the UK have warned that Brexit without a comprehensive trade and customs deal would have a devastating effect on their businesses. \nThe carmakers, Honda, Ford and Vauxhall, also said it was essential the UK negotiates a transition period to allow businesses and officials, including UK border agencies, to prepare for the changes Brexit will bring. \nIt follows similar warnings from Nissan , which has a major plant in Sunderland. \nColin Lawther, a senior vice president at Nissan, told a Commons inquiry earlier this year that any disruption to the firm’s supply chain caused by Brexit would be “a complete disaster.” Colin Lawther, Nissan’s European senior vice president for manufacturing \nOther firms have now raised similar concerns in written papers submitted to the House of Commons Business, Energy and Industrial Strategy Committee Honda warned that leaving the European Union Customs Union without a deal to prevent delays at borders would cost it “tens of millions of pounds”. Honda also said preventing EU nationals from coming to the UK to work could lead to “staffing shortages with a potential impact on manufacturing activity” Ford said its UK operations are “built upon” access to the single European market and leaving the EU without a deal would “place a very significant cost” on the business. Ford also said it builds engines in the UK for cars manufactured in other parts of the EU - but Brexit could mean the finished vehicles are no longer considered to be “EU-originating”, which would threaten its UK operations. Vauxhall highlighted the cost of continued uncertainty, saying: “Clarity on the transition deal is needed as soon as possible.” Honda Honda Civic 1.0 VTEC Turbo EX Dynamic (Image: Publicity Picture) \nHonda, which manufactures cars, motorcycles and engines, employs 4,000 people at a factory in Swindon and 500 at its UK and European headquarters in Bracknell, Berkshire. \nIt says that “membership of the Single Market and Customs Union provides Honda with several important benefits”, which includes tariff-free trade not only with EU countries but also with “important markets around the world”. \nFor example, Turkey is not in the EU but it is in the Customs Union - and Honda exports 5,100 vehicles to Turkey each year. \nIf the UK leaves the Customs Union then this would probably mean exporting to Turkey on World Trade Organisation (WTO) terms, with a 10% tariff imposed. This would cost Honda £7 million, the firm said. \nBut the imposition of what are called “non-tariff barriers”, such as delays at borders when goods are imported into the country, “would potentially have a greater impact than tariffs”. \nThis is because Honda, like other vehicle manufacturers, operates what’s known as a “just in time” manufacturing policy. Rather than stockpiling parts in warehouses, it imports parts as they are needed - but the system depends on being able to get parts into the UK quickly. \nLeaving the Customs Union is likely to mean lorries carrying parts into the UK are delayed at ports while their contents are checked by customs officials. \nHonda said: “Mitigating against the impact of possible delays would require doubling warehousing capacity to store a greater portion of components on-site, increasing the amount of stock in transit and the introduction of new processes. \n“These investments would amount to tens of millions of pounds in extra costs annually.” \nThe firm also said it that needed to recruit staff from outside the UK, despite attempts to employ more UK workers by introducing an apprenticeship scheme. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nIt said it recently launched a campaign to recruit 600 new temporary workers, but “a lack of UK applications” meant that four out of ten of the new recruits ended up being non-UK nationals. \n“Given the very low rates of unemployment in Swindon, there is not a ready pool of people in the local area to easily replace EU27 nationals with. \n“Removing EU27 Nationals, without a sufficient transition period, from the labour pool available to the Swindon factory would result in staffing shortages with a potential impact on manufacturing activity.” \nHonda said: “While the risks posed by Brexit are significant, they can be managed if we, our supply chain and our customers have sufficient time to put new procedures into place. A transitional deal would provide this needed time.” Ford Ford Fiesta Titanium 1.0 \nFord Motor Company employs around 2,100 people at an engine plant in Bridgend, Wales, 1,800 at an engine plant in Dagenham, 3,000 at a research and design centre in Dunton, Essex, and 715 people at a transmission plant in Halewood, Merseyside. \nBut it warned that its UK operation are “built upon” access to the single market. \nFord said: “At the moment, the UK enjoys tariff free trade within the single market and as part of the EU’s Customs Union with Turkey, while benefiting from preferential trading terms with third countries under EU Free Trade Agreements (FTAs). \n“As a result, Ford’s sales, manufacturing and R&D operations in the UK are built upon access to this single European market and our ability to move goods freely across Europe. \n“Leaving the European Union single market and Customs Union, and reversion to World Trade Organisation (WTO) Most Favoured Nation (MFN) tariffs would place a very significant cost on Ford in Britain and across Europe.” Read More Here's why a 'no-deal Brexit' will be a disaster for the North East's economy, businesses and people \nIt also warned that loss of access to the single market would damage its finance arm, Ford Credit Europe (FCE), which is based in Manchester. \nFord said: “FCE’s sole purpose is to finance the sale of Ford motor vehicles and Ford cannot afford any kind of disruption to FCE’s continuity of financing. It finances almost four in ten of Ford vehicles sold in the UK and recently opened a new headquarters in Manchester, serving eleven markets across Europe.” \nSome vehicles built in the EU would no longer be considered “EU-originating materials” if the engines were made in the UK, as they are now - and this would affect sales in countries which have free trade agreements with the EU such as South Africa, Switzerland, Morocco and Serbia. \nFord said: “This would add significant cost to our European business, and potentially negatively impact UK powertrain [engine] manufacturing.” Vauxhall Vauxhall Astra cars on production line in factory (Image: Handout) \nVauxhall directly employs 4,800 people in the UK and a further 30,000 people indirectly through its supply chain and retailer network. \nIt has manufacturing sites at Ellesmere Port, Cheshire, and Luton, Bedfordshire, as well as a European aftersales parts warehouse and a European Customer Contact Centre in the UK. \nBut the firm warned that uncertainty around the future relationship between the UK and EU “does not create the necessary environment for automotive business to operate within”. \nMoving to WTO rules - which is probably what would happen if the UK leaves the EU without a trade deal - would be the “worst case scenario”, Vauxhall said. Read More This is how much a 'no-deal' Brexit would drain out of Newcastle and the rest of the North East \n“Tariffs presents initial cost to our UK business of 10% import duties on cars and an average of 3.5% on components used in UK manufacturing.” \nAnd Vauxhall said it was “essential to maintain” common regulations, to ensure the UK and EU had the same rules on issues such as vehicle safety; C02 emissions; recycling; data protection, and intellectual property rights. \nThe business called for a lengthy transition period, firstly to allow time for a comprehensive new trade deal to be agreed between the EU and UK and secondly to give businesses, ports, customs authorities and border authorities time to prepare for whatever changes are introduced. \nIt said: “Clarity on the transition deal is needed as soon as possible.” Like us on Facebook", "external_links": [], "published": "2017-11-14T10:00:00.000+02:00", "crawled": "2017-11-14T10:08:15.000+02:00", "highlightTitle": ""}