{"organizations": [], "uuid": "95261c86b91369d1dcb916166fff45835476809f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article802718.ece/ALTERNATES/s1200/MAIN-Budget-2017.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/news/business/budget-2017-key-points-could-817733", "country": "US", "domain_rank": 48128, "title": "Budget 2017: Key points that could help Leicestershire - Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.38, "site_type": "news", "published": "2017-11-22T18:44:00.000+02:00", "replies_count": 0, "uuid": "95261c86b91369d1dcb916166fff45835476809f"}, "author": "Tom Pegden", "url": "http://www.leicestermercury.co.uk/news/business/budget-2017-key-points-could-817733", "ord_in_thread": 0, "title": "Budget 2017: Key points that could help Leicestershire - Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "coun nick rushton", "sentiment": "none"}, {"name": "alberto costa", "sentiment": "none"}, {"name": "peter soulsby", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "nick rushton  chris hobson", "sentiment": "none"}, {"name": "liz kendall", "sentiment": "none"}, {"name": "philip hammond", "sentiment": "none"}], "locations": [{"name": "nottingham", "sentiment": "none"}, {"name": "lincolnshire", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "melton", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}, {"name": "east midlands", "sentiment": "none"}, {"name": "south leicestershire", "sentiment": "none"}, {"name": "leicester west", "sentiment": "none"}], "organizations": [{"name": "leicestershire", "sentiment": "negative"}, {"name": "universal credit", "sentiment": "none"}, {"name": "derbyshire", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "leicester west labour", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "east midlands chamber", "sentiment": "none"}, {"name": "leicestershire county council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nToday’s budget included a handful of points the Chancellor said would specifically benefit Leicestershire and the wider East Midlands. \nThey included a share of the £2.6 billion fund for local NHS services to improve facilities and deliver better patient care. \nHe also said more than £3 million would be used to upgraded to the Network Rail test track at Melton to test new technology. \nThe 13 mile long facility, a couple of miles west of the town, has two tracks used for high and low speed testing. \nThe county will also get a share of £8 million for flood defences, to be split with Derbyshire and Lincolnshire. \nOn top of that, £500,000 will be spent on new manufacturing zones in the East Midlands, which will be exempt from planning applications, enabling businesses to grow more quickly. \nSelected schools across the East Midlands, he said, will benefit from better internet connections through a pilot to connect more public buildings with full fibre broadband. \nLeicester and Nottingham will also get a share of £5 million fund to celebrate their historic connections with the Women’s Suffrage movement to mark next year’s centenary. \nChancellor Philip Hammond said: “The investments I have announced back the East Midlands with a significant cash boost, while our major commitments on housing and health, training and technology will benefit those right across the region.” \nLeicester West Labour MP Liz Kendall was less than complimentary though. \nShe said: “In the face of all the risks and uncertainties posed by Brexit, and long-standing problems in our economy, this was a completely inadequate budget. Leicester West MP Liz Kendall \n“We are in the longest period of wage stagnation for 150 years, fewer homes are being built than under any peacetime Government since the 1920s, and our public services are underfunded to the point of crisis. \n“The Chancellor completely failed to address these challenges or offer my constituents a plan for a better future.” \nLeicester’s City Mayor Sir Peter Soulsby said: \"I’m bitterly disappointed that the government has run away from dealing with the cost of adult social care, which, with a growing, ageing population currently falls on families and councils to cover. \n\"And I note there is nothing new in this budget which will enable councils to build the many thousands of affordable homes for rent that are needed in each part of the country to address the scandal of the housing crisis. \nLeicestershire County Council leader Coun Nick Rushton welcomed extra support for housing but said much more was needed to give local government the tools and powers to support economic growth and help those in need. \nHe said: “Pressure on local government services is continuing to mount, particularly in children’s social care, which is seeing severe strain. \n“There was no recognition of these pressures in today’s speech. \n“The Government needs to wake up to offer clear, long-term, properly funded-solutions. \n“Given these pressures, a total shake-up of local government funding remains essential.” \nHe said councils needed a much fairer system of “needs-based funding”. Leicestershire County Council leader Nick Rushton \nChris Hobson, director of policy at East Midlands Chamber, said it held \"no game-changers\" but there were \"a number of smaller announcements that will please some people\". \nHe said: \"The devil will be in the detail when it comes to moves to make houses more affordable. \n\"Past Budgets have talked about building more houses. Read More Budget 2017: The key points from Philip Hammond's speech at a glance \n\"This Budget talked about an additional 300,000 new houses and other moves to nudge the market when it comes to sales at the lower end of the ladder, such as the abolition of Stamp Duty for first-time buyers on properties worth up to £300,000, but we’ll have to see if that will be enough to stimulate the market. Read More Budget 2017 - more new homes, boost for green cars and concessions for Universal Credit claimants \n\"The new focus on retraining towards digital for older employees is welcome, but do the measures announced go far enough? \n\"It was also interesting to hear that there are plans for a new national centre for computing – this could be an opportunity for the East Midlands. \n\"All in all, this budget was something of a missed opportunity for the Government to invest meaningfully in those areas that will support the wealth creators of the UK, large and small - investment we need if we are to unharness the full potential of our businesses and investment which should not be viewed as a cost as it will repay itself many times over the longer term.\" \nSouth Leicestershire MP Alberto Costa was \"very pleased to see a budget with a wide range of measures to help people across society\". \nHe said: \"From steps such as abolishing stamp duty for 80% of first time buyers, to increasing the national living wage and investing in productivity – this is a budget that will help to make our economy fit for the future.\" \nOther key points include: Tax-free personal allowance on income tax to rise to £11,850 in April 2018 Higher-rate tax threshold to increase to £46,350 National Living Wage to rise in April 2018 by 4.4 per cent, from £7.50 an hour to £7.83. Young person's railcard extended to 26-30-year-olds £2.8bn in extra funding for the NHS in England, including immediate £350m to address pressures this winter Like us on Facebook ", "external_links": [], "published": "2017-11-22T18:44:00.000+02:00", "crawled": "2017-11-22T20:58:30.000+02:00", "highlightTitle": ""}