{"organizations": [], "uuid": "ea210fd19e9f102106d5fe2f0840135ad45eacae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/business/article720370.ece/ALTERNATES/s1200/ESP_VinceCableVisit_-3.jpg", "site_section": "http://www.middevongazette.co.uk/politics.rss", "section_title": "devonlive - News", "url": "http://www.devonlive.com/news/business/vision-tech-future-exeter-devon-720358", "country": "GB", "title": "A vision for the tech future of Exeter and Devon set out for Sir Vince Cable", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-11-02T18:51:00.000+02:00", "replies_count": 0, "uuid": "ea210fd19e9f102106d5fe2f0840135ad45eacae"}, "author": "Hannah Finch", "url": "http://www.devonlive.com/news/business/vision-tech-future-exeter-devon-720358", "ord_in_thread": 0, "title": "A vision for the tech future of Exeter and Devon set out for Sir Vince Cable", "locations": [], "entities": {"persons": [{"name": "vince", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "mike badley", "sentiment": "none"}, {"name": "sally basker", "sentiment": "none"}, {"name": "tim jones", "sentiment": "none"}, {"name": "vince cable", "sentiment": "none"}, {"name": "basker", "sentiment": "none"}, {"name": "joe pearce", "sentiment": "none"}], "locations": [{"name": "exeter", "sentiment": "none"}, {"name": "science park centre", "sentiment": "none"}, {"name": "exeter science park", "sentiment": "none"}, {"name": "cornwall", "sentiment": "none"}, {"name": "science park", "sentiment": "none"}, {"name": "bristol", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}], "organizations": [{"name": "exeter science park", "sentiment": "none"}, {"name": "cornwall  organised", "sentiment": "none"}, {"name": "cornwall business council", "sentiment": "none"}, {"name": "south devon university technical college", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "council", "sentiment": "none"}, {"name": "dcbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News A vision for the tech future of Exeter and Devon set out for Sir Vince Cable Leading businesses at Exeter Science Park set out their plans for the Lib Dem leader on recent visit Share Sir Vince Cable makes his point to the some of the companies he met during his visit to Exeter Science Park. Share   Thank you for subscribing!   \nA vision to make Devon and the South West a tech beacon has been set out for Lib Dem leader Sir Vince Cable. \nThe former Secretary of State for Business, Innovation and Skills met with fast-growth businesses at Exeter Science Park as part of a visit to the South West to discuss its booming science and technology sector. \nThe Science Park Centre, which opened in June 2015 to accommodate and support innovative businesses, now has over 180 science, technology, engineering, maths and medicine (STEMM) professionals on site. Read More Nine reasons why Devon, Cornwall and... \nNew grow-on space is being built for expanding companies, with work due to start on site in November 2017, and it is estimated that by 2034 over 3,500 people will work for companies within the Science Park; with over 2,500 of these being new high-quality jobs. \nFast becoming known as a centre of excellence for STEMM companies, the Science Park nurtures business growth, providing the space, skills and support for success. Read More Devon and Cornwall has potential to be at forefront of digital revolution \nPharmaceutical software company, Rx-info, presented to Sir Vince Cable on Friday, October 27th, alongside airport, parking and venue-based reservation commerce provider Rezcomm; engineering entrepreneur Mike Badley of Sigma Technical; and Joe Pearce from the SETsquared Exeter incubator. Dr Sally Basker, CEO of Exeter Science Park explains to Sir Vince Cable her future vision and plans for growth during his visit to the centre. \nSir Vince Cable also heard from Dr Sally Basker, CEO of Exeter Science Park, on its future vision and plans for growth, as well as discussing how the South West as region can strive for an improved business landscape and economic growth. \nDr Basker said: “We were thrilled to welcome Sir Vince to the Science Park, not only to discuss our progress and visions for the future of the site, but also our mission to support and engage with the wider region. Read More REVEALED: The shortlist for the Western Morning News Business Awards 2017 \n“We’re looking to put the South West on the map as a centre of excellence, with the Science Park hosting and connecting innovative companies, however there are a number of challenges that we need to address to deliver our vision for extraordinary growth. \n“A key challenge for us in the region is how the South West as a brand is often distorted by figures from cities such as Bath and Bristol, meaning that we may not attract the businesses and talent that we need. We were keen to discuss with Sir Vince how we can work as a whole to improve this for the future.” \nJoe Pearce, Business Support Manager of the Science Park Centre and SETsquared Exeter said: “SETsquared has supported over 1,000 start-ups and SMEs, and it’s clear that businesses in the city and further afield are facing similar challenges, such as the infrastructure, access to funding and access to high-quality talent. The only way to address these is to work with leaders, like Sir Vince, who can help to facilitate change.” Read More Here are the Top 75 Fastest Growing businesses in Devon and Cornwall \nOrganised by the Devon and Cornwall Business Council (DCBC), Sir Vince’s visit also included a Torbay Business Forum breakfast meeting and a visit to the South Devon University Technical College (UTC). \nTim Jones, Chairman of DCBC said: \"DCBC is delighted to be hosting a visit from the Rt. Hon Sir Vince Cable MP, Leader of the Liberal Democrats. \n“DCBC is non-political. It does however engage with all the key stakeholders in Westminster. The Council has encouraged national debate on issues which are vital to the South West economy. We therefore welcome strong advocates to ensure that our message is being heard. Sir Vince is such an advocate. \n“His track record as Business Secretary demonstrates his ability to encourage and stimulate business growth. He has recently been on record supporting the need for a new programme of infrastructure development, the importance of skills, and the need to clarify the Brexit negotiations.” \nThe DCBC was formed in 2000 to establish a ‘single voice’ network to represent, both regionally and nationally, the views of businesses across the sub region. It works in strategic partnership with other representative organisations to support members. Like us on Facebook", "external_links": [], "published": "2017-11-02T18:51:00.000+02:00", "crawled": "2017-11-02T19:37:07.001+02:00", "highlightTitle": ""}