{"organizations": [], "uuid": "1d5d4e087bd0814f753fb63074b5de343801cb82", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bostonstandard.co.uk", "main_image": "http://res.cloudinary.com/jpress/image/fetch/w_300,f_auto,ar_3:2,c_fill/http://www.bostonstandard.co.uk/webimage/1.8000515.1496970417!/image/image.jpg", "site_section": "http://www.bostonstandard.co.uk/rss/cmlink/1.335257", "section_title": "Boston Standard MBSP.news.feed", "url": "http://www.bostonstandard.co.uk/news/general-election-update-labour-s-paul-kenny-expects-to-step-into-second-place-in-his-red-shoes-1-8000404", "country": "GB", "title": "GENERAL ELECTION UPDATE: Labour’s Paul Kenny expects to step into second place - in his red shoes", "performance_score": 0, "site": "bostonstandard.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-09T06:52:00.000+03:00", "replies_count": 0, "uuid": "1d5d4e087bd0814f753fb63074b5de343801cb82"}, "author": "", "url": "http://www.bostonstandard.co.uk/news/general-election-update-labour-s-paul-kenny-expects-to-step-into-second-place-in-his-red-shoes-1-8000404", "ord_in_thread": 0, "title": "GENERAL ELECTION UPDATE: Labour’s Paul Kenny expects to step into second place - in his red shoes", "locations": [], "entities": {"persons": [{"name": "paul kenny", "sentiment": "none"}, {"name": "paul nuttall", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "nigel farage", "sentiment": "none"}, {"name": "paul", "sentiment": "none"}, {"name": "kenny", "sentiment": "none"}, {"name": "matt warman", "sentiment": "none"}, {"name": "farage", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "paula cooper", "sentiment": "none"}, {"name": "ransome", "sentiment": "none"}, {"name": "philip smith", "sentiment": "none"}, {"name": "don ransome", "sentiment": "none"}, {"name": "david dawson", "sentiment": "none"}, {"name": "mike gilbert", "sentiment": "none"}, {"name": "nuttall", "sentiment": "none"}], "locations": [{"name": "boston", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}, {"name": "standard", "sentiment": "none"}, {"name": "standard’s facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "GENERAL ELECTION UPDATE: Labour’s Paul Kenny expects to step into second place - in his red shoes Labour candidate Paul Kenny. Photo: David Dawson. 23:52 Thursday 08 June 2017 02:07 Friday 09 June 2017 Have your say \nLabour’s Paul Kenny is showing he can step up to the mark – in bright red shoes. \nMr Kenny arrived at the count in Boston in very good humour. He said: “I’m feeling quite upbeat. I think we’ve had the best manifesto I seen in my life and I’ve seen a few - I’m 60. Conservative candidate Matt Warman. Photo: David Dawson \n“People are realising we are the party who look after people. When you go to an election you have to talk about the things that matter - about health care, education and social services. \n“MPs can’t take an 11 per cent rise and expect people in Boston to earn £10 an hour. \n“During this election people have seen a party that listens to people and provides policies that are credible.” \nHe also criticised UKIP’s Paul Nuttall for still not being at the count. He said: “When you stand for a constituency you should be here. I think we’ll be seeing Mr Nuttall in third place.” \nPaul Nuttall, who is staying in a hotel in Boston until shortly before the results are announced earlier tweeted: “If the exit poll is true then Theresa May has put Brexit in jeopardy. I said at the start this election was wrong. Hubris.” \nFriday: 1.15am: Matt Warman is urging constituents not to speculate on exit polls. \nHe said: “The exit polls were very early predictions. Let’s not speculate until we get more data. Overall it looks like being a very good night for Conservatives locally. I have visited every polling station in the constituency today and locally the turnout has been much higher than expected. My campaign is different to the one run nationally with different issues but you have to remember it isn’t about being popular it it about making the decisions that are right for the country.” \nFor a full interview and one with Labour candidate Paul Kenny check out The Standard’s Facebook. The first boxes (and bags) arrive to the count. Photo: David Dawson \nFriday, 0.33am - Former UKIP leader Nigel Farage’s decision not to run in Boston and Skegness in 2015 ‘was a missed opportunity’, Paul Nuttall’s election agent has told The Standard. \nDon Ransome, who is Mr Nuttall’s eyes and ears on the ground said this election had been a ‘steady campaign’. \n“I have noticed we’ve had a very, very low key, almost lack of interest among the public... I’m surprised,” he said. \nHe said he had spoken to Mr Nuttall’s PR person tonight but said he had not heard how Paul, who is reportedly waiting in a hotel room until shortly before the results, is doing. Blue Revolution Party candidate Mike Gilbert. Photo: David Dawson \nOn the exit polls tonight, Mr Ransome said: “There was an exit poll with Brexit when Nigel Farage said he was throwing in the towel - so there you go, the pollsters aren’t always accurate.” \nMany voters have commented that UKIP have less of a chance this time round, and it’s been said that UKIP missed its chance by not running Nigel Farage in the constituency when the party saw its popularity saw in 2015. \nMr Ransome agreed: “It was a missed opportunity. We did ask Nigel Farage, in fact Paul Nuttall asked Mr Farage to stand here last time... it was a missed opportunity.” \nThursday, 11.52pm - Election night is underway, the boxes of votes have arrived and are being verified and at least one candidate has already turned up. \nUKIP leader Paul Nuttall, it has been confirmed, will not be arriving until shortly before the results are due to be announced. A party spokesman confirmed he is staying in a hotel room in Boston and that party representatives would be attending the count earlier. \nLiberal Democrat Philip Smith was the first candidate to arrive - admitting he hadn’t really had chance this year due to the surprise of Theresa May’s snap election. Liberal Democrat Philip Smith. Photo: David Dawson \nHe explained he had planned to take a sabbatical from work to run in the original planned election, but had been unprepared for the announcement. \nHowever, he said: “I’m quite confident that we have done better than last time across the country.” \nConservative MP Matt Warman hasn’t arrived yet but his election agent Paula Cooper said theyve been to every polling station in the constituency, starting at 7am. \nShe’s seen the exit poll but says they are taking heart from the fact the first results in are higher than predicted. \nShe said: “Every conversation we went to they were saying there was a high turnout, a lot better than county council elections.” \n“The exit polls have been wrong before, four weeks ago the UKIP vote fell of a cliff and I don’t think things have changed that much.” \nMike Gilbert, who is running under the Blue Revolution party banner has also arrived. \nHe told The Standard: “We only formed on May 10 with just 20 supporters and then we were bounced into this election so we only expect to get the 10s rather than in the hundreds. \n“We want to act as a pressure group and try to get whoever’s voted in to hear what we’re saying.” Sign in", "external_links": [], "published": "2017-06-09T06:52:00.000+03:00", "crawled": "2017-06-09T04:36:55.002+03:00", "highlightTitle": ""}