{"organizations": [], "uuid": "4f2765aa743a41fe7c5bbf288d7fc6cf73301d5b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30387497/16042167.jpg", "site_section": "", "section_title": "", "url": "http://www.devonlive.com/devon-mp-disagrees-profoundly-with-dup-s-controversial-views-on-abortion-lgbt-rights/story-30387497-detail/story.html", "country": "US", "title": "Devon MP 'disagrees profoundly' with DUP's controversial views on abortion & LGBT rights | Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "", "spam_score": 0.038, "site_type": "news", "published": "2017-06-13T23:46:00.000+03:00", "replies_count": 0, "uuid": "4f2765aa743a41fe7c5bbf288d7fc6cf73301d5b"}, "author": "", "url": "http://www.devonlive.com/devon-mp-disagrees-profoundly-with-dup-s-controversial-views-on-abortion-lgbt-rights/story-30387497-detail/story.html", "ord_in_thread": 0, "title": "Devon MP 'disagrees profoundly' with DUP's controversial views on abortion & LGBT rights | Devon Live", "locations": [], "entities": {"persons": [{"name": "devon", "sentiment": "none"}, {"name": "joelcoop", "sentiment": "none"}, {"name": "john major", "sentiment": "none"}, {"name": "north devon", "sentiment": "none"}, {"name": "arlene foster devon", "sentiment": "none"}, {"name": "heaton-jones", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "peter heaton-jones", "sentiment": "none"}, {"name": "nick harvey", "sentiment": "none"}], "locations": [{"name": "devon live devon", "sentiment": "none"}, {"name": "north devon", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north devon district hospital", "sentiment": "none"}, {"name": "barnstaple", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}, {"name": "north devon link road", "sentiment": "none"}], "organizations": [{"name": "dup", "sentiment": "none"}, {"name": "devon conservative", "sentiment": "none"}, {"name": "democratic unionist party", "sentiment": "none"}, {"name": "north devon journal", "sentiment": "none"}, {"name": "cabinet", "sentiment": "none"}, {"name": "democratic unionists", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "devon county council", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Devon MP 'disagrees profoundly' with DUP's controversial views on abortion & LGBT rights By JoelCooper | Posted: June 13, 2017 2 COMMENTS SHARES Peter Heaton-Jones, Theresa May and DUP leader Arlene Foster Devon MP 'disagrees profoundly' with DUP's controversial views on abortion &... X \nCopy link to paste in your message / Comments (2) \nA newly re-elected Devon Conservative MP has said he \"profoundly disagrees\" with the Democratic Unionist Party's views on abortion and LGBT rights. \nNorth Devon Tory MP Peter Heaton-Jones made his comments as his party continues discussions with the right-wing Northern Irish group, with the view of agreeing a 'confidence and supply' arrangement to help prop up a Conservative government. \nMr Heaton-Jones, who was re-elected last week with a majority of 25,517 votes, is not the first Conservative to voice concerns about the potential deal. \nFormer Prime Minister Sir John Major has today warned Theresa May against joining forces with the DUP, because he feels it could derail the Northern Ireland peace process. \nPeter Heaton-Jones, who was first elected as North Devon's MP in 2015 after beating Lib Dem Nick Harvey, made his comments in his first written piece for Devon Live and the North Devon Journal after being re-elected last week. \nHe described any potential deal with the DUP as an \"arrangement of convenience\" which he said would have \"absolutely no bearing on policy here\". \nHe said: \"As much as I was delighted with the result in North Devon, there's no point disguising the fact that the government did not achieve the national result we had hoped for. \n\"But let's reject this narrative that somehow the Conservatives 'lost' the election. We didn't. We achieved the most votes and the most seats (almost 60 more than Labour), and our leader was asked by the Queen to form a government. That adds up to a pretty good definition of winning an election. \n\"The arithmetic in the House of Commons will be challenging, but a so-called 'confidence and supply' agreement with the Democratic Unionists will provide stability. \n\"Let's be clear: this is nothing like a coalition; the DUP are not part of the government. I disagree profoundly with their views on many issues, especially LGBT rights and abortion, but those are devolved matters in Northern Ireland and will have absolutely no bearing on policy here. \n\"This is an arrangement of convenience, to let us get on with the business of governing in the national interest.\" \nREAD NEXT: Devon MP gets ministerial post in Theresa May's Cabinet reshuffle \nIn his piece Mr Heaton-Jones also offered thanks to the 25,517 North Devon residents who \"put their trust\" in him and said he felt \"humbled\" to be re-elected. \nHe said: \"But please be assured of this: I will represent everybody, whatever your political allegiance and however you voted. We may disagree on many things; I may not always vote the way you think I should in parliament or be able to achieve the outcome you want on a particular issue, but I will always work hard on your behalf. \n\"The election campaign was one of the strangest I've known. To start with it was unexpected, and none of us was really prepared. Then it was stopped in its tracks by two awful terror attacks that made everyone re-assess what's important in our democracy. And then when the results came through, they were not what the pollsters, politicians or most of the public had expected. \n\"Here in North Devon, I was determined to fight another clean, positive, forward-looking campaign. Once again I refused to react to negativity, half-truths or personal attacks. What disappoints me is that some parties still regard that style of campaigning as acceptable or effective. It's not. Perhaps after another defeat, they'll get the message. \n\"The same is true of social media. Too many people think insults and aggression are OK in today's digital discourse. They're not, and I won't ever engage with them. I believe in courtesy in politics, however much we may disagree. \n\"Broadly speaking this was a well-fought and good-humoured campaign in North Devon. Certainly the five hustings events I attended were quite rightly challenging, but also polite and constructive. It was good to see a healthy democracy in action.\" \nMr Heaton-Jones said there was plenty for him to do, and he made clear his priorities for North Devon. \nHe said: \"Nationally, Brexit is the obvious priority. The negotiations start next week. We have to get it right. I will fight to make sure that North Devon's concerns are reflected we get the best possible deal for our families, businesses and farming community. \n\"Locally, I'm very clear about the priorities. Many people on the doorsteps told me they were voting for me only on the condition that I fight hard on two issues in particular, and I will. \n\"Firstly, our hospital. My position is clear. There must be no cuts to any services at North Devon District Hospital in Barnstaple. I will do all I can, with the community, to fight our case and safeguard our NHS. \n\"Secondly, we need fairer funding for our schools. The current proposals do not address the historic unfairness that means too many of our children attend schools that don't receive their fair share of the funding cake. That cake needs to be bigger and it needs to be sliced more equally. Again, I will not give up on that fight. \n\"There is another issue too: the North Devon Link Road. In my 23 months as our local MP, things moved forward more quickly than they had in the previous 23 years. Devon County Council now has £1.5million of government money to draw up proper plans for major improvements. They are now asking for your views, and a series of public events and exhibitions start this weekend. Please have your say. After years of inaction, I'm determined to get this moving for the good of the whole North Devon economy. \n\"There are other challenges as well, both nationally and locally. But I am very optimistic about the future. North Devon is a fantastic place in which to live, work or retire, and I am honoured to have been re-elected as our Member of Parliament. Thank you again. I won't let you down.\" ", "external_links": [], "published": "2017-06-13T23:46:00.000+03:00", "crawled": "2017-06-13T20:56:05.009+03:00", "highlightTitle": ""}