{"organizations": [], "uuid": "07dc7df084a34c950ef068a11aace0aa978e0dbc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13137825.ece/ALTERNATES/s1200/rosskemp.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/ross-kemp-hit-labour-campaign-13137774", "country": "GB", "domain_rank": 21960, "title": "Ross Kemp to hit the Labour campaign trail in Sunderland on Monday", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-05T15:44:00.000+03:00", "replies_count": 0, "uuid": "07dc7df084a34c950ef068a11aace0aa978e0dbc"}, "author": "Sean Seddon", "url": "http://www.chroniclelive.co.uk/news/north-east-news/ross-kemp-hit-labour-campaign-13137774", "ord_in_thread": 0, "title": "Ross Kemp to hit the Labour campaign trail in Sunderland on Monday", "locations": [], "entities": {"persons": [{"name": "ross kemp", "sentiment": "negative"}, {"name": "julie elliot", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "ricky gervais", "sentiment": "none"}, {"name": "julie elliott", "sentiment": "none"}, {"name": "sean christopher cockburn", "sentiment": "none"}, {"name": "elliott", "sentiment": "none"}, {"name": "grant mitchell", "sentiment": "none"}, {"name": "peter kyle", "sentiment": "none"}, {"name": "kemp", "sentiment": "none"}], "locations": [{"name": "sunderland", "sentiment": "none"}, {"name": "bethany city church", "sentiment": "none"}, {"name": "hove", "sentiment": "none"}, {"name": "sunderland central", "sentiment": "none"}, {"name": "portslade", "sentiment": "none"}, {"name": "park lane interchange", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "negative"}, {"name": "bbc", "sentiment": "none"}, {"name": "sunderland central", "sentiment": "none"}, {"name": "daily mirror", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News See Ross Kemp campaigning for Sunderland Labour candidate ahead of general election The TV star and Labour member stopped for selfies as he hit the campaign trail with Labour's Sunderland Central candidate, Julie Elliott Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nSwapping Walford for Wearside Ross Kemp brought a touch of showbiz swagger to Sunderland’s election trail on Monday. \nStopping for selfies with people in the city centre, the former Eastenders man and lifelong Labour supporter turned some heads despite the miserable weather. \nAnd he wasn’t short of a political line either, admitting to having strong differences with his leader, Jeremy Corbyn , and blasting Theresa May for her record as Home Secretary. \nHe was in town to campaign alongside Julie Elliott, Labour’s candidate in the Sunderland Central seat, ahead of the general election on June 8. Ross Kemp joins Julie Elliott on her Sunderland Labour MP campaign around Sunderland (Photo: Newcastle Chronicle) \nMs Elliott, who has represented the seat since 2010, has a healthy majority but is fighting off a tough challenge from the Conservatives to retain the seat. \nMr Kemp, who found a second career fronting acclaimed documentaries primarily on gangs and military issues, accepted that this election might not be totally getting people’s attention. \nHe said: “The British electorate is tired of going to polling stations. \n“Apathy is dangerous. People fought for the right to vote. \n“This is the last election for five years but it’s as important as the EU referendum.” Read More Our picture of Jeremy Corbyn buying Big Issue at Newcastle station goes viral \nMr Kemp made a high profile foray into political debate last year when he recorded a video backing the Saving Labour campaign. \nSet up by the moderate wing of the Labour party, the group sought to sign up members in an attempt to oust Corbyn during the 2016 Labour challenge. \nHe said: “I’ve got nothing against him personally and, whether I agree with his politics or not, I support the leader. \n“I agree with the fundamentals of his politics because he is a socialist but I disagree with some things like military matters. \n“But I would obviously have him over Theresa May because he is closer to my outlook. \n“He would not be by first choice without a shadow of a doubt but he’s a straight talking chap and I accept that now is the time to pull ourselves together with an election coming.” \nMr Kemp also said he thought the British electorate were responding to Corbyn’s positioning as a political outsider. \nHe said: “As a country, we lean towards underdogs.” \nMs Elliott said that having a well-known figure on the campaign trail with her was a big boost a couple of days before the election. Read More General Election polling day 2017 - your complete election day and results night guide \nThe two were scheduled to speak at an event at Bethany City Church on Monday afternoon. \nMs Elliott also addressed the Brexit issue - 61% of people in the city backed Leave but Ms Elliott campaigned for Remain. \nShe said: “I was a Remain person but the day after the referendum I said I would get on with it and get the best outcome for Sunderland. \n“I don’t think a Tory will challenge their own party but I will challenge whoever is there - Labour or Tory.” \nMr Kemp, who has been campaigning with Labour candidates across the country, heaped praise on Ms Elliott’s work to save Sunderland’s fire station. \nHe said: “I only campaign with MPs I believe are good in their constituencies as well as in Westminster.” \nHe criticised Theresa May for shying away from TV debates and blasted her for her six years as Home Secretary, saying she was responsible for cutting security spending. \nMr Kemp: “You don’t cut funding into initiatives that go into these communities and that is what has happened. \n“That’s not the sole reason [for recent terror attacks] but everything we can do should be supported.” Ross Kemp joins Julie Elliott on her Sunderland Labour MP campaign around Sunderland stopping for pictures with the public on his way (Photo: Newcastle Chronicle) \nSix candidates will be contesting the Sunderland Central seat on June 8. They are: \nSean Christopher Cockburn (Independent)", "external_links": [], "published": "2017-06-05T15:44:00.000+03:00", "crawled": "2017-06-05T10:59:21.003+03:00", "highlightTitle": ""}