{"organizations": [], "uuid": "6b5292acc31348e5fc99643083b1f2988d5b2ecc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13162294.ece/ALTERNATES/s1200/£val.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/how-much-your-money-worth-13162095", "country": "GB", "domain_rank": 21960, "title": "How much is your money worth following the General Election result?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-09T17:42:00.000+03:00", "replies_count": 0, "uuid": "6b5292acc31348e5fc99643083b1f2988d5b2ecc"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/news/north-east-news/how-much-your-money-worth-13162095", "ord_in_thread": 0, "title": "How much is your money worth following the General Election result?", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "none"}, {"name": "michael metcalfe", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "general election", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}, {"name": "state street global markets", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "How much is your money worth following the General Election result? The pound has fallen in value and that could mean your holidays are more expensive Share Last night's General Election result saw the £'s value fall early on in trading Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThis morning’s shock election result has caused the value of the pound to plummet, meaning things could be about to get more expensive. \nThe shock General Election result , which has seen Theresa May’s Conservative Party lose its majority control in Parliament, is set to have wide reaching implications for residents of the UK. Including the value of their money. \nMajor political events , such as elections and referendums, can cause the value of currencies to rise or fall depending on what traders think of the country’s economic position. \nBut what has actually happened to our currency, and what does it mean for members of the public? \nSo what has happened to the value of the pound after the General Election? \nAs it become more clear that the Conservatives were going to lose its majority government the value of the pound plummeted. \nBy Friday morning Sterling was trading 2.3% lower against the US dollar at about $1.265. By 9am this had slightly increased to $1.2937. \nThe pound’s value also fell against the Euro, with £1 now worth around €1.13. A currency chart showing how the election result has affected the pound against the euro (Photo: XE Currency) What does this mean for me? \nThe most obvious impact this will have for members of the British public will be on the amount of foreign money they can get when travel abroad. Holiday goers will now receive less dollars or euros when they exchange them for pounds before travelling abroad. \nThis will mean your summer holiday could be more expensive. \nIt could also lead to things at home becoming more expensive. This is because many of the products we buy in shops are imported from overseas and paid for in other currencies. As the value of the pound falls these goods become more expansive for businesses to buy, and ultimately shoppers pay the difference. \nSome businesses that sell their goods overseas can benefit from the drop as their goods become cheaper overseas. So why did Sterling fall in value? \nUltimately, the value of the pound has fallen because investors and traders did not expect the Conservatives to lose their majority in Parliament. \nMichael Metcalfe, from investment firm State Street Global Markets, said: “Markets were poorly prepared for this surprise result in UK. \n“The approach to the potentially larger and more dangerous hurdle of Brexit will now surely be delayed. It is a shock that markets were not well prepared for, and in response sterling is likely to remain under pressure.” Read More \nMrs May had hoped to gain more seats in Parliament so that she could take charge of Brexit negotiations unhindered. \nNow that the Conservatives have lost their majority it is thought Brexit negotiations will be delayed. \nHowever, many business leaders are in favour of a softer Brexit and it could be this hope that is stopping the pound from plummeting further. When else has the value of the pound fallen? \nThe most recent major change in the value of the pound happened after the Brexit vote. After UK voted to leave the EU the value of the pound fell by 10% against the dollar. \nThe drop led to the biggest Sterling’s lowest value in 31 years. \nAlthough, the pound’s value has recovered slightly since then it has yet to return to spring back to its pre-Brexit price. Like us on Facebook ", "external_links": [], "published": "2017-06-09T17:42:00.000+03:00", "crawled": "2017-06-09T12:58:07.000+03:00", "highlightTitle": ""}