{"organizations": [], "uuid": "9eb865abd329c039cc529746d6d83a3c3b4696a1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13135549.ece/ALTERNATES/s1200/TMP_NEC_230517ArmedPolice06JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/number-armed-police-north-east-13143188", "country": "GB", "domain_rank": 21960, "title": "Number of armed police on North East streets falls dramatically", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-06T18:01:00.000+03:00", "replies_count": 0, "uuid": "9eb865abd329c039cc529746d6d83a3c3b4696a1"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/number-armed-police-north-east-13143188", "ord_in_thread": 0, "title": "Number of armed police on North East streets falls dramatically", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "dame vera", "sentiment": "none"}, {"name": "dame vera baird", "sentiment": "none"}, {"name": "tom watson", "sentiment": "none"}, {"name": "watson", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "northumbria", "sentiment": "none"}, {"name": "wales", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "grange villa", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "newcastle city centre", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "london bridge", "sentiment": "none"}], "organizations": [{"name": "itv news", "sentiment": "none"}, {"name": "northumbria police", "sentiment": "none"}, {"name": "armed police", "sentiment": "none"}, {"name": "northumbria constabulary", "sentiment": "none"}, {"name": "cancel play now  labour", "sentiment": "none"}, {"name": "home office", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Number of armed police on North East streets falls dramatically Theresa May faces criticism over cuts to armed police which has seen a drop in number of armed police Northumbria and Durham force areas Share Armed police mingle with shoppers in Newcastle City Centre (Photo: newcastle chronicle) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe number of firearms police officers in Northumbria and Durham has fallen dramatically since the Conservatives came to power, Home Office figure show. \nThere were 102 officers authorised to use firearms employed by Northumbria Constabulary in March 2010, but this was down to 98 by March 2016. \nAnd the number employed by Durham police fell from 81 to 56 in the same time period. \nIt means that between the two forces, the number fell from 183 to 154, a cut of more than 15 per cent. \nNorthumbria was one of nine forces in England and Wales to be given Home Office funding to increase the number of trained firearms officers last year. \nBut Conservative leader Theresa May faces criticism from Labour over police cuts, following the London Bridge terror attacks in which seven people were killed. \nShe was Home Secretary in charge of policing from 2010 until becoming Prime Minister last year. \nAnd Labour said that the threat from terror meant cuts to police numbers should be reversed. \nLabour leader Jeremy Corbyn called on her to resign as Prime Minister for allowing police numbers to fall. \nAsked by ITV News if he backed calls for Mrs May to resign, he said: “Indeed I would, because there’s been calls made by a lot of very responsible people on this who are very worried that she was at the Home Office for all this time, presided over these cuts in police numbers and is now saying that we have a problem - yes, we do have a problem, we should never have cut the police numbers.” \nHe later said that the opportunity to remove Theresa May was Thursday’s election. Armed Police in Grange Villa, Co Durham (Photo: Newcastle Chronicle) \nTom Watson, Labour’s deputy leader, urged the Prime Minister to promise to increase police numbers. \nHe said: “There is an urgent requirement for more armed response teams in our policing service.” \nMr Watson added: “To be clear, nobody is saying that police cuts caused this attack. But the last thing we need at a time of heightened threat is an overstretched police force. \n“Even today, Ministers are seeking to justify cuts to armed officers by pointing to the need for the government to make ‘very difficult decisions’. Cutting armed officers may have been a difficult decision. I think it’s now time for Theresa May to acknowledge that it was the wrong decision.” \nThe Prime Minister used a campaign speech in London to focus on Brexit and the economy, but was repeatedly pressed over whether she would reverse the cuts to police numbers since 2010. Read More How voting in the general election can get you a free pint in Newcastle \nMrs May said that since 2015 police budgets had been protected “despite the fact that Jeremy Corbyn’s front bench suggested that police budgets should be cut by up to 10%”. \nShe added: “It is also about the powers you give to the police and I have been responsible for giving the police extra powers to deal with terrorism. \n“Jeremy Corbyn has boasted that he has opposed those powers and opposed the powers for anti-terror actions throughout his time in parliament. \n“And I also support, absolutely, shoot-to-kill and I think what we saw on our streets on Saturday was how important that was.” Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nLabour’s plan to increase police numbers by 10,000 nationwide have been welcomed by Northumbria Police and Crime Commissioner Dame Vera Baird. \nIn a statement last month, she said: “Since 2010, Northumbria has lost 898 police officers and has had to make in excess of £120m in savings, from cuts and efficiencies, to offset reductions in government funding over the same period. Ring fencing an already slashed budget won’t help Northumbria.” \nDame Vera added: “Putting 10,000 extra police officers on the street nationally would be greatly welcomed, as our share here in Northumbria would make a real difference. Neighbourhood policing is under increasing pressure as officers are having to be deployed elsewhere to tackle issues like cyber-crime and sexual exploitation of the vulnerable – funding specifically to replenish our neighbourhood teams would be timely.” Read More", "external_links": [], "published": "2017-06-06T18:01:00.000+03:00", "crawled": "2017-06-06T13:08:02.010+03:00", "highlightTitle": ""}