{"organizations": [], "uuid": "caf5814286d2fd9e65b998fde321e8fe7f3f2b38", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13226978.ece/ALTERNATES/s1200/BP898368.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13222189", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Watchdog clamps down on online gambling sites", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-23T15:25:00.000+03:00", "replies_count": 0, "uuid": "caf5814286d2fd9e65b998fde321e8fe7f3f2b38"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13222189", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Watchdog clamps down on online gambling sites", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "jonathon manning", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "competition and markets authority", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KEY EVENT Balfour Beatty claims top prize at the CIPD North East HR&D Awards \nSome of the top human resources and development professionals in the region have been recognised with prizes at the CIPD North East’s annual awards . \nBalfour Beatty, Your Homes Newcastle and Home Group were among the big winners at the event, which took place last night at the Marriott Hotel at Gosforth Park. \nThe event, which was delivered in association with The Journal and associate sponsors Nigel Wright Recruitment, featured seven categories celebrating the best work in the region in areas including learning and development, health and wellness, and diversity. \nThe big prize for HR&D Team of the Year was won by construction company Balfour Beatty, which was praised for its work in transforming the company’s internal structures to produce a more simplified organisation. \nOther winners included Coveris Rigid, which has bases at Chester-le-Street and Stanley, and claimed the prize for Excellence in People Development. \nThe University of Sunderland won the Excellence in Health and Wellness Award, Your Homes Newcastle took the prize for Excellence in Employability and Diversity, while Home Group took the Excellence in Resourcing and Talent Management category. \nAll Together Better Sunderland won for Excellence in Organisational Development and Newcastle technology group Performance Horizon took the award for HR&D Excellence in SMEs. \nDawn Robinson, who is global HR director at Nomad Digital, won the prize for Inspirational Practioner 2017. \nThe awards heard from CIPD organisation’s North East co-chairs Sarah Carnegie and Elouise Leonard-Cross. \nMs Carnegie said: \nI think too often HR are cast as the organisational grown ups, the naysayers, stuck with a vocabulary of can’t, don’t, shouldn’t. \nWouldn’t it be positive to shift to more: why not, yes we can, and if you’re anything like Elouise and I, what colours can we do it in and is there a glitter version. So tonight we want to focus on unleashing some of your creativity. \nWe have to acknowledge that it is not easy to be creative as every day we are bombarded with information through social media, television, film, news; meaning that we spend all our time just consuming rather than creating. So it is difficult to just stop and do things that are original, imaginative and creative. The CIPD Awards at the Gosforth Marriot Hotel (Photo: newcastle chronicle) 9:07 KEY EVENT Newcastle's first cosplay and video game café could be coming to Grainger Street \nA cosplay and video game café could soon opening its doors in Newcastle, bringing dragons, warriors and superheroes to the city’s streets. \nSophie Stephenson is planning to open the city’s first video game and costume shop, ARCAdium, after launching a crowdfunding campaign for the business. \nCosplay, the art of making, designing and wearing costumes based on fictional characters, is becoming increasingly popular with the rise in comic book conventions. \nMs Stephenson, 25, has been making her own costumes based on video game characters for a number of years. She has shown off her creations at conventions in London and video game competitions at Wembley. \nCommenting on her Kickstarter campaign, Ms Stephenson said: \nThere is only one gaming cafe that is big in the UK, and they are only offering the gaming side of things. But you find if people are into the gaming side, they are into cosplay. \nWhat I want to create is an environment where both come together. \nARCAdium will be split into an downstairs gaming room with 12 high-spec computers that allow customers to compete against each other in teams of up to six players. Customers will be charged by the hour to use the machines. \nUpstairs the premises will be split into a café and “The Armoury”, a cosplay workshop where staff can sell costumes, jewellery, and custom made outfits. It will also be used to host classes for those wanting to learn new skills. \nAlthough the hobby can be expensive, Ms Stephenson plans to make it accessible to everyone who wants to join in. \nShe added: \nWe would offer several different versions of each design. So low budget, medium budget and high budget. Cosplayer Sophie Stephenson is looking to launch a cosplay and video game cafe in the centre of Newcastle (Photo: Twitter) 9:02 Jonathon Manning Clyde & Co poaches five-lawyer team from Eversheds including former Newcastle senior partner \nClyde & Co has poached a team of senior lawyers from rival firm Eversheds Sutherland, including the firm’s former Newcastle senior partner. \nPartners Stephen Mackin and Jessica Maitra will join Clydes’ marine insurance team from Eversheds along with a team of three lawyers. \nThe pair have spent the majority of their careers at Eversheds with former senior partner Mr Mackin working at the firm for 25 years. Ms Maitra spent 18 years at Eversheds. \nThe five-lawyer team specialises in shipping and energy work, particularly related to transporting liquid cargo such as oil, chemicals and gas. Their clients include ship-owners, charterers, insurers and cargo owners. \nCommenting on the hires Andrew Preston, partner at Clyde & Co, said: \nWe’re delighted to welcome Stephen, Jessica and their team to Clyde & Co. They have a proven track record in the marine industry and have built a very successful practice in Newcastle where they have a range of blue chip clients. \nStephen has also proved adept at leading, managing and nurturing the team. \nBefore qualifying as a solicitor Mr Mackin was a navigating officer with Shell Tankers Limited. \nMr Mackin added: \nI look forward to joining Clyde & Co as it has a long and successful track record in the marine sector. It is a firm with strong global network and focus on other core sectors that intersect with ours; especially energy and insurance. \nThis will help us build the practice further and respond to the changing nature of the marine industry. Jessica Maitra joines Clyde & Co as a partner after working at Eversheds for 18 years, whilst Eversheds Newcastle senior partner Stephen Mackins has also left to join Clyde & Co 8:57 Jonathon Manning Facebook to educate charities about countering hate speech \nFacebook has revealed new plans to tackle extremism by educating charities and other organisations on how to counter hate speech. \nThe social media giant has launched the Online Civil Courage Initiative (OCCI), which the firm said would act as a forum for charities and other non-profit organisations to share their experiences of extremism and develop “best practices” to tackle the issue both on and offline. \nThe initiative’s founding partners include the Jo Cox Foundation, set up in memory of the murdered MP, as well as other anti-hate groups from the Jewish and Muslim communities. \nThe OCCI will be used as a way to share experiences on facing hate speech and extremism, Facebook said, with the aim of the scheme to create awareness campaigns and better “counterspeech” to tackle extremism. \nInternet companies have come under increased scrutiny from the Government over their role in the spread of hate speech. Home Secretary Amber Rudd said the Government was “not frightened” to issue sanctions to firms who failed to remove extreme material. \nFacebook’s chief operating officer Sheryl Sandberg said of the company’s practices: \nThere is no place for hate or violence on Facebook. \nWe use technology like AI to find and remove terrorist propaganda, and we have teams of counterterrorism experts and reviewers around the world working to keep extremist content off our platform. \nPartnerships with others - including tech companies, civil society, researchers and governments - are also a crucial piece of the puzzle. \nThe UK Online Civil Courage Initiative will support NGOs and community groups who work across the UK to challenge the extremist narratives that cause such harm. \nWe know we have more to do, but through our platform, our partners and our community we will continue to learn to keep violence and extremism off Facebook. \nThe OCCI has already launched in Germany and France, and is being supported by the Institute for Strategic Dialogue, who said it would help the scheme mobilise “innovative technology together with expert knowledge” to counter the spread of hate speech. \nFiyaz Mughal, founder of Tell Mama, which works to tackle anti-Muslim hatred and is an OCCI founding partner, said: \nThis initiative is much needed given that a vast amount of material online may be insulting and sometimes inflammatory, though it may not cross a legal threshold for action. \nThis means that civil society mobilisation is needed as counter-speech to tackle such texts, language and ideologies. \nThis is one tool in challenging motivations and ideologies that seek to divide us and to marginalise people as though they are not part of our country. \nWe are in a battle for hearts and minds and this initiative is one tool in mobilising the enormous force for good that is in communities. (Photo: Carl Court/Getty Images) Jonathon Manning European central bank bid to boost Europ clearing oversight adds to Brexit fears \nThe European Central Bank has put forward proposals that would enhance its oversight over euro clearing, adding to fears that London is set to lose its grip on the multibillion pound market following Brexit. \nThe ECB has tabled a prospective legal amendment that would give it a “significantly enhanced” role in regulating the lucrative market, which settles business and trade conducted in the EU currency. \nThe amendment would provide the ECB with “clear legal competence” in the area of central clearing, which is currently dominated by London firms such as LCH. \nThe ECB said: \nThese powers include a significantly enhanced role for central banks of issue in the supervisory system of central counterparties (CCPs), in particular with regard to the recognition and supervision of systemically important third-country CCPs clearing significant amounts of euro-denominated transactions. \nIt added that the change will allow “the Eurosystem” to monitor and address risks associated with central clearing activities that could affect the conduct of “monetary policy, the operation of payment systems and the stability of the euro”. \nThe move comes after the European Commission put forward legislative reforms that would impose stricter supervision of the bloc’s derivatives market and could force operators to leave London as a result of Brexit. \nEU institutions and member states had raised concerns over the fact up to 75% of euro-denominated interest rate derivatives are currently cleared in the UK, which will no longer be supervised by EU regulators once it leaves the bloc. \nThe head of Frankfurt Main Finance, the German city’s lobby group, has recently said that euro clearing businesses are already moving accounts to the country. The recommendation has been sent to the European Parliament and the Commission will issue an opinion on it, the ECB said. The Union flag and the EU flag flying (Photo: PA) 8:47", "external_links": [], "published": "2017-06-23T15:25:00.000+03:00", "crawled": "2017-06-23T10:39:56.023+03:00", "highlightTitle": ""}