{"organizations": [], "uuid": "6aa102cebe0b850eaa98bb9c6471331e4723e28c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article9061334.ece/ALTERNATES/s1200/JS61429791.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/ukip-voters-turn-tory-eat-13117385", "country": "GB", "domain_rank": 21960, "title": "UKIP voters to turn Tory and eat into Labour's North East heartland, political experts claim", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-04T15:00:00.000+03:00", "replies_count": 0, "uuid": "6aa102cebe0b850eaa98bb9c6471331e4723e28c"}, "author": "Laura Hill", "url": "http://www.chroniclelive.co.uk/news/north-east-news/ukip-voters-turn-tory-eat-13117385", "ord_in_thread": 0, "title": "UKIP voters to turn Tory and eat into Labour's North East heartland, political experts claim", "locations": [], "entities": {"persons": [{"name": "tory", "sentiment": "negative"}, {"name": "cohen", "sentiment": "none"}, {"name": "paul nuttall", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "nigel farage", "sentiment": "none"}, {"name": "jonathan arnott", "sentiment": "none"}, {"name": "nuttall", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "auckland", "sentiment": "none"}], "organizations": [{"name": "ukip", "sentiment": "negative"}, {"name": "labour", "sentiment": "negative"}, {"name": "general election", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News UKIP voters to turn Tory and eat into Labour's North East heartland, political experts claim Those with a close eye on the General Election polls feel many who voted for UKIP in 2015 with side with Theresa May's party on June 8 Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe UKIP vote in the North is all but dead in the water - with voters poised to switch to Tory. \nLess than a year after the controversial party claimed victory following the Brexit vote, it has fallen into disarray and is expected to struggle to hold onto votes on June 8. \nAnd those keeping a close eye on the polls think the snap election could be the beginning of the end of UKIP and good news for the Conservatives. Read More How the North East political map would change if UKIP voters side with Theresa May \nDr Gidon Cohen, an associate professor in politics at Durham University, has studied political activism and voting patterns in depth. \nHe thinks UKIP’s rise across the North East, which saw the party coming second or third in a number of seats across the area last time out, was down to two things - working class Tory voters and non-voters. UKIP MEP Jonathan Arnott with candidates during a press call at Sunderland Fish Quay. \nHe said: “The first place the UKIP vote came from was from non-Labour voters. The party picked up votes from working class Conservative voters. “They saw UKIP as a possible credible opposition. Now that is no longer the case they are likely to go back to the Conservatives. \n“One of the effects of the rise of UKIP in the North East was it made some Labour safe seats even less competitive. It left other parties, including themselves, nowhere near. The opposition were left trailing well behind Labour. \n“A lot of UKIP votes had come from people who had never voted before, and that vote is not likely to hold up.” Read More Bishop Auckland constituency General Election 2017 - candidates and the history of the seat \nThe party has been under fire since Nigel Farage’s departure as leader following the Brexit vote. \nHe was replaced by Paul Nuttall, who failed to attract more than a quarter of voters at the Stoke-on-Trent Central by election. \nMr Nuttall was criticised in February over false claims he lost “close friends” in the 1989 Hillsborough tragedy. Ukip leader Nigel Farage speaks at a Brexit rally at the Sage \nDr Cohen said: “All the signs point to the UKIP vote failing to hold up. There’s been a lot of internal turmoil, and there is a long term existential question for them over what they as a political party stand for after Brexit. \n“The position they’re in, they’re not making themselves an appealing mainstream political party.” Read More \nA UKIP spokesman hit back at the claims and said it was “absolute nonsense” that UKIP would see huge loses in the region. \n“The votes won’t drop off as much in urban areas as in rural areas,” he said. \n“That’s not what we’re hearing on the doorsteps \n“I think our vote is resilient and growing, Labour will still get votes and will still get seats but the party is not representing working class people anymore.” Read More", "external_links": [], "published": "2017-06-04T15:00:00.000+03:00", "crawled": "2017-06-04T10:15:53.002+03:00", "highlightTitle": ""}