{"organizations": [], "uuid": "86040784c685305ef4753caed27a31d092bd210d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article13240247.ece/ALTERNATES/s1200/General-Election-2017-aftermath.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/theresa-signs-1bn-deal-dup-13240013", "country": "GB", "domain_rank": 21960, "title": "Theresa May signs £1bn deal with the DUP to stay in power - but critics call her 'desperate'", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-26T20:24:00.000+03:00", "replies_count": 0, "uuid": "86040784c685305ef4753caed27a31d092bd210d"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/theresa-signs-1bn-deal-dup-13240013", "ord_in_thread": 0, "title": "Theresa May signs £1bn deal with the DUP to stay in power - but critics call her 'desperate'", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "wansbeck", "sentiment": "none"}, {"name": "ian lavery", "sentiment": "none"}, {"name": "lavery", "sentiment": "none"}, {"name": "arlene foster", "sentiment": "none"}, {"name": "catherine mckinnell", "sentiment": "none"}, {"name": "mrs foster", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}], "locations": [{"name": "northern irela", "sentiment": "none"}, {"name": "downing street", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}], "organizations": [{"name": "dup", "sentiment": "negative"}, {"name": "house of commons", "sentiment": "none"}, {"name": "newcastle north", "sentiment": "none"}, {"name": "democratic unionist party", "sentiment": "none"}, {"name": "tories", "sentiment": "none"}, {"name": "queen’s speech", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nTheresa May has agreed a £1bn deal with the Northern Ireland Democratic Unionist Party (DUP) to allow the Conservatives to stay in power. \nIt involves giving Northern Ireland an extra £1bn in Government funding, with the extra cash to be spent on hospitals, schools and roads in the region. \nMrs May has also ditched plans to scrap the triple pensions lock and to means-test winter fuel allowance. \nDUP leader, Arlene Foster, said she was “delighted” an arrangement had been agreed. \nAnd the Prime Minister said the DUP and the Tories “share many values” and the agreement was “a very good one”. \nBut Labour chair Ian Lavery, MP for Wansbeck, said the deal “just shows how desperate” the Conservatives had become. \nHe said: “Instead of clinging on to power, the Tories should let Labour form a Government, which is what people want.” \nAnd Newcastle North MP Catherine McKinnell said: “Nobody doubts Northern Ireland needs the investment ... but so do regions like ours.” Prime Minister Theresa May greets DUP leader Arlene Foster (Photo: PA) \nThe deal means the 10 DUP MPs in the House of Commons will support the Government on key votes including the Queen’s Speech, the Budget, finance bills and other legislation. \nMrs May needs their support to be certain of winning the votes, following the General Election that left her without a majority. \nIt would be impossible to govern if the Queen’s Speech or Budget was voted down. \nHowever, the two parties have stopped short of forming a full coalition, as the Conservatives did with the Liberal Democrats in 2010. Instead, they have agreed what is known as a “confidence and supply” arrangement. \nSpeaking outside Downing Street, Mrs Foster said a £1.5bn funding package for Northern Ireland has been secured as part of the deal. \nFigures published by Downing Street set out how £1bn will be spent to boost the region’s economy and invest in new infrastructure, health, education and other sectors. \nThe financial package includes: \n• £400m over two years for infrastructure development including a major road scheme \n• £150m over two years for ultra-fast broadband \n• Creating “city deals” across Northern Ireland \n• £100m over five years to reduce poverty \n• £100m over two years to deal with immediate pressure on health and education \n• Another £200m over two years to reform health services \n• £50m over five years for mental health. \nUK-wide, the pensions triple lock will also stay in place and there will be no means-testing of winter payments, under the arrangement. \nSpeaking in No 10, Mrs May said: “As we set out at the beginning of the talks, we share many values in terms of wanting to see prosperity across the UK, the value of the union, the important bond between the different parts of the United Kingdom. \n“We very much want to see that protected and enhanced and we also share the desire to ensure a strong government, able to put through its programme and provide for issues like the Brexit negotiations, but also national security issues. \n“So the agreement we have come to is a very, very good one, and look forward to working with you.” \nMrs Foster said: “We’re delighted that we have reached this agreement, which I think works, obviously, for national stability. \n“In terms of the Northern Ireland Executive, of course we are determined to see it back in place as soon as possible as well, because we believe we need a strong voice for Northern Ireland when dealing not least with the Brexit issue.” \nMr Lavery, Labour’s joint election co-ordinator as well as the party chair, said the deal was an act of desperation and Labour was ready to take power. Read More \nHe said: “Getting the support of MPs in return for giving Northern Ireland a cash sum is in my view nothing short of political bribery. \n“It just shows how desperate the Conservatives are to cling on to power. \n“People across the country are very warming to the fact that we might have a Labour government in the not too distant future, and people are hoping that will be the case. \n“We are ready and waiting to form the next Government. \n“But there is a coalition of desperation and a coalition of political bribery in the House of Commons now, which I think will be very fragile.” Like us on Facebook", "external_links": [], "published": "2017-06-26T20:24:00.000+03:00", "crawled": "2017-06-26T15:45:10.003+03:00", "highlightTitle": ""}