{"organizations": [], "uuid": "e0a114cbcabc3dc40989089be7340965caa80f22", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/30381119/16037438.jpg", "site_section": "http://www.thisisleicestershire.co.uk/specialolympics/rss.html?chid=181121", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/leicester-business-leaders-react-to-election-result/story-30381119-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "Lauren_Mills published Leicester business leaders react to election result", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-09T20:33:00.000+03:00", "replies_count": 0, "uuid": "e0a114cbcabc3dc40989089be7340965caa80f22"}, "author": "Lauren_Mills", "url": "http://www.leicestermercury.co.uk/leicester-business-leaders-react-to-election-result/story-30381119-detail/story.html", "ord_in_thread": 0, "title": "Lauren_Mills published Leicester business leaders react to election result", "locations": [], "entities": {"persons": [{"name": "simon gibson", "sentiment": "none"}, {"name": "mehmooda duke", "sentiment": "none"}, {"name": "sean moran", "sentiment": "none"}, {"name": "richard osborn", "sentiment": "none"}, {"name": "david cameron", "sentiment": "none"}, {"name": "boris", "sentiment": "none"}, {"name": "theresa", "sentiment": "none"}, {"name": "rik pancholi", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "john mcdonnell", "sentiment": "none"}, {"name": "jermy corbyn", "sentiment": "none"}, {"name": "scott knowles  scott knowles", "sentiment": "none"}, {"name": "moosa duke", "sentiment": "none"}, {"name": "gibson", "sentiment": "none"}, {"name": "leicestershire  chris white", "sentiment": "none"}, {"name": "john major", "sentiment": "none"}, {"name": "mattioli woods", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "pete miller", "sentiment": "none"}, {"name": "geoff rowe  geoff rowe", "sentiment": "none"}, {"name": "mike kirsopp", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "nick oakland", "sentiment": "none"}, {"name": "boris johnson", "sentiment": "none"}, {"name": "shakespeare martineau", "sentiment": "none"}], "locations": [{"name": "leicester", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "east midlands", "sentiment": "none"}, {"name": "east midlands chamber", "sentiment": "none"}], "organizations": [{"name": "commen", "sentiment": "negative"}, {"name": "tory", "sentiment": "none"}, {"name": "tories", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "miller partnership", "sentiment": "none"}, {"name": "oakland", "sentiment": "none"}, {"name": "big difference company", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "weightmans", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "hinckley & rugby building society", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "jc metalworks", "sentiment": "none"}, {"name": "cambridge & counties bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Leicester business leaders react to election result By Lauren_Mills | Posted: June 09, 2017 0 COMMENTS SHARES Leicester business leaders react to election result X \nCopy link to paste in your message / \nBusiness leaders are calling for the swift formation of a stable, workable administration that can restore confidence, given Brexit negotiations due to start in 10 days. \nScott Knowles \nScott Knowles, chief executive of East Midlands Chamber, said: \"Business in the East Midlands has been doing its best to carry on doing what it does so well – creating jobs and wealth - despite the upheaval arising from two General Elections and the EU Referendum in the past two years and the impact they have had on confidence and markets. \n\"But this morning's news that we are to have a hung Parliament, yet more uncertainty and a weakened position for negotiating Brexit, will leave many wondering what comes next. \n\"Business can't continue to grapple with currency fluctuations, rising costs and the potential impacts of Brexit. \n\"The business community needs political stability, which has been sadly missing over the past two years, so that it can continue to invest with confidence in innovation, research and development, staff, training, property and plant. This result will prove much harder for UK businesses to ignore. \n\"The swift formation of a workable administration that can restore business confidence, particularly with Brexit negotiations due to formally start in just 10 days, must be the immediate priority.\" \nRead more: Full general election 2017 results in Leicester and Leicestershire \nChris White, chief executive of Hinckley & Rugby Building Society, said a hung parliament that stops the ruling party talking tough on a hard Brexit is\" probably good for the markets and the economy in the long run\". \nHe added: \"But equally, the uncertainty that will follow such an unclear outcome is probably bad for the markets and the economy in the short term. \n\"The Conservatives hanging on by their fingertips to power but kept 'honest' by Labour might yet be a good formula for Brexit negotiations but it is not without its risks.\" \nGeoff Rowe \nGeoff Rowe, chief executive of Big Difference Company, said: \"I'm not sure what will unfold over the next few hours and days but the election process has clearly not done Theresa May or the Conservative party many favours. \n\"I'm just not sure how Theresa can remain as leader although I'm not sure what alternatives exist; would anyone really want Boris as leader? \n\"Which leads us to Labour and Jeremy Corbyn who could offer a valid government if they manage to secure support from other parties. \n\"From what I've heard so far Labour are sitting quietly and waiting to see what moves the Tories will make. As the last day has once again shown 24 hours can be a long time in politics so we'll wait and see what happens.\" \nRichard Osborn, partner and regional office head at law firm Weightmans, said: \"What business needs is stability and this election outcome provides anything but that. \n\"At the rate of change in politics at the moment I suspect that there will have been many further developments by the time that this comment is read. \n\"I am not sure that Theresa May's position is tenable - her gamble has backfired. \n\"Even if she can form a government, she would not have a strong mandate so I can see another election in the next few months as being inevitable. \n\"However people voted in the European Referendum, there is no doubt that all of this uncertainty has been caused by that Brexit vote, so hope it is not one that the country is going to regret. \n\"Whatever happens and however a government is formed, it has to have stability for British business at the forefront of its policies.\" \nSean Moran, a partner at Shakespeare Martineau, said: \"I think that any uncertainty is bad for business confidence. That combined with the Brexit negotiations beginning in 10 days means that Theresa May should remain as Tory leader and seek to form a coalition at the earliest opportunity. We need to maintain a firm negotiating stance in our negotiations with the EU members although the focus should be on achieving the best long term deal for the UK which should mean a soft Brexit. \n\"She retains a mandate as the leader of the largest party in Parliament but has to consider the clear message from the electorate that her party's campaign was not well received and depending on the progress made in the next six months by any coalition she forms we may be looking at another election in early 2018. \n\"I cannot see how Corbyn could form a coalition with the vote share he has and the fact the other parties are unlikely to want to work with Labour. I do not think business would have confidence in John McDonnell as Chancellor or Labour in general when it comes to running the economy.\" \n‎Mike Kirsopp, chief executive of Cambridge & Counties Bank, said: \"The challenge for business is that it faces another period of uncertainty. \n\"Investment decisions will need to be made against a backdrop of not knowing the implications for Brexit and the forthcoming negotiations. \n\"It is likely we will face another election in the coming months as the politicians struggle to gain stability.\" \nLeicester-based tax expert Pete Miller of The Miller Partnership, said: \"On the tax front, which is my main interest, I think it leads to an interesting next few months. \n\"A large number of complex measures were dropped from the Finance Bill before the election. If the Tories had got a majority, we could expect them all to come back later in essentially the same form. But the fact that we may have some kind of coalition means that there may be some changes to comply with policies of other parties. \n\"So we have an extended period of uncertainty in the operation of the tax system in some pretty important areas, which cannot be good for business. It will especially worrying for business that operated on the basis of a promise that certain new rules would apply from 1 April 2017. \n\"Speaking politically, I don't see how Theresa May can stay as leader of the party and the country, having gambled from a seemingly unassailable position and lost badly. She ran an awful campaign, hid from voters and pundits and basically showed the UK public that they cannot trust her to be open and honest, let alone strong and stable. \n\"I cannot imagine who could sensibly replace her. If they elect Boris Johnson it'll be political suicide, in my view.\" \nNick Oakland, chief executive of Loughborough-based JC Metalworks, said: \"I have to say the result is extremely disappointing as yet again we find ourselves in a situation where there is no clear direction. \n\"I think Theresa May massively underestimated the depth of feeling in the general public about the key issues which let Labour into the race. \n\"From a business perspective, I am concerned as we look like entering another holding pattern where no one can really say what happens next. Our economy isn't in bad shape and from a JC perspective we are seeing a pretty buoyant market. We don't want a period of instability to put a stop to that progress. \n\"I don't think coalition was a great success last time and personally I'm not in favour of going down that route again. The concern I have is we need a majority party to help push through the challenges we have in front of us over the next few years. On saying that I think the Conservatives should form a government and get on with trying to find a way through this mess.\" \nMr Oakland said the option of Jermy Corbyn attempting to form a Government was \"the worst possible outcome for business\". \n\"I honestly don't feel the Labour party is business of personal friendly if you earn above a certain wage bracket in terms of taxes. They made some very bold statements about increasing spend but not many about where the money is coming from.\" \nRik Pancholi, the founder of Pattersons Commercial Law, said: \"Theresa May called the snap election to strengthen her hand at the Brexit negotiations because she felt she needed a larger majority. The gamble didn't pay off and inadvertently what this election has done is compounded the uncertainty of the current economic and political climate. \n\"Theresa May could have done more to win the election if she hadn't taken a win for granted. Jeremy Corbyn on the other hand has managed to bring a level of energy which was unexpected and has come across quite resilient. Labour seems to be a stronger party and far more organised than they were in the last election. \n\"Any new Government needs to get their act together very quickly. Whether this means a coalition or the Conservatives ploughing ahead with a minority Government will depend on Theresa May's attitude towards this election result. \n\"The Government will have the difficult task of balancing stability, trying to obtain the best possible Brexit deal which makes it attractive to do business in the UK and how to make the UK a safer place to live.\" \nMehmooda Duke, managing director of Moosa Duke solicitors, said: \"Europe always seems to be the 'rock' which Conservative leaders crush their careers on whether it's Sir John Major, David Cameron and now perhaps, Mrs May. \n\"Throughout the election the business voice seemed strangely side-lined and at times, policies seemed either hostile towards those who create jobs or just unhelpful through a lack of real understanding. I hope that changes and whatever happens Government will listen carefully to the views of professionals. \n\"Minority governments need to tread more carefully. \n\"I do worry some government policies are just insensitive and right now, will prevent the people I represent (innocent victims injured by blunders within hospitals or surgeries) from getting specialist, professional legal support and assistance. \n\"Why? Because Government is failing to listen to us about how they can make changes and reforms, save money and avoid adding further upset and misery to NHS patients who have suffered through no fault of their own. Proceeding without the sector's advice would be another blunder.\" \nSimon Gibson, chief investment officer for Mattioli Woods, said the outcome of the ballot had created \"inherent uncertainty\" just days before the Brexit talks were due to begin. \nHe said: \"The result does pose the intriguing possibility of a 'softer' Brexit. This may well provide reassurance to the markets, prevent a much more serious fall in currency (the pound has fallen around two per cent against the dollar and the Euro) and potentially make UK assets more attractive to investors. \n\"It is already possible to detect a more measured tone on Brexit from some Conservatives and the prospect of remaining in the single market could entice some investors back to UK assets\". \nMr Gibson said the equity market would inevitably re-rate some domestically focused companies on grounds of political stability and, if not for the ongoing issue of Brexit, it would be \"reckless to pretend that a hung parliament was a remotely market-friendly outcome, perhaps especially in the medium term\". \nMattioli Woods, he said, had gone into the election cautious both on the UK and markets in general. \n\"I think this leaves us well placed to weather such developments. Concerns over Brexit and the UK economy meant that we have been underweight UK equities for some time,\" he explained. \n\"Although we have a conceptual preference for small cap names even these, in common with their large cap peers, derive substantial portions of their revenues from overseas and so sterling weakness can even be helpful. \n\"Though the direction of sterling is difficult to be sure of, such developments demonstrate the importance of whether we should 'hedge' foreign currency exposure in portfolios, again something which we analyse on an ongoing basis\". \nMr Gibson stressed: \"Agility is going to be important here, as anything which affects the tone of Brexit negotiations and the trajectory of sterling will be of relevance to how investors approach the UK. \n\"This sort of political development is yet another reminder of the importance of diversification and of exercising caution in markets where so many investors have become blasé in their approach to risk. Our new perspective on asset allocation looks really helpful right now\". \nMark Esho, founder of Easy Internet Solutions, said: \"A hung parliament creates uncertainty and creates instability within money markets which is bad for business. For example, we pay most of our suppliers in foreign currencies. Since Brexit happened, our costs of gone up by 15 per cent.\" \nHe added: \"I stiil believe she is the best person for the job and will hopefully be able to create a sustainable coalition with the DUP to push forward the conservative election agenda. \nAs for Mr Corbyn, Mr Esho said: \"I honestly think Corbyn is anti-business and this will ultimately lead to the loss of jobs for many people. \n\"If Labour had won a majority, I planned to put all recruitment on hold and find ways to cut costs due to the extra burden on both the business and personal finances.\"", "external_links": [], "published": "2017-06-09T20:33:00.000+03:00", "crawled": "2017-06-09T16:31:26.000+03:00", "highlightTitle": ""}