{"organizations": [], "uuid": "6f083524ade8e95b2b3952bef5bef65535d6aaa5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article13169329.ece/ALTERNATES/s1200/General-Election-2017-aftermath.jpg", "site_section": "", "section_title": "", "url": "http://www.chroniclelive.co.uk/news/north-east-news/sunday-politics-round-up-corbyn-13169228", "country": "GB", "domain_rank": 21960, "title": "Sunday politics round-up: Corbyn on the march, May hanging by a thread and Tories in civil war - Chronicle Live", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2017-06-11T19:21:00.000+03:00", "replies_count": 0, "uuid": "6f083524ade8e95b2b3952bef5bef65535d6aaa5"}, "author": "Sean Seddon", "url": "http://www.chroniclelive.co.uk/news/north-east-news/sunday-politics-round-up-corbyn-13169228", "ord_in_thread": 0, "title": "Sunday politics round-up: Corbyn on the march, May hanging by a thread and Tories in civil war - Chronicle Live", "locations": [], "entities": {"persons": [{"name": "corbyn", "sentiment": "negative"}, {"name": "andrew neil", "sentiment": "none"}, {"name": "johnson", "sentiment": "none"}, {"name": "fiona hill", "sentiment": "none"}, {"name": "anna soubry", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "boris", "sentiment": "none"}, {"name": "andrew marr", "sentiment": "none"}, {"name": "richard hammond", "sentiment": "none"}, {"name": "marr", "sentiment": "none"}, {"name": "george osborne", "sentiment": "none"}, {"name": "michael hesseltine", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "nick timothy", "sentiment": "none"}, {"name": "nicky morgan", "sentiment": "none"}, {"name": "michael fallon", "sentiment": "none"}, {"name": "boris", "sentiment": "none"}, {"name": "theresa", "sentiment": "none"}, {"name": "boris johnson", "sentiment": "none"}, {"name": "peston", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "twitter", "sentiment": "none"}], "organizations": [{"name": "abb", "sentiment": "none"}, {"name": "bbc", "sentiment": "none"}, {"name": "bcc", "sentiment": "none"}, {"name": "defence", "sentiment": "none"}, {"name": "eu court", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "itv", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "sinn fein", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "dup", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nEver since the general election result became clear, the political landscape has gone into meltdown. \nWe’ve entered one of those ‘blink-and-you’ll-miss-something’ phases, with resignations and major interventions cropping up every hour. \nTheresa May’s government is in tatters, Jeremy Corbyn is riding high and the Tories are teetering on the brink of civil war. \nOh, and Brexit negotiations start in a few days. \nLet us help you stay on top of things. \nHere’s a round-up of all this morning’s developments, what the papers are saying and highlights from all the Sunday politics programmes. May-hem for the Tories Prime Minister Theresa May (Photo: PA) \nMrs May warned about a “coalition of chaos” that would follow a Labour victory but the tables have been well and truly turned this weekend. \nOn Saturday, a statement was issued by Number 10 saying an outline agreement had been agreed with the DUP which would have seen them support the Conservatives in Parliament. \nBut it would appear they jumped the gun - hours later, another statement emerged saying that talks were ongoing over the terms of any confidence and supply deal. \nAppearing on ‘The Andrew Marr Show’ on BBC, Corbyn turned May’s own guns on her, calling the situation “chaotic” and re-affirming his belief that it could yet be Labour who governs the UK. Read More A week can be a very long time in politics: How Theresa May's campaign went pear-shaped \nHe also criticised the government for dealing with the DUP because of their highly conservative social policies and ruled out the possibility of Sinn Fein taking their seats in Parliament. \nAlso appearing on Marr, the defence secretary Michael Fallon said the DUP agreement would extend to “big issues” like the economy and security. Corbyn on the march Labour leader Jeremy Corbyn (Photo: PA) \nFor a man who has just lost an election, Jeremy Corbyn was described as smug by many on social media on Sunday morning. \nAfter two years of infighting and ineptitude in the Labour Party, he says they are now ready for government - and sooner than people might think. \nIn an exclusive interview with The Sunday Mirror, Mr Corbyn said: “I can still be Prime Minister. This is still on. Absolutely. Theresa May has been to the Palace. She’s attempting to form a government. Read More Jeremy Corbyn's victory is good for politics and good for the Tory party too \n“She’s then got to present a programme to Parliament. \n“We will – obviously – amend the Queen’s Speech. There’s a possibility of voting it down and we’re going to push that all the way.” \nSpeaking to Andrew Marr, it was Mr Corbyn who sounded strong and stable. \nHe said: “Have we done deals with anybody? No. Are we going to form a coalition? No. Will we put our manifesto to Parliament? Yes.” \nLabour are ready to fight another election, he said, despite a clear financial disadvantage when compared to the Tory’s campaign war chest. Blue on blue \nIf you’re going to insist on making enemies, don’t be surprised when they re-emerge when you’re down and out. \nThat’s a lesson Theresa May is learning the hard way this morning as senior Conservatives she’s battled with in the past come out to give her a very public kicking. \nAppearing on the BCC’s ‘Sunday Politics’ with Andrew Neil, Anna Soubry was asked if Theresa May would be replaced as leader by the end of the year. \nShe said: “I would have thought so. She’s flawed. She’s in a desperate situation. \n“I think, I’m afraid, that her position is untenable.” Former Conservative politician now Evening Standard editor George Osborne on ITV Election Night coverage (Photo: ITV) \nGeorge Osborne, who she sacked as Chancellor following her rise to the throne, has barely been able to contain his smugness since the exit poll was released on election night. \nThe now-editor of the Evening Standard told Andrew Marr: “Theresa May is a dead woman walking, it’s just how long she remains on death row.” \nNicky Morgan, the former education minister who was also sacked by May, said: “I think it’s fairly clear that Theresa May can not lead us into another election.” Broken Brexit \n“Vote for me to strengthen my hand”, Theresa May told the country - and the country have responded by voting to tie one hand behind her back. \nShe was clear before the election: as far as she was concerned, this was about securing a big mandate to press ahead with a hard Brexit. \nThat has been denied to her and so questions are being asked in all quarters about what this means for the sort of Brexit we’ll get. \nRemain supporting Tories have used the occasion to call for a massive softening of European policy. \nMichael Hesseltine, a former minister and lifelong Europhile, said on ITV’s Peston that “Brexit is the cancer gnawing at the heart of the Conservative party”. \nHe added: “Unless that is addressed then we are in a very difficult situation where it is conceivable that the next election will put Mr Corbyn into Number 10 Downing Street.” \nAnna Soubry said that May has turned her back on British business and must now press for membership of the single market. \nCorbyn told Marr that we would seek to retain UK membership of the EU Court of Human Rights, Convention on Human Rights and various EU organisations. Boris Johnson: next leader? \nThe blonde bouffanted one is, once again, being tipped as the next Prime Minister. \nVarious Sunday papers are carrying reports that he is getting ready for a bid to topple May and install himself in Number 10. \nThe Sun reported a couple of days ago that Mr Johnson was canvassing support for an election challenge right after the result but decided to shelve plans. \nThey also reported that it didn’t take long for hostile MPs to start having their own discussions about a candidate, using the acronym ‘ABB’ in their secret messages - Anyone But Boris. \nBut the rumours won’t go away and are all over the Sunday papers. \nMr Johnson has taken to Twitter to rubbish the reports, turning his ire on the Mail on Sunday in particular. \nHe posted: “Mail on Sunday tripe - I am backing Theresa may. Let’s get on with the job” What the Sunday papers say \nTheresa May might want to avert her gaze from the newspaper stand when she heads to the shop for a bottle of milk today. \nThey’re full of reports the that Boris Johnson is getting ready to replace her and fallout from the resignation of her influential aides, Nick Timothy and Fiona Hill. \nEven usually friendly papers have turned on her, a clear sign that her days are numbered. \nHere are all the politics headlines. \nThe Mail on Sunday - BORIS SET TO LAUNCH BID TO BE PM AS MAY CLINGS ON \nThe Sunday Times - FIVE CABINET MINISTERS URGE BORIS TO TOPPLE MAY \nDaily Star Sunday - BORIS SCRAPPED BARRIERS ON TERROR BRIDGE \nThe Sundal Telegraph - IN OFFICE, BUT NOT IN POWER \nThe Observer - MAY’S PREMIERSHIP IN PERIL \nSunday Express - MAY’S ‘TOXIC’ AIDES RESIGN \nThe Sunday Mirror - CORBYN: ‘I WILL FINISH OFF MAY’ (leads on Richard Hammond car crash) Like us on Facebook", "external_links": [], "published": "2017-06-11T19:21:00.000+03:00", "crawled": "2017-06-11T15:11:24.019+03:00", "highlightTitle": ""}