{"organizations": [], "uuid": "83f38606a00682479e603a99659d0904306c6b24", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article13242433.ece/ALTERNATES/s1200/The-Prime-Minister-Meets-DUP-Leader-At-Downing-Street.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/how-theresa-mays-dup-deal-13258931", "country": "GB", "domain_rank": 21960, "title": "How Theresa May's DUP deal offers Northern Ireland 16 times as much funding as the North East", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-29T20:00:00.000+03:00", "replies_count": 0, "uuid": "83f38606a00682479e603a99659d0904306c6b24"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/how-theresa-mays-dup-deal-13258931", "ord_in_thread": 0, "title": "How Theresa May's DUP deal offers Northern Ireland 16 times as much funding as the North East", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "nigel dodds", "sentiment": "none"}, {"name": "arlene foster", "sentiment": "none"}, {"name": "catherine mckinnell", "sentiment": "none"}, {"name": "gavin williamson", "sentiment": "none"}, {"name": "jeffrey donaldson", "sentiment": "none"}, {"name": "damian green", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "west midlands", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}, {"name": "downing street", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "south tyneside", "sentiment": "none"}, {"name": "sheffield city region", "sentiment": "none"}, {"name": "north tyneside", "sentiment": "none"}, {"name": "tees valley", "sentiment": "none"}], "organizations": [{"name": "dup", "sentiment": "negative"}, {"name": "house of commons", "sentiment": "none"}, {"name": "newcastle north", "sentiment": "none"}, {"name": "democratic unionist party", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}, {"name": "liverpool city region", "sentiment": "none"}, {"name": "tories", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "budget", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "How Theresa May's DUP deal offers Northern Ireland 16 times as much funding as the North East Figures reveal how new funding for Northern Ireland dwarfs the devolution deals given to English regions Share Theresa May, greets Arlene Foster, the leader of Northern Ireland's Democratic Unionist Party (Photo: Getty Images Europe) Share Get daily updates   Thank you for subscribing!   \nNew figures have shown how English regions including the North East have been left short-changed by Theresa May’s £1 billion deal Democratic Unionist Party (DUP). \nNorthern Ireland is getting 16 times as much funding as that offered to the North East , an analysis by the House of Commons library shows. \nThe agreement with the DUP means Northern Ireland gets an extra £244 per person every year, to be spent on services such as schools, hospitals and major transport schemes . \nMeanwhile, the Government’s proposed devolution deal with the North East provides the region with just £15 per person each year. \nThe analysis, conducted at the request of Labour MPs , shows how money for English regions is dwarfed by the cash pouring into Northern Ireland in return for a pledge that the DUP’s 10 MPs will support the Tories in the House of Commons. Prime Minister Theresa May stands with First Secretary of State Damian Green (right), DUP leader Arlene Foster (second left), DUP Deputy Leader Nigel Dodds (left), as DUP MP Sir Jeffrey Donaldson (third right) shakes hands with Parliamentary Secretary to the Treasury, and Chief Whip, Gavin Williamson, inside 10 Downing Street, London, after the DUP agreed a deal to support the minority Conservative government \nCouncil leaders in Newcastle, Gateshead, Sunderland, Northumberland, North Tyneside, South Tyneside and County Durham negotiated a devolution deal with the Government which included funding of £30 million a year, for a period of 30 years, to be spent largely on measures to grow the economy. \nThe deal is currently on hold after the region failed to reach agreement with Ministers over the creation of a directly-elected mayor. \nBut earlier this week, Prime Minister Theresa May agreed a deal with the DUP, the largest party in Northern Ireland, to provide an extra £1 billion in funding. Most of this will be provided over two years, although £150 million is provided over a five year period. \nIn return, the DUP’s 10 MPs will support the Government in key House of Commons votes such as those on the Queen’s Speech and the Budget . \nBoth deals come on top of the usual funding provided by the Government. Read More Concern as Theresa May's DUP deal offers tax breaks for Northern Ireland airports \nWhile both agreements are worth around £1 billion, the Northern Ireland deal is actually far more generous. That’s partly because Northern Ireland has a population of 1.8 million, while the area covered by the North East agreement contains 2 million people. \nMost of all, it’s because the funding for the North East is spread out over a much longer period. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nThe analysis show that funding for one person in Northern Ireland each year is more than the funding for 16 people in the North East. \nAnd it’s a similar picture in other English regions, many of which have signed their own devolution deals with the Government. \nThe £244 annual funding per person for Northern Ireland compares to £23 going to Tees Valley and £22 going to the Sheffield City Region. \nGreater Manchester is getting £11 and the Liverpool City Region gets £20. \nThe West Midlands, including Birmingham and the surrounding area, stands to get £13 per person each year. Read More A tale of two deals - the North East's £30m a year and Northern Ireland's cool billion \nDevolution deals for the English regions involved the Government providing cash to new regional combined authorities, usually on the condition that they agreed to be led by a directly-elected mayor. \nNewcastle North MP Catherine McKinnell said: “Of course the DUP have sought to gain maximum advantage from Theresa May and her weak position, securing much-needed investment and additional funding for public services in Northern Ireland. \n“But this is not how Government spending decisions should be taken, and the North East and our public services are also in desperate need of additional funding after seven years of harsh Tory cuts. \n“The fact that our devolution deal – if it actually happens – equates to just £15 per head demonstrates the total contempt in which our region appears to be held by this Conservative Government, given the value of the additional funding on offer to the DUP. \n“It’s totally unacceptable that the people of the North East should lose out because their democratically-elected representatives are not in a position to prop up this Government. And people across the region are rightly angry that, having been repeatedly told there’s no magic money tree, £1.5billion has been mysteriously found down the back of the sofa.” A Treasury spokesman said: “We are delivering for the whole of the United Kingdom, so we can get on with our plan to get the best Brexit deal for the country and create an economy that works for everyone. \n“This agreement is part of the Government’s commitment to support growth across all parts of the UK. \n“The Government is supporting growth right across the UK including in England, where we have agreed six devolution deals with investment funds for elected mayors right across the country.” Like us on Facebook", "external_links": [], "published": "2017-06-29T20:00:00.000+03:00", "crawled": "2017-06-29T20:38:37.001+03:00", "highlightTitle": ""}