{"organizations": [], "uuid": "b0a20f777a3af131831f4eb05a46328c9602d2ba", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13220581.ece/ALTERNATES/s1200/State-Opening-of-Parliament-2017.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/we-government-waiting-jeremy-corbyn-13220574", "country": "GB", "domain_rank": 21960, "title": "'We are a government in waiting' Jeremy Corbyn warns Theresa May as parliament gets back to work", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-22T01:56:00.000+03:00", "replies_count": 0, "uuid": "b0a20f777a3af131831f4eb05a46328c9602d2ba"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/we-government-waiting-jeremy-corbyn-13220574", "ord_in_thread": 0, "title": "'We are a government in waiting' Jeremy Corbyn warns Theresa May as parliament gets back to work", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "jeremy corbyn", "sentiment": "negative"}, {"name": "hammond", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "jonathan walker", "sentiment": "none"}, {"name": "green", "sentiment": "none"}, {"name": "stockton", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}, {"name": "philip hammond", "sentiment": "none"}], "locations": [{"name": "cardiff", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "kensington", "sentiment": "none"}], "organizations": [{"name": "house of commons", "sentiment": "none"}, {"name": "canterbury", "sentiment": "none"}, {"name": "democratic unionist party", "sentiment": "none"}, {"name": "snp", "sentiment": "none"}, {"name": "house of lords", "sentiment": "none"}, {"name": "queen’s speech", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "sinn fein", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "dup", "sentiment": "none"}, {"name": "state opening of parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Opinion 'We are a government in waiting' Jeremy Corbyn warns Theresa May as parliament gets back to work Political editor Jonathan Walker gives his analysis on Theresa May saying she is 'too weak to press ahead with divisive policies' Share Click   Get   \nJeremy Corbyn warned Theresa May that he was ready to replace her as Prime Minister, as Parliament got back to work after the General Election . \nThe Labour leader was speaking in the Commons in response to the Queen’s Speech, when the Government set out its plans for the next two years. \nHe said: “Labour is not merely an Opposition: we are a government in waiting, with a policy programme that enthused and engaged millions of people; many for the first time. \n“We are ready to offer real strong and stable leadership in the interests of the many not the few.” \nRealistically, Labour is not likely to become a Government unless we have another general election. \nThere are still more Conservative MPs in the House of Commons than there are Labour, Liberal Democrat, SNP, Green and Plaid Cymru MPs put together (that is to say, all the parties except Sinn Fein, who don’t take their seats, and the DUP, who are unlikely to support any potential Labour government). \nThe numbers mean Labour would find it next to impossible to lead a government. That could change, of course, if there’s a general election. \nBut at the same time, it’s not clear whether Theresa May and the Conservatives are really capable of leading a government either. Prime Minister Theresa May and leader of the opposition Jeremy Corbyn walk through the Palace of Westminster to the House of Lords after attending the State Opening of Parliament (Photo: PA) \nMrs May hasn’t yet managed to thrash out the deal with the Democratic Unionist Party, and its 10 MPs, that she needs in order to be pretty certain of winning Commons votes. \nBut she decided to press ahead with a Queen’s Speech without a deal in place. \nNow, we can see why. Her plans are so insipid that there’s nothing likely to provoke much controversy. \nMrs May has scrapped many of her controversial manifesto commitments. \nGone are plans to introduce new grammar schools, at least for now. \nWealthier pensioners will keep their winter fuel allowance after all, after the Government abandoned plans to means test them. And the dreaded “dementia tax”, which meant some elderly people might be forced to sell their homes to pay for social care, was also replaced with a vague promise to hold a consultation. \nWhy the change? The Government needs to concentrate on Brexit for the next two years, but Mrs May knew this when she proposed the measures in her general election manifesto. \nThe most likely explanation is that she simply feels too weak to press ahead with divisive policies. \nTory MPs might not vote for them. And it would only take a small rebellion, even with the DUP on her side, to lose a Commons vote. \nEven if they don’t rebel, some Conservatives are furious with the Prime Minister for publishing such a provocative manifesto. Her best bet now is quietly to forget about the most contentious plans. \nBut this isn’t what being in power is meant to be about. Read More How will the Queen's Speech affect you? We look at the key points \nSome will be pleased with Mrs May’s u-turns because they believe the policies were wrong. But in general terms, it’s not good for the UK when the Government is too feeble to enact policies it apparently thinks are right for the country. \nAnd there’s another, long-term problem facing the Government. \nMr Corbyn delivered a strong attack on austerity in his statement to the Commons. \nHighlighting constituencies the Conservatives lost in the election, he said: “From Cardiff to Canterbury, from Stockton to Kensington, people chose hope over fear. And they sent an unequivocal message: that austerity must be brought to an end.” \nChancellor Philip Hammond warned this week that the Government had lost the argument on controlling public spending, although his answer was to “make anew the case for a market economy and for sound money”. The only other options, he said, were to raise taxes, which he said would hurt the economy, or borrow more, which he said meant landing “the next generation” with debt. \nSo there’s agreement that austerity is unpopular. The trouble is that the Chancellor is right - there’s no immediate way to increase spending without increasing taxes or borrowing. \nThis isn’t a problem for Labour, as it is happy to say it will tax businesses and the very wealthy more. How well this will succeed if Labour actually gets into power remains to be seen, but it has a policy to end austerity which appears to be popular. \nThe Conservatives face an electorate which has simply had enough of what many perceive as swingeing cuts (the spending figures tell a slightly different story, but that’s a topic for another day). \nVoters may have accepted the need for cuts immediately after the banking crisis but, as Mr Hammond admitted, they don’t any more. And Theresa May has nothing to offer them instead. Like us on Facebook", "external_links": [], "published": "2017-06-22T01:56:00.000+03:00", "crawled": "2017-06-21T22:01:49.003+03:00", "highlightTitle": ""}