{"organizations": [], "uuid": "446805611165a7e1156858e26392c973f3c85fa0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article13221344.ece/ALTERNATES/s1200/JS112608320.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13219210", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast RECAP: Shortlisted HS2 high speed rail operator bids revealed", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-22T14:55:00.000+03:00", "replies_count": 0, "uuid": "446805611165a7e1156858e26392c973f3c85fa0"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13219210", "ord_in_thread": 0, "title": "Business Breakfast RECAP: Shortlisted HS2 high speed rail operator bids revealed", "locations": [], "entities": {"persons": [{"name": "martin gilbert", "sentiment": "none"}, {"name": "chris robson", "sentiment": "none"}, {"name": "grainger chambers", "sentiment": "none"}, {"name": "farfetch", "sentiment": "none"}, {"name": "richard liu", "sentiment": "none"}, {"name": "go-ahead", "sentiment": "none"}, {"name": "lucy winskell", "sentiment": "none"}, {"name": "virgin", "sentiment": "none"}, {"name": "chris grayling", "sentiment": "none"}, {"name": "chris", "sentiment": "none"}, {"name": "jessica", "sentiment": "none"}, {"name": "mrs winskell", "sentiment": "none"}, {"name": "gerry grimstone", "sentiment": "none"}, {"name": "beeronomy", "sentiment": "none"}, {"name": "ryecroft glenton", "sentiment": "none"}, {"name": "coreena ford", "sentiment": "none"}, {"name": "garry", "sentiment": "none"}, {"name": "wilson bowden", "sentiment": "none"}, {"name": "steven", "sentiment": "none"}, {"name": "andrew hodgson", "sentiment": "none"}, {"name": "matt fawson", "sentiment": "none"}, {"name": "tyne", "sentiment": "none"}, {"name": "david", "sentiment": "none"}, {"name": "jessica white coreena ford mordue brewery", "sentiment": "none"}, {"name": "liu", "sentiment": "none"}, {"name": "peter mccusker", "sentiment": "none"}, {"name": "keith skeoch", "sentiment": "none"}, {"name": "mick cash", "sentiment": "none"}, {"name": "jessica white", "sentiment": "none"}, {"name": "barratt", "sentiment": "none"}, {"name": "keolis", "sentiment": "none"}], "locations": [{"name": "kutaisi", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}, {"name": "aberdeen", "sentiment": "none"}, {"name": "farfetch", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "west coast", "sentiment": "none"}, {"name": "kosovo", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "govia", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "tel aviv", "sentiment": "none"}, {"name": "romania", "sentiment": "none"}, {"name": "south east", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "pristina", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "luton airport", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}, {"name": "luton", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}, {"name": "israel", "sentiment": "none"}, {"name": "georgia", "sentiment": "none"}, {"name": "london bridge", "sentiment": "none"}], "organizations": [{"name": "coreena ford private", "sentiment": "negative"}, {"name": "newcastle", "sentiment": "negative"}, {"name": "imagination technologies", "sentiment": "none"}, {"name": "rail delivery group", "sentiment": "none"}, {"name": "competition and markets authority", "sentiment": "none"}, {"name": "aberdeen", "sentiment": "none"}, {"name": "board of barratt", "sentiment": "none"}, {"name": "mtr", "sentiment": "none"}, {"name": "northumbria university", "sentiment": "none"}, {"name": "south eastern", "sentiment": "none"}, {"name": "rail", "sentiment": "none"}, {"name": "wizz air", "sentiment": "none"}, {"name": "cma", "sentiment": "none"}, {"name": "sncf", "sentiment": "none"}, {"name": "network rail", "sentiment": "none"}, {"name": "southern railway", "sentiment": "none"}, {"name": "northern counties club", "sentiment": "none"}, {"name": "gucci", "sentiment": "none"}, {"name": "west coast partnership", "sentiment": "none"}, {"name": "department for transport", "sentiment": "none"}, {"name": "firstgroup", "sentiment": "none"}, {"name": "east japan railway company", "sentiment": "none"}, {"name": "london stock exchange", "sentiment": "none"}, {"name": "mitsui & co ltd stagecoach south eastern trains ltd", "sentiment": "none"}, {"name": "barratt developments", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}, {"name": "abellio transport group ltd", "sentiment": "none"}, {"name": "standard life aberdeen", "sentiment": "none"}, {"name": "standard life", "sentiment": "none"}, {"name": "coreena ford wizz air", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}, {"name": "aslef", "sentiment": "none"}, {"name": "stagecoach group plc trenitalia uk ltd", "sentiment": "none"}, {"name": "general election", "sentiment": "none"}, {"name": "south eastern holdings ltd", "sentiment": "none"}, {"name": "govia thameslink railway", "sentiment": "none"}, {"name": "go-ahead group", "sentiment": "none"}, {"name": "lep", "sentiment": "none"}, {"name": "rmt", "sentiment": "none"}, {"name": "newcastle law society", "sentiment": "none"}, {"name": "mordue brewery", "sentiment": "none"}, {"name": "aberdeen asset management", "sentiment": "none"}, {"name": "stagecoach", "sentiment": "none"}, {"name": "mips", "sentiment": "none"}, {"name": "transport", "sentiment": "none"}, {"name": "rothschild", "sentiment": "none"}, {"name": "barratt", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}, {"name": "guangshen railway company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford Private members' club in Newcastle elects first ever female chairman \nOne of the world’s oldest private members’ clubs based in Newcastle has elected a female chairman for the first time. \nThe Northern Counties Club has elected Lucy Winskell, Pro Vice-Chancellor of Northumbria University, to succeed previous chairman Chris Robson, managing partner at Ryecroft Glenton, after the end of his five-year term. \nThe club, which was founded in 1829 and has been at the heart of Newcastle’s business community ever since, admitted Mrs Winskell as its first female member after a change of rules permitted this in 1999. \nAt that time Mrs Winskell had been appointed president of Newcastle Law Society, the first woman to hold the post. \nMrs Winskell had a successful 28-year legal career before moving into higher education. She is also a deputy lieutenant of Tyne and Wear, has previously served as High Sheriff and was awarded the OBE for services to higher education and regional economy. Mrs Winskell said: “It is an honour to be the chairman of the Northern Counties Club. Chris has given his all to the club and it has thrived under his leadership, I would like to thank him for his service and pledge to do my best in the role.” Lucy Winskell (left) receives the keys to the Northern Counties Club from previous Chairman, Chris Robson (right) (Photo: Northern Counties Club) 9.10 Coreena Ford Wizz Air celebrates major investment in the UK \nLow-cost European airline Wizz Air has hailed a “major investment in the UK” as it shrugged off Brexit uncertainties to open its first British base at Luton airport. \nThe central and eastern European carrier, which is listed in London, said the move would see it offer three new services to Tel Aviv in Israel, Pristina in Kosovo and Kutaisi in Georgia - taking its operations to 42 routes from Luton. \nIt will offer the only direct connection between Kutaisi and the UK, while it will also be able to increase the number of flights to some of its most popular destinations in Romania. A Wizz Air plane at Luton Airport 9.07 Coreena Ford New chief finance officer joins Barratt Developments \nJessica White has joined the Board of Barratt as an executive director and chief financial officer, with immediate effect. \nJessica, currently Barratt’s group financial controller, has extensive experience in the housebuilding sector, having joined Wilson Bowden plc as a corporate accountant in 2005. \nFollowing the acquisition of Wilson Bowden by Barratt in 2007, Jessica was appointed to the role of head of financial accounting at Barratt, and in 2010 was promoted to the position of group financial controller. Jessica qualified as a chartered accountant with PwC in 2003. \nShe said: “ In my 12 years at the company, I have seen first-hand Barratt’s commitment both to the quality of its product and to its people. I look forward to working closely with David, Steven and the wider management team to reinforce Barratt’s position as the country’s leading housebuilder whilst driving further value creation through tangible initiatives such as operating margin improvement.” Jessica White Coreena Ford Mordue Brewery brothers team up with top chef to open Newcastle city centre bar \nMy favourite tale of the week so far - news that Mordue Brewery are set to open a food and beer focused bar in Newcastle city centre. \nBeeronomy promises to be a proper feast for foodies and craft beer fans alike, and the brewing brother Garry and Matt Fawson have bided their time to make sure things go perfectly to plan. They’ve waited 10 years to put the plans in place - good luck fellas! Grainger Chambers, where the brothers behind Mordue Brewery plan to open Beeronomy, a bar which will focus on matching top food with top beers (Photo: staff photo) 8.55 Coreena Ford Cautious optimism for North East offshore sector suggests worst of oil crisis has passed \nPeter McCusker’s been at a major offshore industry conference - and the mood was one of refreshing, if cautious, optimism at a major offshore industry conference in Newcastle, as Peter McCusker reports. \nTwo years ago the delegates at the Newcastle event were outlined what they wanted to see happen to get out of the oil crisis, and those things are now happening, according to industry leaders. Andrew Hodgson, Chair of the North East LEP and CEO of SMD (Photo: Newcastle Chronicle) 8.50 Coreena Ford China internet giant snaps up stake in UK fashion firm \nChinese internet giant JD.com has splashed out $397m (£314m) on a stake in London-based online fashion retailer Farfetch. \nThe companies said the deal will allow Farfetch to tap an $80bn (£63bn) market in China, with JD helping “drive further brand awareness, traffic and sales” in the Asian powerhouse. \nIt will see JD become one of the largest shareholders of Farfetch, with founder Richard Liu joining the online firm’s board. \nThe announcement comes as JD is placing a greater focus on high-end luxury and fashion to match the demand among its customers. \nHundreds of well-known fashion brands sell their products on Farfetch and the firm recently launched a tie-up with Gucci which offers a 90-minute delivery service. \nMr Liu said: “As part of our major luxury push, we could not have found a stronger online partner than Farfetch. \n“This partnership with Farfetch further extends our lead in the battle for the future of China’s upwardly mobile consumers.” \nThe size of JD’s stake in Farfetch was not disclosed. 8.45 Coreena Ford £11bn Standard Life and Aberdeen Asset Management merger cleared \nBritain’s competition watchdog has given the green light to the £11bn merger of Standard Life and Aberdeen Asset Management. \nThe Competition and Markets Authority (CMA) said it has decided not to refer the merger to an in-depth “Phase 2 investigation”, paving the way for the deal’s completion in August. \nOn Monday, shareholders overwhelmingly backed the tie-up, with more than 95% of investors at Aberdeen and 98% at Standard Life voting in favour of the deal during general meetings. \nThe enlarged company, to be called Standard Life Aberdeen, will be headed up by Keith Skeoch and Aberdeen boss Martin Gilbert. \nThe merger will create Europe’s second-biggest fund manager, with £670bn under management. \nThe deal, announced in March, is targeting cost savings of £200 million a year, with around 800 jobs expected to be lost over a three-year period from a global workforce of 9,000. Standard Life chairman Gerry Grimstone. The firm's merger Aberdeen Asset Management has been approved. 8.40 FTSE and pound latest \nThe FTSE-100 index at 8:15am was down 27.85 at 7419.94. \nThe pound at 8am was 1.2681 dollars compared to 1.2666 dollars at the previous close. The euro at 8am was 0.8811 pounds compared to 0.8797 pounds at the previous close. Screen displaying the FTSE 100 at the London Stock Exchange (Photo: Yui Mok/PA Wire) 8.35 Coreena Ford UK tech firm puts itself up for sale amid Apple dispute \nBritish chip maker Imagination Technologies has put itself up for sale, weeks after it launched a formal dispute against Apple when the iPhone maker said it will no longer use the firm’s products. \nImagination said it has received interest from a number of parties over the last few weeks for a potential acquisition. \nAs a result, the board has decided to initiate a “formal sale process” and is engaged in preliminary discussions with potential bidders. \nShares in Imagination plummeted more than 60% in April after it revealed that Apple will no longer use its products, meaning it will no longer be eligible for royalty payments. \nApple’s royalty payments and licence fees brought in £60.7 million in revenues in the year to April 30, accounting for half of Imagination’s total sales. \nThe Hertfordshire-based group responded by launching a formal dispute against the US tech giant. \nIt is concerned that Apple’s plans to replace Imagination’s intellectual property - used in the graphics processor units for phones, tablets, iPods and TVs - with its own technology risks violating the company’s patents. “Imagination remains in dispute with Apple,” the company said. \nImagination is working with Rothschild on the sale process. \nSeparately, Imagination put its MIPS and Ensigma operations up for sale in May, with the firm saying the process is progressing well and indicative proposals have been received for both businesses. 8.28 Rail union RMT reacts to the shortlist of rail franchise bidders \nRail union RMT expressed anger that the shortlists do not feature a public sector bid. \nGeneral secretary Mick Cash claimed the General Election showed that voters had rejected privatisation. \nHe said: \nIt is a scandal that the cheaper, more efficient public sector option has been excluded from the bidding process for these two major rail franchises. \nThis morning the same old gang have been lined up for another invitation to jam their snouts in the trough at the British passengers’ expense. \nAfter over two decades of rail privatisation the Government are still locked into this cycle of exploitation and failure. \nIt is a disgrace and RMT will continue to fight for the direct public control and ownership of our railways. \nThe Rail Delivery Group, representing train companies and Network Rail, says passengers and the Treasury benefit by rail companies from around the world bringing “new ideas and innovation”, with the number of journeys being made doubling over the past 20 years. Mick Cash, general secretary of the RMT (Photo: PA) 8.20 Coreena Ford Southern railway passengers warned of more disruption \nThe Go-Ahead group has warned that its strike-hit Southern Railway faces fresh disruption for long-suffering passengers ahead of next week’s planned union action. \nGo-Ahead, which runs Southern through its Govia Thameslink Railway (GTR) business, said while the service has “stabilised” in recent months, the train driver overtime ban set to start on June 29 would cause more “unnecessary disruption” for customers. \nIn a pre-close trading statement the Newcastle headquartered firm’s warning came as the group revealed that passenger revenues for the year to July 1 are expected to drop by around 4% on its GTR service, with passenger journeys also down 4%. \nThe group said: “There has been no significant industrial action on Southern services in the last five months and, consequently, service and performance levels have stabilised, allowing the company to deliver more reliable rail services to customers. \n“Disappointingly, the Aslef union has called for an overtime ban for Southern train drivers which, if it goes ahead, will result in unnecessary disruption for customers.” \nGo-Ahead said it “remains fully committed to resolving these issues to provide improved services for customers and reduce uncertainty for our stakeholders”. The firm alerted over profits in February after a year of crippling industrial action, revealing full-year rail profits could be impacted by up to £15m amid ongoing uncertainty over union relations. \nThe group said in its latest update that it remained in talks with the Department for Transport over potential penalties for breaching its contractual obligations but said the outlook for rail profits remains the same. \nSouthern has been involved in a bitter dispute with unions over proposals for so-called driver-only operated trains, with conductors holding several strikes in the past year, while drivers have separately walked out due to the row. 8.05 KEY EVENT Three bids shortlisted to run HS2 railway \nThree bids have been shortlisted to operate the HS2 high-speed railway, the Government has announced. The companies are competing for the West Coast Partnership franchise, which will include services on the existing West Coast route from 2019 and initial HS2 trains between London and Birmingham from 2026. Rail firms based in the UK, China, Hong Kong, France and Italy are among those in the running to win the contract. The shortlisted bids are: \n- A joint venture between UK-based FirstGroup and Italian operator Trenitalia \n- A partnership between Hong Kong firm MTR and Guangshen Railway Company - based in China - as well as several sub-contractors \n- A joint entry by UK-based Stagecoach and Virgin, as well as French rail operator SNCF \nThe Department for Transport claimed the bids feature “UK rail experts”, companies that operate high-speed railways around the world and business with “an excellent track record in customer services”. \nTransport Secretary Chris Grayling said: \nThe West Coast Partnership will support growth and better services on the West Coast Main Line while helping to ensure that HS2 becomes the backbone of Britain’s railways. \nThis will create more seats for passengers, improve connections between our great cities, free up space on existing rail lines and generate jobs and economic growth throughout the country. I look forward to seeing the bidders’ innovative ideas to put passengers at the heart of the railway. A Virgin train (Photo: PA) 7.55 KEY EVENT Government announces shortlisted bidders for West Coast and South East franchises \nThe government has just announced the names of the companies in the running for the new West Coast Partnership rail franchise and the next South Eastern franchise - and both Virgin and Go-Ahead Group are shortlisted retail the West and Southeastern lines, respectively. \nGovia, Go-Ahead’s joint venture with Keolis (Go-Ahead 65%, Keolis 35%), has been shortlisted by the Department for Transport to bid for the South Eastern franchise - but it’ll have to see off competition from foreign rail operators. \nThe others in the mix for the South Eastern franchise are: South Eastern Holdings Ltd, a joint venture company that on franchise award will be wholly owned by Abellio Transport Group Ltd and East Japan Railway Company and Mitsui & Co Ltd Stagecoach South Eastern Trains Ltd, a wholly owned subsidiary of Stagecoach Group plc Trenitalia UK Ltd, wholly owned by Trenitalia SpA \nA statement by Go-Ahead Group pushes forward its bid, saying: \n“Govia will be aiming to retain the franchise that it has operated, as Southeastern, since 2006. Over this time, Southeastern passenger numbers have grown by 40% and some 500 additional weekday services have been added. \n“In 2009 Southeastern introduced the UK’s first domestic high speed service, significantly reducing journey times to London and supporting the economic regeneration of the region. The company also played a key role in the success of the 2012 London Olympic and Paralympic Games’ transport plan, carrying 20% more passengers than usual. \n“Since the start of the franchise, £120m of partnership funding has been invested in station improvements and Govia has introduced a range of other passenger service improvements such as 24-hour customer service and social media updates, smartcard ticketing, and, since 2014, an additional 300 customer-facing employees. \n“Southeastern is a major partner in the Thameslink infrastructure programme and during the rebuild of London Bridge station has been operating the same number of a services on 50% less track capacity.” \nTransport Secretary Chris Grayling said: \nSouth Eastern is one of the busiest franchises in the UK, running almost 2,000 services every weekday. We want passengers to be at the heart of everything that the new operator does, enjoying modern, spacious trains on a more punctual and reliable service. We will listen to what passengers say in the current public consultation, and we will seek to make changes and improvements only with their support. \nThe consultation for people to share their views and priorities for the South Eastern franchise runs until 30 June 2017. The new franchise is planned to start in December 2018. Transport Secretary Chris Grayling (Photo: PA) Share", "external_links": [], "published": "2017-06-22T14:55:00.000+03:00", "crawled": "2017-06-22T12:00:09.006+03:00", "highlightTitle": ""}