{"organizations": [], "uuid": "a12f57e15edc9df025c7b0dc92ddc1c8a5706324", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30380646/16036875.jpg", "site_section": "http://www.westernmorningnews.co.uk/all-content.rss", "section_title": "Devon Live All Content Feed", "url": "http://www.devonlive.com/hugo-swire-retains-east-devon-seat-but-with-reduced-majority-over-independent-claire-wright/story-30380646-detail/story.html", "country": "GB", "title": "DanielClark published Hugo Swire retains East Devon after challenge from independent...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-09T12:10:00.000+03:00", "replies_count": 0, "uuid": "a12f57e15edc9df025c7b0dc92ddc1c8a5706324"}, "author": "DanielClark", "url": "http://www.devonlive.com/hugo-swire-retains-east-devon-seat-but-with-reduced-majority-over-independent-claire-wright/story-30380646-detail/story.html", "ord_in_thread": 0, "title": "DanielClark published Hugo Swire retains East Devon after challenge from independent...", "locations": [], "entities": {"persons": [{"name": "claire wright", "sentiment": "none"}, {"name": "danielclark", "sentiment": "none"}, {"name": "daniel", "sentiment": "none"}, {"name": "johnny mercer", "sentiment": "none"}, {"name": "alison eden", "sentiment": "none"}, {"name": "anne marie morris", "sentiment": "none"}, {"name": "jack lebeau", "sentiment": "none"}, {"name": "wright", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "brigitte graham", "sentiment": "none"}, {"name": "kevin foster", "sentiment": "none"}, {"name": "peter h faithfull", "sentiment": "none"}, {"name": "janet ross", "sentiment": "none"}, {"name": "michael d val davies", "sentiment": "none"}, {"name": "david cameron", "sentiment": "none"}, {"name": "swire", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "hugo swire", "sentiment": "none"}, {"name": "clark", "sentiment": "none"}, {"name": "jan ross", "sentiment": "none"}, {"name": "alison m eden", "sentiment": "none"}, {"name": "claire l wright", "sentiment": "none"}, {"name": "hon theresa may mp", "sentiment": "none"}, {"name": "sarah wollaston", "sentiment": "none"}, {"name": "yougov", "sentiment": "none"}], "locations": [{"name": "east devon", "sentiment": "none"}, {"name": "plymouth moor", "sentiment": "none"}, {"name": "newton abbot", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "devon county", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}, {"name": "south devon", "sentiment": "none"}], "organizations": [{"name": "east devon", "sentiment": "none"}, {"name": "independence party", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "devon county council", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}, {"name": "party", "sentiment": "none"}, {"name": "conservative", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "coalition government", "sentiment": "none"}, {"name": "conservative middle east council", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}, {"name": "commonwealth office", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "ge", "sentiment": "none"}, {"name": "social care", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Hugo Swire retains East Devon after challenge from independent Claire Wright - Full report By DanielClark | Posted: June 09, 2017 4 COMMENTS SHARES Hugo Swire retains East Devon after challenge from independent Claire Wright -... X \nCopy link to paste in your message / Comments (4) \nConservative candidate Sir Hugo Swire successfully retained his seat in East Devon after the valiant challenge of independent candidate Claire Wright failed. \nMr Swire, a former foreign minister, held onto the seat that he has held since 2001 after securing 29,306 votes - 4,000 more than he received when he was victorious in 2015. \nClaire Wright, the independent candidate who came second in 2015, had mobilised people power with her army of 700 active supporters, 400 publicity boards across East Devon, and leaflets delivered to 45,000 homes. Read more Sarah Wollaston vows to stand for 'all of South Devon' after... \nBut it wasn't enough to take on the Tory machine in the rural Devon heartlands and Mr Swire managed to retain his seat and increase the number of votes he recieved, although with a reduced majority, dropping from 12,000 to 8,000. \nHe pledged to continue to represent the people of East Devon in Parliament to the very best of his ability and said that the people responded to the message of his campaign. \nSeven candidates contested the East Devon seat. The results were: • Alison M Eden, Liberal Democrats: 1,468 • Peter H Faithfull, Independent: 150 • Brigitte Graham, UK Independence Party (UKIP): 1,203 • Jan Ross, Labour Party: 6,857 • Hugo Swire, The Conservative Party Candidate: 29,306 (Elected) • Michael D Val Davies, Independent: 128 • Claire L Wright, Independent: 21,270 The turnout was 73.4%, a slight increase on the turnout for the last General Election in 2015. There were 61 rejected ballot papers and 60,443 ballot papers issued. \nMr Swire said: \"I am humbled that I have got the biggest vote share of any candidate since this constituency was formed and I don't take that lightly. I am enormously grateful to all my team. We never claimed that we had 600 people out each day, but we had a lot of people out taking our message to the electors of East Devon, and clearly it worked. Read more Torbay's Kevin Foster re-elected as MP on a most unusual stag... \n\"I am proud that we fought a campaign free of any slander, we didn't feel obliged to rip down any posters, we didn't react to have our own poster ripped down, defaced, and had slogans written over them, and we didn't resort to personal attacks on website, or anonymous attacks that I have had to put up with repeatedly. \n\"We fought a proper East Devon campaign as it should be fought here and how it should be fought in the future by all candidates, and clearly the public responded to the way that we fought this campaign. \n\"My condolences to the other candidates, but there can only be one winners and tonight that is us, and I am extraordinarily grateful to all of those who voted for me and I will continue to represent them in Parliament to the very best of my ability.\" East Devon; a very interesting seat at this 2017 GE. Many (incl. YouGov) think an independent candidate can defeat a 12k Tory majority. pic.twitter.com/ioalF9G8fZ — Jack Lebeau (@JackLebeau66) June 7, 2017 \nPollsters YouGov had suggested that history could be made and that independent candidate Claire Wright may be about to wrest the seat from long-time Conservative MP Hugo Swire, and in their final poll before the election had her at 46 per cent likely to win, compared to 34 per cent for Mr Swire. \nBut the poll was wrong and the bookies, who had Mr Swire as a massive odds on favourite, held onto the seat. \nMs Wright, who is currently a Devon County Councillor, took 21, 270, the highest number of votes by an independent in any seat since 2001, said: \"I am absolutely thrilled to have increased my share of the vote from 24 per cent to 36 per cent of the vote in two years, and from almost a standing start. Six weeks ago, all I had with me was 13,100 votes from the last campaign, and in six weeks, I have managed to create an amazing campaign and gone from zero money to over £12,000 of funding online. \n\"We have had over 700 people trying to get me elected and from that point of view it has been an enormous success and I am delighted with my share of the vote, but I am really sad to not be standing here today as East Devon's MP. The polls predicted that it would be really close and that it could happen and I hoped that it would happen. Read more Conservative Anne Marie Morris retains Newton Abbot seat - Full... \n\"I am certainly looking forward to getting back to my Devon County Council work. I was elected last month and I have not been able to do very much county council work with the election campaign carrying on. \n\"Will I stand again? I think it would be very hard not to after this result and the last result, but we will see.\" \nThird place went to Labour's Janet Ross, who on a successful night for Jeremy Corbyn's party nationally, increased their votes from 5,591 to 6,857. \nShe said that she thanked her team and said it is a personal pleasure to stand in support of a manifesto that chimed with many voters across the country. \nAlison Eden, of the Liberal Democrats, came fourth, and she called on Mr Swire to ensure that he did represent the people of East Devon in Parliament. \nShe said: \"Mr Swire, please don't follow the Party whip when looking after the needs of this constituency. Please fight against a hard Brexit, join up NHS and Social Care and looks after the most vulnerable, and please put the needs of the constituents first. Read more Conservative Johnny Mercer increases majority in Plymouth Moor... \nMr Swire became Principal Private Secretary (PPS) to Rt Hon Theresa May MP, the then Chairman of the Conservative Party (2003), then an Opposition Whip (2003) and was appointed Shadow Minister for the Arts in 2004. He served in David Cameron's first Shadow Cabinet as the Shadow Secretary of State for Culture, Media and Sport from 2005. \nFollowing the May 2010 General Election, he was first appointed Minister of State for Northern Ireland in the Coalition Government. \nIn September 2012, he was appointed Minister of State at the Foreign and Commonwealth Office, until he retired to the backbenches in July 2016 and became the Chairman of the Conservative Middle East Council after Theresa May became leader of the Conservative Party. ", "external_links": [], "published": "2017-06-09T12:10:00.000+03:00", "crawled": "2017-06-09T08:11:41.012+03:00", "highlightTitle": ""}