{"organizations": [], "uuid": "5c4b4fe92e1f2bbe444ed52c98d387b087871ce1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.plymouthherald.co.uk/images/localworld/ugc-images/276351/Article/images/30400868/16052200.jpg", "site_section": "", "section_title": "", "url": "http://www.devonlive.com/8203-press-ctrl-alt-del-and-reboot-britain-keith-rossiter/story-30400868-detail/story.html", "country": "GB", "title": "​Press Ctrl+Alt+Del and reboot Britain - Keith Rossiter | Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "", "spam_score": 0.171, "site_type": "news", "published": "2017-06-21T01:19:00.000+03:00", "replies_count": 0, "uuid": "5c4b4fe92e1f2bbe444ed52c98d387b087871ce1"}, "author": "Western Morning News", "url": "http://www.devonlive.com/8203-press-ctrl-alt-del-and-reboot-britain-keith-rossiter/story-30400868-detail/story.html", "ord_in_thread": 0, "title": "​Press Ctrl+Alt+Del and reboot Britain - Keith Rossiter | Devon Live", "locations": [], "entities": {"persons": [{"name": "keith rossiter", "sentiment": "none"}, {"name": "goodwin", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "nigel farage", "sentiment": "none"}, {"name": "fred", "sentiment": "none"}, {"name": "eric bloodaxe", "sentiment": "none"}, {"name": "tony blair", "sentiment": "none"}, {"name": "fred goodwin", "sentiment": "none"}, {"name": "fred the shred", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "grenfell tower", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "rbs", "sentiment": "none"}, {"name": "natwest", "sentiment": "none"}, {"name": "amstrad", "sentiment": "none"}, {"name": "royal bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "​Press Ctrl+Alt+Del and reboot Britain - Keith Rossiter X \nCopy link to paste in your message / Comments (0) \nIf you work for a company with an IT department, you're probably familiar with the question: \"Have you tried rebooting your computer?\" \nIt works for wonky computers, so perhaps it might work for an entire country. Nothing on the national screen seems to make sense any more. \nThe EU referendum was complete madness. Even if you truly wanted out of Europe, you must surely admit that such a momentous decision should never be taken on the basis of a simple majority. \nAnywhere else, such constitutional decisions require a majority of at least 60%. Before the vote last June, Nigel Farage said that if he lost by a slender margin he would demand a second \nreferendum – and it's about the only thing he's ever said that I agree with. Brexit was when our nation's hard drive began to make disturbing sounds, but the damage began long before. Bankers and City gents have been treating us like fools for years. \nFred Goodwin, the former Royal Bank of Scotland boss, is not alone, but he's emblematic of the underlying problem. Mr Goodwin helped bring down RBS in 2008 but Fred \"the Shred\" as he was no doubt proud to be nicknamed, had already cut a swathe through the banking sector. \nHis empire-building began with the hostile takeover of NatWest in 2000, where he cut 18,000 jobs. That's 18,000 people on the dole. Nice. \nFor this and other such business decisions, he was knighted by Tony Blair in 2004 \"for services to banking\". You might just as well knight Eric Bloodaxe for services to brain surgery, as I wrote at the time. \nNine years of austerity later, and here we are, still picking up the tab for the likes of Fred the Shred, with public sector pay rises stuck on 1% while fat cats write themselves blank cheques. \nThere's a touching loyalty to the notion of \"Great\" Britain, but voting for Brexit was akin to tossing out your laptop and trying to use the Amstrad PC you bought in 1992 and still keep in the loft. \nThe real virus in Britain's operating system was not Europe, or migrants, or asylum-seekers – it was an elite who thought the man and woman in the street was there just to be milked. \nYou wouldn't put up a statue in the park without asking residents what they think, \nbut communities have been transformed by migration that was decided in Westminster (not Brussels, by the way) without a word of consultation. \nEvery time things went wrong, the elites blamed Brussels, so that in the end the voters were itching to ditch the EU. \nSo, like a computer painfully grinding out its last, 2008 led to Brexit, and Brexit led to 2017's general election. \nNow Theresa May is frozen on our screens, unable to move forward, back or sideways. Unable, even, to face up to the families who lost everything in the Grenfell Tower fire. \nOnly a reboot will get us out of this. \nUninstalling the EU software won't help when then problem is on the motherboard itself. ", "external_links": [], "published": "2017-06-21T01:19:00.000+03:00", "crawled": "2017-06-20T23:17:46.009+03:00", "highlightTitle": ""}