{"organizations": [], "uuid": "ada108eec28ce5ea06beb4b3c63dc506c9de9382", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13195504.ece/ALTERNATES/s1200/France-v-England-International-Friendly.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/calls-theresa-abandon-plans-take-13195167", "country": "GB", "domain_rank": 21960, "title": "Calls for Theresa May to abandon plans to take back control of immigration as Brexit talks loom", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-18T15:00:00.000+03:00", "replies_count": 0, "uuid": "ada108eec28ce5ea06beb4b3c63dc506c9de9382"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/calls-theresa-abandon-plans-take-13195167", "ord_in_thread": 0, "title": "Calls for Theresa May to abandon plans to take back control of immigration as Brexit talks loom", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "catherine mckinnell", "sentiment": "none"}, {"name": "phil wilson", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "wilson", "sentiment": "none"}, {"name": "gerard collomb", "sentiment": "none"}, {"name": "jonathan walker", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "westminster", "sentiment": "none"}, {"name": "sedgefield", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "north east technology park", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "newcastle north", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "hitachi", "sentiment": "none"}, {"name": "cancel play", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "north east chamber of commerce", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Calls for Theresa May to abandon plans to take back control of immigration as Brexit talks loom The United Kingdom should keep freedom of movement after Brexit to protect jobs, says Sedgefield MP Phil Wilson Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nTheresa May is under pressure to rethink plans to control immigration from EU countries after Brexit , following the General Election which left her leading a minority Government at Westminster. \nNorth East MP Phil Wilson said the UK should continue to allow freedom of movement with EU nations, so that it could remain a member of the EU single market and protect jobs. \nHe said countries such as Germany and France might consider reforms to freedom of movement laws, including tougher enforcement of an existing rule that states EU migrants should leave the country after three months if they fail to find work and do not have enough money to support themselves. \nAnd he said the UK could also consider bringing back controversial plans for identity cards, which would make immigration easier to control. \nMr Wilson, Labour MP for Sedgefield, said: “Countries like France and Germany would be willing to sit down and look at freedom of movement again. But we’ve got to be brave enough and we’ve got to strong enough to consider that.” \nThe proposal would mean giving up the Government’s plan - also backed by the Labour leadership - to take back control of UK borders after Brexit. \nBut Mr Wilson said retaining membership of the single market would safeguard vital North East jobs at firms like Hitachi and the North East Technology Park in his constituency. \nAnd employers are also calling on the Prime Minister ensure workers are able to come into the UK after Brexit. British Prime Minister Theresa May and French Interior Minister Gerard Collomb (Photo: Getty Images Europe) \nJonathan Walker, head of policy and campaigns at the North East Chamber of Commerce , said Mrs May must listen to employers “to avoid any unnecessary economic harm”. \nHe said: “As a strong exporting region, our firms must continue to enjoy frictionless trade with their biggest markets. We know that compromises will need to be reached, but these should not throw insurmountable trade barriers in front of our exporters. \n“Similarly, the Government must be held to its promise to negotiate new trade deals around the world and must provide far more resources to support businesses looking to break into new markets. \n“Any discussions on future immigration policy must balance political needs with a recognition that our businesses operate in a global market for talent. \n“North East firms must not be hampered in their efforts to bring the brightest and best skilled workers to our region. \n“Again, the Government must commit to understanding where those skills needs exist and must provide reassurances that Brexit will not exacerbate skills shortages.” Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nMr Wilson said the result of the General Election, in which Mrs May asked voters to give her a mandate for her vision of Brexit, showed that a different approach to Brexit is needed. \nHe said: “Her idea of a hard Brexit and potentially leaving the EU without a deal has to be taken off the table now. \n“I don’t think Parliament wants that and I don’t think the British people want that. \n“It’s a hung Parliament and there should be a cross-party approach.” \nNewcastle North MP Catherine McKinnell highlighted Mrs May’s warning that “no deal is better than a bad deal”, which suggests the UK could leave the EU without a trade deal. \nShe said: “It’s staggering we are now in this position. On the eve of one of the most important moments in modern history for Britain, we still don’t have a proper Government in place and we have no idea what their programme will be over the coming months as it appears their manifesto has been torn up just a week after an election which they called. \n“Instead of strong and stable leadership, we have an uncertain and weak Prime Minister determined to plough ahead with vital Brexit negotiations because of a timetable that was also entirely self-imposed. \n“Theresa May’s lack of judgement and poor decision-making has been clearly exposed since she became Prime Minister, and this is a real concern now that the Brexit negotiations are upon us. \n“The risks to the North East of a bad Brexit deal are huge. Almost 60% of our exports currently go to the EU, with many thousands of jobs dependent on that trade. \n“We simply cannot afford for her to get this wrong, and we certainly can’t accept her totally misguided view that no deal is better than a bad deal. No deal is a bad deal for our region, and that cannot be allowed to happen.” Read More", "external_links": [], "published": "2017-06-18T15:00:00.000+03:00", "crawled": "2017-06-18T10:15:26.010+03:00", "highlightTitle": ""}