{"organizations": [], "uuid": "7046360a792f36ab2361747dabd7ae0631e33a03", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30380601/16036825.jpg", "site_section": "http://www.westernmorningnews.co.uk/all-content.rss", "section_title": "Devon Live All Content Feed", "url": "http://www.devonlive.com/conservative-anne-marie-morris-retains-newton-abbot-seat/story-30380601-detail/story.html", "country": "GB", "title": "Zoe_Stevens published Conservative Anne Marie Morris retains Newton Abbot seat - Full...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-09T11:35:00.000+03:00", "replies_count": 0, "uuid": "7046360a792f36ab2361747dabd7ae0631e33a03"}, "author": "Zoe_Stevens", "url": "http://www.devonlive.com/conservative-anne-marie-morris-retains-newton-abbot-seat/story-30380601-detail/story.html", "ord_in_thread": 0, "title": "Zoe_Stevens published Conservative Anne Marie Morris retains Newton Abbot seat - Full...", "locations": [], "entities": {"persons": [{"name": "anne marie morris", "sentiment": "none"}, {"name": "marie", "sentiment": "none"}, {"name": "dawlish", "sentiment": "none"}, {"name": "stokeinteignhead", "sentiment": "none"}, {"name": "newton abbot", "sentiment": "none"}, {"name": "anne marie", "sentiment": "none"}, {"name": "shaldon", "sentiment": "none"}, {"name": "teignbridge", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "marie chadwick", "sentiment": "none"}, {"name": "james osben", "sentiment": "none"}, {"name": "mrs morris", "sentiment": "none"}], "locations": [{"name": "newton abbot", "sentiment": "none"}, {"name": "newton abbot leisure centre", "sentiment": "none"}, {"name": "teignbridge", "sentiment": "none"}, {"name": "ipplepen", "sentiment": "none"}, {"name": "bishopsteignton", "sentiment": "none"}, {"name": "kingsteignton", "sentiment": "none"}], "organizations": [{"name": "university technical college", "sentiment": "none"}, {"name": "newton abbot", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "liberal democrats", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Conservative Anne Marie Morris retains Newton Abbot seat - Full report By Zoe_Stevens | Posted: June 09, 2017 0 COMMENTS SHARES Conservative Anne Marie Morris held on to her Newton Abbot seat with ease for the third time. Conservative Anne Marie Morris retains Newton Abbot seat - Full report X \nCopy link to paste in your message / Conservative Anne Marie Morris held on to her Newton Abbot seat with ease for the third time. Comments (0) \nConservative Anne Marie Morris held on to her Newton Abbot seat with ease for the third time. \nShe finished the night with over twice as many votes as her nearest rival, Labour Party candidate James Osben, with the Liberal Democrats a close third. \nIt was a landslide victory for the Conservatives in the Newton Abbot constituency after the Labour bid for the local parliamentary seat collapsed at around 2am on Friday. \nAnne Marie Morris won her third term as the Newton Abbot MP with a whopping 28,635 votes against Labour James Osben's 11,475 votes. \nA smiling Mrs Morris said she felt 'privileged' that she had been given the chance to perform her duties as an MP once again, and praised the 'credible opposition' who ran against her. \n\"I feel so privileged,\" she said. \"It is an incredible role to fill. It's the only thing I think I've ever done in my overall life career which has enabled me to give so much back, and just the ability to deliver so much to so many people in so many different areas. Whether it's railway infrastructure, or the new University Technical College, across the board you can make a difference and as I've discovered, even as a backbencher, you can actually do quite a lot. \n\"I think it was a good healthy fight. No candidate wants to have no opposition and no credible opposition, and I think both Labour and the Liberal Democrats did extremely well. And I think we need to have a country which runs the country, and at least good opposition to run with it, and I think today we've seen a move in that direction, which is good.\" \nEarlier that night, Mrs Morris said that she hadn't had enough information yet to predict her own victory, but said that she would have to 'wait and see'. \nShe said: \"I haven't seen enough boxes to say what will happen with this seat yet, it's really much too early to tell anything at the moment.\" \n\"It was a good campaign. We managed to get out as much as we possibly could. It's been really quite different to the last campaign where we had much more time. But when you're running something like this for a short period like five or six weeks, that's really not very long to get everything done that you want to get done. But that said, we've put absolutely everything we have into it, and we'll have to wait and see if that paid off.\" \nThe count took place at Newton Abbot Leisure Centre. The verification of votes began at 10pm on Thursday and ended around four hours later with the announcement of the winner at 2am. \nA total of 72 per cent of the electorate turned out to vote in the Newton Abbot constituency which includes the wards of Bishopsteignton, Newton Abbot, Dawlish, Ipplepen, Kingsteignton, Shaldon, Stokeinteignhead and Teignmouth. \nSpeaking in the early hours of Friday morning, Labour candidate James Osben, who came second place in the count, said: \"It's amazing actually. The result is probably better than we could have expected. It would have been amazing to win, but we weren't expecting that given the previous results. I think everyone thought that the odds were against us, but we've proven that isn't the case. At least, not anymore, and if you put the effort and the energy into the campaign, then you will see results. And that's what we've seen here today. \nHe offered his congratulations to Conservative candidate Anne Marie Morris, but said that he hoped she'd do 'something better' with her next term. \nHe said: \"Congratulations to Anne Marie for winning. I hope she does better things in this term of parliament to improve things for the record.\" \nMarie Chadwick, who stood for the Liberal Democrats and came a close third after the Labour party, said: \"The Lib Dems were squeezed here by the national message. On one hand, people want Theresa May to deliver a strong Brexit. Whether she can do that or not is another matter. But people are also crossed with their public services being underfunded time and time again, and I think we've been slightly stuck in the middle. But I think what's really positive is that the Teignbridge constituency still has a lot of really good Liberal Democrats. We're going to work really hard, and I don't think it will be that long until the next election. \n\"We'll be back on the campaign trail on Monday, showing Teignbridge why it should have a Liberal Democrat MP. \nMarie didn't rule out a return to Teignbridge politics, and said that she would continue to serve the community 'in some capacity'. \n\"I will be here in some capacity. That's the thing I love about here; you can make a difference whether you're on the council or not, because we have a great community. I'm looking forward to serving that community in whatever capacity.\"", "external_links": [], "published": "2017-06-09T11:35:00.000+03:00", "crawled": "2017-06-09T08:11:45.004+03:00", "highlightTitle": ""}