{"organizations": [], "uuid": "178a4872087bdc6e67fdb0f62cf7c2585bb2a8cc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30388290/16042880.jpg", "site_section": "", "section_title": "", "url": "http://www.devonlive.com/devon-house-price-rises-defy-brexit-what-is-your-home-worth-now/story-30388290-detail/story.html", "country": "GB", "title": "Devon house price rises defy Brexit: what is your home worth now? | Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "", "spam_score": 0.472, "site_type": "news", "published": "2017-06-14T03:42:00.000+03:00", "replies_count": 0, "uuid": "178a4872087bdc6e67fdb0f62cf7c2585bb2a8cc"}, "author": "", "url": "http://www.devonlive.com/devon-house-price-rises-defy-brexit-what-is-your-home-worth-now/story-30388290-detail/story.html", "ord_in_thread": 0, "title": "Devon house price rises defy Brexit: what is your home worth now? | Devon Live", "locations": [], "entities": {"persons": [{"name": "devon", "sentiment": "none"}, {"name": "torridge", "sentiment": "none"}, {"name": "richard snook", "sentiment": "none"}, {"name": "jeremy leaf", "sentiment": "none"}], "locations": [{"name": "exeter", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "north devon", "sentiment": "none"}, {"name": "cornwall", "sentiment": "none"}, {"name": "north west", "sentiment": "none"}, {"name": "wales", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "tavistock", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}, {"name": "salcombe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "kingsbridge", "sentiment": "none"}, {"name": "west devon", "sentiment": "none"}, {"name": "tamar", "sentiment": "none"}, {"name": "east", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}], "organizations": [{"name": "royal institution of chartered surveyors", "sentiment": "none"}, {"name": "office for national statistics", "sentiment": "none"}, {"name": "ons", "sentiment": "none"}, {"name": "pwc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Comments (1) \nHouse prices in Exeter are rising twice as fast in Plymouth, new official figures published today show. \nProperty prices nationally rose 5.7 per cent for the year to April, the Land Registry's latest data showed on Tuesday, making the average home worth £236,519. \nExperts says the market has defied the Brexit slowdown and bounced back. \nDevon saw a lower overall rise of 4.2 per cent over the 12-month period, leaving a home in the county valued on average at £243,072. \nThe biggest increase was eat Devon, where an 8.3 per cent rise took prices to £271,141. \nA fraction behind was the city of Exeter, where homes soared by 8.2 per cent compared to 4.1 per cent in Plymouth. \nExeter's average home is now almost worth a quarter of a million, at £249,571, up from £230,680 in April 2016, the House Price Index said. \nPlymouth property is on average valued at £167,383 while across the Tamar in Cornwall prices rose 3.2 per cent to £219,094. \nWest Devon, including Tavistock, saw the next biggest rise with the average up 7.5 per cent to 239,337. \nTorbay's average price went up 5.9 per cent to make a home in the resort area worth £190,965, followed by mid Devon where the average crept up 5.1 per cent to £218,525. \nTorridge saw a 3.8 per cent rise to £214,647 followed by nearby North Devon where a 2.7 per cent increase took the average price to £221,244. \nThe sought-after South Hams, where Salcombe and Kingsbridge have enjoyed huge rises and some of the highest value sales outside London, prices have crashed. \nThe year to April saw prices plunged 6.9 per cent, leaving the average price at £276,609, still the highest in the county. \nHouse price growth in London accelerated for the first time in nearly a year, according to the index, regarded by professionals as the most accurate guide to the market. \nLondon property values increased by 4.7 per cent in the 12 months to April, taking the average price to £482,779, data released jointly by the Office for National Statistics (ONS), the Land Registry and other bodies showed. \nThe annual growth rate was 1.5 percentage points higher than in the year to March 2017. \nThe report said: \"This is the first time in 11 months that the rate of price growth in London has increased.\" \nHouse price growth also bounced back across the UK generally, with a 5.6 per cent increase in the year to April 2017, up from 4.5 per cent in the year to March. \nAcross the UK, the average house price stood at £220,000 in April, following a 1.6% month-on-month increase. \nThe main contribution to the increase in UK house prices came from England, where house prices increased by 5.7 per cent over the year to April, with the average price now £237,000. \nWales saw house prices increase by 4.2 per cent over the previous 12 months to reach £148,000. \nIn Scotland, the average price increased by 6.8 per cent over the year to £146,000. \nThe average price in Northern Ireland currently stands at £124,000, marking an increase of 4.3 per cent over the year. \nWithin England, the East showed the highest annual growth, with prices increasing by 8.1 per cent in the year to April. \nThis was followed by the South West at 6.8%. The lowest annual growth was in the North East, where prices increased by 0.6% over the year, followed by the North West at 4.1%. \nAcross Britain, a first-time buyer faces paying 5 per cent more for a home than a year ago, with the average price paid by the sector now at £185,266. \nCommenting on the figures, Richard Snook, a senior economist at PwC, said: \"These figures go against the recent trend of a Brexit-related slowdown that we predicted last year but remain consistent with our guidance of 2 per cent to 5 per cent growth in 2017 as a whole.\" \nJeremy Leaf, a north London estate agent and a former residential chairman of the Royal Institution of Chartered Surveyors, said: \"Looking forward until the politics have been resolved, many will be adopting a wait-and-see attitude as far as decision-making is concerned and property will be no exception.\"", "external_links": [], "published": "2017-06-14T03:42:00.000+03:00", "crawled": "2017-06-14T01:43:15.004+03:00", "highlightTitle": ""}