{"organizations": [], "uuid": "4d75e9b06037d3783d3857f3de042a0b88b16684", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12597452.ece/ALTERNATES/s1200/The-Co-op-Bank-Puts-Itself-Up-For-Sale.jpg", "site_section": "", "section_title": "", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13203458", "country": "IE", "domain_rank": 21960, "title": "Business Breakfast LIVE: Co-operative Bank in advanced rescue package talks with investors - Chronicle Live", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.031, "site_type": "news", "published": "2017-06-19T15:17:00.000+03:00", "replies_count": 0, "uuid": "4d75e9b06037d3783d3857f3de042a0b88b16684"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13203458", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Co-operative Bank in advanced rescue package talks with investors - Chronicle Live", "locations": [], "entities": {"persons": [{"name": "noel edmonds", "sentiment": "negative"}, {"name": "bonmarche", "sentiment": "none"}, {"name": "antonio horta-osorio", "sentiment": "none"}, {"name": "coreena ford", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "edmonds", "sentiment": "none"}, {"name": "horta-osorio", "sentiment": "none"}, {"name": "coreena ford bonmarche", "sentiment": "none"}, {"name": "helen connolly", "sentiment": "none"}, {"name": "hubertus vath", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "frankfurt", "sentiment": "none"}, {"name": "bristol", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "co-operative bank", "sentiment": "negative"}, {"name": "bonmarche", "sentiment": "none"}, {"name": "lloyds banking group", "sentiment": "none"}, {"name": "deutsche borse", "sentiment": "none"}, {"name": "london stock exchange", "sentiment": "none"}, {"name": "european commission", "sentiment": "none"}, {"name": "frankfurt main finance", "sentiment": "none"}, {"name": "lloyds", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "lch", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "eurex", "sentiment": "none"}, {"name": "unique group", "sentiment": "none"}, {"name": "hbos", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford Restaurant and bar The Glass House to open in Cramlington shopping centre \nA popular Newcastle restaurant and bar is to open its second outlet with a site at a retail park . \nGlass House, which has a site on Newcastle’s Dean Street, is to open a bar at the Manor Walks shopping centre in Cramlington. \nThe bar and restaurant will add to a growing host of leisure operators at Manor Walks, which already has a nine-screen cinema, bowling alley, leisure centre, pub and a number of dining outlets. \nRefurbishment of the 120-seater restaurant is currently underway, and Glass House Cramlington will create 42 new jobs when it opens in July. Owners Mark and Kelly Nigrelli outside Glass House Cramlington (Photo: www.crestphotography.co.uk) 8.45 Coreena Ford Leading North East business figures in Queen's Birthday Honours list \nSome of the best known figures in the North East’s business community have received honours in the Queen’s Birthday Honours list . \nAmong them is Louise Hunter, Northumbrian Water’s director of corporate affairs, has received an MBE for services to business and corporate social responsibility. \nMeanwhile, Prof Jane Turner, who heads up Teesside University’s business and enterprise agenda, has been appointed an OBE for her services to business engagement. \nAlso receiving an OBE was Prof Roy Sandbach, director of the National Innovation Centre for Ageing at Newcastle University. \nThere was an OBE too for Sunderland City Council’s head of automotive, investment and business support, Tom Hurst, and an MBE for Kate Wickham. managing director of Gate7 Ltd in Gateshead. \nAnd Paul Smith, who set up Newcastle accelerator programme Ignite and Campus North six years ago as a business angel-led accelerator, and is now Global Field Operations on the Hyperloop One project, was awarded an MBE. Prof Roy Sandbach Coreena Ford Massive road and rail improvements needed to help North East achieve its potential \nMajor improvements in the North East’s road and rail links are needed if the region is to achieve its economic potential, an influential transport body will today say. \nTransport for the North (TfN), an organisation formed by business and council leaders across the region, has called for largescale upgrades on roads like the A1, A19 and A69, as well as upgrades to the region’s rail system. \nThe call has come as TfN publishes the evidence that will inform its plan to help create nearly a million new jobs and add up to £100bn to the UK economy. \nTfN says its plan will benefit people and businesses across the North, with the organisations involved hoping their combined voice will provide greater weight as funding decisions are made by the Government and bodies like Highways England and Network Rail. \nThe report will be one of the last acts of TfN chief executive David Brown before he leaves to work at Sunderland transport group Arriva. \nHe said: “The publication of this evidence is a pre-cursor to our multi-modal Strategic Transport Plan, which will be published for consultation later this year. The work presents a compelling case for change, underlining the economic and strategic benefits of improving freight and passenger transport across the whole of the North to drive economic growth. \n“We want to enable the North to make a more significant contribution to the UK economy, through higher productivity, while also increasing job opportunities. Miles of traffic queuing on the A1 8.30 Coreena Ford Unison to push for public-sector pay rise \nThe shock election result will be a turning point in the campaign against austerity and moves will now be stepped up to scrap the cap on public-sector pay, a senior union leader has said. \nDave Prentis, general secretary of Unison, said Labour’s success had led to a growing belief that years of restrictive policies can be reversed. \nSpeaking ahead of Unison’s annual conference tomorrow, Mr Prentis said: “We will now have a big push to improve the pay of public-sector workers. \n“We are living in a completely unfair society and people are sick and tired of policies in favour of the very rich in our society when they are finding it difficult to put food on the table. \n“They earn less now than they did eight years ago.” \nMr Prentis said Unison had dealt with huge job losses in the public sector in recent years but had emerged stronger than ever, with new members, especially young workers, joining the union “in droves”. \nHe said: “They want us to take on the unfairness in society and the crisis now gripping social care and the NHS.” A Unison flag flies in front of the sun (Photo: Andrew Matthews/PA Wire) 8.25 Coreena Ford Durham X-ray company launches international strategy \nX-ray specialist IBEX Innovations is planning to export its products around the world in an effort to boost turnover by £150,000 within 12 months. \nBased in Sedgefield’s NETPark, IBEX uses X-rays to produce images that can be used in a variety of sectors, such as medical, security, electronics, and food inspection. \nThe firm is now looking to expand internationally by selling its products around the world. Over the next year it intends to add £150,000 to its top line and create four new jobs. \nTo launch its international plans, IBEX attended the European Congress of Radiology in Vienna, to promote its technology within the medical community. The conference allowed the firm to develop new relationships with potential customers and suppliers from the USA, Japan and Europe. \nKurt Scott, grants and project delivery manager at IBEX, said: “The conference was a resounding success. We had really positive responses from companies and clinicians interested in our technology. \n“Being able to attend events like this is invaluable as it means we are able to actively engage with market leaders.” \nIBEX was founded in 2010 by Dr Gary Gibson as a consultancy firm but has since started developing its own technology. The company now employs 17 highly skilled scientists, engineers and business professionals. \nThe team has been working for three years to make its technology suitable for the medical sector, which accounts for 80% of the X-ray imaging market. \nIBEX was able to attend the conference after receiving support from the Department for International Trade. Kurt Scott of IBEX Innovations 8.20 KEY EVENT Filtronic directors hail 'tremendous' progress ahead of full year results \nThe chief executive of County Durham tech firm Filtronic plc has revealed the firm has made ‘tremendous’ progress in a year in which it expects to get back in the black, reversing last year’s £6.8m loss. \nThe firm, which designs and makes microwave electronics products for the wireless telecoms infrastructure, issued a trading update for the 12-month period to 31 May 2017, ahead of announcing the full year results in August. \nThe Board expects, subject to audit, to report group revenue of approximately £35.4m - a considerable increase on the previous year’s £13.6m - and operating profit before amortisation of intangibles of approximately £1.7m, compared to 2016’s operating loss of £6.8m. \nThe Filtronic Wireless business more than tripled sales revenue in the year to £30.5m and sales revenue in the Filtronic Broadband business, base in Sedgefield, was approximately £4.9m for the year, giving year on year sales growth of 7%. \nRob Smith, CEO of Filtronic plc,said: “Tremendous progress was made through FY2017 that has resulted in the Group achieving both profitability and cash generation. \n“We are mindful that our revenues have historically been very concentrated and we are working hard to broaden our customer base and product range so that the business is more robust”. Filtronic chief executive Rob Smith 8.15 KEY EVENT Noel Edmonds reveals he was pushed to brink of suicide after financial fraud destroyed his business \nNoel Edmonds came close to taking his own life after falling victim to financial fraud, the Deal or No Deal star has revealed as he continues to seek compensation from Lloyds Banking Group. \nMr Edmonds said he was taken “to the brink of emotional annihilation” after a group of corrupt HBOS financiers helped destroy his former business Unique Group. \nThe TV star said: “Until these criminals took me to the brink of emotional annihilation, I had always felt those who opt out by taking their own lives were selfish and cowardly. \n“But having been cast into that bottomless dark space devoid of logic and reason, I have a much deeper understanding of life without hope. \n“I seek no sympathy and feel no shame in admitting that on the evening of January 18th 2005 I attempted to end the overwhelming mental pain which had consumed my whole being. \n“The fact that I did not become another suicide statistic is solely due to the swift response of a Devon ambulance crew and the compassionate support of the Priory in Bristol.” \nThe former HBOS financiers were jailed earlier this year for carrying out a £245m loans scam that destroyed several businesses, including that of Mr Edmonds, before they squandered the profits on high-end prostitutes and luxury holidays. \nLloyds, which rescued HBOS during the financial crisis, said in April it would begin making compensation offers to fraud victims in May from a £100m pot, with payments expected to begin in June. \nHowever, Mr Edmonds has repeatedly urged Lloyds to speed up the process after launching a £50m-plus compensation claim against the lender. \nHe has even gone as far as to set up a website as part of his campaign, which also references Lloyds chief executive Antonio Horta-Osorio’s “well-publicised mental breakdown” in 2011. \nMr Edmonds has asked several times for a personal meeting with Mr Horta-Osorio but claims his requests have gone unanswered. \nMr Edmonds added that, since coming back from the brink of suicide, he has gone on to donate generously to third sector organisations, including The Samaritans. \nLloyds has said that its compensation programme is “on track” and the lender has started making payments to some of those affected. \nA spokesman for Lloyds Banking Group said: “Our customers’ safety is of paramount importance to us. \n“We have a clear policy that if a customer says that they are considering taking their own life that we must take the statement seriously and take action to protect them. \n“In such instances, police are notified and, where possible, provided with the customer’s location in order that they can go to the customer and ensure their safety.” Noel Edmonds, who came close to taking his own life after falling victim to financial fraud. 8.10 Coreena Ford Euro clearing businesses moving accounts to Frankfurt, lobby group claims \nEuro clearing businesses are already moving accounts to Frankfurt, just days after the EU released proposals that could force operators to leave London as a result of Brexit, the head of the German city’s lobby group has said. \nHubertus Vath, the managing director of Frankfurt Main Finance, said that he has seen commitment to Frankfurt “speeding up” after the European Commission put forward legislative reforms that would impose stricter supervision of the bloc’s derivatives market after Brexit. \n“We see a significant rise in the account openings of Eurex Clearing, we see a lot of actors that are doing test trades.” \nEurex is owned by Deutsche Borse and is Germany’s equivalent to the London Stock Exchange’s LCH, which conducts the vast majority of euro denominated clearing. \nHe added that “some of the big actors have already committed themselves to move their clearing business”. including German house KfW. \nIt is the first sign that London’s hold on the multibillion-pound euro clearing market in derivatives - which settles business and trade conducted in the EU currency - is starting to slip. 8.05 Coreena Ford Bonmarche profits hit by sterling slide \nWomenswear retailer Bonmarche has reported a slump in full year profits as a combination of Brexit pressures and unseasonal weather contributed to a “challenging” retail market. \nThe group said that pre-tax profits tumbled 39.4% to £5.8m in the year to April, with like for like sales falling 4.3%. \nThe company said: “The apparel market has been in decline, with demand affected by consumers’ response to factors such as inflation, the referendum on Brexit, and unseasonal weather patterns, which, as we have noted in the past, significantly influence our customers’ shopping habits.” \nThe collapse in the value of the pound following the decision to quit the European Union has hammered British businesses and consumers, ramping up import costs and, as a result, shop prices. \nTotal revenue at Bonmarche nudged up 1% to £190.1m and chief executive Helen Connolly, who took up her role last year, said the business is now “well positioned” for growth. \nShe said: \nA combination of internal and external factors over the past year prevented us from improving at the rate we had aimed for. \nHowever, we believe that the business is now well positioned, with a compelling proposition and robust plan. \nIt is clear that the direction of travel is broadly right, albeit the effectiveness of execution needs to improve. Our update today provides further detail on the areas where we see the greatest opportunities and how we are already beginning to address these. A Bonmarche store", "external_links": [], "published": "2017-06-19T15:17:00.000+03:00", "crawled": "2017-06-19T10:19:58.005+03:00", "highlightTitle": ""}