{"organizations": [], "uuid": "c9adf9f4ceec5bd350316f8f6698146e862965a0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12954959.ece/ALTERNATES/s1200/Syria-conflict.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/boris-johnson-speech-north-east-13143335", "country": "GB", "domain_rank": 21960, "title": "Boris Johnson's North East visit LIVE: Foreign secretary to deliver speech criticising Jeremy Corbyn", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-06T16:08:00.000+03:00", "replies_count": 0, "uuid": "c9adf9f4ceec5bd350316f8f6698146e862965a0"}, "author": "Tom Eden", "url": "http://www.chroniclelive.co.uk/news/north-east-news/boris-johnson-speech-north-east-13143335", "ord_in_thread": 0, "title": "Boris Johnson's North East visit LIVE: Foreign secretary to deliver speech criticising Jeremy Corbyn", "locations": [], "entities": {"persons": [{"name": "jeremy corbyn johnson", "sentiment": "negative"}, {"name": "boris johnson", "sentiment": "negative"}, {"name": "kevin maguire", "sentiment": "none"}, {"name": "johnson", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "toby harris", "sentiment": "none"}, {"name": "corbyn  johnson", "sentiment": "none"}, {"name": "boris johnson tom eden", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "tom eden", "sentiment": "none"}, {"name": "alex salmond", "sentiment": "none"}, {"name": "tony blair", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "jeremy corbyn  blustering boris johnson", "sentiment": "none"}, {"name": "mary turner/pa wire", "sentiment": "none"}, {"name": "mr speaker", "sentiment": "none"}, {"name": "mr johnson", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "sadiq khan", "sentiment": "none"}, {"name": "tom eden how", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "islington", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "iraq", "sentiment": "none"}, {"name": "north east  hot", "sentiment": "none"}, {"name": "london bridge", "sentiment": "none"}], "organizations": [{"name": "house of commons", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "bbc", "sentiment": "none"}, {"name": "snp", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Tom Eden Trump's press secretary challenged over Khan tweets \nHere’s the back-and-forth between Donald Trump’s deputy press secretary Sarah Huckabee Sanders and a tenacious American journalist about Trump’s misleading and misquoted use of Sadiq Khan’s words: Terrorism Tom Eden Johnson refuses to talk about Saudia Arabia inquiry \nForeign Secretary Boris Johnson refused to discuss claims that Prime Minister Theresa May has suppressed an official inquiry which reportedly points the finger at Saudi Arabia for funding extremist groups in the UK. (Photo: Getty Images Europe) \nMrs May is under growing pressure to release the report, which was commissioned by her predecessor David Cameron. \nLiberal Democrat leader Tim Farron says that Mr Cameron promised him it would be published in the spring of 2016, but it is yet to emerge. \nAnswering questions following a speech in County Durham, Mr Johnson said that he was not aware of a report of that kind, but would anyway not be willing to discuss a “confidential” paper. \nThe Foreign Secretary told reporters: \n“I can’t comment on any confidential report, but you are making a valid point about the role of other countries, governments or not, in funding, wittingly or not, groups that may be responsible for terrorism and in funding mosques where all sorts of hate-filled nonsense is being spouted. \n“We’ve got to stop that, and you’re right that we’ve got to work with those countries to cut it out. \n“We need to cut the funding to terrorism, just as Theresa rightly says we need to stop this stuff being transmitted over the internet. \n“We need to work with the great internet companies - principally American companies - to stop it. \n“But that should in no way exculpate the criminals, the scumbags, who are responsible for terrorist atrocities in our country and around the world.” \nMr Cameron agreed to the inquiry into foreign funding of Islamist extremists in 2015 as part of a deal with the Lib Dems in return for their support on the extension of air strikes into Syria. \nReports last week suggested that the findings may never be published because of the sensitivity of information about Saudi Arabia, though the Home Office said a decision on its release would be made after the election. \nAsked whether it was being suppressed, Mr Johnson said: \n“We have plenty of stuff that we don’t publish. \n“I will dig it out and have a look at it, if that’s what you want me to do, but as far as I know we do not have a confidential report of the kind you describe.” 13:32 Tom Eden Trump WILL get a state visit \nAsked if Mr Trump’s official trip to Britain will go ahead, Mrs May said: “Yes”. (Photo: Getty Images North America) \n“I’ve said for a long time that I think that the invitation from Prime Minister Theresa May to Donald Trump for a state visit was premature. \n“State visits are given to world leaders who have had a distinguished service, who have a track record, and in the circumstances, where Donald Trump as president had a Muslim ban, had changed the policies of the USA, the long-standing policies around refugees, in the circumstances when many British people disagree with many of Donald Trump’s policies, we shouldn’t be having a state visit. \n“Of course we should carry on talking to Donald Trump, the USA are close allies of ours. We have a special relationship and we should work closely with the Americans. \n“But one of the things about a special relationship is it is like having a best friend. You stand shoulder to shoulder with them in times of adversity but you call them out when they are wrong and you tell them when they are wrong. \n“I think on many, many things, Donald Trump is wrong.” \nAsked about the spat with Mr Trump, Mr Khan told ITV1’s Good Morning Britain: “We’re not kids in a playground, he’s the president of the US. I’m too busy to respond to his tweets, isn’t he busy?” 13:29 Tom Eden May finally condemns Trump's attack on Sadiq Khan \nAway from the Boris Johnson visit for a moment — Theresa May has finally condemned US President Donald Trump’s Twitter attacks on London Mayor Sadiq Khan as “wrong”. (Photo: AP) \nMr Khan has called for the US President’s planned state visit to the UK to be scrapped, but Mrs May said Mr Trump’s controversial trip would go ahead. \nThe row between Mr Trump and Mr Khan saw the US President dismiss criticism of his original post on the subject by redoubling his attack, accusing Mr Khan of making a “pathetic excuse”. \nThe Prime Minister told the Sun: \n“The relationship with America is our deepest and most important defence and security relationship. \n“Having said that, I think Donald Trump is wrong in what he said about Sadiq Khan, in relation to the attack on London Bridge. \n“We’ve been working with Sadiq Khan. When you’re working in the aftermath of an attack like that, party politics is put to one side.” \nThe mayor has been at meetings of the Government’s emergency Cobra committee and “we’ve been working with him to ensure the response was right, and to get London moving again”, the Prime Minister added. 13:16 Tom Eden Trying to avoid protesters \nBoris Johnson has snuck out the front door in an attempt to avoid the protesters who had greeted him at the back door on his way in, shouting ‘Tories out’ and ‘back door Boris’: 13:15 Tories have 'great chance in the North East' \nBoris Johnson seems confident about the Tories’ chances in the North East: 13:08 Have police numbers really fallen? \nHere are the figures showing the decline in police numbers in Engalnd and Wales: 12:58 Tom Eden Corbyn tweets video about police cuts \nIn case you’ve missed it, this is what Jeremy Corbyn has tweeted on the subject of police cuts: 12:55 Boris Johnson’s response to police cuts \nChallenged over cuts in police numbers following a speech in County Durham, Johnson said: (Photo: Owen Humphreys/PA Wire) \n“Every year I was mayor in London we were able to keep police numbers at or around 32,000 and I think they’ve been higher in our period in office than virtually every year Labour was in office in the 13 years before then. \n“We are investing in counter-terrorism, we are putting 1,900 more into our counter-terrorist operations as well as putting more armed police officers out on the street. \n“It really concerns me that Jeremy Corbyn - the only guy who could be prime minister apart from Theresa May on Friday - until very recently was saying that he did not support shoot-to-kill, which was absolutely indispensable in protecting innocent life on Saturday. \n“This is a guy who voted against the formal establishment of MI5 in 1989, who boasts that he has voted against every piece of counter-terrorist legislation which has been brought before Parliament. \n“You have a putative home secretary in Diane Abbott, who does not think that al Qaida should be a proscribed organisation, and voted against that. It beggars belief that these people should be running our country from Friday.” NHS Tom Eden What about the £350m, Boris? \nHe’s also asked about his promise of £350m a week for the NHS after Brexit. Boris Johnson with the Vote Leave campaign bus (Photo: Stefan Rousseau/PA Wire) \nHe says: \n“There’s only one way to get any of our money back and that’s to make sure we leave. \n“We need to take back control.” 12:40 KEY EVENT Boris challenged over North East police cuts \nJohnson is asked by the Chronicle if he thinks the North East could cope with a terror attack in the wake of cuts to armed officers between 2010 and 2016 - 15% across Durham and Northumbria forces. (Photo: Owen Humphreys/PA Wire) \nHe doesn’t comment on the North East but repeats that the Tories will invest 30% more into counter terrorism and ‘a lot more’ into armed police. \nHe praises the response and ‘unbelievable bravery’ of officers in London on Saturday. 12:30 'Last chance' to get Brexit done \nBoris Johnson has been speaking to local journalists. \nHe says that his message to voters is this is the last chance to get Brexit done, and Labour would ‘stuff it up’. 12:08 Tom Eden Johnson questions Labour over terror threat \nPolicing and terrorism have become a highly-charged political football in the wake of the recent atrocities: 12:07 Johnson wants more police officers \nBoris Johnson is now taking questions: 11:46", "external_links": [], "published": "2017-06-06T16:08:00.000+03:00", "crawled": "2017-06-06T12:39:58.003+03:00", "highlightTitle": ""}