{"organizations": [], "uuid": "957b6d68a261bb8b6b3683b4b4b9ac4d9ee705bc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13186278.ece/ALTERNATES/s1200/JS122707322.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/london-fire-delays-potential-agreement-13184923", "country": "GB", "domain_rank": 21960, "title": "London fire delays potential agreement between Theresa May and DUP", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-14T23:09:00.000+03:00", "replies_count": 0, "uuid": "957b6d68a261bb8b6b3683b4b4b9ac4d9ee705bc"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/london-fire-delays-potential-agreement-13184923", "ord_in_thread": 0, "title": "London fire delays potential agreement between Theresa May and DUP", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "david cameron", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "nick hurd", "sentiment": "none"}, {"name": "arlene foster", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}], "locations": [{"name": "westminster", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "grenfell tower", "sentiment": "none"}, {"name": "latimer road", "sentiment": "none"}, {"name": "west london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "dup news", "sentiment": "negative"}, {"name": "bbc", "sentiment": "none"}, {"name": "democratic unionist party", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "civil contingencies secretariat", "sentiment": "none"}, {"name": "tories", "sentiment": "none"}, {"name": "budget", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "dup", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News London fire delays potential agreement between Theresa May and DUP Attention at Westminster is focused on the shocking fire which has claimed six lives and left hundreds of people homeless Share A huge fire engulfs the 24 story Grenfell Tower in Latimer Road, West London. A Number 10 spokesman said: \"The Prime Minister is deeply saddened by the tragic loss of life\" Share Get daily   Thank you for subscribing!   \nThe tragic fire in a London tower block looks set to delay an agreement between Theresa May and the DUP about forming a stable government. \nOther business at Westminster took a back seat as attention focused on the shocking fire at the Grenfell Tower in west London, where at least six have died, \nTalks between Mrs May’s Conservative Party and the Democratic Unionist Party (DUP) were continuing, but the BBC reported DUP sources who said it was thought “inappropriate” to make an announcement while events were unfolding. \nAnd it was reported that diary commitments meant finalisation of any deal could be delayed until next week. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nMrs May ordered Ministers from different government departments to meet and ensure everything possible was being done to assist the emergency services. \nA Number 10 spokesman said: “The Prime Minister is deeply saddened by the tragic loss of life in the Grenfell Tower and is being kept constantly updated on the situation. \n“She has asked for a cross-Government meeting at the Civil Contingencies Secretariat to take place at 4pm to co-ordinate the response and ensure the Government is ready to assist the emergency services and local authorities as necessary. \n“The PM’s thoughts are with all of those affected by this terrible incident and the emergency services, who are working tirelessly in very difficult circumstances.” Emergency services at the scene after a fire engulfed the 27-storey Grenfell Tower in west London (Photo: PA) \nThe meeting will be chaired by the Police and Fire Minister Nick Hurd. \nMrs May needs the votes of the DUP’s 10 MPs to prop up her minority administration as she hopes to steer government business - including crucial measures on Brexit - through the Commons. \nTalks with the DUP broke up on Tuesday night without an agreement, but the Prime Minister said the discussions had been “productive”. Read More Aftermath of a tragedy: Shocking scenes in London as emergency services search for fire victims \nA Conservative source said there was so far no deal to announce and that a decision on the timing of any announcement would have to wait until an agreement was finalised. \nMinisters have already said that the Queen’s Speech may have to be set back from its scheduled date of next Monday, June 19, because of the ongoing negotiations. Smoke billows from a fire that has engulfed the 27-storey Grenfell Tower in west London (Photo: PA) \nMrs May is coming under intense pressure to change her approach to leaving the European Union, with predecessor David Cameron among those suggesting a softer stance with a greater effort to seek a consensus. \nA senior Conservative source said: “We are making a lot of progress. It’s all being done in the spirit of cooperation, with a real focus on strengthening the union and providing stability at this time.” \nDUP leader Arlene Foster, who travelled to Westminster for talks with the Tories on Tuesday, said she hoped a deal could be reached “sooner rather than later”. \nThe proposed “supply and confidence” deal would see the DUP back the Conservatives in votes on the Budget and confidence motions. \nLabour leader Jeremy Corbyn is also holding off a planned reshuffle of his Shadow Cabinet. It had been reported that the reshuffle was originally due take place today, but that was never confirmed by Labour. \nSpeaking to MPs on Tuesday night, before the fire, Mr Corbyn said his party was now on an election footing and could take power the next time the nation went to the polls. \nHe said: “We will continue to take the fight to the Tories and I will be out campaigning around the country in Conservative marginals in those extra seats we need to gain to deliver the government for the many that almost 13 million people voted for last week.” \nAnd he added: “We are now a government in waiting and we must think and act at all times with that in mind. That is our responsibility to the huge numbers who voted for our manifesto last week: a programme to transform Britain for the many that caught the imagination of millions.” Like us on Facebook", "external_links": [], "published": "2017-06-14T23:09:00.000+03:00", "crawled": "2017-06-14T18:51:29.001+03:00", "highlightTitle": ""}