{"organizations": [], "uuid": "1796f9e522395892d2242aafcb8bdaa369fac02f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13217956.ece/ALTERNATES/s1200/State-Opening-of-Parliament-2017.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/heres-whats-not-queens-speech-13217561", "country": "GB", "domain_rank": 21960, "title": "Here's what's NOT in the Queen's Speech after Theresa May ditched her manifesto", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-21T20:36:00.000+03:00", "replies_count": 0, "uuid": "1796f9e522395892d2242aafcb8bdaa369fac02f"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/heres-whats-not-queens-speech-13217561", "ord_in_thread": 0, "title": "Here's what's NOT in the Queen's Speech after Theresa May ditched her manifesto", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "neutral"}], "locations": [], "organizations": [{"name": "queen’s speech", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Here's what's NOT in the Queen's Speech after Theresa May ditched her manifesto Prime Minister Theresa May has abandoned many of the policies she set out in her general election manifesto Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily     \nThe Conservative Government has set out its plans, in the Queen’s Speech. \nThis is when Governments publish details of the new laws they plan to introduce, and give information about other measures which don’t require laws. \nWhen a Queen’s Speech takes place after a general election, you would usually expect it to explain how the Government plans to carry out the promises it made in its election manifesto. \nBut not this time. Prime Minister Theresa May appears to have abandoned many of the policies included in her Conservative manifesto. \nIt follows the general election vote on June 8 which led to a hung Parliament. Mrs May’s Conservative Party lost seats - and unpopular polices in the manifesto may have been part of the problem. Prime Minister Theresa May (Photo: PA) \nSo here are some policies that were in the manifesto - and have been abandoned: The dementia tax \nThe manifesto said “the value of the family home will be taken into account” when determining whether people receiving social care at home have to pay for their care. In practice, this would mean people with properties might be forced to sell them, although the sale might be delayed until after they die. \nBut the Queen’s Speech simply says the Government “will consult on options” about how to pay for social care “to encourage a wider debate”. Ending winter fuel allowance for wealthier pensioners \nThe manifesto said: “We will means-test Winter Fuel Payments, focusing assistance on the least well-off pensioners”. \nThis is missing from the Queen’s speech and the detailed documents published by the Government to accompany it. Ending free school meals for every child aged four to seven \nThe manifesto said: “We do not believe that giving school lunches to all children free of charge for the first three years of primary school – regardless of the income of their parents – is a sensible use of public money.” \nThis didn’t mean free meals would be ended entirely, as the Conservatives still planned to provide them to children from low-income families. \nBut this proposed change is missing from the Queen’s Speech. Read More Here are the eight Brexit laws Parliament will debate over the next two years Creating more grammar schools \nThe manifesto said: “We will lift the ban on the establishment of selective schools, subject to conditions, such as allowing pupils to join at other ages as well as eleven.” \nBut although the Government’s Queen’s Speech documents has a lengthy section on schools, there is no mention of this policy. \nIt says the Government has committed £5.8 billion for local authorities up to 2020 to deliver new school places, and will “continue to convert failing maintained schools into academies.” Ending the pensions “triple lock” \nThe pensions triple local ensures pensions rise each year by the rate of average earnings; the rate of inflation or 2.5%, whichever is highest. \nIt ensures pensions always rise by at least 2.5% even if inflation and earnings growth are low. \nBut the manifesto included plans to scrap this policy. \nIt said: “We will keep our promise to maintain the Triple Lock until 2020, and when it expires we will introduce a new Double Lock, meaning that pensions will rise in line with the earnings that pay for them, or in line with inflation – whichever is highest.” \nHowever, the Queen’s Speech does not include this policy. Read More Theresa May backtracks on pledge to recruit 10,000 more mental health staff Recruiting 10,000 new mental health professionals \nThe manifesto said: “We will make sure there is more support in every part of the country by recruiting up to 10,000 more mental health professionals.” \nBut the Queen’s Speech simply says: “The Government will continue to invest in new and better services across the whole spectrum of mental health conditions.” A cap on fuel bills \nThe manifesto promised a complex scheme to limit fuel price increases for people on certain tariffs, who also tend to be people on low incomes. \nIt said: “We will introduce a safeguard tariff cap that will extend the price protection currently in place for some vulnerable customers to more customers on the poorest value tariffs.” \nHowever, this measure appears to be missing from the Queen’s Speech. Like us on Facebook", "external_links": [], "published": "2017-06-21T20:36:00.000+03:00", "crawled": "2017-06-21T16:07:34.013+03:00", "highlightTitle": ""}