{"organizations": [], "uuid": "b74e3e8c2275b9b5756189cba5bb619215cdfde1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13074570.ece/ALTERNATES/s1200/Prime-Ministers-Questions.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/when-is-general-election-2017-13074365", "country": "GB", "domain_rank": 21960, "title": "When is the 2017 UK general election being held?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-03T14:14:00.000+03:00", "replies_count": 0, "uuid": "b74e3e8c2275b9b5756189cba5bb619215cdfde1"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/when-is-general-election-2017-13074365", "ord_in_thread": 0, "title": "When is the 2017 UK general election being held?", "locations": [], "entities": {"persons": [{"name": "jeremy corbyn", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "jesmond", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "house of commons", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "When is the 2017 UK general election being held? As the race to 10 Downing Street hots up we answer your questions about the General Election Share Prime Minster Theresa May speaks during Prime Minister's Questions in the House of Commons, London (Photo: PA) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe race to 10 Downing Street is hotting up as we edge nearer the finishing line. Here, when the race ends and other questions are answered. On what date is the general election being held? \nIt takes place on Thursday, June 8. Here is a complete guide to what happens on polling day and election night . When was it decided to hold the ballot? \nPrime Minister Theresa May called the ‘snap’ general election claiming that divisions at Westminster risked hampering the Brexit negotiations. It seemed to catch a number of people by surprise - why was that? Labour leader Jeremy Corbyn (Photo: Getty Images Europe) \nThe move stunned Westminster, as Mrs May and Number 10 had repeatedly insisted she would not seek a general election before the scheduled 2020 poll. Didn’t she have to get the backing of Parliament before the election went ahead? \nMrs May needed to secure at least a two-thirds majority of MPs as laid down by the 2011 Fixed Term Parliament Act in order to call an early election as opposed to serving the full five year term. It was achieved easily with a vote of 522 votes to 13. Read More Theresa May's dementia tax u-turn throws Conservative election campaign into chaos Which parties are standing? \nIn the North East, apart from the Conservatives , the main parties are Labour, the Liberal Democrats , UKIP , and the Green party as well as other smaller independents. When do the polling stations open and close? A voter placing a ballot paper in the ballot box (Photo: Rui Vieira/PA Wire) \nThey open at 7am and are due to close at 10pm on the night of June 8. \nRead more: Where are the polling stations in the North East to vote in the 2017 General Election? Where is my local polling station? \nThe best way to find out is to visit your local council’s website. Search under the general election category and you will find election notices in which your constituency and the candidates competing there are named as well as a list of all the polling stations. What happens if I get there a bit late? \nWell there is a bit of flexibility as a result of the chaos at the 2010 election in polling stations across the UK including Jesmond. \nThere was a late surge in voters which resulted in large queues forming that meant a number of people couldn’t get in to the polling station by 10pm and were stopped from voting. Read More", "external_links": [], "published": "2017-06-03T14:14:00.000+03:00", "crawled": "2017-06-03T14:24:47.006+03:00", "highlightTitle": ""}