{"organizations": [], "uuid": "3365a887ba603a9bf32ca5ae9162795b0e2ab0eb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13192363.ece/ALTERNATES/s1200/General-Election-2017-Westmorland-And-Lonsdale-Count-And-Declaration.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/welcome-age-clueless-nobody-knows-13192527", "country": "GB", "domain_rank": 21960, "title": "Welcome to the Age of Clueless: nobody knows anything any more", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-16T00:26:00.000+03:00", "replies_count": 0, "uuid": "3365a887ba603a9bf32ca5ae9162795b0e2ab0eb"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/welcome-age-clueless-nobody-knows-13192527", "ord_in_thread": 0, "title": "Welcome to the Age of Clueless: nobody knows anything any more", "locations": [], "entities": {"persons": [{"name": "fishfinger", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "kendal", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "lonsdale", "sentiment": "none"}, {"name": "dave", "sentiment": "none"}, {"name": "graeme whitfield", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "westmoorlan", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "kendal leisure centre", "sentiment": "none"}], "organizations": [{"name": "grenfell tower", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Opinion Local candidate Mr Fishfinger waits as ballot papers are counted at the Westmoorland and Lonsdale constituency count at Kendal Leisure Centre on June 8, 2017 in Kendal (Photo: Getty Images Europe) Share Get business   Thank you for subscribing!   \nAnyone reading this column would be advised to ignore every word, for if the last 10 days have taught us anything it is that nobody knows anything any more. \nThe thing people know the least about is politics, and the people who know the least about it are politicians, followed closely by political commentators. \nLast week I said we would have a Tory Government with little North East representation and although that has been borne out, I can’t honestly say I saw last Thursday’s election result coming in any real way. \nBut then, who did? I read a fair bit about politics and every sod I know on social media has been banging on about it for the last two months. But the only person who called a hung parliament was my mate Dave and he’d had a few drinks and was probably just having a giggle. \nMuch has been made of the failure of our political classes to predict the unexpected result. They should have seen it coming, people say, what with Trump and Brexit and all that. But that’s the tricky thing about the unexpected: nobody really expects it. \nElection night itself was rather jolly, I thought, a reminder that there is no sight quite as enjoyable as a rattled Tory . They seem to be holding off on full-scale civil war just yet but, as befits a party that has a manifesto commitment to bringing back blood sports, we probably just need to give it time. \nBack in the real world, the fun is over and the Age of Cluelessness has dawned. What is amazing about this new era is that, despite the face that nobody knows anything any more, social media has given many people the belief that they know everything. \nPeople I see on Facebook and Twitter are experts on politics one moment and international-standard football coaches the next. Much of it can be passed off as blowhard rambling, but this week I read an entirely compelling thread on Twitter about the political implications of the Grenfell Tower tragedy, followed by an equally compelling thread on how tweeting immediate reactionse to public events is self-defeating. What is a person to believe? \nOf course, it isn’t enough to say ‘nobody knows anything’ and walk away. We should still express our opinions and debate matters and post pictures of Donald Trump looking like a right ding-a-ling on Facebook. \nIf the Age of Cluelessness can have any benefits, it might be that we are not so quick to rush to judgement and that we give tricky issues proper thought, rather than expecting there to be an immediate answer to every problem. \nGraeme Whitfield is business editor of The Journal Like us on Facebook", "external_links": [], "published": "2017-06-16T00:26:00.000+03:00", "crawled": "2017-06-15T20:15:43.009+03:00", "highlightTitle": ""}