{"organizations": [], "uuid": "e383044745f2f296fe49fb8e8768b48bcb25c3eb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30412166/16060578.jpg", "site_section": "http://www.middevongazette.co.uk/all-content.rss", "section_title": "Devon Live All Content Feed", "url": "http://www.devonlive.com/hard-and-soft-brexit-terms-are-meaningless-we-need-a-good-brexit-anne-marie-morris-column/story-30412166-detail/story.html", "country": "GB", "title": "DanielClark published Hard and Soft Brexit are meaningless - we need a good Brexit:...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-27T23:11:00.000+03:00", "replies_count": 0, "uuid": "e383044745f2f296fe49fb8e8768b48bcb25c3eb"}, "author": "DanielClark", "url": "http://www.devonlive.com/hard-and-soft-brexit-terms-are-meaningless-we-need-a-good-brexit-anne-marie-morris-column/story-30412166-detail/story.html", "ord_in_thread": 0, "title": "DanielClark published Hard and Soft Brexit are meaningless - we need a good Brexit:...", "locations": [], "entities": {"persons": [{"name": "newton abbot", "sentiment": "none"}, {"name": "anne marie morris", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Comments (1) \nAnne Marie Morris is the Conservative MP for Newton Abbot and has been since 2010. \nWe want a good Brexit deal – yes – and please can we get away from unhelpful terms like hard and soft Brexit. They are meaningless and misleading. The word hard implies bad and the word soft implies good. They are different but one is not bad and the other not good. This is no longer about process, it is now about authority and - money. \nIt will be about the future relationship of the EU and the UK as regards the four freedoms. EU membership requires free movement of people, goods, services and capital. Freedom sounds great but each come at a cost to individual members. For the UK the cost has become too great and limited our ability to be what we want to be. We will always be good Europeans, but not at the price of a damaging straight jacket. \nFree movement of people served us well as a small group of similar economies. That small group is now a large group of 28 with very different economies. The effect of free movement has been to deprive the weaker economies of the brightest and their best as they migrate to strong economies like the UK. That cannot be right. Read more Here's how political blogger Newton Abbot Elects viewed the 2017 election campaign in the region \nAt the same time it has depressed wages in the UK so that our own nationals cannot economically find rewarding work instead living on benefits. Of course we want our country to attract the skills we need and want and to continue to attract seasonal workers and those in the health and care sector. But most important we want to do a much better job of educating and training our own. \nFree movement of goods was good for us in the early years but as the EU grew, it was better for other European countries. The EU exports more to the UK (£291 billion – 2015), than the UK does to the EU (£230 billion – 2015). It has also made us lazy in seeking trading opportunities. Of all 28 countries the UK has one of the worst export records. And because the UK could not agree trade deals with countries outside the EU we have been paying huge tariffs for goods coming in from outside the EU. Read more Reopening historic Devon branch line is 'possible', but... \nThere are more trading opportunities outside the UK and we must take them, but we can only do that once outside. If the EU looks at the economics there is no win in anything less than continuing zero rate tariffs. The straight jacket of the single market and customs union would stop this and impose EU law and leave EU courts as the final arbiter on trade issues – not the UK. The UK must be able to determine its own trade policy without interference from other countries. \nFree movement of services never delivered, much to the disappointment of the UK. Barriers to access persist even today. This issue relates to regulation. We have to accept the qualifications of other nationals as equivalent to our own whatever their standard, and pay equally. But the devil was in the detail and the local regulations in European countries that provided the real barriers. The French and Germans would never accept a British contractor to build a hospital, yet they are here building our nuclear power stations! \nAs for free movement of capital we continue to have to impose very burdensome regulations on our financial services sector making us increasingly less attractive as a financial centre. The EU want that to continue. As we come out of the single market, passporting is not an option. Equivalence is an option but not if the EU decides what is equivalent. It may be we need a three tiered approach – a system for domestic financial trading, a system for European trading and a system for UK non-European trading. \nWe can do a very good deal benefiting all – if the EU want it. ", "external_links": [], "published": "2017-06-27T23:11:00.000+03:00", "crawled": "2017-06-27T19:27:01.018+03:00", "highlightTitle": ""}