{"organizations": [], "uuid": "501d1626f26891e64bef00311b2b2d8ecf795e71", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article13186570.ece/ALTERNATES/s1200/Brexit.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/massive-skills-crisis-looming-poll-13185759", "country": "GB", "domain_rank": 21960, "title": "Massive skills crisis looming as poll reveals European workers set to leave UK", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-15T07:01:00.000+03:00", "replies_count": 0, "uuid": "501d1626f26891e64bef00311b2b2d8ecf795e71"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/massive-skills-crisis-looming-poll-13185759", "ord_in_thread": 0, "title": "Massive skills crisis looming as poll reveals European workers set to leave UK", "locations": [], "entities": {"persons": [{"name": "stephen ratcliffe", "sentiment": "none"}, {"name": "hargreaves", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "ratcliffe", "sentiment": "none"}, {"name": "baker mckenzie", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "nursing & midwifery council", "sentiment": "none"}, {"name": "tory", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Massive skills crisis looming as poll reveals European workers set to leave UK More than half of skilled workers from the EU are likely to leave the country before Brexit, new survey shows Share Workers in the City of London (Photo: PA) Share Get business   Thank you for subscribing!   \nOver half of skilled EU workers employed by FTSE 250 companies are likely to leave the UK before Brexit , a new survey has shown, adding to fears that the country is at risk of a severe brain drain following its departure from the bloc. \n56% of EU nationals surveyed by Baker McKenzie said they were “highly likely” or “quite likely” to leave the UK before the outcome of the Brexit negotiations was known, with healthcare (84%), technology, media and telecoms (64%) and financial services (43%) sectors likely to be hardest hit. \nThe law firm surveyed 250 EU-27 citizens educated at degree level or higher, employed by companies either in the FTSE 250 or with revenue of over £50m. \nThe findings indicate the serious staff shortages which could result from Brexit, and will increase political pressure to ensure access to talent is prioritised in upcoming talks with the EU. \nStephen Ratcliffe, employment partner at Baker McKenzie, warned companies could face a “significant skills shortage” in the near future, and urged them to take steps now to support and incentivise employees to stay within the business. \nAlready, 42% of those surveyed confirmed they had taken action to change their immigration status since last year’s vote to leave the EU, with another 40% confirming their intention to do so. \nHe added that the situation could be exacerbated if there were any delays to the negotiations with the EU. \nThe survey also found that 70% of EU staff felt more exposed to discrimination since the Brexit vote, with 38% of those describing themselves as feeling “vulnerable” or “very vulnerable”. Read More Hargreaves continues to diversify away from coal by creating new energy business \nIn the healthcare and financial services sectors, perceptions of discrimination were highest at 94% and 88% respectively. \nIn addition, more than one in four people surveyed feared job losses, with respondents citing the biggest threat to their jobs as discriminatory hiring practices. \n“These findings would suggest that the perception of discrimination is a key driver for skilled EU nationals seeking to leave the UK,” Mr Ratcliffe said. \n“Employers should be refreshing their anti-discrimination policies, particularly in the context of recruitment, and offering their staff support as they face the consequences of Brexit.” \nThe survey also revealed that more than half (55%) of EU-27 employees had not been offered any support by their employers in relation to Brexit. \nMr Ratcliffe added: “Employers who are reliant on EU workers should be taking active steps to engage with their employees on the subject of Brexit, and to offer them support and assistance to address areas of uncertainty for them and their families. \n“Last week’s election result and the current uncertainty around the immigration status of EU nationals, underlines the need for all employers - especially those reliant on EU workers - to address their employees’ concerns around Brexit as a priority. \n“Failure to do so could result in a significant skills drain for businesses in the near term, regardless of the Brexit deal reached,” he warned. Read More Westerhope bingo hall relaunches to compete with big competition \nThe survey comes as the Government faces pressure to secure residence rights for EU citizens living in the UK, in particular for those working in the NHS. \nA study by the Nursing & Midwifery Council earlier this week showed the number of nurses from the EU registering to work in the UK had fallen by 96% since the Brexit vote last year. \nThe number of new applicants from the EU fell from 1,304 in July last year to 43 in April this year, putting further strain on the health service as it grapples with a recruitment crisis. \nTheresa May has pledged to limit immigration to the “tens of thousands”, but following her electoral humiliation, she is likely to come under pressure from Tory colleagues to drop the proposal. Like us on Facebook", "external_links": [], "published": "2017-06-15T07:01:00.000+03:00", "crawled": "2017-06-15T02:53:51.004+03:00", "highlightTitle": ""}