{"organizations": [], "uuid": "54059813d322cf0417a069f5ef4a7fdde2f54914", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13232868.ece/ALTERNATES/s1200/TMP_NEC_230617AntiBrexitRally03JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/its-not-late-anti-brexit-13232866", "country": "GB", "domain_rank": 21960, "title": "'It's not too late': Anti-Brexit protestors gather in Newcastle on anniversary of EU referendum", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-24T03:38:00.000+03:00", "replies_count": 0, "uuid": "54059813d322cf0417a069f5ef4a7fdde2f54914"}, "author": "Katie Dickinson", "url": "http://www.chroniclelive.co.uk/news/north-east-news/its-not-late-anti-brexit-13232866", "ord_in_thread": 0, "title": "'It's not too late': Anti-Brexit protestors gather in Newcastle on anniversary of EU referendum", "locations": [], "entities": {"persons": [{"name": "jane roffe", "sentiment": "none"}, {"name": "george halliday", "sentiment": "none"}, {"name": "carlos", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "haymarket", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "forest hall", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}], "organizations": [{"name": "anti-brexit", "sentiment": "negative"}, {"name": "northumbria university", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "europe carlos conde solares", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Anti-Brexit rally at the Haymarket (Photo: newcastle chronicle) Share   Thank you for subscribing!   \nScores of anti-Brexit protestors insisted “it’s not too late” as they gathered in Newcastle on the anniversary of the referendum. \nA year after the UK voted to leave the EU, campaigners from the North East for Europe group held a rally at Haymarket to continue their call for “ No Brexit ”. \nDemonstrators gathered to hear speeches from pro-European activists from across the North East. \nChairman of North East for Europe Carlos Conde Solares, who is a history lecturer at Northumbria University , was one of the event’s organisers. Anti-Brexit rally at the Haymarket (Photo: newcastle chronicle) \nHe said: “We want to get the message out there that there’s still an appetite for resistance to Britain leaving the EU. \n“I think Brexit is impossible in the form that the current government wants it to take. \n“Things that seemed to be easy, like citizens’ rights, are practically impossible to disentangle both in the UK and in Europe. \n“I believe that very soon we’re going to see evidence that Brexit will be much more difficult than anyone envisaged.” Anti-Brexit rally at the Haymarket (Photo: newcastle chronicle) \nCarlos, who moved to the UK from Spain 12 years ago to study, said: “I’m not campaigning for myself because it was relatively straightforward for me to get permanent residence here. \n“I’m campaigning because I look at my students and other young people and I believe they deserve to have the same opportunities that I had to study and work.” \nAmong the protestors was retired teacher George Halliday, 76, from Forest Hall , who said: “I’m here because a year ago I was totally devastated by the result of the referendum. Anti-Brexit rally at the Haymarket (Photo: newcastle chronicle) \n“I’m still angry and sad, particularly for the young people. \n“I think we should be campaigning for a softer Brexit, and if opinion changes enough over time, for a second referendum. \n“I want Britain to be an open society and not a mean one - people from Europe should be able to come and work here, in the same way British people should be able to work in Europe.” \nJane Roffe, 56, from Newcastle, said: “It’s been a year of total disaster. I still think there’s a chance of stopping Brexit, especially given the events of the last few weeks, there’s every chance we might get a change in government.” Like us on Facebook", "external_links": [], "published": "2017-06-24T03:38:00.000+03:00", "crawled": "2017-06-23T22:55:15.019+03:00", "highlightTitle": ""}