{"organizations": [], "uuid": "49442550ddaa8f2d0ddccf846c32134e1c548ba3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article13180169.ece/ALTERNATES/s1200/Cabinet-Ministers-Attend-Downing-Street-Meeting.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/farming/michael-gove-listen-learn-farmers-13180163", "country": "GB", "domain_rank": 21960, "title": "Michael Gove to 'listen and learn' from farmers as he plots future of agriculture", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-13T22:50:00.000+03:00", "replies_count": 0, "uuid": "49442550ddaa8f2d0ddccf846c32134e1c548ba3"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/farming/michael-gove-listen-learn-farmers-13180163", "ord_in_thread": 0, "title": "Michael Gove to 'listen and learn' from farmers as he plots future of agriculture", "locations": [], "entities": {"persons": [{"name": "michael gove", "sentiment": "neutral"}, {"name": "andrea leadsom", "sentiment": "none"}, {"name": "gove", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}], "locations": [{"name": "downing street", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "bbc radio", "sentiment": "none"}, {"name": "cabinet", "sentiment": "none"}, {"name": "state", "sentiment": "none"}, {"name": "national farmers’ union", "sentiment": "none"}, {"name": "nfu", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Michael Gove to 'listen and learn' from farmers as he plots future of agriculture The new Environment Secretary said subsidies would continue until 2022 but wants to discuss other policies with farmers Share Secretary of State for Environment, Food and Rural Affairs Michael Gove arrives at Downing Street (Photo: Getty Images Europe) Share Get business   Thank you for subscribing!   \nNew Environment Secretary Michael Gove says he will “listen and learn” from farmers as he formulates Government policy for the agricultural sector. \nMr Gove made a surprise return to the Cabinet after last Thursday’s electoral setback for Prime Minister Theresa May , replacing Andrea Leadsom in charge of the Department for Environment, Food and Rural Affairs . \nMr Gove was a prominent Leave campaigner in the EU referendum and has faced questions on subsidies for farmers and on the supply of overseas labour for agricultural businesses. \nHe said that EU farming subsidies - which had been guaranteed until 2020 - would now continue until the end of the current Parliament in 2022 as this was a Conservative manifesto commitment. \nOn the issue of the supply of future unskilled labour for farmers as a result of Brexit and the possibility of a visa scheme, he told BBC Radio 4’s Today programme: “I don’t want to get into the details of what any eventual scheme may be. It’s early days, I was only appointed on Sunday evening. Read More Farmers' confidence hits three-year low as Brexit fears bite \n“But one thing the Prime Minister has already pointed out is that, as we bring migration down to sustainable levels, we’ll do so in consultation with industry and one of our most important manufacturing industries is agriculture. So we need to make sure that the workforce is there and the support is there.” \nAsked whether farmers would have to apply for permits for workers even if they were only in the UK for weeks, Mr Gove replied: “In the past, before our current migration policy was created, we’ve had a variety of schemes to ensure the agricultural workforce is in place to ensure that farmers can continue to produce high quality food. \n“Of course I’ve given this issue some consideration but I want to make sure that I have the opportunity now to listen to the farming sector. I want to talk to the National Farmers’ Union and others because I think, as was the case when I was justice secretary, that the right approach to take as Secretary of State in a new department is to listen and to learn. \n“You need to be clear about what your overall principals are, and mine are that we enhance the environment and also that we continue to produce high quality food in this country. But the means by which we do so - I think that the best way of arriving at that, is for me to exercise appropriate humility and listen and learn.” Read More Horncastle Farm goes on sale for £1.55m in Northumberland village \nSpeaking before Mr Gove’s appointment, the NFU said that it is committed to working with the new Government to ensure Ministers understand the value of British farming. \nIt has highlighted Brexit one of its key areas of concern, both in terms of access to foreign markets for British food and access to overseas labour. Like us on Facebook", "external_links": [], "published": "2017-06-13T22:50:00.000+03:00", "crawled": "2017-06-13T18:28:52.001+03:00", "highlightTitle": ""}