{"organizations": [], "uuid": "dbe759de9a7287aa19ebff0e010a55b134bc03d5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30393899/16046896.jpg", "site_section": "http://www.middevongazette.co.uk/all-content.rss", "section_title": "Devon Live All Content Feed", "url": "http://www.devonlive.com/police-say-blonde-driver-could-provide-answers-to-why-woman-at-zebra-crossing-was-left-in-a-coma/story-30393899-detail/story.html", "country": "GB", "title": "Devon Live published Police say blonde driver could provide answers to why woman at...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-16T18:54:00.000+03:00", "replies_count": 0, "uuid": "dbe759de9a7287aa19ebff0e010a55b134bc03d5"}, "author": "Devon Live", "url": "http://www.devonlive.com/police-say-blonde-driver-could-provide-answers-to-why-woman-at-zebra-crossing-was-left-in-a-coma/story-30393899-detail/story.html", "ord_in_thread": 0, "title": "Devon Live published Police say blonde driver could provide answers to why woman at...", "locations": [], "entities": {"persons": [{"name": "devon live", "sentiment": "none"}, {"name": "dave stephenson", "sentiment": "none"}, {"name": "fleur", "sentiment": "none"}, {"name": "anna davies", "sentiment": "none"}, {"name": "fleur davies", "sentiment": "none"}, {"name": "anna  an", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "brexit  fleur", "sentiment": "none"}, {"name": "gayle mcdonald", "sentiment": "none"}, {"name": "anna", "sentiment": "none"}], "locations": [{"name": "plymouth", "sentiment": "none"}, {"name": "albert road", "sentiment": "none"}], "organizations": [{"name": "serious collisions investigation team", "sentiment": "none"}, {"name": "exeter armed forces", "sentiment": "none"}, {"name": "plymouth herald", "sentiment": "none"}, {"name": "cancer research", "sentiment": "none"}, {"name": "st budeaux", "sentiment": "none"}, {"name": "charlotte turner", "sentiment": "none"}, {"name": "fiat punto", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Police say blonde driver could provide answers to why woman at zebra crossing was left in a coma By Devon Live   By Gayle McDonald and Charlotte Turner 0 COMMENTS SHARES Comments (0) \nA blonde driver could hold vital information about the terrifying moment a woman was mowed down at a zebra crossing in Plymouth. Anna Davies, aged 45, remains in a coma after she was struck by a Fiat Punto on Albert Road on May 13 - more than a month ago. Read more A special group of women will be honoured at Exeter Armed Forces... \nAnna Davies remains in a coma \nPolice have today issued a fresh appeal for anyone who witnessed the collision to come forward, the Plymouth Herald reports . \nIn particular, they are hoping to speak to a slim blonde woman who was driving behind the car that struck Anna. \nPC Dave Stephenson, of the Serious Collisions Investigation Team, said: \"We are specifically appealing to a potential witness who is described as a white female of slim build with long blonde coloured hair and aged between 45 and 55-years-old. \n\"It is believed that she was the driver of a dark coloured car that was behind the car that was involved in the collision with the female pedestrian. \n\"This blonde female took possession of a person's mobile phone and spoke to the emergency operator. \n\"We are appealing to her to come forward as a potential witness.\" \nThe crash happened at about 1.10pm \nThe collision happened at the Pheasant Pluckers pub at about 1.10pm on Saturday, May 13. \nAt the time, an officer said Anna was believed to have walked out in front of a car, which was not travelling at speed at the time of the collision. \nAny witnesses are urged to contact police by calling the non-emergency 101 telephone number, quoting the log number 420/13/05. Fundraising appeal for Anna \nAn online appeal has been set up to raise money to support Anna and her family . \nFleur Davies said her sister was on her way to voluntary job at Cancer Research when she was hit. \nShe said the 45-year-old was left with brain damage following the crash and had to have part of her skull removed to help with the swelling on her brain. \nThe family have cleared out Anna's second-floor flat and paid for her belongings to be put in storage because it is unlikely she will be able to climb two flights of stairs or live independently, if she wakes up. \nAny left over money from the appeal will go towards any care help Anna may need. \nDid you witness the collision? Read more Devon businesses told to speak out on Brexit \nFleur, from St Budeaux, said: \"We are taking each day as it comes but it is absolutely devastating.\" \nShe added: \"Anna is a really outgoing, talkative person, she would help anyone and give someone her very last penny. She was a carer for many years and loved it. \n\"We hope she will be fine, we can't bear to think of any other outcome.\" \nThe family is urging any witnesses to come forward. \nFleur said: \"Every penny helps but more than anything we want another witness to come forward as it's going to be three to four months before we find out more information from the police.\" \nTo help Anna and her family, go to gofundme.com/gzd9n-help-for-anna .", "external_links": [], "published": "2017-06-16T18:54:00.000+03:00", "crawled": "2017-06-16T15:07:10.000+03:00", "highlightTitle": ""}