{"organizations": [], "uuid": "b4ef79a98ee647cfbdb8312d4ddeec934f41f47d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article13156724.ece/ALTERNATES/s1200/MAYCORBS.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/disaster-theresa-triumph-jeremy-corbyn-13158834", "country": "GB", "domain_rank": 21960, "title": "Disaster for Theresa May and triumph for Jeremy Corbyn as election gamble appears to backfire", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-09T05:53:00.000+03:00", "replies_count": 0, "uuid": "b4ef79a98ee647cfbdb8312d4ddeec934f41f47d"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/disaster-theresa-triumph-jeremy-corbyn-13158834", "ord_in_thread": 0, "title": "Disaster for Theresa May and triumph for Jeremy Corbyn as election gamble appears to backfire", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "jeremy corbyn", "sentiment": "negative"}, {"name": "ed miliband", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "hull", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "north east  the north east", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "sheffield", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "teesside", "sentiment": "none"}], "organizations": [{"name": "liverpool", "sentiment": "none"}, {"name": "leeds", "sentiment": "none"}, {"name": "tories", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}, {"name": "labour and conservative", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}, {"name": "virgin trains", "sentiment": "none"}, {"name": "northern powerhouse", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Opinion Disaster for Theresa May and triumph for Jeremy Corbyn as election gamble appears to backfire The experts, the media and the politicians have shown they know nothing - if the exit polls are correct Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nTrump, Brexit and now this. \nThis is an era of shocks in politics. \nThe political establishment - the experts, the media and most politicians - have got it wrong time after time. \nAnd when broadcasters published their General Election exit polls at 10pm last night, it appeared they were wrong again. \nThe exit poll showed the UK was heading for a hung Parliament. \nAnd this would be a disaster for Conservative leader and Prime Minister Theresa May, who chose to call an early General Election in an attempt to increase her majority in the House of Commons. \nIt would also appear to show that Labour leader Jeremy Corbyn has succeeded in winning seats for Labour, although the exit poll did suggest that his party had still won far fewer seats than the Tories. \nMrs May will return to 10 Downing Street as Prime Minister, while Labour will remain in opposition - but her authority will be hugely diminished. \nBoth Labour and Conservative politicians had said during the campaign that they believed the Conservatives would make gains in this election. \nBut it seemed they were wrong. \nThey weren’t alone. The media were also taken completely by surprise. \nBut it’s happened before - when Donald Trump was elected president, and when the UK voted to leave the EU. \nPolitics is changing in a way that they people who think they know it all just don’t seem to understand. \nIt’s been a good campaign for the North East \nThe North East has been ignored in previous election campaigns. \nNot this time. \nMrs May was in the region twice while Labour leader Jeremy Corbyn conducted something of a tour of the region, visiting Northumberland, County Durham, Gateshead and Teesside. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nIt’s good news for the region if the national party leaders are forced to pay attention to us. Long may it continue. \nBut it seemed to be bad news for Labour. Because the focus on the North East reflected a belief that the Conservative Party could, possibly, win seats in the region that had always been solidly Labour in the past. \nIt was a shock to everyone when the TV broadcasters published exit polls at 10pm suggesting a hung Parliament. \nIt means Mrs May will return to Number 10 as Prime Minister, while Labour remain in opposition. \nAnd Brexit will go ahead. \nWhat does this result mean for the North? \nWe don’t know - because if Theresa May has failed to win a majority then she might have to do a deal with another party to be able to govern. \nBut we know what was in the Tory manifesto. \nWe could get a new rail line. The Conservative manifesto included a commitment to build a “Northern Powerhouse rail” line, expected to link Liverpool, Manchester, Leeds, Hull, Sheffield and Newcastle. \nIt also said the Government would move civil servants out of London, creating jobs in other regions, and force Channel 4 to move its headquarters out of London, even though the broadcaster wants to stay where it is. \nLocal politicians are expected to campaign to try to get Channel 4 moved to Newcastle. \nThe manifesto promised £8bn extra for the NHS and £4bn for schools. \nBut it also promised to take away some perks away from middle class people. \nPrimary school pupils from wealthier families will lose the right to free school meals, and the winter fuel allowance of up to £300 will be taken away from all but the poorest pensioners. \nThere will also be an increase in the contribution many elderly people are expected to make to the cost of social care in their home, the so-called dementia tax, although Mrs May was forced to promise during the election campaign that this will be watered down. \nWhat does it mean for Theresa May? \nIt was meant to be an election that would give Mrs May her own mandate and leave her in a stronger position than ever. \nInstead, it looks like it’s been a disaster. \nShe began the election campaign as an asset to the Conservative Party. That’s why it made sense to focus the election campaign around her. \nBanners and signs at Conservative rallies had her name proudly displayed - while the name of the party was missing. \nBut things changed very quickly after the disastrous manifesto launch, which included plans to make elderly people pay for care at home even if it meant they had to sell their property. Read More \nMrs May’s swift U-turn led to the media calling her “weak and wobbly”. \nTheresa May may continue as Prime Minister but her reputation has been hugely damaged. \nWhat does it mean for Jeremy Corbyn? \nMr Corbyn appears to have run a good election campaign. \nWith hindsight, that shouldn’t be a surprise. He proved he was a good campaigner during the 2016 Labour leadership contest. \nIt looks like Labour lost, in the sense that it came second. \nBut the fact that he managed to make gains, and deny the Conservatives a majority, if that is indeed what’s happened, means his position as Labour leader is probably safe. \nWhether he actually wants to carry on as Labour leader until the next election, probably in 2021, remains to be seen. \nIn the years before Mr Corbyn took over, Labour went too far in thinking it could win by sounding like the Conservatives and sneaking left-wing policies into its manifesto. \nThis time around, Labour’s manifesto was openly and proudly full of radical ideas, and it seems to have been popular. \nTo give one example, former leader Ed Miliband backed re-nationalising rail services. But his manifesto proposed a convoluted, half-baked scheme in which a publicly-owned business would bid for franchises, competing against private sector firms like Virgin Trains. \nMr Corbyn’s manifesto, however, simply states that Labour will take rail services back into public control. Read More \nIt’s Mr Corbyn’s direct approach that generates enthusiasm. Whatever happens to Labour now, it need to learn positive lessons from Mr Corbyn’s time as leader. \nHow much did the collapse of UKIP help Theresa May? \nSome people will put Conservative success down to the collapse of support for UKIP. \nThe theory is that UKIP voters switched to the Tories, so losing the election wasn’t really Labour’s responsibility. \nBut that wouldn’t explain why Mrs May is back in power with an increased majority. \nUKIP have only been a force in one General Election, in 2015. It’s not as if the right-wing vote in this country has traditionally been split between two parties. \nIn 2015, UKIP gained 12.6% of the vote. But in 2010, their share was just 3.1%. And in the last election before that, in 2005, they got 2.2%. \nIn the North East specifically, UKIP got 16.7% of the vote in 2015 - but just 2.7% in 2010. \nIt’s 2015 that was the aberration, not this election. \nIt may be true that some former Labour voters used UKIP as a “stepping stone” to switch to the Tories - moving from Labour to UKIP and then to the Conservatives. \nBut there’s nothing inevitable about this process. \nIf people have consistently voted Labour, voted UKIP just once (in a general election) and then voted Tory, the question you have to ask is why they switched from Labour to the Tories. \nThe existence of UKIP may be a factor if it made this switch easier, but it can only be part of the answer. Read More", "external_links": [], "published": "2017-06-09T05:53:00.000+03:00", "crawled": "2017-06-09T01:08:02.469+03:00", "highlightTitle": ""}