{"organizations": [], "uuid": "bbf76dec3e96648eb94b67e2ea493525e135cf4a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30398085/16050163.jpg", "site_section": "", "section_title": "", "url": "http://www.devonlive.com/i-will-not-rest-says-mp-neil-parish-until-all-homes-have-superfast-broadband-opinion/story-30398085-detail/story.html", "country": "GB", "title": "'I will not rest' says MP Neil Parish until all homes have superfast broadband - opinion | Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "", "spam_score": 0.278, "site_type": "news", "published": "2017-06-19T22:05:00.000+03:00", "replies_count": 0, "uuid": "bbf76dec3e96648eb94b67e2ea493525e135cf4a"}, "author": "", "url": "http://www.devonlive.com/i-will-not-rest-says-mp-neil-parish-until-all-homes-have-superfast-broadband-opinion/story-30398085-detail/story.html", "ord_in_thread": 0, "title": "'I will not rest' says MP Neil Parish until all homes have superfast broadband - opinion | Devon Live", "locations": [], "entities": {"persons": [{"name": "danielcl", "sentiment": "none"}, {"name": "neil parish", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "oliver colville", "sentiment": "none"}, {"name": "honiton", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "tiverton", "sentiment": "none"}, {"name": "grenfell tower", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "tiverton", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}], "organizations": [{"name": "tiverton & honiton", "sentiment": "none"}, {"name": "housing and planning bill", "sentiment": "none"}, {"name": "environment food and rural affairs select committee", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}, {"name": "department for environment food and rural affairs", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "'I will not rest' says MP Neil Parish until all homes have superfast broadband - opinion By DanielClark | Posted: June 19, 2017 0 COMMENTS SHARES Comments (0) \nNEIL PARISH IS THE CONSERVATIVE MP FOR TIVERTON AND HONITON AND HAS BEEN SINCE 2010 \nIt's a great privilege to be re-elected as the MP for Tiverton and Honiton and I will work hard every single day to repay your trust in me. \nNationally, it was not the result that the Prime Minister or the Conservative Party wanted. It was a strange campaign and if I was writing a school report, I would say we 'could have done better'. That would probably be an understatement. \nPolitics can be tough sometimes and we mustn't forget the human side when MPs and their staff lose their jobs overnight. I was particularly sad to see close friends and colleagues like Oliver Colville, in Plymouth, lose their seats. \nI was, however, very pleased that our results in Scotland were so strong. Another referendum on Scotland leaving the UK is now unlikely. As we enter these Brexit negotiations, we must do so as a united country, to get the best deal for the prosperity of our country. Read more VIDEO: Neil Parish holds Tiverton & Honiton for the Conservatives - Full Report \nThis Parliament will undoubtedly be dominated by Brexit. I have decided I will be standing again as the chair of the Environment Food and Rural Affairs Select Committee. The Department for Environment Food and Rural Affairs, which we scrutinise, is perhaps more affected by Brexit than any other department – with 80 per cent of its laws derived from EU legislation. Whether it's environmental regulations, farm support payments or trade barriers, I want to ensure a strong voice for food and farming is heard at the table. \nIn Parliament, my priority has been - and always will be - to represent our community and act as a strong voice for Devon and the South West. Issues such as poor rural broadband have caused misery for families and businesses for far too long. Although we've had some excellent progress in recent years, I want the Government to go much further and faster to meet its pledge for every household to have access to superfast speeds by 2020. I will not rest until this happens. Read more Scrappage scheme could cut harm done by diesel vehicles claims Devon MP \nI also want promises of a fairer share of education and health funding to be realised. During the election, I was inundated with correspondence on matters regarding health and education. Crucial public services are close to everyone's heart, whether you were born in an NHS hospital, went to a local school, or have received care in the social care system. I want to reassure you that I will continue to campaign hard, not only to protect local budgets, but to win funding increases for our vital public services, as we did with school funding in Devon last year. \nThis Parliament will be the most important for decades. I'm honoured that you've chosen me to represent you again at this crucial time – and I will continue to hold the Government's feet to the fire on the issues that really matter to our area. \nI am shocked and saddened by the deaths at the Grenfell Tower. My thoughts are with those affected and I pay tribute to the emergency services who showed incredible bravery in tackling the blaze and treating those who have suffered as a result of this tragedy. \nWhile it is too early to speculate on the exact causes of the fire, there seems to have been a problem with the external cladding added to the building in a refurbishment last year. \nI am glad the Prime Minister has announced that, once the scene has been cleared, an investigation will take place into the cause of the fire and if there are any lessons to be learned. \nLast year, Neil Parish voted against Labour's amendment to the Government's Housing and Planning Bill - one of the clauses on the amendment was about safety and would introduce a requirement for landlords to undertake electrical safety checks. The amendments to the Housing and Planning Bill related to private landlords, not public housing, like the Grenfell Tower.", "external_links": [], "published": "2017-06-19T22:05:00.000+03:00", "crawled": "2017-06-19T17:19:48.000+03:00", "highlightTitle": ""}