{"organizations": [], "uuid": "9fbb3487e4bef79276fb992017fc6c75794613ff", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12539298.ece/ALTERNATES/s1200/Ramsdens-chief-executive-Peter-Kenyon.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13143493", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: North East pawnbroker Ramsdens hails 'transformational' year following flotation", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-07T15:05:00.000+03:00", "replies_count": 0, "uuid": "9fbb3487e4bef79276fb992017fc6c75794613ff"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13143493", "ord_in_thread": 0, "title": "Business Breakfast LIVE: North East pawnbroker Ramsdens hails 'transformational' year following flotation", "locations": [], "entities": {"persons": [{"name": "tyne", "sentiment": "negative"}, {"name": "ramsdens", "sentiment": "negative"}, {"name": "mr chambers", "sentiment": "none"}, {"name": "ian jones", "sentiment": "none"}, {"name": "coreena ford santander", "sentiment": "none"}, {"name": "john", "sentiment": "none"}, {"name": "coreena ford", "sentiment": "none"}, {"name": "peter kenyon", "sentiment": "none"}, {"name": "nick davis", "sentiment": "none"}, {"name": "peter rush", "sentiment": "none"}, {"name": "mark cutifani", "sentiment": "none"}, {"name": "formica", "sentiment": "none"}, {"name": "heaton", "sentiment": "none"}, {"name": "john parker", "sentiment": "none"}, {"name": "fenwick", "sentiment": "none"}, {"name": "chris jones", "sentiment": "none"}, {"name": "coreena ford formica", "sentiment": "none"}, {"name": "santander", "sentiment": "none"}, {"name": "glassdoor", "sentiment": "none"}, {"name": "rush", "sentiment": "none"}, {"name": "david whitby", "sentiment": "none"}, {"name": "chambers", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}, {"name": "shoe zone", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "gosforth shopping centre", "sentiment": "none"}, {"name": "mars", "sentiment": "none"}, {"name": "eldon square", "sentiment": "none"}, {"name": "newton aycliffe", "sentiment": "none"}, {"name": "coast road", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "north shields", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "gosforth", "sentiment": "none"}, {"name": "retailer shoe zone", "sentiment": "none"}, {"name": "intu eldon square", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}, {"name": "chillingham road", "sentiment": "none"}, {"name": "new zealand", "sentiment": "none"}, {"name": "formica", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north tyneside", "sentiment": "none"}, {"name": "glassdoor", "sentiment": "none"}], "organizations": [{"name": "group", "sentiment": "none"}, {"name": "rexam", "sentiment": "none"}, {"name": "ramsdens holdings", "sentiment": "none"}, {"name": "smarkets", "sentiment": "none"}, {"name": "post office", "sentiment": "none"}, {"name": "transferwise", "sentiment": "none"}, {"name": "stuart chambers", "sentiment": "none"}, {"name": "newcastle journal", "sentiment": "none"}, {"name": "santander group", "sentiment": "none"}, {"name": "coreena ford ramsdens holdings", "sentiment": "none"}, {"name": "shell", "sentiment": "none"}, {"name": "smiths group", "sentiment": "none"}, {"name": "single resolution board", "sentiment": "none"}, {"name": "middlesbrough", "sentiment": "none"}, {"name": "fletcher building", "sentiment": "none"}, {"name": "middlesbrough football club", "sentiment": "none"}, {"name": "premier league", "sentiment": "none"}, {"name": "banco popular to banco santander", "sentiment": "none"}, {"name": "nippon sheet glass", "sentiment": "none"}, {"name": "tesco", "sentiment": "none"}, {"name": "european central bank", "sentiment": "none"}, {"name": "ecb", "sentiment": "none"}, {"name": "banco popular", "sentiment": "none"}, {"name": "coreena ford", "sentiment": "none"}, {"name": "london stock exchange", "sentiment": "none"}, {"name": "formica group europe", "sentiment": "none"}, {"name": "coreena ford new anglo american", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "euro  santander", "sentiment": "none"}, {"name": "arm holdings", "sentiment": "none"}, {"name": "lynemouth power station", "sentiment": "none"}, {"name": "anglo", "sentiment": "none"}, {"name": "lynemouth power limited", "sentiment": "none"}, {"name": "kirstie kimmins", "sentiment": "none"}, {"name": "anglo american", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford Swimming pool opened in Cramlington after mum's battle to teach kids how to swim \nA mother from the North East has found a novel solution to the common problem of lengthy waiting lists for swimming lessons – building her own pool and opening a business to provide private tuition. \nJacklyn Bradley became frustrated after finding local swimming pools often had long waiting lists for classes spanning in excess of a year. \nWhen she did find classes for her two daughters, she felt they were often overcrowded and had poor facilities for parents. \nThe experience led Ms Bradley to build her own pool and open Mini-Skool-Fishes, which offers small group and private classes for parents and children. \nThe business opened last month at Nelson Park, Cramlington, and has already attracted interest from a number of families suffering from the same issue that prompted Ms Bradley to open the business. Jacklyn Bradley founded Mini-Skool-Fishes after struggling to find a swimming lessons for her children (Photo: Unknown) 9.05 Coreena Ford Property specialist Graham Hall launches new business months after leaving Bradley Hall \nProperty specialist Graham Hall has launched a new business months after leaving chartered surveying firm Bradley Hall. \nMr Hall, who entered the property industry 40 years, stepped down from Bradley Hall’s top job in 2015 and then left as a consultant and chairman three months ago. \nNow he has established a new office at Forster Business Centre, Durham, where he will trade as Graham S Hall Chartered Surveyors. \nMr Hall sold the company he established over 29 years ago to fellow directors Neil Hart and Peter Bartley in October 2015 and, since then, worked for Bradley Hall in an advisory capacity as chairman and consultant. \nHe said: “I am back in business again to service many of my long-standing clients and raring to go. We are a team of two at present, but I imagine that will not be the case for long. \n“I have over 40 years of experience in the industry and it would be a pity to let this go to waste. I have missed the cut and thrust of business these last few months and relish the thought of being active in the market once again, and not only establishing a new venture, but welcoming a raft of new clients to the practice.” \nMr Hall has also appointed a junior partner, Daryl Carr, who worked with him three years ago. \nMr Carr said: “The partnership Graham has offered me is an amazing opportunity to make my own mark yet be able to gain from his vast experience and business acumen so that when I take the business over some years into the future, there will be a seamless transition for our clients.” Daryl Carr and Graham Hall of Graham S Hall Chartered Surveyors 9.00 Coreena Ford Swinburne Maddison and Collingwood Legal take top prizes at Northern Law Awards \nSwinburne Maddison and Collingwood Legal walked away with top prizes at the Northern Law Awards last week. \nThis year’s awards were held at the Hilton Hotel in Gateshead and were hosted by comedian and BBC radio presenter Alfie Joey. \nThe top prize of the evening was presented to Durham-based law firm Swinburne Maddison, which was named large law firm of the year and also took the litigation and disputes resolution prize. \nSwinburne Maddison managing partner John Davison said: “I am humbled and flattered to receive this award on behalf of the firm. What, after 38 years of my career with the firm, I have found, is that I am still excited about it and I am still learning. \n“We have a wonderful array of talent. I am massively hopeful for the future with the young talent that we have got. The future looks really bright.” Meanwhile, Newcastle firm Collingwood Legal scooped the award for small law firm of the year –the category for firms with fewer than six partners. \nCorporate partner Martin Hulls said: “We are really pleased to win this latest award, which is a tribute to the hard work, expertise and dedication of our team. \n“We always strive to deliver the very best service, and to achieve the very best outcome, for our clients, and it is deeply gratifying to have this acknowledged with this award.” Ward Hadaway took home the Employment Team of the Year award at the Northern Law Awards 2017 (Photo: Staff) 8.55 Port of Tyne receives massive structures as part of renewable energy hub \nBodyWords: 387 \nMassive structures that will form part of a renewable energy hub have been delivered to the Port of Tyne as part of a multi-million pound investment. \nThe 19m-high eco-hoppers were purpose-built in Spain and are part of a system being installed so that the port can handle the import of wood pellets for use in the Lynemouth Power Station in Northumberland. \nThe conversion is one of the largest civil engineering projects in the UK, with a total of £300m invested by Lynemouth Power Limited. \nThe Port of Tyne has invested £38m in upgrading its quay capacity, extending its main Riverside Quay by 125m, and in specialist handling and storage equipment, including the hoppers. \nThree 36-metre high silos and 1,300 metres of enclosed conveyors are under construction at the port in a project that has created 1,000 jobs in construction and, when completed, is expected to provide 130 full-time jobs. 'Happy Delta' travels down the River Tyne with two new wood chip hoppers for the Port of Tyne (Photo: supplied by Port of Tyne: free to use) 8.50 Coreena Ford Naked Deli to open two city centre eateries in Newcastle after £350,000 investment \nA very happy third birthday to The Naked Deli today, which is marking its third anniversary with the announcement that it is to open two city centre eateries. \nThe Naked Deli is set to bring its healthy foods to city centre shoppers and workers when it opens two new eateries in Newcastle this year. \nThe health food specialist launched its range of juices, superfood salads and sandwiches and raw vegan cakes exactly three years ago, when it opened on Heaton’s Chillingham Road. \nSince then, demand from customers has seen the brand expand significantly, through openings in the former Post Office in Gosforth Shopping Centre and in Fenwick’s revamped food hall, as well as several concessions. \nThe upstairs of the former Post Office unit was also transformed into a huge 2,000sq ft kitchen, where all the firm’s healthy treats are prepared for the Gosforth, Heaton and the Fenwick outlet. \nNow the company’s owners and directors – Kirstie Kimmins, Chris Jones and Ian Jones – are driving forward further expansion, with plans to open in intu Eldon Square at the Monument, right beside the entrance in a unit known as the ‘Bullnose’. \nThe Bullnose will sell all Naked Deli’s takeaway ‘grab and go’ health foods and treats, along with the firm’s cold pressed juices, superfood smoothies, teas and coffees, protein shakes from this summer, when the unit opens creating 10 new jobs. \nA further city centre sit-in deli is also poised to go ahead, at a location yet to be revealed. The Naked Deli is set to open a shop in the intu Eldon Square 'Bullnose', as this CGI show, to the right of the shopping and leisure complex's entrance (Photo: The Naked Deli) 8.45 Coreena Ford Formica opens new North Shields offices as £40m investment plan is revealed \nBusiness leaders have heralded a new era at North Shields manufacturer Formica, where directors have unveiled a £40m investment plan to drive forward future growth. \nFormica has been a major employer in the North East’s manufacturing sector for more than 70 years, making laminate products for the residential and commercial sectors at its sites in North Shields and Newton Aycliffe, County Durham. \nNow, the New Zealand owners of the business, Fletcher Building, has pledged to plough £40m into the base over the next three years, radically transforming and upgrading its production facilities and offices in a move to drive up its UK market share. \nPeter Rush, president of Formica Group Europe, revealed full details of the investment plans for the first time at a special open day at the Coast Road site, bringing together industry leaders, politicians and directors as the firm cemented its commitment to the North East. \nThe investment is being made in three phases, the first of which has seen the relocation of around 100 office staff from Cobalt to the Coast Road base, which will now serve as the European headquarters – a decision backed by the New Zealand parent company after the Brexit vote last June. \nMr Rush outlined other significant spending plans which will bring new machinery and upgrades for existing machinery, which could potentially create new jobs. Peter Rush, President and CEO of Formica, at its headquarters in North Tyneside (Photo: Newcastle Journal) 8.42 Coreena Ford Santander wins race to buy Banco Popular for one Euro \nSantander is to acquire troubled rival Banco Popular for just one euro after European regulators said the lender was likely to fail. \nThe Spanish banking giant said it came out on top in a competitive sale process, adding that it will raise 7 billion euros (£6.1 billion) to cover the capital and provisions required to “reinforce the balance sheet of Banco Popular”. \nThe money will be raised through a share capital increase and the deal will also see Santander take on Banco Popular’s debt. \nShares in Banco Popular have slumped over 50% since last week over concerns about the lender’s capital position, which requires billions of euros in bolstering. \nLoss-making Banco Popular has been stung by property loans gone bad and has been attempting to raise cash in recent weeks by selling off stakes in joint ventures. The European Central Bank said earlier that the bank “was failing or likely to fail”. \nIt added: “The significant deterioration of the liquidity situation of the bank in recent days led to a determination that the entity would have, in the near future, been unable to pay its debts or other liabilities as they fell due. \n“Consequently, the ECB determined that the bank was failing or likely to fail and duly informed the Single Resolution Board, which adopted a resolution scheme entailing the sale of Banco Popular to Banco Santander.” \nThe EU’s Single Resolution Board said Banco Popular will continue to operate under “normal business conditions” as a solvent and liquid member of Santander Group. A Santander high street bank 8.38 Coreena Ford Ramsdens Holdings share price soars 6.7% \nThe Middlesbrough pawnbroker’s share price has rocketed to 134p in early trading, a rise of 6.77%. \nI’ll be speaking to the firm’s CEO Peter Kenyon later this morning to ask him about the growth strategy, which includes a planned 12 new store openings a year in the medium term, as well as looking to grow its online audience. \nFinancial analysts Liberum have now upgraded their FY18 and FY19 forecasts,with the revised forecasts equating to earnings per share upgrades of 8% in FY18 and 5% in FY19. (Photo: PA) KEY EVENT Yoga classes, theatre tickets and an office sauna among latest office perks \nFirms are getting more inventive with perks for staff, making offers including theatre tickets, yoga classes and cocktails, a study has revealed. \nGlassdoor has carried out the study, finding out how betting exchange company Smarkets employs chefs to cook food for employees, while money transfer firm TransferWise has an office sauna. \nJobs site Glassdoor said many employers are now going beyond travel loans or bike to work schemes. \nSome offer free food and drink every Friday, give money to take part in sports events or take workers on holiday. \nDavid Whitby, of Glassdoor, said: “Perks don’t have to be expensive, but if used correctly they can reinforce a company’s brand and values.” \nI’ve no doubt that North East firms offer their employees unusual perks - we’ve done several features here on the cool office environments companies have created, and how many are installing games rooms to encourage productivity. Others, including IAM Sold take their entire workforce away on holiday . \nDoes your business offer an inventive perk for staff to enjoy away from work? Get in touch with me if the answer’s yes - coreena.ford@ncjmedia.co.uk Yoga classes are among the more unusual perks firms now offer employees 8.20 Coreena Ford New Anglo American chairman announced \nAnglo American has appointed Stuart Chambers as its new chairman ahead of the departure of Sir John Parker. \nThe mining giant said Mr Chambers, who was chairman of ARM Holdings and Rexam until last year, will take the role in November. \nMr Chambers has also served as a non-executive director on the boards of Smiths Group and Tesco following an executive career at Nippon Sheet Glass, Mars and Shell, where he began his career as a chemical engineer. \nMr Chambers said: “It is a great privilege to be appointed chairman of a company as iconic as Anglo American, in this its centenary year. \n“Anglo American has emerged from the commodity price downturn more resilient and with a renewed sense of purpose, both strategically and in terms of the role it plays in society.” \nSir John announced in February his intention to step down after eight years as chairman. \nThe same month, Anglo announced it had swung to a full-year profit after it was boosted by recovering commodity prices, such as coal and iron ore, and a cost-cutting drive. \nChief executive Mark Cutifani said: “We have materially restored Anglo American’s balance sheet and transformed the business performance over the last three years, and our task now is to unlock the very considerable value that we can see from our world-class asset base.” 8.15 FTSE opening and pound latest \nThe FTSE-100 index opened at 7524.95. \nThe pound at 8am was 1.2908 dollars compared to 1.2899 dollars at the previous close. The euro at 8am was 0.8735 pounds compared to 0.8732 pounds at the previous close. Screen displaying the FTSE 100 at the London Stock Exchange (Photo: Yui Mok/PA Wire) 8.10 Coreena Ford Shoe Zone feeling Brexit impact \nRetailer Shoe Zone has seen half-year profits tumble by 84% after the Brexit-hit pound sent its buying costs soaring and sales fell amid a store overhaul. \nThe Leicester-based group saw pre-tax profits plunge to £309,000 in the six months to April 1, from £1.9 million a year earlier. \nShoe Zone buys its stock from China in US dollars and has been hit hard by sterling’s fall since the EU referendum. \nSales also came under pressure, down 2.3% to £72.9m, as a restructure of its store estate saw the group close 12 outlets and open nine, including one in its new “Big Box” format. \nNick Davis, chief executive of Shoe Zone, said: “The devaluation of sterling against the dollar has impacted the group’s statutory profits in the period, however, as we reach the annualised re-basing of this rate, we anticipate the ongoing impact will be significantly reduced.” \nEven with the sterling impact stripped out, underlying profits fell to £1.3m from £1.7m. \nThe group also cautioned that high street conditions will remain “uncertain given the political environment in the UK and across Europe in the coming months”. Shoe Zone is feeling the pinch (Photo: PA) 8.00 KEY EVENT Middlesbrough pawnbroker Ramsdens marks 'transformational' year \nMiddlesbrough pawnbroker Ramsdens Holdings is toasting a triumphant year with group revenue up 15% to £34.5m, pre-tax profits up 73% to £4m and almost a 50% leap in earnings per share. \nThe Boro sponsor floated on London’s junior Alternative Investment Market (AIM) in February a bid to raise millions of pounds by selling shares in the company. \nIn a float that valued the firm at £26.5m, it raised £15.6m by issuing shares at 86p apiece - and the current share price is 125.5p. \nPeter Kenyon, Chief Executive, said: “FY17 was a transformational year for Ramsdens with the Group delivering good growth across all four of its key business segments and achieving the significant milestone of its admission to AIM. \n“We have made a strong start to the early part of the current year across all core segments. We are about to enter our seasonally important summer period and are confident of making further progress.” \nHeadquartered in Middlesbrough, the Group operates from 127 stores within the UK (including 3 franchised stores) and has a small but growing online presence. \nThe firm operates in four core business segments of foreign currency exchange, pawnbroking loans, precious metals buying and selling and retailing of second hand and new jewellery, and the directors said they saw growth across all segments. \nDuring the year, the group’s investment into growing the Ramsdens brand continued and as the main shirt sponsor for Middlesbrough Football Club, it gained enjoyed greater exposure during the team’s season in the Premier League. \nThe firm’s association with the club continues this forthcoming 2017/2018 season, the final year of its current contract as sponsor. Ramsdens chief executive Peter Kenyon (Photo: Publicity Pic) Share ", "external_links": [], "published": "2017-06-07T15:05:00.000+03:00", "crawled": "2017-06-07T10:59:12.000+03:00", "highlightTitle": ""}