{"organizations": [], "uuid": "5765e0d6d30e59544e9ce610e02b902f2aef5e6b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article13175455.ece/ALTERNATES/s1200/Theresa-May-Campaigns-In-Labours-Heartland-Of-North-Tyneside.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/conservative-mp-urges-party-give-13175348", "country": "GB", "domain_rank": 21960, "title": "Conservative MP urges party to give Theresa May at least two years as Prime Minister", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-13T00:16:00.000+03:00", "replies_count": 0, "uuid": "5765e0d6d30e59544e9ce610e02b902f2aef5e6b"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/conservative-mp-urges-party-give-13175348", "ord_in_thread": 0, "title": "Conservative MP urges party to give Theresa May at least two years as Prime Minister", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "mrs trevelyan", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "anne-marie trevelyan", "sentiment": "none"}, {"name": "trevelyan", "sentiment": "none"}, {"name": "stockton south", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "east cleveland", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "berwick", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}], "organizations": [{"name": "middlesbrough south", "sentiment": "none"}, {"name": "tories", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "hexham", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Conservative MP urges party to give Theresa May at least two years as Prime Minister Tory government should get Brexit done and think about the leadership in 2019, says North East MP Anne-Marie Trevelyan Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily   Thank you for subscribing!   \nTheresa May should continue as Prime Minister long enough to oversee Brexit, according to a North East Conservative MP . \nBut the party could consider choosing a new leader once Brexit talks are concluded in 2019, said Anne-Marie Trevelyan. \nShe said: “I would happily go for five years but, realistically, I would be appalled if we did anything as a party before 2019. \n“I think we should absolutely crack on, get Brexit done, come out the other side. \n“And then if it was appropriate for the party to have a leadership election or she wanted to stand down, then we’d look at it again. But it shouldn’t even be a subject for the next two years.” \nMrs Trevelyan held her seat of Berwick in last week’s election but the party failed to make the gains some Tories had hoped for in the North East. \nThe Conservatives gained Middlesbrough South and East Cleveland from Labour but lost Stockton South to Jeremy Corbyn’s party. Theresa May with Anne-Marie Trevelyan in Northumberland (Photo: Getty Images Europe) \nThey also held on to Hexham, which means they have three North East seats just as they did before the election took place. \nMrs Trevelyan, who campaigned in favour of Brexit in last year’s referendum, urged Mrs May to continue with a minority government, following the general election which led to a hung Parliament, rather than calling another general election in the near future. \n“Without a doubt not a single voter I have spoken to, or the hundreds of e-mails I had at the weekend, indicated anyone wants another election in the medium term. \n“They want us to get on with it, crack on with Brexit and run the country.” \nShe said the electorate “would just crucify everybody” if there was another election now. “They are all exhausted”. \nTheresa May was the right person to lead the country through Brexit, said Mrs Trevelyan. \n“It is incumbent upon us to put together something that works and get on with Brexit. \n“It will be a huge administrative, logistical programme of work from a Parliamentary perspective. \n“So to be honest if we crack on with that for two years and don’t get to distracted by other things, that will be a good thing for the country. Everybody wants us to get Brexit sorted out, so that’s what we should focus on.” \nShe added: “And then when we get to other side of it, work out what to do next.” Read More Jeremy Corbyn's critics are contacting me to admit they were wrong, says Labour's chief whip \nMrs Trevelyan her party had made a mistake in failing to highlight what she called “the fiscal irresponsibility of Corbyn’s manifesto” during the general election campaign. \nConservatives had been right to try to find ways of funding social care - the policy that became knwn as the “dementia tax” - but had failed to explain what they were trying to do, she said. \n“The content [of the manifesto] in many ways was very sound but a big gap for me was the whole economics piece. It’s as if we took it for granted that everyone would know Corbyn was economically illiterate, and that was very foolish of us.” Like us on Facebook", "external_links": [], "published": "2017-06-13T00:16:00.000+03:00", "crawled": "2017-06-12T19:22:26.015+03:00", "highlightTitle": ""}