{"organizations": [], "uuid": "0460e057492f3c84b0af0bace8ef879f2f0187b2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/30417703/16064633.jpg", "site_section": "http://www.thisisleicestershire.co.uk/specialolympics/rss.html?chid=181121", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/set-up-textiles-hub-for-leicester-to-revive-the-industry/story-30417703-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "Lauren_Mills published 'Set up textiles hub for Leicester to revive the industry'", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-30T15:51:00.000+03:00", "replies_count": 0, "uuid": "0460e057492f3c84b0af0bace8ef879f2f0187b2"}, "author": "Lauren_Mills", "url": "http://www.leicestermercury.co.uk/set-up-textiles-hub-for-leicester-to-revive-the-industry/story-30417703-detail/story.html", "ord_in_thread": 0, "title": "Lauren_Mills published 'Set up textiles hub for Leicester to revive the industry'", "locations": [], "entities": {"persons": [{"name": "nick pulley", "sentiment": "none"}], "locations": [{"name": "leicester", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}], "organizations": [{"name": "focus consultants", "sentiment": "none"}, {"name": "leicester city council", "sentiment": "none"}, {"name": "leicestershire enterprise partnership", "sentiment": "none"}, {"name": "leicestershire textiles", "sentiment": "none"}, {"name": "leicester textiles", "sentiment": "none"}, {"name": "fashion hub", "sentiment": "none"}, {"name": "llep", "sentiment": "none"}, {"name": "erdf technical assistance programme", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "focus consulting", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "'Set up textiles hub for Leicester to revive the industry' By Lauren_Mills   0 COMMENTS SHARES More help planned for Leicester's textiles companies 'Set up textiles hub for Leicester to revive the industry' X \nCopy link to paste in your message / Comments (0) \nNew research suggests a Leicester Textiles and Fashion Hub needs to be set up to help revive one of the city and county's oldest industries. \nThe Leicester and Leicestershire Enterprise Partnership (LLEP) carried out a study to establish the need for a physical Leicester Textiles and Fashion Hub. \nThe study explored various ways to create a physical textiles and fashion hub to act as a \"one-stop shop\" for businesses. \nRead more: Council 'concerned' after Leicester textile firms accused of paying below the minimum wage \nEstablishing the need for a physical textiles and fashion hub in Leicester was one of the key objectives set out in the Leicester and Leicestershire Textiles Sector Growth Plan, published by LLEP in June 2015. \nIn December 2016, the LLEP commissioned Focus Consultants to carry out research and canvas the views of industry leaders on the possibility of a physical hub in Leicester. \nThe study, which was part-funded by the LLEP's ERDF Technical Assistance Programme and Leicester City Council, recognises the strengths and weaknesses of the textiles manufacturing sector in Leicester and Leicestershire, and scopes the potential to launch a textiles hub while exploring the possibilities of deliverability, location, size, cost, image, form and function and sustainability. \nSome of the main findings include: \nThe sector employs 9,500 jobs in 1,480 businesses. \nUK manufacturing offers important advantages around flexibility and speed. \nMacroeconomic changes such as exchange rates, Brexit and discussions on trade deals are also influencing reshoring of manufacturing back to the UK. \nThe textiles sector is much wider than fashion. However, it is clear there is a will and opportunity at this time to address some of the issues facing the fashion textiles sector as a first phase of the Textiles Hub. \nFocus Consulting has also prepared a mission statement for the Hub which is: \"To support the development of a robust, future-focused, highly skilled and sustainable fashion and textiles sector with high quality jobs in Leicester and the UK.\" \nNick Pulley, chairman of the LLEP, said: \"The fashion and textiles sector is very important to the local economy. \n\"There is a great passion from industry leaders to pursue a Textiles and Fashion Hub and this textiles report is a fantastic starting point. \n\"A Textiles and Fashion Hub would provide opportunities and facilities for research, development, innovation, collaboration with universities, colleges and skills training.\"", "external_links": [], "published": "2017-06-30T15:51:00.000+03:00", "crawled": "2017-06-30T17:00:23.005+03:00", "highlightTitle": ""}