{"organizations": [], "uuid": "95bbb019be316312ebd2a6944b1d19c31bc95eb6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article13167037.ece/ALTERNATES/s1200/IBP_NEC_270517teachers_rally_06JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/our-children-depend-us-campaigners-13166519", "country": "GB", "domain_rank": 21960, "title": "'Our children depend on us': campaigners say unstable Parliament gives hope to fight school cuts", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-10T23:00:00.000+03:00", "replies_count": 0, "uuid": "95bbb019be316312ebd2a6944b1d19c31bc95eb6"}, "author": "Hannah Graham", "url": "http://www.chroniclelive.co.uk/news/north-east-news/our-children-depend-us-campaigners-13166519", "ord_in_thread": 0, "title": "'Our children depend on us': campaigners say unstable Parliament gives hope to fight school cuts", "locations": [], "entities": {"persons": [{"name": "mike parker", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "con todd", "sentiment": "none"}, {"name": "daniel kebede", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "newcastle city centre", "sentiment": "none"}, {"name": "north tyneside", "sentiment": "none"}], "organizations": [{"name": "parliament", "sentiment": "neutral"}, {"name": "national audit office", "sentiment": "none"}, {"name": "general election", "sentiment": "none"}, {"name": "kebede", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "national union of teachers", "sentiment": "none"}, {"name": "nao", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "st benet biscop high school", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily     \n“We can win.” \nThese are the words of teachers who say they’re determined to prevent the “devastating” cuts they claim could see their schools losing teachers , cutting subjects or reducing the school day. \nConservative plans for education proved controversial over the past few weeks, as teachers argued schools weren’t being given enough cash to continue to provide education at their present standard. \nBut as Theresa May works to form her Government, North Tyneside teacher and National Union of Teachers (NUT) activist Daniel Kebede says he believes an anti-cuts campaign can “build momentum” and force Government to allocate more money. \nPrior to the election campaign, Conservative ministers argued that their new funding formula made education fairer, by redistributing cash they said had historically been shared unfairly. Teachers' rally at the Monument in Newcastle City Centre (Photo: Newcastle Chronicle) \nBut campaigners said all the formula did was share out insufficient funds in a different way. \nAccording to the National Audit Office (NAO) said schools would need to find an extra £3bn by 2020 — equating to an 8% real-terms cut in funding. \nThe ‘cut’ would come as a result of increasing costs, including staff pay rises, higher contributions to national insurance and rising pension bills. \nAhead of the election, teachers and parents held a rally in Newcastle City Centre to protest Conservative funding plans, while before the election was called, head teachers from across the region had written to parents to warn them of the impact the plans could have on their schools. \nIn March headteacher Con Todd, St Benet Biscop High School, warned of the sorts of decisions his and other schools were facing. \nHe said: “Certainly there will be redundancies; cuts to courses that we’ve traditionally offered because we feel they are essential but have low student numbers; bigger class sizes; shorter school days; a loss of extra curricular activities. These are really uncomfortable decisions.” Teachers' rally at the Monument in Newcastle City Centre (Photo: Newcastle Chronicle) \nMe Kebede believes the action taken by teachers not only helped to ensure that their concerns were well-known among parents, but may even have had an impact on Thursday’s General Election result . \nHe said: “As a trade union representative I’m particularly proud of how we’ve put education cuts on the agenda, because Theresa May did try to make this election about Brexit, but we put education cuts on the map and it did seem to be something that was on people’s agenda. Read More Funding formula and school cuts: Everything you need to know \n“When people were voting they weren’t just thinking about Brexit, they were thinking about school cuts, the NHS, about their homes.” \nAnd he’s holding out hope that the Conservative’s tenuous grip on power, they will be forced to make more cash available for education. \nHe said: “They won’t be able to push through the new funding formula, they are very unstable, everything is up for grabs.” \nMeanwhile, education charity Schools North East called on heads and teachers to “press home the case for additional funding” amidst Parliamentary uncertainty, asking all teacher to write to their MPs to highlight the “punishing” impact of funding plans. Teachers' rally at the Monument in Newcastle City Centre (Photo: Newcastle Chronicle) \nDirector Mike Parker said: “Funding is the single greatest threat to pupils in the North East getting a high quality education in the coming years... \n“With staffing costs accounting for 75-90% of a school’s total budget, the depth of cuts required will be devastating if the Government doesn’t move swiftly to properly fund education in this country.” Like us on Facebook", "external_links": [], "published": "2017-06-10T23:00:00.000+03:00", "crawled": "2017-06-10T23:24:40.009+03:00", "highlightTitle": ""}