{"organizations": [], "uuid": "ab9a43055e8e268e54285514e28444a985ad6821", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/30381018/16037355.jpg", "site_section": "http://www.thisisleicestershire.co.uk/elections2009/rss.html?chid=181299", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/who-are-the-dup-here-are-the-democratic-unionist-party-8217-s-policies-and-controversies/story-30381018-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "Hayley_Watson published The DUP could form the next government - but who are they and...", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-09T18:40:00.000+03:00", "replies_count": 0, "uuid": "ab9a43055e8e268e54285514e28444a985ad6821"}, "author": "Hayley_Watson", "url": "http://www.leicestermercury.co.uk/who-are-the-dup-here-are-the-democratic-unionist-party-8217-s-policies-and-controversies/story-30381018-detail/story.html", "ord_in_thread": 0, "title": "Hayley_Watson published The DUP could form the next government - but who are they and...", "locations": [], "entities": {"persons": [{"name": "steve myall", "sentiment": "none"}, {"name": "arlene foster", "sentiment": "none"}, {"name": "peter robinson", "sentiment": "none"}, {"name": "michelle o'neill", "sentiment": "none"}], "locations": [{"name": "irish republic", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}], "organizations": [{"name": "dup", "sentiment": "negative"}, {"name": "health service", "sentiment": "none"}, {"name": "democratic unionist party", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "ulster resistance", "sentiment": "none"}, {"name": "sinn fein", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The DUP could form the next government - but who are they and what are their policies? By Hayley_Watson | Posted: June 09, 2017 By Steve Myall Democratic Unionist Party leader Arlene Foster The DUP could form the next government - but who are they and what are their... X \nCopy link to paste in your message / Comments (10) \nMillions across the country have woken up to the news that yesterday's general election failed to result in a majority win for any party. \nAnd with the reality of a hung parliament is setting in, it is widely believed that the Conservatives will be looking to the DUP to retain their governance. \nBut if you haven't heard of the party before, who are they? \nRead more: What's next for the main party leaders after the general election result? \nBased in Northern Ireland, the Democratic Unionist Party is headed up by leader Arlene Foster. \nCurrently they have 10 seats – making them the fifth largest party in Westminster – and are outspoken about 'taking pride in Northern Ireland'. \nHowever, they have been accused of being 'sexist' with their anti-abortion legislation, are climate change deniers and don't support gay marriage, report Mirror Online . What was in the DUP's manifesto? \nThe DUP back Brexit – but not 'hard' Brexit, largely because they don't want a hard border with Ireland. \nTheir manifesto sets out a 30-point wish list of priorities and objectives for the forthcoming Brexit negotiations, which included maintaining the Common Travel Area to ensure a frictionless border, and ease of trade throughout the European Union. \nThey also put forward the following issues: \"Prioritise spending on our Health Service, create more jobs and increase incomes, protect family budgets, raise standards in education for everyone and invest in infrastructure.\" \nIt went on to say that the DUP five point plan could be advanced through ten elements, each with a broad range of policy targets and ideas including: \n1. More jobs and rising incomes \n2. A world class health service \n3. Education – every child the opportunity to succeed \n4. Rebuilding Northern Ireland \n6. Safer streets and smarter justice \n7. Creating stronger communities \n8. A friend of the farmer and our natural heritage \n9. Changing politics and government in Northern Ireland \n10. Taking pride in Northern Ireland \nIn addition to the party call for the \"particular circumstances of Northern Ireland\" to be fully reflected, they further propose for the region to be \"established as a hub for trade from the Irish Republic into the broader UK market\". \nThe DUP manifesto places emphasis on digital and transport connectivity in relation to Northern Ireland's location. \nIn particular, it highlights that investment in infrastructure to provide this connectivity (through broadband provision, airport and ferry services etc) not only supports economic competitiveness, but provides \"a boost for the local construction industry\". And what are the DUP's controversies? \nHowever, the DUP controversially oppose same sex marriage, and have limited enthusiasm for LBGT rights. \nAnd In May leader Arlene Foster made headlines after \"sexist remarks\" she made about Sinn Fein's Michelle O'Neill. \nThe party are also climate change deniers , with the party's chief whip saying that that it is a \"con\" to state that human activity is upsetting weather patterns. \nDespite that, the party used their role in government in Northern Ireland to set up a subsidy scheme for biofuels, which gave those who bought into it more money than they had to pay out. \nThe Northern Irish exchequer ended up paying out around half a billion pounds to those who knew about the scheme, leading to a scandal known as 'cash for ash', and a major investigation into whether DUP staff and supporters personally benefitted. \nDemocratic Unionist Party also have strong historical links with Loyalist paramilitary groups, and with the extreme right of the political spectrum. \nSpecifically, the terrorist group Ulster Resistance was founded by a collection of people who went on to be prominent DUP politicians. \nFormer First Minister Peter Robinson, for example, who was DUP leader and Northern Ireland's first minister until last year, was an active member of Ulster Resistance. \nRead more: Who in Leicestershire had a good election night - and who didn't? \nThey have form for backing the Conservatives and in October 2016, DUP leader Arlene Foster and DUP MPs held a champagne reception at the Conservative Party conference, marking what some have described as an \"informal coalition\" or an \"understanding\" between the two parties. ", "external_links": [], "published": "2017-06-09T18:40:00.000+03:00", "crawled": "2017-06-09T15:24:18.000+03:00", "highlightTitle": ""}