{"organizations": [], "uuid": "53143b77cc6e103bf548aefbeb36d610c6e9e6b6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article13156724.ece/ALTERNATES/s1200/MAYCORBS.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/havent-discussed-brexit-election-because-13156705", "country": "GB", "domain_rank": 21960, "title": "We haven't discussed Brexit in this election because both parties have the same policy", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-08T23:00:00.000+03:00", "replies_count": 0, "uuid": "53143b77cc6e103bf548aefbeb36d610c6e9e6b6"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/havent-discussed-brexit-election-because-13156705", "ord_in_thread": 0, "title": "We haven't discussed Brexit in this election because both parties have the same policy", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "negative"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "norway", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "westminster", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "lib dems", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News We haven't discussed Brexit in this election because both parties have the same policy It's the most important issue facing the country but he haven't debated it because Labour and the Conservatives have the same policies Share Theresa May and Jeremy Corbyn Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThis was supposed to be the Brexit election. But as it turned out, Brexit was hardly discussed . \nThat’s because both major parties have the same policy. \nTheresa May said she needed an early general election because there was “division” at Westminster about Brexit. Opposition parties were trying to wreck the UK’s departure from the EU , she claimed. \nAnd her campaign message was that only she could provide the leadership needed to ensure the UK gets a good Brexit deal from our former EU partners. \nBut beyond the slogans (strong and stable and all that) there was very little debate about what sort of Brexit we want. \nBoth major parties - the two potential governments - agreed that we should leave the EU following the Brexit referendum. They rejected calls for a second referendum. \nAnd they agreed that leaving the EU must meant leaving the single market, while trying to agree a deal giving us as much single market access as possible. \nThe Conservative manifesto stated: “We will no longer be members of the single market”. Labour’s manifesto was less clear, but Jeremy Corbyn said in his manifesto speech that “Labour will negotiate a deal that preserves jobs and access to the single market”, making it pretty clear that we would no longer be members. \nOther options are possible. Norway is not a member of the EU but it is a member of the single market. Could that, perhaps, work for the UK? It wasn’t discussed. \nBoth major parties also agreed that we should no longer have freedom of movement between the UK and EU. \nThe Conservative manifesto said: “Leaving the European Union means, for the first time in decades, that we will be able to control immigration from the European Union too.” \nAnd the Labour manifesto said: “Freedom of movement will end when we leave the European Union.” Read More General Election 2017 LIVE: Polling stations open as Newcastle and the North East start casting their votes \nBut we don’t need to end freedom of movement if we leave the EU. Again, Norway is an example of a country that has freedom of movement with the EU despite not being a member. \nSome people might argue that following in Norway’s footsteps would be unpopular with British voters. They may be right. It’s perfectly possible that Labour and the Tories have the right polices on Brexit. \nBut it remains true that they have chosen to pursue the same policies when other options are available. \nLabour argue that the Tory plan is to turn the UK into some sort of offshore tax haven. But that’s not Conservative policy. It’s something the Tory government threatened to do if they can’t get a good trade deal. What they actually say they’ll do is to negotiate a good trade deal, just as Labour does. \nOne party did offer something different, and that’s the Liberal Democrats. \nThey said many things about Brexit, but the policy that stood out was a pledge to hold a second referendum. This would nominally be on whether to accept a new trade deal but one of the options in the vote, the Lib Dems said, would be to call the whole thing off and stay in the EU after all. \nThe apparent Lib Dem failure to make a breakthrough in this election suggests that there’s little appetite for that among British voters. \nThis election has established that Brexit is definitely happening. Like us on Facebook ", "external_links": [], "published": "2017-06-08T23:00:00.000+03:00", "crawled": "2017-06-08T18:30:04.005+03:00", "highlightTitle": ""}