{"organizations": [], "uuid": "84bfcd6922b847ca926fc425c3805b4a9599b25c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13168051.ece/ALTERNATES/s1200/2017-General-Election.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/general-election-fallout-live-updates-13172391", "country": "GB", "domain_rank": 21960, "title": "Election fallout LIVE: Updates as Britain faces an uncertain political future with hung parliament", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-12T18:00:00.000+03:00", "replies_count": 0, "uuid": "84bfcd6922b847ca926fc425c3805b4a9599b25c"}, "author": "Katie Collings", "url": "http://www.chroniclelive.co.uk/news/north-east-news/general-election-fallout-live-updates-13172391", "ord_in_thread": 0, "title": "Election fallout LIVE: Updates as Britain faces an uncertain political future with hung parliament", "locations": [], "entities": {"persons": [{"name": "katie collings", "sentiment": "negative"}, {"name": "arlene foster", "sentiment": "negative"}, {"name": "foster", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "westminster", "sentiment": "none"}, {"name": "belfast", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "south fermanagh", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}], "organizations": [{"name": "democratic unionist", "sentiment": "neutral"}, {"name": "house of commons", "sentiment": "none"}, {"name": "dup", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Katie Collings Bercow set to stay as speaker amid political uncertainty \nJohn Bercow appears on course to continue as Commons Speaker after a prominent critic said there is “no appetite” to push a vote to challenge him. (Photo: PA) \nConservative former minister James Duddridge added he believes there are “more important battles to fight” in the UK following the General Election. Before polling day, Mr Bercow had been expected to face opposition after he said he wanted to serve the full-term of up to five years in the next Parliament, rowing back on a pledge to step down next year. \nBut with the Conservatives losing their Commons majority and Prime Minister Theresa May’s future called into question, Tuesday’s election of a Commons Speaker is now expected to see Mr Bercow returned unopposed by MPs. \nMr Duddridge told the Press Association: \n“There is no love for Mr Bercow, but there is not an appetite to push it to a vote. \n“The country has more important battles to fight, backing the Prime Minister, delivering Brexit and growing the economy.” \nMr Duddridge added he is not aware of anyone else preparing to challenge Mr Bercow. General Election Katie Collings Who is Arlene Foster? \nDemocratic Unionist leader Arlene Foster has said talks will begin with Theresa May on the formation of a new Government. (Photo: PA) \nThe former Stormont First Minister, who led her party to 10 seats in the Westminster election, said the DUP will strive for the best deal for Northern Ireland, its people and an agreement that is best for the United Kingdom. \n“The Prime Minister has spoken with me this morning and we will enter discussions with the Conservatives to explore how it may be possible to bring stability to our nation at this time of great challenge,” she said. \nMs Foster described her party’s resounding victory in Northern Ireland as “truly historic” as the DUP recorded its best ever election result. \nSending a powerful team of 10 MPs to a hung parliamen t puts the Democratic Unionists in the enviable position of being kingmakers at Westminster. \nMs Foster, flanked by each one of her representatives in the House of Commons, did not take any questions after confirming plans for talks with the Conservatives. \nBut who is she? \nMs Foster was born and raised in South Fermanagh, Northern Ireland, on July 3 1970. Before a career in politics she worked as a private practice solicitor, and has a law degree from Queen’s University in Belfast.", "external_links": [], "published": "2017-06-12T18:00:00.000+03:00", "crawled": "2017-06-12T13:43:29.002+03:00", "highlightTitle": ""}