{"organizations": [], "uuid": "b2cbb9e0da47395b35b483500ee93138ef6471c1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13187505.ece/ALTERNATES/s1200/I-FILE-PHOTO-FILE-PHOTO-Tim-Farron-quits-as-Lib-Dem-leader-FILE-PHOTO-Tim-Farron-quits-as-Lib-Dem.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/tim-farron-resigns-leader-liberal-13187460", "country": "GB", "domain_rank": 21960, "title": "Tim Farron resigns as leader of the Liberal Democrats, citing criticism of his religious beliefs", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-15T02:21:00.000+03:00", "replies_count": 0, "uuid": "b2cbb9e0da47395b35b483500ee93138ef6471c1"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/tim-farron-resigns-leader-liberal-13187460", "ord_in_thread": 0, "title": "Tim Farron resigns as leader of the Liberal Democrats, citing criticism of his religious beliefs", "locations": [], "entities": {"persons": [{"name": "tim farron", "sentiment": "negative"}, {"name": "jo swinson", "sentiment": "none"}, {"name": "farron", "sentiment": "none"}, {"name": "brian paddick", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "liberal democrat hq", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Tim Farron resigns as leader of the Liberal Democrats, citing criticism of his religious beliefs Tim Farron says he 'seems to be the subject of suspicion' because he's a Christian as he leaves his post Share Tim Farron (Photo: Getty Images Europe) Share Get daily     \nTim Farron has resigned as leader of the Liberal Democrats . \nAnd Mr Farron, a Christian, said it followed criticism of his religious beliefs. \nHe faced repeated questioning over his views on homosexuality during the campaign. Mr Farron initially refused to answer questions about whether he believes gay sex is a sin, although he eventually said he did not. \nThe Lib Dems failed to make significant progress in last week’s general election . \nThey won just 12 seats, although this was four more than in the previous election, in 2015. \nAnd they won 7.4% of the vote, down slightly from 7.9% in 2015. \nThere were signs earlier today of an attempt to force him to resign. Lord Brian Paddick, a former Lib Dem candidate for mayor of London, quit as the party’s home affairs spokesman, citing “concerns about the leader’s views on various issues”. \nAnnouncing his resignation in a speech at the Liberal Democrat HQ in London, Mr Farron told party workers: “To be a political leader - especially of a progressive, liberal party in 2017 - and to live as a committed Christian, to hold faithfully to the Bible’s teaching, has felt impossible for me. \n“I’m a liberal to my finger tips, and that liberalism means that I am passionate about defending the rights and liberties of people who believe different things to me. \n“There are Christians in politics who take the view that they should impose the tenets of faith on society, but I have not taken that approach because I disagree with it - it’s not liberal and it is counterproductive when it comes to advancing the gospel. \n“Even so, I seem to be the subject of suspicion because of what I believe and who my faith is in. \n“In which case we are kidding ourselves if we think we yet live in a tolerant, liberal society.” Read More \nMr Farron’s strategy during the general election campaign was to attempt to appeal to “remainers” who opposed Brexit. He called for a second referendum on leaving the EU. \nBut it didn’t seem to be effective when it came to attracting new voters. \nHe will continue as an MP. \nFavourites to succeed Mr Farron as the new Lib Dem leader include Jo Swinson, the MP for East Dunbartonshire. She lost her seat in 2015 but regained it in last week’s election. Like us on Facebook", "external_links": [], "published": "2017-06-15T02:21:00.000+03:00", "crawled": "2017-06-14T21:51:37.000+03:00", "highlightTitle": ""}