{"organizations": [], "uuid": "e3db5d0ee68f44c846be276d73be77637183d9b6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article11436881.ece/ALTERNATES/s1200/JS29809532.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13138781", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Tech firm Vianet posts 9.9% profit jump as Internet of Things market grows", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-06T15:00:00.000+03:00", "replies_count": 0, "uuid": "e3db5d0ee68f44c846be276d73be77637183d9b6"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13138781", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Tech firm Vianet posts 9.9% profit jump as Internet of Things market grows", "locations": [], "entities": {"persons": [{"name": "ena ford", "sentiment": "none"}, {"name": "stockton", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "vianet", "sentiment": "none"}], "organizations": [{"name": "vianet", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Today’s meeting is with Chris Stappard, MD of Edward Reed Recruitment. \nChris, currently in training for an Iron Man Triathlon,shares some of the experiences and lessons he has learned in his personal and professional life, including a meeting with The Queen when he was a member of The Boys’ Brigade as a teenager. Chris Stappard (Photo: RYAN EDY) 8.35 Coreena Ford Newcastle's Bottle Shop Bar taken over by charity helping people with autism \nA Newcastle city centre bar and restaurant has been taken over by new owners who will use the venue to give young people with learning difficulties the opportunity to gain valuable industry training. \nThe Bottle Shop Bar and Kitchen is now owned by St Camillus Leisure Ltd , an arm of St Camillus Care Group which also operates The Vault, the UK’s first hotel for young people with autism and learning difficulties, based in Gateshead. \nThe unique hotel will offer respite stays when it opens fully this summer, having already opened an American diner, Davy Duke’s, on the site, while also offering industry experience for youngsters with autism and learning difficulties. \nNow St Camillus is extending further into the leisure and hospitality sector, with grand plans to refurbish and rename the Bottle Shop to become a successful day and evening eatery, while also giving four students from Gateshead College the chance to gain hands-on experience in the trade. \nDirectors plan to invest significantly in the site, potentially also developing a balcony area which has planning permissions in place to become part of the restaurant. \nThe students, who all have learning difficulties, will train in the kitchen and food preparation areas to give them new skills and learn more about the hospitality industry. General view of the Bottle Shop Bar & Kitchen, Waterloo Square, Newcastle (Photo: Newcastle Chronicle) 8.30 KEY EVENT British Airways CEO says human error could have caused IT shutdown \nThe British Airways IT shutdown which left 75,000 bank holiday travellers stranded may have been caused by human error, airline boss Willie Walsh has suggested. \nMr Walsh, chief executive of BA owner International Airlines Group (IAG), said the actions of an engineer who disconnected and then reconnected a power supply to the data centre in “an uncontrolled and uncommanded fashion” may be central to a newly ordered independent investigation. \nMr Walsh, who was at the International Air Transport Association global summit in Mexico, is reported to have said: “You could cause a mistake to disconnect the power, it’s difficult for me to understand how you can mistakenly reconnect the power.” \nHe said “physical damage to the servers and distribution panels” was caused which made it difficult for BA to quickly overcome the power outage. \nMr Walsh suggested this “in itself was a problem that we could have overcome probably in a couple of hours, I don’t think it would have led to any cancellations”. \nOf the fed-up passengers who complained they had been left to queue before leaving Heathrow Airport, he said: “I wouldn’t suggest for one minute we got communications right at BA, we didn’t.” \nThe carrier was unable to resume a full schedule until the following Tuesday. British Airways aircraft (Photo: PA) 8.22 Coreena Ford AO World warns over sharp UK business slowdown after Brexit vote \nElectricals retailer AO World has warned over a sharp slowdown in its UK business amid “challenging” trading since the Brexit vote as it saw annual losses widen. \nThe group fell deeper into the red with pre-tax losses of £7m for the year to March 31 against £6.7m the previous year and said it remained under-pressure in the UK so far in the new financial year. \nAO World, which is set to be relegated from the FTSE 250 Index later this month after seeing shares plunge, said its UK growth rate would slow “significantly” in the first quarter. \nSteve Caunce, chief executive of AO World, said: “Trading this year has been mixed, particularly for our UK business. \n“In the second half of the year, trading in the UK became more challenging as we began to feel the impacts of dampening consumer confidence following the UK’s vote to leave the EU, subsequent price inflation and a slow-down in the UK housing market,” he added. \nThe group said with no let up in the difficult UK conditions and tough comparatives from a year earlier, “we expect our UK first quarter growth rate to slow significantly year on year”. \nThe group saw an improvement in group-wide operating losses on an underlying basis, narrowing by 46.2% to £2.1m, thanks to a better first half performance from the UK. \nThe group has since been grappling with a jump in import costs following sterling’s slump, while rising inflation has put the squeeze on consumer spending. Shares in the company have plunged 62% since its listing in 2014, resulting in it being demoted from the second tier to the small cap index in the latest FTSE reshuffle, which takes effect on June 19. \nDespite this, UK website sales rose 14.5% over the year as a whole and total UK revenues lifted 12.7% to £629.7m. \nAO World said trading across Europe - where AO has been investing heavily in Germany and the Netherlands - had “started well” in the new financial year so far. AO World, which operates AO.com, reports its last set of results as a FTSE 250 firm today. 8.15 FTSE and pound latest \nThe FTSE-100 index opened at 7525.76. \nThe pound at 8am was 1.2927 dollars compared to 1.2916 dollars at the previous close. The euro at 8am was 0.8720 pounds compared to 0.8706 pounds at the previous close. Screen displaying the FTSE 100 at the London Stock Exchange (Photo: Yui Mok/PA Wire) 8.10 Coreena Ford Retail sales down as consumers feel the pinch \nRetail sales sunk last month and online trading hit record lows as shoppers tightened their belts in the face of rising inflation, new figures have shown. \nThe latest British Retail Consortium-KPMG report found that like-for-like retail sales dropped by 0.4% in May, down from 0.5% growth last year. \nOnline sales of non-food products also slumped to the lowest level since records began in 2012, growing by 4.3% last month compared to a 13.7% jump in 2016. \nHowever, food sales reached their highest level in more than five years at 3.2% for the three months to May. Sales of food and drink were boosted by the warm weather in the run-up to the May bank holiday, with double-digit growth in beer, wine and spirit sales. \nPaul Martin, UK head of retail at KPMG, said retailers had been “brought back down to earth with a thump” after April’s sales surge due to the timing of the Easter holidays. \nHe said: “The impact of inflationary pressures on the nation’s purse continues to play out in this month’s figures, with shoppers evidently spending more on food and drink than on non-food purchases. A lady carrying shopping bags (Photo: PA) 8.05 KEY EVENT Vianet grows adjusted profit 9.9% as Internet of Things evolves \nDirectors at North East tech firm Vianet have hailed good progress in full year results which show the firm made turnover of £14.26m. \nThe Stockton-headquartered group also chalked up a 9.9% rise in adjusted operating profit to £3.32m following a year in which it has repositioned \nits smart technologies to providing data management services - the Internet of Things - for the leisure and vending markets. \nThe firm \nDirectors said they have repositioned “to describe our capabilities more accurately and recognise the wider opportunities”. \nThe firm currently operates two business divisions: Smart Zones, historically beer monitoring and machine management services, and Smart Machines - vending machine telemetry and contactless payment solutions. \nGroup turnover from continuing operations was £14.26m, slightly down on last year’s £14.29m, while group profit before taxation amounted to £1.45 million after exceptional items, down on last year’s £1.85m. \nMr Darling said: “As the IOT (Internet of Things) evolves and businesses seek more data and insight on everything from asset performance to process automation, we believe Vianet is well placed to grow its position in this rapidly developing area. \n“It is the gathering of information about customer asset performance which enables the creation of powerful data and insight and this, we believe, will drive sustained growth over the coming years.” \nJames Dickson, Chairman of Vianet Group plc, added: \nEncouraging progress has been made across our business, which has benefitted from the focus on exploiting growth opportunities in both the Smart Machines and Smart Zones Divisions. \nWith over 300 customers including several global blue chip companies and more than 250,000 devices connected to our Internet of Things platform, our experience and knowledge combine to form a powerful technology and insight capability. \nAs the Internet of Things evolves and businesses increasingly seek more data and insight on everything from asset performance to process automation, we believe Vianet is well placed to grow its position in this rapidly developing area. \nThe Group’s financial resources are underpinned by high levels of recurring income. This combined with our strong cash flow and balance sheet gives scope for investment in expansion and for selective acquisitions. \nThe Board remains confident that Vianet’s long term strategy is the right one, and that, within the parameters of its control and influence, the Group is well positioned to deliver earnings growth and expand future strategic options. James Dickson", "external_links": [], "published": "2017-06-06T15:00:00.000+03:00", "crawled": "2017-06-06T10:09:37.000+03:00", "highlightTitle": ""}