{"organizations": [], "uuid": "9bbb9e686feea58fa2ea6faa8e5ee57dc4717b34", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article13160735.ece/ALTERNATES/s1200/General-Election-2017-aftermath.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/business-leaders-nervous-after-election-13162791", "country": "GB", "domain_rank": 21960, "title": "Business leaders nervous after election result causes concerns on the economy", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-09T19:39:00.000+03:00", "replies_count": 0, "uuid": "9bbb9e686feea58fa2ea6faa8e5ee57dc4717b34"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/business-leaders-nervous-after-election-13162791", "ord_in_thread": 0, "title": "Business leaders nervous after election result causes concerns on the economy", "locations": [], "entities": {"persons": [{"name": "andrew hodgson", "sentiment": "none"}, {"name": "ross smith", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "mike cherry", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "federation of small businesses", "sentiment": "none"}, {"name": "government", "sentiment": "none"}, {"name": "north east england chamber of commerce", "sentiment": "none"}, {"name": "eef", "sentiment": "none"}, {"name": "cbi", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "north east chamber of commerce", "sentiment": "none"}, {"name": "north east lep", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Business leaders nervous after election result causes concerns on the economy Business groups in the North East have called on politicians to act quickly to provide certainty for companies Share Prime Minister Theresa May (Photo: PA) Share Get business   \nBusiness leaders in the North East and further afield have spoken of their nervousness after the unexpected election result left the UK in chaos 10 days before the start of the Brexit negotiations. \nPrime Minister Theresa May’s failure to win a parliamentary majority has sparked jitters in the UK business community, with the pound tumbling and the prospect of political stasis exactly what most companies were hoping to avoid as the country begins crucial talks with Europe. Read More Theresa May vows to stay on despite humbling hung parliament result \nRoss Smith, director of policy, North East England Chamber of Commerce , was among business figures calling on the new Government not to neglect issues important to the region’s economy in the process of forming a working administration. \nHe said: “Businesses need certainty and stability. This election has produced neither of these. It is now of the utmost importance that the big decisions crucial to our economic success are not ducked or disregarded in political horse trading \n“Businesses have barely been considered in the election campaign and issues such as job creation and economic growth are of the utmost importance to people across our region. Any incoming Government needs to put this squarely in the centre of its agenda.” Ross Smith, the North East Chamber of Commerce director of policy \nThe uncertainty created by the election result was also highlighted by Andrew Hodgson, chair of the North East LEP. \nHe said: “How Britain negotiates its exit from the EU will have a huge impact across the United Kingdom and especially here in the North East. \n“We will continue to work with all parties to achieve the best outcome for the region as the Government strives to secure the best deal for the UK. \n“We remain committed to delivering the North East’s Strategic Economic Plan, which has already created an extra 58,200 jobs in the local economy, and which will inform our response to future Government policy. \n“At this time of change and uncertainty we reaffirm our commitment to working in close partnership with the business community to ensure the North East’s strategic priorities remain high on the national agenda.” Andrew Hodgson, chair of the North East LEP \nEmployers’ organisation CBI said the result was a “serious moment for the UK economy”, while manufacturers’ group EEF said the country’s industrial strategy “must not be a casualty of the political turmoil”. \nMike Cherry, chairman of the Federation of Small Businesses, said: “In the coming hours and days, business needs immediate reassurance from the Government that emerges about how it will protect the economy from any political turmoil. The UK must be seen to remain open for business, with a Government committed to supporting enterprise. \n“It is important to go into the Brexit talks from a position of strength, focused on getting the best deal possible for trade and access to workers and skills. \n“Negotiations should be led by a Government and a Prime Minister that will be in place for the duration, and so we call for a delay to the scheduled start of negotiations rather than a rush to begin in 11 days’ time. The need for a transition period now becomes even stronger, providing the time to get Brexit right.” Like us on Facebook", "external_links": [], "published": "2017-06-09T19:39:00.000+03:00", "crawled": "2017-06-09T15:12:57.000+03:00", "highlightTitle": ""}