{"organizations": [], "uuid": "0b86b6858b7f4eb525f7b66440c8b631d905e8dc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article13120353.ece/ALTERNATES/s1200/Theresa-May-Campaigns-In-The-South-West.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/theresa-set-return-north-east-13120264", "country": "GB", "domain_rank": 21960, "title": "Theresa May set to return to the North East to promise a brighter future after Brexit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-01T05:30:00.000+03:00", "replies_count": 0, "uuid": "0b86b6858b7f4eb525f7b66440c8b631d905e8dc"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/theresa-set-return-north-east-13120264", "ord_in_thread": 0, "title": "Theresa May set to return to the North East to promise a brighter future after Brexit", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "brexit conservat", "sentiment": "negative"}, {"name": "brexit", "sentiment": "none"}, {"name": "yougov", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "linskill centre", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Theresa May set to return to the North East to promise a brighter future after Brexit Conservative leader Theresa May will urge Britain to 'have faith' in her when she visits the North East on Thursday Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nTheresa May is to call on Britain to unite behind her leadership and use Brexit to build a “brighter future” as she makes another general election visit to the North East. \nThe Conservative leader will paint a positive picture of life in the UK once we quit the European Union, under her leadership. \nShe is due to make a visit to the North East on Thursday - the second visit in three weeks. \nIt follows a difficult period for Mrs May, after her u-turn over social care funding and opinion polls showing Labour is catching up with the Conservatives. British Prime Minister Theresa May (Photo: Getty Images Europe) \nAn analysis by YouGov suggested that recent polls showed the UK could have a hung Parliament after polling day on June 8. \nAnd the study found Conservatives were unlikely to make the type of gains in the North East they had been hoping for. \nBut Mrs May’s decision to return to the region, after a visit in mid-May, suggests she still sees it as fertile ground. \nThe Prime Minister is expected to say: “We are now 12 months on from the EU referendum. 12 months since the British people voted for a brighter future for our country. 12 months since they voted to leave the European Union and embrace the world. \n“And in one week’s time, they have the opportunity to affirm that decision and secure that brighter future by voting for me to continue as Prime Minister. Read More \n“If they do, I am confident that we can fulfil the promise of Brexit together and build a Britain that is stronger, fairer and even more prosperous than it is today.” Theresa May giving a speech at the Linkskill centre in North Shields \nBut she will say that the result of last year’s Brexit referendum was a call for a fairer country, as well as to leave the EU. \n“If we get Brexit right, then together we can do great things. We can build a Britain beyond Brexit that is stronger, fairer and more prosperous than it is today. \n“ A Britain beyond Brexit that is more global and outward-looking. A Britain alive with possibilities, more confident in itself, more united and more secure. A country our children and grandchildren are proud to call home.” \nBrexit will allow the Uk to control its borders and stop sending money to Brussels, Mrs May will say. \nShe will add: “People can have faith in me because I have faith in them. I believe in the British people. I believe that with determination, ingenuity and common sense, we can use this moment of great national change to shape a better future for Britain.” \nMrs May came to North Shields earlier this month to deliver a speech at the Linskill Centre. She visited the area to launch an ambitious bid for a breakthrough in Labour’s traditional heartland with a speech aimed at convincing the region’s voters that Labour has deserted ‘proud and patriotic working class people’. Like us on Facebook ", "external_links": [], "published": "2017-06-01T05:30:00.000+03:00", "crawled": "2017-06-01T00:38:00.000+03:00", "highlightTitle": ""}