{"organizations": [], "uuid": "c8e7b60b170d628a85730d8365dd3a8de67d0ab3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13160127.ece/ALTERNATES/s1200/SGP_NEC_080617ELECTION11JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/bishop-auckland-remains-hands-labour-13159730", "country": "GB", "domain_rank": 21960, "title": "Bishop Auckland remains in hands of Labour - by just 502 votes", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-09T11:09:00.000+03:00", "replies_count": 0, "uuid": "c8e7b60b170d628a85730d8365dd3a8de67d0ab3"}, "author": "Laura Hill", "url": "http://www.chroniclelive.co.uk/news/north-east-news/bishop-auckland-remains-hands-labour-13159730", "ord_in_thread": 0, "title": "Bishop Auckland remains in hands of Labour - by just 502 votes", "locations": [], "entities": {"persons": [{"name": "pat glass", "sentiment": "none"}, {"name": "kevan jones", "sentiment": "none"}, {"name": "louisa", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "phil wilson", "sentiment": "none"}, {"name": "christopher adams", "sentiment": "none"}, {"name": "laetitia glossop", "sentiment": "none"}, {"name": "tony blair", "sentiment": "none"}, {"name": "alexander lawrie", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "goodman", "sentiment": "none"}, {"name": "helen goodman", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "boris johnson", "sentiment": "none"}, {"name": "laura pidcock", "sentiment": "none"}, {"name": "roberta blackman-woods", "sentiment": "none"}], "locations": [{"name": "county durham", "sentiment": "none"}, {"name": "bishop auckland", "sentiment": "none"}, {"name": "easington", "sentiment": "none"}, {"name": "sedgefield", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "durham city", "sentiment": "none"}, {"name": "north west durham", "sentiment": "none"}, {"name": "north durham", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "negative"}, {"name": "conservative", "sentiment": "none"}, {"name": "anti-corbyn labour", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nLabour has clung on to one County Durham seat by the skin of their teeth - holding onto Bishop Auckland by 502 votes. \nLabour candidate Helen Goodman has been MP in the seat for 12 years, but Conservative candidate Christopher Adams needed a swing of just 4.5% to take the seat. \nThe Tories campaigned hard in the rural seat, sending Boris Johnson to support candidate Christopher Adams this week before people headed to the polls. \nBut Ms Goodman said the Foreign Secretary’s visit had “put a booster rocket” up the Labour vote in the area. \nElsewhere, Labour look to be holding tight in the county - one of their crucial heartlands. \nIn North West Durham, Labour candidate Laura Pidcock says she is “remaining quite grounded” ahead of positive signs she will successfully replace Pat Glass. \nThe 29-year-old is looking to maintain the 10,056 majority of her predecessor after a difficult start to campaigning on the doorstep. \nShe said: “It was quite negative at the beginning and the polls reflected some of the mood on the doorstep but there was a real change that came upon the publication of the manifesto. \n“I am a realist. I don’t say we’ve won until we’ve won and I’m remaining quite grounded. I’ve been around to look at the boxes and there has been many, many people that have placed their cross in the box which says my name and have voted for the Labour Party which is fantastic.” \nGeneral Election 2017 North East results in full: How North East constituencies voted \nKevan Jones, the Labour candidate for North Durham, held onto his seat with 25,197 votes to Conservative candidate Laetitia Glossop’s 12,978. \nAfter winning a 12,219 majority, he said that Theresa May’s gamble had failed - and selling the election with Brexit as the focus hadn’t worked. He added it “wasn’t an issue” on the doorstep, and that people he had spoken to were “sick of seven years of austerity cuts”. \nIn Durham City, a win for Labour’s Roberta Blackman-Woods looks certain, though her 11,439 majority may be dented somewhat by the Tories. \nConservative candidate Alexander Lawrie said lifetime Labour voters have turned their backs on the party as they feel unable to support Jeremy Corbyn. Kevan Jones at the Louisa centre the Easington (Photo: Newcastle Chronicle) \n“We’re starting to see a break in the old family tribal loyalty in the North East,” he said. \nMeanwhile, anti-Corbyn Labour candidate Phil Wilson has seen his votes pile up higher than most expected in Tony Blair’s former constituency of Sedgefield. \nHe said: “It has been an unusual campaign. I’ve never seen anything like it. \n“The Conservatives put a lot more effort into the seat than in previous years. They obviously thought they had a chance, they were after the symbolic nature of the seat. They’ve over-stretched themselves.” Video Loading Click to play Tap to play The video will start in 8 Cancel Play now ", "external_links": [], "published": "2017-06-09T11:09:00.000+03:00", "crawled": "2017-06-09T06:42:31.000+03:00", "highlightTitle": ""}