{"organizations": [], "uuid": "d6aa19acb763ec9f267591e764607e28a65babb9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13242809.ece/ALTERNATES/s1200/BELGIUM_Summit_075211.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/eu-nationals-living-uk-told-13242663", "country": "GB", "domain_rank": 21960, "title": "EU nationals living in the UK told they can stay if they've been here for five years", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-27T02:38:00.000+03:00", "replies_count": 0, "uuid": "d6aa19acb763ec9f267591e764607e28a65babb9"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/eu-nationals-living-uk-told-13242663", "ord_in_thread": 0, "title": "EU nationals living in the UK told they can stay if they've been here for five years", "locations": [], "entities": {"persons": [{"name": "donald tusk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "house of commons", "sentiment": "none"}, {"name": "european court of justice", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "anti-brexit", "sentiment": "none"}, {"name": "government", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}, {"name": "european council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "EU nationals living in the UK told they can stay if they've been here for five years Citizens of European Union countries in the UK will have similar rights to British citizens Share Click to play Tap to play The video will start in 8 Cancel Play now   \nEU citizens who have lived in the UK for five years will be welcome to stay forever after Brexit, Prime Minister Theresa May has announced. \nThe plan is designed to provide reassurance to the 3.2 million people from other EU countries currently in the UK, including 50,000 in the North East. \nThose that stay will be given “settled status”, so that they have the permanent right to live in the UK, and the same access to public services such as the NHS as they have now. Prime Minister Theresa May walks between EU flags (Photo: AP) \nSpeaking in the House of Commons, Mrs May said: “No families will be split up. Family dependants who join a qualifying EU citizen here before the UK’s exit will be able to apply for settled status after five years. \n“After the UK has left the European Union, EU citizens with settled status will be able to bring family members from overseas on the same terms as British nationals.” \nExactly how long EU nationals need to have lived in the UK to qualify for the new status is still unclear. Read More 'It's not too late': Anti-Brexit protestors gather in Newcastle on anniversary of EU referendum \nThe Government will set a “cut off date”, which will be some point between March 29 2017 - the day that the UK triggered Article 50, beginning the process of leaving - and the day we actually leave, which will probably be in 2019. \nA precise date will be agreed in negotiations with the EU. \nThere will then be a further two year grace period. \nEU nationals who have been living in the UK for five years before the grace period ends will automatically qualify for settled status. \nA similar plan received a frosty reception from other EU leaders when the Prime Minister outlined the UK offer last week in Brussels, with European Council President Donald Tusk saying it was “below our expectations”. \nBut the Government is sticking to its guns by ruling out an EU demand that the European Court of Justice should police the deal. Prime Minister Theresa May (Photo: PA) \nInstead, Mrs May told MPs that British courts would enforce the rights of EU nationals in the UK just as they would for everyone else. Read More Brexit one year on - the 12 key dates in a momentous year in British politics \nThe Government paper published in Parliament on Monday said the Government intends to maintain existing rights to benefits, healthcare, education and other economic rights “in the expectation that these rights will be reciprocated by EU member states” for British nationals living in the EU. \nEU nationals who have been in the UK for less than five years will be able to carry on living in the country and then apply for settled status once they have clocked up five years continuous residence. \nIrish nationals will not have to apply for settled status. Like us on Facebook", "external_links": [], "published": "2017-06-27T02:38:00.000+03:00", "crawled": "2017-06-26T22:08:58.000+03:00", "highlightTitle": ""}