{"organizations": [], "uuid": "a8385915e62294917cb6c9823f3c76677c741c04", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13132366.ece/ALTERNATES/s1200/Prime-Minister-Margaret-Thatcher-wilderness-walk-on-Teesside-12th-September-1987.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/twenty-years-after-margaret-thatchers-13132293", "country": "GB", "domain_rank": 21960, "title": "Twenty years after Margaret Thatcher's 'walk in the wilderness', could more of the North turn blue?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-04T04:00:00.000+03:00", "replies_count": 0, "uuid": "a8385915e62294917cb6c9823f3c76677c741c04"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/twenty-years-after-margaret-thatchers-13132293", "ord_in_thread": 0, "title": "Twenty years after Margaret Thatcher's 'walk in the wilderness', could more of the North turn blue?", "locations": [], "entities": {"persons": [{"name": "margaret thatcher", "sentiment": "neutral"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "wrightson", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "guy opperman", "sentiment": "none"}, {"name": "thatcher", "sentiment": "none"}, {"name": "yougov", "sentiment": "none"}], "locations": [{"name": "county durham", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "north", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "darlington", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "teesside", "sentiment": "none"}, {"name": "hexham", "sentiment": "none"}, {"name": "thornaby", "sentiment": "none"}], "organizations": [{"name": "sunderland city council", "sentiment": "none"}, {"name": "teesside archive", "sentiment": "none"}, {"name": "snp", "sentiment": "none"}, {"name": "northern powerhouse", "sentiment": "none"}, {"name": "durham university", "sentiment": "none"}, {"name": "labour to conservative", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "hartlepool", "sentiment": "none"}, {"name": "bishop auckland", "sentiment": "none"}, {"name": "middlesbrough south & east cleveland", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Twenty years after Margaret Thatcher's 'walk in the wilderness', could more of the North turn blue? The Conservatives have always struggled to convince voters they care about the North - but could that change at the 2017 General Election? Share Margaret Thatcher's 'walk in the wilderness' (Photo: Teesside Archive) Share Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nIt was 20 years ago that Margaret Thatcher made an historic visit to Teesside. \nThe former Prime Minister made her way through wasteland on what was the site of the former Head Wrightson engineering works in Thornaby. \nAnd photographs of her ‘walk in the wilderness’, clutching her handbag, seemed to symbolise the fate of the North under Tory rule. \nFor critics, they illustrated how the heavy industries we depended on for jobs had been allowed to decline under the Conservatives . \nBut for the Iron Lady’s supporters, they highlighted the fact that the economy had to change. \nLady Thatcher returned to the site 10 years later, when she was no longer Prime Minister, to see what progress had been made. \nAnd the site was indeed transformed, with the wasteland replaced by a major business park and a new Durham University campus . \nThat was in 1997, the year the Conservatives lost power to a Labour Government which dominated politics across Teesside and the North as whole. \nIt symbolises the dilemma the Conservatives have always faced. British Prime Minister Theresa May (Photo: Getty Images Europe) \nThe recent Tory plan to help the North’s economy, called the Northern Powerhouse, isn’t entirely new. They’ve always said they back the region. \nBut this hasn’t translated into many seats when General Elections take place, despite the odd Conservative MP in places like Northumberland. \nThe question in this General Election is whether the Conservatives will finally make a breakthrough. \nWebsite Britain Elects, which analyses opinion poll data, suggests that it might. Read More Jeremy Corbyn in Gateshead on Monday - here's where and how you can attend \nDespite a faltering General Election campaign, which saw Conservative leader Theresa May come under fire over plans to make more elderly people pay for social care, Tories could gain seats in the North. \nBritain Elects calculates that the constituency of Bishop Auckland, in County Durham, could switch from Labour to Conservative in Thursday’s poll. \nMiddlesbrough South & East Cleveland is also likely to switch from Labour to Conservative. \nDarlington is another Labour-held seat which the Conservatives will gain, the experts say. \nBritain Elects also put the odds of the Conservatives winning Labour-held Hartlepool at 50%. \nSome recent opinion polls have suggested Labour, led by Jeremy Corbyn , is catching up with the Conservatives. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nA poll by YouGov last week sent shockwaves through the Conservative campaign, predicting Conservatives were in line to lose 20 seats, giving them 310, while Labour as set to gain 30, giving them 257 MPs and leaving Theresa May 16 seats short of an overall majority. \nIt could even mean Labour leader Jeremy Corbyn becoming Prime Minister, although he would depend on the support of MPs from other parties, such as the SNP, to govern. Read More The key issues you need to know about as Sunderland City Council's accounts are revealed \nHowever, some Labour politicians have said they don’t believe the findings, and fear that the media reports about the poll might actually encourage people to vote Conservative. \nAnd Conservative Guy Opperman , a candidate in Hexham, said that for many voters, the question was who would make the best Prime Minister out of Theresa May or Jeremy Corbyn. \n“We are still seeing significant numbers of traditional Labour voters who will not support Jeremy Corbyn, and either are staying at home or are coming over to the Conservatives. \n“Secondly, there are small but significant numbers of Labour voters who are backing Theresa May because they believe she is best placed to deliver the right deal for Britain in the Brexit negotiations which are about to begin.” Read More", "external_links": [], "published": "2017-06-04T04:00:00.000+03:00", "crawled": "2017-06-03T23:29:02.007+03:00", "highlightTitle": ""}