{"organizations": [], "uuid": "44c2e63edb6c8f42919a4fc86c3f4a16209fc80e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article13121710.ece/ALTERNATES/s1200/General-Election-2017.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/bbc-general-election-2017-leaders-13121558", "country": "GB", "domain_rank": 21960, "title": "BBC General Election 2017 leaders' debate: Chronicle readers rate the performances", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-01T17:30:00.000+03:00", "replies_count": 0, "uuid": "44c2e63edb6c8f42919a4fc86c3f4a16209fc80e"}, "author": "Simon Meechan", "url": "http://www.chroniclelive.co.uk/news/north-east-news/bbc-general-election-2017-leaders-13121558", "ord_in_thread": 0, "title": "BBC General Election 2017 leaders' debate: Chronicle readers rate the performances", "locations": [], "entities": {"persons": [{"name": "conserv", "sentiment": "neutral"}, {"name": "caroline lucas", "sentiment": "none"}, {"name": "amber rudd", "sentiment": "none"}, {"name": "rudd", "sentiment": "none"}, {"name": "paul nuttall", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "lucas", "sentiment": "none"}, {"name": "plaid cymru", "sentiment": "none"}, {"name": "mishal husain", "sentiment": "none"}, {"name": "daniel blake", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "leanne wood", "sentiment": "none"}, {"name": "tim farron", "sentiment": "none"}, {"name": "angus robertson", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "ken loach", "sentiment": "none"}, {"name": "tim", "sentiment": "none"}, {"name": "caroline lucus", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}], "locations": [{"name": "saudi arabia", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "cambridge", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "bbc", "sentiment": "negative"}, {"name": "tories", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "west end foodbank", "sentiment": "none"}, {"name": "greens", "sentiment": "none"}, {"name": "police federation", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "snp", "sentiment": "none"}, {"name": "islam", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "green", "sentiment": "none"}, {"name": "green party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nThe BBC held its General Election debate but there was one notable absentee. \nConservative leader and Prime Minister, Theresa May - who called the election - was a no-show, with Home Secretary Amber Rudd standing in. \nIt was thought Labour leader Jeremy Corbyn would not take part either, but he made a late announcement confirming he would join the debate in Cambridge. \nMs Rudd and Mr Corbyn were joined by SNP Westminster leader Angus Robertson, Lib Dem leader Tim Farron, Plaid Cymru’s Leanne Wood, Green co-leader Caroline Lucas and UKIP head Paul Nuttall. \nThere was plenty of arguing and finger pointing. But six of the seven candidates were united in one issue: mocking Theresa May for not turning up to debate an election which she called. \nWe asked readers who they thought performed best - and Jeremy Corbyn came out on top with an average score of 8 out of 10. Caroline Lucus of the Greens scored 6 out of 10 while Amber Rudd scored 4.1. \nYou can still cast your scores in the widget below. \nThe Mirror’s politics team has picked out nine highlights . 1. The lady who is not for turning up \nTheresa May called the election, has campaigned on “strong and stable leadership” but didn’t feel the need to go on TV and tell you why you should vote for her. \nGreen Party’s Caroline Lucas landed possibly the best zinger of the night when she attacked Mrs May’s no-show. \nShe said: “The first rule of leadership is to show up.” \nTim Farron said: “How dare you call a general election then run away from debate?” \nLeanne Wood said: “She won’t turn up to these debates because her campaign of soundbites is falling apart. \n“Unlike Theresa May I’m not afraid to defend my principles, my policies, my values.” 2. The Tories’ request to be judged on their record \nAfter seven years in Government, Amber Rudd felt it was fair for the Tories to justify not costing their manifesto by asking voters to “judge us on our record”. \nWhoops. \nThe audience responded with laughter, loud cries and small boos. 3. “Have you been to a food bank” \nIn Newcastle we have Britain’s biggest food bank. Football fans collect for the West End Foodbank and Ken Loach featured it in I, Daniel Blake. \nAs rival leaders criticised austerity and leaving fighting people below the poverty line Ms Rudd said spending on benefits had risen by £7bn and argued the Tories will “always provide that safety net”. \nBut Mr Corbyn immediately cut in - and mentioned the Tories’ refusal to extend Personal Independence Payments (PIP) to 165,000 people with “psychological distress”. \nThe audience cheered then loudly and applauded as Mr Corbyn said: “Have you been to a food bank? \n“Have you seen people sleeping around our streets? \n“Have you seen the levels of poverty that exist because of your government’s conscious decisions on benefits?” 4.Tim Farron asked you to switch over when Rudd was speaking and watch Bake Off instead \nLib Dem leader Tim Farron launched a VERY cheeky attack on Tory Amber Rudd - telling viewers to turn off their TV now. \n“Remember, she’s not the Prime Minister. The Prime Minister isn’t here tonight. She can’t be bothered. So why should you? \n“In fact, Bake Off is on BBC Two next. Why not go make a cuppa? You’re not worth Theresa May’s time. Don’t give her yours!” \n“Thank you Tim for that pass,” says Amber Rudd sarcastically. \nShe tells viewers: “You’ve seen the coalition of chaos in action. But in the quiet of the polling booth, you have a clear choice.” 5. Would Paul Nuttall pay for his own divorce? \nUKIP’s Paul Nuttall claimed he wouldn’t pay a Brexit settlement to the EU. \nPlaid Cymru’s Leanne Wood asked: “Would you be refusing to pay your dues if you were going through a real divorce?” Read More 6. Trump slammed for climate change walk-out \nAmber Rudd said she was “disappointed” that Trump has walked away from the Paris climate accord. \nThe Home Secretary said: “It is disappointing that the Americans are pulling out but I hope that we can use our relationship with President Trump and our close relationship with the US to try and influence, to try and make sure that they nevertheless take the right steps.” \nThe SNP ’s Angus Robertson says he was appalled. \nAnd Tim Farron said Britain could not just leave it to “hirsuite muesli-eating Guardian readers” to care about the climate. 7. Why are we selling arms to Saudi Arabia? \nCaroline Lucas criticised UKIP for implying the Manchester attack was “representative” of Islam, and pointed out the Police Federation’s warning that officer cuts would be dangerous. \nAnd she slammed the Tories were Britain’s role in selling weapons to Saudi Arabia. \nShe asked: “Why is Britain the biggest arms dealer in the world?” \nAmber Rudd said she’ll make no apology for keeping Britain safe and having a strong industry. \nBut Ms Lucas hit back: “Arms sales to Saudi Arabia cannot be justified on the grounds of this being good for industry!” 8. When Paul Nuttall said his NHS privatisation claims were ‘right’ \nHost Mishal Husain pointed out he said the NHS was a “monolithic hangover” and called for more privatisation only a few years back. \n“In areas of procurement I think I was right, I think the NHS could do better,” he said. \nBut he insisted UKIP was “going into this election with a clear commitment to keep the NHS in public hands.” Read More Theresa May set to return to the North East to promise a brighter future after Brexit 9. \"Coalition of choas\" \nTory Amber Rudd tried to claim there’d be a coalition of chaos if Labour collaborated with other parties. \nThis left the other leaders less than impressed. They pointed out UKIP have stood aside in 200 seats to give the Tories a clean run. \nCaroline Lucas, again, had the audience laughing. \nShe asked why Ms Rudd backed remain in the EU referendum, but is now tacked with UKIP. \nShe said: “Were you wrong then or are you wrong now? We can’t trust you.” Like us on Facebook", "external_links": [], "published": "2017-06-01T17:30:00.000+03:00", "crawled": "2017-06-01T14:39:06.002+03:00", "highlightTitle": ""}