{"organizations": [], "uuid": "635f437ca1e0fce3d2c70f37aaada084fd68a440", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13062792.ece/ALTERNATES/s1200/JS120106193.jpg", "site_section": "", "section_title": "", "url": "http://www.chroniclelive.co.uk/news/north-east-news/find-north-east-mp-constituency-13110501", "country": "IE", "domain_rank": 21960, "title": "Who is my North East MP and what is my constituency in the General Election? - Chronicle Live", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.178, "site_type": "news", "published": "2017-06-02T20:00:00.000+03:00", "replies_count": 0, "uuid": "635f437ca1e0fce3d2c70f37aaada084fd68a440"}, "author": "Rob Grant", "url": "http://www.chroniclelive.co.uk/news/north-east-news/find-north-east-mp-constituency-13110501", "ord_in_thread": 0, "title": "Who is my North East MP and what is my constituency in the General Election? - Chronicle Live", "locations": [], "entities": {"persons": [], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "england", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "office for national statistics", "sentiment": "none"}, {"name": "nhs clinical commissioning group", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "national insurance", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Who is my North East MP and what is my constituency in the General Election? Tap in your postcode and you'll get all the crucial information about your North East constituency and the MP candidates standing in the General Election 2017 Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nIs immigration the big electoral issue where you live ? Or the state of the local economy? Or the NHS? Brexit? \nFind out instantly with our unique constituency guide. \nSimply enter your postcode and you’ll get a range of crucial information – like who is standing, and who is likely to win. \nYou’ll also get a run-down of the major issues in your area using the latest official statistics. \nThe data have been divided into six main issue groups: the economy, the cost of living, immigration, pensions, health and the EU referendum. \nThe tool draws on a selection of relevant measures to estimate how much – or little – each issue might affect the election. Read More Who should I vote for in the 2017 general election? The runner and riders are all here \nThe figures have all been taken from a range of official sources including the Office for National Statistics, the Department for Work and Pensions, NHS England and the Land Registry. \nThe economy category includes the strength of the housing market, unemployment figures and business counts as well as how these figures have changed between 2012 and 2016. \nCost of living takes into account average wages, house price affordability and the number of people living in low-income families, and also looks at how these figures have changed since 2012. Read More How do I vote in the General Election 2017? Our guide to casting your ballot \nThe immigration section comprises statistics on the number of people living in each constituency who were born outside the UK and the number of foreigners seeking National Insurance numbers. \nThe figures for the pensions category include the percentage of people in each constituency aged 65 and above as well as the amount spent on pensions per head of the population. \nHealth data is organised by NHS Clinical Commissioning Group rather than by constituency but the idea is the same. The health category takes into account how satisfied people are with their GP, satisfaction with their practices’ opening hours the time taken for people being referred to hospital to be treated, and cancer waiting times. Read More ", "external_links": [], "published": "2017-06-02T20:00:00.000+03:00", "crawled": "2017-06-03T15:30:38.340+03:00", "highlightTitle": ""}