{"organizations": [], "uuid": "549b2e2011b7586a8a32ea8da2f6219aba3121d0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12241781.ece/ALTERNATES/s1200/Sports-Direct-agency-worker-conditions.jpg", "site_section": "http://www.thejournal.co.uk/business/?service=rss", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13150547", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast RECAP: Mike Ashley's Sports Direct increases stakes in US firms", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-08T15:00:00.000+03:00", "replies_count": 0, "uuid": "549b2e2011b7586a8a32ea8da2f6219aba3121d0"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13150547", "ord_in_thread": 0, "title": "Business Breakfast RECAP: Mike Ashley's Sports Direct increases stakes in US firms", "locations": [], "entities": {"persons": [{"name": "mike ashley", "sentiment": "negative"}, {"name": "mr close", "sentiment": "none"}, {"name": "coreena ford", "sentiment": "none"}, {"name": "james close", "sentiment": "none"}, {"name": "alison walton", "sentiment": "none"}, {"name": "monecor", "sentiment": "none"}, {"name": "alex neill", "sentiment": "none"}, {"name": "raby hunt", "sentiment": "none"}, {"name": "alison welty", "sentiment": "none"}, {"name": "willie walsh", "sentiment": "none"}, {"name": "wallace", "sentiment": "none"}, {"name": "christine ourmieres-widener", "sentiment": "none"}, {"name": "coreena ford flybe", "sentiment": "none"}, {"name": "crotty", "sentiment": "none"}, {"name": "jim ratcliffe", "sentiment": "none"}, {"name": "trevor mather", "sentiment": "none"}, {"name": "tom crotty", "sentiment": "none"}, {"name": "andy stenning", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "teesdale", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "darlington", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "romaldkirk", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "grainger street", "sentiment": "none"}, {"name": "maybrook house", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "bristol", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "international advanced manufacturing park", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "south tyneside", "sentiment": "none"}], "organizations": [{"name": "coreena ford newcastle united", "sentiment": "negative"}, {"name": "newcastle united", "sentiment": "negative"}, {"name": "create architecture of newton aycliffe", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}, {"name": "coreena ford auto trader", "sentiment": "none"}, {"name": "coreena ford cracking", "sentiment": "none"}, {"name": "united", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "iconix brand group inc", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "newcastle journal", "sentiment": "none"}, {"name": "maybrook house", "sentiment": "none"}, {"name": "auto trader group", "sentiment": "none"}, {"name": "monaco", "sentiment": "none"}, {"name": "brand finance", "sentiment": "none"}, {"name": "debenhams", "sentiment": "none"}, {"name": "roma", "sentiment": "none"}, {"name": "inter milan", "sentiment": "none"}, {"name": "aardman", "sentiment": "none"}, {"name": "premier league", "sentiment": "none"}, {"name": "coreena ford newcastle", "sentiment": "none"}, {"name": "ineos", "sentiment": "none"}, {"name": "british airways", "sentiment": "none"}, {"name": "ajax", "sentiment": "none"}, {"name": "finish line inc", "sentiment": "none"}, {"name": "bank holiday", "sentiment": "none"}, {"name": "iconix brand group", "sentiment": "none"}, {"name": "real madrid", "sentiment": "none"}, {"name": "barcelona", "sentiment": "none"}, {"name": "international airlines group", "sentiment": "none"}, {"name": "smmt", "sentiment": "none"}, {"name": "london stock exchange", "sentiment": "none"}, {"name": "michelin", "sentiment": "none"}, {"name": "wallace and gromit", "sentiment": "none"}, {"name": "raby hunt", "sentiment": "none"}, {"name": "nec", "sentiment": "none"}, {"name": "bristol children’s hospital charity", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "crosbys", "sentiment": "none"}, {"name": "general election", "sentiment": "none"}, {"name": "gromit", "sentiment": "none"}, {"name": "manchester united", "sentiment": "none"}, {"name": "london) ltd", "sentiment": "none"}, {"name": "society of motor manufacturers", "sentiment": "none"}, {"name": "ineos automotive", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}, {"name": "ba", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford Newcastle United rated the fastest growing brand in world football \nNewcastle United has been named the fastest growing brand in world football following the team’s promotion to the Premier League. \nThe annual study by industry experts Brand Finance gives the club a 92 per cent increase in its brand value in the last 12 months thanks to its performances on the pitch, but also the size of its fanbase, levels of supporter satisfaction, social media presence and overall brand management. \nThe study aims to assess football clubs’ ability to turn their brand value into financial results, with Manchester United rated the world’s most valueable brand ahead of Spanish giants Real Madrid and Barcelona. \nNewcastle United, which had dropped out of the global Top 50 after last year’s relegation from the Premier League, have returned in 22nd place, while local rivals Sunderland have dropped out of the list. \nThe study assesses the value of United’s brand as $247m (£191m), putting it ahead of a number of other Premier League clubs and European giants including Roma, Ajax, Monaco and Inter Milan. Newcastle United celebrate after winning the Sky Bet Championship (Photo: Getty Images Europe) 8.50 Coreena Ford Michelin-starred restaurant The Raby Hunt reopens after £400,000 makeover \nThe North East’s only two Michelin star restaurant has re-opened following a £400,000 investment project. \nThe Raby Hunt, near Darlington, County Durham, closed at the beginning of May for a major makeover. \nThe investment has led to the kitchen being extended and redeveloped, the building of a new restaurant entrance, and the installation of glass walls so diners can watch Michelin-starred chef-patron James Close and his team at work. Mr Close said: “This is the first time The Raby Hunt has been closed since taking it on seven years ago. \n“Having gained a second Michelin star last autumn, the time was right to invest and put The Raby Hunt on not just the UK’s good food map, but the world’s. \n“We want to make The Raby Hunt more unique than it already is, and ensure our guests experience an even greater ‘wow’ factor when they dine with us. This has been a major investment for us, but I am confident it has moved The Raby Hunt up another step.” \nMr Close has worked with Create Architecture of Newton Aycliffe; Newcastle-based restaurant, catering equipment, and kitchen suppliers Crosbys; and local building firms on the refurbishment. \nHe said: “It was important to me to use North East-based suppliers and builders. I wanted to ensure as much of the work as possible stayed in the region. Two Michelin star chef James Close of The Raby Hunt at Summerhouse, County Durham, in the new £200,000 kitchen (Photo: James Close) 8.45 Coreena Ford Cracking deal as County Durham firm is enlisted to make Gromit dog treats \nA County Durham dog treat company has been recruited by cartoon dog Gromit to make an exclusive range of charity snacks . \nThe canine half of Wallace and Gromit has commissioned Wellybix dog biscuits, a small company based in Romaldkirk in Teesdale, to produce a line of treats called Gromit Unleashed to raise money for a children’s hospital in Bristol. \nWellybix owner Alison Walton said: “I was approached after they had seen my regular products and accessories at a trade event at the NEC in Birmingham in March this year. They asked if I could bake Gromit some biscuits, and of course I jumped at the opportunity.” \nWallace and Gromit producers Aardman, which is based in Bristol, has a charity arm called The Grand Appeal which raises funds for the Bristol Children’s Hospital Charity with a range of Gromit-related products. \nThe Wellybix dog biscuits will be sold in Bristol and online, and feature Gromit on the packaging. Alison Welty of Wellybix with her Gromit treats (Photo: Copyright unknown) 8.37 Coreena Ford North East faces competition from Europe in bid to land new car manufacturer \nEfforts to bring a new car manufacturing plant to the North East have been dealt a blow after the company involved received a number of offers from Europe. \nIneos Automotive has started a search for a site where it would produce 4x4 off-road vehicles similar to the Land Rover Defender. \nThe factory is likely to create 1,000 jobs with many more likely to follow in the supply chain. \nIneos director Tom Crotty said earlier this year “it would be great to create the jobs in the North of the UK”, raising hopes the region could benefit from the expertise built up around Sunderland’s Nissan plant and the International Advanced Manufacturing Park being built in Sunderland and South Tyneside. \nThe company also favours a coastal location because it expects to export many of its vehicles. \nBut now Mr Crotty has revealed that Ineos has held discussions both in the UK and in Europe and maintained its final site would be chosen on business reasons alone. \nThat has raised the prospect the looming Brexit negotiations, which could result in tariffs being introduced on UK-produced vehicles, could see the plant sited on the continent rather than in Britain. Ineos chairman Jim Ratcliffe (Photo: PA) 8.30 Coreena Ford Newcastle office block to become major innovation centre \nA major Chinese company that invests around £570m a year into R&D is setting up an innovation centre in Newcastle to help forge links between Chinese and UK businesses. \nTusPark - which runs a number of science parks in China and also has sites in Hong Kong, the US, South Korea and Russia - is in the process of buying Maybrook House on Grainger Street in order to set up the company’s first innovation centre in the region. \nOnce the deal is completed, the firm is planning to occupy the first two floors of the site where it will focus on strengthening links between UK and Chinese companies. \nShould the innovation centre prove successful, TusPark is also considering acquiring a second site at Newcastle’s Science Central in order to boost its presence in the North East. \nThe facilities at Maybrook House will include meeting rooms, presentation areas, and teleconference equipment so meeting can be held with those in China. Maybrook House on Grainger Street (Photo: Newcastle Chronicle) 8.25 Coreena Ford BA passengers facing compensation delays after Bank Holiday chaos \nPassengers have told of continued delays in receiving compensation after a British Airways system outage caused travel chaos for tens of thousands. \nAlmost two weeks after more than 670 flights were cancelled due to a power failure over the spring bank holiday weekend, customers have told how they had struggled to get in contact with the airline and still had no idea when they would receive a payout. \nUnder EU law, passengers can claim compensation from BA for cancelled or delayed flights, worth up to 600 euro (£524). \nThey can also claim expenses for items such as hotels, meals and phone calls. \nAlex Neill, managing director of home products and services at consumer group Which?, said: “BA’s failure to make it easy for people to receive the compensation that they are owed shows that their response to this crisis continues to be absolutely woeful. \n“They are in grave danger of letting down their customers again by failing to go beyond the legal requirements in reaction to flight cancellations and delays. “BA should do the right thing and automatically issue statutory compensation to all eligible passengers.” \nA BA spokesman said: “We have put additional resources into our customer relations teams and thousands of payments have already been made to customers who have put in claims. \n“Our aim is to authorise payment for all completed EU compensation claims within 14 days of receipt. \n“We will fully honour our obligations and would encourage customers to submit their expense claims to us, and we will investigate on a case by case basis.” Willie Walsh, chief executive of BA owner International Airlines Group, has said that the actions of an engineer who disconnected and then reconnected a power supply to the airline’s data centre in “an uncontrolled and uncommanded fashion” may be central to an investigation into the incident. A British Airways plane (Photo: Newcastle Journal) 8.15 Coreena Ford Auto Trader races to £203m full-year profit \nClassified cars website Auto Trader saw profits switch up a gear last year, despite increased economic uncertainty and a dip in consumer confidence. \nThe firm said full-year operating profit revved up by 18% to £203.1m while, on a pre-tax basis profit, rose 23% to £193.4m. \nAuto Trader, which floated on the London Stock Exchange in 2015, said turnover was up from £281.6m to £311.4m. \nChief executive Trevor Mather said: \nWith consumers spending more than double the time researching their next car online than they do offline, we have strived to create greater transparency and therefore trust in our marketplace, benefiting consumers, retailers and manufacturers alike. \nThe new financial year has started well and, despite the wider political and economic uncertainty, the board is confident of delivering its growth expectations for the coming year. \nHe added that the industry now expects new car registrations to “plateau or decline”, but still anticipates growth in used car transaction volumes. \nData out this week showed that new car sales fell last month as the General Election put potential buyers off making a purchase. \nSome 186,265 new cars were registered in May, down 8.5% on the same month last year, according to the Society of Motor Manufacturers and Traders (SMMT). \nNevertheless, Auto Trader said it expects the strong new car market performance in recent years to “continue to have a positive impact on used car transactions”. Inside the Auto Trader Group offices 8.10 FTSE latest and pound value latest \nThe FTSE-100 index opened at 7478.62. \nThe pound at 8am was 1.2974 dollars compared to 1.2940 dollars at the previous close. The euro at 8am was 0.8681 pounds compared to 0.8683 pounds at the previous close. Screen displaying the FTSE 100 at the London Stock Exchange (Photo: Yui Mok/PA Wire) 8.05 Coreena Ford Flybe swings to loss aid slowing demand \nRegional airline Flybe said slowing consumer demand and over capacity sent it swinging to a loss last year. \nThe firm posted a £19.9m pre-tax loss in the year to March 31, compared to a profit of £2.7m last year. \nThis was despite revenue increasing 13.4% to £707.4m. \nFlybe said in a statement: “Despite the substantial progress in reducing the size of legacy fleet orders in 2015/16, Flybe has still seen significant capacity growth in a market where we witnessed slower growth in consumer demand. \n“New routes and increased frequencies were targeted to cover marginal costs in the early years of operation, but do not contribute significantly to overall profitability. \n“The capacity growth therefore had a negative effect on profitability.” \nThe firm was also stung by a £4.8m writedown linked to an IT upgrade and it anticipates further IT costs of around £6m relating to cancellation penalties on existing contracts. \nChief executive Christine Ourmieres-Widener said the airline had moved to drive down costs while reducing its flight capacity, adding that the new financial year has started well. \nShe added: “I am truly passionate about the airline industry and I see tremendous opportunities for Flybe to connect and engage with communities and to establish a reputation for excellence in serving our customers. \n“We will be successful in delivering by continually focusing on our costs, increasing our knowledge about who our customers are and what makes them tick, achieving industry-leading operational excellence and implementing a great digital platform.” A Flybe plane (Photo: Andrew Milligan/PA Wire) 8.00 KEY EVENT Mike Ashley's Sports Direct ups stakes in US investments \nMike Ashley is making further inroads with US investments after his high street retailer Sports Direct increased investments into two sporting specialists. \nThe company has upped stakes in Umbro-owned Iconix Brand Group and doubled its stake in Indiana-based footwear etailer Finish Line. \nThis marks the second time the business has boosted its stakes in the businesses, coming a few weeks after the last investment. \nThe firm made a stock market announcement saying that, consistent with its long standing strategy of taking strategic stakes, it now holds the following indirect economic interests through contracts for difference with Monecor (London) Ltd. \nThe firm has taken 7,561,908 shares in Iconix Brand Group Inc, representing 13.25% of the issued common stock of that company; and 7,568,143 shares in Finish Line Inc, representing 18.85% of the issued common stock of that company. \nThe firm said: “The main rationale for these stakes is to allow Sports Direct to hopefully build a relationship and develop commercial partnerships with the relevant parties. They also help the Company to build relationships with key suppliers and brands.” \nSports Direct has also increased its holding in Debenhams, taking its stake above 18%. \nHowever, the firm is so far remaining quiet about its plans with the retailer, having spent three years building its position throigh shares and options. It is understood the position is now worth around £107m. Newcastle United owner Mike Ashley (Photo: Andy Stenning) Share ", "external_links": [], "published": "2017-06-08T15:00:00.000+03:00", "crawled": "2017-06-08T19:21:26.000+03:00", "highlightTitle": ""}