{"organizations": [], "uuid": "45394891a9d0677cb86131a316fefdd4f1e6b17b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13167633.ece/ALTERNATES/s1200/WIP.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/week-can-very-long-time-13166624", "country": "GB", "domain_rank": 21960, "title": "A week can be a very long time in politics: How Theresa May's campaign went pear-shaped", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-11T15:00:00.000+03:00", "replies_count": 0, "uuid": "45394891a9d0677cb86131a316fefdd4f1e6b17b"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/week-can-very-long-time-13166624", "ord_in_thread": 0, "title": "A week can be a very long time in politics: How Theresa May's campaign went pear-shaped", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "weaver vale", "sentiment": "none"}, {"name": "tory george osborne", "sentiment": "none"}, {"name": "westminster", "sentiment": "none"}, {"name": "johnson", "sentiment": "none"}, {"name": "william hague", "sentiment": "none"}, {"name": "owen patterson", "sentiment": "none"}, {"name": "lyn brown", "sentiment": "none"}, {"name": "nicola sturgeon", "sentiment": "none"}, {"name": "philip", "sentiment": "none"}, {"name": "diane abbott", "sentiment": "none"}, {"name": "stockton south", "sentiment": "none"}, {"name": "abbott", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "barry gardiner", "sentiment": "none"}, {"name": "paterson", "sentiment": "none"}, {"name": "kezia dugdale", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "boris johnson", "sentiment": "none"}, {"name": "yougov", "sentiment": "none"}, {"name": "steve coogan", "sentiment": "none"}], "locations": [{"name": "wales", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "glasgow", "sentiment": "none"}, {"name": "darlington", "sentiment": "none"}, {"name": "auckland", "sentiment": "none"}, {"name": "downing street", "sentiment": "none"}, {"name": "clwyd west", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "lord hague", "sentiment": "none"}, {"name": "solihull", "sentiment": "none"}, {"name": "north west", "sentiment": "none"}, {"name": "brighton", "sentiment": "none"}, {"name": "shildon civic hall in county durham", "sentiment": "none"}, {"name": "norwich", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}, {"name": "maidenhead", "sentiment": "none"}, {"name": "barry", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "east cleveland", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "london bridge", "sentiment": "none"}, {"name": "norfolk", "sentiment": "none"}], "organizations": [{"name": "warrington", "sentiment": "none"}, {"name": "getty images", "sentiment": "none"}, {"name": "bbc", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}, {"name": "tory", "sentiment": "none"}, {"name": "tories", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "itv", "sentiment": "none"}, {"name": "scottish labour", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}, {"name": "sky news", "sentiment": "none"}, {"name": "hartlepool", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}, {"name": "international aviation academy", "sentiment": "none"}, {"name": "middlesbrough south", "sentiment": "none"}, {"name": "democratic unionist party", "sentiment": "none"}, {"name": "snp", "sentiment": "none"}, {"name": "liberal democrats", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "A week can be a long time in politics Share Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nPerhaps we should have known the Conservative campaign was in trouble. \nA number of opinion polls showed Labour was catching up with the Tories - although others claimed that Theresa May’s party was still firmly in the lead. \nAnd it was widely agreed that Mrs May had run a disastrous campaign. Her message was that we needed a “strong and stable” government, but it wasn’t clear why she’d decided to call an election if that was her priority. \nShe had a strong and stable government anyway. \nAnd beyond the slogan, she’d failed to offer any positive ideas for Britain. The only policies anyone could remember where making elderly people pay more for residential social care - the so-called dementia tax - and taking away free school meals. \nBut despite this, pretty much everyone assumed that Conservatives would win the election with an improved majority. \nThat includes Labour MPs as well as Conservatives. They told journalists that the message they were getting on the doorstep, as they met voters, suggested Labour was in trouble. \nAs the week progressed, very few people understood what was really happening. Monday Labour leader Jeremy Corbyn addresses a huge crowd at the Sage in Gateshead (Photo: newcastle chronicle) \nThe general election campaign was at full throttle again, following a brief pause prompted by the London Bridge terror attacks. \nLabour leader Jeremy Corbyn used a speech on Sunday evening to accuse Theresa May of denying police and security services the resources they need, and of burying evidence of Saudi support for violent extremists. \nConservatives hit back with a broadside on Mr Corbyn’s record of opposing counter-terror laws and the use of shoot-to-kill tactics by police facing armed attackers. \nIt meant the row over policing and security dominated the debate on Monday. \nOpinion polls continued to be all over the place. \nOne, by ICM for the Guardian, showed the Conservatives with an 11-point lead. \nBut YouGov once again predicted a hung Parliament. \nThe YouGov findings were welcomed by Jeremy Corbyn’s supporters, but privately prompted groans from some Labour candidates who felt that their best hope of picking up votes was to reassure voters that Mr Corbyn had no chance of becoming Prime Minister. \nStill, Mr Corbyn showed he could still attract the crowds when thousands turned up to welcome him in Gateshead, despite the rain. Tuesday Boris Johnson during a speech at Shildon Civic Hall in County Durham (Photo: Newcastle Chronicle) \nConservatives despatched Foreign Secretary Boris Johnson to County Durham to warn that Brexit was at risk if Labour leader Jeremy Corbyn becomes Prime Minister. \nMr Corbyn would be “eaten for breakfast” by EU leaders determined to reverse the result of last year’s referendum vote, the Foreign Secretary said. \nAnd he also claimed Mr Corbyn would do a deal with the Liberal Democrats and SNP - something Mr Corbyn had ruled out. \nBut Mr Johnson was questioned about cuts to North East police forces. He insisted the Tories will invest 30% more into counter terrorism and ‘a lot more’ into armed police. \nWhen it came to election rallies, nobody was going to outdo Mr Corbyn. \nHe addressed six simultaneous rallies across the UK in a dramatic plea to voters to kick out the Tory government. \nMr Corbyn was in Birmingham, at a star-studded Labour event featuring comedian Steve Coogan, chart-topping band Clean Bandit and Madchester stars The Farm. \nBut his message was broadcast live by satellite to five more rallies - in Barry, Wales; Brighton; Glasgow; London, and Warrington. Wednesday Prime Minister Theresa May during a visit to the International Aviation Academy in Norwich on May 8, 2017 in Norwich, Norfolk, England (Photo: Getty Images) \nJeremy Corbyn continued to attract large crowds as he zig-zagged across the country for an energetic final day of campaigning. \nHe began by speaking in Glasgow and travelled to Weaver Vale, in the North West, and Clwyd West, in Wales, before addressing three rallies in London. \nConservative leader Theresa May flew to Norfolk for a final push. \nAnd her last event was an evening appearance in Solihull, near Birmingham, where there are a number of marginal seats. \nThere was a reshuffle in Mr Corbyn’s team as Shadow Home Secretary Diane Abbott stood down, citing ill-health, to be replaced by former Shadow Policing Minister Lyn Brown. \nMs Abbott had been criticised for her performance in media interviews. Labour colleague, Barry Gardiner, said she had been diagnosed with a “serious, long-term condition”. \nAnd Labour faced an unhelpful intervention from SNP leader Nicola Sturgeon, who claimed Scottish Labour leader Kezia Dugdale had told her privately she felt Brexit could justify a second independence vote. \nIt added fuel to the Tory claim Mr Corbyn as PM would oversee a “coalition of chaos” by offering the SNP the chance of a second referendum in return for their support. Thursday Conservative Party leader Theresa May and husband Philip arrive at a polling station to vote on June 8, 2017 in Maidenhead, England (Photo: Getty Images Europe) \nVoters went to the polls in 650 constituencies across the United Kingdom. The national campaigns are traditionally fairly quiet on polling day, with no big speeches from the party leaders, partly because there are strict restrictions on what the TV stations can report while voting takes place. \nHowever, it was a frantic day for candidates and activists, as they knocked on doors in an attempt to encourage supporters to get out and vote. \nThe real excitement began when the exit poll was published by the BBC, ITV and Sky News at 10pm. \nBroadcasters announced the Conservatives were on course to be the largest party in the House of Commons - but would lose seats, and lose their majority. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nAs the results came, it became clear the poll was accurate. \nSenior Tory George Osborne, a former Chancellor, was scathing. Speaking on ITV’s election results programme, he said Mrs May was paying a price for shifting the party to the right, running a negative campaign and forgetting that the Conservatives need to be in the centre ground to win. Read More \nPredictions of a Tory breakthrough in the North didn’t come true. Conservatives gained Middlesbrough South and East Cleveland, but seats such as Darlington, Hartlepool and Bishop Auckland stayed red - and the Conservatives actually lost Stockton South. Friday Prime Minister Theresa May arrives back at Downing Street (Photo: Getty Images Europe) \nSpeaking in her Maidenhead constituency in the early hours of Friday morning, Theresa May delivered a cryptic speech promising “stability”. \nIt wasn’t immediately clear if that meant she would continue a Prime Minister or not, but speaking outside 10 Downing Street later, she confirmed that she would attempt to lead the country with help from ”our friends and allies in the Democratic Unionist Party”. \nWorking with the Northern Ireland party would give her - barely - a majority in the House of Commons, allowing her to get legislation and Budget measures through the House of Commons. \nBut the question is, how long will this arrangement last? Another election seems possible. But nobody knows what the future holds. Far from strong and stable, Westminster is heading for a period of chaos. \nLabour leader Jeremy Corbyn, meanwhile, suggested Labour could form a minority government. \nThat seems unlikely. Although the election is seen as a triumph for Mr Corbyn, the fact is that Labour won just 261 seats compared to the Conservative’s 318 seats. Saturday Foreign Secretary William Hague looks on, while Theresa May campaigns (Photo: PA) \nThe knives were out from all sides as we were left to come to terms with a country in political limbo. \nFormer Tory leader Lord Hague said “very serious lessons” had to be learned by the party but warned against a leadership contest. \nHe said: “An overwhelmingly strong position at the time of the local elections on May 4 was turned into serious losses by June 8. \n“The awful truth is that no party has given up such an advantageous situation with such speed in the modern electoral history of our country. \n“Very serious lessons will have to be learnt from that.” \nConservative former cabinet minister Owen Patterson warned his party against the “chaos” of a leadership contest as it could further delay resolving Brexit matters. \nMr Paterson said Theresa May was right “despite all the disappointments” to try to find a way to govern with the support of the Democratic Unionist Party given that the Tories won the most seats and most votes. \nBut the MP was less sure about how Mrs May could continue to rule in such a manner, saying “let’s see how it pans out” when asked. Like us on Facebook ", "external_links": [], "published": "2017-06-11T15:00:00.000+03:00", "crawled": "2017-06-11T12:46:49.000+03:00", "highlightTitle": ""}