{"organizations": [], "uuid": "870b06978a37726694f468cd9468ed9c754f5e68", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article11945492.ece/ALTERNATES/s1200/JS85665380.jpg", "site_section": "", "section_title": "", "url": "http://www.chroniclelive.co.uk/business/business-news/two-north-east-firms-make-13157685", "country": "GB", "domain_rank": 21960, "title": "Two North East firms make list of the UK's fastest growing exporters - Chronicle Live", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.959, "site_type": "news", "published": "2017-06-09T01:00:00.000+03:00", "replies_count": 0, "uuid": "870b06978a37726694f468cd9468ed9c754f5e68"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/two-north-east-firms-make-13157685", "ord_in_thread": 0, "title": "Two North East firms make list of the UK's fastest growing exporters - Chronicle Live", "locations": [], "entities": {"persons": [{"name": "monica vinader", "sentiment": "none"}, {"name": "greencroft", "sentiment": "none"}, {"name": "amanda murphy", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "greencroft", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "airbnb", "sentiment": "none"}, {"name": "spotify", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}, {"name": "new zealand", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "south africa", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "chile", "sentiment": "none"}, {"name": "dallas", "sentiment": "none"}, {"name": "philadelphia", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "frank recruitment", "sentiment": "negative"}, {"name": "frank recruitment group", "sentiment": "none"}, {"name": "dhl express", "sentiment": "none"}, {"name": "greencroft bottling", "sentiment": "none"}, {"name": "tpg", "sentiment": "none"}, {"name": "sunday times hsbc", "sentiment": "none"}, {"name": "sunday times hsbc international track", "sentiment": "none"}, {"name": "hsbc", "sentiment": "none"}, {"name": "north east exporters", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "stock exchange", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Two North East firms make list of the UK's fastest growing exporters Newcastle's Frank Recruitment and Durham-based Greencroft Bottling are on the International Track 200 Share Bottling facilities at Greencroft Bottling   \nTwo North East companies have continued their remarkable runs of success by making a nationwide list of firms growing their overseas sales. \nThe eighth annual Sunday Times HSBC International Track 200 league table ranks Britain’s mid-market private companies with the fastest-growing exports, with County Durham’s Greencroft Bottling and Newcastle-based Frank Recruitment both making the prestigious list. \nGreencroft features on the list for the second time after growing exports to £6.4m in 2016. \nThe largest wine bottler in Europe, Greencroft can fill up to 90,000 bottles and boxes of wine an hour. It has customers in Australia, New Zealand, California, Chile and South Africa and last year it invested £3m to increase its bottling capacity by 25%. \nAlso on the league table is Frank Recruitment Group, which makes its first appearance just over a year after it was bought by TPG Growth, an American investment group which has previously backed the likes of Spotify and Airbnb. \nThe IT recruiter operates in more than 70 countries and recently opened offices in Philadelphia and Dallas. International sales grew to £76.7m last year. Newcastle offices of Frank Recruitment Group \nAmanda Murphy, UK head of commercial banking at HSBC, commented: “This year’s Sunday Times HSBC International Track 200 is testament to the exciting opportunities available to ambitious UK businesses with appetite to grow their goods and services abroad. \n“We work very closely with our business customers to help them achieve their goals, so it makes me immensely proud to see so many of them succeed.” Read More Has your company made the North East Exporters' Awards final shortlist? \nGreencroft and Frank Recruitment appear on the export growth list alongside the likes of jewellery designer Monica Vinader, cycling gear manufacturer Rapha, and sandwich shop chain Pret. Previously the list has included drinks maker Fever-Tree to travel search engine Skyscanner, which have gone to become major players in the global economy. \nBoth companies have won a number of accolades in the last few months, with Frank Recruitment making a list of the country’s fastest growing firms in March, while both firms - along with Greencroft’s sister company Lanchester Wines - made the Stock Exchange’s 1,000 Companies to Inspire Britain report. \nThe league table reflects the importance of Europe to Britain’s mid-market exporters ahead of the Brexit negotiations. Almost 85% of the companies on the Top 200 sell to the continent, which was the most popular overseas market, followed by North America and Asia. \nThe list is sponsored by HSBC and DHL Express, and compiled by Fast Track, the Oxford-based research and networking events firm. Like us on Facebook", "external_links": [], "published": "2017-06-09T01:00:00.000+03:00", "crawled": "2017-06-08T20:01:17.003+03:00", "highlightTitle": ""}