{"organizations": [], "uuid": "8d82072ec09870c5307acffd48fa1c6f627f1d39", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article13230615.ece/ALTERNATES/s1200/CFR_NJL_230617jeffroberts_01.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/meeting-with-jeff-roberts-md-13230201", "country": "GB", "domain_rank": 21960, "title": "A meeting with: Jeff Roberts, MD of Roberts Environmental Limited\\n", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-26T12:00:00.000+03:00", "replies_count": 0, "uuid": "8d82072ec09870c5307acffd48fa1c6f627f1d39"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/meeting-with-jeff-roberts-md-13230201", "ord_in_thread": 0, "title": "A meeting with: Jeff Roberts, MD of Roberts Environmental Limited\\n", "locations": [], "entities": {"persons": [{"name": "jeff roberts", "sentiment": "negative"}, {"name": "brexit", "sentiment": "none"}, {"name": "roberts", "sentiment": "none"}], "locations": [{"name": "cuba", "sentiment": "none"}, {"name": "argentina", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "south africa", "sentiment": "none"}, {"name": "malaysia", "sentiment": "none"}, {"name": "chile", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "dubai", "sentiment": "none"}], "organizations": [{"name": "roberts environmental limited", "sentiment": "negative"}, {"name": "roberts environmental limited\\", "sentiment": "neutral"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jeff Roberts, MD of Roberts Environmental Limited (Photo: Roberts Environmental Limited) Share Get business updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nName: Jeff Roberts \nJob title: Managing Director What is the best thing about your job? \nApart from working with a team that genuinely get on with each other it is the variety of people I meet through work. One minute I can be on a site working with drilling contractors, broom in hand sweeping up the site, the next it can be talking to the regulators to make sure the work we are doing meets their requirements and finally the multimillionaire client or Investment Fund Manager asking how the work is going – all in one day. You have to be able to talk to all parties involved in the project cycle and make sure you get your point across succinctly and in terms that they all understand. What is your proudest achievement? \nI don’t feel it is right to be proud of something you have done. It is up to others to feel proud of you as a person. I do feel happy though that I managed to keep the business going through the downturn of 2016 caused by Brexit and the growing of the business through 2017. We are relatively young as a company and something like that could have easily closed us. But as a team we pulled together and diversified our service lines. We are much stronger for it now. What advice would you give to someone starting in your career? \nBe proactive in all you do, don’t wait for someone else to do it for you. If you really want something go after it. Not everyone is academically inclined but on the job training can be more important. We recently had a graduate join us and she spotted one of our vans, rang up the office and pushed her CV through. She came for work experience and we ended up offering her a full-time job. That attitude impresses me. Which individual has inspired you most and why? \nI would have to say my parents; my Dad owned ’Roberts The Chemist’, who had branches throughout the North East. He taught me a strong work ethic and to always go that extra mile to assist, people never forget kindness. My Mum, a former teacher, has provided me with a rounded view on life – Work Hard, Play Hard. She could never do enough for us as a family and also for our friends, our home was an open house to the waifs and strays. What’s the best piece of advice you’ve been given? \nAlways be nice to people on the way up as you never know when you will meet them on the way down. This has served me well and helped me when setting up the business. I was made redundant from my last job prior to setting up Roberts Environmental and it could be easy to be bitter but in fact they have ended up being a client of mine. What was the biggest challenge you’ve faced in your career so far? \nBeing made redundant in 2012 from the property industry was hard to swallow. However, as they say, it was the best thing to happen to me. I didn’t think twice about setting up on my own, helped by advice from my wife and a number of friends who had their own businesses. People genuinely want to see you succeed and I was overwhelmed by the number of people who offered advice and assistance when I started out. How is your business going to change in the next 10 years? \nHopefully expanding the business and opening further offices. Government policy seems to be moving towards the requirement for more new homes and brownfield development is the way forward in terms of sustainability. Assisting the development of redundant, old industrial land is the core of our business. What do you like to do out of work? \nFamily is a big part of my life. But sport has always been a passion. Being a former rugby player injuries have now taken their toll so I swim, snowboard and go to the gym to get my fix and ‘me’ time. I have also travelled extensively mostly playing sport; Argentina, Chile, South Africa, Australia, Hong Kong, Dubai, Singapore, Malaysia and Cuba to name a few. What do you always carry with you? \nMy manners. They cost nothing and something I try to instil them in my children like my parents did to me. What would you do if you had to change career? \nI think the days of a professional sportsman have now passed me by. My wife is in the process of setting up her own business so I would hope she would offer me a job! Like us on Facebook", "external_links": [], "published": "2017-06-26T12:00:00.000+03:00", "crawled": "2017-06-26T08:25:27.012+03:00", "highlightTitle": ""}