{"organizations": [], "uuid": "7512749f4c73544621ae37a58721d7aadb3fd9db", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article11816587.ece/ALTERNATES/s1200/JS69403219.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13204364", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Serious Fraud Office charges Barclays over Qatar deal", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-20T15:05:00.000+03:00", "replies_count": 0, "uuid": "7512749f4c73544621ae37a58721d7aadb3fd9db"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13204364", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Serious Fraud Office charges Barclays over Qatar deal", "locations": [], "entities": {"persons": [{"name": "jenkins", "sentiment": "none"}, {"name": "brown", "sentiment": "none"}, {"name": "angela spindler", "sentiment": "none"}, {"name": "varley", "sentiment": "none"}, {"name": "john varley", "sentiment": "none"}, {"name": "n brown", "sentiment": "none"}, {"name": "thomas kalaris", "sentiment": "none"}, {"name": "stockton", "sentiment": "none"}, {"name": "roger jenkins", "sentiment": "none"}, {"name": "richard boath", "sentiment": "none"}], "locations": [{"name": "qatar", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}, {"name": "teesside shopping park", "sentiment": "none"}, {"name": "metrocentre", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "north africa", "sentiment": "none"}, {"name": "jacamo", "sentiment": "none"}, {"name": "thornaby", "sentiment": "none"}], "organizations": [{"name": "barclays", "sentiment": "negative"}, {"name": "serious fraud office", "sentiment": "negative"}, {"name": "financial conduct authority", "sentiment": "none"}, {"name": "investment banking and investment management", "sentiment": "none"}, {"name": "barclays capital", "sentiment": "none"}, {"name": "barclays bank plc", "sentiment": "none"}, {"name": "fca", "sentiment": "none"}, {"name": "lloyds banking group", "sentiment": "none"}, {"name": "london stock exchange", "sentiment": "none"}, {"name": "qatar holding and challenger universal", "sentiment": "none"}, {"name": "sfo", "sentiment": "none"}, {"name": "royal bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford Pound falls following Bank of England Governor's announcement \nThe pound sank on the news, falling 0.4% against the dollar and euro to 1.26 and 1.13 respectively. \nOn Brexit, the governor said the country will soon “begin to find out the extent to which Brexit is a gentle stroll along a smooth path to a land of cake and consumption”. \nMr Carney also waded into the row over euro-clearing after the EU released proposals which could force operators to leave London as a result of Brexit, putting the capital’s multi-billion industry at risk. \n“The UK houses some of the world’s largest CCPs (central counterparty clearing houses). \n“Fragmentation of such global markets by jurisdiction or currency would reduce the benefits of central clearing,” he said. \n“Any development which prevented EU27 firms from continuing to clear trades in the UK would split liquidity between a less liquid onshore market for EU firms and a more liquid offshore market for everyone else.” \nHe also added his voice to concerns that wrenching clearing from London would result in higher costs, arguing that “fragmentation is in no one’s economic interest”. \nMr Carney, speaking alongside Chancellor Philip Hammond, again warned against protectionism, saying it leads “neither to equity nor prosperity”. 8.50 Coreena Ford Time not right for interest rate hike - Mark Carney \nNow is not the time for an interest rate hike while wages continue to stagnate and the impact of Brexit on the economy is unclear, Bank of England Governor Mark Carney has said. \nSpeaking after three Bank policymakers called for a rate rise amid warnings that Brexit-fuelled inflation is set to surge further over the summer, Mr Carney said “now is not yet the time to begin that adjustment”. \nDelivering his delayed Mansion House speech, Mr Carney said: “Different members of the Monetary Policy Committee will understandably have different views about the outlook and therefore on the potential timing of any Bank rate increase. \n“From my perspective, given the mixed signals on consumer spending and business investment, and given the still subdued domestic inflationary pressures, in particular anaemic wage growth, now is not yet the time to begin that adjustment.” \nHe said he would like to see if falling consumer confidence is offset by other components of demand, whether wages begin to “firm”, how the economy reacts to “tighter financial conditions”, as well as the reality of Brexit negotiations, before considering any rate hike. \nLast week the MPC kept interest rates on hold at 0.25%, but Ian McCafferty, Michael Saunders and Kristin Forbes all voted for a rise to 0.5%, marking the first time three members have dissented for more than six years. \nIt came after inflation hit 2.9% in May - its highest level in nearly four years and far higher than expected. Mark Carney, Governor of the Bank of England (Photo: PA) 8.44 KEY EVENT Hammond hints at continued European Investment Bank links \nChancellor Philip Hammond has signalled Britain could seek access to money from the European Investment Bank (EIB) after Brexit and has announced an expansion of Government support for capital investment. \nIn a keynote speech to City leaders at Mansion House, Mr Hammond said he would seek to maintain access to the EIB while a member of the European Union and stressed it “may” be beneficial to maintain that relationship after the UK leaves. \nHe also announced a range of Government measures to support British businesses to invest in capital projects, including construction guarantees for infrastructure. \nThe Chancellor said Britain is “weary” of austerity “after seven years of hard slog” and signalled that the Government would boost investment in public services and could raise taxes to pay for it. He noted that higher taxes “slow growth, undermine competitiveness and cost jobs” but failed to rule out increases, adding: “The Government will remain committed to keeping taxes as low as possible.” Mr Hammond said he remained committed to the deficit reduction plan set out in the Autumn Statement, to achieve a balanced budget by the middle of the next decade, and said stronger growth is the only sustainable way to generate cash for public services. The Government will now seek to address “domestic weaknesses that have plagued us” - public and private under-investment, inadequate skills and regional economic inequality, Mr Hammond said. Chancellor Philip Hammond (Photo: PA) 8.42 Coreena Ford Public sector workers forced to cut back on food shopping, study claims \nPublic sector workers have seen their incomes fall “drastically” because of the Government’s cap on pay rises, forcing many to cut back on food shopping, a study shows. \nA survey of 6,500 workers by Unison also found that just over half had borrowed money from family or friends and one in 10 had missed meals to feed their children. \nTwo out of five of those surveyed, including paramedics, teaching assistants, council workers and police staff, said they were not saving anything. \nThe results were released ahead of the first day of Unison’s annual conference in Brighton, where general secretary Dave Prentis will call on the Government to lift the pay cap, which he warns has held back wages for several years. \nMr Prentis said: “Seven long years ago nurses, school meals staff, social workers, community support officers and other public service employees were told to tighten their belts as the Government said it had to freeze and squeeze their wages to pay down the deficit. \n“As a result public sector workers have seen their incomes fall drastically in real terms, and with inflation on the rise this means real financial hardship. \n“A modern caring society should not allow those who look after people when they’re ill, help educate our children or keep the public safe on the streets to be treated in this shoddy way. \n“The Government’s harsh pay policies have left hospitals, schools, town halls and police forces struggling to attract new staff and hold on to experienced employees. (Photo: PA) Coreena Ford Economy set to 'shift a gear' amid political uncertainty \nEconomic growth is set to be “subdued” over the next few years amid ongoing political uncertainty and Brexit talks, a leading business group is warning. \nThe CBI said a slower pace of growth is expected to persist, while business investment will fall back next year. \nHousehold spending growth is predicted to slow this year and in 2018, while wage rises will remain below inflation this year and broadly in line next year, said the CBI. The group forecast 1.6% economic growth for 2017 and 1.4% next year. \nCarolyn Fairbairn, the CBI’s director general, said: “Growth should be steady, if restrained, over the next couple of years as the pace of the economy shifts down a gear. \n“While the country’s exporters should emerge as a real catalyst of growth, rising inflation and stubbornly low wage growth mean that people are already starting to feel the pinch. \n“Tighter purse strings mean slower household spending growth and uncertainty is likely to weigh on the minds of those making major investment decisions. “So, after a frantic period in Westminster, this is the time for a renewed focus on the economic fundamentals of this country. \n“Above all, the new Government has the opportunity to signal loudly and clearly that Britain is a great place to do business, relentlessly focusing on investing in infrastructure, innovation and skills nationwide, while delivering a sensible and competitive tax and regulatory environment.” \nRain Newton-Smith, the CBI’s chief economist, added that growth will be slower in the years ahead as living standards are hit by rising inflation. Carolyn Fairbairn Coreena Ford Staff to learn of Jacamo and Simply Be closures \nN Brown, the owner of the Jacamo and Simply Be stores, has said it will not yet be releasing a list of which stores are affected by the closure news. \nThe firm, which is set to close up to five stores by the end of August, is now in talks with those affected. \nA spokeswoman told The Journal: “N Brown is currently in consultation with staff and therefore is unable to confirm the specific five locations which may shut.” 8.20 Coreena Ford Whitley Bay snack maker goes global \nA high protein cookie company that launched in Whitley Bay less than two years ago is now exporting to more than 55 countries across the world. \nOatein Ltd bakes high protein cookies, brownies, and flapjacks and in its first year it sold 1.2m products. \nThe firm’s snacks are now being sold in Spar supermarkets throughout the UK and Ireland. However, Oatein is also selling its stock in 125 LuLu hypermarkets across the Gulf region, 400 stores in Australia, and thousands of gyms and health clubs across Europe. \nThe business is also looking to sell its cookies in other outlets, such as petrol stations. \nGlobal sales director Andy Dixon said: We’re also making inroads into the petrol forecourt market where we believe our products are a perfect fit. After all who doesn’t like a cookie with their coffee?” \nOatein’s international expansion is still under way and the firm is currently in talks with distributors in Brazil, Canada, India and Taiwan. \nAs well as increasing its exports, Oatein is also expecting to boost its turnover to over £1m and hire more staff to work with its existing team of eight. Mr Oatein and global sales director Andy Dixon (Photo: Unknown) 8.12 The FTSE and pound latest \nThe FTSE-100 index opened at 7523.81. \nThe pound at 8am was 1.2742 dollars compared to 1.2742 dollars at the previous close. The euro at 8am was 0.8756 pounds compared to 0.8760 pounds at the previous close. Screen displaying the FTSE 100 at the London Stock Exchange (Photo: Yui Mok/PA Wire) 8.10 KEY EVENT Five Simply Be and Jacamo stores to close \nFashion retailer N Brown is to close up to five of its loss-making stores as it grapples with business rates hikes and lower high street footfall, respresenting a third of its double fascia stores. \nThe firm currently operates 15 of the stores which includes both of the plus size brands, including stores at Teesside Shopping Park, Thornaby, and intu Metrocentre, Gateshead, but it’s not yet known which stores are potentially affected. \nThe firm, which also operates the High and Mighty brand, said: \n“We will be closing up to five Simply Be and Jacamo dual-fascia stores. \n“This decision takes into account weak high-street footfall, both current and predicted, together with significant future business rate increases for some stores. Together, these five stores contributed £5.0m revenue but accounted for the entire £2.0m operating loss of our store estate in FY17. \n“The process will be completed by the end of August and we anticipate an exceptional cost in relation to these of £10m to £14m, of which approximately 70% will be cash. \n“We continue to improve the performance of the remaining 10 Simply Be and Jacamo dual-fascia stores.” \nN Brown made the announcement alongside a trading update, which showed first quarter sales rose 5.6%, driven by a strong ladieswear performance. \nOnline revenue accounted for 71% of total sales, up 4 percentage points year on year. \nChief executive Angela Spindler said: “Although the outlook for consumer confidence remains uncertain, our offering is resonating with customers.” The Simply Be and Jacamo store at Teesside Shopping Park, Stockton. 8.00 KEY EVENT Barclays and four bank chiefs face fraud charges \nBarclays and four individuals, including former boss John Varley, have been charged with conspiracy to commit fraud relating to the bank’s emergency fundraising during the financial crisis. \nThe Serious Fraud Office (SFO) said it had brought the charges against the bank itself as well as ex-chief executive Mr Varley, 61, Roger Jenkins, also 61, who is the former executive chairman of Investment Banking and Investment Management in the Middle East and North Africa for Barclays Capital, as well as two former senior executives, Thomas Kalaris, 61, and Richard Boath, 58. \nThe SFO has also charged Barclays plc, Mr Varley and Mr Jenkins with the provision of unlawful financial assistance. \nIt said the charges relate to the bank’s fundraising in 2008, which saw Barclays raise emergency capital from Qatari investors as the financial crisis sent the sector into meltdown. \nThe SFO charges come after a five-year investigation and centre on the bank’s move to raise cash from Qatari investors Qatar Holding and Challenger Universal in June and October 2008, and a $3bn (£2.4bn) loan made available to the State of Qatar in November of that year. \nBarclays said it is “considering its position in relation to these developments”. \nThe bank added: \nBarclays awaits further details of the charges from the SFO. \nThe SFO has informed Barclays that it has not made a decision as to whether it will also bring charges against Barclays Bank Plc in respect of the loan. \nThe Financial Conduct Authority (FCA) has also reopened its probe into the Qatari fundraising deal and is understood to be reviewing new evidence which could prompt it to reconsider a £50m fine against the banking giant four years ago. \nThe emergency funds raised by Barclays allowed it to avoid a government bailout in 2008 at a time when rivals Lloyds Banking Group and Royal Bank of Scotland were forced to rely on a taxpayer rescue. A Barclays bank branch", "external_links": [], "published": "2017-06-20T15:05:00.000+03:00", "crawled": "2017-06-20T10:17:36.001+03:00", "highlightTitle": ""}