{"organizations": [], "uuid": "314ac26a2b2791cb13e8994d976087ba70b55e06", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30413663/16061970.jpg", "site_section": "http://www.middevongazette.co.uk/news.rss", "section_title": "Devon Live news RSS feed", "url": "http://www.devonlive.com/here-s-when-we-ll-know-how-much-exeter-s-st-sidwell-s-point-will-finally-cost/story-30413663-detail/story.html", "country": "GB", "title": "We're about to find out how much Exeter's in-limbo St Sidwell's...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-28T16:40:00.000+03:00", "replies_count": 0, "uuid": "314ac26a2b2791cb13e8994d976087ba70b55e06"}, "author": "Alex_Richards", "url": "http://www.devonlive.com/here-s-when-we-ll-know-how-much-exeter-s-st-sidwell-s-point-will-finally-cost/story-30413663-detail/story.html", "ord_in_thread": 0, "title": "We're about to find out how much Exeter's in-limbo St Sidwell's...", "locations": [], "entities": {"persons": [{"name": "cllr musgrave", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "cllr bialyk", "sentiment": "none"}, {"name": "phil bialyk", "sentiment": "none"}, {"name": "pete edwards", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "cllr kevin mitchell", "sentiment": "none"}, {"name": "cllr chris musgrave", "sentiment": "none"}], "locations": [{"name": "exeter", "sentiment": "none"}, {"name": "paris street", "sentiment": "none"}, {"name": "princesshay shopping centre", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "civic centre", "sentiment": "none"}], "organizations": [{"name": "st sidwell", "sentiment": "none"}, {"name": "torquay", "sentiment": "none"}, {"name": "leisure complex board", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "lib dem", "sentiment": "none"}, {"name": "exeter labour", "sentiment": "none"}, {"name": "exeter city council", "sentiment": "none"}, {"name": "exeter bus & coach station", "sentiment": "none"}, {"name": "place scrutiny committee", "sentiment": "none"}, {"name": "leisure complex and bus station programme board", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "We're about to find out how much Exeter's in-limbo St Sidwell's Point pool and bus station will cost By Alex_Richards | Posted: June 28, 2017 2 COMMENTS SHARES Comments (2) \nA date has been set for when Exeter City Council will announce the proposed final cost and create a forward plan for its in-limbo city centre leisure centre project, St Sidwell's Point, and replacement bus station. \nA briefing will be held after the \"thorough evaluation\" of the tenders for the major development encompassing a large portion of the existing Exeter Bus & Coach Station site. \nReturn to Devon Live home page or read next: Legal challenge to Torquay's harbourside high rise hotel plan rejected \nThe leisure centre alone is expected to exceed its originally forecast £26m, a source suggesting an increase of more than 20 per cent. \nThe council's 'crown jewel' project has been on ice since February because the authority needed more time to finish the procurement process for a contractor. \nBus Station and Leisure Complex Board chairman Phil Bialyk blamed the Brexit, among other factors for the delay, in pinning down a tender within a realistic budget. \nSpeaking at the time, Cllr Bialyk said: \"Not everything is marvellous in the country, despite what the Brexiteers tell you. There are a number of projects not going ahead, or not going ahead as quickly. \n\"But we are incredibly nervous about getting this right. We want this to work and that's our plan .\" \nThe hi-tech passivhaus standard proposed for the leisure complex has also been partly blamed for the delay with tenders, with few firms able to fulfill its complex demands. \nThe meeting of the authority's Leisure Complex and Bus Station Programme Board will be held at the Civic Centre on Monday, July 10. \nBelow: Labour members defended the delays to the project during an Extraordinary meeting of the council earlier this year \nCllr Kevin Mitchell, Lib Dem representative for, said: \"I will be attending the briefing and look forward to seeing the report to the Executive. \n\"I along with other opposition Councillors have for a long time been calling for transparency and answers regarding this project. \n\"I therefore welcome the fact the administration is going to at last answer questions and be open about the future of this project.\" \nCllr Chris Musgrave has been openly critical of the pool and bus project since defecting from the Labour party earlier this year. \nHe also awaits the news with interest, and remains adamant that part of any future course of action on the project should involve the council taking the reigns on running it. \nIn his political blog, 'Privatised Eye', he slammed leading council member's Phil Bialyk and Pete Edwards for supporting Jeremy Corbyn's calls against the privatisation of Britain's railway during the Labour Leader's visit on Sunday. \nCllr Musgrave wrote: \"At the recent extraordinary Full Council, I put a question to the administration, asking if, in the light of spiralling costs of the project, Labour were still planning to go ahead with the proposal to privatise our new leisure centre before it was even built. I secured a one word response, 'yes'. \n\"I put the same question this month at the Place Scrutiny Committee and got a more detailed case from Labour about why privatisation is the best option for Exeter. \n\"I followed up with a question about the policy difference between national Labour and Exeter Labour. Why is privatisation good in Exeter but not good for the country? I asked. Who has it right? Exeter or Corbyn? It cannot be both.\" \nThe bus and pool project has been fully approved for construction by city planners. \nIt will be situated off the Paris Street roundabout, with the upper Paris Street and Sidwell Street-facing land earmarked for a retail and dining extension of Princesshay Shopping Centre. \nAll projects on the bus and coach station site are, at this stage, scheduled for completion in 2019. ", "external_links": [], "published": "2017-06-28T16:40:00.000+03:00", "crawled": "2017-06-28T18:02:18.002+03:00", "highlightTitle": ""}