{"organizations": [], "uuid": "a9d53fe996d8d9d6579f56656606a89f6482ed53", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article13151529.ece/ALTERNATES/s1200/Ineos-4x4-plans.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-faces-competition-europe-13151587", "country": "GB", "domain_rank": 21960, "title": "North East faces competition from Europe in bid to land new car manufacturer", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-07T22:27:00.000+03:00", "replies_count": 0, "uuid": "a9d53fe996d8d9d6579f56656606a89f6482ed53"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-faces-competition-europe-13151587", "ord_in_thread": 0, "title": "North East faces competition from Europe in bid to land new car manufacturer", "locations": [], "entities": {"persons": [{"name": "jim ratcliffe", "sentiment": "none"}, {"name": "crotty", "sentiment": "none"}, {"name": "tom crotty", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "business north east", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "international advanced manufacturing park", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "south tyneside", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "ineos", "sentiment": "negative"}, {"name": "newcastle united", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "ineos automotive", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business North East faces competition from Europe in bid to land new car manufacturer Ineos wants to create around 1,000 jobs with new vehicle manufacturer but says UK is facing competition from Europe Share Ineos chairman Jim Ratcliffe (Photo: PA) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nEfforts to bring a new car manufacturing plant to the North East have been dealt a blow after the company involved received a number of offers from Europe. \nIneos Automotive has started a search for a site where it would produce 4x4 off-road vehicles similar to the Land Rover Defender. \nThe factory is likely to create 1,000 jobs with many more likely to follow in the supply chain. \nIneos director Tom Crotty said earlier this year that “it would be great to create the jobs in the North of the UK”, raising hopes that the North East could benefit from the existing expertise built up around the Nissan plant at Sunderland and the International Advanced Manufacturing Park being built in Sunderland and South Tyneside. \nThe company also favours a coastal location because it expects to export many of its vehicles. \nBut now Mr Crotty has revealed that Ineos has held discussions both in the UK and in Europe and maintained that its final site would be chosen on business reasons alone. Read More Newcastle United rated the fastest growing brand in world football \nThat has raised the prospect that the looming Brexit negotiations, which could result in tariffs being introduced on UK-produced vehicles, could see the plant sited on the continent rather than in Britain. \nThe firm has denied that Brexit is a factor in its deliberations - with Ineos founder and chairman Jim Ratcliffe a prominent Leave campaigner - but said that Government support could sway the decision on where its factory is built. \nMr Crotty, Ineos’ director of corporate affairs, said: “We’ve already had high level discussions with the UK Government as well as a lot of international interest. \n“Whilst we would love this to be a British vehicle, this is a business venture and our hearts cannot be allowed to rule our heads.” \nIneos, which is hoping to produce at least 25,000 cars a year at the proposed facility, said it was willing to consider green field sites, former car plants and even existing production lines which can be re-configured for the new vehicle. \nThe company intends to invest hundreds of millions of pounds in Projekt Grenadier - the code name for the venture - which is the brainchild of Mr “Jim Ratcliffe, who was a fan of the original Land Rover Defender. Read More \nIneos has previously said it is looking to have a made a number of key decisions, such as where the factory will be located and the name of its vehicle, by the end of this year. \nIt would then take around three years to build the factory and start manufacturing the vehicles. Like us on Facebook ", "external_links": [], "published": "2017-06-07T22:27:00.000+03:00", "crawled": "2017-06-07T18:02:43.000+03:00", "highlightTitle": ""}