{"organizations": [], "uuid": "d31484c5b4319fa8127a4333591ec7911a364c4c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30364901/16025415.jpg", "site_section": "http://www.middevongazette.co.uk/news.rss", "section_title": "Devon Live news RSS feed", "url": "http://www.devonlive.com/bail-extended-for-woman-arrested-on-suspicion-of-murder-after-paignton-death/story-30364901-detail/story.html", "country": "GB", "title": "Bail extended for woman arrested on suspicion of murder after...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-02T13:28:00.000+03:00", "replies_count": 0, "uuid": "d31484c5b4319fa8127a4333591ec7911a364c4c"}, "author": "Zoe_Stevens", "url": "http://www.devonlive.com/bail-extended-for-woman-arrested-on-suspicion-of-murder-after-paignton-death/story-30364901-detail/story.html", "ord_in_thread": 0, "title": "Bail extended for woman arrested on suspicion of murder after...", "locations": [], "entities": {"persons": [{"name": "paignton", "sentiment": "none"}, {"name": "georgia toffolo", "sentiment": "none"}, {"name": "lisa juliet nicholls", "sentiment": "none"}, {"name": "jack", "sentiment": "none"}, {"name": "jack monroe", "sentiment": "none"}], "locations": [{"name": "victoria derbyshire", "sentiment": "none"}, {"name": "paignton", "sentiment": "none"}, {"name": "torquay", "sentiment": "none"}, {"name": "georgia toffolo", "sentiment": "none"}, {"name": "chelsea", "sentiment": "none"}, {"name": "barnstaple", "sentiment": "none"}, {"name": "georgia", "sentiment": "none"}, {"name": "church street", "sentiment": "none"}], "organizations": [{"name": "bbc", "sentiment": "none"}, {"name": "general election", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}, {"name": "barnstaple police's custody unit", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Bail extended for woman arrested on suspicion of murder after Paignton death By Zoe_Stevens | Posted: June 02, 2017 0 COMMENTS SHARES \nPolice have confirmed that a woman who was arrested on suspicion of murder after the discovery of a woman's body in Paignton has had her bail extended by a month. \nTwo people were arrested in connection with the death of a 47-year-old woman, and were bailed pending further enquiries until May 30. This has now been extended to June 30. \nA 48-year-old man and a 41-year-old woman, both from Paignton, were arrested on suspicion of murder after a woman's body was found on March 3 in Church Street, Paignton, at 5.25am. \nPolice and paramedics were alerted to concerns for the welfare of a person in the street and a body was discovered. \nAn inquest opened into the death of the woman, who was identified as Lisa Juliet Nicholls, 47, of Well Street, on March 8 by the coroner in Torquay. \nThe coroner was told that 'the circumstances of her death are that she was found in the road' at 5.51am. Police are treating the death as unexplained. \nThe circumstances of how she died have yet to be made public. A post-mortem has been carried out and detectives in Torbay are waiting for the results of toxicology tests. \nFloral tributes were left at the scene. \nA senior detective said officers were investigating the unexplained circumstances of her death and as a result two people had been arrested. \nThe cause of death has not been released and police were still treating it as unexplained. \nPolice want to hear from anybody who was in the area before 5.25am on Friday or who has information in relation to the woman whose body was found. \nAnyone who can help police should contact them on 101, email 101@dc.police.uk or call Crimestoppers anonymously on 0800 555111 quoting log number 82 of 3/3/2017. READ NEXT: \nPolice hit out at 'drunk' woman caught driving with two toddlers in the back of her car \nA woman driving a car with two toddlers in the back was stopped by police in the Barnstaple area this morning for being over the drink drive limit. Barnstaple Police's Custody Unit tweeted about the incident at 7.48am today. The alcohol limit for drivers is 35 microgrammes per 100 millilitres of breath and the woman, \"provided 104 at the roadside\". \nWhat viewers make of those taking part in the BBC1 election debate \nThe polls say Labour is closing in on the Conservatives, and one even claims the Tories will lose the General Election. That's a far cry from the PM's plan to secure a mandate for Brexit with a strong and stable Government. So how will the part spokespeople fare in tonight's BBC1 debate? Have your say by rating them live in our widget below, and see what others think of the performance. \nWatch Made in Chelsea's Georgia Toffolo and blogger Jack Monroe discuss their political views \nMade in Chelsea star Georgia Toffolo and blogger Jack Monroe were sent on a political blind date by the BBC's Victoria Derbyshire programme to discuss their differing political ideologies. Georgia, 22, from Torquay, comes from a more privileged background and is a member of the Conservative Party, while at one time Jack was unemployed and unable to afford food.", "external_links": [], "published": "2017-06-02T13:28:00.000+03:00", "crawled": "2017-06-02T09:24:40.004+03:00", "highlightTitle": ""}