{"organizations": [], "uuid": "6ac456184c1fe442c4edafa1f742d5eed9e3f7dd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13124539.ece/ALTERNATES/s1200/The-BBC-Leaders-Debate-Takes-Place-In-Cambridge.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/things-couldnt-gone-better-labour-13124532", "country": "GB", "domain_rank": 21960, "title": "Things couldn't have gone better for Labour - Jeremy Corbyn should win this general election", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-02T04:00:00.000+03:00", "replies_count": 0, "uuid": "6ac456184c1fe442c4edafa1f742d5eed9e3f7dd"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/things-couldnt-gone-better-labour-13124532", "ord_in_thread": 0, "title": "Things couldn't have gone better for Labour - Jeremy Corbyn should win this general election", "locations": [], "entities": {"persons": [{"name": "jeremy corbyn", "sentiment": "negative"}, {"name": "tory george osborne", "sentiment": "none"}, {"name": "amber rudd", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "michael crick", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "teesside", "sentiment": "none"}, {"name": "sun", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "negative"}, {"name": "conservative", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily   Thank you for subscribing!   \nLabour leader Jeremy Corbyn gave a very honest and sensible answer when he was asked what would be a “good result” for Labour in the general election. \nHe said: “Winning the election”. \nAnd the answer, in an interview with the Independent, was spot on. Labour should win on June 8. \nThe election is there for the taking. \nConservative leader Theresa May has run a dreadful campaign. \nShe decided - or was advised - to make it all about her. Labour leader Jeremy Corbyn (Photo: Getty Images Europe) \nHer speech on Brexit in Teesside is a prime example. She urged voters to “put your trust in me, back me” - using the phrase three times. \nBut it hasn’t worked. Voters aren’t convinced by Theresa May because she’s shown that she’s not strong and stable, another favourite phrase, at all. \nHer manifesto launch was a disaster and she did a u-turn on one of her key policies, the unpopular “dementia tax”, in the middle of the election campaign. This is almost unheard of. \nConservative candidates are dismayed. They talk mockingly about the “cult of May”. \nAnd there’s already talk about who will be the next Conservative leader after she goes, with Home Secretary Amber Rudd in the frame. That’s a sign that a leader is in trouble. \nIt should be possible to beat Theresa May. \nShe’s been ridiculed for failing to take part in TV debates. Jeremy Corbyn is up against an opponent who doesn’t even turn up to the fight. \nDoes Labour face a battle against a powerful right wing media? To some extent - but the media have turned on Mrs May. Labour leader Jeremy Corbyn (Photo: PA) \nA journalist (Michael Crick of Channel 4) came up with the idea that she was “weak and wobbly”. The rest of the media ran with it. \nThe London Evening Standard, edited by fellow Tory George Osborne, has accused her of launching “the most disastrous manifesto in recent history”. \nEven the Tory-supporting Sun is mocking her. When she took questions after her Teesside speech, a Sun reporter asked if she was concerned that she looked like she was panicking. Read More Election polls 2017: Who's winning as Conservatives battle Labour? \nWhat about the disloyal Labour MPs undermining Mr Corbyn ? \nThey’ve been quiet throughout this campaign. In fact, they’ve been pretty quiet since last year’s leadership contest. \nThis is Mr Corbyn’s chance to prove his doubters wrong. And he might do it. \nHe won’t get a better chance than this. Against this damaged Conservative leader and her misjudged election campaign, Labour really should win. \nAs Mr Corbyn says, we’ll know whether Labour achieved a good result, once the votes are counted, by whether they are preparing to form a government or not. Like us on Facebook", "external_links": [], "published": "2017-06-02T04:00:00.000+03:00", "crawled": "2017-06-01T23:38:06.006+03:00", "highlightTitle": ""}