{"organizations": [], "uuid": "70577a5ba96c65718b5d94a8466b8e7942355059", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article11875670.ece/ALTERNATES/s1200/JS60287380.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/businesses-tired-fairytale-politics-general-13139525", "country": "GB", "domain_rank": 21960, "title": "Businesses are tired of 'fairytale politics' in the General Election, says tech boss", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-05T20:01:00.000+03:00", "replies_count": 0, "uuid": "70577a5ba96c65718b5d94a8466b8e7942355059"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/businesses-tired-fairytale-politics-general-13139525", "ord_in_thread": 0, "title": "Businesses are tired of 'fairytale politics' in the General Election, says tech boss", "locations": [], "entities": {"persons": [{"name": "sage c", "sentiment": "negative"}, {"name": "young", "sentiment": "none"}, {"name": "stephen kelly", "sentiment": "none"}, {"name": "sage", "sentiment": "none"}, {"name": "kelly", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "general election", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "entrepreneurs network", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Businesses are tired of 'fairytale politics' in the General Election, says tech boss Sage CEO Stephen Kelly says action is needed on skills, exports and regulation by whoever wins Thursday's election Share Stephen Kelly, the CEO of Sage Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nBusinesses are tired of “fairytale promises” from politicians and need the next Government to provide leadership on the economic issues facing the economy, the head of Newcastle tech giant Sage has said . \nCEO Stephen Kelly says he will use his company’s position as the “voice of entrepreneurs” to hit whoever wins Thursday’s election with a three-part plan for action that will show that the “UK is not only open for business, but the best place to start and grow a business too”. \nMr Kelly says the next Prime Minister can take quick action on export support, reducing red tape and boosting skill levels, particularly in digital, that would give small and medium sized businesses an immediate boost without having to make any major spending commitments. \nAction on those three areas would also produce benefits that won’t be affected by whatever happens in the Brexit negotiation, he added. \nMr Kelly’s call for action came after research by Sage showed that the majority of small business owners felt ignored by the Government. \nHe said he had hoped for a better debate than that preceeding last year’s EU referendum, “but so far we are still waiting”. \nHe said: “We very much think of ourselves as the voice of entrepreneurs and what they’re saying is that they need politicians to step up and provide positive leadership and a positive vision for Britain. \n“Obviously when business does well, we all do well. In the run-up to the Brexit vote the doom mongers said some terrible things but the nation has carried on, mainly powered by entrepreneurs who get up every morning and show that resilience and leadership and energy. \n“In this phase we definitely need our political leadership to step up and have a positive dialogue with the EU and the rest of the world, and actually sustain and support business.” \nSage has been working with The Entrepreneurs Network, a body which supports business owners, to host meetings with business leaders on the issues that would make the biggest difference to their companies. Read More Newcastle tech giant Sage sells North American Payment arm for over £200m \nA report produced as a result of those sessions - A Boost for British Businesses - calls for the next Government to implement Lord Young’s proposal to introduce an Enterprise Passport – a digital record of all extra-curricular and enterprise-related activities that students take part in throughout their education. \nIt says changes to the immigration system as Britain leaves the EU must not cut off the flow of talented workers into the country, and calls for better support for exporters. The report also calls for the next Government to copy exchange and incubator programmes for businesses run in Australia and Switzerland. \nMr Kelly said: “This is a time for decisive leadership to create a comprehensive program of policies designed for entrepreneurs. These heroes have the power to keep firing up our country’s economic engine – but to do so, they need politicians to hear them.” Like us on Facebook", "external_links": [], "published": "2017-06-05T20:01:00.000+03:00", "crawled": "2017-06-05T16:09:04.003+03:00", "highlightTitle": ""}