{"organizations": [], "uuid": "e231f706e7186465181622b8dea62ce94e531719", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30406740/16056866.jpg", "site_section": "http://www.westernmorningnews.co.uk/editorschoices.rss", "section_title": "Devon Live Editor's Choices RSS feed", "url": "http://www.devonlive.com/devon-fish-paying-high-price-for-scottish-salmon-farms/story-30406740-detail/story.html", "country": "GB", "title": "Devon fish paying high price for Scottish salmon farms", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-24T00:33:00.000+03:00", "replies_count": 0, "uuid": "e231f706e7186465181622b8dea62ce94e531719"}, "author": "Zoe_Stevens", "url": "http://www.devonlive.com/devon-fish-paying-high-price-for-scottish-salmon-farms/story-30406740-detail/story.html", "ord_in_thread": 0, "title": "Devon fish paying high price for Scottish salmon farms", "locations": [], "entities": {"persons": [{"name": "peter burgess", "sentiment": "none"}, {"name": "leo", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "willy wee", "sentiment": "none"}], "locations": [{"name": "devon", "sentiment": "none"}, {"name": "dorset", "sentiment": "none"}, {"name": "north devon", "sentiment": "none"}, {"name": "exeter  the trust", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "devon wildlife trust", "sentiment": "none"}, {"name": "regent street", "sentiment": "none"}, {"name": "lulworth", "sentiment": "none"}, {"name": "weymouth", "sentiment": "none"}, {"name": "bristol", "sentiment": "none"}, {"name": "teignmouth", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "devon coast", "sentiment": "none"}, {"name": "devon ifca", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}, {"name": "south devon", "sentiment": "none"}], "organizations": [{"name": "bbc", "sentiment": "none"}, {"name": "devon council", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "ucas", "sentiment": "none"}, {"name": "inshore fisheries and conservation authority", "sentiment": "none"}, {"name": "plymouth sound special area of conservation", "sentiment": "none"}, {"name": "ikea", "sentiment": "none"}, {"name": "ents shares devon", "sentiment": "none"}, {"name": "devon wildlife trust", "sentiment": "none"}, {"name": "bbc tv", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Devon fish paying high price for Scottish salmon farms By Zoe_Stevens | Posted: June 23, 2017 0 COMMENTS SHARES Devon fish paying high price for Scottish salmon farms X \nCopy link to paste in your message / Comments (0) \nA Devon-based wildlife charity is calling for immediate action to control a fishing practice which is leading to thousands of local fish being removed from around the coast of Devon. \nThe fish – from a family of fish known as wrasse - are being transported alive to Scottish salmon farms where they are being used as a 'natural' control against parasites. \nDevon Wildlife Trust is calling for a ban on the live capture of the fish from Devon's Marine Protected Areas – places which have been recognised for the richness of their marine nature. Read next: Rapper who is a recovering addict launches new recovery initiative in Exeter \nThe Trust is requesting people in Devon to voice their opposition by signing an on-line petition which asks for action to be taken by the county's MPs. \nThe removal of live wrasse for Scottish fish farms is thought to be a relatively new practice. Until now, wrasse have not been commercially fished in Devon, however, demand from Scotland for parasite control has meant that five species are now being targeted. These include: corkwing, ballan, goldsinney, cuckoo, and rock cook wrasse. \nRecently limited controls on Devon's wrasse fishery have been implemented by the Inshore Fisheries and Conservation Authority, but Devon Wildlife Trust believes that these do not go far enough. It points to a similar wrasse fishery which took place in 2015 in Dorset. This saw 57,000 of the fish taken during just one 18-week period in an area between Lulworth and Weymouth. Now the fear is that a similar operation is underway in Devon. Read next: Exeter uni boss and Brexit leader says negotiators 'can't see way forward' one year on from vote \nDevon Wildlife Trust is concerned about the impact this will have on local wrasse populations and the wider marine environment. \nThe charity's director of conservation and development, Peter Burgess said: \"We're calling for an immediate stop to the practice of removing live fish from Devon's MPAs to satisfy the needs of Scottish fish farms. This is a very destructive fishery. Mortality rates among the wrasse are often high - many of them do not survive the process of capture, storage and transportation they are put through.\" \n\"Wrasse are long-lived and highly territorial fish, so the removal of large numbers along the Devon coast will severely disrupt their populations – it could take decades for them to recover. Read next: Why Isca Academy should champion Exeter's boys in skirts instead of trying to shut them up - comment \n\"Nobody yet knows what impacts wholescale removal of wrasse will have on our fragile marine reef ecosystems and the natural balance could be thrown into chaos. This could be devastating for not only the wrasse but habitats and species which depend on them for their survival.\" \n\"The recent moves by the Devon IFCA to partially control the fishery are an acknowledgement of the problem but don't go nearly far enough to offering a solution. It's vital that we exercise the precautionary principle and halt the capture and removal of wrasse from our most precious marine environments before long term damage is done.\" Read next: Three whales spotted off South Devon coast \nDevon Wildlife Trust has evidence that as many as 480 baited traps, known as pots, could be deployed around the county's coastlines. There are currently no restrictions on where the pots can be placed. As wrasse live on rocky reefs close to shore this means that much of the fishing activity could take place within Devon's most treasured and protected 'in-shore' marine environments, places which include Plymouth Sound Special Area of Conservation and Wembury Voluntary Marine Conservation Area. \nDevon's wrasse are being removed to meet demand from salmon fish farms in Scotland. Wrasse are used as 'cleaner fish' helping fish farms by feeding on the sea lice that infest captive salmon and which slow their growth. In the past chemical controls have been used against the lice. However, in recent years the lice have developed resistance to these chemicals and salmon producers have instead turned to the use of 'natural' controls in the shape of wrasse and other fish. Read next: Here's the inside secrets of Ikea ahead of the Exeter opening - Revealed by a store worker \nDevon Wildlife Trust's Peter Burgess encouraged people to support the charity's call for a stop to the mass removal of wrasse for the Scottish salmon industry. He said: \"Devon wrasse populations are being threatened to solve the problems caused by commercial salmon fish farms hundreds of miles away in Scotland. Once commercially viable stocks of wrasse are exhausted from Plymouth our fear is this practice could move to ports throughout the South West. \n\"There are only limited controls on this new fishery and little understanding of its longer term impacts on the health of this fascinating native species and the fragile reef environments the wrasse help to sustain. This is why we're asking the people of Devon to help us stop the removal of thousands of wrasse from the county's Marine Protected Areas by signing our on-line petition.\" \nDetails on Devon Wildlife Trust's wrasse petition can be found at www.devonwildlifetrust.org . READ NEXT: Staff being paid double to shift recycling backlog on North Devon streets Staff at a Devon council are being offered double pay to help shift the missed recycling and to clear the backlog left on the streets.North Devon Council came under criticism this week after several people complained that they had not yet received the new kerbside kitchen caddies for food waste or that their recycling collection has been missed.Devon Live had previously reported that the district council said that these issues had arisen due to the \"unprecedented\" amount of food waste being put out for collection by North Devon residents. South Devon stabbing appeal features on BBC TV show A police appeal to identify a man in connection with a stabbing in Teignmouth during regatta week last year has featured on BBC's Crime Watch Roadshow.A 33-year-old man from Teignmouth received a puncture wound to the abdomen and was taken to hospital where he later required surgery, police said at the time.The incident happened at just after midnight on Saturday, July 31 last year, when police received reports of a disturbance between four men on Regent Street, Teignmouth. There's still time to apply to university this year – but the deadline is looming If you've been thinking about applying to study at university this year, then there's still time to put in an application – but just remember the June 30 deadline.That's the message from UCAS, the organisation responsible for managing applications to higher education in the UK.Although the 'on time' deadline passed in January, applicants can still apply for up to five choices if they submit their application by 6pm on June 30. Rapper who is a recovering addict launches new recovery initiative in Exeter A renowned rapper who has battled a drink and drugs addiction was in Exeter today at the launch of a initiative aimed at helping people on the recovery journey.Leo Coleing, better known as MC Leo, has been clean for nearly seven years and was asked by to perform at the first Recovery Sound System (RSS) event which aims to make a difference through music and connecting with others.Leo, of Bristol, turned his back on music after realising it had caused a spiralling addition to cocaine and alcohol. In his heyday from 1999 to 2001, he was signed to major music labels, toured across America, and lived with Massive Attach rapper Willy Wee in London. ", "external_links": [], "published": "2017-06-24T00:33:00.000+03:00", "crawled": "2017-06-24T00:20:50.002+03:00", "highlightTitle": ""}