{"organizations": [], "uuid": "0a927229846b783dc94226d4b0dc171247c8d03b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article11473855.ece/ALTERNATES/s1200/JS92202430-1.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13243829", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Philip Green sold BHS to avoid huge pensions bills, says regulator", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-28T09:55:00.000+03:00", "replies_count": 0, "uuid": "0a927229846b783dc94226d4b0dc171247c8d03b"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13243829", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Philip Green sold BHS to avoid huge pensions bills, says regulator", "locations": [], "entities": {"persons": [{"name": "jonathon manning faecal", "sentiment": "negative"}, {"name": "vroom", "sentiment": "none"}, {"name": "liam watson", "sentiment": "none"}, {"name": "jonathon manning stagecoach", "sentiment": "none"}, {"name": "watson", "sentiment": "none"}, {"name": "jonathon manning", "sentiment": "none"}, {"name": "humphrey singer", "sentiment": "none"}, {"name": "martin griffiths", "sentiment": "none"}, {"name": "jonathon manning dixons carphone", "sentiment": "none"}, {"name": "costa", "sentiment": "none"}, {"name": "virgin", "sentiment": "none"}, {"name": "seb james", "sentiment": "none"}, {"name": "caffe nero", "sentiment": "none"}, {"name": "carl marshall", "sentiment": "none"}, {"name": "jonathon manning work", "sentiment": "none"}, {"name": "simon bishop", "sentiment": "none"}, {"name": "jonathan de mello", "sentiment": "none"}, {"name": "byker", "sentiment": "none"}, {"name": "tony lewis", "sentiment": "none"}, {"name": "michael o’driscoll", "sentiment": "none"}, {"name": "harper dennis hobbs", "sentiment": "none"}], "locations": [{"name": "vroom", "sentiment": "none"}, {"name": "shields road", "sentiment": "none"}, {"name": "sedgefield", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}, {"name": "east midlands trains", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "knightsbridge", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "west coast", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "cambridge", "sentiment": "none"}, {"name": "virgin trains east coast", "sentiment": "none"}, {"name": "costa", "sentiment": "none"}, {"name": "caffe nero", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "north east  work", "sentiment": "none"}, {"name": "north tyneside", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "east midlands", "sentiment": "none"}, {"name": "newcastle-upon-tyne", "sentiment": "none"}], "organizations": [{"name": "philip green", "sentiment": "negative"}, {"name": "vroom", "sentiment": "none"}, {"name": "east coast", "sentiment": "none"}, {"name": "bbc", "sentiment": "none"}, {"name": "esh group", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}, {"name": "dixons carphone", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "virgin trains east coast", "sentiment": "none"}, {"name": "northumberland estates", "sentiment": "none"}, {"name": "south eastern", "sentiment": "none"}, {"name": "chartered institute of environmental health", "sentiment": "none"}, {"name": "sncf", "sentiment": "none"}, {"name": "costa coffee", "sentiment": "none"}, {"name": "simon bishop", "sentiment": "none"}, {"name": "lumsden & carroll", "sentiment": "none"}, {"name": "motor depot", "sentiment": "none"}, {"name": "local growth fund", "sentiment": "none"}, {"name": "network rail", "sentiment": "none"}, {"name": "westfield london", "sentiment": "none"}, {"name": "west coast partnership", "sentiment": "none"}, {"name": "canny", "sentiment": "none"}, {"name": "department for transport", "sentiment": "none"}, {"name": "dixons", "sentiment": "none"}, {"name": "tyne tunnel trading estate", "sentiment": "none"}, {"name": "birmingham mail", "sentiment": "none"}, {"name": "virgin rail group", "sentiment": "none"}, {"name": "vroom  northumberland estates", "sentiment": "none"}, {"name": "lep", "sentiment": "none"}, {"name": "stagecoach", "sentiment": "none"}, {"name": "cctv", "sentiment": "none"}, {"name": "pc world", "sentiment": "none"}, {"name": "starbucks", "sentiment": "none"}, {"name": "newcastle upon tyne", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}, {"name": "durham county council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning Muckle wins slot on major education panel \nNewcastle law firm Muckle has won a place on a major panel to provide legal advise to schools across the country. \nThe firm won three seats on the Higher Education Procurement Consortia, and was named as one of only 10 firms to be appointed to the One-Stop-Shop legal services panel. \nEducation partner Tony McPhilips said: \nThis is a significant milestone for our Education team and is suitable recognition for the hard work we have been delivering in this sector. \nWe are absolutely delighted to be appointed as a preferred supplier on the Higher Education Procurement Consortia panel. The appointment will further strengthen our expertise and credentials in this sector and serve to widen our geographic reach across England and Wales. \nWe are also extremely proud that we are the only regional independent law firm, operating from our single site office in Newcastle, to have gained a place on the national panel. Now we are looking forward to working with members during the months and years ahead. \nGaining a spot on the One-Stop-Shop panel means Muckle can provide a full range of services to education providers within the consortia. The firm has also been placed on the property and commercial panel. Alan Grisedale (Commercial), Tony McPhillips (Education), Lucilla Waugh (Construction), Jonathan Combe (Property) 8:55 Jonathon Manning Faecal bacteria discovered in ice at three major coffee chains \nConcerning levels of faecal bacteria were present in ice at three major high street coffee chains, according to an investigation by the BBC. \nSamples from drinks at Costa, Starbucks, and Caffe Nero were reportedly found to be contaminated in lab tests carried out by BBC One’s consumer series Watchdog. \nFaecal coliforms, which contain disease-causing pathogens, were present on 7/10 ice samples in Costa, 3/10 in Caffe Nero and 3/10 in Starbucks, the BBC said. \nTony Lewis, Chartered Institute of Environmental Health, told the programme: \nThe level of contamination of faecal bacteria concerns me a great deal. \nThe bacteria found are opportunistic pathogens - the source of human disease. \nThese should not be present at any level - never mind the significant numbers found.” \nCleanliness of tables, trays, and high chairs at the chains was also tested at 30 branches. \nA Starbucks spokesman said it takes hygiene “extremely seriously” and “nothing is more important” than customer safety. \nHe added: \nWe have moved quickly to conduct our own investigation into the claims about the stores. \nAll employees nationwide have received updated training on our high standards of hygiene including ice handling. \nCosta said: \nWe were disappointed with the findings, especially as these stores are all rated ‘very good’ with a the top hygiene rating of five. \nFollowing these results we took immediate action to review our food safety procedures and have updated our ice-handling guidelines and are in the process of introducing new ice equipment storage across our estate. \nA spokesman for Caffe Nero described the findings as concerning and added: \nA thorough investigation is now under way and the appropriate action will be taken. \n99% of our stores are rated as very good, good or satisfactory by their local EHO (environmental health officer) - making us one of the most highly rated businesses on the high street. Costa Coffee (Photo: Birmingham Mail) 8:50 KEY EVENT Canny milkshakes is looking for investors with as little as £10 spare to help company grow \nFlavoured milk firm Canny is offering people the chance to own a piece of its business after launching a crowd funding campaign designed to help the company expand. \nFounders Liam Watson and Simon Bishop launched their company in 2015, and are now looking to raise £100,000 to fund the next stage of its growth. \nBut instead of going to a private equity house, the duo decided to offer the local community the chance to own a part of the firm. \nSpeaking to The Journal Mr Watson said: \nWe want a team of people who own part of a growing North East business. After all, we are a North East business called Canny. \nWhen people think about investments they think its thousands of pounds but it’s not. You can put a tenner in and own part of the business. \nCrowdcube works slightly differently from other crowdfunding websites because those who back a project own shares in the business. \nCanny is using the platform to raise £100,000 in exchange for 14.29% of the company. \nInvestors can invest as little as £10, and those who do will be eligible to receive dividends and capital distributions. Those who invest over £2,500 will receive ordinary shares, which also includes voting rights in the company. \nThose wishing to invest in the company can do so at www.crowdcube.com/canny . Canny founders Liam Watson (L) and Simon Bishop (R) (Photo: Unknown) 8:45 Jonathon Manning Car supermarket operator coming to North Shields retail park Vroom \nNorthumberland Estates has secured a national car supermarket operator at Vroom , as the car retail park in North Tyneside takes a major step forward. \nThe new 10-year letting to Motor Depot will see an additional 300 cars and a new 10,000 sq ft inspection unit being added to the Vroom site, the eight-acre car retail park on the Tyne Tunnel Trading Estate which was acquired by Northumberland Estates, the business interests of the Duke of Northumberland and his family, two years ago. \nHighways England started a £75m road improvement project to the A19/A1058 last summer, which has now moved off the Vroom site marking a significant milestone for existing and future occupiers. \nAs a result Northumberland Estates is investing in a series of improvements across the area, including landscaping, new signage and CCTV. \nMichael O’Driscoll, senior asset manager at Northumberland Estates, said: \nThere has been a great deal of activity at Vroom and the surrounding area over the last 12 months, but we are now in a position where the site is significantly more visible from the A19. \nThe road improvement scheme is due to complete in 2019 and will dramatically enhance the prospects of the location. \nWe are pleased that Motor Depot has identified this and the wider opportunities that Vroom offers. We are committed to building Vroom’s profile as the region’s premier second hand car retail park and have further opportunities for more brands to join us. An aerial photo of the Vroom site, with a CGI superimposed where the new motor depot will sit (Photo: Northumberland Estates) 8:36 KEY EVENT Newcastle's Shields Road named Britain's worst shopping district \nShields Road in Byker, Newcastle, has been named as the least attractive shopping locations, according to a report. \nThe 2017 Vitality Rankings, published by retail property specialist Harper Dennis Hobbs, found that Shields Road is the “least vital” shopping centre across the country. \nThe decision was made based on the amount of retail space currently going unused, as well as the number of “undesirable” shops such as pawnbrokers. \nThe report read: \nThe least vital centre is Shields Road in Byker, Newcastle-upon-Tyne, where 19.6% of retail floorspace is unused – up 11% in the past 5 years. The retail mix on Shields Road is dominated by ‘undesirable’ retail, such as betting shops and money lenders. \nHarper Dennis Hobbs’ rankings included small retail centres such as out of small high streets and shopping districts for the first time. This also led to Shields Road being included in the list for the first time. \nCambridge was ranked as the country’s best shopping location, while Westfield London came second and Knightsbridge third. \nThe report ranks shopping centres by their “retail health”. It included 1,000 locations. \nJonathan De Mello, Head of Retail Consultancy at Harper Dennis Hobbs, said: \nThis ranking highlights the ‘healthiest’ retail centres in Britain, which successful brands should target when considering network expansion. Smaller centres are of increasing interest to retailers, given rents are often highest in the largest centres. So a small centre with a high vitality score – and the right shopper profile – could potentially yield strong profits. Shields Road, Byker, has been named Britain's worst shopping district 8:30 Jonathon Manning Stagecoach in talks with Government after East Coast Main Line hit \nStagecoach is in talks with the Government over its contract to operate the East Coast Main Line after exceptional charges linked to the loss-making franchise saw profits at the company sink last year. \nThe train and bus operator said pre-tax profit plunged from £104.4m to £17.9m in the year to April 29 after booking an £84.1m exceptional charge to “provide for anticipated losses” under the East Coast contract, which it jointly runs with Virgin. \nStagecoach was also hit by a £44.8m non-cash exceptional impairment linked to the Virgin Trains East Coast franchise. \nChief executive Martin Griffiths said: \nWe are engaged in discussions with the Department for Transport regarding our respective contractual rights and obligations under the current Virgin Trains East Coast franchise and reflecting the reprioritisation of Network Rail’s infrastructure programme. \nHowever, separately we have made financial provisions to reflect the short-term outlook for that business over the next two years, including in view of the weak growth environment affecting the UK rail sector as a whole. \nWe are disappointed to report losses at Virgin Trains East Coast. However, I am confident that we can return the business to profitability. \nTo compound matters, Stagecoach also said that slowing economic growth, the Brexit vote and terrorism have begun to take their toll on the company. \nRevenue is not growing as strongly as anticipated as sales are hit by “increased terrorism concerns and political uncertainty”, as well as “macroeconomic” factors, the firm said. \nRevenue came in at £3.9bn last year compared with £3.8bn. \nThe firm said it is taking action across its bus network, including targeted network, pricing and management changes. \nThe company operates routes such as South West Trains, East Midlands Trains, Virgin Trains East Coast and Virgin Rail Group’s West Coast franchise. It has also been shortlisted for new East Midlands and South Eastern rail franchises and has embarked on a new joint venture with Virgin and SNCF, which is shortlisted to bid for the West Coast Partnership rail franchise. Stagecoach bus in Newcastle Upon Tyne (Photo: Newcastle Chronicle) 8:25 Jonathon Manning Work starts on science park extension that could bring 1,400 jobs to North East \nWork has started on a key project in the expansion of a top science park in the North East . \nThe construction of a 1km road at NETPark near Sedgefield, County Durham, will open up 26 acres of development land at the site where it is hoped up to 1,400 highly-skilled jobs could be created in the next few years. \nThe infrastructure works were made possible thanks to a £5m grant from the North East LEP’s Local Growth Fund, which supports capital investments that promote innovation, economic and skills infrastructure and sustainable transport in the region. \nThe project will be delivered by Lumsden & Carroll, part of the Esh Group, which has its headquarters in County Durham, and should be completed by the end of the year. \nBusiness Durham, the economic development company for County Durham, which manages NETPark on behalf of Durham County Council, also received £3.2m investment from the Local Growth Fund towards the cost of the two new ‘Explorer’ buildings, where it is hoped to attract more high tech companies to the park and to provide a home for firms wanting to scale up. \nCarl Marshall, cabinet member for economic regeneration at Durham County Council, said: \nThe start of the infrastructure works marks another exciting stage in the NETPark development and we are confident that even more businesses will be able to grow and flourish as a result of the expansion. \nThe plans could potentially provide a further 1,400 jobs in our region, providing a boost to the economy and in turn improving the lives of those who live across County Durham. An aerial view of the current NETPark development (Photo: Publicity Pic) 8:20 Jonathon Manning Dixons Carphone sees 10% rise in profits \nElectricals giant Dixons Carphone has batted away fears of a consumer spending slowdown as it said high street conditions were “holding up” following a 10% leap in annual profits. \nThe group reported underlying pre-tax profits of £501m for the year to April 29, up from £457m the previous year. \nLike-for-like sales rose 4% in the UK and Ireland, although Dixons said around 3% of this rise was thanks to sales transferred from closed shops as part of a store overhaul. \nFinance boss Humphrey Singer said the group was “alive to how the consumer is behaving”, but it had seen “no changes yet”. \nChief executive Seb James said: \nWhile the UK consumer environment seems to be holding up for us, there will undoubtedly continue to be changes in the way people buy all of the products that we sell from phones to washing machines. \nChange always represents opportunity, and our job is to find the propositions that keep us compelling to our customers forever. \nBottom-line pre-tax profits rose 47% to £386m, while group-wide like-for-like sales lifted 4%. \nThe Currys and PC World owner said its electricals sales - seen as a retail bellwether - had so far proved resilient to the consumer squeeze being felt by many high street rivals. Dixons Carphone saw its profits rise 10% 8:14", "external_links": [], "published": "2017-06-28T09:55:00.000+03:00", "crawled": "2017-06-28T11:16:28.000+03:00", "highlightTitle": ""}