{"organizations": [], "uuid": "e489240fe94692d7c213b9fd39cecf5653e2976e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30414333/16062217.jpg", "site_section": "http://www.middevongazette.co.uk/news.rss", "section_title": "Devon Live news RSS feed", "url": "http://www.devonlive.com/joyful-and-inclusive-festival-to-celebrate-the-diversity-of-human-life-is-returning-to-north-devon/story-30414333-detail/story.html", "country": "GB", "title": "Joyful and inclusive festival to celebrate the diversity of human...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-28T17:16:00.000+03:00", "replies_count": 0, "uuid": "e489240fe94692d7c213b9fd39cecf5653e2976e"}, "author": "LaurenHarris", "url": "http://www.devonlive.com/joyful-and-inclusive-festival-to-celebrate-the-diversity-of-human-life-is-returning-to-north-devon/story-30414333-detail/story.html", "ord_in_thread": 0, "title": "Joyful and inclusive festival to celebrate the diversity of human...", "locations": [], "entities": {"persons": [{"name": "north devon b", "sentiment": "none"}, {"name": "north devon", "sentiment": "none"}, {"name": "yurt", "sentiment": "none"}, {"name": "samswara", "sentiment": "none"}, {"name": "rebecca jeffery", "sentiment": "none"}, {"name": "niiokaitagoe", "sentiment": "none"}, {"name": "naomi chunilal", "sentiment": "none"}], "locations": [{"name": "north devon sunrise", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "castle green", "sentiment": "none"}, {"name": "barnstaple", "sentiment": "none"}], "organizations": [{"name": "lion star", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Joyful and inclusive festival to celebrate the diversity of human life is returning to North Devon By LaurenHarris | Posted: June 28, 2017 0 COMMENTS SHARES Lionstar perform at 2016 festival Joyful and inclusive festival to celebrate the diversity of human life is return... X \nCopy link to paste in your message / Comments (0) \nA joyful and inclusive festival to celebrate the diversity of human life is returning to North Devon, with live music, fun workshops and children's activities all on offer. \nThe annual North Devon Diversity Festival celebrates the value of human diversity and promotes awareness and understanding of diverse groups living in the area, while encouraging open dialogue on equality and inclusion. \nThe objective is to raise positive awareness and acceptance of different individuals and communities – inclusive of ethnicity, language, culture, sexuality, gender or any other aspect of identity. \nThis year's festival will feature headline act Niiokaitagoe, showcasing a joyful, uplifting African performance of rhythm, dance and melody. A diverse range of world class music from across the globe will appear on two music stages, with performances from reggae and roots fusion band Lion Star, celtic rock band Dambuskers, and sitar and table duo Samswara. \nWhile enjoying the music, you can visit a Mongolian Yurt hosted by world storytellers, take part in a dance and yoga workshop or attend a health and wellbeing therapy session. \nThere will be lots of activities for children as well like wild art sessions, face painting, henna painting and a bouncy castle. The Festival Parade will begin at 1.45pm led by Rebecca Jeffery's African Samba Gule Mamkulu dance group in full costume – with LGBT+ groups, children and Barnstaple carnival groups parading alongside. \nNaomi Chunilal, event organiser and manager of North Devon Sunrise, said: \"As a society, we are facing the reality of recent terrorist attacks, Brexit, world elections and a changing political order, with human beings suffering war, famine, poverty, displacement, discrimination and cruelty across the globe. There has never been a more vital need to promote acceptance, appreciation and respect for human difference and equality in the world we live in. \n\"At North Devon Sunrise, we promote positive awareness and acceptance of human individuality from facilitating diversity workshops for children in schools, providing intensive support for vulnerable individuals who face abuse and discrimination, leading training events for agencies, and organising social diversity events to bring different groups together across the community. \n\"At North Devon Sunrise, we celebrate human diversity and equality – our mission is to include, integrate and value all human difference and our shared humanity. More than 6,000 people came to the festival last year - let's hope the sun shines again!\" \nYou can attend the festival on Saturday, July 8, from 11am to 5pm, at Castle Green in Barnstaple. \nREAD MORE: ", "external_links": [], "published": "2017-06-28T17:16:00.000+03:00", "crawled": "2017-06-28T19:29:32.020+03:00", "highlightTitle": ""}