{"organizations": [], "uuid": "643801ecc5736e08a2c20c9e0eda57f77b747d1e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13253953.ece/ALTERNATES/s1200/IRR_NEC_251115bell_01.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/measures-need-protect-most-vulnerable-13253865", "country": "GB", "domain_rank": 21960, "title": "The measures we need to protect the most vulnerable people in the North East", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-28T20:00:00.000+03:00", "replies_count": 0, "uuid": "643801ecc5736e08a2c20c9e0eda57f77b747d1e"}, "author": "chroniclelive.co.uk", "url": "http://www.chroniclelive.co.uk/news/north-east-news/measures-need-protect-most-vulnerable-13253865", "ord_in_thread": 0, "title": "The measures we need to protect the most vulnerable people in the North East", "locations": [], "entities": {"persons": [{"name": "stephen bell", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "north east north east", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "midlands", "sentiment": "none"}], "organizations": [{"name": "public health", "sentiment": "none"}, {"name": "european social fund", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The measures we need to protect the most vulnerable people in the North East North East charity Changing Lives issues a 10-point charter for the new government to follow Share Stephen Bell of Changing Lives (Photo: Free editorial use) Share Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nFor the most vulnerable in our society, politics can have a life-changing impact. \nWe still don’t know quite what how the new Tory/DUP government will operate but this month we are launching a 10-point charter calling on the next government to do more for the people most at need in our communities – and your help could prove invaluable. \nPoliticians can wield great power over people’s lives so we need to persuade them that supporting our charter can mean the difference between someone having a home or losing one, between someone feeding their family or going hungry, between someone having somewhere to turn to or nowhere to go. \nAt Changing Lives, our vision is for a society that supports the most vulnerable to change their lives for the better. \nOur projects across the North and Midlands support 16,000 people each year. People experiencing hardship that many of us won’t experience and can’t imagine easily. \nThose trying to change and escape extreme situations such as homelessness, sexual exploitation, long-term poverty and domestic violence. \nPeople for whom trauma in their early years have led to lifelong challenges with addiction, poor mental and physical health, long-term unemployment and vulnerability to the worst forms of exploitation. \nWe believe that the next government needs to tackle 10 key issues for the people most at need in our communities and it would be great to have as many people as possible demonstrate support for our vision by sharing the Changing Lives Charter on social media. \nWe want to see a society that supports people to build their self-belief, put past problems behind them, and build a fulfilling life for themselves and their families. \nSadly, for many people battling extreme challenges, this won’t be the case. \nWill you lend your voice to the vulnerable and support our campaign to ask the new government to commit to the following? The Changing Lives Charter 1. Develop a national strategy to end homelessness \nHomelessness isn’t just people sleeping rough on the streets. It is also the ‘hidden homeless’ who sofa-surf, exchange sex for rent, or live in unsafe temporary accommodation. The strategy must be preventative rather than reactive, stopping intergenerational cycles of trauma and poverty which can lead to homelessness, and must work to build the social capital of the most at risk young people. 2. Fund the Homeless Reduction Act \nThe Homelessness Reduction Act is a great start to preventing homelessness but it will only work if it is properly resourced. We call on the government to ensure adequate funding to support this important Act, without diverting funds away from other homelessness services. 3. Bring back housing benefit for young people \nFor young people who are unable to live at home – due to family breakdown, irreconcilable difference with parents, parental poverty or abuse – the cut to housing credit for 18-24- year-olds has been devastating. With nowhere to stay and no recourse to public funds, these young people are increasingly vulnerable to homelessness and sexual exploitation. 4. Make decent housing a right for all, and increase the supply of social rented housing \nThe economics of supply and demand mean that it is not in the market’s interest to supply enough good-quality private rented accommodation to meet demand, otherwise prices would fall. A good supply of social rented housing is essential to stabilise rent levels and ensure a home for everyone who needs it. 5. Prevent further cuts to drug and alcohol services \nIt is recognised that drug and alcohol addiction can have devastating consequences for individuals, families and communities. Further cuts to drug and alcohol contracts should be prevented by ring fencing this in Public Health budgets. Savings could be explored by co-commissioning with mental health services. 6. Commit to the abstinence-based recovery agenda in the new drugs strategy \nRecovery from addiction is possible, enabling people to find meaning for their life outside of dependence. Recovery was at the heart of the 2010 drug strategy and we call upon the government to continue its commitment to the recovery agenda by ensuring that abstinence-based treatment is available for all who face addiction. 7. Appoint a national commissioner for domestic abuse services \nWith two women every week killed by a partner or ex-partner, it could be called a national epidemic. We call on the government to show strong leadership by appointing a national commissioner to oversee local responses and hold Local Authorities to account. Their provision of safe services for survivors, evidence-based programmes for perpetrators, and protection of children is sadly still very necessary. 8. Address the unequal treatment of women in the Criminal Justice System \nAddress the disproportionate, inappropriate and unequal treatment of women in the Criminal Justice System by challenging the use of short prison sentences for non-violent offending. Look outside the CJS to support and address the vulnerabilities and needs of the majority of women who are involved in low-level crimes, stemming the unnecessary flow into custody, which leads to endemic rates of self-inflicted harm and deaths in custody, as well as a devastating impact on children separated from their mothers. 9. Develop a national strategy to support victims of sexual exploitation \nSexual exploitation has hit the headlines in recent years, alerting the public to the surprising and shocking scale of sexual abuse and exploitation prevalent in society. Abuse rings, historic high-profile predators, people trafficking and survival sex are just some examples. We want a national strategy to support victims of sexual exploitation, prevent sexual exploitation, and see this enforced; a strategy based on ‘stage, not age’. 10. Replace funding for employability programmes lost through Brexit \nThe loss of the European Social Fund following Britain’s exit from the European Union will create a massive shortfall in funding for employability support programmes aimed at people that are the most socially excluded and those furthest from the labour market. Replacement funding to invest in those services must be treated as a priority to ensure that Brexit does not mean more long-term unemployment in socially excluded communities. How you can help… \nThe Government needs to act now to ensure the needs and rights of the most vulnerable are prioritised. Until then, with your support, we will continue to provide our lifeline of support. \nYou can help the most vulnerable in your community with a few simple steps. Will you stand up and be counted among our life-changing supporters? If you have 30 seconds… \nSpread the word about our vision for a fairer society. Share our Changing Lives Charter on social media to make more people aware of the situation faced by vulnerable people in our community. If you have 30 minutes… \nSend your MP a copy of our Changing Lives Charter via email or letter and tell them they’re important to you. Simply visit www.writetothem.com to find the representatives for your area. If you have a little longer… \nVisit our website and find out how your unique skills and experience can support vulnerable people near you. We always need volunteers to help people change their lives for the better: www.changing-lives.org.uk/help-us-change-lives Short on time but can spare a few pennies? \nText CLIV45 £5 (or the amount you would like to give) to 70070 to help fund our life-changing work, as we face a real-term decrease in funding from local authorities. Like us on Facebook", "external_links": [], "published": "2017-06-28T20:00:00.000+03:00", "crawled": "2017-06-28T22:36:20.003+03:00", "highlightTitle": ""}