{"organizations": [], "uuid": "3e7b9ed5da62107c313ac92e6d65dceb91eaaae4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article13195646.ece/ALTERNATES/s1200/Brexit.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/brexit-negotiations-what-discussed-what-13195169", "country": "GB", "domain_rank": 21960, "title": "Brexit negotiations: What will be discussed and what does the Government want?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-18T15:00:00.000+03:00", "replies_count": 0, "uuid": "3e7b9ed5da62107c313ac92e6d65dceb91eaaae4"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/brexit-negotiations-what-discussed-what-13195169", "ord_in_thread": 0, "title": "Brexit negotiations: What will be discussed and what does the Government want?", "locations": [], "entities": {"persons": [{"name": "david dav", "sentiment": "neutral"}, {"name": "barnier", "sentiment": "none"}, {"name": "emily thornberry", "sentiment": "none"}, {"name": "david davis", "sentiment": "none"}, {"name": "thornberry", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "john mcdonnell", "sentiment": "none"}, {"name": "michel barnier", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "westminster", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "european union", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}, {"name": "democratic unionist party", "sentiment": "none"}, {"name": "general election", "sentiment": "none"}, {"name": "customs union", "sentiment": "none"}, {"name": "commission", "sentiment": "none"}, {"name": "bbc one’s question time", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "european council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nThe Government will begin official talks about leaving the European Union on Monday. \nDavid Davis, the Secretary of State for Exiting the European Union, will lead the talks at our end, while the EU will be represented by chief negotiator Michel Barnier, a French politician and former EU commissioner. \nThe talks begin even though Prime Minister Theresa May has not yet negotiated a deal with the Democratic Unionist Party at Westminster. \nFollowing the General Election that left the Conservatives without a majority in the House of Commons, Mrs May cannot be sure of leading a stable Government in the long term. \nHere is what you need to know about the negotiations. What happens next? \nDavid Davis is expected to meet Michel Barnier at the Commission’s headquarters in Belgian capital Brussels on Monday but it is not known how long the initial round of talks will last. \nMr Barnier is due to report back to leaders of the 27 other EU states on Thursday to review progress ahead of a two-day summit of the European Council attended by Theresa May which starts later that day. What’s being discussed? The Union flag and the EU flag flying (Photo: PA) \nThe Government wants the talks to talk about a new trade deal, giving the UK “free and frictionless trade” with the EU, at the same time as talking about the process of leaving. This will include discussing whether the UK needs to pay a so-called divorce bill, reflecting its financial obligations to the EU. \nHowever, Brussels has insisted talks on the fee the UK will have to pay must make progress before talks on a future trade agreement can begin. \nBoth sides have made finding a solution to the issue of citizens’ rights a priority. What does the Government want? Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nTheresa May has made it clear she wants a firm break with the EU. \nThis includes leaving the single market, and negotiating a new trade arrangement to replace it, and ending freedom of movement, which currently allows people from any part of the UK to come and work in the EU. \nThe Government also insists the UK must leave the Customs Union, which allows goods to be moved between countries without restriction. This is necessary for the UK to sign new trade deals freely with other countries, but leaving the Customs Union could also create difficulties for firms such as care manufacturers, who buy parts from suppliers across the EU. \nMrs May’s weakened position in the House of Commons as a result of losing her majority has fuelled speculation the Tories would be forced to soften their stance on Brexit. What does Labour say? \nThere has been some confusion about Labour’s position on leaving the single market, but Shadow Chancellor John McDonnell and Shadow Foreign Secretary Emily Thornberry have both confirmed in recent television appearances that the party wants to leave the single market and negotiate a new trade deal instead. \nLabour’s General Election manifesto also stated that the party believes freedom of movement must end. \nSo Labour’s position is very similar to the Government’s. However, Ms Thornberry appeared to suggest on BBC One’s Question Time last Thursday that she supports staying in the Customs Union. \nCriticising the Conservatives, she said: “That kind of ‘let’s turn our back on the Customs Union’ also worries me”. \nLabour focuses on Theresa May’s comment that “no deal is better than a bad deal”, which is a threat to leave the EU without any sort of trade deal if negotiations break down. \nHowever, both parties say their aim is to negotiate a trade deal and then to leave the EU. Read More", "external_links": [], "published": "2017-06-18T15:00:00.000+03:00", "crawled": "2017-06-18T10:15:24.004+03:00", "highlightTitle": ""}