{"organizations": [], "uuid": "3a82908301c2105e3702b60190c27655a891c2a3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article13260761.ece/ALTERNATES/s1200/SGP_NEC_290617AWARDS44JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/countryside-champions-crowned-north-east-13259964", "country": "GB", "domain_rank": 21960, "title": "Countryside champions crowned at North East Rural Awards 2017", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-30T02:01:00.000+03:00", "replies_count": 0, "uuid": "3a82908301c2105e3702b60190c27655a891c2a3"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/countryside-champions-crowned-north-east-13259964", "ord_in_thread": 0, "title": "Countryside champions crowned at North East Rural Awards 2017", "locations": [], "entities": {"persons": [{"name": "leyland", "sentiment": "none"}, {"name": "tony gates", "sentiment": "none"}, {"name": "peter howie like", "sentiment": "none"}, {"name": "wark", "sentiment": "none"}, {"name": "george f. white", "sentiment": "none"}, {"name": "tom comber", "sentiment": "none"}, {"name": "peter howie", "sentiment": "none"}, {"name": "darren thwaites", "sentiment": "none"}, {"name": "dee slade", "sentiment": "none"}, {"name": "christopher leyland  farmer", "sentiment": "none"}, {"name": "susan", "sentiment": "none"}, {"name": "richard", "sentiment": "none"}, {"name": "christopher leyland", "sentiment": "none"}, {"name": "georgina", "sentiment": "none"}], "locations": [{"name": "belford", "sentiment": "none"}, {"name": "macdonald linden hall", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "elwick", "sentiment": "none"}, {"name": "linden hall share get", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "linden hall", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}], "organizations": [{"name": "northumberland national park authority", "sentiment": "none"}, {"name": "d.a. howie & sons", "sentiment": "none"}, {"name": "trinity", "sentiment": "none"}, {"name": "ncj media", "sentiment": "none"}, {"name": "b&k wharf farming", "sentiment": "none"}, {"name": "macdonald linden hall golf & country club", "sentiment": "none"}, {"name": "northumbrian water - b&k wharf farming  rural innovation award", "sentiment": "none"}, {"name": "chronicle", "sentiment": "none"}, {"name": "northumberland national parks", "sentiment": "none"}, {"name": "pickle palace", "sentiment": "none"}, {"name": "trinity mirror north east", "sentiment": "none"}, {"name": "doddington dairy", "sentiment": "none"}, {"name": "nfu mutual", "sentiment": "none"}, {"name": "kirkley college", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "northumberland college", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Countryside champions crowned at North East Rural Awards 2017 Rural businesses and individuals were singled out at the Journal and Chronicle's celebrated awards, held at Linden Hall Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe heroes of the region’s countryside have been celebrated at the North East’s only awards event dedicated to our rural communities. \nMore than 200 people came together to mark the second North East Rural Awards, organised by The Journal and The Chronicle, and held at Linden Hall in Northumberland, where 30 firms and individuals were nominated for prizes. \nThe black-tie event was opened by Darren Thwaites, Trinity Mirror North East editor-in-chief, who hailed the importance of the rural economy. Welcome address from Darren Thwaites, Editor-in-Chief, Trinity mirror North East (Photo: Newcastle Chronicle) \nHe said: “Rural life is such an important part of North East culture - and it’s also a hugely important part of our economy. With the general uncertainty around Brexit and the political environment in general, it’s never been more important to champion rural issues and shout about our achievements. \n“The Journal has always had a strong voice in supporting North East business and the rural community. Events like this cement our commitment to the region and to the issues that matter to you.” \nA total of 10 awards were handed out on the night, with awards singling out the champions within rural start-ups, tourism, food and drink and farming among others. The North East rural awards 2017 at Macdonald Linden Hall, Northumberland (Photo: Newcastle Chronicle) \nAnd a special award was given to honour a true local hero, the late Christopher Leyland. \nThe pioneering Northumberland farmer and entrepreneur died last August at the age 62, having been at the heart of his community for many years with his business ventures and charity work. \nDuring his time, he pioneered a number of business ventures including the production of Haymax, a specialist type of haylage for horses. He also became involved in charity work and led a campaign that resulted in the creation of Bell View, a community-based charity that supported older people in Belford. Christopher Leyland \nSupported by an army of volunteers, Mr Leyland also raised £1.4m towards the construction of a new building to provide care facilities for the elderly in the area. \nMr Leyland’s wife Georgina was at the event to collect the rural hero award on behalf of the family. \nBattlesteads, at Wark, took the tourism and hospitality award. The multi-award winning hotel and restaurant was taken on by Richard and Dee Slade in 2005, who have transformed the former farmstead into a destination renowned for its food, welcoming hospitality and outstanding ‘green’ credentials. \nBest rural start-up award went to The Pickle Palace, the Gateshead business which is successfully addressing the issued of food waste by using otherwise discarded fruit and vegetables to make chutneys and jams. \nThe artisan food and drink trophy was won by Doddington Dairy, which recognised the need to diversify in the late 1990s, triggering the creation of its ice cream business. Ice cream from Doddington Dairy \nMeanwhile Doxford Barns, the result of the transformation of several redundant listed agricultural buildings into a premier wedding and events centre, won the rural diversification award, and ChXout, the service designed to serve the non-human animal DNA testing market, took the rural innovation award. \nThere were also prizes for Coquetdale Holiday Park, which beat stiff competition to win the land base apprenticeship award, and B&K Wharf Farming, winner of the farming and environment award. \nFarmer Peter Howie won the farmer of the year award after the audience heard how his firm D.A. Howie & Sons is the the only dairy farm remaining on the Duke of Northumberland’s Estate. To support the business during tough times for the industry, the company s first diversified into ice creams, and more recently into selling raw milk from their dairy herd. \nThe farm award went to Tom Comber who, together with his wife Susan, has farmed at Elwick, near Belford, since 2007, giving over 70 acres to encourage geese, with a further 38 acres as habitat for breeding waders. \nKeynote speaker was Tony Gates, chief executive of the Northumberland National Park Authority and the man whose main aim is to keep his staff and their activities visible to everyone, whilst encouraging more people to enjoy the landscapes, history and heritage of Northumberland. Winners list in full \nTourism & Hospitality Award, Sponsored by Northumberland National Parks - Battlesteads \nBest Rural Start Up Award, Sponsored by The Journal - The Pickle Palace \nArtisan Food & Drink Award, Sponsored by Macdonald Linden Hall Golf & Country Club - Doddington Dairy \nRural Diversification Award, Sponsored by Northumberland College - Doxford Barns \nFarm Award, Sponsored by George F. White - Tom Comber \nFarming & The Environment Award, Sponsored by Northumbrian Water - B&K Wharf Farming \nRural Innovation Award, Sponsored by Arch - ChXout \nLand Based Apprenticeship Award, Sponsored by Kirkley College - Coquetdale Holiday Park \nRural Hero Award, Announced by NCJ Media - Christopher Leyland \nFarmer of the Year, Sponsored by NFU Mutual - Peter Howie Like us on Facebook", "external_links": [], "published": "2017-06-30T02:01:00.000+03:00", "crawled": "2017-06-30T03:17:23.014+03:00", "highlightTitle": ""}