{"organizations": [], "uuid": "443105fbe115019d40f4a4cebe0f7508a6ade8af", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13199421.ece/ALTERNATES/s1200/Sunderland-v-Stoke-City-Capital-One-Cup-Third-Round.jpg", "site_section": "http://www.thejournal.co.uk/sport/?service=rss", "section_title": "nechronicle - Sport", "url": "http://www.chroniclelive.co.uk/sport/football/transfer-news/sunderlands-9m-ricardo-alarvez-bill-13199403", "country": "GB", "domain_rank": 21960, "title": "Sunderland's £9m Ricardo Alarvez bill for a player they did not want or even sign", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-17T18:50:00.000+03:00", "replies_count": 0, "uuid": "443105fbe115019d40f4a4cebe0f7508a6ade8af"}, "author": "Stuart Rayner", "url": "http://www.chroniclelive.co.uk/sport/football/transfer-news/sunderlands-9m-ricardo-alarvez-bill-13199403", "ord_in_thread": 0, "title": "Sunderland's £9m Ricardo Alarvez bill for a player they did not want or even sign", "locations": [], "entities": {"persons": [{"name": "ricardo alarvez", "sentiment": "negative"}, {"name": "sebastian coates", "sentiment": "none"}, {"name": "derek mcinnes", "sentiment": "none"}, {"name": "newell", "sentiment": "none"}, {"name": "ignacio scocco", "sentiment": "none"}, {"name": "ricky alvarez", "sentiment": "none"}, {"name": "vergini", "sentiment": "none"}, {"name": "gus poyet", "sentiment": "none"}, {"name": "david moyes", "sentiment": "none"}, {"name": "ellis short", "sentiment": "none"}, {"name": "santiago vergini", "sentiment": "none"}, {"name": "poyet", "sentiment": "none"}, {"name": "coates", "sentiment": "none"}, {"name": "moyes", "sentiment": "none"}, {"name": "ustari", "sentiment": "none"}, {"name": "oscar ustari", "sentiment": "none"}, {"name": "ricardo alvarez", "sentiment": "none"}, {"name": "alvarez", "sentiment": "none"}, {"name": "ignaccio scocco", "sentiment": "none"}], "locations": [{"name": "fulham", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}, {"name": "scocco", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "sunderland", "sentiment": "negative"}, {"name": "sport sunderland", "sentiment": "negative"}, {"name": "liverpool", "sentiment": "none"}, {"name": "inter", "sentiment": "none"}, {"name": "aberdeen", "sentiment": "none"}, {"name": "court of arbitration for sport", "sentiment": "none"}, {"name": "sunderland afc", "sentiment": "none"}, {"name": "sampdoria", "sentiment": "none"}, {"name": "invalid email  sunderland", "sentiment": "none"}, {"name": "cas", "sentiment": "none"}, {"name": "inter milan", "sentiment": "none"}, {"name": "premier league", "sentiment": "none"}, {"name": "black cats", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Sport Sunderland's £9m Ricardo Alvarez bill for a player they did not want or even sign According to reports in Italy, the Court of Arbitration for Sport has ordered the Black Cats to pay £9m for former loan flop Ricky Alvarez Share Click to play Tap to play The video will start in 8 Cancel Play now Get Sunderland AFC updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nSunderland have been ordered to pay £9m after their two-year battle over Ricardo Alvarez ended at the Court of Arbitration for Sport (CAS), according to reports in Italy. \nThe Black Cats had tried to get out of a deal to sign the Argentinian playmaker on a permanent basis after an unimpressive season-long loan in 2014-15. Unwanted, Alvarez left at the end of it and later joined Sampdoria, but the Wearsiders have been handed the bill. \nSunderland been budgeting for this, so it represents a missed opportunity more than bad news for a club £110.4m in debt and now out of the lucrative Premier League. \nThe deal which brought Alvarez to the Stadium of Light from Inter Milan included a clause that they would buy him permanently for 10.5m euros at the end of the season if relegation was avoided, which it was. \nIn truth, Alvarez played little part in that. Skilful but too lightweight for England’s rugged top division , his only goal for the club came in an FA Cup replay at Fulham. Of his eight starts only five came in the league and he made nine substitute appearances in all competitions. Ricardo Alvarez (Photo: Getty Images Europe) \nAt the end of the campaign Sunderland tried to back out of the deal, claiming Alvarez was not fit to join them because of a knee problem Inter had not allowed him to have surgery on. Inter did not want their player either. \nRather than lose two years of his career while the matter dragged through the courts, Alvarez, now 29, was allowed to join Sampdoria in January 2016, initially on loan, then as a free agent. He is still with the Genoese club. \nCAS ruled against Sunderland before Christmas and their appeal has finally been rejected. \nArguing over the matter has cost the Black Cats a lot more than had they simply honoured the agreement. Apart from the legal costs involved in fighting a court case against an Italian club in Switzerland, Brexit means the original fee is more expensive now because of the weaker pound. Today it equates to more than £9m. Read More Sunderland put 'time limit' on sale of club - and admit it is holding up new manager search \nWith massive debts to service, it is hard to say whether the issue stopped the Black Cats spending money in the January transfer window. When he joined last summer, before the original CAS hearing, then-manager David Moyes was under the impression he would have funds available mid-season but instead the club turned a £6.5m net profit on transfer fees at a time when the squad badly needed strengthening. \nHowever another thing that changed in that time was that owner-chairman Ellis Short began actively looking to sell the club. That is ongoing, with Sunderland revealing on Friday they are talking to a number of interested parties. \nThey acknowledged the potential sale is frustrating their managerial search and warned would-be buyers they will take the club off the market if negotiations drag on too long. The uncertainty was understood to be a factor when Derek McInnes declined to leave Aberdeen and become Moyes’ replacement. \nAlvarez was one of a number of South Americans signed by Uruguayan coach Gus Poyet , along with Santiago Vergini, Sebastian Coates, Oscar Ustari and Ignaccio Scocco. \nVergini was on loan for 18 months before the club were obliged to buy him permanently and he too never played for them again before being sold at a loss. Read More Ignacio Scocco's fall-out with Newell's Old Boys could finally see Sunderland get their money back \nCoates’ loan from Liverpool became permanent in the summer of 2015 and he was sold in the next window. \nReserve goalkeeper Ustari never made a first-team appearance and it was revealed this week Sunderland are still owed nearly £500,000 for the 2014 sale of Scocco. \nSuch calamitous mismanagement – not unique to Poyet’s time or to South American signings – has become a millstone around the club’s neck. Like us on Facebook", "external_links": [], "published": "2017-06-17T18:50:00.000+03:00", "crawled": "2017-06-17T14:10:46.000+03:00", "highlightTitle": ""}