{"organizations": [], "uuid": "405a13c522f8a4775e4e0812735987908fdc329e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13214442.ece/ALTERNATES/s1200/General-Election-2017-aftermath.jpg", "site_section": "", "section_title": "", "url": "http://www.chroniclelive.co.uk/news/north-east-news/queens-speech-theresa-backs-down-13214013", "country": "IE", "domain_rank": 21960, "title": "Queen's Speech - Theresa May backs down on plans to axe free school meals - Chronicle Live", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.257, "site_type": "news", "published": "2017-06-21T05:30:00.000+03:00", "replies_count": 0, "uuid": "405a13c522f8a4775e4e0812735987908fdc329e"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/queens-speech-theresa-backs-down-13214013", "ord_in_thread": 0, "title": "Queen's Speech - Theresa May backs down on plans to axe free school meals - Chronicle Live", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "hammond", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "bill", "sentiment": "none"}, {"name": "elizabeth ii", "sentiment": "none"}, {"name": "abuse bill", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}, {"name": "philip hammond", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "crewe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}], "organizations": [{"name": "house of commons", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "house of lords", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "society of motor manufacturers and traders", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "queen’s speech", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nTheresa May has backed down over plans to axe free school meals for every child aged four to seven, with the measure cut from Wednesday’s Queen’s Speech. \nThe Conservative general election manifesto set out plans to end universal free school means for infants, and to return to the old system in which only pupils from poorer families got the meals for free. \nBut the Government, led by Prime Minister Theresa May , has ditched the policy, reportedly because it fears it would not be able to win a vote on the issue in the House of Commons. \nIt would have changing the Children and Families Act. But the Conservatives do not have a majority of MPs following the June 8 general election , and it would require only a small rebellion by Tories for the Government to lose a vote on the issue. \nThe Queen’s Speech looks set to be dominated by Brexit , even though the Government is promising a “substantial legislative programme” which will promote economic growth across the country and reduce inequality. Prime Minister Theresa May (Photo: PA) \nIt will set out the Government’s plans for the next two years, rather than just one year as usual, and Ministers say this is to give MPs enough time to consider the complex laws required to make Britain to leave the EU. \nMeasures to be confirmed include the Repeal Bill, which will convert existing EU law into UK statute so that it remains in effect once we quit the EU. \nThere will also be new laws Bills to cut the cost of insuring your car; a draft Domestic Violence and Abuse Bill, in line with the Conservative manifesto commitment to tackle domestic abuse and violence, and a draft Tenants’ Fees Bill, which will ban landlords from charging tenants “letting fees”. \nCarmakers will receive a boost, with legislation to encourage motorists to buy electric cars. \nThere will also be legislation to continue the construction of the HS2 high speed rail line. Laws already in place authorise construction of the line between London and Birmingham, and the Queen’s Speech will announce legislation allowing it to be extended from Birmingham to Crewe. \nAnd a Bill will encourage the growing spaceflight industry, making it easier UK companies to compete in an international market and generate highly-skilled jobs. \nMrs May said: “This Queen’s Speech is about recognising and grasping the opportunities that lie ahead for the United Kingdom as we leave the European Union. It is about delivering a Brexit deal that works for all parts of the UK while building a stronger, fairer country by strengthening our economy, tackling injustice and promoting opportunity and aspiration. \n“The election result was not the one I hoped for, but this Government will respond with humility and resolve to the message the electorate sent. We will work hard every day to gain the trust and confidence of the British people, making their priorities our priorities,” \nMrs May said the Government would continue to increase the National Living Wage, to bring down the deficit and to develop an industrial strategy designed to spread economic success across the UK. \nShe said: “At the same time, much work needs to be done to build a fairer society where people can go as far as their talents will take them and no one is held back because of their background.” Queen Elizabeth II looks on in the House of Lords (Photo: Getty Images Europe) \nWhile the Queen’s Speech itself looks likely to be short on measures, Chancellor Philip Hammond signalled a change in approach for the Government in his annual “Mansion House” speech to banking and financial service industry leaders. Read More Labour's North East heartland was only English region to see a vote swing to the Tories \nHe suggested the country was sick of spending cuts and people were concerned about the state of schools and the NHS. \nMr Hammond said: “Travelling the country in the general election campaign I’ve had hundreds of conversations reflecting the challenges and issues that people face in their daily lives, fears about job security; about wage levels; the need for good schools for their children; a well-functioning health service; decent care for elderly relatives; or access to the housing market. \n“And it’s clear, as many of my colleagues have noted, that Britain is weary after seven years of hard slog repairing the damage of the great recession.” \nCarmakers have urged the Government to agree a temporary deal with the EU, to ensure there is no chance of leaving the EU without a deal in 2019. \nThe Society of Motor Manufacturers and Traders, which represents the UK automotive industry at home and abroad, said it feared the country was highly unlikely to reach a final agreement with the EU by the March 2019 deadline. \nAnd this could lead to a “cliff edge”, where tariff-free trade with the EU was suddenly ended, with disastrous results for carmakers. \nThe Society urged Ministers to agree a transitional Brexit deal to protect the future of the UK car industry. Like us on Facebook ", "external_links": [], "published": "2017-06-21T05:30:00.000+03:00", "crawled": "2017-06-21T01:31:16.000+03:00", "highlightTitle": ""}