{"organizations": [], "uuid": "847c66878b1ca21b271ec6d7ac6d7898c6e040fc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12802546.ece/ALTERNATES/s1200/SGP_NEC_080317TYNE01JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/local-news/north-east-news-live-latest-13181916", "country": "GB", "domain_rank": 21960, "title": "North East news LIVE: Latest breaking news, sport, weather, traffic and travel", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-14T13:30:00.000+03:00", "replies_count": 0, "uuid": "847c66878b1ca21b271ec6d7ac6d7898c6e040fc"}, "author": "Katie Collings", "url": "http://www.chroniclelive.co.uk/news/local-news/north-east-news-live-latest-13181916", "ord_in_thread": 0, "title": "North East news LIVE: Latest breaking news, sport, weather, traffic and travel", "locations": [], "entities": {"persons": [{"name": "owen kerry", "sentiment": "negative"}, {"name": "katie collings owen kerry", "sentiment": "negative"}, {"name": "hayden", "sentiment": "none"}, {"name": "cahill", "sentiment": "none"}, {"name": "owen", "sentiment": "none"}, {"name": "hayden brown", "sentiment": "none"}, {"name": "lyndsey harper", "sentiment": "none"}, {"name": "brian cahill", "sentiment": "none"}], "locations": [], "organizations": [{"name": "cramlington working men’s club", "sentiment": "none"}, {"name": "newcastle crown court", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "\nThere has been a crash on the southbound A1, between junctions 62 and 61: \nWe’ll have more updates as information becomes available. 16:27 Tom Eden Central Motorway travel times \nHere’s a handy guide about the latest travel times for Central Motorway users, as we approach rush hour: Politics Tom Eden Lib Dem quits over 'leader's views' \nA senior Lib Dem frontbench spokesman has resigned from his role as shadow secretary of state for the Home Office citing “concerns about the leader’s views on various issues”. (Photo: Handout) \nLord Paddick, who was the most senior openly gay police officer in the UK serving as Deputy Assistant Commissioner of the Metropolitan Police Service from 2003 to 2007, announced his departure on Twitter. \nThe Lib Dem peer, who stood as the Lib Dem London mayoral candidate in 2008 and 2012, tweeted: \nA Lib Dem spokesperson said: “We thank Brian for his service.”Party leader Tim Farron faced criticism during the General Election campaign for failing to answer questions about his position on homosexuality. \nHe made clear he supported equal marriage and LGBT rights, but in a broadcast interview did not say whether or not it was a sin. \nAfter days of pressure to clarify his stance on the issue, Mr Farron made clear he does not believe gay sex is a sin. London fire Tom Eden 18 people now in 'critical care' \nLondon Ambulance now says there are 18 people in critical care, down from the figure of 20 quoted earlier. London Fire Tom Eden Missing schoolgirl \nThe family of a 12-year-old girl missing following the Grenfell Tower blaze have issued a plea for her to be found. (Photo: PA) \nSchoolgirl Jessica Urbano was on the 20th floor of the tower block when she was separated from her family, who have put out numerous posts on social media to find her. \nAunt Ana Ospina, a make-up artist, told the Press Association: \n“She last spoke to her mum when she borrowed a phone and told her she was on the stairs with other people. \n“We then have had unconfirmed reports/sightings of her outside of the flats and also being put into an ambulance, but we have checked hospitals and no news. \n“She hasn’t been found yet. We are doing a second visit to the hospitals and also the centres in and around Latimer Road.” \nThe Metropolitan Police said anyone with concerns or information about people affected by the fire should call the Casualty Bureau on 0800 0961 233. 16:06 Tom Eden Ireland's new leader \nLeo Varadkar, Ireland’s new premier, has vowed to lead a government of “the new European centre”. (Photo: Getty Images Europe) \nThe son of an immigrant Indian doctor and Irish nurse was formally elected the country’s youngest and first gay Taoiseach after securing 57 votes against 50 in the Irish parliament. \nSome 45 parliamentarians abstained in the vote. \nAccepting his elevation to the most powerful office in the country, the 38-year-old leader of the minority ruling Fine Gael party rejected his characterisation as a right-winger. \nHe said: \n“The government I lead will not be one of left or right. \n“While others in the house may be obsessed with the debates of the 1980s, I can assure you I am not and nor will my government. \n“We will be focused on the solutions of the 21st century and the future. \n“So the government I lead will be one of the new European centre, as we seek to build a republic of opportunity, and that is a republic in which every citizen gets a fair go and has the opportunity to succeed and in which every part of the country has a chance to share in our prosperity.” \nA qualified doctor who has held three Cabinet posts, Mr Varadkar only revealed he was gay months before Ireland, once regarded among Europe’s most socially conservative states, became the first country in the world to back same-sex marriage in a referendum in May 2015. \nHis parents, Ashok and Miriam, and partner Matt Barrett, also a medic, were among the guests in the Dail’s distinguished visitors’ gallery for his election. \nPaying tribute to his predecessor, Enda Kenny, who resigned on Tuesday, Mr Varadkar said: \n“I have no doubt, only for him, this country as we know it would not be here today. \n“On a personal note, I would like to add, were it not for Enda Kenny I have no doubt I would not be standing here in this seat today.” Economy Tom Eden Inflation hits 2.9% \nThe Bank of England is expected to keep interest rates on hold on Thursday despite mounting pressure to take action as households suffer amid soaring inflation. (Photo: PA) \nThis month’s decision comes in the wake of official figures showing inflation hit 2.9% in May - its highest level in nearly four years and far higher than expected. \nThe figures laid bare the squeeze on household finances as inflation outstrips wage growth, with CPI having been sent soaring as the Brexit-hit pound has pushed up the price of imported goods and energy. \nBut economists believe the Monetary Policy Committee (MPC) will keep rates at 0.25% for some time as it continues to look through above-target inflation for the good of the economy. BREAKING Woman robbed at knifepoint in Newcastle \nA woman was robbed at knifepoint by two men in a Newcastle alleyway this morning. \nThe 26-year-old was walking down an alleyway on Ethel Street at approximately 11am when she was confronted by two tracksuit-clad men, one of whom was brandishing a knife. \nThe men threatened the victim with the blade, demanding she hand over money, before they fled the scene. \nOfficers investigating the knifepoint robbery are now appealing for witnesses. \nA Northumbria Police spokesman said the crime happened between 11am and 11.15am, and added: \n“A 26-year-old woman was walking in an alleyway when someone shouted at her. \n“When she turned around she was confronted by two men, one of whom was carrying a knife. The men, who were both wearing tracksuit bottoms, demanded money and threatened her with the knife before making off with a sum of cash. \n“The victim was left shocked but unhurt.” \nPolice are appealing for anyone who was in the area at the time who might have seen anything, or anyone else with any information to contact police on 101 quoting the reference number 452 of 14/06/17. BREXIT Tom Eden No deal 'the worst outcome for the UK' \nThe British aerospace industry has rejected Theresa May’s Brexit mantra of “no deal is better than a bad deal”, just days after the Prime Minister’s General Election humiliation. \nIn a further sign that businesses and industry bodies feel more emboldened since the Conservative Party lost its majority last week, trade body ADS warned that “no deal is the worst outcome for the UK”. \nADS, which represents the aerospace, defence, security and space sectors, added that since the “political context” has changed, a fresh approach to Brexit is needed for the £31.8 billion sector. \nChief executive Paul Everitt said: \n“The political context in the UK and elsewhere in Europe has changed. \n“Last week, the country signalled it wanted a more collaborative approach. The Government needs to build a strong consensus on the priorities and options for a successful Brexit. \n“No deal is the worst outcome for the UK and Europe. Finding the best agreement will require compromise and pragmatic decisions by the UK and its European partners.” \nTheresa May has repeatedly said that “no deal is better than a bad deal” when it comes to Brexit negotiations, raising the prospect of the UK having to fall back on WTO trading rules as it crashes out of the single market and customs union. \nBut ADS is calling for all options to remain on the table, including access to the single market, membership of the customs union, remaining within European regulatory regimes and examining any controls on freedom of movement. London Fire Tom Eden Want to volunteer or donate? \nThe Royal Borough of Kensington and Chelsea had advice for people who want to donate or volunteer to help people affected by the fire. \nIt said donations can be dropped off locally at the Salvation Army at 205 Portobello Road. \nPeople who want to volunteer with the support effort are asked to contact 020 7361 3008. London fire Corbyn suggests spending cuts could have contributed to fire \nLabour leader Jeremy Corbyn has suggested spending cuts could have contributed to the deadly fire. (Photo: Gurbuz Binici /Getty Images) \nHe said “searching questions” need to be asked about what happened at the west London tower block, adding: “If you deny local authorities the funding they need, then there is a price that’s paid.” \nMr Corbyn told LBC Radio that calls for sprinklers to be installed in high-rise buildings after a fatal fire at Lakanal House in south London in 2009 had not been heeded. \nHe said: \n“Harriet Harman, who is the MP for Camberwell and Peckham, raised all these issues after that fire and ... demanded that sprinklers should be fitted to all of these buildings. \n“I suspect they have not been in many places. I don’t know all of the details for the whole country but, if you deny local authorities the funding they need, then there is a price to pay that’s paid by the lack of safety facilities all over the country. \n“I think there needs to be some very searching questions asked as quickly as possible in the aftermath of this fire.” International News Tom Eden American politician shot \nA top Republican politician has been shot by a rifle-wielding gunman at a congressional baseball practice just outside of Washington. \nHouse of Representatives majority whip Steve Scalise was shot and several other people were wounded, including a congressional staff member and law enforcement personnel. \nCapitol Police said officers who were part of Mr Scalise’s security detail returned fire and wounded the shooter, who was taken into custody. \nMr Scalise is in a stable condition at George Washington University Hospital, according to one congressional aide. \nHis injuries were not believed to be life-threatening. \nPresident Donald Trump said he was “deeply saddened by this tragedy” and was monitoring developments. \nThe shooting occurred at a baseball field in Alexandria, Virginia, where politicians and others were gathered for a morning practice. \n“We were doing batting practice,” said Senator Jeff Flake, of Arizona. \n“All of a sudden we heard a very loud shot. The gunman was over by the third base dugout with a clear view of the field.” \nHe said the gunman had “a rifle of some sort ... a lot of ammo”. \nMike Bishop, Republican Representative for Michigan, said Mr Scalise was at second base when he was shot. \n“I was looking right at him,” Mr Bishop told Detroit radio station WWJ. “He was a sitting duck.” \nRepresentative Mo Brooks, an Alabama Republican, said two law enforcement officers were believed to be among the others shot. \nMr Brooks said that Mr Scalise, 51, was down on the ground with what Mr Brooks described as “a hip wound”. \nThe Alabama politician said his colleague “crawled into the outfield, leaving a trail of blood”. 14:33 Katie Collings Shearer takes financial advisor to High Court \nToon legend Alan Shearer has taken High Court action after claiming that he was given “negligent” financial advice. Alan Shearer says the Premier League is better place now Newcastle are back (Photo: Newcastle Chronicle) \nA judge was told on Wednesday that the 46-year-old former Newcastle and England striker had sued a number of now-defunct financial advice businesses. \nThe Match Of The Day pundit , was at the start of a High Court hearing, in London, where Gerard McMeel a lawyer heading Shearer’s legal team outlined claims. \nMr McMeel told Mr Justice Leggatt that Shearer’s claims related to pension investments. \nHe told the judge Shearer claimed he had been given “negligent financial advice”. \nHe indicated that Shearer’s claims were being contested. \nOne business Shearer is suing was named on court lists as Kevin Neal Associates - a company now in liquidation. \nLawyers said the trial would run into next week. \nThey say Shearer is due to give evidence on Thursday. ", "external_links": [], "published": "2017-06-14T13:30:00.000+03:00", "crawled": "2017-06-14T09:08:59.000+03:00", "highlightTitle": ""}