{"organizations": [], "uuid": "b271215b24eccff6d2b5faebe9e49e5cae94629f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13217745.ece/ALTERNATES/s1200/State-Opening-of-Parliament-2017.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/theresa-backtracks-pledge-recruit-10000-13217349", "country": "GB", "domain_rank": 21960, "title": "Theresa May backtracks on pledge to recruit 10,000 more mental health staff", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-21T20:23:00.000+03:00", "replies_count": 0, "uuid": "b271215b24eccff6d2b5faebe9e49e5cae94629f"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/theresa-backtracks-pledge-recruit-10000-13217349", "ord_in_thread": 0, "title": "Theresa May backtracks on pledge to recruit 10,000 more mental health staff", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "a&e", "sentiment": "none"}, {"name": "queen’s speech", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "mental health bill", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Theresa May backtracks on pledge to recruit 10,000 more mental health staff The Conservative manifesto promised 10,000 extra mental health professionals, but that's not included in the Government's plans Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily   Thank you for subscribing!   \nPrime Minister Theresa May has backtracked on a promise to recruit 10,000 more mental health professionals. \nThe promise was included in the Conservative general election manifesto. \nBut there was no mention of it in Wednesday’s Queen’s Speech, which set out the Government’s plans for the next two years. \nThe Speech, and a lengthy document published by the Government to accompany it, does include a detailed report on plans to improve mental health services. Prime Minister Theresa May (Photo: PA) \nHowever, the promise of 10,000 extra qualified staff is missing. \nThe Conservative general election manifesto , published in the run-up to the June 8 poll, said: “We will continue to rectify the injustice suffered by those with mental health problems by ensuring that they get the care and support they deserve. \n“So we will make sure there is more support in every part of the country by recruiting up to 10,000 more mental health professionals.” \nBut the Government’s plans, published today, simply say: “The Government will continue to invest in new and better services across the whole spectrum of mental health conditions. Read More How you could keep your rights as an EU citizen after Brexit \n“In particular, making further improvements in early intervention, investing in community services and expanding access to 24/7 crisis care support both in the community and in A&E” \nToday’s Government document says spending on mental health has increased to a record £11.4 billion in 2016/17, with a further investment of £1 billion planned every year by 2020/21. Prime Minister Theresa May and opposition Labour Party leader Jeremy Corbyn (Photo: Getty Images Europe) \nIt continues: “The further £1 billion a year committed by 2020/21 for mental health started to enter the system in April 2017. \n“This will improve services - putting Crisis Resolution and Home Treatment teams on a 24/7 footing, making more mental health response teams available in A&E, and improving perinatal mental health.” \nWhile it does promise extra money and better services, the high-profile figure of 10,000 new staff is missing. Read More Queen's Speech - Theresa May backs down on plans to axe free school meals \nThe manifesto also promised that the Government would introduce new laws to improve mental health services. \nIt said the Conservatives would introduce “the first new Mental Health Bill for thirty years to put parity of esteem at the heart of treatment and end the stigma of mental illness once and for all.” \nBut the Queen’s Speech doesn’t actually include a new Mental Health Bill. \nInstead, it says: “The Government will now begin to consider whether further reform of mental health legislation is necessary”. Read More \nThis could include changes to the Mental health Act of 1983, the Queen’s Speech document says. \nIt says the Government’s plans for the next two years include: \nLooking at why rates of people detained by police under the Mental Health Act are increasing. \nExamining the disproportionate number of people from certain ethnic backgrounds detained under the Act. \nConsidering how the rights of family members to get information about the mental health and treatment of loved ones can be improved. \nEnsuring those with mental ill health are treated fairly, protected from discrimination and employers fulfil their responsibilities effectively. Read More", "external_links": [], "published": "2017-06-21T20:23:00.000+03:00", "crawled": "2017-06-21T16:07:37.020+03:00", "highlightTitle": ""}