{"organizations": [], "uuid": "b1728563c83abfff1562c2fbf6e4c545ce020bc2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article13146117.ece/ALTERNATES/s1200/Ukipper.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/you-should-vote-ukip-general-13145472", "country": "GB", "domain_rank": 21960, "title": "Why you should vote UKIP at the General Election - in the party's own words", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-08T01:00:00.000+03:00", "replies_count": 0, "uuid": "b1728563c83abfff1562c2fbf6e4c545ce020bc2"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/you-should-vote-ukip-general-13145472", "ord_in_thread": 0, "title": "Why you should vote UKIP at the General Election - in the party's own words", "locations": [], "entities": {"persons": [{"name": "bryan foster", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "greenbelt", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "berwick", "sentiment": "none"}, {"name": "teesside", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "general election", "sentiment": "negative"}, {"name": "ukip", "sentiment": "negative"}, {"name": "sunderland west", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "university", "sentiment": "none"}, {"name": "house of lords", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nWith the June 8 General Election fast approaching, we have asked North East political figures from the five main parties to tell us why people should vote for them and explain what they will do for the region. \nToday it is the turn of Bryan Foster, UKIP candidate for Washington and Sunderland West. \nThe biggest issue facing our country is Brexit . A successful deal will ensure that we will impact on the key issues of immigration, the economy, our democracy and our judicial system. \nControl of who comes in and out of the country gives us a chance to properly manage the number of people in the country. \nThis allows us to forward plan our public services, including the NHS , care of the elderly, mental health, education, etc so that we have sufficient staff, properly paid, properly equipped, to meet that demand and eventually improve services. \nIt also releases the money to invest in new buildings, new transport infrastructure, invest properly in our utilities, clean up our rivers and seas and protect our environment. \nThese all impact on the North East, which suffers from under-investment in many of these key areas. \nThe manifesto provides some radical solutions to problems, which we in the North East have faced for years under successive Labour, Tory/Lib Dem and Tory Governments. Bryan Foster \nThe UKIP pledge to invest £11bn into the NHS and social care will directly improve the patients, elderly and vulnerable but it will also help provide jobs for doctors, nurses, technicians, carers recruited and trained in the UK. \nRaising the threshold for paying income tax to £13,500 per annum, cutting tax for middle earners, scrapping the licence fees and cutting VAT on household bills will make all of our lives a bit easier and put more money back into our economy. \nPensioner incomes will be protected and 100,000 homes will be built for younger people, but NOT on Greenbelt land. Disability and carer’s benefits will be protected. \nWith these initiatives UKIP are bringing forward improved and sometimes innovative ideas for helping ordinary working people – the sort of people Labour used to represent. These proposals are independently costed, with funding identified and realistic as opposed to the fantastical, unfunded plans set out by Corbyn. \nMany of our young people join the Forces, UKIP will put a huge amount of additional money into our defence and will fund 20,000 more police officers, 7,000 more prison officers and 4,000 more border staff. These are all initiatives that will provide job opportunities and make our country safer. \nTrade deals with other major growing and vibrant economies will secure economic growth, bring more jobs and thriving business and a cut in business rates for small businesses will help our local economy to expand, but at the same time UKIP plan to crack down on corporate tax dodging by the big companies. There will also be a “Buy British” campaign linked with the removal of unnecessary EU regulation from the 88% of the economy that does not trade with the EU. \nUKIP has a unique policy for reviving our coastal communities and villages, which will help the whole coastline from Berwick down to Teesside. No other party is promising this, they have forgotten the North East, until of course they want our votes. \nThere are many other UKIP ideas that will impact on the North East, ideas about encouraging integration by removing some of the barriers, controlling immigration, removal of some University tuition fees, more transparency in family courts and reforming our Democracy by creating an English Parliament, abolishing the House of Lords and introducing a fairer voting system. \nUKIP have a policy of ‘localism’ which means keeping the real power in the hands of local people, not the self serving councillors elected under the current ‘First Past The Post’, but Councillors who are elected under the new voting system who really reflect the views of the community they serve. Read More ", "external_links": [], "published": "2017-06-08T01:00:00.000+03:00", "crawled": "2017-06-07T20:23:32.002+03:00", "highlightTitle": ""}