{"organizations": [], "uuid": "9bc7048234f490d10dbfa6cb057b8ad10123379d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13215395.ece/ALTERNATES/s1200/prince.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/prince-william-turns-35-take-13215205", "country": "GB", "domain_rank": 21960, "title": "Prince William turns 35 - take a look at his life in pictures", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-21T16:40:00.000+03:00", "replies_count": 0, "uuid": "9bc7048234f490d10dbfa6cb057b8ad10123379d"}, "author": "Agency Staff", "url": "http://www.chroniclelive.co.uk/news/north-east-news/prince-william-turns-35-take-13215205", "ord_in_thread": 0, "title": "Prince William turns 35 - take a look at his life in pictures", "locations": [], "entities": {"persons": [{"name": "william", "sentiment": "negative"}, {"name": "diana", "sentiment": "none"}, {"name": "charlotte", "sentiment": "none"}, {"name": "kate", "sentiment": "none"}, {"name": "harry", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "kate middleton", "sentiment": "none"}, {"name": "william arthur philip louis", "sentiment": "none"}, {"name": "royal ascot", "sentiment": "none"}, {"name": "george", "sentiment": "none"}, {"name": "david", "sentiment": "none"}, {"name": "prince george", "sentiment": "none"}, {"name": "anmer hall", "sentiment": "none"}], "locations": [{"name": "kensington palace", "sentiment": "none"}, {"name": "charlotte", "sentiment": "none"}, {"name": "warsaw", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "wales", "sentiment": "none"}, {"name": "hamburg", "sentiment": "none"}, {"name": "belize", "sentiment": "none"}, {"name": "cambridge", "sentiment": "none"}, {"name": "wokingham", "sentiment": "none"}, {"name": "ludgrove", "sentiment": "none"}, {"name": "new zealand", "sentiment": "none"}, {"name": "paddington", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "poland", "sentiment": "none"}, {"name": "edinburgh", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "chile", "sentiment": "none"}, {"name": "linkin park", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "norfolk", "sentiment": "none"}, {"name": "st andrews", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "st mary’s hospital", "sentiment": "none"}, {"name": "berkshire", "sentiment": "none"}, {"name": "raleigh international", "sentiment": "none"}, {"name": "westminster abbey", "sentiment": "none"}, {"name": "duke", "sentiment": "none"}, {"name": "coldplay", "sentiment": "none"}, {"name": "commonwealth office", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "ludgrove", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nThe Duke of Cambridge is celebrating his 35th birthday. \nWilliam, who attended Royal Ascot with the Duchess of Cambridge on Tuesday, is expected to spend the day privately with Kate and their children Prince George and Princess Charlotte. \nThis year, the Duke is making some major changes to his life by becoming a full-time royal . \nHe is due to finish his job as an air ambulance helicopter pilot later in the summer as the Cambridges leave the countryside for a life in the city. \nWith Prince George starting school in London in September, their main home will be Kensington Palace, but Anmer Hall, the family’s 10-bedroom mansion in Norfolk, will still be used for weekend retreats. \nWilliam will be joining the royals in stepping up to his assist his grandmother the Queen when the Duke of Edinburgh retires from public duties in the autumn. \nNext month, the Duke and Duchess will pay a five-day official visit to Poland and Germany - visiting Warsaw and Hamburg. \nThe trip - at the request of the Foreign and Commonwealth Office - is being seen as another Brexit diplomacy tour by the royals, to help improve the UK’s relations with Europe as it leaves the EU. Prince William (Photo: PA/Getty) \nHere are some facts about William: \n• Prince William Arthur Philip Louis of Wales was born second in line to the throne at St Mary’s Hospital, Paddington, at 9.03pm on June 21 1982. He weighed 7lb 1 1/2 oz. \n• At just nine months old, he accompanied his parents the Prince and Princess of Wales on their six-week official visit to Australia and New Zealand, a move which was a break from royal tradition. \n• He became a boarder when he was just eight, joining Ludgrove, a preparatory school near Wokingham, Berkshire, with fees of £2,100 a term. \n• He was a rugby and hockey team captain at the prep school. \n• His first official public engagement was on March 1 1991, when he joined his parents on a trip to Wales on St David’s Day. \n• In 1991, he was hit on the side of the head with a golf club while playing with a friend on the putting green at Ludgrove leading to his “Harry Potter” scar. He was given 24 stitches after undergoing a 72-minute operation. \n• When his mother Diana, Princess of Wales died suddenly in a car crash in 1997, William was just 15. He walked behind her coffin during a funeral procession through London and has since said: “It was one of the hardest things I have ever done.” \n• After leaving school, he went on a gap year which included jungle training in Belize with the Welsh Guards and a stint with Raleigh International in Chile. William was shown tackling domestic chores - making him possibly the first potential king to be pictured in rubber gloves scrubbing a toilet floor. \n• When Prince Harry dressed as a Nazi at a fancy dress party in 2005, William went as a lion. \n• He missed his freshers’ week at university in St Andrews to avoid the spotlight. Read More Queen's Speech - Theresa May backs down on plans to axe free school meals \n• He found it difficult to adjust at university but switched from history of art to geography, got used to the isolated town and began dating flatmate Kate Middleton. \n• William and Kate dated for more than eight years before marrying at Westminster Abbey in July 2011. William was made the Duke of Cambridge by the Queen on the morning of his wedding. \n• The Duke has said he can now talk more freely about his mother Diana as the 20th anniversary of her death approaches. He told GQ magazine: “I am in a better place about it than I have been for a long time, where I can talk about her more openly, talk about her more honestly, and I can remember her better, and publicly talk about her better. It has taken me almost 20 years to get to that stage.” \n• William wants to make sure George and Charlotte do not become materialistic. “I would like them to grow up with more simple aspirations. I think there’s a lot of huge aspirations and people living with an enormous amount of stuff that they don’t necessarily need,” he said. \n• He is a fan of Coldplay and Linkin Park. \n• William is 6ft 3in tall. Like us on Facebook", "external_links": [], "published": "2017-06-21T16:40:00.000+03:00", "crawled": "2017-06-21T11:55:07.005+03:00", "highlightTitle": ""}