{"organizations": [], "uuid": "b250355bef77a72083a01385b1b70c00b36cbe1c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13137736.ece/ALTERNATES/s1200/JS71264860.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13137741", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Crowdfunding giant Seedrs' CEO rounds on Tory skilled migration plan", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-05T15:02:00.000+03:00", "replies_count": 0, "uuid": "b250355bef77a72083a01385b1b70c00b36cbe1c"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13137741", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Crowdfunding giant Seedrs' CEO rounds on Tory skilled migration plan", "locations": [], "entities": {"persons": [{"name": "jeff lynn", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "lynn", "sentiment": "none"}], "locations": [{"name": "berlin", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "dublin", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "tory", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "conservative", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford North East aviation specialist CAV set to fly following investment by London firm \nNorth East aviation specialist CAV is set to take off after London investors ploughed significant investment into the manufacturer . \nCounty Durham-based CAV operates two divisions, Advanced Technologies and Ice Protection, which designs and manufactures ice protection systems for the aviation industry. \nNow London-based Baird Capital – the direct investment arm of global financial services firm Robert W. Baird & Co – has completed a transaction which has seen them make a “significant” investment in CAV. \nHeadquartered in Consett, CAV is a leading provider of ice protection and drag reduction technology to the aviation, commercial aerospace and defence markets worldwide. \nFollowing the substantial investment from Baird Capital, which has not been disclosed, the ice protection and advanced technology businesses are now planning further innovation and growth. \nAs part of the transaction Baird Capital managing directors James Benfield and Dennis Hall will join the CAV board of directors. CAV in Consett has received significant investment from a London firm to help it grow (Photo: CAV) 8.37 Coreena Ford How Nicky Hunter is launching Vardags' Newcastle office - a law firm for High Net Worth earners in the North East \nNicky Hunter knows all about building businesses. Her great-great grandfather launched Swan Hunter, a firm synonymous with the region’s rich shipbuilding history. \nNow Nicky is turning her hand to building - setting up the Newcastle office of Vardags, a law firm for High Net Worth Individuals. \nWith plenty of experience in family law, Nicky is co-founder of the Newcastle office with Susanne Shah, and she told us how she first got involved in law, her experience in the field and how she and Susanne are busy getting the Vardags name out. Nicky Hunter Director at Vardags on Grey St Newcastle (Photo: Newcastle Chronicle) 8.30 Coreena Ford Alcohol merchant Woolf Sung could stop buying fine wines as Brexit hits import costs \nPremium alcohol merchant Woolf Sung has toasted a jump in whisky sales, but said the firm may have to stop buying some fine wines as the Brexit-hit pound ramps up costs. \nFounder and chief executive Sebastian Woolf said the business had been buoyed by significant growth in scotch sales and a strong demand for casks from independent bottlers in Scotland. \nHowever, fine wine sales are down after the company ran out of stock and faced paying a higher import price for Bordeaux, Burgundy and Rhone as a result of sterling’s slump. \nLast week the Wine and Spirit Trade Association (WSTA) said that Brexit had pushed a bottle of wine to an all-time high and forecast further price rises on the horizon. \nMr Woolf said the firm was on track to record double-digit growth next year, with turnover of £2.2m for 2017 expected to rise between 20% and 40%. He said: “Each section (within the business) is performing slightly differently, because since the Brexit vote opportunities to buy in Europe have dropped off because of the pound-euro exchange rate changing. \n“Since the start of the year the areas that have grown significantly are scotch sales, the independent bourbons we are importing from the US and cask sales for independent bottlers from Scotland.” \n“Wines are down because we have sold out of all of our stock, but everything else is up,” he added. \n“As a business I have just decided to stop buying Bordeaux, Burgundy and Rhone if I can’t buy it at the right price.” \nFounded in 2012, Woolf Sung sells 95% of its fine wines and spirits to independent merchants, while a small amount is sold to wealthy private buyers. A person pouring whisky into a glass (Photo: Jeff J Mitchell/Getty Images) 8.23 Coreena Ford Takeover bid for Shawbrook increased to £868m \nPrivate equity firms Pollen Street Capital and BC Partners have increased their takeover offer for challenger bank Shawbrook to £868m. \nThe pair tabled an £825 million offer for the lender in March at 330p a share but on Monday upped this to 340p. \nShawbrook has so far urged shareholders to rebuff the overtures, and investors now have until June 19 to decide whether to accept or reject the latest offer. Lindsey McMurray of Pollen Street Capital and Cedric Dubourdieu of BC Partners said: “After carefully considering market feedback we are pleased to be able to make an improved best and final offer, which we consider offers shareholders an attractive premium and compelling value. \n“We continue to share the Shawbrook management team’s vision and look forward to working with them in the future to build on the company’s strong foundations as a specialist lender.” \nShawbrook, which specialises in lending to small and medium-sized businesses, warned earlier this year in an investor circular over “significant” costs of the bid, at around £4m if it is aborted and up to £12.5m if it succeeds. \nThe takeover approach comes after Pollen Street floated Shawbrook on the London Stock Exchange at 290p a share in April 2015, valuing the bank at £725m. \nShawbrook employs 600 people in 10 offices across the UK. (Photo: PA) KEY EVENT Probe into PwC's Tesco auditor role dropped \nThe Financial Reporting Council (FRC) has dropped its investigation into PwC’s role as Tesco’s auditor during the supermarket’s accounting scandal. \nBritain’s accountancy watchdog said that the probe into the PwC and certain Members of the Institute of Chartered Accountants in England and Wales has been closed as “there is not a realistic prospect” that a tribunal would make an adverse finding against either. \nHowever, the FRC added that the investigation into certain other members of accountancy bodies is ongoing. \nThe watchdog said in a statement: “The Financial Reporting Council announces the closure of its investigation into the conduct of PricewaterhouseCoopers (PwC) and certain Members of the Institute of Chartered Accountants in England and Wales in their capacity as auditors of Tesco. \n“The Executive Counsel to the FRC has concluded that there is not a realistic prospect that a Tribunal would make an adverse finding against PwC and certain Members in respect of the matters within the scope of the investigation.” \nPwC was the supermarket’s auditor when it was discovered that Tesco had inflated profits by £263 million in 2014, action that the Financial Conduct Authority deemed as market abuse earlier this year. \nTesco suspended eight directors and the Serious Fraud Office charged three former executives with fraud after the black hole was discovered in the firm’s accounts. Tesco also ditched PwC as auditor in 2015, replacing it with rival Deloitte. \nTesco announced in March that it will take a £235 million hit after reaching an agreement with authorities over the scandal, which will see it make a hefty compensation payout to investors. \nA court case against the three Tesco executives - Carl Rogberg, Chris Bush and John Scouler - is ongoing. Tesco sign", "external_links": [], "published": "2017-06-05T15:02:00.000+03:00", "crawled": "2017-06-05T10:25:24.004+03:00", "highlightTitle": ""}