{"organizations": [], "uuid": "d8649fa19d8288d30d048b11ecadc60db59138af", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article13123769.ece/ALTERNATES/s1200/General-Election-2017.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/expect-brighter-future-outside-eu-13123741", "country": "GB", "domain_rank": 21960, "title": "Expect 'brighter future' outside EU May claims in North East visit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-02T01:00:00.000+03:00", "replies_count": 0, "uuid": "d8649fa19d8288d30d048b11ecadc60db59138af"}, "author": "Agency Staff", "url": "http://www.chroniclelive.co.uk/news/north-east-news/expect-brighter-future-outside-eu-13123741", "ord_in_thread": 0, "title": "Expect 'brighter future' outside EU May claims in North East visit", "locations": [], "entities": {"persons": [{"name": "jeremy corbyn", "sentiment": "none"}, {"name": "rudd", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "yougov", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "downing street", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "guisborough", "sentiment": "none"}, {"name": "teesside", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "neutral"}, {"name": "bbc", "sentiment": "none"}, {"name": "cj leonard & sons ltd", "sentiment": "none"}, {"name": "the times", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Expect 'brighter future' outside EU May claims in North East visit The Prime Minister was in the North East on Thursday where she promised Brexit would see Britain freed from the 'shackles' of Europe Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily   Thank you for subscribing!   \nBritain can look forward to a brighter future outside the EU , Theresa May has declared as she sought to breathe new life into the Conservatives’ faltering General Election campaign. \nIn campaign speech in Teesside, the Prime Minister said , freed from the “shackles” of Brussels, the UK could again become a “great global trading nation”. \nHer appearance comes after she was widely mocked by opposition parties for her refusal to take part in Wednesday’s televised BBC debate, sending Home Secretary Amber Rudd instead. \nOpinion polls suggest Labour is continuing to make ground with a YouGov poll for The Times cutting the Tory lead to just three points although other surveys still give them a double-digit advantage. \nWith just a week to polling on June 8, Mrs May said voters had the opportunity to reaffirm last year’s referendum vote for Brexit by backing her to carry on in Downing Street. Conservative party leader Theresa May delivers a speech at CJ Leonard & Sons Ltd in Guisborough (Photo: PA) \n“If they do, I am confident that we can fulfil the promise of Brexit together and build a Britain that is stronger, fairer and even more prosperous than it is today. \n“Because the promise of Brexit is great, the opportunities before us enormous,” she said. \n“Because if we get Brexit right, then together we can do great things. \n“We can build a Britain beyond Brexit that is stronger, fairer and more prosperous than it is today. \n“A Britain beyond Brexit that is more global and outward-looking. \n“A Britain alive with possibilities, more confident in itself, more united and more secure. \n“A country our children and grandchildren are proud to call home. \n“If we get Brexit right, we can be a confident, self-governing country once again. \n“A country that takes the decisions that matter to Britain here in Britain.” \nMrs May sought to rally support, saying that making a success of Brexit was a “great national mission”. Conservative party leader Theresa May delivers a speech at CJ Leonard & Sons Ltd in Guisborough (Photo: PA) \n“Set free from the shackles of EU control, we will be a great, global trading nation once again bringing new jobs and new opportunities for ordinary working families here at home,” she said. \n“But the brighter future we want for our country will not just happen. \n“This great national moment needs a great national effort in which we pull together with a unity of purpose and, however we voted in the referendum last June, we come together with a determination to make a success of the years ahead. \n“Because together we can do great things.” \nThe Prime Minister launched a renewed attack on Labour leader Jeremy Corbyn , warning he was not capable of negotiating a new deal with the EU. \n“You can only deliver Brexit if you believe in Brexit. \n“You can only fight for Britain if you believe in Britain. \n“You can only deliver for Britain if you have the strength, the plan and the determination to see it through,” she said. Read More BBC General Election 2017 leaders' debate: Chronicle readers rate the performances Conservative party leader Theresa May delivers a speech at CJ Leonard & Sons Ltd in Guisborough (Photo: PA) \n“And what we know in this election is that the only other person that can be prime minister in seven days’ time is simply not up to the job. \n“He doesn’t believe in Britain. \n“He doesn’t have a plan. \n“He doesn’t have what it takes.” \nMrs May laid out her post-Brexit vision to make the UK the “world’s great meritocracy” - including her plan to expand grammar schools in England. \n“For too long, politicians have said that if you’re rich or well off, you can have a selective education for your child. You can send them to a selective private school. You can move to a better catchment area or afford to send them long distances to get the education you want,” she said. Read More \n“Yet for too long, those same politicians have sought to deny that right to others - to ordinary working people up and down this land. That is a scandal and we will bring it to an end.” Read More", "external_links": [], "published": "2017-06-02T01:00:00.000+03:00", "crawled": "2017-06-01T20:25:38.010+03:00", "highlightTitle": ""}