{"organizations": [], "uuid": "5109042b688371e0de6ccb1d1b1dc92cd209e47c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article13146521.ece/ALTERNATES/s1200/SGP_NEC_060617DEBATE10JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/north-east-general-election-debate-13146353", "country": "GB", "domain_rank": 21960, "title": "North East General Election debate 2017: Four candidates discuss the issues affecting our region", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-07T20:03:00.000+03:00", "replies_count": 0, "uuid": "5109042b688371e0de6ccb1d1b1dc92cd209e47c"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/north-east-general-election-debate-13146353", "ord_in_thread": 0, "title": "North East General Election debate 2017: Four candidates discuss the issues affecting our region", "locations": [], "entities": {"persons": [{"name": "caroline lucas", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "chi", "sentiment": "none"}, {"name": "greg", "sentiment": "none"}, {"name": "tim farron talk", "sentiment": "none"}, {"name": "duncan crute", "sentiment": "none"}, {"name": "diane abbott greg stone", "sentiment": "none"}, {"name": "jonathan", "sentiment": "none"}, {"name": "chris", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "norman lamb", "sentiment": "none"}, {"name": "jonathan elmer", "sentiment": "none"}, {"name": "greg stone", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "chi onwurah", "sentiment": "none"}, {"name": "jeremy corby", "sentiment": "none"}, {"name": "tony blair", "sentiment": "none"}, {"name": "kim", "sentiment": "none"}, {"name": "diane abbott", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "jeremy", "sentiment": "none"}, {"name": "newcastle north", "sentiment": "none"}, {"name": "mike kelly", "sentiment": "none"}, {"name": "tim farron", "sentiment": "none"}, {"name": "tim", "sentiment": "none"}, {"name": "robin hood", "sentiment": "none"}, {"name": "charles ellis", "sentiment": "none"}, {"name": "chi onwurah labour", "sentiment": "none"}, {"name": "duncan", "sentiment": "none"}], "locations": [{"name": "northumbria", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "cramlington", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "saudi arabia", "sentiment": "none"}, {"name": "states", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north northumberland", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "berwick", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "north tyneside", "sentiment": "none"}, {"name": "health england", "sentiment": "none"}, {"name": "tyneside", "sentiment": "none"}], "organizations": [{"name": "northumbria police", "sentiment": "none"}, {"name": "tory party", "sentiment": "none"}, {"name": "lib dems", "sentiment": "none"}, {"name": "newcastle central", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "lib dem", "sentiment": "none"}, {"name": "lib dem coalition", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "department of education", "sentiment": "none"}, {"name": "national health service", "sentiment": "none"}, {"name": "pfi", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}, {"name": "green party", "sentiment": "none"}, {"name": "a&e", "sentiment": "none"}, {"name": "labour if labour", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}, {"name": "greens", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "general election", "sentiment": "none"}, {"name": "newcastle chronicle) green party", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "coalition", "sentiment": "none"}, {"name": "educational maintenance allowance", "sentiment": "none"}, {"name": "green party  well", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}, {"name": "north east ambulance service", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Round-up of the debate \nBelow you will find our North East General Election debate. \nThere were lots of disagreements among the four parties as you would expect but one thing that they would all agree on is, come Thursday - vote! \nYou can click the key events (the bullet points above this post) to go to the particular subject that interests you and may sway your vote. \nThe bullet point introducing the candidates is at the start of the debate so if you click that you can start at the beginning and follow the debate right through. \nA video at the top of the page shows the highlights from the debate. \nWe will have live coverage as the North East heads to the polls from 5.30am Thursday morning. Our coverage doesn’t stop there because we have reporters are all the major counts to bring you updates - and results - through the night. Liberal Democrats Greg Stone on why you should vote Liberal Democrats \nI think you should vote Liberal Democrat for a brighter future. I think we have chosen more progressive policies and the IFS have shown that our plans do more to help the poorest than the Labour Party does. We are looking to invest properly in the NHS and education. \nWe have the most liberal, open, tolerant values at home and abroad. We are expressing concern about the direction travelled on Brexit and what that will mean for this country. And particularly if you are unconvinced by what Theresa May and Jeremy Corbyn are offering then there’s an alternative to the Liberal Democrats. (Photo: Newcastle Chronicle) Conservatives Duncan Crute on why you should vote Conservatives \nWell this General Election is the most important one in a lifetime. We have a clear choice here, we have a choice between the Conservatives with centralist, middle of the road, policies and Jeremy Corbyn, with extreme, left-wing policies. But more importantly we have the biggest negotiations coming up, probably ever in this country’s history - certainly over the last 40 years - in Brexit, and I want a Prime Minister to be strong and I want a Prime Minister who will get a great deal for this country. (Photo: Newcastle Chronicle) Labour Chi Onwurah on why you should vote Labour \nWhat we have now is an economy that doesn’t work for working people. We are all poorer than under Labour and we are more divided. \nThe Labour Party has a manifesto to invest in particularly regions like the North East, to unlock our potential, to reinvest in our National Health Service, in a national education service, restore some of the cuts to welfare and benefits and really to have an economy that works for working people and a better, more cohesive, stronger, and more open society. (Photo: Newcastle Chronicle) Green Party Jonathan Elmer on why you should vote Green Party \nWell one thing that doesn’t come up in this election, hardly ever, is the issue of climate change, the biggest issue of the 21st century. We are destroying the planet and we need for our very survival to take a big deep breath. \nAll the oxygen in the air you breathe has come from a plant and we’ve got to look after these things. It’s not about it being nice to have, it’s something essential to our survival. \nNow, the Greens see this as integrated policy making that we would like to measure our economy in a very different way, that looks at people’s needs and whether it provides for people’s needs but also whether or not the growth of that economy takes us beyond the limits of our environment. (Photo: Newcastle Chronicle) KEY EVENT How the parties will tackle NHS problems \nMK: There’s been a lot of criticism of the Conservative Party’s running of the NHS. How do you respond to that? Is it safe in the Conservative Party’s hands? \nDC: Well, of course, it’s safe in the Conservative Party’s hands. We are spending actually £10bn this year, there are 11,300 more doctors since 2010, 12,000 more nurses since 2010, we are giving an extra £2bn because I think Greg is right, health and social care need to be linked. \nMK: Well, why are health professionals saying it is in crisis? \nDC: Well, because what Labour did was they went and built hospitals and the hospitals cost £50bn. They didn’t raise that money through extra taxation, they didn’t raise that money through government bonds to finance the debt, no, they went to private equity finance which is more commonly known as Private Finance Initiative, and they built hospitals, I’ll grant them that - the problem is the debt on those hospitals is £350bn. And that’s the hardcore debt, that’s not the softcore debt which is the maintenance contracts they gave to these private finance companies. I’ve been to trusts where there is 47 years to pay off this debt. I’ve been to trusts where it is £40 to change a lightbulb because they cannot break the contract. That is the debt that the Labour government put on the NHS. \nCO: Well actually I’m quite stunned by that, of all the arguments for why the NHS is facing crisis. Let’s be clear that in the North of the North East, half of the North East, our sustainability and transformation plan highlights a half a billion pound funding gap in one area. The three-year waits for some mental health treatments is not a waiting time. It is like saying you are not going to be treated while you are facing the illness. Greg Stone, Duncan Crute, Mike Kelly, Chi Onwurah and Jonathan Elmer (Photo: Newcastle Chronicle) \nThe experience of people with the NHS and the fantastic work which our doctors and nurses do not match Duncan’s words on the fantastic state that he is saying that the Conservative and Lib Dem parties have supposedly left it in. So we say that there is a crisis in the NHS. We say that the combination of unnecessary top-down reorganisation, the privatisation, the lack of funds and the elimination of student nurse bursaries, making NHS workers from the European Union feel unwelcome - all that means that there is a crisis in the NHS and we will address it by increasing funding of the NHS, and that’s a big thing - £70bn over the next Parliament - but also ensuring that creeping privatisation of NHS services is stopped. \nBy restoring nurse bursaries, by immediately saying to the 80,000 from EU communities that work in the NHS that you can stay here, that you will be able to stay here so that you can continue to work and support the NHS. And by setting up, as we talked about, a national care service which complements the National Health Service so that you do finally succeed in having holistic, wraparound care, which is what I think everybody wants. And, just finally, that is a lot of money that I’m talking about investing in the NHS in care but what we shouldn’t forget is that enables people to go out and work better, to go out and contribute more to the economy, to unlock their potential and make our economy stronger. So you mustn’t just think of health services and public services as cost, they enable us to be better. \nMK: Greg Stone? \nGS: There is clearly a funding gap in the NHS and it’s becoming increasingly noticeable that there are problems. Services are badly overstretched, our A&Es are under pressure, waiting lists are increasing, access to primary health care is significantly increasing and difficult as well. So I think there is clearly a need for additional resources in the NHS. I don’t think the current funding arrangements are kept that things will improve, things will get worse so that is why we are saying upfront that we think there should be extra investment in the NHS and social care and we would fund that by increasing income tax, that is a fair way to do it, we can’t keep on pretending that we can keep on spending money on everything that we would like to do without readjusting the tax system to deal with that. \nThere is a lot of pressure on facilities in the region, we would like to see a regional review of hospital trusts, we would like to see a review of performance and pressures, we would like to see a review of the performance of North East Ambulance Service which is struggling to meet its targets particularly in the north of the region, North Northumberland in particular. We are concerned the sustainability of transformation plans are making a move towards more closures of local hospital facilities and increasing big central locations. I think for the people, again in Northumberland, that is a big problem, they’re having to travel from Berwick to Cramlington which is already overstretched, it’s barely three years old, that hospital there, that is a worry and I think it’s right as well that the Brexit and post-immigration visa restrictions that the government wants at the moment will have a big impact on NHS staff recruitment, that will be a big, big problem so we are very clear that we think that we need to see more money for the NHS, we’ve got a funded plan for doing that and we’ll see more when we go onto the front line for mental health services, for social care, for public health and of course we’ll lift the public sector pay freeze that will give more money to nurses and to doctors. \nMK: How much do you propose to increase tax to pay for this? \nGS: 1p increase in income tax across the board. \nMK: So this will be specifically targeted at the NHS? \nGS: Yes, health and social care. \nMK: Jonathan? Greg Stone (Photo: Newcastle Chronicle) \nJE: We hear so many times during this election campaign people have said the NHS isn’t going to be privatised, it’s not being privatised, it won’t be privatised, I’d just like to recall the fact that in 2012 the government introduced the Health and Social Care Act. Now if you remember the point of the Health and Social Care Act was to introduce the infrastructure into the NHS that enabled an internal private market, that was its point. Ok. \nNow the administration of the internal private market within the NHS now costs an estimated four and a half billion a year, just to administrate, tendering and contracts and actually the access of the private sector into the NHS. So talk of the fact that the NHS isn’t being privatised, I just don’t get that at all when legislation has been introduced to enable that. I absolutely agree with what some of the other candidates have said though, there’s a real need to fill that funding gap, the Greens would intend to do that as well, the way we would cost that, the projections and the requirement, something like 20 billion a year. We would do this through various means. One would be scrapping Trident which we don’t believe there’s a need for. Again the Financial Transaction tax, some people call it the Robin Hood tax, and again we’d simply remove the internal market structure from the NHS and save four or five billion simply in doing that. \nMK: Coming back to you, Chi, on this point. It was Tony Blair who first really opened the door to the internal market and also a lot of the problems of the financial problems of the NHS relate to the PFI plans so Labour perhaps has a lot to answer for, for the NHS problems. \nCO: No. Every government should take responsibility for the NHS under its watch and what we particularly disagree with is, as an MP I ask questions about the NHS and I’m told it’s the responsibility of Health England or, yes we have to absolutely take responsibility for the NHS under our watch when investment was massively increased in the NHS and those who remember in 1997 the waiting lists, the scenes in A & E, the impossibility of getting care for chronic conditions, the NHS was transformed under the Labour Party and I’m very proud of that record. Mike Kelly and Chi Onwurah (Photo: Newcastle Chronicle) \nWhen it comes to the impact of PFI it’s true to say that not all of PFI contracts were negotiated properly and that the public sector was, at times, taken for a ride, it has to be said, by certain companies. But that said, PFI is not the root cause of today’s problems, again it’s trying to find a way of blaming, of taking away responsibility that this government has for the NHS. \nAnd it’s not true to say that the Labour Party opened the NHS for competition, it was very clear that when the NHS couldn’t deliver then other providers could be brought in. That is not the same as bringing in private sector providers to deliver core services of the NHS which is what this government is doing. University fees What are you offering 18-year-old first-time voters like me? \nTwo questions: What are you offering 18-year-old first-time voters like me? AND How is Labour going to fund free university tuition? \nCO: Jeremy Corbyn emphasised in his speech in Gateshead this week, that we are also going to introduce a creative pupil premium which means that every child can learn a musical instrument - and that is about enhancing our creativity individually as a region. Our manifesto is fully funded and getting rid of tuition fees is one of the biggest ticket items in it - it’s £11bn and its a very big decision to remove the threat of £50/60/70,000 worth of debt hanging over our students’ heads. \nThe way in which we will fund that is that there are a number of measures which will raise the funds to pay for that and for the other spending commitments on a day to day basis. For example, we will reverse the cuts to corporation tax, which have amounted to a billion pound giveaway to larger companies - small companies don’t get that much - putting corporation tax up to, over five years, I think 26 percent, which will still be amongst the lowest in the G7 and 13 percent lower than the United States. We would introduce a financial transaction tax which would ensure that there is friction in the financial markets and also raise funds and we are committed to raising the taxation rate for those earning over £80,000 - so that is for the top five percent. \nNinety-five per cent of people in this country will not face higher tax under Labour but those earning over £80,000 will face a higher rate of income tax. \nGS : The question was about 18-year-olds and I think we can learn the lesson of making unrealistic and hugely expensive promises on tuition fees and we can recognise that as being used to beat us over a number of years. But I think we can still be proud of the fact that the measures we have put in place for tuition fees have meant a greater participation from disadvantaged groups than what there was previously. \nI think it is also worth pointing out that the Labour proposal would be in effect a very large subsidy for the middle classes which people on lower incomes will have to pay for. In terms of what we would do for first-time voters, I am pleased that in the Lib Dem manifesto we are extending the right to buy scheme which is a very good way for people to get on the housing ladder by paying rent that goes towards the cost of owning their own home. I think that’s an important point about affordable housing. We are also looking to restore housing benefit for 18-21-year-olds, an unfortunate cut made by the Conservatives and I think one of the interesting things is a new bus pass arrangement for 16-21-year-olds to get a discount on bus fares. We know that people are finding it difficult to meet the cost of travel to work or training or to college and that would be a good positive policy. \nDC: I think education is not just about higher education. We’ve been in power since 2010, there are three million more apprenticeships, we’ve also looked at technical training to invest a lot of money and time there - I’ve talked about the T Level that the Chancellor just put in the Budget. With regards to higher education, the fees were introduced by the Labour government, they increased by the Labour government. Greg is right, we did change the boundaries under the Coalition so that you don’t pay back the loan on those fees until you hit a certain level of income. The result of that is there were 37 percent more people coming to university from a deprived background by 2016 than in 2010 - a tremendous difference. \nWith regard to the costings, I will say this: it is £11.3bn what we would have to find in other forms of taxation in order to raise enough to cover tuition fees. I think that is complete folly by Labour - the costings are not properly thought out. Tuition fees were introduced by Tony Blair, they were increased by the Labour government and they are ultimately here to stay. \nCO: Can I say, don’t go using a statistical trick because you said that the number, the absolute increase in the number of those who are going to university from different backgrounds has increased. The actual percentage who are going has not increased. \nGS : It has. \nDC: That’s one thing I would agree with. It has increased. \nCO: That’s because you are both responsible for the policies. \nGS : A point to make here is what this will mean for our universities. Our universities are a very important part of the North East economy. I strongly suspect that the universities would be very anxious about whether they would have sufficient funds to sustain their current levels based on what Labour is proposing and that’s going to have a big impact on the North East. (Photo: Chris Radburn/PA Wire) \nMK : Just a question for Chi. How would the universities lose out? Would they lose out? \nCO: Well no, because we will be paying for the equivalent of the tuition fees. I think Greg is slightly misunderstanding how university fees are funded and just to say that what universities are very worried about is the cap on immigrants which is going to undermine the number of university students coming to the North East. And just to remind you that the Lib Dems were part of the government which brought that in. \nJE: I was just going to make that point. We are going to have a 20,000 target in terms of immigration then that’s going to have a serious impact on diversity and is very concerning. But I just want to come back to my experience. My daughter now is 13-14 and I want her to go university but I’m not a wealthy person and I really find it quite frightening to think that she might have a debt of £50,000 when she comes out. I appreciate what the Conservative candidate said about raising the threshold when it comes to paying that back but the fact is that she will have to pay it back and that’s a whopping sum of money. Now, I strongly believe in the idea that university education should be accessible to all people regardless of their background. If you aspire to that level of education you should be able to achieve that if you get the exam results and that should be all there is to it. But moving away from that, you are more likely to be free to be able to go to university if you come from a more wealthy background. It’s another one of these things that divide society, and at the very beginning of this debate the Conservative candidate was talking about all the things he’d done to unify society and this is the very reverse of that. \nNow, from the Green Party’s perspective, in terms of how we would change the system, we would like to again, scrap tuition fees, we would like to reintroduce the maintenance grant and actually, we’re also like to write off existing student debt. Now I make no bones about it, I appreciate that that is going to be expensive but I think it is important that that is done if people are going to have a fair chance in life. The way we are going to pay for that is similar to how Chi has described payment for the Labour Party, which is to raise corporation tax, to 30 percent. Again, that’s in line with where the major economies across Europe set it, so this isn’t going to scare off business. It’s really not. \nMK : So even people who’ve gone through education already, you’d repay them? \nJE: Yes, that’s right. People who have debts to pay back, we want to write off those debts. Education KEY EVENT Will my child's education suffer under your party? \nJE: Working parents are going to have to cover the costs of childcare as things stand at the moment. I’ve just done that. My kids are 11 and 13. The cost of childcare cost my family something like £1100 per child and we were seriously making the decision on one person leaving their job because it was actually more cost effective that way, which is obviously an absurd situation. \nIt is very important to better fund and provide childcare. Now when we get into the schooling situation we’ve seen funding cuts to schools. The IFS I think predicted that the real-term impact of those cuts is something like a three per cent year on year reduction in school funding, so that’s in primary schools and comprehensive schools, and of course, that’s forcing schools to make cuts right now so there’s a need to immediately address that. I have had huge concerns over the idea of introducing grammar schools which have been proven to not get the best results. They get good results for those kids that go to grammar schools but overall results within an area deteriorate as a consequence of grammar schools and I’m shocked that the Government are not looking into the evidence of what works when designing these policies. \nThen we’ve got the Educational Maintenance Allowance, that was stripped away by the Coalition, which would enable sixth formers from poor backgrounds to get a bit of help, that’s gone as well and of course now when people go to university they will go through the system and come out with £50,000 worth of debt. It’s just another attack on individuals, and you are facing a situation where if you are wealthy you are going to do better. \nMK : Kim is specifically asking about her five-year-old son. How do you to protect him? \nJE : The Green Party policies are to provide funding to cover the childcare in those early years. We want to step back from the funding cuts that the Government have implemented over schools generally as well as early years. \nBut also on exams, I want to mention a few things, at the moment we’ve got a target-based exam regime so that even very young children face a huge pressure on them to perform when the last thing that kids are thinking about is their exam results. There’s a need to look at a more European model for how we deliver education so that it’s not all about exam results. We are very keen to return the monitoring of the quality of schools to local authorities so that they take an overview of a wide area. \nMK: Education is a big area. Just to repeat the question: “My child is five years of age, so has just started with his many years of education. What can each party promise me so that his education won’t suffer under your party?” \nDC: Well, for education the budget is £40bn, it’s the highest budget we’ve ever had. We’ve increased it in real terms by three per cent, so it’s not been decreased, it’s been increased year on year. With regard to wider education, the proposal we have is not just about grammar schools but increasing the technical colleges as well. In the Chancellor’s Budget he introduced a T Level scheme which is putting technical training into apprenticeships within business, industry and commerce. Also what we’ve done is instead of making the budget for education centrally funded, we’ve said, look, the headteachers of the schools know best how to spend that money. So you’ve got over 6,000 more academies since 2010 and I think that’s really important to know. It’s not the Department of Education saying here’s the money and how you should spend it, it’s the teachers within the schools that will know exactly what is required for those children. Duncan Crute (Photo: Newcastle Chronicle) \nMK : A question from Charles Ellis. He writes: “I am a retired headteacher. During my first 10 years as a head, under a Conservative government for most of that time, I had to cut my school budget each year. Fair funding is needed. What would fair funding mean for your party?” \nDC : I don’t know the specifics, I don’t know which school he was the head of, I don’t know the budget. It’s a very specific question. I just do not know enough about it to answer. \nMK: Chi Onwurah, your response to the question. First of all, to Kim. about what you can promise her five-year-old son. And also if you could incorporate the question from the retired headteacher. \nCO : Education is so fundamental and it was so instrumental in my life - state education - in enabling me to realise my potential. So the first thing to promise for your son Kim, is that we will close the funding gap. Our fully funded, fully costed manifesto says £6bn into education and one of the things that will mean is that the expected £400 cut in spending power per pupil for every school in Newcastle and similar amounts around the North East, that will not be required. Those are the cuts that headteachers right now are trying to plan for. And we will also use that money to ensure that we restore the class sizes which under this government and the Lib Dem Coalition government, we’ve got half a million pupils in large class sizes - larger than 30. \nWe will ensure we have professional teachers, not unqualified teachers and by ending the pay freeze - we’ve lost 50,000 teachers in the last year alone and teaching is a key profession and needs to be recognised. And we will also restore the Educational Maintenance Allowance. More generally, we’ve said we’ll set up a national education service. Mike Kelly and Chi Onwurah (Photo: Newcastle Chronicle) \nNow I decided what I wanted to be when I was about seven years old - an engineer, not a politician - I knew what I wanted to be and I was able to become that. But not everybody can make the right decisions when they are young. Some people have mental health difficulties or are in an environment which isn’t supportive or they have caring responsibilities. With a national educational service, and for Kim’s son, we will ensure that education is free at the point of use from the cradle until the grave. That will unlock his potential and everyone’s potential, particularly in the North East when the skills gap is so important and so we’ll have a better economy and a more outward-looking economy as well - a higher skills economy. When education works it’s good for the individual but it’s also good for the region and for society as well. \nGS: The Lib Dems are very strongly committed to education which, as Chi says, is the key to unlocking every individual’s potential, and we want to prioritise early years in terms of our plans for educational spending. We are talking about a £100m investment fund to include new school buildings, we are talking about £7bn for schools and colleges and that’s actually more than Labour are proposing for schools and colleges. We were very proud to introduce the pupil premium for pupils who need additional funding. We would treble the pupil premium for three to five-year-olds and we would be able to prioritise additional early years educational spending from that including expenditure on childcare. We agree about lifting the pay freeze for teachers as well as for other public sector workers like nurses. We want to see local authorities taking the lead on education and schools. We do not particularly support the approach the Government are taking on free schools and on grammar schools. And finally we are proud to have the institution of free schools such as primary schools we want to keep that, unfortunately, the Conservatives want to take that away.” Brexit KEY EVENT Party policies on Brexit \nGS : I think we will keep on asking for that because I think that Brexit is the big challenge going forwards for the next few years of this country and will have a huge impact on our economy and a huge impact on whichever government gets in, in terms of their ability to spend money on the things that they want to spend on. \nThere will be a huge bill to pay for Brexit. I recognise that the public voted the way they did in the referendum, I’m not entirely sure that everybody who voted the way they did knew quite what they were letting themselves in for, there were lots of promises made which have evaporated into thin air now and I think that when people see the reality of what Brexit means hitting home which may be during the course of this parliament people will be crying out for a rethink on this I think, it’s right that we give people the chance for a second referendum rather than leaving Theresa May, or Jeremy Corbyn, whoever it may be, to go in to negotiate a deal and I strongly suspect, actually, that one of the things that’ll happen fairly quickly after the election is that the negotiation process will begin and I think, particularly if Theresa May’s the Prime Minister, then that negotiation will collapse very quickly and there’ll be no deal at all and that will be very very damaging for the North East. Greg Stone, Duncan Crute, Mike Kelly, Chi Onwurah and Jonathan Elmer (Photo: Newcastle Chronicle) \nMK: Duncan Crute, do you think negotiations will collapse under Theresa May? \nDC: Well the first question was, I think you said, the second referendum. First of all I campaigned for Stronger In, I’ve accepted the decision, democracy has taken place, you then have to support Brexit, it’s that simple. Negotiations will not collapse under Theresa May and I have to say I have every confidence in Theresa May in getting a good deal in Brussels. I have absolutely zero confidence in Jeremy Corbyn. \nMK: Theresa May says no deal is better than a bad deal. Has no deal been costed? Do you know how much it would cost if you pulled out? \nDC : Well we’re not going to go into negotiations and lay our hands on the table and we’re not going to say this is it, you know any trade negotiation is secret. \nGS : For Duncan’s benefit the Treasury’s estimate is 46 billion pounds cost per year of no deal Brexit. \nMK: 46 billion? \nMK: Chi. Labour campaigned to remain. \nCO: Absolutely. As did I, very strongly. \nMK: And now obviously the EU referendum voted out. How do you think negotiations for Brexit will go under Labour if Labour wins the election on June 8th? \nCO : Under Labour negotiations for Brexit - well firstly there would be negotiations, there wouldn’t be grandstanding and mudslinging which has basically been Theresa May’s position from the start when it comes to not wanting parliament to have any say in one of the biggest changes in our country’s position for decades, to antagonising the 26 other countries that we will need to continue working with after Brexit because we’re not leaving Europe even though we are leaving the European Union. This is very important in negotiations, and I’ve worked in business for 20 years before coming into Parliament. \nWe’ve set out what it is that we want and what our priorities are. We want a Brexit that works for working people for Britain. We want a Brexit that protects and indeed creates jobs and it is the economy that counts. We want a strong economy and we also want a responsible and ethical Brexit which means that we acknowledge the rights of European Union citizens living here from day one to continue to live here. So we’ve been very clear about that. What we have in common with our European partners is wanting a stronger Europe, which is wanting a continuation of trade, because the North East has the highest level of trade surplus in the UK, it’s particularly important for jobs here and we have over 100,000 jobs which are dependent on trade and access to the single market so that is also a priority. So it’s not going to be easy but I think it will be difficult there will be challenges but being very clear about what we want to get out of this and not being idealogical about certain figures when it comes to immigration will ensure a more constructive negotiation. \nMK : Jonathan Elmer the Green Party’s standpoint on this. A final deal, if a deal’s reached, would you call for a second referendum? What’s the Green Party’s stance? \nJE : It’s similar to the Liberal Democrats. Essentially we would look at the final deal that was reached and offer it to people to decide whether or not they feel it’s an improvement on the current situation. I think it would be absurd to move forward with a deal that represents a step back, it’s a crazy scenario. A few things I’d like to say though with regards to negotiations. It strikes me that Theresa May has been immediately adversarial and created red lines when actually the best way to approach such a deal is to look for areas of common ground. What have we got in common? What can we work together on? I very much feel that those stranded EU citizens should be treated first. Jonathan Elmer (Photo: Newcastle Chronicle) \nThe situation with regards to their lives and their future is something that needs to be resolved before the negotiations even proceed. You’ve got people right now who don’t know if their family’s going to be split up because they might be sent back to a different European country and likewise British people in Europe. That’s an awful situation to leave people in. I’m quite ashamed of our country for allowing that to happen when it was avoidable. I have a big concern also in relation to what’s been termed the great repeal bill which is a legislation that the government have had to put in place to enable them to quickly, if you like, stitch up the gaps with regards legislation that would no longer be working in this country because it stems from Europe. The great repeal bill has given the Conservatives really quite a lot of authority and control over simply deciding, without proper parliamentary scrutiny, how particularly environmental and social legislation could go forwards. Now that’s very important because the next step after Brexit is going to be, of course, negotiation new trade treaties with other traders around the world, particularly the United States. Now they are not going to be able to trade with us if we have the sort of firm environmental regulations in place that stem from Europe. \nSo there will be a lot of push towards watering down of environmental legislation related to sale products, farming, use of land, so I’m very concerned about that and I’d like perhaps some reassurance in that area. How can we trade with America on the same basis that they’re used to trading without watering down our standards? Dementia tax Candidates debate controversial dementia tax \nMK: Another story of the election’s been the so-called dementia tax. Duncan Crute was that an error? Was it badly explained? Or was it scaremongering by Labour in particular about what it actually meant and what and how it will affect people? \nDC: Well I think it’s been badly reported. I think at the moment we have a scenario where, in ten years time, there’s going to be two million people who are aged 75+ so we do have a problem and that’s great, it’s fantastic, you know, people are living longer. If you went back 30 years ago we had HIV, you had very limited chance of survival. \nIf you had cancer you had very little chance of surviving. The problem is it’s going to put a lot of pressure onto social care. Currently, as the system stands at the moment, the only first £23,500 is ringfenced, that’s always ringfenced. What we have said we will ringfence £100,000 and the home will be protected. Now what we haven’t said is where is the cap. What we’ve suggested is the cap, the green paper, be published. \nMK: There was talk that previously I don’t think it looked at the house as an asset. Is that right, the value of the home. Am I misreading that? \nDC: It’s all assets included within the £23,500 and actually I did speak to a law firm here in Newcastle, a very high-end law firm, and spoke to them in detail just to clarify from a neutral point of view and the partner I spoke to said yes, currently as it stands legally the first £23,500 is protected, beyond that it’s all assets, including the home. \nMK: On this point Greg what’s the Lib Dems’ stance on social care and paying for it because, obviously, we have a social care crisis. How would the Lib Dems pay for it? Greg Stone, Duncan Crute, Mike Kelly, Chi Onwurah and Jonathan Elmer (Photo: Newcastle Chronicle) \nGS: We are proposing to raise income tax for everybody by 1p to pay for an extra six million pounds for the NHS and social care. In terms of the model, we would want to see how that is delivered for people with dementia which is something that affects my family so I’m very passionate about it. I think there’s clearly a need for all parties to do more to turn this from being a political football into something where there is a cross-party consensus that this is something that parties have tried to do. \nMy party’s health spokesman, Norman Lamb, has been pushing for this for a long time, every time this has come up in the past there has been a failure by Conservative and Labour to get around the table and actually move this agenda forward and I think it is clear there is a cost to long-term social care but it is something that should be funded from universal provision I think. There may need to be some form of cap on contributions and that is where we see the debate moving forward but I think in terms of what the Conservatives have put forward for their manifesto has been poorly thought out and it has become poisonous on the doorsteps, it is something that a lot of voters have had second thoughts about Conservatives on this dementia tax. \nMK: Chi. Labour policy, do you think you’ve been scaremongering and how would you pay for social care? \nCO : The reason why the dementia tax has had such a reaction on the doorstep, and it does, is because people are, in the natural sense of fairness and dementia and other diseases towards the end of life, they’re like a reverse lottery, you can’t do anything about it. And the Tory policy, it’s been clarified but it’s still not clear, but it is basically not about collectivising the risks so the Labour policy is that we should, just as the fact that your income shouldn’t impact whether you can access the National Health Service so something that you have no control over it shouldn’t be down to you to bear the whole burden of that risk. \nSo we have said clearly that we will invest in social care to overcome the current funding the current funding gap and look to move towards a national care service because we should share the risks and enable older people to be able to look forward, if you like, to passing on what they have earned in their lifetimes and we all pay for the risk of those terrible diseases that can come towards the end of our lives. \nMK : Jonathan Elmer? Green Party stance on this? \nJE: I just want to say that from a Green Party perspective we strongly believe in the idea of collective responsibility across society, to provide for people that are less fortunate than ourselves so the wealthy help the poor and the sick. And I think most British people would approve of that sort of approach. But what we’re seeing is a drift into the idea that individuals are responsible for themselves when things go wrong and we see that particularly with the dementia tax but we also see it in situations like in schools for example, so the introduction of grammar schools, it’s a lottery essentially, if you’ve got wealthy parents you can afford tuition and get into the grammar schools, again it doesn’t enable everybody to have the same chance in life. I’d much prefer to return to a situation whereby we all pay taxes to look after each other in times of need rather than singling people out in their time of need and saying ‘you’re on your own mate’. Tim Farron Talk about Tim Farron's thoughts on gay rights \nCO: And we have a Lib Dem leader who’s been equivocal about supporting gay rights. \nGS: That’s not true. That is not true at all. \nMK: Just to clarify that point it has been raised there are some issues between Tim Farron’s Christian beliefs and his Liberal Democrat politics. He says the two are intertwined. Do you think that’s true? \nGS: I’ve known Tim for many years, Tim is my brother-in-law. I have absolute confidence in his position in terms of what his record in politics has been voting in favour of gay rights and I think attempts have been made to make out the fact his Christianity and his faith are in any way opposed to that is just wrong frankly and offensive. Diane Abbott Greg Stone's lack of confidence in Diane Abbott \nGS : I do think there’s an issue here as well though as Labour are talking about police numbers and a lot of the cuts to that budget. We have to look at whether people have confidence in the Labour politicians being put forward to tackle this. Jeremy Corbyn has publically opposed shoot to kill and we have Diane Abbott who could be Home Secretary within the week, if Labour are to be believed, and I do question whether there is a credible thinking there. \nCO: So Greg has already said, trying to position the Liberal Democrats between Labour and the Conservatives whilst when Labour had policies which were closer to the Conservatives, Greg tried to position the Lib Dems as being on the radical left and of course they went into coalition with the government and made choices on austerity economics to cut our services, to cut this city council by 50% of its funding. And you managed still to double our debt, double our debt, and ten years late on a five-year plan to reduce the deficit. That is the success of the Liberal Democrats. \nGS : The issue here Chi is whether Jeremy Corbyn will be effective and with Diane Abbott as Home Secretary. \nMK Diane Abbott. It is a point she does not perform well. \nCO: Greg has a history of attacking strong women both online and offline and I find it really demeaning of him that he should launch into an attack on one woman, Diane Abbott, who has shown that she has achieved more in politics than I’m afraid he will ever do. Chi Onwurah (Photo: Newcastle Chronicle) \nJE: The line of discussion is also deeply hypocritical. The effort is clearly to try and associate people in the Labour Party with terrorism. The same could be done for people in the Conservative Party. Theresa May herself is presiding over sales of weapons to Saudi Arabia which end up in the hands of Isis. If that’s not supporting terrorism I don’t know what is. That’s happening here and now, not 20 years. Police numbers KEY EVENT Numbers of police on our streets debate \nMK: Going to police and policing levels - that is becoming a big issue of the contest. Obviously, we’ve had the horrific incidents in Manchester and London. Jeremy Corbyn, after London, at first called on Theresa May to resign and clarified, saying that it’s up to the public to vote her out. Do you think it was wise for him to say in the first instance she should resign? I think he was talking about the policing levels under her governance as Home Secretary. \nCO: The fact is Theresa May, as Home Secretary cut 19,000 police and 6,000 police support officers whilst being told by the police and by many independent observers that that would impact community policing and leave us less secure. We’ve lost over 900 police officers in Northumbria and what that does is that reduces the ability to collect that critical intelligence on the ground and engage positively with communities which I do think Northumbria Police, in particular, are very good at doing. \nI think what Jeremy was trying to point out is for Theresa May now to come up and say the technical companies should have been doing more, or enough is enough, she was in charge of our policing. She was in charge of our security online and offline for six years as Home Secretary and then as Prime Minister and she needs to take responsibility for that and not try to push, you know, the blame lies with the terrorists who carried out this horrendous attack but if you’re talking about the regulatory legal and policing environment, that is her responsibility and she should acknowledge that. (Photo: Newcastle Chronicle) \nMK : Duncan Crute, has Theresa May got something to apologise for? In the North East, I understand the Northumberland force was reduced from 4,100 to 3,200 when she was Home Secretary over six years, a similar percentage drop is 25% in Durham do you think that was a mistake? \nDC: No. Crime has actually fallen by a third since 2010. What has happened is there’s been an increase in two areas of crime, in cyber crime in particular, with a lot of fraud and with terrorism the money has been pumped into there and the resources have been substantially increased in those two areas. But things like burglary and common crime has dramatically reduced. One thing I will say is we’ve put, by law, mandatory life sentences in place for people committing violent crimes, which didn’t exist on the statute books prior to 2010. \nMK: Greg Stone what do you think about the policy? Do you think it was a mistake by the Conservatives to cut police force numbers and what would the Lib Dems do if they were in power? \nGS : This is the difficulty prior to the situation the country was in, with the spending to be reduced in all areas. Most people would have acknowledged that in terms of policing that has led to more cuts than we would liked to have seen. It’s important going forward that we do invest in police, I think there is a clear need for initial capacity on there both on the community policing points which is effective in many parts of Tyneside have increased in the last two years but clearly given the nature of the threat we face now in terms of terrorism it is very important that the police and security services get the additional resources that are needed to do their job effectively. We should increase the funding for security services as well. Greg Stone (Photo: Newcastle Chronicle) \nIt’s important as well that we have effective solutions to tackle that threat. I do have concerns about the way the Conservatives want to go about this in terms of restricting freedoms on things like the internet, it’s not necessarily the way forward to deal with this. We do need to have an effective border force to manage the situation with people coming into and leaving the country. I think that is a way the government needs to be more regular. \nMK: Jonathan from the Green perspective are you happy with policing levels as they stand or what would you do differently? \nJE: Not at all. I’m not happy in the slightest with the policing levels as they stand. I just want to challenge than point made in relation to the need to pay back the debt because obviously since the coalition took power, and now the Conservatives, it’s not been paid off, it’s gone much much higher so more than a trillion now. Money hasn’t been saved therefore the reinvestment in public services, the reverse of that’s happened. I would like to draw attention to the Prevent Strategy which we haven’t talked about in this debate yet. \nWhen the coalition came to power that was if you like resculpted, it was actually working quite well but it’s changed so the message given to people in schools and communities and employer places was finger pointing, people were very suspicious of. But the appropriate training required the people to actually make a sensible identification of somebody that had been radicalised, didn’t materialise at the same time, so lots of false judgements were made. And so the Prevent Strategy, rather than being something that really helped us actually created divisions within the communities and stigmatised individuals. What we need actually is a return to good quality community based policing. \nWhen I was a kid I remember the village bobby, he knew everybody, he stopped things happening, he knew all the bad ‘uns, he stopped things happening before they happened. What I feel is actually very important is a return to that sort of community policing and especially the need to get police officers employed that are a representative of the ethnic make-up of the communities as well. So that they’re working much more closely. Now I’m not saying that’s the only answer but it’s clearly a very important weapon in our armoury to fight against this sort of extremism and I think it’s a great shame that we’re rolling back on that. Jonathan Elmer Where do the Green Party fit in? \nMK: Jonathan Elmer, where does the Green Party fit into this? I mean Caroline Lucas, she always performs well in the media, she’s a very impressive speaker, and some people actually do like Green Party policies, they never seem to get through the sense. Why is that? What can you do? \nJE : First I’d like to echo all of the other candidates and say in recollection of awful events I’d like to pay tribute to the performance of the police in the immediate aftermath. With regard to your question, people come up to me after those things and they say I really like what you’re saying, I really appreciate the policy ideas you’re putting forward and I would vote for you but for me it’s much more important to get rid of the Conservatives so I’m going to vote Labour. I have that so many times. Jonathan Elmer (Photo: Newcastle Chronicle) \nThe problem with Greens face is it’s not the lack of people supporting us, it’s the political system we have which is first past the post which acts to squeeze the small parties and encourage tactical voting so obviously we’re the party who’d do a hell of a lot better if we had a proportionate voting system. Greg Stone Lib Dems fighting for that 'middle ground' \nMK: Greg Stone the Liberal Democrat campaign, if you look at the polls again, doesn’t seem to have got off the ground, hasn’t got out of first gear, do you think that’s a fair assessment? \nGS: I don’t think that’s the case actually. In terms of the campaign we are seeing quite a polarised campaign, it’s almost a presidential style campaign between Jeremy Corby and Theresa May and even the Liberal Democrats, who were beaten so badly in 2015, for various reasons. Greg Stone (Photo: Newcastle Chronicle) \nIt’s been hard for us to get that traction to make the case for the Lib Dems being the best government, I don’t think that’s going to be the case, but what we are doing is fighting very hard in a number of key seats and looking to expand the number of Liberal Democrat MPs elected and to have more Liberal voices in parliament, we think that’s necessary and valuable to the process and frankly there is an acknowledgement that says we are seeing quite a left-wing Labour Party, quite a right-wing Conservative Party under the Conservative leadership and there is a big gap in the middle in the political centre which is not being addressed by either Labour or the Conservatives. There are a lot of people out there who think that neither Theresa May or Jeremy Corbyn are suitable for this country and there is a middle ground which the Liberal Democrats are in dispute for. Chi Onwurah Labour's message to North East people \nMK : Chi Onwurah, to turn the question slightly on its head, at the beginning of the campaign there was talk of a Tory landslide, now there’s talk of a hung parliament. Some people say imagine how the party would have done if there was a Labour leader who could be thought of as a Prime Minister, do you think that’s fair? \nCO: Well, first of all, I do really want to echo Duncan’s words about the horrendous attacks in Manchester and London and the impact on those who have suffered, their families and friends and the first responders, but also on the campaign generally. (Photo: Newcastle Chronicle) \nI think the fact that people have come together in an attack on our democracy has shown that we are more united together. It’s interesting isn’t it, because the more people see of Theresa May the more she doesn’t appeal. Whereas the more people have seen of Jeremy, and the rally last night was 10,000 people in the pouring rain where Jeremy talked about coming together, because the country’s not united but the Labour Party’s founding principles are about strength together, coming together, we have more in common than what divides us and people are really buying into that message from Jeremy, as well as not believing the message from Theresa May which was basically that you need to give me a blank cheque to do Brexit the way I want to. We are a democracy you know, we do Brexit in the interests of the many, not the few, which is exactly our message. Duncan Crute Disaster for Theresa May? \nMK : I’ll start with you Duncan. At the beginning of the election campaign, the Conservative Party had a 20 point lead. There was talk of Theresa May parking the Tory Party tank on the lawns of Labour’s heartlands like here in the North East. That lead today in some polls is down to 1%, for example, today had the Conservatives on 14.5% and Labour on 14.4. It’s been a bit of a disaster for Theresa May hasn’t it? \nDC: Well, first of all, good afternoon everyone, I really feel as if I can’t say anything, first of all, it’s been a horrific election campaign for me with the terrorist attacks we’ve had, I certainly felt very affected on Sunday by what happened and my campaign has been very limited and certainly my thoughts are with those who are still critically ill in hospital and those who lost their lives. Duncan Crute (Photo: Newcastle Chronicle) \nWith regard to the polls, I just don’t trust polls at all. I was involved in the Stronger In campaign where we were told consistently that we were going to win, we lost. You only have to look at the States, we were told consistently by the opinion polls that Hillary Clinton was going to walk the election and get a landslide majority and she didn’t, Donald Trump won. So opinion polls to me, I just do not listen to and I think the only poll that counts is when somebody is in that ballot box this week, voting for whichever party they choose to vote for. \nMK: So you’ve been impressed by Theresa May? \nDC : Absolutely. I think one thing we’ve got to look at is after the referendum this country was divided. It was socially, it was divided culturally, it was divided geographically and it was divided by age. And this lady came into power, she has united the country and many politicians would have crumbled, she was given a very very hard task to deal with and she had succeeded. Mike Kelly KEY EVENT Candidates introduced to start the debate \nWelcome to our live debate before the June 8th General Election and we’re delighted to welcome to our Newcastle representatives of four major parties in the region. \nWe have Duncan Crute, who is the Conservative candidate for Newcastle North, Chi Onwurah who’s Labour’s candidate for Newcastle Central. We’re also pleased to welcome the Liberal Democrat candidate for North Tyneside, Greg Stone and Jonathan Elmer, Green Party candidate for the city of Durham. \nYou will notice we have no UKIP representative, that isn’t for the lack of trying, we made requests in exactly the same way as we did the other four parties but they haven’t got back to us on that. Greg Stone, Duncan Crute, Mike Kelly, Chi Onwurah and Jonathan Elmer (Photo: Newcastle Chronicle) Share ", "external_links": [], "published": "2017-06-07T20:03:00.000+03:00", "crawled": "2017-06-07T15:32:03.000+03:00", "highlightTitle": ""}