{"organizations": [], "uuid": "8862a4cc34131245d6e4c789f5651205ae3be0be", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article9207344.ece/ALTERNATES/s1200/FIRST_ELECTED_MP_TONIGHT_2.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/result-general-election-exit-poll-12916372", "country": "GB", "domain_rank": 21960, "title": "What time will we know who has won the General Election 2017 and what time is the exit poll?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-08T19:30:00.000+03:00", "replies_count": 0, "uuid": "8862a4cc34131245d6e4c789f5651205ae3be0be"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/result-general-election-exit-poll-12916372", "ord_in_thread": 0, "title": "What time will we know who has won the General Election 2017 and what time is the exit poll?", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "none"}, {"name": "bridget phillipson", "sentiment": "none"}, {"name": "boudicca", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "houghton", "sentiment": "none"}, {"name": "sunderland tennis centre", "sentiment": "none"}], "organizations": [{"name": "washington & sunderland west", "sentiment": "none"}, {"name": "tories", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "sunderland south", "sentiment": "none"}, {"name": "houghton & sunderland south", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "pa", "sentiment": "none"}, {"name": "sunderland ‘brexit", "sentiment": "none"}, {"name": "general election", "sentiment": "none"}, {"name": "sunderland central", "sentiment": "none"}, {"name": "general election 2015 labour", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News What time will we know who has won the General Election 2017 and what time is the exit poll? After MPs voted to hold a snap election, we look at how election night will pan out and the importance of the North East results Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates     \nIt’s June 8 2017 and the polls have closed. So what happens next? \nWe look at how the result of the General Election will pan out over the course of the following few hours and the time that the party that has won will be known. What time do people stop voting? \nTechnically it’s supposed to be 10pm, however it can be extended in exceptional circumstances like in 2010 when a late surge meant hundreds of people hadn’t managed to vote by the official deadline through no fault of their own. \nRead more: What time will my polling station open and close for General Election 2017? \nWhat time will the exit poll be? \nThe exit poll is a record of people being asked about their vote as they leaving polling stations. Polling agents will be at around 100 constituencies throughout the day to make an accurate forecast. \nThe Iposos MORI exit poll will be released as soon as polling stations close at 10pm tonight. When will the first results start coming in? \nThis is where the North East comes out top. Historically Wearside constituencies tend to win this race. The Houghton & Sunderland South result is expected to be the first one to come in at around 11pm. It was declared at 10.48pm in 2015 when Bridget Phillipson claimed the seat for Labour. And which constituency comes next? First elected MP on the General Election 2015 Labour's Bridget Phillipson of Houghton and Sunderland South was declared at 10;48pm (Photo: © North News & Pictures ltd) \nSoon after came Sunderland Central then Washington & Sunderland West. However, for the EU referendum, Newcastle gave them all a run for their money. Why is the North East so good at the General Election count? \nObviously we’re the fittest and best organised region in the country. And, if we’re being honest, as the vast majority of our seats have in the past been indisputably Labour strongholds, the results lack a bit of political tension so organisers probably just like to create a bit of a competitive edge of their own. Read More Apathy was the biggest winner in the North East at the last general election And what about the forthcoming General Election? Labour's Bridget Phillipson, the first elected MP for the General Election 2015 of Houghton and Sunderland South at the Sunderland Tennis Centre count (Photo: PA) \nThis year the Sunderland results will have extra political resonance and be watched out for not just because of their promptness. Are you just trying to hype up what will be another predictable Labour shoo-in at the Sunderland polls? \nNot at all. It was the enormity of the Sunderland ‘Brexit’ vote which gave the first indication the UK was going to vote to leave the EU. Its choice was wholly at odds with Labour policy. Will those same voters now revert back to their traditional support of Labour or switch to Theresa May who has wrapped the ‘Brexit’ cloak around her shoulders like some latter day Boudicca. And what about UKIP? Read More General Election: How the North East voted last time - and where June's battles will be fiercest When is the result of the general election expected to be announced? Sunderland has been the first area to count its votes and declare its winners in the previous six elections (Photo: Getty Images Europe) \nOfficially the count goes through the night and finishes around 6am or 7am. However, unless it’s a very close run thing, the result can probably be called much earlier than that. Bearing in mind the opinion polls at present put the Tories over 20 points ahead of Labour, some are saying the result can be called right about now. Read More", "external_links": [], "published": "2017-06-08T19:30:00.000+03:00", "crawled": "2017-06-08T15:04:28.013+03:00", "highlightTitle": ""}