{"organizations": [], "uuid": "ca53ed448aa4648d868bb853970b11b535b038b5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article13230216.ece/ALTERNATES/s1200/NPosborne.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/analysis-northern-powerhouse-dead-theresa-13229807", "country": "GB", "domain_rank": 21960, "title": "Analysis - Is the Northern Powerhouse dead or will Theresa May help out the region?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-25T15:00:00.000+03:00", "replies_count": 0, "uuid": "ca53ed448aa4648d868bb853970b11b535b038b5"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/analysis-northern-powerhouse-dead-theresa-13229807", "ord_in_thread": 0, "title": "Analysis - Is the Northern Powerhouse dead or will Theresa May help out the region?", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "neutral"}, {"name": "jake berry", "sentiment": "neutral"}, {"name": "george osborne", "sentiment": "neutral"}, {"name": "ben houchen", "sentiment": "none"}, {"name": "ed cox", "sentiment": "none"}, {"name": "percy", "sentiment": "none"}, {"name": "ippr north", "sentiment": "none"}, {"name": "berry", "sentiment": "none"}, {"name": "cameron", "sentiment": "none"}, {"name": "hull", "sentiment": "none"}, {"name": "david cameron", "sentiment": "none"}, {"name": "paul swinney", "sentiment": "none"}, {"name": "jim o’neill", "sentiment": "none"}, {"name": "andrew percy", "sentiment": "none"}, {"name": "osborne", "sentiment": "none"}, {"name": "xi ping", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "liverpool", "sentiment": "none"}, {"name": "leeds", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "sheffield", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north", "sentiment": "none"}, {"name": "manchester airport", "sentiment": "none"}], "organizations": [{"name": "northern powerhouse", "sentiment": "neutral"}, {"name": "lancashire", "sentiment": "neutral"}, {"name": "eu", "sentiment": "none"}, {"name": "house of lords", "sentiment": "none"}, {"name": "general election", "sentiment": "none"}, {"name": "leeds", "sentiment": "none"}, {"name": "northern powerhouse rail", "sentiment": "none"}, {"name": "queen’s speech", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "centre for cities’ principal economist", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The Northern Powerhouse was the brainchild of George Osborne Share Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nLancashire MP Jake Berry has been named the new Minister for the Northern Powerhouse . \nBut is the Government as committed to the Northern Powerhouse policy as it used to be? \nIt was brainchild of George Osborne, the former Chancellor, and he convinced former Prime Minister David Cameron to make it a flagship policy. \nBut Mr Osborne is not in the government, and no longer even an MP. \nHe was brutally sacked by the current Prime Minister, Theresa May , who reportedly told him to “learn some emotional intelligence”. \nOfficially the Government remains committed to the Northern Powerhouse. \nBut Mrs May appears to share some of the concern of critics of the policy, who complained that it focused too much on Manchester and Leeds while the Government neglected other cities in the North, as well as other parts of the country. \nSpeaking in July 2016, she promised “a plan to help not one or even two of our great regional cities but every single one of them.” \nThe phrase “Northern Powerhouse” didn’t appear once in last week’s Queen’s Speech, when the Government set out its plans for the next two years, or in the 82-page document published by the Government to accompany it. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nBy contrast, the 2015 Queen’s Speech while Mr Cameron was in charge included the promise of legislation “to provide for the devolution of powers to cities with elected metro mayors, helping to build a Northern Powerhouse.” \nTheresa May’s government is concentrating instead on what it calls “a new modern, industrial strategy”, which it says is designed to “spread prosperity and opportunity across the country”. \nWork on the strategy is continuing, but announcements so far include plans for new Institutes of Technology across the county, allowing young people to take advanced technical qualifications and gain skills required by employers. \nThe Government argues that it remains committed to the Northern Powerhouse - it just wants to support the rest of the country too. \nAnd the Conservative general election manifesto did include a commitment to a key Northern Powerhouse policy - the creation of what the Government calls “Northern Powerhouse Rail”. \nThis will be a rail network linking Newcastle, Hull, Sheffield, Leeds, Manchester, Manchester Airport and Liverpool. \nBut it seems not everyone is convinced the Northern Powerhouse has a future. MP Jake Berry \nMr Berry was appointed as the new Northern Powerhouse Minister after his predecessor, Andrew Percy, resigned two weeks ago. Read More Three rail firms bidding to run HS2 high speed rail services have been named \nAnd Mr Percy issued a statement revealing that the Prime Minister asked him to stay in the role, but he turned her down because he wanted to “pursue other challenges.” \nIt follows the resignation last September of former Treasury Minister Jim O’Neill, a Member of the House of Lords and a key figure in pushing the Northern Powerhouse agenda. Andrew Percy MP \nThink tank the Centre for Cities said the Northern Powerhouse is likely to become less of a priority for Government because its attention is firmly on Brexit . \nBut cities in the North could keep the project alive, said Paul Swinney, the Centre for Cities’ Principal Economist. \nHe said: “While the Northern Powerhouse may have started as a government initiative, ultimately it will and should survive and thrive if the cities that comprise the Powerhouse want it to. \n“This is about cities taking control of the agenda and not waiting for government – particularly given its gridlock, and the likely dominance of Brexit in domestic policymaking in the coming years. \n“So the question about whether or not the Northern Powerhouse is still a priority is largely irrelevant. Northern cities can make the most of the term to market their place to investors overseas, while at the same time working hard to secure the kinds of jobs, businesses and skilled people to genuinely transform the north into an engine of the national economy. \n“The Tees Valley in particular, with its new metro mayor, is in a particularly good position to do this. It’s now up to Ben Houchen to use the new powers passed to him to create more better-paid jobs for the residents of the area.” Read More The North still backs Brexit one year after EU referendum - but we're pessimistic \nEd Cox, director of think tank IPPR North, said the Northern Powerhouse could help the North succeed once the UK leaves the EU . \nHe said: “As a government programme, it does seem that the Northern Powerhouse agenda has been downgraded following the departure of George Osborne and Jim O’Neill. Following the General Election though, the new government should seize the opportunity of a consensus from the three main parties to bring forward legislation on a high-speed east-west rail route. \n“But the Northern Powerhouse idea has always been more important than a government programme and we mustn’t underestimate the power of the term for bringing together northern stakeholders to collaborate where previously they wouldn’t have done so: for instance, the four northern ports are working together on improving freight connections across the North. \n“This brings real and tangible business benefits, which is why there is so much appetite within the North for much closer cooperation. Our cities and towns also have far more synergies than is often thought.” \nHe added: “What’s more, the ‘Northern Powerhouse’ is an incredibly strong brand for the North on the international stage. Only last month Chinese premier Xi Ping gave a major speech on trade to international leaders, referencing the Northern Powerhouse. \n“As we leave the EU, it is at the pan-Northern scale that we’ll be best-placed to maintain our global clout.” Like us on Facebook", "external_links": [], "published": "2017-06-25T15:00:00.000+03:00", "crawled": "2017-06-25T10:06:18.006+03:00", "highlightTitle": ""}