{"organizations": [], "uuid": "5e486d1642dd52be974b73f63e50453efb710a63", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13163876.ece/ALTERNATES/s1200/KMR_MGA_100414zyro_01.jpg", "site_section": "", "section_title": "", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-couple-build-10m-13163688", "country": "GB", "domain_rank": 21960, "title": "North East couple build £10m property firm after starting first company with a team of six staff - Chronicle Live", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.123, "site_type": "news", "published": "2017-06-09T21:19:00.000+03:00", "replies_count": 0, "uuid": "5e486d1642dd52be974b73f63e50453efb710a63"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-couple-build-10m-13163688", "ord_in_thread": 0, "title": "North East couple build £10m property firm after starting first company with a team of six staff - Chronicle Live", "locations": [], "entities": {"persons": [{"name": "julie", "sentiment": "none"}, {"name": "zyro", "sentiment": "none"}, {"name": "ayton", "sentiment": "none"}, {"name": "leven", "sentiment": "none"}, {"name": "russell taylor", "sentiment": "none"}, {"name": "wishtower", "sentiment": "none"}, {"name": "simon ellison", "sentiment": "none"}, {"name": "brexit  fergus laird", "sentiment": "none"}], "locations": [{"name": "county durham", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "riverside business park", "sentiment": "none"}, {"name": "balliol business park", "sentiment": "none"}, {"name": "darlington", "sentiment": "none"}, {"name": "wishtower", "sentiment": "none"}, {"name": "boldon business park", "sentiment": "none"}, {"name": "south tyneside", "sentiment": "none"}, {"name": "north tyneside", "sentiment": "none"}, {"name": "tyneside", "sentiment": "none"}, {"name": "longbenton", "sentiment": "none"}], "organizations": [{"name": "immunodiagnostic systems", "sentiment": "none"}, {"name": "naylors", "sentiment": "none"}, {"name": "raleigh court", "sentiment": "none"}, {"name": "leven estates", "sentiment": "none"}, {"name": "park electricals ltd", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "boldon business park", "sentiment": "none"}, {"name": "owen pugh ltd", "sentiment": "none"}, {"name": "hta real estate", "sentiment": "none"}, {"name": "leven estates share founders", "sentiment": "none"}, {"name": "leven estates ltd", "sentiment": "none"}, {"name": "surgo", "sentiment": "none"}, {"name": "zyro", "sentiment": "none"}, {"name": "middlesbrough", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "travelodge hotel", "sentiment": "none"}, {"name": "middlesbrough council", "sentiment": "none"}, {"name": "ral­eigh court", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "royal mail plc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business North East couple build £10m property firm after starting first company with a team of six staff Julie and Simon Ellison, who founded cycle parts firm Zyro in 1995, have made their fourth property investment through Leven Estates Share Founders of Darlington cycle firm Zyro have added to their successful property portfolio (Photo: Publicity pic) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nA couple who launched a successful North East cycle parts business are now building up an impressive property portfolio , after their investment vehicle snapped up two more buildings on Tyneside. \nJulie and Simon Ellison first founded Darlington firm Zyro in 1995, a cycle parts and accessories firm that started out with just six people and now employs around 150 at a 100,000sqft site in the County Durham town, making it the UK’s largest privately-owned business of its kind. \nNow the Great Ayton pair, who remain on the board of directors of Zyro following a private equity-backed management buyout in April 2016, are steadily increasing a strong portfolio of leisure and industrial properties across the region, through their investment company Leven Estates. \nIn the last two years, with assistance from Newcastle property specialist Naylors, Leven Estates has snapped up at least four properties in deals worth around £10m. \nThe latest deal has seen the acquisition of two industrial investments from Wishtower, an industrial property joint venture, to Leven for £2.35m. \nThe properties are located at Boldon Business Park, South Tyneside and Balliol Business Park, Longbenton. The Immunodiagnostic Systems (IDS) unit at Boldon Business Park which has been sold to Leven Estates in a double investment deal (Photo: HTA Real Estate) \nAt Boldon Business Park, South Tyneside, the firm has bought a 19,000sqft unit, which has additional expansion land, which is let to pharamaceutical firm Immunodiagnostic Systems (IDS) on a 15-year lease from July 2015 at £90,000 a year. \nThe second property, at Balliol Business Park in North Tyneside , is a 17,000sqft unit which is let to NHS Direct for 15 years from January 2012 at a rent of £79,000. Read More \nLast July Naylors’ investment agency team secured the acquisition of the Travelodge Hotel next to intu Metrocentre in Gateshead on behalf of Leven Estates Ltd. \nNaylors negotiated a purchase price of £3.7m, representing a yield of less than 6%. \nThat deal was swiftly followed by the purchase of Raleigh Court at the Riverside Business Park, Middlesbrough, for £4m. \nRal­eigh Court is a terrace of eight units totalling 112,000sqft, with occupiers including Middlesbrough Council, Royal Mail Plc, in a triple unit, Owen Pugh Ltd, Park Electricals Ltd and Typhoon International. \nRussell Taylor, director at HTA Real Estate who acted for the vendor, Wishtower, said: “Further strengthening of market conditions together with completion of a rent review with the NHS provided the opportunity for us to conclude a profitable sale on behalf of our client. \n“The industrial investment market continues to provide many opportunities for a wide range of buyers. There is a great deal of confidence in the sector which is underpinning rental growth and yield compression.” Read More Newcastle construction company Surgo warns of potential headwinds following Brexit \nFergus Laird, head of investment at Naylors added: “We had a specific requirement for single-let shed investments in the £1m price bracket for our retained clients, Leven Estates. Current market conditions mean very little stock of this nature is coming to the market. \n“However, we identified this as a potential opportunity and between HTA and Naylors an off-market deal was agreed, which was then executed in a swift and diligent manner.” Like us on Facebook", "external_links": [], "published": "2017-06-09T21:19:00.000+03:00", "crawled": "2017-06-09T16:35:17.011+03:00", "highlightTitle": ""}