{"organizations": [], "uuid": "a32475e65d243141ff9c933caedd02fa70c80969", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/30378774/16035544.jpg", "site_section": "http://www.thisisleicestershire.co.uk/elections2009/rss.html?chid=181299", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/why-we-still-use-pencils-to-vote-at-polling-stations/story-30378774-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "TessRushin published Why are pencils are still made available at Leicestershire...", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-08T18:40:00.000+03:00", "replies_count": 0, "uuid": "a32475e65d243141ff9c933caedd02fa70c80969"}, "author": "TessRushin", "url": "http://www.leicestermercury.co.uk/why-we-still-use-pencils-to-vote-at-polling-stations/story-30378774-detail/story.html", "ord_in_thread": 0, "title": "TessRushin published Why are pencils are still made available at Leicestershire...", "locations": [], "entities": {"persons": [{"name": "tess", "sentiment": "negative"}, {"name": "victoria jones", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "rebecca koncienzcy", "sentiment": "none"}, {"name": "rushin", "sentiment": "none"}], "locations": [{"name": "leicestershire", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "electoral commission", "sentiment": "none"}, {"name": "wales online", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Why are pencils still made available at Leicestershire general election polling stations By TessRushin | Posted: June 08, 2017 By Rebecca Koncienzcy, Victoria Jones 0 COMMENTS SHARES You can use pencils or pens to cast your vote Why are pencils still made available at Leicestershire general election polling... X \nCopy link to paste in your message / Comments (0) \nDuring the EU referendum, people started asking questions about the use of a pen or a pencil to mark the ballot paper and why we were still provided with pencils at polling stations. \nSocial media, particularly Twitter, was full of chatter around the use of why we don't use pens and the hashtag #usepens began trending. \nAs we take to the polls once more, the issue is being raised once again, so we have had a look at what the rules and regulations are. Why do we use pencils? \nIn the UK, pencils are traditionally used for the purposes of marking ballot papers and are made available inside polling stations for voters to use. \nThe Electoral Commission say the reason that pencils are traditionally used is partly for historical and practical reasons: with ink pens there is always a risk that they may dry out or spill, Wales Online reports . \nAlso, ink may cause some transfer of the mark the voter has made on the ballot paper when they fold it, thus potentially leading to a rejection as it may look like they have voted for more options than they are entitled to. \nRead more: Who should I vote for in the general election 2017? Our quiz might have the answer \nThe Electoral Commission explain: \"The use of pencils does not in itself increase the likelihood of electoral fraud. Legislation has built specific safeguards into the process, such as the requirement for seals to be attached to ballot boxes at the close of poll. \n\"By law, campaigners are also entitled to be present at that stage and to attach their own seals if they wish. At the start of the count, they can then observe those same seals being broken. \n\"Tampering with ballot papers is a serious offence and if anyone has evidence that ballot papers are being tampered with, they should report this to the police.\" So can I use a pen to vote? \nYes, the official advice from the Electoral Commission is that it's fine to use a pen OR a pencil to vote. It's your choice. \nThere is nothing to stop a voter from using a pen to mark their vote – there is no legal requirement for ballot papers to be marked with a pencil. \nIt seems that some people during the referendum, mostly Brexit supporters, were concerned that if they use pencil, their votes would be rubbed out. \nSo voters urged others to take their own pens to put a cross in the box so that it cannot be erased. \nThat came after a YouGov poll found that 46% of leave voters thought it is likely that the EU referendum would be rigged. \nThere was a similar scenario during the Scottish referendum, where voters urged others to use something more permanent than a pencil. ", "external_links": [], "published": "2017-06-08T18:40:00.000+03:00", "crawled": "2017-06-08T16:15:41.000+03:00", "highlightTitle": ""}