{"organizations": [], "uuid": "e9a4ab47ada369f2f543ce945704729d1fb51af5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13124974.ece/ALTERNATES/s1200/JS121476153.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13155907", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: North East business leaders react to General Election hung parliament result", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-09T15:00:00.000+03:00", "replies_count": 0, "uuid": "e9a4ab47ada369f2f543ce945704729d1fb51af5"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13155907", "ord_in_thread": 0, "title": "Business Breakfast LIVE: North East business leaders react to General Election hung parliament result", "locations": [], "entities": {"persons": [{"name": "getty", "sentiment": "negative"}, {"name": "theresa may", "sentiment": "negative"}, {"name": "jeremy corbyn", "sentiment": "negative"}, {"name": "tim farron", "sentiment": "negative"}, {"name": "andrew hodgson", "sentiment": "none"}, {"name": "coreena ford", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "general election", "sentiment": "negative"}, {"name": "party", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "coreena ford business", "sentiment": "none"}, {"name": "snp", "sentiment": "none"}, {"name": "lep", "sentiment": "none"}, {"name": "tories", "sentiment": "none"}, {"name": "dup", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Many business leaders are issuing their thoughts on Twitter. \nHere’s Graham Robb, owner of Recognition PR and Journal columnist \nAnd Ross Smith, policy director at the Chamber 8.34 Coreena Ford FSB chairman calls for political stability \nThe Federation of Small Businesses is calling for political stability and a delay to the beginning of Brexit talks in the wake of the General Election result. \nFSB National chairman Mike Cherry said: \nIn the coming hours and days, business needs immediate reassurance from the government that emerges about how it will protect the economy from any political turmoil. The UK must be seen to remain open for business, with a government committed to supporting enterprise. \nIt is important to go into the Brexit talks from a position of strength, focused on getting the best deal possible for trade and access to workers and skills. Negotiations should be led by a government and a Prime Minister that will be in place for the duration, and so we call for a delay to the scheduled start of negotiations rather than a rush to begin in 11 days’ time. The need for a transition period now becomes even stronger, providing the time to get Brexit right. \nIn the days ahead, FSB members will want to see ministers appointed and a clear timetable for the coming weeks. We are ready to work with the Government and all parties on what measures to bring forward. \nFSB secured a number of important commitments for small business in many of the party manifestos in this election, and we believe there will be strong support in the new Parliament for many of our asks - on business rates reform, on protecting the self-employed from unfair tax rises, and on tackling late payments by big companies to their small business suppliers. \nFSB has consistently engaged with major parties right across the political spectrum and will work positively and constructively with the Government that emerges, and MPs and Peers across all parties. Mike Cherry, chair of the Federation of Small Businesses 8.30 Coreena Ford Pound falls dramatically against the dollar following the election result \nAnd just in case you haven’t seen enough polls, graphs and charts, here’s one showing the pound’s dramatic slide against the dollar over the last 12 hours. A graph showing how the election result has affected the pound against the dollar this morning 8.20 KEY EVENT Sterling falls following hung parliament result \nThe FTSE 100 has risen 66 points to 7,516 following the shock general election result, but the pound has lost further ground against both the dollar and euro. \nThe pound has fallen sharply following the results - as of 8am it was was $1.2666 compared to $1.2937 at the previous close. \nPatrick Connolly, Certified Financial Planner, Chase de Vere, which has a Newcastle office, spoke of the impact on stock markets - and predicted the fall won’t last. \nHe said: \nLast night we saw another surprising election result, following in the footsteps of last year’s EU Referendum and the election of Donald Trump in the US. This result, with a hung parliament, causes uncertainty and could have an impact on stock markets, bond markets and currency markets as all generally hate uncertainty \nHowever, the impact of election results on stock markets tends to be short lived, as very quickly the uncertainty passes and stock market movements are again driven by global factors and general investor sentiment \nIt should be remembered that the UK stock market has risen significantly since the EU Referendum result and the US market has risen since the election of Donald Trump \nThe message for investors is very simple. While they may be feeling uncertain about what happens next, they need to remain calm and rational and understand that any short-term noise from the election result is likely to be just that, short-term. 8.10 KEY EVENT CBI tells politicians to 'get their house in order' \nBusiness leaders are urging politicians to “get their house in order” as quickly as possible, to bring stability and reassure the markets. \nCarolyn Fairbairn, CBI Director-General, said: \nThis is a serious moment for the UK economy. The priority must be for politicians to get their house in order and form a functioning government, reassure the markets and protect our resilient economy. \nPoliticians must act responsibly, putting the interests of the country first and showing the world that the UK remains a safe destination for business. It’s time to put the economy back to the top of the agenda. \nFor the next Government, the need and opportunity to deliver an open, competitive and fair post-Brexit economy that works for everyone across all our nations and regions has never been more important. \nThis can only be achieved if the next government doesn’t put the brakes on business, remains open to the world and sets out a pro-enterprise vision. \nFirms will support the UK develop our inclusive, innovative and open economy. More than ever, the new Government must work together with business to make the most of the opportunities ahead. Firms can provide the evidence, ideas and solutions from the shop, office and factory floor to secure our future prosperity. Head of the CBI, Carolyn Fairburn 8.00 Coreena Ford Business leaders react to General Election result. \nTheresa May will seek to stay on as Prime Minister and Tory leader despite failing to win a majority after her decision to hold a snap election backfired spectacularly. \nAs is stands now, with 646 seats declared, Tories have 315 seats, Labour 261, SNP 35, Lib Dems 12, DUP 10 and the others 13. \nNo party holds an absolute majority but May has pledged the Tories would offer “stability” as the largest party with the most votes. \nAs we digest the results, business groups and leaders are comments on the results. \nAndrew Hodgson, chair of the North East LEP, said the organisation affirmed its commitment to the \n“How Britain negotiates its exit from the EU will have a huge impact across the United Kingdom and especially here in the North East. \n“We will continue to work with all parties to achieve the best outcome for the region as the Government strives to secure the best deal for the UK. \n“We remain committed to delivering the North East’s Strategic Economic Plan, which has already created an extra 58,200 jobs in the local economy, and which will inform our response to future Government policy. \n“At this time of change and uncertainty we reaffirm our commitment to working in close partnership with the business community to ensure the North East’s strategic priorities remain high on the national agenda.” Andrew Hodgson, Chair of the North East LEP and CEO of SMD (Photo: Newcastle Chronicle) Share", "external_links": [], "published": "2017-06-09T15:00:00.000+03:00", "crawled": "2017-06-09T10:24:22.000+03:00", "highlightTitle": ""}