{"organizations": [], "uuid": "92a5f2d71cdaad7ea08992de5b918e5e0f6f6f91", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30363900/16024384.jpg", "site_section": "", "section_title": "", "url": "http://www.devonlive.com/what-s-the-story-behind-facebook-s-94million-fine-over-its-whatsapp-takeover/story-30363900-detail/story.html", "country": "US", "title": "What's the story behind Facebook's £94million fine over its WhatsApp takeover? | Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "", "spam_score": 0.122, "site_type": "news", "published": "2017-06-01T09:36:00.000+03:00", "replies_count": 0, "uuid": "92a5f2d71cdaad7ea08992de5b918e5e0f6f6f91"}, "author": "Western Morning News", "url": "http://www.devonlive.com/what-s-the-story-behind-facebook-s-94million-fine-over-its-whatsapp-takeover/story-30363900-detail/story.html", "ord_in_thread": 0, "title": "What's the story behind Facebook's £94million fine over its WhatsApp takeover? | Devon Live", "locations": [], "entities": {"persons": [{"name": "roger sa", "sentiment": "none"}, {"name": "wolferstans", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "south-west", "sentiment": "none"}], "organizations": [{"name": "facebook", "sentiment": "none"}, {"name": "commission", "sentiment": "none"}, {"name": "eu commission", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Comments (0) What's the story behind Facebook's £94million fine over its WhatsApp takeover? Roger Sands at Wolferstans explains. \nAs I sat down to decide what to write about for this piece, my eyes were drawn to the big story in the papers about a huge fine for household favourite Facebook relating to its takeover of the messaging app WhatsApp in 2014. \nThe story appealed for two reasons. First it features two mainstays of everyday life for many of us and, secondly, it has an interesting link to Brexit (doesn't everything!?). \nThe EU Commission has a regulatory role to play in investigating material corporate takeover activity. The takeover of WhatsApp in 2014 was material in anyone's language. Facebook paid an eye-watering 19 billion US dollars. I've spelled out the figure as I wasn't sure how many zero's to add to the 19 as I don't usually have to do that in my everyday life! \nAs part of the process Facebook had to provide piles of information to the EU Commission in its regulatory capacity. \nAs part of its submissions Facebook allegedly told the Commission that it would not be able to match user accounts on both the Facebook and the WhatsApp platforms but that, the Commission found, is what subsequently happened. \nThe Commission appears to have had a basis to find that Facebook staff knew in 2014 that it was possible to link WhatsApp phone numbers with Facebook users' identities although Facebook says that there was no intent behind the information provided. \nUser data is of course extremely valuable in the digital age and key to the way in which social media works. \nSo, just three very diverse lessons from this story for any business: \n1. Keeping data safe is vitally important. Be aware that use of social media can make others aware of things you might not want them to be aware of. The links running through social media platforms are far too clever for the likes of you and I. \n2. Be scrupulous with any information provided to any official investigation such as by HMRC or similar. \n3. This type of investigation is a good example of the type of infrastructure which the UK is going to have rebuild following Brexit. We have competition authorities but will have relied on the EU for a lot of the heavy lifting in this area. All of this takes time, specialist staff and of course money. This will need to be replicated across many areas including agriculture, tourism and marine-based industries, all vitally important to the South-West of course. Keeping abreast of developments will be more important than ever. \nIf you have any questions or would like any further information, please call 01752 663295 or email info@wolferstans.com \nSponsored content by Wolferstans", "external_links": [], "published": "2017-06-01T09:36:00.000+03:00", "crawled": "2017-06-01T04:42:43.000+03:00", "highlightTitle": ""}