{"organizations": [], "uuid": "3aa9030b3b12b5aa64e4d76bc8921e733bf9b035", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30406606/16056702.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "Devon Live Editor's Choices RSS feed", "url": "http://www.devonlive.com/three-whales-spotted-off-south-devon-coast/story-30406606-detail/story.html", "country": "GB", "title": "Three whales spotted off South Devon coast", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-23T23:17:00.000+03:00", "replies_count": 0, "uuid": "3aa9030b3b12b5aa64e4d76bc8921e733bf9b035"}, "author": "Zoe_Stevens", "url": "http://www.devonlive.com/three-whales-spotted-off-south-devon-coast/story-30406606-detail/story.html", "ord_in_thread": 0, "title": "Three whales spotted off South Devon coast", "locations": [], "entities": {"persons": [{"name": "berry head", "sentiment": "none"}, {"name": "robert jones", "sentiment": "none"}, {"name": "steve crowther", "sentiment": "none"}, {"name": "devon live", "sentiment": "none"}, {"name": "steve", "sentiment": "none"}, {"name": "david davis", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "berry head ranger", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "crowther", "sentiment": "none"}, {"name": "steve smith", "sentiment": "none"}, {"name": "bob crow", "sentiment": "none"}], "locations": [{"name": "south devon", "sentiment": "none"}, {"name": "north devon", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "guardhouse café", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "south devon coast", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "torcross", "sentiment": "none"}, {"name": "berry head", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "start bay", "sentiment": "none"}, {"name": "brixham", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "slapton", "sentiment": "none"}, {"name": "braunton", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "edinburgh", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "tory", "sentiment": "none"}, {"name": "bideford town council", "sentiment": "none"}, {"name": "the town council", "sentiment": "none"}, {"name": "rmt", "sentiment": "none"}, {"name": "exeter university", "sentiment": "none"}, {"name": "universities uk", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Three whales spotted off South Devon coast By Zoe_Stevens | Posted: June 23, 2017 0 COMMENTS SHARES \nWatch above: Two fishermen had the experience of a lifetime when a humpback whale emerged near their boat in March \nWhales were spotted off the South Devon coast on Friday morning. \nBerry Head Ranger tweeted to alert photographers to the sighting, saying that three whales had been seen heading south at 9am of the nature reserve in Brixham. @HenryKirkwood92 @SeaSkywatch @forestandbeach Today 9am: 3x whale seen(spp unknown), heading south. Also Tues @ Froward P: lge whale breach— Berry Head Ranger (@BerryHeadRanger) 23 June 2017 \nA spokesperson from the Guardhouse Café on Berry Head, said that they had heard a ranger speaking about a sighting of some whales on Friday morning. \n\"We heard one ranger saying that there were three whales around the coast,\" they said. \"That was this morning, and we haven't heard anything since then.\" \nThe humpback whale, that was seen swimming around South Devon in March, was once sighted off of Berry Head too. \nIn March, the humpback whale swam up and down the shore off Slapton and Torcross to the delight of nature lovers. \nThe whale created much excitement at Slapton and Torcross where it was regularly sighted. Two fishermen even had the experience of a lifetime when the whale emerged near their boat . \nRobert Jones captured this video of the whale. He said: \"My friend and I got a shock whilst out fishing on the Skerries banks in Start Bay when a Humpback whale swam past!\" READ NEXT: UKIP leader Steve Crowther calls for 'hardball' Brexit talks UKIP's interim leader has called on the British negotiating team to \"play hardball\" in negotiations to leave the European Union.In an interview to mark one year since the EU referendum, Devon's Steve Crowther has urged Brexit minister David Davis to take a tough stance in Brussels talks.Mr Crowther, who lives near Braunton in North Devon, spoke with Devon Live after officially becoming the party's leader until a permanent successor is named in September.He said it was \"right to play hard ball\" with the EU team and suggested the Tory team look to the unusual example of the uncompromising RMT leader Bob Crow, who died in 2014. Exeter uni boss and Brexit leader says negotiators 'can't see way forward' one year on from vote Sir Steve Smith, Vice-Chancellor at Exeter University and a leading player in the Brexit talks says negotiators 'cannot see a way forward'.Sir Steve is chairman of the Universities UK policy group, which is negotiating the shape of relationships with European academics after Britain leaves the EU.He is worried about the status of EU nationals working in Higher Education, including 579 in Exeter - 201 of which have applied for citizenship. Devon's 'best' New Year's Eve parties could be cancelled The future of one of the UK's best New Year's Eve parties hangs in the balance. Local councillors are concerned by a lack of revellers in recent years.Bideford's New Year's Eve celebrations have in past been compared with London and Edinburgh but now Bideford Town Council are looking at dropping the party aspect of its New Year's Eve celebration.The town council has not made a final decision on the celebration but in a statement on its website it states: \"The Town Council would like to support family entertainment during the afternoon, with a firework display at midnight.\" How the NSPCC can help parents worried about online child safety There is a lot of useful information available online and over the phone for adults concerned about their child's internet activity.Below are some essential contact details provided to us by the NSPCC.You can also watch our discussion about online child safety here. ", "external_links": [], "published": "2017-06-23T23:17:00.000+03:00", "crawled": "2017-06-23T19:50:59.000+03:00", "highlightTitle": ""}