{"organizations": [], "uuid": "d84490d1df0baada2a1b4d56be4d1736f5e3d383", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30376536/16033733.jpg", "site_section": "http://www.middevongazette.co.uk/all-content.rss", "section_title": "Devon Live All Content Feed", "url": "http://www.devonlive.com/shoppers-worry-about-food-prices-rather-than-farmers-survey-reveals/story-30376536-detail/story.html", "country": "GB", "title": "AthwennaIrons published Shoppers worry about food prices rather than farmers, survey...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-07T19:28:00.000+03:00", "replies_count": 0, "uuid": "d84490d1df0baada2a1b4d56be4d1736f5e3d383"}, "author": "AthwennaIrons", "url": "http://www.devonlive.com/shoppers-worry-about-food-prices-rather-than-farmers-survey-reveals/story-30376536-detail/story.html", "ord_in_thread": 0, "title": "AthwennaIrons published Shoppers worry about food prices rather than farmers, survey...", "locations": [], "entities": {"persons": [{"name": "annabel shackleton", "sentiment": "none"}, {"name": "caroline drummond", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}], "organizations": [{"name": "athwennairons", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "somerset", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Shoppers worry about food prices rather than farmers, survey reveals By AthwennaIrons   Consumers are concerned about how Brexit will impact the price and choice of food available, the findings of a new survey have found Shoppers worry about food prices rather than farmers, survey reveals   Consumers are concerned about how Brexit will impact the price and choice of food available, the findings of a new... Comments (0) \nConsumers are more concerned about how Brexit will impact the price and choice of food available than they are about the implications for British farmers, new research has revealed. \nLeaf (Linking Environment And Farming) surveyed shoppers about their Brexit fears, ahead of this year's Open Farm Sunday, which will take place this weekend and see many farms in the Westcountry opening their gates to the public. \nIn the survey of 2,000 UK adults, one in four respondents said they were worried that leaving the European Union might force farmers out of business, whereas 61% were worried about rising food prices and one in three about what EU foods will be available post Brexit. The majority of shoppers also admit they don't always buy British even when it is available. \nThe foods that consumers were most worried would be harder to find post Brexit were continental cheese (21%), soft fruits such as raspberries and strawberries (18%), tomatoes and peppers (15%) and chocolate (14%). \nThe sustainable farming charity, Leaf, also polled farmers about their concerns. In the online survey of 146 farmers, nearly six in 10 (59%) claimed that without the support of consumers the British farming sector would find it hard to compete with food produced in other nations post Brexit, and an overwhelming 85% of farmers believe the public needs to have a better understanding of British agriculture. \nFour in 10 farmer respondents said they believed people should be willing to pay more for British foods, however nearly one in five consumers (17%) believe British produce should actually be cheaper than its foreign counterparts. \nREAD NEXT: Haul of glittering gold awards for Somerset egg producers \nJust half of those questioned said they always buy British meat when available, with fewer always buying British cheese (42%), fresh vegetables and salad (35%) or fresh fruit (28%). Even those willing to pay more were only willing to spend an extra 11% on average for British foods. \nCommenting on the findings, Leaf chief executive Caroline Drummond said: \"It's essential that as we work towards leaving the European Union, the public understand and value what farmers do for us all. Farmers play a vital role – not just in producing the food we eat and caring for the countryside but they also contribute to so many aspects of all our daily lives – from medicines and cosmetics, to fuel and even what we wear, the cars we drive and the buildings we live and work in.\" \nShe added: \"Leaf Open Farm Sunday is the perfect opportunity to speak with farmers and hear at first-hand about what happens beyond the farm gate – and why they need our support.\" \nFor farmers, the survey found that their biggest concerns are payments from government decreasing (76%), business costs increasing (60%) and an increase in imports from non-EU nations (51%). Less than one in five (18%) farmers believe Brexit will be good for British farming, with nearly half (47%) feeling they will be worse off afterwards. \nThree-quarters of farmers (78%) who took part said they felt they themselves should be doing more to promote the farming industry to the public – and this weekend's Open Farm Sunday will see hundreds of farms doing just that. \nSince the first Open Farm Sunday in 2006 more than 1.8 million people have visited a Leaf Open Farm Sunday event. The mostly free events will offer a range of activities from tractor trailer rides, farm walks and bug hunts, to feeding lambs, shearing and milking demonstrations. The technology and science behind farming and food production will also be a focus; providing visitors with a first-hand insight into the world of farming. \nAnnabel Shackleton, Open Farm Sunday manager at Leaf, said: \"Farming plays a vital part in each of our lives. Leaf Open Farm Sunday gives us the rare opportunity to see farming in real life and to learn about the hard work, care and pride that goes into the work farmers do, which is so vital to the environment, our lives and the economy.\" READ NEXT:", "external_links": [], "published": "2017-06-07T19:28:00.000+03:00", "crawled": "2017-06-07T16:15:15.002+03:00", "highlightTitle": ""}