{"organizations": [], "uuid": "a843e531f8c25c9e8803d348626dfe802892c686", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/30386834/16041386.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/mobile-phone-roaming-charges-will-finally-be-abolished-this-friday/story-30386834-detail/story.html", "country": "US", "domain_rank": 48128, "title": "EU mobile phone roaming charges will finally be scrapped this Friday | Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.101, "site_type": "news", "published": "2017-06-13T20:00:00.000+03:00", "replies_count": 0, "uuid": "a843e531f8c25c9e8803d348626dfe802892c686"}, "author": "Josie Clarke", "url": "http://www.leicestermercury.co.uk/mobile-phone-roaming-charges-will-finally-be-abolished-this-friday/story-30386834-detail/story.html", "ord_in_thread": 0, "title": "EU mobile phone roaming charges will finally be scrapped this Friday | Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "gunther oettinger", "sentiment": "none"}, {"name": "ernest doku", "sentiment": "none"}, {"name": "alex neill", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "turkey", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "channel islands", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "leicester mercury mobile", "sentiment": "negative"}, {"name": "vodafone", "sentiment": "none"}, {"name": "monaco", "sentiment": "none"}, {"name": "mirror online", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Mobile phone roaming charges within the EU will finally end this Friday EU mobile phone roaming charges will finally be scrapped this Friday X \nCopy link to paste in your message / \nrits are set to save millions of pounds a year on holiday as a new piece of legislation comes into force. \nMobile roaming charges will finally be abolished from Friday 15 June. \nThis means that mobile phone users will be able to use their regular allowance for no extra cost - from anywhere in the EU. \nRead more: Christmas ice rink plans for new Leicester public square \nThe legislation, called Roam Like Home, aims to prevent holidaymakers from coming home to a huge mobile phone bill after their holiday in Europe, Mirror Online reports . \nSo-called \"bill shock\" from holidaying in the EU affected more than nine million UK mobile users a year, according to research by comparison website uSwitch. \nConsumers have been especially vulnerable since the smartphone market exploded and mobile data consumption soared. \nHowever, while consumers will benefit from the agreement while the country remains a member of the EU, there is uncertainty as to whether or not it will continue following Brexit. \nWhich? warned consumers to remember that, even though the UK is still part of the EU, the regulations only apply to roaming, not to calling EU countries from the UK and prices vary significantly. \nExceeding agreed minutes, texts and data will still be charged in the EU as it would in the UK, with all providers charging different rates. \nCompanies can also include different countries in their roaming territories, which can vary further depending on whether the tariff is pay as you go or pay monthly. \nFor example, some 02 pay as you go customers continue to incur roaming charges in the Channel Islands, the Isle of Man, Monaco and Switzerland, whereas O2 pay monthly customers will not. \nWhich? urged consumers to check if their provider is including Turkey in the ban, finding that Vodafone is the only one to include the popular non-EU tourist destination in its roaming bundle, while others are charging between 69p and £1.65 a minute to call home. \nAlex Neill, Which? managing director of home products and services, said: \"Many will reap the benefits of these changes and will no longer be put off from making calls abroad. \n\"However, it is important that you take a close look at what is or isn't included in your current mobile deal. Not knowing what's included could lead to some surprising charges on your next bill.\" \nEuropean Commissioner Gunther Oettinger has said the agreement showed the EU could deliver tangible results to improve the daily life of Europeans, adding that \"roaming charges will be soon old memories\". \nRead more: Leicester set for mini heat-wave this week \nErnest Doku, mobiles spokesman at uSwitch.com , said any attempt to re-introduce the charges if the UK lost participation in the policy post Brexit would \"a bitter pill for consumers to swallow\". \n\"For those providers looking to step up and stand out, they'd do well to look at how free EU roaming could be maintained. \n\"Teamed with a strategic push into non-EU destinations and a concerted effort to make roaming more affordable regardless of destination, this would serve as a seriously competitive move in an industry where differentiation is key.\" ", "external_links": [], "published": "2017-06-13T20:00:00.000+03:00", "crawled": "2017-06-13T15:57:12.000+03:00", "highlightTitle": ""}