{"organizations": [], "uuid": "86559665dde15dd9749f6ed2e19977035ca34878", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article13125306.ece/ALTERNATES/s1200/parla.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/what-hung-parliament-uk-election-13125387", "country": "GB", "domain_rank": 21960, "title": "We have a hung parliament - so what does that mean? And what is a coalition government?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-09T14:00:00.000+03:00", "replies_count": 0, "uuid": "86559665dde15dd9749f6ed2e19977035ca34878"}, "author": "Sean Seddon", "url": "http://www.chroniclelive.co.uk/news/north-east-news/what-hung-parliament-uk-election-13125387", "ord_in_thread": 0, "title": "We have a hung parliament - so what does that mean? And what is a coalition government?", "locations": [], "entities": {"persons": [{"name": "david cameron", "sentiment": "none"}, {"name": "john major", "sentiment": "none"}, {"name": "ted heath", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "nick clegg", "sentiment": "none"}, {"name": "tim farron", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "wilson", "sentiment": "none"}, {"name": "harold wilson", "sentiment": "none"}], "locations": [{"name": "belgium", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "uk parliament", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}], "organizations": [{"name": "snp", "sentiment": "none"}, {"name": "tory", "sentiment": "none"}, {"name": "coalition", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "lib dem", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "houses of parliament", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nWhen the starting pistol for the 2017 general election campaign was fired back in April it was confidently predicted Theresa May would lead the Conservatives to a landslide victory. \nBut a hung parliament was eventually confirmed at around 5.30am after an initial exit poll predicted the Conservatives would not win a majority. \nIt’s been a bruising experience for the Prime Minister while Labour leader Jeremy Corbyn has performed much better than many expected. \nHere's everything you need to know about a hung parliament. The Houses of Parliament with party leaders Theresa May, Jeremy Corbyn and Tim Farron (below) What is a hung parliament? \nIt is where no single party wins enough seats at an election to have a majority in Parliament. This is 50% plus one. \nGeneral Election 2017 results LIVE: Exit poll reveals potential hung parliament \nThere are 650 seats in the UK Parliament so one party would need at least 326 for a majority. \nAt the moment, with nine seats still to declare, the Conservative party have won 310 seats, Labour 260, the SNP 35 and the Lib Dems 12. \nThat means that no party can win an overall majority. What happens if no party wins 326 seats? \nThe convention is that the largest party should be given a chance to form an administration but there’s no hard and fast rule on this. \nIt basically comes down to which parties can do a deal to secure enough support to run a government. \nThe question will be whether Theresa May, having lost the majority she inherited from David Cameron, has enough support within her own party to try to form a government. What sort of deals are we talking about? \nOne arrangement would be a Coalition government , like the UK had from 2010 to 2015, when David Cameron’s Tory party won 307 seats. He struck a deal with Nick Clegg’s Lib Dems who had won 57 seats, to give it a working majority. David Cameron and Nick Clegg Are Coalitions the only option? \nNo. A party could decide to form a minority government and rely on occasional support from rival parties in order to pass laws. \nIt’s not the easiest or most stable way of doing things but, if a deal isn’t on the table, it’s the only option. \nJohn Major’s Conservatives were forced to do that in 1996 because, although they won a slim majority in 1992, various defections and by-election defeats meant they dropped below that golden 50% mark towards the end of their run in office. Read More When will we know the General Election 2017 winner and who will be Prime Minister? How likely is a minority government to happen in the UK in 2017? \nIt looks like the second of two of the most likely results. Despite the narrowing of the poll gap Theresa May’s Conservatives look almost certain to be the largest party. If she doesn’t get a majority she would have two options: go it alone, or strike deals with other parties when she needs to, or form a coalition. \nWith the exception of the unionists in Northern Ireland, who command only a handful of seats, there isn’t really an obvious Coalition partner available to her. \nSo it would probably have to be a minority government, a disastrous outcome for her “strong and stable” leadership, particularly with Brexit to negotiate. Are there any other options? \nA third option is a very unlikely alliance of all the other parties - Labour, Lib Dem, SNP, Green, Plaid Cymru and maybe even one or two of the parties from Northern Ireland. A ‘rainbow’ coalition or a coalition of chaos, depending on your political view. And what if there isn’t a deal? Conservative party leader Theresa May (Photo: PA) \nWell, then there isn’t a government (try not to look so pleased). \nThat happened in Belgium after their 2010 election produced a parliament divided between 11 parties, none of whom had anywhere enough support to control things. It took them 541 days to find a solution. Read More What is an MP and what do they do? Our guide as Britain prepares to go to the polls Are hung parliaments common? \nAlthough hung parliaments have been a plausible outcome of the last two elections, they’re still quite rare. \nBefore 2010, the last time an election produced a hung parliament was in February 1974, when Harold Wilson defeated Ted Heath by four seats but fell short of an overall majority. That was the first since 1929. Read More Will there be ANOTHER General Election? Why a hung parliament might mean it happens Would we have to have another election? \nIn the absence of a Coalition or any other arrangement, there would likely need to be another election fairly soon, especially with Brexit talks looming. \nIn October 1974, Wilson called a second election and won a majority - of just three. Like us on Facebook", "external_links": [], "published": "2017-06-09T14:00:00.000+03:00", "crawled": "2017-06-09T09:39:20.017+03:00", "highlightTitle": ""}