{"organizations": [], "uuid": "ce28b5dc3d194e1d259b6088326e964785c43640", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/30380812/16037143.jpg", "site_section": "http://www.thisisleicestershire.co.uk/specialolympics/rss.html?chid=181121", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/what-s-next-for-the-tories-labour-lib-dems-and-ukip-after-the-general-election-result/story-30380812-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "Hayley_Watson published What's next for the Conservatives, Labour, Lib Dems and UKIP...", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-09T15:10:00.000+03:00", "replies_count": 0, "uuid": "ce28b5dc3d194e1d259b6088326e964785c43640"}, "author": "Hayley_Watson", "url": "http://www.leicestermercury.co.uk/what-s-next-for-the-tories-labour-lib-dems-and-ukip-after-the-general-election-result/story-30380812-detail/story.html", "ord_in_thread": 0, "title": "Hayley_Watson published What's next for the Conservatives, Labour, Lib Dems and UKIP...", "locations": [], "entities": {"persons": [{"name": "amber rudd", "sentiment": "none"}, {"name": "jack blanchard", "sentiment": "none"}, {"name": "paul nuttall", "sentiment": "none"}, {"name": "farron", "sentiment": "none"}, {"name": "jason beattie", "sentiment": "none"}, {"name": "david davis", "sentiment": "none"}, {"name": "vince cable", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "nigel farage", "sentiment": "none"}, {"name": "ben glaze", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "tim farron", "sentiment": "none"}, {"name": "jo swinson", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "boris johnson", "sentiment": "none"}, {"name": "philip hammond", "sentiment": "none"}, {"name": "nuttall", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}], "organizations": [{"name": "lib dems", "sentiment": "negative"}, {"name": "ukip", "sentiment": "negative"}, {"name": "labour", "sentiment": "negative"}, {"name": "cabinet", "sentiment": "none"}, {"name": "tories", "sentiment": "none"}, {"name": "leicestershire ukip  ukip", "sentiment": "none"}, {"name": "mirror online", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "What's next for the Conservatives, Labour, Lib Dems and UKIP after the general election result? By Hayley_Watson | Posted: June 09, 2017 By Jason Beattie, Ben Glaze, Jack Blanchard 0 COMMENTS SHARES Comments (0) \nAfter the shock result of a hung parliament, Britain's main political parties are in discussion for what comes next. \nThe bets are also on for the future prime minister as the future of Theresa May's position is being questioned. \nWith so much to consider, Mirror Online took a look at what the future could hold for May, Corbyn and the others. \nHere is what could be next for the leaders of the Conservatives, Labour, Lib Dems, and UKIP. Conservatives \nIn years to come, the Tories' 2017 campaign will be studied as a textbook example of exactly how an election should not be run. \nPolitical students, strategists and opponents will want to understand how Theresa May went to the country with almost certain victory in her sights – and ended up having to scramble for votes. \nThey will want to know how a Prime Minister facing a ramshackle Opposition and backed by most of the national press managed to squander a 20-point poll lead and finish the election with her reputation damaged and judgment questioned. \nMrs May ends the campaign a diminished figure and possibly out of a job. \nThis is what could happen next: \nWhere did the Conservatives go wrong? \nThe Conservatives were brought down by a mix of hubris and misjudgment. \nFacing accusations they had little to offer in terms of policy, Mrs May's team slipped into the manifesto at the last moment – and without consultation with senior Cabinet colleagues – plans for what quickly became known as the Dementia Tax . \nIt alienated her core vote: The elderly. \nWill Theresa May continue to lead the Conservative party? \nWith the results in it's fair to say she could struggle to stay in her post. \nTory MPs will turn on her for deciding to call an unnecessary election which now threatens to leave them weaker in power – or even out of power. \nMrs May will have to take full responsibility if they cannot manage to achieve the numbers necessary to form a government. It would be seen as a self-inflicted wound which the Prime Minister brought about through over-reaching in her self-belief and which should have been avoided. \nRead more: What is a hung parliament? This is what happens when nobody wins \nWho would lead the Tories if Mrs May stood aside? \nThere is no clear candidate. Foreign Secretary Boris Johnson could throw his hat in the ring, as could Chancellor Philip Hammond. \nThe outsiders are Amber Rudd , who has served as Mrs May's Home Secretary and who performed well during the campaign, even standing in for her in the televised leaders' debate, which Mrs May snubbed. \nAnother outside option is David Davis. Labour \nIf last night's exit poll is proved correct then Jeremy Corbyn has confounded each and every one of his critics. \nAfter almost two years of internal turmoil under his leadership Labour had been widely expected to suffer a crushing defeat in the snap general election. \nDespite a stunning leadership victory in 2015 he faced months of hostility – and one failed leadership challenge – from his disgruntled MPs. \nBut he has surprised many within his party over the past seven weeks at the energetic and imaginative election campaign he has fought. \nAnd now he has crushed Theresa May's hopes of a big victory, his future as Labour leader is surely secure. \nThese are the questions that must now be answered for Labour: Liberal Democrats \nTim Farron is likely to face a leadership battle after a poor Lib Dems campaign. \nThe party pinned its hopes on winning over large swathes of pro-EU voters in the aftermath of last year's bruising Brexit referendum. \nBut the campaign was heavily criticised for focusing too much on the EU and poll ratings were almost static. \nMr Farron, above, became leader only in 2015 after the party's ballot box battering at the last general election. \nNow with many within the party suggesting they need a fresh start, the return of Jo Swinson and Sir Vince Cable to the Commons may lead to a change of leader. \nRead more: General election results in Leicester and Leicestershire UKIP \nUKIP's future as a major party is in doubt as its post- Brexit referendum identity crisis looks set to continue. \nLeader Paul Nuttall, above, has been under increasing pressure to justify UKIP's ongoing existence as Britain waits in the EU departure lounge. \nHe responded by pulling his party further to the right as the election campaign wore on. \nUKIP's future could lie as an anti-immigration pressure group, dedicated to increasingly hardline statements about Islamist extremism. \nBut Mr Nuttall could face calls to quit after failing to make the case the party was still relevant, as he struggles to emerge from Nigel Farage's shadow.", "external_links": [], "published": "2017-06-09T15:10:00.000+03:00", "crawled": "2017-06-09T13:11:23.000+03:00", "highlightTitle": ""}