{"organizations": [], "uuid": "133fecfd57860e38a9b1057812e3ce2cd5f58f86", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bostonstandard.co.uk", "main_image": "http://res.cloudinary.com/jpress/image/fetch/w_300,f_auto,ar_3:2,c_fill/http://www.skegnessstandard.co.uk/webimage/1.7980259.1496413355!/image/image.jpg", "site_section": "http://www.skegnessstandard.co.uk/rss/cmlink/1.346949", "section_title": "Skegness Standard MSKP.news.feed", "url": "http://www.bostonstandard.co.uk/news/general-election-boston-and-skegness-candidates-talk-education-1-7991042", "country": "GB", "title": "GENERAL ELECTION: Boston and Skegness candidates talk education", "performance_score": 0, "site": "bostonstandard.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-04T16:00:00.000+03:00", "replies_count": 0, "uuid": "133fecfd57860e38a9b1057812e3ce2cd5f58f86"}, "author": "", "url": "http://www.bostonstandard.co.uk/news/general-election-boston-and-skegness-candidates-talk-education-1-7991042", "ord_in_thread": 0, "title": "GENERAL ELECTION: Boston and Skegness candidates talk education", "locations": [], "entities": {"persons": [{"name": "matt warman", "sentiment": "none"}, {"name": "paul kenny", "sentiment": "none"}, {"name": "phil smith", "sentiment": "none"}, {"name": "philip smith", "sentiment": "none"}, {"name": "paul nuttall", "sentiment": "none"}, {"name": "paul nuttall", "sentiment": "none"}, {"name": "victoria percival", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "paul kenny", "sentiment": "none"}, {"name": "victoria percival  mike gilbert", "sentiment": "none"}, {"name": "mike gilbert", "sentiment": "none"}, {"name": "matt warman", "sentiment": "none"}], "locations": [{"name": "boston", "sentiment": "none"}, {"name": "pilgrim hospital", "sentiment": "none"}, {"name": "lincolnshire", "sentiment": "none"}], "organizations": [{"name": "education maintenance allowance", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}, {"name": "green party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Have your say \nAhead of the election on June 8 we are asking each candidate – in 150 of their own words – to explain their stance on the major topics which affect your everyday lives. - this week, Brexit. \nThe nominations have closed...and we now know our next MP will be one of those featured on these pages. Former councillor Mike Gilbert \nSix candidates have put their names forward... but who will be victorious on election night? Your votes will decide. \nAhead of the election on June 8 we will be asking each candidate – in their own words – to explain their stance on the major topics which affect your everyday lives. \nThis, we hope, will help inform your decision at the ballot box. \nLast week, our candidates took a look at health, and the week prior Brexit. Matt Warman. \nToday, we continue with another important local issue – education. \nOn Wednesday- a day before the election - we will also be giving the candidates one last chance to try to win your vote - as they address you directly telling you why you should put a cross at the side of their name. \nWe will then have reaction and coverage from the count throughout the night at www.bostonstandard.co.uk \nHere’s what your candidates have to say (list in alphabetical order by party): Victoria Percival \nMIKE GILBERT (BLUE REVOLUTION) – I believe education should be about giving core skills to young people so they can develop and specialise as they get older. I don’t believe that education should be about social engineering, a trend that has developed as parenting has become less consistent. Education should start in the home when parents train children to behave. This is necessary before a teacher can teach them and they go on to a lifetime of learning. Education must be right for the child’s aptitude so I see no problem with selective education. We have become accustomed to the idea that education is the sole responsibility of the state. The state has a role but by far the greatest contribution to learning comes from the parents and the individual child themselves. I don’t like the modern education ‘industry’ and would scrap SATS and stop six-figure salaries for executive heads. Such salaries are immoral. \nMATT WARMAN (CONSERVATIVE) – Lincolnshire’s great school system is why many people are drawn here - and our performance is all the more remarkable considering we have been underfunded for decades, and often struggle to recruit teachers. I’m delighted the government plans to address this and introduce a fair funding formula, increasing our budgets and seeing no school cut thanks to an extra £4bn in education. I’ve worked with the Education Secretary to make sure we get the best possible education for young people in Boston and Skegness and I will continue to do so. To make the best use of the budget, we will replace school lunches for younger children with a free school breakfast for all primary school children, though those from low-income families will continue to receive free lunches throughout primary and secondary school. We will continue to focus on vocational and technical training, expanding apprenticeships so that everyone gets the right education. \nVICTORIA PERCIVAL (GREEN PARTY) – The Green Party understands children learn in different ways, being a teaching assistant in special needs school I see this every day. The current education system of large classes and under-funding is failing our kids, and their futures. Teachers spend many years training and working hard, to gain the Ofsted level of ‘outstanding’ but they are leaving the profession. They either leave to go and teach in other countries or change career entirely. SATs are stopping teachers from teaching and cause children way to much stress at such a young age. Many parents are concerned for their child’s wellbeing and don’t feel they are the best measurement of a child’s intellect when they are so young. I want to see schools get the funding they so desperately need, and work with teachers, parents, children and businesses to find a practical, long term curriculum which supports every child. \nPAUL KENNY (LABOUR) – In a civilised society, all people should have access to free education throughout their lives. It would make our country strong and fit to compete around the world. The Tories are failing our young people with their savage cuts to schools and colleges and they are failing our country by reducing access of adults to lifelong learning. Labour will ensure schools are properly resourced by reversing the Conservatives’ cuts. Labour will limit class sizes to 30 pupils for all 5-7 year olds and bring in free school meals for all primary pupils. Labour will restore the Education Maintenance Allowance for 16 to 18-year-olds from lower and middle income backgrounds. We will reintroduce maintenance grants for university students, and abolish university tuition fees. Labour would introduce free, lifelong education in Further Education Colleges, enabling everyone to upskill or retrain at any point in life. Paul Kenny outside Pilgrim Hospital. \nPHILIP SMITH (LIBERAL DEMOCRAT) – The Liberal Democrats have always put education at the heart of our agenda. Every child deserves the best start in life. But Conservative school cuts mean that children’s chances are determined too often by their parents’ income and where they’re from. We will: Invest nearly £7 billion extra in children’s education, so that no school loses money per pupil in cash terms; Triple the Early Years Pupil Premium to £1,000 - giving children from disadvantaged backgrounds the best start in life; Our children’s futures are too often overshadowed by the need for schools to focus on the next set of league tables; Teachers deserve to be treated as professionals, given the flexibility and support to apply their expertise; Schools should be free to encourage children to participate in a truly rounded curriculum promoting the arts, sport and culture - to increase their ability to learn, and to feed their passion for knowledge. \nPAUL NUTTALL (UKIP) – UKIP’s approach to education is one where no child is held back and where education is as responsive as possible to individual needs. Our children differ vastly when it comes to talent and speed of development. Our education system needs to be far more flexible, particularly at a secondary level, and our approach focuses on a range of different schools including technical, vocational and selective grammar schools. We in UKIP want to see grammar schools in every town across the country. We would adapt the old 11+ system to add transfer exams up to the age of 16, so pupils who develop academically have the opportunity of a grammar school place. UKIP will also invest in vocational education and technical training, scrap tuition fees for STEM subjects and prepare our young people for the world of work, and you can see more of our proposals in our manifesto at: www.ukip.org/manifesto2017 Liberal Democrat Phil Smith UKIP leader, Paul Nuttall, launching his campaign bus at Boston bus park, followed by a campaign walk on High Street. Pictured meeting Boston fishermen. Sign in", "external_links": [], "published": "2017-06-04T16:00:00.000+03:00", "crawled": "2017-06-04T13:14:20.004+03:00", "highlightTitle": ""}