{"organizations": [], "uuid": "9547c14bfdc77fe0e315a29dc9132420907b99cd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30376671/16034238.jpg", "site_section": "http://www.middevongazette.co.uk/news.rss", "section_title": "Devon Live news RSS feed", "url": "http://www.devonlive.com/how-to-vote-in-the-2017-general-election-if-you-just-love-devon/story-30376671-detail/story.html", "country": "GB", "title": "Baffled by General Election spin and jargon - here's what the...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-07T21:25:00.000+03:00", "replies_count": 0, "uuid": "9547c14bfdc77fe0e315a29dc9132420907b99cd"}, "author": "Devon Live", "url": "http://www.devonlive.com/how-to-vote-in-the-2017-general-election-if-you-just-love-devon/story-30376671-detail/story.html", "ord_in_thread": 0, "title": "Baffled by General Election spin and jargon - here's what the...", "locations": [], "entities": {"persons": [{"name": "devon l", "sentiment": "none"}, {"name": "keith rossiter", "sentiment": "none"}, {"name": "bill", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "hull", "sentiment": "none"}], "locations": [{"name": "brussels", "sentiment": "none"}, {"name": "liverpool", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}, {"name": "cambridge", "sentiment": "none"}, {"name": "midlands", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}, {"name": "republic", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "oxford", "sentiment": "none"}], "organizations": [{"name": "general election", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "northern powerhouse", "sentiment": "none"}, {"name": "science vale", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "labour  promises", "sentiment": "none"}, {"name": "crossrail", "sentiment": "none"}, {"name": "houses of parliament", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Baffled by General Election spin and jargon - here's what the parties really stand for... By Devon Live | Posted: June 07, 2017 0 COMMENTS SHARES Baffled by General Election spin and jargon - here's what the parties really... X \nCopy link to paste in your message / Comments (0) Confused about where to place your mark tomorrow? Want the best for Devon but unsure which party will deliver a thriving economy, a prosperous relationship with the EU and a health service that can cope with demand? Keith Rossiter cuts through the jargon and spin to tell you where parties actually stand on the county's key issues. BREXIT Conservatives \nPromise \"smooth and orderly departure\" and a \"deep and special partnership\" with the EU. \nWill enter negotiations \"in a spirit of sincere co-operation\" but ready to walk away on the grounds that \"no deal is better than a bad deal for the UK\". \nWhile taking Britain out of the single market and customs union, promise to repatriate EU law through a Great Repeal Bill, seek a comprehensive free trade agreement with the EU and future trade deals around the world, control immigration, secure entitlements of UK nationals living in the EU, retain workers' rights and achieve \"as frictionless a border as possible\" between Northern Ireland and the Republic. \nReady to pay a \"fair\" divorce bill but will no longer allow \"vast annual contributions\" to EU budgets. \nFinal agreement subject to a vote in both Houses of Parliament. Labour \nAccepts referendum result and aims to build \"a close new relationship with the EU\", prioritising jobs and living standards and protecting workers' rights and environmental standards. \nWould scrap the Conservative white paper on Brexit and introduce new negotiating priorities that have \"a strong emphasis\" on retaining the benefits of the single market and the customs union. Would immediately guarantee the rights of EU nationals living in Britain. \nRejects the option of leaving without a withdrawal deal and is ready to negotiate a transitional arrangement to avoid a \"cliff-edge\". Conservative Great Repeal Bill would be replaced by an EU Rights and Protections Bill. \nLabour would give \"a meaningful role to Parliament throughout negotiations\" including a \"truly meaningful vote\" on the final deal, and would introduce a presumption that powers transferred from Brussels are devolved to UK regions and nations. Liberal Democrat \n\"Passionately\" believe Britain is better off in the EU and will fight a hard Brexit \"every step of the way\". Acknowledges the result of last year's vote, but would insist on a final withdrawal deal being put to voters in a second referendum, with the option of continued EU membership on the ballot paper. \nWill press for the UK to unilaterally guarantee the rights of EU nationals in the UK and will seek continued membership of the single market and the maintenance of free movement as part of any withdrawal deal. \nWill aim to protect schemes for UK students to study in Europe, preserve \"maximum co-operation\" on law and order, retain European Health Insurance Card, reduced telephone roaming charges and pet passports and campaign against reduction in funding for science. IMMIGRATION Conservative \nCut net migration below 100,000 a year. Would \"reduce and control immigration\" while ensuring that businesses can recruit \"the best and brightest\" from around the world and universities can attract overseas students. \nDouble to £2,000 a year the charge on companies employing migrant workers, with revenues invested in skills training for UK workers. Immigration health surcharge would rise to £600 for migrant workers and £450 for international students. \nEarnings threshold for people wishing to sponsor migrants for family visas will be increased. Visa requirements for students will be tightened and they will be required to leave the country at the end of their course, unless they meet new thresholds. Overseas students will continue to be included in migration statistics. Labour \nPromises \"fair rules and reasonable management of migration\" and rejects \"bogus\" immigration targets. Pledges not to scapegoat migrants, discriminate between people of different race or creed or blame them for economic failures. \nNew migration system identifying labour and skill shortages in consultation with business and unions. Promises action to end exploitation of migrant workers, stop overseas-only recruitment packages and increase prosecutions for paying below the minimum wage. \nReinstate a migrant impact fund to mitigate strains on public services in areas with high numbers of incomers. Remove international students from immigration statistics. \nIncome thresholds for visas would be replaced by a ban on accessing public funds. Indefinite detention of migrants ended. Britain would take in its \"fair share\" of refugees. Liberal Democrat \nPromises to ensure the immigration system works \"fairly and efficiently\". \nAnnual parliamentary debate would identify migration needed to meet labour and skill shortfalls. Would allow high-skilled immigration, remove students from migration statistics and reinstate post-study work visas for some overseas graduates. \nA centrally funded migration impact fund would help local communities and there would be additional government funding for English lessons for new arrivals. \nWould continue to \"uphold our responsibilities\" to assist refugees, offering safe and legal routes to the UK for refugees. Some 50,000 vulnerable people would be admitted from Syria over five years and the Dubs Scheme would be reopened to take in 3,000 unaccompanied child refugees. Limit of 28 days on immigration detention. RAIL TRANSPORT Conservative \nWill continue what the party describes as the biggest investment in Britain's railways since the Victorian era. \nWill support the High Speed 2 rail line from London to the Midlands and North of England and a Northern Powerhouse rail link between Liverpool and Hull. \nTackle train overcrowding by creating extra capacity, bring in new lines and stations, and improve existing routes, including for freight. \nServices would be increased on main lines and commuter routes, and new services would be launched to places which are poorly served or host major new housing projects. \nReview rail ticketing and appoint a passenger ombudsman. Labour \nWould renationalise the railways as franchises expire, with caps on fares, free wifi, safe staffing levels and improved accessibility for people with disabilities. End the expansion of driver-only services. \nNew rolling stock would be publicly owned and procured from British companies whenever possible. \nWould complete the HS2, and extend it into Scotland, linking the line with a Crossrail of the North serving northern cities. \nWould build a new Brighton Main Line and a Crossrail 2 north-south link through London and complete the Science Vale transport arc from Oxford to Cambridge, as well as delivering rail electrification and expansion across the whole country. Liberal Democrat \nPromise \"a modern railway system run for the benefit of its customers\". New rail franchises required to have a stronger focus on customers, including a programme of investment in new stations, lines and modern trains. \nPublic sector bodies and mutual groups involving staff and passengers enabled to bid for franchises. \nWould pursue electrification of the rail network, improve stations, reopen smaller stations, restore twin-track lines to major routes and proceed with HS2, HS3 and Crossrail 2, including development of a high-speed network stretching to Scotland. \nSupport takeover of metro services in London by London Overground and introduce a rail ombudsman. ENVIRONMENT Conservative \nManifesto pledges to ensure this is \"the first generation to leave the environment in a better state than we inherited it\". \nWould lead international action against climate change and degradation of habitat and loss of species, working with overseas territories to create a Blue Belt of marine protection. \nFarmers would be offered technical expertise to deliver environmental improvements and stronger protections for ancient woodland. \nShale gas industry would be encouraged – under \"rigorous\" environmental standards – with a greater percentage of taxes going directly to the communities where wells are based. Labour \nWould ensure Britain meets climate change targets and transitions to a low-carbon economy. \nBan fracking and invest in renewable energy projects, including tidal lagoons. Ensure EU environmental protections are maintained after Brexit and would champion sustainable farming, food and fishing. \nOffers a new Clean Air Act, Blue Belt safeguards for habitats and species in the seas around the UK, targets for plastic bottle deposit schemes and a ban on neonicotinoids to protect bees. The party would plant a million trees of native species across the country. Liberal Democrat \nWill maintain EU environmental standards in UK law, and would pass five green laws - a Green Transport Act, a Zero-Carbon Britain Act, a Nature Act, a Green Buildings Act, and a Zero-Waste Act. \nEnvironmental priorities: insulate four million properties, cut deaths from air pollution by 40,000 a year, and refocus farming support towards producing healthy food and public benefits. \nBan new diesel cars and small vans and introduce a scrappage scheme for those already on the roads. \nPut a 5p charge on disposable coffee cups. Read more: ", "external_links": [], "published": "2017-06-07T21:25:00.000+03:00", "crawled": "2017-06-07T17:59:14.010+03:00", "highlightTitle": ""}