{"organizations": [], "uuid": "6aad81ee7e87708d9ed2f42e1c4a779dfecf1cc0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30405987/16055972.jpg", "site_section": "http://www.middevongazette.co.uk/all-content.rss", "section_title": "Devon Live All Content Feed", "url": "http://www.devonlive.com/man-thrown-out-of-devon-question-time-audience-for-heckling-guests/story-30405987-detail/story.html", "country": "GB", "title": "Neil_Shaw published Man thrown out of Devon Question Time audience for heckling...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-23T15:50:00.000+03:00", "replies_count": 0, "uuid": "6aad81ee7e87708d9ed2f42e1c4a779dfecf1cc0"}, "author": "Neil_Shaw", "url": "http://www.devonlive.com/man-thrown-out-of-devon-question-time-audience-for-heckling-guests/story-30405987-detail/story.html", "ord_in_thread": 0, "title": "Neil_Shaw published Man thrown out of Devon Question Time audience for heckling...", "locations": [], "entities": {"persons": [{"name": "david dimbleby", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "dimbelby", "sentiment": "none"}, {"name": "remainer gina miller", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "david lidington", "sentiment": "none"}, {"name": "ian blackford", "sentiment": "none"}, {"name": "steve", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "gina miller", "sentiment": "none"}, {"name": "steve german", "sentiment": "none"}, {"name": "dimbleby", "sentiment": "none"}, {"name": "david liddington", "sentiment": "none"}, {"name": "lidington", "sentiment": "none"}], "locations": [{"name": "plymouth", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "taunton deane", "sentiment": "none"}], "organizations": [{"name": "bbc", "sentiment": "none"}, {"name": "snp", "sentiment": "none"}, {"name": "general election", "sentiment": "none"}, {"name": "socialist party", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Man thrown out of Devon Question Time audience for heckling guests By Neil_Shaw | Posted: June 23, 2017 3 COMMENTS SHARES \nQuestion Time presenter David Dimbleby had an audience member escorted out of the building when the BBC political panel show was filmed in Plymouth on Thursday night. \nThe man, who has not been named, was ejected after repeatedly heckling members of the panel. \nThe show had already heard the man discuss how Jeremy Corbyn's Labour Party was the winner of the General Election while the Tories and Blairites were big losers. He said Theresa May is not a legitimate prime minister thanks to the election result. \nHe shouted out several times during the rest of the filming, including shouting 'tax the rich' at panel member David Liddington and interrupting Remainer Gina Miller. \nBut after bellowing \"tax the rich\" at Tory minister David Liddington and making loud interventions when anti-Brexit campaigner Gina Miller was speaking, the veteran broadcaster had had enough. \nMr Dimbleby then said: \"Listen, I think you ought to leave, you know.\" He added: \"I know you have your views. You're one person in an audience of 150, I don't want you taking over this programme. He's speaking, let him speak.\" \nAs MPs David Lidington (Conservative) and Ian Blackford (SNP) battled it out over Brexit and Article 50, shouts were heard from the audience – Dimbleby stepped in saying: \"Don't shout out, I'll bring a microphone to you in a bit. But if you keep shouting out nobody can hear you.\", reports plymouthherald . \nAfter a few more words from David Lidington, Dimbelby interrupts and tells the irate man that the room would listen to him \"because of his shouting out.\" \nThe fraught audience member said: \"It's somewhat unedifying to see all of these politicians and one non-politician who represents the one per cent. \n\"There's a common consensus here and you're all dodging the actual question – millions of people watching television here tonight are screaming and shouting probably at their television screens because you are all studiously avoiding the question. \nConservative MP David Lidington lost his patience with the audience member, named locally as Steve German \n\"The question was, has Theresa May's Government got any legitimacy losing their majority. All the pundits, all the academics, all the commentaries, all the politicians, the career politicians represented gathered around this panel here tonight, guaranteed that Theresa May's gamble would pay off, that she would come back with a majority of 100 seats, 120 seats – that Corbyn would be buried under a landslide. Jeremy Corbyn has proven that anti-austerity policies are popular – that's the question. \n\"The Tories and the Blairites lost that election.\" \nDimbleby tried to calm the man down, saying: \"I know you have your views. You're one person in an audience of 150, I don't want you taking over this programme. He's speaking, let him speak.\" \nAs Lidington attempted to discuss the need to find a solution to the social care crisis, the man shouted out again – but the fuming justice secretary snapped, pointing and shouting at the disruptive audience member. \nEven as pro-Remain campaigner Gina Miller moved on to Theresa May's hung parliament, the man shouted: \"She's a zombie Prime Minister!\" \nIt is then David Dimbleby finally loses his patience and tells the man to leave. \nDimbleby tells Steve to leave \nWithout hesitation, the audience member – named locally as Steve German, stands up and walks off to applause and cheering from the crowd. \nSteve stood in the General Election as a Socialist Party candidate and is also a Trade Unionist. \nHe polled 118 votes in Taunton Deane at the 2015 election. ", "external_links": [], "published": "2017-06-23T15:50:00.000+03:00", "crawled": "2017-06-23T13:06:08.013+03:00", "highlightTitle": ""}