{"organizations": [], "uuid": "1b73d541f776fa4efa27762a68b53e81afcf652f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13217867.ece/ALTERNATES/s1200/The-State-Opening-Of-Parliament-2017.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/here-eight-brexit-laws-parliament-13217431", "country": "GB", "domain_rank": 21960, "title": "Here are the eight Brexit laws Parliament will debate over the next two years", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-21T20:34:00.000+03:00", "replies_count": 0, "uuid": "1b73d541f776fa4efa27762a68b53e81afcf652f"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/here-eight-brexit-laws-parliament-13217431", "ord_in_thread": 0, "title": "Here are the eight Brexit laws Parliament will debate over the next two years", "locations": [], "entities": {"persons": [{"name": "jeremy corbyn", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}], "organizations": [{"name": "parliament", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "westminster", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "queen’s speech", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Here are the eight Brexit laws Parliament will debate over the next two years No fewer than eight new laws are needed to prepare the way for leaving the European Union, according to the Government Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily   Thank you for subscribing!   \nEight new laws are planned over the next two years to allow the United Kingdom to leave the European Union . \nThe legislation was set out in the Queen’s speech, when the Government published its plans for the future. \nUsually, a Queen’s Speech sets out proposed new laws to be introduced over one year. \nBut this time, the Government has decided the Queen’s Speech should cover a two year period. \nMinisters say this is because Parliament needs time to get new Brexit laws right. \nBut critics of Conservative Prime Minister Theresa May say this will help her to stay in power, following a disappointing result in the June 8 general election, when the Conservatives lost their majority. \nThe new Brexit laws are likely to dominate debate at Westminster over the next two years. Prime Minister, Theresa May and opposition Labour Party leader Jeremy Corbyn (Photo: Getty Images Europe) \nThey include: Repeal Bill \nThis will repeal the European Communities Act 1972 and convert EU law into UK law as we leave the EU. \nMinisters say the aim is to ensure that EU rules and laws that apply now also apply after Brexit, rather than simply abolishing them all at once. \nHowever, it will then be possible to scrap specific rules that came from the EU, as time goes by. Customs Bill \nTo ensure that the UK has a standalone customs regime after Brexit, allowing the UK to negotiate its own trade agreements, and set its own VAT levels. Trade Bill \nTo allow the UK to operate its own independent trade policy. This will help the UK sign new trade deals with other countries, according to the Government. Immigration Bill \nThis will end free movement and make it clear that EU nationals and their families are subject to UK law in the same way as immigrants or potential immigrants from other parts of the world. \nThe Queen’s Speech does not make clear what happens to EU nationals already living in the UK. Read More Theresa May backtracks on pledge to recruit 10,000 more mental health staff Fisheries Bill \nTo enable the UK to control access to fisheries and management of its waters. This includes setting UK fishing quotas once we leave the EU. Agriculture Bill \nTo support UK farmers after we leave the EU. \nAt the moment, UK farmers get subsidies of £3.5 billion a year from Europe’s Common Agricultural Policy, and the Treasury has pledged in the past to maintain that spending to 2020 - but not necessarily beyond. Read More Here's what's NOT in the Queen's Speech after Theresa May ditched her manifesto Nuclear Safeguards Bill \nTo give the Office for Nuclear Regulation powers to take on the role and responsibilities required to meet international safeguards. International Sanctions Bill \nTo return decision making powers on non-UK sanctions to the UK. \nIt means the UK will continue to comply with international law. Like us on Facebook", "external_links": [], "published": "2017-06-21T20:34:00.000+03:00", "crawled": "2017-06-21T16:07:36.006+03:00", "highlightTitle": ""}