{"organizations": [], "uuid": "b4074f5e28632d1245de5266f1c1837f541f018e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article13166130.ece/ALTERNATES/s1200/JS119067787.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/general-election-north-east-mps-13165758", "country": "GB", "domain_rank": 21960, "title": "General Election 2017: Meet your new North East MPs", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-10T03:11:00.000+03:00", "replies_count": 0, "uuid": "b4074f5e28632d1245de5266f1c1837f541f018e"}, "author": "Chris Knight", "url": "http://www.chroniclelive.co.uk/news/north-east-news/general-election-north-east-mps-13165758", "ord_in_thread": 0, "title": "General Election 2017: Meet your new North East MPs", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "andy mcdonald", "sentiment": "none"}, {"name": "nick varley", "sentiment": "none"}, {"name": "grahame morris", "sentiment": "none"}, {"name": "julie elliott", "sentiment": "none"}, {"name": "blackman-woods", "sentiment": "none"}, {"name": "kevan jones", "sentiment": "none"}, {"name": "sharon hodgson", "sentiment": "none"}, {"name": "phil wilson", "sentiment": "none"}, {"name": "simon clarke", "sentiment": "none"}, {"name": "nick brown", "sentiment": "none"}, {"name": "alex cunningham", "sentiment": "none"}, {"name": "ian mearns", "sentiment": "none"}, {"name": "helen goodman", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "rishi sunak", "sentiment": "none"}, {"name": "morris", "sentiment": "none"}, {"name": "guy opperman", "sentiment": "none"}, {"name": "james wharton", "sentiment": "none"}, {"name": "laura pidcock", "sentiment": "none"}, {"name": "mary glindon", "sentiment": "none"}, {"name": "phillipson", "sentiment": "none"}, {"name": "sunak", "sentiment": "none"}, {"name": "chapman", "sentiment": "none"}, {"name": "mary glindon  ms glindon", "sentiment": "none"}, {"name": "campbell", "sentiment": "none"}, {"name": "stephen hepburn", "sentiment": "none"}, {"name": "bridget phillipson  ms phillipson", "sentiment": "none"}, {"name": "jarrow", "sentiment": "none"}, {"name": "chi onwurah", "sentiment": "none"}, {"name": "hepburn", "sentiment": "none"}, {"name": "mckinnell", "sentiment": "none"}, {"name": "bridget phillipson", "sentiment": "none"}, {"name": "mike hill", "sentiment": "none"}, {"name": "brown", "sentiment": "none"}, {"name": "julie elliot", "sentiment": "none"}, {"name": "alan beith", "sentiment": "none"}, {"name": "pat glass", "sentiment": "none"}, {"name": "hill", "sentiment": "none"}, {"name": "opperman", "sentiment": "none"}, {"name": "william hague", "sentiment": "none"}, {"name": "david anderson", "sentiment": "none"}, {"name": "catherine mckinnell", "sentiment": "none"}, {"name": "ronnie campbell", "sentiment": "none"}, {"name": "jenny chapman", "sentiment": "none"}, {"name": "george boateng", "sentiment": "none"}, {"name": "lewell-buck", "sentiment": "none"}, {"name": "mearns", "sentiment": "none"}, {"name": "henry newman", "sentiment": "none"}, {"name": "berwick anne-marie trevelyan", "sentiment": "none"}, {"name": "jones", "sentiment": "none"}, {"name": "goodman", "sentiment": "none"}, {"name": "williams", "sentiment": "none"}, {"name": "ian lavery", "sentiment": "none"}, {"name": "blaydon", "sentiment": "none"}, {"name": "elliott", "sentiment": "none"}, {"name": "anne-marie trevelyan", "sentiment": "none"}, {"name": "onwurah", "sentiment": "none"}, {"name": "iain wright", "sentiment": "none"}, {"name": "andy mcdonald", "sentiment": "none"}, {"name": "paul williams", "sentiment": "none"}, {"name": "roberta blackman-woods", "sentiment": "none"}, {"name": "david miliband", "sentiment": "none"}, {"name": "cunningham", "sentiment": "none"}, {"name": "emma lewell-buck", "sentiment": "none"}, {"name": "tony blair", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "anna turley", "sentiment": "none"}, {"name": "turley", "sentiment": "none"}, {"name": "alan campbell", "sentiment": "none"}, {"name": "liz twist", "sentiment": "none"}, {"name": "blair", "sentiment": "none"}, {"name": "lavery", "sentiment": "none"}, {"name": "jenny chapman  darlington", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "boris johnson", "sentiment": "none"}], "locations": [{"name": "westminster", "sentiment": "none"}, {"name": "south shields", "sentiment": "none"}, {"name": "newcastle east", "sentiment": "none"}, {"name": "bedale", "sentiment": "none"}, {"name": "darlington", "sentiment": "none"}, {"name": "northallerton", "sentiment": "none"}, {"name": "auckland", "sentiment": "none"}, {"name": "laura pidcock - labour north west durham", "sentiment": "none"}, {"name": "teesside", "sentiment": "none"}, {"name": "stockton south", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "houghton", "sentiment": "none"}, {"name": "stokesley", "sentiment": "none"}, {"name": "north west durham", "sentiment": "none"}, {"name": "north durham", "sentiment": "none"}, {"name": "sedgefield", "sentiment": "none"}, {"name": "great ayton", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "cramlington", "sentiment": "none"}, {"name": "blyth sports centre", "sentiment": "none"}, {"name": "blyth valley", "sentiment": "none"}, {"name": "pidcock", "sentiment": "none"}, {"name": "easington", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "east cleveland", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "north tyneside", "sentiment": "none"}, {"name": "richmond", "sentiment": "none"}], "organizations": [{"name": "newcastle central) labour candidate", "sentiment": "none"}, {"name": "tory", "sentiment": "none"}, {"name": "newcastle east", "sentiment": "none"}, {"name": "labour - tynemouth", "sentiment": "none"}, {"name": "newcastle central", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "newcastle united", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "lib dem", "sentiment": "none"}, {"name": "mirrorpix)  labour", "sentiment": "none"}, {"name": "hartlepool", "sentiment": "none"}, {"name": "newcastle north) labour", "sentiment": "none"}, {"name": "south tyneside council", "sentiment": "none"}, {"name": "mcdonald", "sentiment": "none"}, {"name": "ms trevelyan", "sentiment": "none"}, {"name": "middlesbrough south", "sentiment": "none"}, {"name": "middlesbrough", "sentiment": "none"}, {"name": "sunderland central", "sentiment": "none"}, {"name": "blyth", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "labour - stockton south", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}, {"name": "berwick", "sentiment": "none"}, {"name": "hexham", "sentiment": "none"}, {"name": "oxford", "sentiment": "none"}, {"name": "labour - stockton north) stockton north labour", "sentiment": "none"}, {"name": "sunderland west) labour partys pink bus", "sentiment": "none"}, {"name": "newcastle chronicle)  labour", "sentiment": "none"}, {"name": "tories", "sentiment": "none"}, {"name": "wearside", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "sunderland south", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}, {"name": "commons backbench business committee", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}, {"name": "newcastle north", "sentiment": "none"}, {"name": "general election", "sentiment": "none"}, {"name": "conservative", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "manchester metropolitan university", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily   \nPrime Minister Theresa May may have managed to hang on to her place in Government, but Labour continues to dominate the North East. \nThe region voted overwhelmingly in favour of leader Jeremy Corbyn in the General Election, restricting the Conservative Party to just four seats. \nThe Tory gain in Middlesbrough South and East Cleveland was cancelled out by Labour’s Paul Williams coming out on top in Stockton South. \nWith that in mind, many of our MPs will be familiar faces in their constituencies. \nBut after Thursday’s General Election , here’s a look at the men and women who will be representing the North East in Parliament. Anne-Marie Trevelyan (Conservative - Berwick) Conservative MP for Berwick Anne-Marie Trevelyan \nThe Conservatives managed to hold on to the seat they earned in 2015 after Lib Dem stalwart Sir Alan Beith stepped down. \nEarning 41.1% of the vote, Ms Trevelyan has developed a high profile and was a staunch Brexiteer. Helen Goodman (Labour - Bishop Auckland) Labour MP Helen Goodman (Photo: Mirrorpix) \nLabour held on to the seat fiercely targeted by the Tories by a narrow margin - triumphing by just 502 seats. \nMs Goodman is known for her opposition to Corbyn, but managed to hold on despite a visit to the area from Boris Johnson in the week before the vote. Liz Twist (Labour - Blaydon) Liz Twist (Photo: @TarkId=34098) \nFormer regional head of health for union UNISON, Ms Twist took over from previous MP David Anderson, who announced his decision to step down in April for personal and health reasons. \nThe Conservatives regained second spot from UKIP, but despite their push Twist came out comfortably on top, winning 26,979 votes. Ronnie Campbell (Labour - Blyth Valley) Blyth MP Ronnie Campbell (Photo: Newcastle Chronicle) \nLabour stalwart Mr Campbell once again came out on top in the constituency he has represented since June of 1987. \nThere had been doubts over whether Mr Campbell would contest the seat as he had to undergo chemotherapy last year to treat stomach cancer. \nBut cheers filled Blyth Sports Centre as the defiant former miner was announced victorious in his seventh election. Roberta Blackman-Woods (Labour - City of Durham) Roberta Blackman-Woods \nThe former Shadow Housing Minister was one of many to resign in 2016 after losing confidence in party leader Corbyn. \nBut Ms Blackman-Woods held on to the seat she has occupied since 2005, boosting her majority in the process. Jenny Chapman (Labour - Darlington) MP Jenny Chapman \nDarlington was another top Tory target that Labour managed to fend off, slightly increasing their majority to 3,280 votes in the process. \nMs Chapman racked up 22,681 votes and secured 50.61% of the total vote. Kevan Jones (Labour - North Durham) Kevan Jones MP \nMr Jones has held the seat since 2001 and was voted in with a comfortable majority of more than 13,000. \nSpeaking directly after his victory was confirmed, he claimed May’s “gamble” on a fresh election had “failed”. Laura Pidcock (Labour - North West Durham) Laura Pidcock - Labour North West Durham (Photo: Newcastle Chronicle) \nNewly-elected Ms Pidcock, 29, is from Cramlington and studied politics at Manchester Metropolitan University. \nShe won 5,234 more votes than her predecessor Pat Glass, who stood down. Grahame Morris (Labour - Easington) Grahame Morris (Photo: Newcastle Chronicle) \nMr Morris was re-elected with a majority of 14,892 and took home 23,152 votes. \nSpeaking after the result was declared, he said that the Labour Party was attracting younger voters in a way he had never seen. Ian Mearns (Labour - Gateshead) Ian Mearns (Photo: Newcastle Chronicle) \nMr Mearns, who has held the seat since 2010, has campaigned against cuts to council funding, which has hit services such as social care. \nHe had an important role at Westminster as chair of the Commons Backbench Business Committee, which helps decide what gets debated in Parliament. Mike Hill (Labour - Hartlepool) Mike Hill, Labour MP for Hartlepool (Photo: Handout) \nThe first-time candidate held the seat despite Conservative pressure after former MP Iain Wright stepped down. \nBut Labour’s majority actually increased under Mr Hill, rising to 52.5% of the total vote. Guy Opperman (Conservative - Hexham) Guy Opperman \nConsidered the safest Conservative constituency in the North East, the Tories held the seat with a majority of almost 10,000. \nMr Opperman, a former barrister and amateur jockey, is a Tory moderate with a key government role as a whip. Bridget Phillipson (Labour - Houghton and Sunderland South) Wearside MP Bridget Phillipson \nMs Phillipson held the seat she has occupied since 2010, despite a small dip in her majority. \nSome commentators felt the Tories could pinch the Wearside seats, but Phillipson finished a comfortable 12,324 votes ahead of her nearest rival. Stephen Hepburn (Labour - Jarrow) 28,020 Stephen Hepburn MP \nMr Hepburn, who is a former Deputy Leader of South Tyneside Council, boosted his majority to a massive 17,263 in the seat he has held since 1997, \nSpeaking after the constituency result was announced, he called for the Tories ‘austerity agenda’ to be dropped immediately. Andy Mcdonald (Labour - Middlesbrough) Andy McDonald MP (Photo: Daily Mirror) \nTypically regarded as one of Labour’s safest seats, Mr McDonald’s majority dipped slightly despite increasing his share of the vote by nearly 9%. \nThe constituency has remained red ever since it formed in 1974. Simon Clarke (Conservative - Middlesbrough South and East Cleveland) Simon Clarke (Photo: Evening Gazette) \nThe former Oxford student, who lists George Boateng as his favourite ever Boro player, became the first ever Tory MP for the constituency. \nStanding at 6ft 7, the man nicknamed ‘Stilts’ at school is now Britain’s second tallest MP. Chi Onwurah (Labour - Newcastle Central) Labour Candidate for Newcastle Central, Chi Onwurah (Photo: Newcastle Chronicle) \nMs Onwurah held her seat in the first result to be declared in the latest General Election, edging out rivals Sunderland. \nThe Newcastle United supporter has represented her constituency since 2010. Nick Brown (Labour - Newcastle East) 28,127 Labour candidate for Newcastle East, Nick Brown wins (Photo: Newcastle Chronicle) \nJeremy Corbyn’s chief whip polled 28,127 votes on a turnout of 63.71%, an increase on the 19,378 votes he received in 2015. \nMr Brown, who has represented Newcastle East since 1983, returned to the role under Corbyn in October 2016 - the third time he has held the post in frontline politics. Catherine McKinnell (Labour - Newcastle North) Labour candidate for Newcastle North, Catherine McKinnell wins (Photo: Newcastle Chronicle) \nMs McKinnell, who was one of several MPs who quit the shadow cabinet in opposition to Corbyn in 2016, held her seat and increased her majority. \nShe received 26,729 votes, up on the 20,689 votes she polled at the 2015 General Election. Mary Glindon (Labour - North Tyneside) MP Mary Glindon \nMs Glindon kept her North Tyneside seat with 33,456 votes, while her nearest competitor Conservative Henry Newman bagged 14,172. \nSpeaking after the result was announced, she said Labour’s success in the constituency had come about from discussing the NHS and education rather than just Brexit. Anna Turley (Labour) Anna Turley (Photo: Evening Gazette) \nMs Turley managed to hold on to the seat she won back in 2015, despite her majority narrowly dipping. \nShe secured 23,623 votes and boosted her share of the vote to 55.5%. Rishi Sunak (Conservative - Richmond) 36,458 Rishi Sunak (Photo: Evening Gazette) \nMr Sunak comfortably held on to the seat which covers areas including Great Ayton, Stokesley, Bedale, Northallerton and Catterick. Read More \nHe increased his majority to 23,108 for the seat which was previously held by former Tory leader William Hague, Phil Wilson (Labour - Sedgefield) Former British Prime Minister Tony Blair (right) stands with Phil Wilson (Photo: PA) \nThe man dubbed ‘Blair’s heir’ retained his place in Parliament despite a fierce challenge from the Conservatives. \nThe County Durham born and bred politician gained 3,927 votes on his 2015 results. Emma Lewell-Buck (Labour - South Shields) South Shields MP Emma Lewell-Buck \nThe Shadow Education Minister first won the seat in a 2013 by-election after former MP David Miliband chose to leave the House of Commons. \nMs Lewell-Buck believes her third election win in four years proves there was more at stake in the latest election than Brexit. Alex Cunningham (Labour - Stockton North) Stockton North Labour man Alex Cunningham (Photo: Evening Gazette) \nThe seat had been a target for the Tory campaign as they sought to capitalise on a strong Leave vote. \nBut Mr Cunningham retained his seat with ease, increasing his majority and share of the vote to 56.9% of the vote. Paul Williams (Labour - Stockton South) Dr Paul Williams (Photo: Evening Gazette) \nThe biggest election shock on Teesside saw the practising GP edge out Conservative James Wharton to turn the seat from blue to red. \nMr Williams bagged 26,102 votes, edging out his rival out by 888 votes. Julie Elliott (Labour - Sunderland Central) Julie Elliot MP \nMs Elliott dispatched of her Conservative challenger with relative ease, racking up 25,056 votes on a 62.1% turnout, up from 57% in 2015. \nSpeaking after the result was announced, she said she had spoken to 600 people during her campaigning, and vowed to uphold the promises she had made to them. Alan Campbell (Labour - Tynemouth) MP Alan Campbell \nThe former teacher, who first became an MP back in 1997 came out on top once again, this time ahead of Conservative Nick Varley in second place. \nMr Campbell collected 32,395, earning a majority of 11,666. Ian Lavery (Labour - Wansbeck) Ian Lavery (Photo: Daily Mirror) \nMr Lavery enjoyed a landslide victory with 24,338 votes - more than half of the total vast. \nThe former mine worker was involved in a heated debate on TV with Conservative Boris Johnson in the days leading to the election. Sharon Hodgson (Labour - Washington and Sunderland West) Labour Partys Pink Bus makes a stopoff at the Monument. Pictured Washington MP Sharon Hodgson. \nThe MP, who has sat in Parliament since 2005, comfortably retained her place ahead of the second-placed Tory rival. \nShe got 24,639 votes on a turnout of 60.4% but, despite increasing the number of votes she received on 2015, her majority was decreased by a few hundred votes. Read More", "external_links": [], "published": "2017-06-10T03:11:00.000+03:00", "crawled": "2017-06-09T22:51:40.000+03:00", "highlightTitle": ""}