{"organizations": [], "uuid": "61b29c4bb5fa7a3fa9692939e40feb05e2d0efac", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article12806227.ece/ALTERNATES/s1200/Boris-Johnson.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/boris-johnson-visits-north-east-13141924", "country": "GB", "domain_rank": 21960, "title": "Boris Johnson visits North East to argue Brexit is at risk if Theresa May doesn't win", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-06T12:00:00.000+03:00", "replies_count": 0, "uuid": "61b29c4bb5fa7a3fa9692939e40feb05e2d0efac"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/boris-johnson-visits-north-east-13141924", "ord_in_thread": 0, "title": "Boris Johnson visits North East to argue Brexit is at risk if Theresa May doesn't win", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "boris johnson", "sentiment": "negative"}, {"name": "brexit", "sentiment": "negative"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "johnson", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "ross kemp", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "blyth valley", "sentiment": "none"}, {"name": "downing street", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "teesside", "sentiment": "none"}, {"name": "north west durham", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "sunderland labour", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "scottish national party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Boris Johnson visits North East to argue Brexit is at risk if Theresa May doesn't win Brexit campaigner Boris Johnson claims Jeremy Corbyn would be 'eaten for breakfast' by EU leaders if he became Prime Minister Share Boris Johnson (Photo: PA Wire) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nBoris Johnson will tell voters in the North East that Brexit is at risk if Jeremy Corbyn becomes Prime Minister. \nIn a speech in the region, which voted heavily to quit the EU in last year’s referendum, the Conservative Foreign Secretary will say that Mr Corbyn and his negotiating team would be “eaten for breakfast” by EU leaders determined to reverse the result of last year’s referendum vote. \nAnd he will urge voters to back Theresa May and the Conservatives in Thursday’s General Election, saying: “There is only one party at this election – and only one potential Prime Minister – that is willing to stick up for the democratic will of the British people.” \nHis visit on Tuesday follows two visits by Mrs May, who delivered a speech in North Shields urging traditional Labour voters to switch to the Tories, and more recently urged voters to back her Brexit plan during a visit to Teesside. \nIt suggests that Tories are still hopeful of gaining seats in the North East, despite recent polls which suggest Labour is closing the gap. \nLabour leader Mr Corbyn toured the region on Monday, visiting Blyth Valley, Gateshead and North West Durham. Labour Leader Jeremy Corbyn speaks to party supporters (Photo: Getty Images Europe) \nBoris Johnson played a leading role in the successful Leave campaign during last year’s Brexit referendum. \nAnd he will claim that the choice of millions of people across the North of England to leave the EU could be reversed if Jeremy Corbyn makes it to Downing Street, propped up by the pro-EU Liberal Democrats and Scottish National Party. \nThe Foreign Secretary will argue that Labour would not fight for Britain in the Brexit negotiations which begin just 11 days after polling day. \nMr Johnson is expected to say: “Last year this country astounded the world by taking a decision that we had delayed for perhaps too long. \n“In the biggest popular mandate ever delivered in our history the British people voted to leave the European Union. Read More See Ross Kemp campaigning for Sunderland Labour candidate ahead of general election \n“We voted to take back control of our cash, our borders, and above all to take back control of our law-making system - to put the British back in the driving seat of their country. \n“It is a moment of hope and opportunity. And I can assure you that there are plenty of people in Brussels – and perhaps even some in this country - who have spent night and day since June 23 dreaming, hoping, scheming and plotting that they will be able to reverse that decision. Read More", "external_links": [], "published": "2017-06-06T12:00:00.000+03:00", "crawled": "2017-06-06T07:11:00.000+03:00", "highlightTitle": ""}