{"organizations": [], "uuid": "663f95f752c01f86476f41677400ed7d7ed29516", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article13175168.ece/ALTERNATES/s1200/PNP_NEC_210415brown_010JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/jeremy-corbyns-critics-contacting-admit-13175089", "country": "GB", "domain_rank": 21960, "title": "Jeremy Corbyn's critics are contacting me to admit they were wrong, says Labour's chief whip", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-12T23:45:00.000+03:00", "replies_count": 0, "uuid": "663f95f752c01f86476f41677400ed7d7ed29516"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/jeremy-corbyns-critics-contacting-admit-13175089", "ord_in_thread": 0, "title": "Jeremy Corbyn's critics are contacting me to admit they were wrong, says Labour's chief whip", "locations": [], "entities": {"persons": [{"name": "jeremy corbyn", "sentiment": "negative"}, {"name": "la", "sentiment": "negative"}, {"name": "brown", "sentiment": "none"}, {"name": "jeremy", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "mr brown", "sentiment": "none"}, {"name": "nick brown", "sentiment": "none"}, {"name": "james wharton", "sentiment": "none"}, {"name": "stockton south", "sentiment": "none"}], "locations": [{"name": "newcastle east", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "negative"}, {"name": "house of commons", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "westminster", "sentiment": "none"}, {"name": "liberal democrats", "sentiment": "none"}, {"name": "durham miners gala", "sentiment": "none"}, {"name": "chronicle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "dup", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Jeremy Corbyn's critics are contacting me to admit they were wrong, says Labour's chief whip Labour chief whip Nick Brown says the party will be a 'constructive' opposition but is ready for another election Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily   Thank you for subscribing!   \nJeremy Corbyn’s chief whip Nick Brown says Labour will be a “constructive and positive” opposition as Theresa May attempts to lead a minority government. \nBut he said Labour would propose an amendment to the Queen’s Speech setting out its alternative programme for government, which would effectively be a confidence vote in the Conservative-led administration. \nSpeaking to the Chronicle, Mr Brown said Labour had surprised the Conservatives by being well-prepared for last week’s general election, with a detailed and popular manifesto ready to go, and it was equally prepared for a second election this year if one took place. \nAnd he revealed Labour MPs previously critically of Mr Corbyn had contacted him to say they had changed their minds - and warned the party would not tolerate disloyalty following the election result. Nick Brown (Photo: Newcastle Chronicle) \nMr Brown, MP for Newcastle East, said: “Many re-elected members of Parliament are coming to a more rounded view of Jeremy. \n“Partly it’s because they have changed their opinion. And partly because of the successful election campaign and the way the manifesto has been received. \n“Name another politician that can attract that sort of crowd? \n“There was an energy and vigour about it that was uplifting. \n“Labour people have seen that and some have overcome their misgivings. \n“We really do have to stick together, and the party will take a very dim view of anyone who wants to commit divisive or sectarian behaviour.” \nThere’s plenty of speculation at Westminster about how long the Conservative government will last, given that it will not have a majority in the House of Commons. \nMrs May appears to be planning to rely on the support of the DUP, a Northern Ireland party, to allow her to win key Commons votes. But there will not be a full-blown Coalition, as there was when the Conservatives and Liberal Democrats joined forces after the 2010 election. \nMr Brown said Labour would challenge the Government and test whether it had the support of the House of Commons, but will play a “constructive and positive” role. \nHe said: “We are the Loyal Opposition. It is our duty to oppose in a constructive way, to test the strength of the Government’s case and agenda, and to propose amendments that will lead to a better outcome for the country.” Jeremy Corbyn (Photo: PA/BBC) \nThe party would put down an amendment during the Queen’s speech setting out an alternative programme of government, which in effect would be a vote of confidence, or otherwise, in the Government, he said. \nAnd Labour would seek to influence the Government’s Brexit strategy, he said. \n“There is a majority in the House of Commons for accepting that we are leaving but wanting a close and warm relationship with the rest of the EU. \n“We want to play a constructive part in what happens next.” \nHe said he did not believe Theresa May could survive as Prime Minister. “In the long run, no”, said Mr Brown. \nMr Brown admitted Labour’s success in the general election was “stronger than I had anticipated”. \nBut he pointed out that the Conservatives and others had severely underestimated Mr Corbyn and the Labour machine. \nThe party had worked hard to prepare a detailed manifesto with policies that the party knew would be popular, he said. \nAnd he said Labour was also ready for another election later this year, if it happens. \n“People warmed to Jeremy over the campaign. \n“He was going out and speaking to real people. He had real things to say. \n“He recognised what was on people’s minds - that the way society is structured at the moment isn’t fair, and isn’t working for many people. \n“A few are doing well out of it. Most of us are having our pay restrained, job opportunities constrained and young people are being saddled with debt which they will struggle to manage.” Read More Jeremy Corbyn to speak at Durham Miners Gala where 200,000 crowd expected \nHe added: “Our manifesto captured a general sense of injustice and unfairness. \n“And people believed Jeremy would do what he said he would. They warmed to him the more they saw him.” \nMr Brown said that as long as the Conservatives remained in power, the North East would continue to be underfunded. \nReferring to former government minister James Wharton, the ex-MP for Stockton South who lost his seat last week, Mr Brown said: “However much I disagreed with James Wharton about many things, he did care about the Northern Powerhouse idea and tried to make it a reality. \n“We haven’t got a Tory champion now at ministerial level. \n“It is up to the Labour Parliamentarians more than ever.” Like us on Facebook", "external_links": [], "published": "2017-06-12T23:45:00.000+03:00", "crawled": "2017-06-12T18:52:35.000+03:00", "highlightTitle": ""}