{"organizations": [], "uuid": "f17bd2b92a2161d4046b8635b60b501cf7e19a0f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article13182318.ece/ALTERNATES/s1200/General-Election-2017-aftermath.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/news-opinion/theresa-may-stay-prime-minister-13182317", "country": "GB", "domain_rank": 21960, "title": "Why Theresa May WILL carry on as Prime Minister despite her General Election calamity", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-14T18:00:00.000+03:00", "replies_count": 0, "uuid": "f17bd2b92a2161d4046b8635b60b501cf7e19a0f"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/news-opinion/theresa-may-stay-prime-minister-13182317", "ord_in_thread": 0, "title": "Why Theresa May WILL carry on as Prime Minister despite her General Election calamity", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "iain duncan smith", "sentiment": "none"}, {"name": "michel barnier", "sentiment": "none"}, {"name": "andrew mitchell", "sentiment": "none"}, {"name": "tony blair", "sentiment": "none"}, {"name": "gordon brown", "sentiment": "none"}, {"name": "john major", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "andrea leadsom", "sentiment": "none"}, {"name": "blair", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "mandelson", "sentiment": "none"}, {"name": "jonathan walker", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}], "organizations": [{"name": "house of commons", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "snp", "sentiment": "none"}, {"name": "tory", "sentiment": "none"}, {"name": "conservative", "sentiment": "none"}, {"name": "tories", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "dup", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "green party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Opinion Why Theresa May WILL carry on as Prime Minister despite her General Election calamity Theresa May can cling on as Prime Minister for a bit longer - despite her General Election gamble, political editor Jonathan Walker argues Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nJeremy Corbyn told a good joke in the House of Commons on Tuesday when he promised Theresa May he was ready to take over as Prime Minister if she failed to agree her “coalition of chaos” with the DUP. \nMPs laughed as he said: “Labour stands ready to provide strong, stable leadership in the national interest.” \nIt was funny, but it was also recognition that, despite his achievements in last week’s election, he’s still Leader of the Opposition and Theresa May is still Prime Minister. \nAs results from constituencies trickled in last Friday, and it became clear that the UK was heading for a hung Parliament, there was speculation that Labour could form a Government. \nMr Corbyn himself told the Sunday Mirror: “I can still be Prime Minister.” \nBut that was never realistic. \nTheresa May is in enough trouble with 317 MPs out of the 650 in the House of Commons, short of the 326 needed for a majority. \nThat’s what she is attempting to work with the DUP, who can add their 10 MPs to her forces. \nMr Corbyn has just 262 Labour MPs at his command. \nEven if he did a deal with every party in the House of Commons which might be described as “progressive” or vaguely left-wing - the SNP, the Lib Dems, Plaid Cymru and the Green Party - he’d be left with 314 MPs, fewer than the Tories have on their own. \nSo only Theresa May can be Prime Minister. \nBut how long can she last? \nConservative MPs are furious about the way she handled the election campaign. \nAndrew Mitchell, the only Conservative MP elected in Birmingham - where the party hoped to win at least three seats - said earlier this week: “It was an absolutely appalling campaign. \n“I have fought nine General Elections in my political career and this was by miles the worst.” \nBut that doesn’t mean that Conservatives are keen to get rid of Mrs May immediately. \nTories have a reputation for being ruthless. They forced former party leader Iain Duncan Smith to stand down in 2003, because it looked like he was steering the party to disaster. \nBut they were in opposition at the time. \nSacking Mrs May now and holding an internal election to choose a new leader - who would become Prime Minister - would add to the sense of chaos which already surrounds this Government and the party. \nAnd it would give enormous moral authority to demands for a fresh General Election. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nIt’s possible for a party to hold a leadership election while it is in power. Conservatives did this in 1990, choosing John Major, while Gordon Brown replaced Tony Blair as Labour leader and Prime Minister in 2007. \nBut in both cases, their parties had won a clear majority in the last General Election, even if it was under a different leader. \nStrictly speaking, a new Tory leader would have just as much right to be Prime Minister as Mrs May. But voters might not be impressed. \nOne thing sensible Tories are determined to avoid is an imminent General Election. \nThey haven’t only been shocked by Mr Corbyn’s effectiveness as a campaigner. They were also surprised by the effectiveness of the campaign, which is not quite the same thing. \nLabour had a detailed manifesto prepared, with policies that had been thoroughly tested with focus groups. This was the type of thing the party did very effectively in the days of Blair and Mandelson, but which many assumed Mr Corbyn and his advisers were either incapable of or would see as beneath them. \nAnd then there is the matter of Brexit . \nBrexit talks between the UK Government and EU Chief Negotiator Michel Barnier were due to begin on Monday, June 19. \nThey have already been delayed, but only until later in the week. \nThe 2016 Conservative leadership contest began on June 30 and was due to continue until September 9, although it was cut short when Theresa May’s rival candidate Andrea Leadsom pulled out. \nIn other words, a contest could easily last more than two months. \nThe Government can hardly start negotiating a Brexit deal when we don’t know who the Prime Minister is, so a leadership election now would mean a two-month delay because talks begin. Read More", "external_links": [], "published": "2017-06-14T18:00:00.000+03:00", "crawled": "2017-06-14T13:19:26.000+03:00", "highlightTitle": ""}