{"organizations": [], "uuid": "1f8c01eeb5fc326d701ec864adb5e97729a8f641", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30381323/16037703.jpg", "site_section": "", "section_title": "", "url": "http://www.devonlive.com/north-devon-s-steve-crowther-to-lead-ukip/story-30381323-detail/story.html", "country": "US", "title": "New UKIP leader is Devon's Steve Crowther | Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "", "spam_score": 0.189, "site_type": "news", "published": "2017-06-09T23:20:00.000+03:00", "replies_count": 0, "uuid": "1f8c01eeb5fc326d701ec864adb5e97729a8f641"}, "author": "", "url": "http://www.devonlive.com/north-devon-s-steve-crowther-to-lead-ukip/story-30381323-detail/story.html", "ord_in_thread": 0, "title": "New UKIP leader is Devon's Steve Crowther | Devon Live", "locations": [], "entities": {"persons": [{"name": "steve crowther", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "nick clegg", "sentiment": "none"}, {"name": "mr farage", "sentiment": "none"}, {"name": "paul nuttall", "sentiment": "none"}, {"name": "claire wright", "sentiment": "none"}, {"name": "nigel farage", "sentiment": "none"}, {"name": "paul", "sentiment": "none"}, {"name": "tim farron", "sentiment": "none"}, {"name": "crowther", "sentiment": "none"}, {"name": "mr crowther", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}, {"name": "nuttall", "sentiment": "none"}], "locations": [{"name": "devon live new ukip", "sentiment": "none"}, {"name": "north devon", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "stoke-on-trent", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}, {"name": "lincolnshire", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "bristol", "sentiment": "none"}, {"name": "braunton", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "heanton", "sentiment": "none"}, {"name": "boston", "sentiment": "none"}], "organizations": [{"name": "general election", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "lbc", "sentiment": "none"}, {"name": "nec", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "New UKIP leader is Devon's Steve Crowther By AbbieBray | Posted: June 09, 2017 0 COMMENTS SHARES \"But this was always going to be a difficult election. We just didn't know that Mrs May was going to make such an almighty hash of it.\" New UKIP leader is Devon's Steve Crowther X \nCopy link to paste in your message / \"But this was always going to be a difficult election. We just didn't know that Mrs May was going to make such an... Comments (0) \nNorth Devon man Steve Crowther is set to lead UKIP after former party leader Paul Nuttall stood down following the party's disastrous General Election showing. \nMr Nuttall stood down as the leader of the party after it failed to win any seats in the General Election and Mr Crowther agreed to step in to lead the party on an interim basis. The 60-year-old former trade journalist and writer ran an advertising agency in London, which specialised in marketing technology beforemoving to Heanton near Braunton. \nAfter the announcement of his appointment as temporary leader, Mr Crowther said: \"I am honoured to have been asked by the NEC to stand in as Interim Leader for the next few weeks until our new Party Leader is elected. \n\"I respect Paul's decision to step down, though I regret that he has not had time to show his full potential. In recent weeks he has started to really resonate with members of the party, and the public at large, with his robust messages on security and integration. \n\"But this was always going to be a difficult election. We just didn't know that Mrs May was going to make such an almighty hash of it.\"We expected that the government would cement its mandate to take forward the Brexit negotiations with more confidence and power. Instead, she has done the precise opposite.\"UKIP's presence on the political battlefield has just got a lot more critical, as those who want to thwart Brexit use this excuse to try and throw it into reverse. Despite the Lib-Dems' total failure to recover, Nick Clegg losing his seat and his own narrow squeak, Tim Farron is already claiming that Mrs May's incompetent electioneering somehow overrides the expressed will of the people to leave the EU.\"We cannot let this happen. UKIP will now rapidly regroup, choose a new Leader and get back on our horse. We will provide the backbone for the full, proper Brexit that the people voted for last year, and which is the only way to protect this country from the impending economic meltdown in Europe, and get back control of our borders – something which is clearly long overdue.\"I will be talking to colleagues over the weekend and meeting with the NEC on Monday, to ensure that the party is 'strong and stable' and ready to support the new Leader in the challenging times ahead of us.\" \nRead more: Former Devon student elected as Labour MP in Bristol \nMr Nuttall took 3,308 votes in Boston and Skegness - more than 10,000 fewer votes than the party's result in 2015. \nHe said it was clear \"UKIP requires a new focus and new ideas\" but was confident it had a \"great future\". \nSince resigning as leader he has deleted his Twitter and Facebook accounts. \nMr Nuttall said the party was more relevant than ever and would continue to be \"the guard dogs of Brexit\". \n\"The prime minister, and I suspect it will be a Tory, must know that if they begin to backtrack or barter things away then they must know they will be punished at the ballot box and that will only happen if UKIP is electorally viable and strong. \n\"We are in effect the country's insurance policy on Brexit,\" he said. \nRead more: East Devon MP Hugo Swire says 'vile' Claire Wright fans libelled him on Twitter - video \nMr Nuttall told a news conference: \"It is clear that UKIP requires a new focus, new ideas and a new energy - and it is there amongst out ranks. \n\"I think, regardless of the score last night, I have laid the foundations for the future in this General Election campaign but it will be for someone else to build on those.\" \nAsked about a future role for former leader Nigel Farage, Mr Nuttall said: \"If Nigel Farage wants to come back, I would be more than happy to do a job swap. I'll take his slot on LBC and he can come back as leader of Ukip.\" \nEarlier, Mr Farage said he did not blame Mr Nuttall for the party's poor showing. \nAsked on LBC radio about the prospects of a comeback, he said: \"Whether leading or playing a prominent role is perhaps a different question.\" \nMr Nuttall failed in his bid to win a Commons seat on Thursday, finishing a distant third in Brexit heartland Boston and Skegness behind the Tories. \nIt was the UKIP leader's sixth attempt to get into Parliament, having finished second behind Labour at the Stoke-on-Trent Central by-election earlier this year. \nThe party was hoping to make gains in the Lincolnshire seat, which yielded one of the highest votes for Leave in last year's EU referendum. \nBut Mr Nuttall saw UKIP's share of the vote slide 26.1% to 3,308 votes, while Labour increased its vote by 8.5% to 10,699 and the Tories by 19.8% to 27,271. \nThe decline in the UKIP vote was seen across the country, with the party's vote share down to around 2% nationally, splitting between Labour and the Conservatives. \nAsked what next, Mr Nuttall replied: \"What now for me? Holiday. Or if that bar is open, a pint...\"", "external_links": [], "published": "2017-06-09T23:20:00.000+03:00", "crawled": "2017-06-09T18:05:45.001+03:00", "highlightTitle": ""}