{"organizations": [], "uuid": "4603ba45f1317f0b09c2fbbaa3b17dba4df52a4b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article7158499.ece/ALTERNATES/s1200/Jonathan-Arnott.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/news-opinion/no-issue-been-swept-under-13260924", "country": "GB", "domain_rank": 21960, "title": "No issue has been swept under the carpet recently in the way that crime has", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-30T20:00:00.000+03:00", "replies_count": 0, "uuid": "4603ba45f1317f0b09c2fbbaa3b17dba4df52a4b"}, "author": "Jonathan Arnott", "url": "http://www.chroniclelive.co.uk/news/news-opinion/no-issue-been-swept-under-13260924", "ord_in_thread": 0, "title": "No issue has been swept under the carpet recently in the way that crime has", "locations": [], "entities": {"persons": [{"name": "jona", "sentiment": "negative"}, {"name": "arnott", "sentiment": "none"}, {"name": "jonathan arnott", "sentiment": "none"}], "locations": [{"name": "north east ukip", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}], "organizations": [{"name": "invalid email  politics", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "battersea dogs", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "No issue has been swept under the carpet recently in the way that crime has North East Ukip MEP Jonathan Arnott outlines the changes needed in the prison system Share Get daily   Could not subscribe, try again later Invalid Email \nPolitics, at its core, should be all about making people’s lives better. \nSadly, in practice it isn’t: political parties are riven with infighting and backstabbing, consensus gives way to point-scoring and a desire to outdo or outbid rival parties. \nNo wonder the public are so often so frustrated about politicians, about what they do and say. Is it the fault of the politicians, the fault of the system, or the fault of a media which jumps like a pack of wolves on every mis-spoken word? \nIs it the fault of political correctness, that jarring dissonance whenever anyone says something not conforming to norms? It’s a bit of everything if I’m honest. \nAnd in a modern 24-hour news cycle, our attention is drawn to one issue or another: whether it be Brexit, terrorism, fire safety or a foreign war. Even the NHS, one of the key motivators for people’s voting patterns at the General Election, is often mentioned only in response to a crisis. \nI can think of no issue swept under the carpet more in recent times than that of crime. \nEven when the spotlight does turn to crime, it’s often very specific: in the light of those who torture animals to death, we correctly identify the need for tougher sentences on animal cruelty (the maximum of six months in prison, however horrific the offence, means only three once early release is taken into account and in practice only two once a court has given a sentence discount to those who pleaded guilty). Read More A tale of two deals - the North East's £30m a year and Northern Ireland's cool billion \nPersonally I believe that Battersea Dogs and Cats Home has it about right: their proposal for a five-year maximum sentence would send the right message. \nYet rarely do we consider the criminal justice system as a whole, strategically. Our society isn’t set up for us to have such a national debate. Instead we see the tired old stereotypical approach: the Right seek greater punishment of offenders; the Left, greater rehabilitation. In these caricatures the point is missed. \nWe’re creating false choices, false dichotomies: dealing with crime is about all of these: punishment and rehabilitation, deterrence and restoration - not forgetting public protection. \nFor many years, UKIP had a policy of ‘make sentences mean what they say’ – ending early release from prison, a policy which surprisingly quietly disappeared from the 2017 Manifesto without comment or replacement. I recognised the sentiment of getting tough, but I was never too keen on the policy. \nInstead, society should be considering radical changes that transcend Left and Right. I genuinely want to break the cycle of re-offending so that people who leave prison aren’t going back to the same communities, lacking job prospects or a direction in life. They’ll likely return to prison within months, and re-offending rates are likely to underestimate the scale of the problem because not all crimes are solved. \nI would prefer a system where early release is earned: not just with good behaviour. Prisoners wanting early release should be expected to develop their education and skills, do meaningful work while in prison, and increase their employability. Then, prior to their release date, they should find a job to go to once they get out. \nThe government might have to provide some subsidies (albeit the tiniest amounts in the grand scheme of our economy) to businesses to mitigate the risk they take on when employing an ex-prisoner straight from prison. The gain would be invaluable: the cycle of offending would be broken and those who want rehabilitation would have every possible chance at a new start in life. Read More Why the Brexit result proved the best result for Britain one year on \nSuch a system would function well only if there were a less desirable alternative, with tough new boot camp-style prisons for those. \nIt would only work if we built the prisons needed to cope with overcrowding (and post-Brexit seek to maximise the number of foreign criminals serving sentences back in their home countries immediately rather than being deported after their sentences). If we truly want to cut crime, we have to invest the necessary resources. \nThat’s just scratching the surface of what’s needed in our prison system, but I could equally write about policing and the courts system in much greater detail. Nor is crime the only such ‘forgotten’ issue in our society. \nWhy aren’t we discussing such issues more? Perhaps because there is never a very clearly-defined ‘crisis’: no individual crime really meets the requirements of a 24-hour news cycle, unless it’s the most gruesome of mass murders where the killer should never be released anyway. \nThe carrot alone doesn’t work. Nor does the stick work on its own. A combination of the two? Well, that very well might. \nJonathan Arnott is UKIP MEP for the North East. Like us on Facebook", "external_links": [], "published": "2017-06-30T20:00:00.000+03:00", "crawled": "2017-06-30T20:21:02.000+03:00", "highlightTitle": ""}