{"organizations": [], "uuid": "1c646a1b5470c8a9238c42e5d45697ffb9bbd3c6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12917289.ece/ALTERNATES/s1200/JS116388016.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13255357", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast RECAP: Sky deal likely to face competitions probe", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-30T09:57:00.000+03:00", "replies_count": 0, "uuid": "1c646a1b5470c8a9238c42e5d45697ffb9bbd3c6"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13255357", "ord_in_thread": 0, "title": "Business Breakfast RECAP: Sky deal likely to face competitions probe", "locations": [], "entities": {"persons": [{"name": "doug parr", "sentiment": "none"}, {"name": "bradley", "sentiment": "none"}, {"name": "murdoch", "sentiment": "none"}, {"name": "karen bradley", "sentiment": "none"}, {"name": "james dyson", "sentiment": "none"}, {"name": "jonathon manning", "sentiment": "none"}, {"name": "khalid abdullah al saud", "sentiment": "none"}, {"name": "therese liddle", "sentiment": "none"}, {"name": "amy", "sentiment": "none"}, {"name": "rupert murdoch", "sentiment": "none"}, {"name": "mohsin al-tajir", "sentiment": "none"}, {"name": "carl stefan erling persson", "sentiment": "none"}, {"name": "pj davis", "sentiment": "none"}, {"name": "amy wright", "sentiment": "none"}, {"name": "basildon vange", "sentiment": "none"}, {"name": "earl bathurst", "sentiment": "none"}, {"name": "rosebery", "sentiment": "none"}, {"name": "michael gove", "sentiment": "none"}, {"name": "ian", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "milton keynes", "sentiment": "none"}, {"name": "farrans", "sentiment": "none"}], "locations": [{"name": "st albans", "sentiment": "none"}, {"name": "houghton-le-spring", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "highland wagyu", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "thanet", "sentiment": "none"}, {"name": "sittingbourne", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "new wear crossing", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "folkestone", "sentiment": "none"}, {"name": "uae", "sentiment": "none"}, {"name": "hemel hempstead", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "nrg", "sentiment": "none"}, {"name": "bbc", "sentiment": "none"}, {"name": "itn", "sentiment": "none"}, {"name": "nintendo", "sentiment": "none"}, {"name": "ebitda", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "nintendo switch", "sentiment": "none"}, {"name": "wesfarmers", "sentiment": "none"}, {"name": "sunday times rich list", "sentiment": "none"}, {"name": "bunnings diy", "sentiment": "none"}, {"name": "ofcom", "sentiment": "none"}, {"name": "greenpeace uk", "sentiment": "none"}, {"name": "duke of buccleuch", "sentiment": "none"}, {"name": "murdoch family trust", "sentiment": "none"}, {"name": "women’s engineering society", "sentiment": "none"}, {"name": "institute of civil engineers", "sentiment": "none"}, {"name": "duke", "sentiment": "none"}, {"name": "michelin", "sentiment": "none"}, {"name": "h&m", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "duke of westminster", "sentiment": "none"}, {"name": "homebase", "sentiment": "none"}, {"name": "greenpeace", "sentiment": "none"}, {"name": "bunnings warehouse", "sentiment": "none"}, {"name": "home retail group", "sentiment": "none"}, {"name": "northern recruitment group", "sentiment": "none"}, {"name": "bunnings", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "\nThe FTSE-100 index opened at 7350.32. \nThe pound at 8am was 1.3005 dollars compared to 1.2982 dollars at the previous close. \nThe euro at 8am was 0.8782 pounds compared to 0.8801 pounds at the previous close. 8:31 KEY EVENT Billionaires and millionaires '20% of top European farming subsidy recipients' \nOne in five of the biggest recipients of European farming subsidies in Britain are billionaires and millionaires on the Sunday Times Rich List, research suggests. \nRankings by Greenpeace of the 100 companies and landowners receiving the biggest basic payments under the Common Agricultural Policy shows 20 of them are wealthy enough to feature on the Rich List, up from 16 the year before. \nIt comes as the UK decides on the future of farming subsidies after Brexit, with Greenpeace calling for public money to support schemes that deliver public goods such as protecting wildlife, preventing flooding and producing sustainable food. \nBillionaire Brexit backer Sir James Dyson’s farming business was the biggest private recipient of EU basic payments in the UK in 2016, receiving £1.6m, Greenpeace said. \nNew entrants on the environmental charity’s top 100 subsidy recipients this year included the Earl of Rosebery, the Duke of Buccleuch and Earl Bathurst. The Highland Wagyu beef farm owned by Mohsin Al-Tajir, the son of a billionaire former UAE ambassador to the UK, whose cattle are pampered in “zen-like” buildings, and whose luxury beef is used by Michelin star chefs, is also now in the top 100. \nThe ranking is an update by the environmental group from last year, which cross-references Government data to reveal billionaires and aristocrats are among the biggest recipients of the subsidies that are mostly paid for the amount of land they own. They include the Duke of Northumberland, the Duke of Westminster, the Earl of Iveagh and the Guinness family, and the Queen. \nCompanies belonging to wealthy overseas-based landowners including H&M chairman Carl Stefan Erling Persson and racehorse breeder Prince Khalid Abdullah al Saud also receive hundreds of thousands of pounds in subsidies, Greenpeace said. \nCurrently, the lion’s share of the UK’s £3bn in subsidies from the EU goes to basic payments linked to land area, with some environmental requirements, while a proportion is paid to environmentally friendly farming and other schemes. \nNew Environment Secretary Michael Gove has said Brexit is a chance to get rid of bureaucracy and design a better system of supporting farmers that could better protect and enhance the environment. \nGreenpeace UK’s policy director Dr Doug Parr said: \nIt’s simply indefensible that taxpayers’ money is being used to bankroll huge subsidies going to billionaires largely on the basis of how much land they own. \nPublic money should reward farmers for contributing to the public good, whether it’s by producing sustainable food, building thriving rural economies, reducing flood risk or protecting our wildlife. Industrial designer and engineer Sir James Dyson 8:25 Northern Recruitment Group boost profit by 21% after strengthening senior team \nOne of the region’s longest-established recruitment groups has reported a lift in revenue and profits . \nNorthern Recruitment Group (NRG) posted a 14% rise in turnover, with revenue going from £24.3m in 2015 to £25.8m last year. Operating profit, meanwhile, saw a 21% uplift from £695,000 to £845,000. \nThe Newcastle company, which provides temporary and permanent staff and works across a range of industry sectors, continued the momentum of the previous 12 months after a difficult 2014 saw profits fall to £159,000. \nAn interim dividend of 11p per share was also paid out during the year. \nStaffing numbers at the group fell slightly during the year from 89 to 85, but directors said the senior team had been strengthened. \nIn a report accompanying the accounts the firm’s directors said the 2016 trading results were positive, representing good growth on the previous year. \nThe company’s balance sheet remained strong, they said, adding: \nThe directors are confident this will remain the position going forward. \nThe company has strengthened its senior management team to continue providing excellent service to its clients and to further develop the business. Therese Liddle, Managing Director, NRG 8:20 New Wear Crossing engineer named as one of 50 top female engineers in country \nA 27-year old civil engineer from Houghton-le-Spring has been named as one of the UK’s top 50 women in engineering . \nAmy Wright works as a senior site engineer at building and civil engineering contractor Farrans, and has worked on a number of major projects across the North East. \nCurrently she is working on the £117m New Wear Crossing project in Sunderland, the first bridge to be built over the River Wear in the city in more than 40 years. \nThe Top 50 Women in Engineering list was compiled by the Women’s Engineering Society (WES). \nAmy said: \nI’m very honoured to have been included in the WES list, which boasts many leading and inspiring women engineers. I have always had an interest in engineering and worked extremely hard to get where I am today. This is definitely one of my greatest personal achievements. \nOver the course of my relatively short career I have been involved in some exciting and crucial infrastructure projects, as well as met many great people along the way, especially through my work with the Institute of Civil Engineers (ICE). I’m a keen advocate of the industry and hope to use my experiences to attract more young people into a rewarding career in engineering. Civil engineer Amy Wright has been named as one of the top 50 women in engineering (Photo: Unknown) 8:16 1,000 new jobs in store as DIY firm Bunnings accelerates expansion plans \nDIY retailer Bunnings is creating more than 1,000 jobs and stepping up a store expansion drive following its owner’s swoop for Homebase last year. \nThe firm plans to double the number of stores launched in 2017 from 10 to 20 after a “positive response” to pilot outlets in St Albans and Hemel Hempstead. \nIt comes after the firm’s owner, Wesfarmers, sealed a £340m deal to buy Homebase from Home Retail Group and pledged £500m of investment to roll out Bunnings Warehouse stores across the UK and Ireland. \nBunnings managing director PJ Davis said the move reflects the positive reaction from customers. \nHe said: \nIncreasing the number of pilot stores to 20 will give us the opportunity to test the concept in new geographies, with different demographics, across a range of store sizes. \nWe are determined to combine the best of Bunnings Warehouse with what UK consumers want. The success of the pilots still remains a precursor to additional investment. \nThe announcement was made as Bunnings opened as fourth pilot store in Milton Keynes in a move that will bring 88 new roles. It also has plans in place for a fifth pilot outlet in Folkestone, before gearing up to overhaul Homebase stores in Thanet, Sittingbourne and Basildon Vange. boss of Bunnings DIY, PJ Davis 8:11 Jonathon Manning Video game retailer Game Digital blames Nintendo for low profits \nGame Digital has warned that full-year profits will come in “substantially below” expectations after the retailer bemoaned challenging high street trading and the poor stock availability of Nintendo Switch. \nThe company had hoped the console would provide a major boost to sales after a difficult first half to the year. \nHowever, in a trading update, Game said: \nConsumer demand for Nintendo Switch has been, and remains, very strong, however the level of supply to the UK market has been lower than expected. \nThe group still expects to deliver positive group gross transaction value growth in the second half of approximately 5-6%, however this is below our previous expectation. \nAs a result, we now expect adjusted EBITDA (earnings) for the full year to be substantially below previous expectations. \nThe video games retailer added that it is seeing “continued softness” in its core Xbox and PlayStation markets which, along with a “challenging trading environment”, has also impacted sales. \nIn March, Game said first half pre-tax profits tumbled 26.7% to £16.5m while sales, by gross transaction value, slumped 18.1% in the UK. \nDespite the supply issue, the Nintendo Switch launch has helped breath new life into the market, which Game said had been difficult with a weaker line-up of game launches in the first half affecting already tough trading. \nGame is attempting to bolster supplier arrangements, ramp up cost savings and improve customer experience in store. \nLooking forward, Game said it is encouraged by the positive consumer reception of Nintendo Switch in both the UK and Spain, where it also operates, adding that demand is helping to strengthen the outlook for next year. Game has blamed poor profits on a limited supply of the Nintendo Switch to the UK 8:05 KEY EVENT Rupert Murdoch's £11.7bn Sky bid could face competition probe \nA deal that would see Rupert Murdoch take full control of Sky has hit a bump after Culture Secretary Karen Bradley said she is minded to refer £11.7bn deal to a further inquiry due to concerns over media plurality. \nMs Bradley told the Commons that Ofcom’s report into the deal concluded that it risked the Murdoch family having “increased influence” over the UK’s news agenda and the political process. \nShe said: \nOn the basis of Ofcom’s assessment, I confirm that I am minded to refer to a phase two investigation on the grounds of media plurality. \nMs Bradley said Ofcom’s report was “unambiguous”, telling MPs: \nThe reasoning and evidence on which Ofcom’s recommendation is based are persuasive. \nThe proposed entity would have the third largest total reach of any news provider - lower only than the BBC and ITN - and would, uniquely, span news coverage on television, radio, in newspapers and online. \nOfcom’s report states that the proposed transaction would give the Murdoch Family Trust material influence over news providers with a significant presence across all key platforms. \nThis potentially raises public interest concerns because, in Ofcom’s view, the transaction may increase members of the Murdoch Family Trust’s ability to influence the overall news agenda and their ability to influence the political process and it may also result in the perception of increased influence. \nThese are clear grounds whereby a referral to a phase two investigation is warranted - so that is what I am minded to do. Rupert Murdoch (Photo: Ian West/PA Wire) Share ", "external_links": [], "published": "2017-06-30T09:57:00.000+03:00", "crawled": "2017-06-30T14:20:21.006+03:00", "highlightTitle": ""}