{"organizations": [], "uuid": "cca9ce372026645fba6d82fcbfa8b3b94942c83c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article13233228.ece/ALTERNATES/s1200/EU-referendum.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/news-opinion/brexit-result-proved-best-result-13233220", "country": "GB", "domain_rank": 21960, "title": "Why the Brexit result proved the best result for Britain one year on", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-24T23:00:00.000+03:00", "replies_count": 0, "uuid": "cca9ce372026645fba6d82fcbfa8b3b94942c83c"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/news-opinion/brexit-result-proved-best-result-13233220", "ord_in_thread": 0, "title": "Why the Brexit result proved the best result for Britain one year on", "locations": [], "entities": {"persons": [{"name": "david cameron", "sentiment": "none"}, {"name": "george osborne", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "nigel farage", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "middle england", "sentiment": "none"}, {"name": "getty images europe", "sentiment": "none"}, {"name": "grenfell tower", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "parliamentary labour party", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Opinion Why the Brexit result proved the best result for Britain one year on Although I voted Remain the domino effect of Brexit could see a government change on austerity Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nWhen it became apparent, in the early hours of June 24, that the county was going to vote ‘Leave’ in the European Union referendum I thought, using less colourful language now than I did then, we’ve mucked up here. \nHow on earth could the North East, which has benefited so much from EU grants that are based on want and need rather than political affiliation, had opted to cut off this vital supply of funds? \nWhat about Nissan, I cried, like many other people, displaying sudden concern for a car factory like its theoretical post-Brexit demise would mean the earth beneath our feet would collapse. \nYet today, when contemplating the first anniversary of what Nigel Farage described as ‘Independence Day’, I have to admit I now think it was the best result for Britain, all things considered. Read More Brexit one year on - the 12 key dates in a momentous year in British politics \nYou think I’m wrong? Well imagine what would have happened if the country had voted ‘Remain’. \nDavid Cameron would still be Prime Minister and worse still George Osborne would still be Chancellor. That would have meant at the very least another three years of austerity. \nAnd in 2020, when the next general election was actually due, Jeremy Corbyn will be 71. Would he have still been Labour leader or would he have quit by then to work in his allotment, sick of the never-ending in-fighting of his party? Labour Leader Jeremy Corbyn (Photo: Getty Images Europe) \nI’m sure, if the country had voted Remain, the Parliamentary Labour Party would have done its utmost to replace him with a candidate they believed suitably attractive to Middle England and in their mind ‘electable’. \nInstead the country - and Labour’s heartland - unexpectedly voted Brexit. Just as unexpectedly as many of them voted for Corbyn and Labour too at the general election. The contest was so close the Tories are now talking about ending austerity in order to be able to govern. \nPerversely, Labour MPs blamed Corbyn for Brexit as they believed everyone hated him as much as they did. \nSo when Theresa May called the snap election, it seemed in many people’s mind he would go after a widely predicted heavy defeat for Labour. \nButt it didn’t work out like that. Why? Because new battles had to be fought and the one with austerity was going be the most important of all for all our sakes. Read More The North still backs Brexit one year after EU referendum - but we're pessimistic \nFor some it has become a life or death struggle due to the rigid confines of the austerity strait jacket at the ‘black’ heart of which is welfare cuts and public spending budgets slashed to the bone. \nBritain is now a brutally divided country at present, graphically illustrated by the Grenfell Tower tragedy in London. \nCorbyn and Labour chose to highlight this divide, their remedy being to tear down the wall surrounding the so-called ‘magic money tree’ - ie the nation’s earnings from our tax - and distribute it much more fairly. To prioritise the money to those who need it most whilst providing vital extra funds for the NHS and public services. \nAll this thanks, I believe, to the Brexit vote and the domino effect it started. Like us on Facebook", "external_links": [], "published": "2017-06-24T23:00:00.000+03:00", "crawled": "2017-06-24T18:12:16.018+03:00", "highlightTitle": ""}