{"organizations": [], "uuid": "ec7e2aae14bc61a2c43513627d520eed5550645a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13176715.ece/ALTERNATES/s1200/Mobile-roaming-charges.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/eu-roaming-charges-scrapped-friday-13176628", "country": "GB", "domain_rank": 21960, "title": "EU roaming charges scrapped from Friday - but you could still pay a premium to call abroad", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-13T15:55:00.000+03:00", "replies_count": 0, "uuid": "ec7e2aae14bc61a2c43513627d520eed5550645a"}, "author": "Simon Meechan", "url": "http://www.chroniclelive.co.uk/news/north-east-news/eu-roaming-charges-scrapped-friday-13176628", "ord_in_thread": 0, "title": "EU roaming charges scrapped from Friday - but you could still pay a premium to call abroad", "locations": [], "entities": {"persons": [{"name": "giffgaff", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "kester mann", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "pa", "sentiment": "negative"}, {"name": "vodafone", "sentiment": "none"}, {"name": "ccs", "sentiment": "none"}, {"name": "commission", "sentiment": "none"}, {"name": "european commission", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThere’s good news if you’ve got a holiday coming up as from Friday you won’t pay extra to use your mobile phone in other EU countries. \nIn 2015, the EU agreed to ban roaming charges by June 15, 2017. It means when Brits go abroad they can use the UK-registered mobile phone to call, text and go online without paying inflated “roaming” charges. \nThe European Commission, the body which proposes and writes EU laws, says it has spent a decade driving down the cost of using mobile phones in member states. It became 80% cheaper to send texts and use data throughout the EU between 2007 and 2015, according to the Commission. \nLast year a cap was introduced on roaming charges, with a maximum surcharge of around 3.5p/minute per call, 1.4p per text and 3.5p per MB of data, ahead of Friday’s total ban. Read More Conservative MP urges party to give Theresa May at least two years as Prime Minister There's a catch \nBut there is a way you could still be charged over the odds to call within the EU - if you make a call to another member state while are you in the UK, according to the Which consumer group. \nThat’s because when you’re at home you are not roaming. \nWhich found out O2 and Vodafone charge £1.50 per minute to call to a Spanish mobile, although Giffgaff and Talk Mobile charge just 9p and 20p per minute. Read More Mobile data, terrorist funding and cricket - the new laws coming into force in the next few months What happens after Brexit? \nBritain intends to eventually leave the EU, which means it will no longer be subject to the law banning roaming charges. \nBut that might not necessarily mean roaming charges will return. Many operators have deals for low-cost calling for European countries and territories which are not in the bloc, and industry insiders think operators would be foolish to try and slap British customers with charges after Brexit. \nKester Mann, telecoms analyst at CCS Insight told the Mirror: “I think it would go down very, very badly with customers. \n“It would be very difficult for them to do that just because the UK is such a competitive market and we’ve moved such a long way from roaming.” Like us on Facebook", "external_links": [], "published": "2017-06-13T15:55:00.000+03:00", "crawled": "2017-06-13T11:13:42.007+03:00", "highlightTitle": ""}