{"organizations": [], "uuid": "ead7e456bdb913b015dc6cd82c93dc3b731ae0c3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30373840/16031735.jpg", "site_section": "", "section_title": "", "url": "http://www.devonlive.com/north-devon-hospital-relies-on-almost-100-eu-nationals-fears-brexit-will-cause-staffing-crisis/story-30373840-detail/story.html", "country": "US", "title": "Devon hospital which relies on 98 EU nationals fears Brexit will cause staffing crisis | Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "", "spam_score": 0.945, "site_type": "news", "published": "2017-06-06T18:59:00.000+03:00", "replies_count": 0, "uuid": "ead7e456bdb913b015dc6cd82c93dc3b731ae0c3"}, "author": "", "url": "http://www.devonlive.com/north-devon-hospital-relies-on-almost-100-eu-nationals-fears-brexit-will-cause-staffing-crisis/story-30373840-detail/story.html", "ord_in_thread": 0, "title": "Devon hospital which relies on 98 EU nationals fears Brexit will cause staffing crisis | Devon Live", "locations": [], "entities": {"persons": [{"name": "joebulmer", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "cann", "sentiment": "none"}, {"name": "devon live", "sentiment": "none"}, {"name": "mr cox", "sentiment": "none"}, {"name": "david chalmers", "sentiment": "none"}, {"name": "geoffrey cox", "sentiment": "none"}, {"name": "mark porter", "sentiment": "none"}, {"name": "steve crowther", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}, {"name": "mark cann", "sentiment": "none"}, {"name": "ricky knight", "sentiment": "none"}, {"name": "knight", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "crowther", "sentiment": "none"}, {"name": "peter heaton-jones", "sentiment": "none"}], "locations": [{"name": "devon live devon", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "north devon", "sentiment": "none"}, {"name": "torridge", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "north devon district hospital", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "uk devon", "sentiment": "none"}, {"name": "west devon", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "northern devon healthcare trust", "sentiment": "none"}, {"name": "british medical associations", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "ndht", "sentiment": "none"}, {"name": "bma", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "freedom of information", "sentiment": "none"}, {"name": "freedom of information request to northern devon healthcare trust", "sentiment": "none"}, {"name": "green party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Devon hospital which relies on 98 EU nationals fears Brexit will cause staffing crisis By JoeBulmer | Posted: June 06, 2017 3 COMMENTS SHARES So far no deal has been made with the EU regarding the fate of EU nationals living and working in the UK Devon hospital which relies on 98 EU nationals fears Brexit will cause staffing... X \nCopy link to paste in your message / So far no deal has been made with the EU regarding the fate of EU nationals living and working in the UK Comments (3) \nNew figures have revealed a Devon hospital relies on 98 staff from the EU, which some fear could lead to a staffing crisis as the Brexit process continues. \nSo far no deal has been made with the EU regarding the fate of EU nationals living and working in the UK. Many health commentators are concerned about the number of NHS jobs filled by workers from the EU. \nA Freedom of Information Request to Northern Devon Healthcare Trust was made by Liberal Democrat general election candidate for Torridge and West Devon, David Chalmers. \nHe asked how many medical and support staff are currently employed at North Devon District Hospital from the 27 EU member states and how the number of those workers has fluctuated over the past three years. \nREAD NEXT: Exeter call handler sacked over death of woman in fire \nAccording to the reply from the Northern Devon Healthcare Trust the hospital employs 98 staff from 14 different EU member states. \nOver the past three years the number of EU nationals employed at the hospital has gradually risen. In 2015 there were 92, in 2016 there were 97 and as of March this year there were 98. \nThe statistics also reveal the number of EU nationals starting work at the hospital has steadily decreased over the last three years while the number leaving the hospital has increased. \nBetween 2014 and 2015 43 EU Nationals started work at the hospital and 23 left. \nIn the period between 2014 and 2015 38 EU nationals started work at the hospital while 29 left. \nBetween 2016 and 2017 36 EU nationals started work at the hospital and 37 left. \nEU doctors leaving NHS England in the three months immediately after the Brexit vote increased by 83% compared with the same period the year before. \nIn response to the issue of EU nationals working in the NHS the British Medical Associations' council chairman, Dr Mark Porter, said: \"Worryingly, one in four EU doctors working in the UK have told the BMA that they are considering leaving following the referendum. \"These are people who have dedicated years of service to healthcare, staffing our hospitals, GP surgeries and leading medical research.\" \nDavid Chalmers said: \"The Tory Government are planning on using EU citizens as bargaining chips in the EU negotiations. This uncertainty is causing untold stress to EU citizens living in Devon and working in our NHS, with many of these highly skilled people deciding to leave their jobs to return home instead. This staffing shortage will affect patient care and further stretch NHS manpower.\" \n\"Torridge and West Devon desperately needs a full-time MP with a strong record of campaigning to save local hospitals. I will fight for the residency rights of vital EU medical staff to allow them to continue to provide the first class health care that local people deserve.\" \nHe added: \"At a time when the NHS is already in crisis and struggling to recruit enough staff, the last thing we need is an exodus of nurses and doctors that hospitals in the South West rely on.\" \nDevon Live approached North Devon MP Peter Heaton-Jones for a comment but he declined referring the question to his Torridge and West Devon colleague Geoffrey Cox. \n\"As usual these figures do not support the impression the Liberal Democrats want to give about our local hospital,\" said Mr Cox. \n\"Project Fear is alive and well it seems within Lib Dem ranks and there is a whiff of desperation in this feeble attempt to misrepresent the picture. While the number of EU leavers from NDHT grew, the number of EU starters in 2015/16 and 2016/17 exceeded or equalled them. \n\"There is no intention to bar EU staff from working in the UK and their position and the position of British nationals in the EU will be the first item in the crucial negotiations that must start in 14 days' time. \n\"In the longer term, many more people in this country would like to train to be a nurse than we have training places and the NHS has commenced a new training programme, 'Nurse First', to allow them to do so that will increase the number of newly qualified nurses by 2,200 a year by 2019. That must be a good thing. \nHe added: \"Lib Dem promises in opposition are like chocolate teapots, which melt at the first sign of power.\" \nREAD NEXT: Two Devon men in Big Brother house - and one sparks an instant apology \nThe Labour candidate for North Devon, Mark Cann, says the Government \"must\" settle the fate of EU nationals quickly. \n\"These figures just go to show how much we rely on immigrants not only in the NHS but in many other areas of the public services and in the private sector,\" said Mr Cann. \n\"The priority for any incoming government must be to guarantee the rights of existing EU workers in the UK – this not only is the morally right thing to do but it makes economic sense. \n\"It is the uncertainty of their position that is causing so many to leave. If we continue losing workers at this rate our public services will come under increasing pressure.\" \nUkip candidate for North Devon, Steve Crowther, says his party has \"made clear from the start\" that \"there was no question of EU citizens who were legally here before Article 50 was enacted being required to leave\". \nQuoting his party's manifesto Mr Crowther said: \"Ukip will allow law-abiding EU citizens living in the UK before Article 50 was triggered the right to stay here indefinitely. We expect the same concession to be granted to British citizens living overseas within the EU. \n\"Some 167,000 EU nationals work in health and social care. Ukip has no hesitation in guaranteeing their right to remain here, whatever the EU decides with regard to the rights of British citizens overseas.\" \nNorth Devon's Green Party candidate Ricky Knight says the \"NHS will be devastated if EU nationals are forced to return\". \n\"One of the tragedies of this election campaign is that we were told that it would be about Brexit but that is just about the only topic that is not being discussed or analysed effectively - once again,\" said Mr Knight. \n\"Freedom Of Information is just that - we all know that the NHS will be devastated if EU nationals are forced to return. And it's happening already of course. \n\"The British public did not vote for a Hard Brexit. That is why the Green Party maintains there must be a Ratification Referendum on the detail of the eventual negotiated deal. This is one of the most momentous decisions the British public have ever had to consider.\" ", "external_links": [], "published": "2017-06-06T18:59:00.000+03:00", "crawled": "2017-06-06T14:50:06.016+03:00", "highlightTitle": ""}