{"organizations": [], "uuid": "0de7797f55312921b99be66bab46ca86d0c2ebf6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article11591961.ece/ALTERNATES/s1200/JS73272001.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13121266", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Unite union head Len McCluskey challenged over 'intimidation'", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-02T15:25:00.000+03:00", "replies_count": 0, "uuid": "0de7797f55312921b99be66bab46ca86d0c2ebf6"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13121266", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Unite union head Len McCluskey challenged over 'intimidation'", "locations": [], "entities": {"persons": [{"name": "len mccluskey", "sentiment": "negative"}, {"name": "coyne", "sentiment": "none"}, {"name": "gerard coyne", "sentiment": "none"}, {"name": "jonathon manning", "sentiment": "none"}, {"name": "snapchat", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "journal business", "sentiment": "negative"}, {"name": "unite", "sentiment": "negative"}, {"name": "snap inc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning EU regulators back Shawbrook takeover bid \nA proposed private equity takeover of challenger bank Shawbrook has been given the green light from EU regulators. \nPollen Street Capital and BC Partners tabled an £825m offer for the lender in March, but Shawbrook urged shareholders to “take no action” and rebuff the bid. \nOn Friday, the duo said they have received notice from the European Commission clearing the offer and shareholders now have until 1pm to accept or reject it. The private equity consortium “urged” shareholders that have not yet accepted the offer to do so before the deadline. \nThe suitors made an approach through Marlin Bidco to buy the lender for 307p a share in January, before upping its offer to 330p a share in cash. Pollen Street is Shawbrook’s biggest shareholder, owning just under 39% of the lender. \nShawbrook, which specialises in lending to small and medium-sized businesses, warned in an investor circular over “significant” costs of the bid, at around £4m if it is aborted and up to £12.5m if it succeeds. \nThe takeover approach comes after Pollen Street Capital floated Shawbrook on the London Stock Exchange at 290p a share in April 2015, valuing the bank at £725m. Shawbrook employs 600 people in 10 offices across the UK. (Photo: PA) Jonathon Manning Manufacturing sector struggles to find enough staff \nRecruiting and retaining talented workers are the biggest risk for companies working in the manufacturing sector, according to new statistics. \nAccording to the results in RSM’s UK Manufacturing Monitor, almost half of the respondents confirmed people risks (49 per cent) and skills shortages (43 per cent) are a major challenge impacting manufacturers. \nThe issue is worsened due to the ageing workforce within the sector, with 75% of respondents flagging this as a concern. The average age of workers has increased over recent years as firms struggle to find young employees. \nDespite the critical need to attract younger workers with future-fit skills, nearly two thirds (63 per cent) of manufacturers didn’t think the new Apprenticeship Levy, introduced by the government in April 2017, would have an impact on apprenticeship numbers. \nCommenting on the findings, Kevin Rooney,partner and manufacturing expert at RSM, said: \nThe sector is facing a perfect storm when it comes to skills. It has an ageing workforce of experienced workers who are vital to the ongoing success of each business but a difficultly attracting younger talent - highlighting a major gap in the transfer of knowledge. Unless action is taken now, the skills could effectively be lost. \nIn addition, Brexit will only increase recruitment and retention threats as any changes to freedom of movement rules following exit negotiations could reduce the supply of young, trained workers further. To tackle this issue head on, North East manufacturers need to be brave and adopt new ways to recruit top talent, whilst engaging their workforce to ensure they retain them. 9:05 KEY EVENT Newcastle's Bond Dickinson pulls off prize US merger with Womble Carlyle \nNewcastle’s biggest law firm Bond Dickinson is merging with its US ally to create one of the biggest firms in the UK with a combined turnover of £340m. \nThe national firm signed a strategic alliance with Womble Carlyle Sandridge & Rice in June 2016, in an attempt to boost its offering in the US. \nA year on, the strategic alliance has progressed well with the two firms agreeing to merge, creating a new business called Womble Bond Dickinson. \nThe merger will go live in October 2017 and create a business with 1,000 lawyers and 420 partners. Womble Bond Dickinson will have 23 offices worldwide - eight in the UK and 15 in the US - and combined revenues of $410m (£340m). \nJonathan Blair, Bond Dickinson managing partner, said the combination allowed the Newcastle business to achieve its aim of becoming a top 20 UK law firm by 2020. The deal will also mean Womble Bond Dickinson will in the top 80 firms in the US. \nMr Blair said that after working in a strategic alliance the two firms discovered a number of overlapping areas between the firms and the regions they work with. \nHe said: \nIf you look at this from a regional perspective there is a great deal of trade between the North East of England and both the Carolinas and Atlanta, Georgia. Newcastle and Atlanta are twinned cities. \nSage who are based here in Newcastle, also have a base in Atlanta. Their office in Atlanta is in the same building as Womble Carlyle. \nManufacturing, the North East’s biggest sector, will be at the heart of the merger. Womble Carlyle already has a large manufacturing focus, meaning improving its links to the North East could lead to more business. \nMr Blair added that the firm also would be looking to enter the life sciences sector and the pharmaceutical sector in the UK following the merger. Bond Dickinson managing partner Jonathan Blair with Womble Carlyle CEO Betty Temple (Photo: Unknown) 9:00 KEY EVENT Retiring MP Iain Wright gets new job as head of Nepic cluster group \nRetiring Teesside MP Iain Wright is to become the new chief executive for the North East regional cluster group NEPIC . \nThe board of NEPIC has confirmed it has selected the outgoing Labour MP for Hartlepool following several months of searching for a new leader with the right formula to drive forward the region’s chemical, biotech and renewables industries. \nHe will start this month, working alongside Dr Stan Higgins who is standing down after spending 14 years as the CEO of the Northeast of England Process Industry Cluster. \nMr Wright, 45, has served as a prominent MP for the past 13 years and was most recently Chair of the Business, Energy and Industrial Strategy Select Committee. \nHe was Minister for Housing and Planning between 2007 and 2009 and Minister for Schools and Apprenticeships in 2009-10, also serving as Shadow Minister for Industry between 2011 and 2015. \nBefore being elected as MP for Hartlepool in 2004, he worked at regional development agency One North East, having begun his career as a chartered accountant with Deloitte. \nTogether with Ian Swales and the board of directors, Mr Wright will focus on representing member firms, championing the region’s process industries and identifying growth opportunities. \nHe said: \nI am really proud and honoured to have been appointed Chief Executive. Under Stan’s excellent leadership, NEPIC is a powerful organisation, representing firms in the North East’s biggest industrial sector and working with them to create jobs and prosperity for our region. Stan will be a tough act to follow, but I am determined to work hard with companies to champion this vital sector and our great region. MP Iain Wright KEY EVENT Camera-enabled Snapchat sunglasses launched in the UK \nSpectacles, the camera-enabled glasses that connect with Snapchat, have launched in the UK for the first time. \nThe £130 sunglasses record 10-second video clips which are then sent to the user’s Snapchat account, where they can be shared with friends. \nThe glasses, which launched in the US in November, are the first piece of hardware built by Snapchat’s parent company, Snap Inc. They will be sold online as well as from bright yellow vending machines, known as Snapbots, which move to a new location each day. \nAfter their launch in the US, long queues at Snapbots were reported, while pairs were also listed on eBay for over $1,000 (£775) as demand soared. \nIt is estimated the company has sold more than 60,000 pairs of Spectacles in the US so far, and chief executive Evan Spiegel has said the company will “keep experimenting” with hardware products. \nThe tech giant has now placed Snapbots in London, Paris, Berlin, Barcelona and Venice to mark the European launch, and said more would appear in other locations in the UK and Europe during the summer. \nSpectacles capture video in a wide-angled, circular format designed to mimic the field of vision captured by the human eye. They are the first major smartglasses product since Google’s ill-fated Glass augmented reality eyewear, which launched in 2014 and enabled users to read messages and get directions as well as take photos. \nGoogle withdrew Glass from sale in early 2015 after concerns were raised over privacy and safety. The firm is said to be working on a new version of the device. \nThe Snapchat app has around 166m daily active users, with more than 55m in Europe. It says more than 3bn snaps are captured with its in-app camera every day. Snapchat's camera-enabled glasses that connect with the app (Photo: Snapchat/PA Wire) 8:50 Jonathon Manning Metro Bank buys mortgage portfolio from investment firm Cerberus for £600m \nMetro Bank has splashed out almost £600m on acquiring a package of UK mortgages from investment firm Cerberus. \nThe deal, for £596.7m, will see the challenger bank pick up a portfolio that consists of 92% buy-to-let mortgages, with the remainder owner-occupied. \nMetro Bank chief executive Craig Donaldson said: \nOur lending and deposit growth has gone from strength to strength and the acquisition of this high-quality loan portfolio supports our high-growth, organic business model as we track ever closer to our 2020 guidance. \nIn particular the acquisition increases the loan to deposit ratio to circa 78% (2020 guidance circa 80%). The portfolio complements our existing mortgage book and demonstrates our willingness and ability, helped by our strong deposit growth, to take advantage of opportunities as they arise. \nThe deal is being financed using cash from existing resources, with the portfolio acquired at a discount to par, Metro Bank said. All lending in the loan book is secured on property, which Metro Bank said is “well diversified across the UK” and has a similar credit risk profile to the group’s current mortgage book. \nThe lender added that the portfolio has a weighted average seasoning of around 10 years and the weighted average loan to value is circa 70%, with a current expected pay rate of 1.6%. \nMetro Bank has gone from strength to strength in recent years, and last month celebrated its one millionth customer. In its last trading update in April, the bank saw a 13% increase in deposit growth to £9bn quarter on quarter, while underlying pre-tax profits rose from £1.5m to £2m. A Metro Bank branch", "external_links": [], "published": "2017-06-02T15:25:00.000+03:00", "crawled": "2017-06-02T10:41:28.023+03:00", "highlightTitle": ""}