{"organizations": [], "uuid": "1a07d4d15bf9421a392db99b465ee67a6d180783", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article13240634.ece/ALTERNATES/s1200/Kynren-An-Epic-Tale-of-England-2nd-season-2017.jpg", "site_section": "http://www.thejournal.co.uk/culture/?service=rss", "section_title": "nechronicle - What's On", "url": "http://www.chroniclelive.co.uk/whats-on/kyren-what-to-expect-review-13240467", "country": "GB", "domain_rank": 21960, "title": "As the second season of historical epic Kynren approaches, what can visitors expect?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-26T21:16:00.000+03:00", "replies_count": 0, "uuid": "1a07d4d15bf9421a392db99b465ee67a6d180783"}, "author": "David Whetstone", "url": "http://www.chroniclelive.co.uk/whats-on/kyren-what-to-expect-review-13240467", "ord_in_thread": 0, "title": "As the second season of historical epic Kynren approaches, what can visitors expect?", "locations": [], "entities": {"persons": [{"name": "kynren", "sentiment": "positive"}, {"name": "kynre", "sentiment": "positive"}, {"name": "peter haygarth", "sentiment": "none"}, {"name": "steve boyd", "sentiment": "none"}, {"name": "arthur", "sentiment": "none"}, {"name": "victoria", "sentiment": "none"}, {"name": "winston churchill", "sentiment": "none"}, {"name": "boudicca", "sentiment": "none"}, {"name": "elizabeth", "sentiment": "none"}, {"name": "heather hopton", "sentiment": "none"}, {"name": "jonathan ruffer", "sentiment": "none"}, {"name": "nathan stornetta", "sentiment": "none"}, {"name": "kevin whately", "sentiment": "none"}, {"name": "bess", "sentiment": "none"}, {"name": "stockton", "sentiment": "none"}, {"name": "ruffer", "sentiment": "none"}], "locations": [{"name": "queen victoria", "sentiment": "none"}, {"name": "kynren", "sentiment": "none"}, {"name": "kent", "sentiment": "none"}, {"name": "auckland castle", "sentiment": "none"}, {"name": "auckland castle trust", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "darlington", "sentiment": "none"}, {"name": "auckland", "sentiment": "none"}, {"name": "boedicea", "sentiment": "none"}, {"name": "auckland arena", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "bishop auckland", "sentiment": "none"}, {"name": "toronto", "sentiment": "none"}], "organizations": [{"name": "ferryhill colliery", "sentiment": "none"}, {"name": "durham miners", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}, {"name": "durham cathedral", "sentiment": "none"}, {"name": "lindisfarne", "sentiment": "none"}, {"name": "time", "sentiment": "none"}, {"name": "tribune", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "What's On As the second season of historical epic Kynren approaches, what can visitors expect? Kynren - An Epic Tale of England attracted 100,000 people to its Bishop Auckland arena in 2016. Here's how they aim to beat that Share   \nThe second season of Kynren – An Epic Tale of England starts on Saturday (July 1) but there was a dress rehearsal and media preview at the weekend. \nThis provided the first opportunity to see how the show, purporting to tell 2,000 years of English history with a North East slant, has developed since its debut season in 2016. \nHundreds gathered for the occasion at the purpose-built arena below Auckland Castle in Bishop Auckland . From next weekend, when the first of this season’s 17 performances takes place, it will be thousands. \nThe uncovered grandstand, known as the Tribune, seats 8,000 people and the organisers, who work for the charity Eleven Arches (the name taken from Bishop Auckland’s famous viaduct), are confident of topping last year’s total audience of 100,000. \nIf you saw Kynren in 2016 you will enjoy spotting changes and innovations. \nSo what’s new for 2017? THE SOUNDTRACK \nRecruited to do the narration this time was popular actor Kevin Whately whose familiar voice over the PA system accentuates the North East flavour of the show, described as “the story of us”. \nWelcoming the audience, he suggests that the Kynren animals love the applause just as much as the human participants. \nOther new contributors for 2017 are the Spennymoor and Ferryhill Colliery bands which recorded new music for the show in Durham Cathedral – and will be present to entertain at the first public performance on Saturday. \nNathan Stornetta’s score, worthy of a big-screen blockbuster, now has a touch of brass to add authenticity to its Durham Miners’ Gala scenes, although the musicians you see in the arena will be miming, just like all other Kynren performers. THE FEMALE PERSPECTIVE Queen Boudicca puts in a first appearance at Kynren (Photo: Peter Haygarth for Eleven Arches) \nIn 2016 the action began with a lone boy, Arthur, kicking a football across the arena. This year he has two friends with him and one, on Saturday, was a girl. \nThe need for more emphasis on the part played by women in our nation’s history was acknowledged last year. \nPutting in an early appearance is Boudicca (or Boedicea) mounted on one of Kynren’s splendid grey horses. Boudicca led a spirited uprising against the occupying Romans in Britain in 60 AD. \nElizabeth I, or ‘Good Queen Bess’, gets a bit more time in the spotlight this year and the British Empire tableau with Queen Victoria is one of the most visually stunning. \nWhile most of the combat scenes involve men, lots of girls and women appear in the big showstopping scenes including the choreographed harvest festival symbolising agrarian Britain before the Industrial Revolution. THE ANIMALS \nThey were stars in 2016 and the show would be the poorer without them. \nAt the dress rehearsal Kynren’s horses were busy, whether pulling great carts or Queen Victoria’s carriage or galloping full pelt as mounted knights tilted at targets in the dramatic jousting scene. \nBut, as last year, it was the farm animals which caused laughter and gasps of amazement. \nThere are more geese this year to run in literally unflappable fashion across the arena and seemingly a bigger flock of sheep and lambs to do likewise. \nAdult cows – Durham shorthorns – appear for the first time and there are goats and a donkey. \nSeagulls from Lindisfarne also appear but they were clearly the work of human hands and are waved above the heads of some of Kynren’s many child performers. THE SPECIAL EFFECTS The grand finale - Kynren 2017 (Photo: Peter Haygarth for Eleven Arches) \nAhead of this season Eleven Arches announced a new creative director, Steve Boyd, who has worked on umpteen Olympic and Paralympic ceremonies. \nExtra depth and detail were promised and have been delivered. \nThere’s a beautiful depiction of Durham Cathedral using fountains and even the building’s famous rose window apppears within the falling spray. Very clever and effective. \nIn the First World War sequence, which has been much improved and focuses on the temporary truce of Christmas 1914, snow – presumably fake, although it can get chilly here even in the summer – wafts across the arena. \nThe early steam locomotive representing the pioneering Stockton to Darlington railway makes a welcome return. \nAnd the fireworks again make for a truly memorable grand finale which comes after victory in the Second World War (dealt with in sketchy fashion with a projection of Winston Churchill and recorded excerpts of some of his stirring speeches). \nAnyone hoping for an update – Brexit, perhaps – will be disappointed. THE MAIN MAN \nIn the audience on Saturday was millionaire philanthropist Jonathan Ruffer whose plan to boost the fortunes of Bishop Auckland and County Durham include Kynren, Eleven Arches and the Auckland Castle Trust which is transforming the castle into a major visitor attraction as well as developing town centre art galleries. \nAsked for his impressions as the applause died down, he said: “It’s rather hard to think of the words really. But didn’t everyone just do brilliantly? \n“Having been to every performance except one last year, I’ve got to know every little detail. \n“This year has been sharpened up so much, the timing and everything. \n“With a bit of good fortune we’ll be up on the 100,000 tickets sold last year and if we sell the whole lot that’ll be more than 140,000.” \nMr Ruffer praised the local volunteers who have taken Kynren to their hearts. \n“We have 1,500 community volunteers and the time will come when we have a waiting list.” \nKynren: Time is running out to volunteer for this year's epic pageant - here's how to get involved VOLUNTEERS \nOne thing which remains the same for 2017 is the cheerful determination of the local volunteers – the so-called ‘archers’ – to ensure everyone has a good time. \nMany of those volunteers not wearing costumes in the arena are part of the hospitality team with their pale trousers and red fleeces. \nThere are so many that you wonder if anyone is left in Bishop Auckland on show nights. \nWhile some are back for a second year, there are also plenty of first-timers from across the North East. There was talk of a volunteer who is commuting from Kent. \nAmong the many friendly archers on duty on Saturday was 63-year-old Heather Hopton, from the nearby village of Toronto. \n“Some of the people I work with were involved with the show last year so I came to see it and thought it was brilliant,” she said. \n“This year I thought I’d give it a go and I’ve been down two or three times for training. \n“The children in the show are really good and they really enjoy it. They make new friends and I think it brings them out if they’re a bit shy.” \nKynren: Time is running out to volunteer for this year's epic pageant - here's how to get involved THE DETAILS \nThere will be 17 performances of Kynren in 2017 with increasingly early start times as the nights draw in. \nPerformances are on July 1, 7, 8, 14 and 15 (all 9.30pm); July 21 and 22, August 11 and 12 (9pm); August 18 and 19 (8.30pm); August 26 and 27, and September 1, 2, 9 and 16 (all 8pm). \nTickets are on sale now at www.kynren.co.uk Like us on Facebook", "external_links": [], "published": "2017-06-26T21:16:00.000+03:00", "crawled": "2017-06-27T03:28:09.000+03:00", "highlightTitle": ""}