{"organizations": [], "uuid": "01314254d4cf8518862c97f9f19dad1f2cf27ef6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13202611.ece/ALTERNATES/s1200/General-Election-2017-Sunderland-Count-and-Declaration.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/not-another-one-uk-general-13202259", "country": "GB", "domain_rank": 21960, "title": "'Not another one': A UK general election is imminent according to the bookies", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-19T12:00:00.000+03:00", "replies_count": 0, "uuid": "01314254d4cf8518862c97f9f19dad1f2cf27ef6"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/not-another-one-uk-general-13202259", "ord_in_thread": 0, "title": "'Not another one': A UK general election is imminent according to the bookies", "locations": [], "entities": {"persons": [{"name": "jeremy corbyn", "sentiment": "none"}, {"name": "brenda parsons", "sentiment": "none"}, {"name": "martin farr", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "farr", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "bristol", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}], "organizations": [{"name": "warwick", "sentiment": "none"}, {"name": "bbc", "sentiment": "none"}, {"name": "canterbury", "sentiment": "none"}, {"name": "paddy power", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "newcastle university", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "ladbrokes", "sentiment": "none"}, {"name": "dup", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe most likely date for yet another general election will be before the end of this year, according to the bookmakers. \nThe odds of it happening by December 31 are 13/8 according to Paddy Power while Ladbrokes put it at 5/2. The odds for there being a full five year parliament are 5/1. \nAnd with the same odds shortening on Labour winning it, a North East political expert believes that’s why the bookies might have it wrong. \n“This is when the fixed term parliament (of five years) comes into its own,” said Dr Martin Farr of Newcastle University. \n“It would requires a no confidence vote for another election and I can’t imagine the DUP allowing that to happen to the government. \n“I expect we could limp on for another five years with a government that can’t do much.” Ballot papers from the first box are counted in Sunderland (Photo: Getty Images Europe) \nWhile the Labour party came second on June 8, its 40% share of the vote and 262 seats was its best result since 2005. \nAnd just 10 days on from that shock result, Tory Prime Minister Theresa May’s stock has plummeted while that of Labour leader Jeremy Corbyn has risen. \nDr Farr said: “That’s why when there is an election there will almost certainly be a new Conservative party leader.” \nAnd another reason the Tory party might not want another general election soon is how the prospect of one is viewed by voters in the different age categories. \nIn the pensioner group which traditionally vote Tory, Brenda Parsons from Bristol gained overnight celebrity when the snap election for June 8 was called when she told a BBC reporter: “Not another one. \n“Oh for God’s sake, I can’t honestly… I can’t stand this. \n“There’s too much politics going on at the moment. Why does she need to do it?” Ballot boxes waiting to be counted \nHowever those in the younger voting category thought differently. More than a million people under the age of 25 applied for a vote in the general election in the five weeks after the snap poll was called. \nAnd in seats like Warwick and Canterbury, Corbyn energised voters aged 18 to 24, particularly students, leading to unlikely seat wins. \nLabour’s promise to abolish tuition fees and a fairer redistribution of the country’s wealth has particularly chimed with the young. In the 18 to 19 age group on June 8, a huge 66% voted Labour against 19% for the Tories. \nMeanwhile each year around 600,000 people turn 18 becoming eligible to vote, providing a rich electoral seam for Labour to mine. Read More Brexit negotiations: What will be discussed and what does the Government want? \nHowever Dr Farr added a note of caution. He said: “I wonder if we’ve reached ‘peak Corbyn’? Will he be able to improve on the June 8 result? I don’t know. \n“A lot of people voted for him not expecting him to do well. Next time there is a chance by voting for him he will be the next Prime Minister. Will they think he is up to the job?” Like us on Facebook", "external_links": [], "published": "2017-06-19T12:00:00.000+03:00", "crawled": "2017-06-19T07:21:41.000+03:00", "highlightTitle": ""}