{"organizations": [], "uuid": "327583dbef33d3e9f4e01d89ab5eb4ad34a17d47", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13149976.ece/ALTERNATES/s1200/MKR_NEC_060617bell_02.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/you-should-vote-conservative-general-13147416", "country": "GB", "domain_rank": 21960, "title": "Why you should vote Conservative at the General Election - in the party's own words", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-08T01:00:00.000+03:00", "replies_count": 0, "uuid": "327583dbef33d3e9f4e01d89ab5eb4ad34a17d47"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/you-should-vote-conservative-general-13147416", "ord_in_thread": 0, "title": "Why you should vote Conservative at the General Election - in the party's own words", "locations": [], "entities": {"persons": [{"name": "jeremy corbyn", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "anne-marie trevelyan", "sentiment": "none"}, {"name": "guy opperman", "sentiment": "none"}, {"name": "james wharton", "sentiment": "none"}, {"name": "richard bell", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "gatwick airport", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "general election", "sentiment": "negative"}, {"name": "snp", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "hitachi", "sentiment": "none"}, {"name": "border force", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nWith the June 8 General Election fast approaching, we have asked North East political figures from the five main parties to tell us why people should vote for them and explain what they will do for the region. \nToday it is the turn of Richard Bell, Conservative North East regional chairman. \nWhen the people of the North East go to the polls on Thursday, not only will they be electing members of parliament for the next five years, they will also be voting to shape the future of the region far beyond that. \nThat is the importance of these elections and the opportunity to vote for the Conservatives with a plan to provide strong and stable leadership for the UK or a coalition of chaos and instability led by Jeremy Corbyn that will put our nation’s future at risk. \nAnd key to this country and the North East moving forwards is a good Brexit deal for Britain. Nissan battery plant, Sunderland (Photo: Copyright unknown) \nThe majority of people in the North East voted for Brexit and a vote for Theresa May means we can get on with Brexit to build a great, global trading nation once again creating new jobs and new opportunities for ordinary working families to build on the success stories of the North East like Nissan and Hitachi. \nNot only that, we will be able to control our borders, our money and our laws once again. \nA vote for any other party would risk seeing Jeremy Corbyn negotiating Brexit by the end of the week, with the SNP and minor parties pulling the strings. \nThe Conservatives have done much for North East since 2010. There are 78,000 more people in work and the number of unemployed people is down by 37%. There are 23,000 more small businesses since 2010. Border Force check the passports of passengers arriving at Gatwick Airport (Photo: Getty Images Europe) \nA total of 70,000 people had a pay rise last year thanks to the National Living Wage, 56,000 people will have been taken out of income tax altogether. \nThere are 47,186 more children attending good or outstanding schools, and 234,000 people have started an apprenticeship in the past seven years. \nYou can only have a strong NHS in the North East with a strong economy and our leadership means there are now 724 more hospital doctors since 2010. \nOn infrastructure projects, £1.4bn is being invested in the North East in new road schemes, £1bn on rail and £500m of North East Growth Deal funding has been made available for 30 transports scheme. \nThe UK and the North face five giant challenges in the next five years and our manifesto plans address them head on - making sure our economy stays strong, emerging from Brexit a strong and united nation, overcoming social divisions by giving people real opportunity, restoring the contract between generations and seizing the opportunity of changing technology. \nThere are already excellent Conservative MPs in the North East in the shape of Guy Opperman , Anne-Marie Trevelyan and James Wharton. They prove when people across this region vote blue their voice is heard in Westminster \nBut we need more excellent Conservative MPs in the North East and when people cast their votes on Thursday they need to choose Conservative to give Theresa May the backing she needs to deliver her Plan for a Stronger Britain for families across the region. Read More ", "external_links": [], "published": "2017-06-08T01:00:00.000+03:00", "crawled": "2017-06-07T20:23:33.000+03:00", "highlightTitle": ""}