{"organizations": [], "uuid": "be1a5042e8c8498dbd84db23ea3844a226c2e6fe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12440957.ece/ALTERNATES/s1200/JS108948235.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13188581", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Tesco sees sales rise after supermarket keeps prices low", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-16T15:25:00.000+03:00", "replies_count": 0, "uuid": "be1a5042e8c8498dbd84db23ea3844a226c2e6fe"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13188581", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Tesco sees sales rise after supermarket keeps prices low", "locations": [], "entities": {"persons": [{"name": "lewis", "sentiment": "none"}, {"name": "dave lewis", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}], "organizations": [{"name": "tesco", "sentiment": "negative"}, {"name": "tesco group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning Morrisons chairman 'surprised' as almost half of shareholders reject pay report \nMorrisons shareholders have vented their anger over a planned bonus bump for chief executive David Potts, with nearly half voting against the supermarket’s remuneration report. \nChairman Andy Higginson said he was “surprised” by the result, which saw 48.11% of shareholder votes cast against the remuneration report, which looks back at the way that the company’s pay policy has been applied over the past year. Only 51.89% voted in favour at its annual general meeting (AGM). \nChairman Andy Higginson said: \nWe consulted widely with shareholders on the new remuneration policy which received strong support with more than 92% in favour so we were surprised not to get a higher vote in favour of the Directors’ Remuneration Report. \nShareholder advisory group Institutional Shareholder Services (ISS) had urged shareholders to reject the report, arguing that performance targets for Mr Potts were too low, while increases to the long-term incentive plan (LTIP) award were above average. \nMorrisons’ remuneration committee had outlined plans to increase the potential LTIP award to 300% of director salary from 240%. If the LTIP and other award targets were met - including those for free cash flow, sales and earnings per share growth - it would result in Mr Potts receiving a total pay package of £5.3m in 2020, compared to the £2.79mhe received for 2016/2017. \nMr Higginson said he “fundamentally disagreed” with ISS’s assessment of the company’s targets. He said: \nNot only does the board believe the targets to be significant and stretching, but the judgement on what the right measures are goes to the heart of rebuilding the business for the long term - striking the right balance between investment in the business and continued outperformance. \nThe company’s remuneration policy, which outlines the way the company intends to reward its executives over the coming years, passed by 92.35%. However, 7.65% of votes were cast in opposition to the policy. \nThe vote for the remuneration report was not binding, though a shareholder rebellion against the policy would have forced the company to make changes to its director pay plans. \nMorrisons earlier this year reported a 49.8% jump in pre-tax profits to £325m while revenue rose 1.2% to £16.3bn, solidifying the chain’s return to form under Mr Potts. \nOn top of a deal to sell its groceries through tech retail giant Amazon, Mr Potts has ploughed investment into price cuts and called time on under-performing stores in his attempts to turn the page on the supermarket’s ill-fated era under ousted boss Dalton Philips. \nHis efforts come as the grocery sector’s so-called Big Four - Tesco, Asda, Sainsbury’s and Morrisons - remain locked in a bitter price war sparked by German discounters Aldi and Lidl. A Morrisons sign KEY EVENT Leading North East business figure Liz Mayes to take up new role at mining institute \nOne of the best known names in the North East business world is taking up a new post heading the revival of a key industrial institution . \nLiz Mayes is leaving her role as regional director of manufacturers’ organisation EEF to become founding director of the Common Room of the Great North, a body which has been set up to take over and manage the North of England Institute of Mining and Mechanical Engineers in Newcastle city centre. \nThe Institute was founded in 1852 ‘to advance the science and art of mining’ and to reduce the toll of death and accidents in the industry. \nFrom its beginnings it acted as a hub for local engineers, industrialists and academics focused on the safe and profitable extraction of the coal that fuelled the industrial revolution globally. Notable members included its founding president Nicholas Wood, Robert Stephenson and Lord Armstrong. \nMrs Mayes, who worked for the employers’ organisation CBI before taking her role at EEF in 2014, has been one of the key figures in recent years representing the region’s manufacturing industry and working with other business groups to push the regional devolution agenda. \nIn her new role she will oversee the redevelopment project at the Mining Institute and put in place a business plan to help sustain the Institute’s building and collections. \nShe said: \nI’m really excited to get involved with this project. Anyone who’s visited the Institute knows that it’s a hidden gem both in terms of the building itself, but also in terms of the incredible collection they have. \nI will be focusing on how we make the Institute relevant again for modern North East industry and most importantly get the next generation of apprentices and engineers involved in its future. Liz Mayes at the North of England Mining Institute (Photo: Publicity Picture) 9:06 Jonathon Manning Hay & Kilner solicitor shortlisted for 'Young Practitioner of the Year' award \nNewcastle law firm Hay & Kilner are celebrating after one of their lawyers has been shortlisted for the Young Practitioner of the Year award. \nPrivate client lawyer Richard Marshall is one of six finalists nominated for the prize at the 2017 Society of Trust and Estate Practitioners (STEP) Private Client Awards. \nThe STEP Awards highlight excellence among professional private client practitioners and the categories are judged by a panel of industry experts. \nMr Marshall, who advises private individuals, business owners, farmers and trustees, is the only North East finalist in his category. \nCommenting on his nomination, Mr Marshall said: \nIt is a real honour to be a finalist of the STEP Young Practitioner of the Year Award, among such notable peers in the industry. I began my career at Hay & Kilner as a Trainee Solicitor in 2010 and received excellent training from some of the foremost Private Client Lawyers in the region. \nThis nomination is a testament to the excellent training and development that I have received at Hay & Kilner. \nThis latest accolade comes shortly after Hay & Kilner’s Private Client Team were crowned ‘Team of the Year’ at the Northern Law Awards. Private client lawyer Richard Marshall 9:00 Jonathon Manning Sunderland retail park bought for £25.6m with plans for Costa drive-thru in the works \nSunderland’s Pallion Retail Park could become home to a drive-thru Costa Coffee, after being bought by new owners for £25.6m. \nThe new owner of the park, Ediston Property Investment Company, said the new coffee shop would improve the park’s amenities and lead to shoppers spending more time there. \nPallion is already home to B&M, Matalan, Dunelm, Poundstretcher, Iceland and Wallpaper Warehouse. The average unexpired lease term is eight years. \nAlong with the addition of Costa Coffee to the site, Ediston is also planning on developing a new unit which could be used as a restaurant. \nCalum Bruce, manager at Ediston Properties, said: \nThere is planning consent already in place to develop a unit of 3,500sq ft in the lower car park. That could be a restaurant unit or another retailer if we find somebody with a use for that type of space. \nWhat we will do with Sunderland is we will acquire it and there are a number of asset management initiatives that we can look at doing which might include lease re-gears. \nThere is a vacant unit we would look to let and there is also the potential to develop a Costa Coffee for example in the car park. All these things not only improve the income of the asset but they also improve the capital value of the asset as well. Pallion Retail Park in Sunderland has been sold for £25.6m (Photo: Ediston Property Investment Company) 8:55 Jonathon Manning David Brown steps down as boss of Transport for the North to lead Northern Rail \nThe man in charge of public transport in the North is to leave his job after taking a position with Sunderland firm Arriva. \nTransport for the North’s (TfN) chief executive David Brown has stepped down to become managing director of Arriva Rail North, which runs the Northern Rail franchise. \nMr Brown had been at the forefront of shaping the future of transport in the North of England over the last two years and had made major improvements to both the private and public sector. \nUnder his leadership TfN, launched its Smart Travel programme, which allows passengers to pay for rail tickets using a smartcard, contactless bank card, and smartphone. \nHe was also tasked with delivering the Northern Strategic Transport Plan and represented the North’s priorities in the development of the national transport strategy. \nMr Brown will take on his new roll in September and will lead Northern Rail’s 5,500 employees. \nHe said: \nI’m thrilled to be joining Arriva at such an exciting time, with the opportunity to help transform the rail services of the north through the Northern franchise. \nI am very much looking forward to leading the business and seeing that investment bear fruit through improved services, capacity and stations for passengers. David Brown will become managing director of Arriva Rail North (Photo: Evening Gazette) 8:50 Jonathon Manning Pound's Brexit collapse 'will boost profits' at engines giant Rolls-Royce \nRolls-Royce has said the collapse in sterling will give it a £400m boost to revenues and a £50m rise in profits. \nThe aircraft engine maker said in a trading update that it will benefit from overseas dollar sales once they are translated back into the Brexit-battered British currency. \nThe firm said: \nIf rates remain unchanged from those seen recently, the impact of the average year-on-year movement on the translation of our overseas subsidiaries results would improve full- year reported revenues by around £400m and improve reported profit before tax by around £50m. \nThe pound has plummeted since the Brexit vote against the dollar and euro, boosting British exporters and hurting importers. \nIt comes after dire results for 2016, which showed Rolls plunging into the red with pre-tax losses of £4.64bn after being hit by a £4.4bn writedown, as well as a £671m penalty to settle bribery allegations. \nBut Rolls said 2017 has started well, with all businesses performing in line with expectations. Its estimates for first-half revenue, profit and free cash flow remain unchanged. \nBoss Warren East said: \n2017 has started well, although we have a great deal more to do to deliver the full year. As expected, near-term cash flow performance remains challenging as we continue to invest in transforming and growing the business to benefit future years. \nNews updates around events such as the Paris Air Show are increasingly expected to reflect our transition from a period of above-trend order book growth to one of operational delivery. \nOur ramp up in large engine production is progressing well, reflecting the significant investments in manufacturing capability in recent years. \nUnder Mr East, the group is on track to make annual savings of around £200m by the end of the year. Rolls-Royce of work being carried out on one of their Trent XWB engines (Photo: Gary Marshall/Rolls-Royce/PA Wire) 8:45 Jonathon Manning Staff prefer early finish Fridays over costly benefits, survey reveals \nEmployers are being urged to offer staff early finish Fridays and flexible hours, after a survey found office workers prefer these perks over more costly benefits. \nA survey of 2,000 full time office workers, conducted by Paymentsense, found that 35% of staff want the option to go home on early on a Friday. The same number of people also believe that having unlimited holidays would also motivate them at work. \nAlso high on the list of perks wished for by staff were company wide bonuses (32%), flexible hours (30%), and a day off on their birthday (28%). \nThese benefits proved more popular than some of the more costly perks offered by some companies such as gym membership, free snacks, and extra training. \nAttracting and keeping talent is a growing issue for employers and staff alike, with over a third of workers saying they would consider changing jobs based on the perk on offer. A woman having a job interview 8:40 KEY EVENT Airbnb to fund £4m scheme to boost local tourism projects \nAirbnb is offering up €5m (£4.3m) to fund local tourism projects across Europe amid criticism over the short-term rental site’s impact on house prices and community cohesion. \nThe company is now calling for letters of interest from European organisations which are seeking to launch projects that “welcome tourism in new ways” and “strengthen communities, empower citizens, and preserve and promote local culture”. \nAirbnb said the programme builds on work done over the past year in Europe, including a community regeneration project in Southwark, London, that turned unused garages into community-led arts, exhibition and meeting spaces. \nThe Community Tourism Programme’s cash pot will also be open to UK applicants, who will submit their interest by August 4, face short-list selection and invitation for full applications by the end of September, and receive confirmation of funding by February 2018. \nThe company is looking for projects that transform public spaces, spark local entrepreneurship, or preserve and celebrate local festivals and events. \nAirbnb said: \nWe hope this initial infusion will catalyse support from other partners interested in joining us in advancing a better tourism for Europe. \nCritics have long bemoaned the negative effects that the short-term rental company has had on local neighbourhoods, driving up house prices and exacerbating housing crunches in major cities like London, Paris, New York and Vancouver as landlords opt for more lucrative Airbnb lettings over long-term tenants. It has even caused authorities to consider new regulations. \nLondon now has a 90-day annual limit for short-term lettings, with extensions requiring special permits. But in an interview in September, the European head of Airbnb hit back at claims that home rental services were ramping up London’s housing crisis. \nOliver Gremillon said: \nThere have been a few studies done by academics which said, no it doesn’t really increase the price of housing. \nThere is a housing shortage in London (but) is it because of Airbnb? No. There are a lot of other reasons why prices are high. \nMr Gremillon explained that the company regularly looks at regional data to determine whether their business is impacting local economies. He added: \nWe look into the data, we see if there is something there and if there is, we try to address whether it’s on the tax side, whether it’s on the regulation, (or) the communication of the regulation. Some of the best Airbnb properties in the North East 8:35 ", "external_links": [], "published": "2017-06-16T15:25:00.000+03:00", "crawled": "2017-06-16T10:36:22.003+03:00", "highlightTitle": ""}