{"organizations": [], "uuid": "943fa0802d8f8117447e51a4e8c6c45e882a6b6e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13095773.ece/ALTERNATES/s1200/Greg-Stone-LIb-Dem-North-Tyneside.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/you-should-vote-lib-dem-13124433", "country": "GB", "domain_rank": 21960, "title": "Why you should vote Lib Dem at the General Election - in the party's own words", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-08T01:00:00.000+03:00", "replies_count": 0, "uuid": "943fa0802d8f8117447e51a4e8c6c45e882a6b6e"}, "author": "nechronicle", "url": "http://www.chroniclelive.co.uk/news/north-east-news/you-should-vote-lib-dem-13124433", "ord_in_thread": 0, "title": "Why you should vote Lib Dem at the General Election - in the party's own words", "locations": [], "entities": {"persons": [{"name": "greg stone", "sentiment": "none"}, {"name": "tim farron", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "dominic lipinski/pa wire", "sentiment": "none"}], "locations": [{"name": "metro", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "north tyneside", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}], "organizations": [{"name": "general election", "sentiment": "negative"}, {"name": "national lib dem", "sentiment": "none"}, {"name": "universal credit", "sentiment": "none"}, {"name": "conservative", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "dla", "sentiment": "none"}, {"name": "liberal democrat", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "regional investment bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nToday we begin a series of articles by North East political figures who want to persuade you to back their party at the forthcoming General Election. \nTo kick things off, Greg Stone, the Liberal Democrat deputy chair for policy and candidate for North Tyneside, outlines his party’s vision for the region and why you should vote Lib Dem on June 8. Liberal Democrat candidate for North Tyneside, Greg Stone \nThe North East has immense potential, but it is a cause of frustration that its potential is not being realised. \nIt is being held back by the failure of national and local Government to remove obstacles to growth and success, as shown by the inability of Labour council leaders to work constructively together to deliver economic transformation and transport investment. \nThere is little sign that Prime Minister Theresa May has a coherent plan to address the adverse impact Brexit will have on our region’s exporting economy and public services like the NHS, or that her Government is making the most of human potential through targeted education, skills, business support, and health initiatives. \nNational Lib Dem priorities include giving the public the final say on accepting the terms of the Brexit deal. \nWe’d increase income tax by 1p to invest an additional £6bn in the NHS and social care, and £7bn in our schools and colleges – including free primary school lunches and tripling Pupil Premium for pre-schoolers. We’d protect the pensions triple lock and oppose Theresa May’s dementia tax – we need a strategy for integration of health and social care. \nOur regional mini-manifesto sets out our agenda and priorities for the North East. The NHS logo (Photo: Dominic Lipinski/PA Wire) \nWe will aim to ensure the Brexit deal supports manufacturing jobs and farmers who rely on Single Market access, and safeguards the interests of universities and the NHS by allowing overseas student and workforce recruitment. \nWe will hold Government to account on support for North East agriculture and will lobby for a new Regional Investment Bank and Regional Development Fund to support the creation and growth of businesses and employment. \nWe will press for a £2bn national fund for flood prevention, the reinstatement of Green Deal funding to create green jobs and a North East brownfield redevelopment fund. \nWe’ll support lifting the public sector pay freeze, helping thousands of North East NHS staff, teachers, police and care workers. \nWe’ll lobby for further investment in our region’s transport network. Metro reinvigoration is a key priority, along with getting on with the still-stalled job of improving the A1 in Northumberland . Better east-west links are still needed. Liberal Democrats leader Tim Farron (Photo: Getty Images Europe) \nGreater scrutiny is needed of regional health performance, including reviews of NHS transformation plans, trust performance, primary care services, and ambulance performance. We’ll seek to oppose hospital closures and support local services: too much is being centralised. \nWe want a greater focus on liberating the potential of region’s young people, with support for discounted bus travel for 16 to 21-year-olds, rent to buy housing schemes, and improving educational attainment and skills training. \nOn social inclusion, we will lift the benefits freeze and press for reforms to welfare sanctions including a yellow-card system, fairer DLA and ESA assessments, and a review of Universal Credit in the region. \nLabour’s stranglehold on the North East is slipping. But a landslide Conservative victory bodes ill for the North East in terms of funding for public services. Conservative MPs will put their Government’s interests before ours. \nElecting Liberal Democrat MPs will ensure effective Opposition, a voice for Liberal values of fairness, sustainability and reform, and a commitment to liberating the North East’s potential. Read More ", "external_links": [], "published": "2017-06-08T01:00:00.000+03:00", "crawled": "2017-06-07T20:23:31.002+03:00", "highlightTitle": ""}