{"organizations": [], "uuid": "666afeb08d323ac6cf7042aa687609ec2fcbf885", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article11371667.ece/ALTERNATES/s1200/JS69571532.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/durham-drops-university-world-rankings-13158013", "country": "GB", "domain_rank": 21960, "title": "Durham drops in university world rankings as Newcastle climbs", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-09T01:51:00.000+03:00", "replies_count": 0, "uuid": "666afeb08d323ac6cf7042aa687609ec2fcbf885"}, "author": "Katie Dickinson", "url": "http://www.chroniclelive.co.uk/news/north-east-news/durham-drops-university-world-rankings-13158013", "ord_in_thread": 0, "title": "Durham drops in university world rankings as Newcastle climbs", "locations": [], "entities": {"persons": [{"name": "richard davies", "sentiment": "none"}, {"name": "ben sowter", "sentiment": "none"}], "locations": [{"name": "durham", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "oxford", "sentiment": "none"}], "organizations": [{"name": "news durham", "sentiment": "negative"}, {"name": "newcastle", "sentiment": "negative"}, {"name": "university strategy", "sentiment": "none"}, {"name": "university college london", "sentiment": "none"}, {"name": "durham university", "sentiment": "none"}, {"name": "imperial college london", "sentiment": "none"}, {"name": "qs world university rankings", "sentiment": "none"}, {"name": "durham university  qs", "sentiment": "none"}, {"name": "cambridge university", "sentiment": "none"}, {"name": "newcastle university", "sentiment": "none"}, {"name": "university of newcastle", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "invalid email  durham university", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Durham drops in university world rankings as Newcastle climbs The QS World University rankings show a squeeze on university resources is causing UK universities to drop down the list Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nDurham University has dropped down an international league table as Newcastle climbs several places. \nThe QS World University Rankings 2018, published on Thursday, show prestigious Durham University is ranked as 78th in the world - down four places from last year. \nBut the University of Newcastle has improved its position from 168th last year to 161st in 2018. \nThe results showed UK universities slipping down in international rankings overall - with 51 of the 76 British institutions included dropping down the list. Durham University \nQS researchers said the falls are more likely to be related to a squeeze on university resources, and increasing competition from other parts of the world, rather than the impact of Brexit. \nThe table, which includes 959 institutions worldwide, does show that the UK is still home to four of the world’s 10 best universities. \nCambridge University is the top-rated UK university, taking fifth place, compared with fourth last year. \nOxford is in sixth place, the same spot it occupied last year, while University College London (UCL) is seventh, the same as last year, and Imperial College London is eighth, up from ninth a year ago. \nThe rankings assess university performance in four areas - research, teaching, employability and internationalisation. \nBen Sowter, head of research at QS, said: “Though the temptation may be to attribute the UK’s second year of struggle to Brexit, we would warn against doing so. Newcastle University (Photo: Newcastle Chronicle) Read More We reveal the millions of pounds North East universities receive in private donations \n“Much of the data we collect for these tables has been collected over a five-year period, and the first year of post-Brexit internationalisation scores suggests that there has, thus far, been a minimal impact on international student and faculty rates at UK institutions. \n“Of greater importance, we believe, is the continued strain on university resources, which appears to be having a deleterious impact on not just research, but also the capacity to deliver world-class teaching.” \nA Durham University spokesperson said: “Durham continues to perform extremely well globally and is listed in the top echelon of universities in the world within these latest QS rankings. \n“We are particularly pleased that the QS rankings recognise our strong reputation amongst academics and employers around the world. Read More Daughter praises Newcastle University dementia breakthrough after it left her father unrecognisable \n“We are also consistently ranked as one of the top five universities in the UK according to The Guardian University Guide 2018 and The Times/Sunday Times Good University Guide 2017. \n“Our new University Strategy includes ambitious proposals to ensure that we build on our strengths so that we can continue to deliver world-class research, education and wider student experience.” \nProfessor Richard Davies, pro-vice-chancellor of Engagement and Internationalisation at Newcastle University, said: “Our performance in the latest QS World University Rankings is a testament to the quality and impact of our research. It also reflects our commitment to continue to deliver outstanding student experience and excellent environment for our students’ personal and professional development.” Like us on Facebook", "external_links": [], "published": "2017-06-09T01:51:00.000+03:00", "crawled": "2017-06-08T21:20:38.000+03:00", "highlightTitle": ""}