{"organizations": [], "uuid": "f07b4a3492bb6db838098949794d8f7dbe897eb4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13159481.ece/ALTERNATES/s1200/splashpanel4.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/uk-election-news-glance-13160731", "country": "GB", "domain_rank": 21960, "title": "Everything we know so far following the 2017 UK election", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-09T13:27:00.000+03:00", "replies_count": 0, "uuid": "f07b4a3492bb6db838098949794d8f7dbe897eb4"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/uk-election-news-glance-13160731", "ord_in_thread": 0, "title": "Everything we know so far following the 2017 UK election", "locations": [], "entities": {"persons": [{"name": "nick clegg", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "ben gummer", "sentiment": "none"}, {"name": "tim farron", "sentiment": "none"}, {"name": "anna soubry", "sentiment": "none"}, {"name": "helen goodman", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "james wharton", "sentiment": "none"}, {"name": "tony blair", "sentiment": "none"}, {"name": "gavin barwell", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "sedgefield", "sentiment": "none"}, {"name": "sheffield hallam", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "darlington", "sentiment": "none"}, {"name": "berwick", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "auckland", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}, {"name": "hexham", "sentiment": "none"}, {"name": "bishop auckland", "sentiment": "none"}, {"name": "stockton south", "sentiment": "none"}], "organizations": [{"name": "tory", "sentiment": "none"}, {"name": "conservatives", "sentiment": "none"}, {"name": "newcastle central and houghton", "sentiment": "none"}, {"name": "tories", "sentiment": "none"}, {"name": "northern powerhouse", "sentiment": "none"}, {"name": "sunderland south", "sentiment": "none"}, {"name": "cancel play", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Everything we know so far following the 2017 UK election How the parties have done in the North East and who is the real winner on a General Election night that has left the UK with a hung parliament Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nIt has been one of the most momentous nights in British politics which began - and is to end - in North East constituencies. \nFirst came the results for Newcastle Central and Houghton and Sunderland South which came in around 11pm. \nAnd it is due to finish at 6am with the results expected from the Northumberland constituencies of Berwick and Hexham. \nTheresa May’s campaign has already brought criticism from Tory backbencher Anna Soubry who hit out at a “dreadful” run-in to the election. \nAnd a number of high-profile Tories lost their seats including former Northern Powerhouse minister James Wharton, Ben Gummer the architect of the Tory manifesto, and former housing minister Gavin Barwell. \nElsewhere, former deputy prime minister Nick Clegg lost his seat in Sheffield Hallam while Liberal Democrat leader Tim Farron had to go to a recount to be sure he could return to Westminster. \nThe Tories set their sights on a number of seats in the North East hoping to steal a victory – ultimately this aim failed but they came closest in Bishop Auckland where Helen Goodman was left with a majority of just 502. \nAs the dust settles on a night which has left the UK with a hung parliament, here is everything we know so far following the 2017 general election. Read More \nSo... Who has won the 2017 UK general election? \nIf you’re judging it by the party who won the most seats, it is the Conservative party. They are on course to win 318 seats. However this is eight short of an overall majority of 326 seats and it means a hung parliament. Who will be the next Prime Minister? \nDespite winning the most seats, it is looks increasingly unlikely that it will be Tory leader Theresa May. She called the election in April in the hope of winning a large majority to give her what she described as a ‘strong mandate’ to go into Brexit negotiations in a gamble that went badly wrong. How have the results gone in the North East? \nIt’s been an excellent night for Labour. At the outset of the campaign the Tories targeted marginal seats like Darlington and Bishop Auckland. They even held out hopes to win Sedgefield, the former seat of ex Prime Minister Tony Blair. Read More \nIn the end Labour held all these seats and even won Stockton South back from James Wharton. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now Who will form the next government? \nThat is something that will have to be thrashed out by the parties over the next few days or even weeks. As the incumbent government and largest party the Conservatives will get the first chance to form a coalition. Read More \nBut there is not an obvious partner for them although a link up with the unionists in Northern Ireland might just get them over the 326 mark to claim a majority. It’s been a bad night for? \nTheresa May - who might well have to stand down as Tory party leader. It’s been a good night for? \nLabour leader Jeremy Corbyn - it’s a result no-one expected which could unite the party behind him and, possibly, put him in with a chance to be the next Prime Minister. Read More", "external_links": [], "published": "2017-06-09T13:27:00.000+03:00", "crawled": "2017-06-09T08:48:26.000+03:00", "highlightTitle": ""}