{"organizations": [], "uuid": "1949d8c4e97161413a732d3fd4dff458dd97ceb1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article13184528.ece/ALTERNATES/s1200/KOR_NJL_050417stan_01.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/bellway-shrugs-election-uncertainty-housing-13184047", "country": "GB", "domain_rank": 21960, "title": "Bellway shrugs off election uncertainty as housing marker remains strong", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-14T19:35:00.000+03:00", "replies_count": 0, "uuid": "1949d8c4e97161413a732d3fd4dff458dd97ceb1"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/bellway-shrugs-election-uncertainty-housing-13184047", "ord_in_thread": 0, "title": "Bellway shrugs off election uncertainty as housing marker remains strong", "locations": [], "entities": {"persons": [{"name": "julian leigh kenyon", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "ted ayres", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}], "organizations": [{"name": "business bellway", "sentiment": "negative"}, {"name": "newcastle", "sentiment": "negative"}, {"name": "bellway", "sentiment": "negative"}, {"name": "general election", "sentiment": "none"}, {"name": "invalid email  housebuilder bellway", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Bellway shrugs off election uncertainty as housing marker remains strong The Newcastle housebuilder is likely to better last year's record results after seeing demand for new homes grow Share Bellway (Photo: © Julian Leigh Kenyon) Share Get business   Thank you for subscribing!   \nHousebuilder Bellway has hailed a “robust” residential property market as buyers ignored the General Election and helped the firm maintain recent strong trading. \nIn a trading update, the Newcastle-based group said sales demand in the four months to June was strong, with a 13% increase in reservation rates to 221 per week. \nAs a result, Bellway added that it expects home sales to grow 10% in the full year as buyers continue to brush aside economic uncertainty unleashed by the Brexit vote and Prime Minister Theresa May’s humiliation at the polls. \nChief executive Ted Ayres said: “Robust market conditions, together with a clear operational focus, is enabling Bellway to continue increasing its contribution to the supply of much-needed new homes. \n“We have made a significant investment in land and work in progress over a number of years and this, together with a strong balance sheet and substantial operational capacity for expansion, should ensure that Bellway is well positioned to deliver further volume growth, this year and beyond.” \nBellway added that the housing market continues to be supported by low unemployment, good availability of affordable mortgages and the Government’s Help to Buy scheme. Read More Newcastle builder Bellway sees order book top £1.12bn as housing demand continues \nDemand remains strong across all regions and has increased throughout spring, “unabated by any uncertainty in the weeks preceding the recent General Election”, Bellway said. \nThe average price for its homes remained at £260,000 and the value of its forward order book of homes stands at £900m, up from £846m in the same period last year. The company is expecting to exceed its original target for the year ending July 31. \nBellway also said land investment was up, with 10,250 plots contracted, up from 8,600. \nThe group’s update said: “Whilst the outcome of the General Election has provided a degree of instability with regards to future Government policy, all political parties recognise the need for increased housing output. \n“The board also remains mindful of the wider uncertainty as negotiations to leave the EU commence, however, the group’s strong forward order book, consistent capital disciplines and strong operational focus should ensure that it is well placed to continue its strategy of disciplined volume growth.” \nAlong with other major housebuilders, Bellway has been enjoying years of record results thanks to low interest rates, falling unemployment and support for house buyers through the Government’s Right to Buy scheme. Like us on Facebook", "external_links": [], "published": "2017-06-14T19:35:00.000+03:00", "crawled": "2017-06-14T15:17:31.002+03:00", "highlightTitle": ""}