{"organizations": [], "uuid": "46ffaad950860e7f985a0e9ec804a84a122b0430", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/30381074/16037417.jpg", "site_section": "http://www.thisisleicestershire.co.uk/generalelection2010/rss.html?chid=182803", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/as-paul-nuttall-steps-down-does-the-general-election-result-spell-the-end-for-ukip/story-30381074-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "Hayley_Watson published Does the general election result spell the end for UKIP?", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-09T19:48:00.000+03:00", "replies_count": 0, "uuid": "46ffaad950860e7f985a0e9ec804a84a122b0430"}, "author": "Hayley_Watson", "url": "http://www.leicestermercury.co.uk/as-paul-nuttall-steps-down-does-the-general-election-result-spell-the-end-for-ukip/story-30381074-detail/story.html", "ord_in_thread": 0, "title": "Hayley_Watson published Does the general election result spell the end for UKIP?", "locations": [], "entities": {"persons": [{"name": "paul nuttall", "sentiment": "none"}, {"name": "skegness", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "diane james", "sentiment": "none"}, {"name": "nigel farage", "sentiment": "none"}, {"name": "nuttall", "sentiment": "none"}], "locations": [{"name": "nuttal", "sentiment": "none"}, {"name": "hillsborough", "sentiment": "none"}, {"name": "boston", "sentiment": "none"}], "organizations": [{"name": "ukip", "sentiment": "neutral"}, {"name": "stoke central", "sentiment": "none"}, {"name": "tories", "sentiment": "none"}, {"name": "dup", "sentiment": "none"}, {"name": "green party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Is there a future for UKIP after a collapse in their vote? Does the general election result spell the end for UKIP? X \nCopy link to paste in your message / Comments (0) \nIt's been a General Election of surprises so far - with an unexpected hung parliament crushing the Tories' hopes of a landslide victory. \nAlso remarked upon has been UKIP leader Paul Nuttall's dismal defeat – despite his standing in a Brexit stronghold. \nRead more: What's next for the main party leaders after the general election result? \nSo as Brexit has supposedly been decided, is there any point of the party anymore? \nThe party's vote tally was down from nearly four million in 2015, to just over 500,000 this time as voters flooded out to both Labour and the Tories. \nEven in Nuttal's Brexit-backing target seat of Boston and Skegness,he finished a distant third behind the two main parties - winning just 7.7% of the vote, and nearly losing his deposit. \nUKIP's support is now within 80,000 votes of dropping below the Green Party across the country - and they do not have any MPs. \nThe abysmal result came months after Mr Nuttall failed to win in the Stoke Central by-election in February. \nMr Nuttall's chaotic exit - after facing a backlash even within his own party over his burqa ban - means UKIP will have its fourth leader within just one year. \nRead more: Bookmakers' odds: Another election in 2017? Or a new Prime Minister? \nLong-serving Nigel Farage gave way last September to new leader Diane James but she quit after just 18 days. \nMr Nuttall then took the helm but faced a backlash after fake claims in his name emerged that he has lost a close personal friend at Hillsborough. \nDespite the catastrophic result for his party Mr Nuttall today claimed the political tide would go back in for UKIP. \n\"I even predict after last night that if things go the way I expect then UKIP could in 18 months' time be bigger in terms of poll rating sand members than it's ever been before,\" he said. \n\"However it will not be with me as its leader. \n\"I am standing down today as the leader of UKIP with immediate effect. \n\"That will allow the party to have a new leader in place by the conference in September.\" \nRead more: The DUP could form the next government - but who are they? \nHe added: \"It is clear that UKIP requires a new focus, new ideas and a new energy - and it is there amongst out ranks. \n\"I think, regardless of the score last night, I have laid the foundations for the future in this General Election campaign but it will be for someone else to build on those.\" \nAfter a poor election result and with Brexit pushing on without them, the single-issue party has now been left without an issue. \nSo unless they regain this new focus - the party's future could be in serious jeopardy.", "external_links": [], "published": "2017-06-09T19:48:00.000+03:00", "crawled": "2017-06-09T17:14:05.013+03:00", "highlightTitle": ""}