{"organizations": [], "uuid": "f2a3fa4578e1181c3ea715532f348bf5fd67b9a6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30376010/16033173.jpg", "site_section": "http://www.middevongazette.co.uk/politics.rss", "section_title": "Devon Live Politics RSS feed", "url": "http://www.devonlive.com/treat-workers-as-pets-not-pests-to-boost-south-west-economy/story-30376010-detail/story.html", "country": "GB", "title": "Treat workers as pets, not pests, to boost South West economy", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-07T15:47:00.000+03:00", "replies_count": 0, "uuid": "f2a3fa4578e1181c3ea715532f348bf5fd67b9a6"}, "author": "Western Morning News", "url": "http://www.devonlive.com/treat-workers-as-pets-not-pests-to-boost-south-west-economy/story-30376010-detail/story.html", "ord_in_thread": 0, "title": "Treat workers as pets, not pests, to boost South West economy", "locations": [], "entities": {"persons": [{"name": "haddleton knight", "sentiment": "none"}, {"name": "jean-claude juncker", "sentiment": "none"}, {"name": "harold macmillan", "sentiment": "none"}, {"name": "juncker", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "craig knight", "sentiment": "none"}], "locations": [{"name": "european union", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "confederation of british industry", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "university of exeter", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Western Morning News       \nUK's decision to leave the European Union becomes increasingly fractious. The commission's president Jean-Claude Juncker is threatening to unmuzzle his attack dogs. \nJuncker himself says \"Brexit will not be an amicable divorce\", \"Brexit cannot be a success\" and \"a deserter (Britain) would not be welcomed with open arms\". \nPrivileged access to the single market and customs union will either end or be repackaged with \"strings attached\" according to the EU's Brexit negotiator. \nYet there are shafts of sunlight splitting the gloom. We will not be tied by European Union negotiating rules; we can buy and sell where and with whom we wish and we can correct our own political mistakes through the ballot box. \nPolitics, to echo Harold MacMillan, is at the whim of events. Yet Brexit, says the Confederation of British Industry, succeeds or fails depending on how this country as a business reacts to threats and opportunities. \nHow will the UK perform in this new world of intense competition? At least we should be able to handle France: a nation seldom awash with glowing reviews about its work rate. \nUnfortunately, the French are far more productive than we are. What the UK completes in one week, the French have knocked off before Thursday's extended coffee break. The Americans match the French in productivity and work even longer hours than the British. The Chinese surpass the Americans and the Germans are, well, fabulously German; if you peer into the very far economic distance you can just make out a Mercedes' fast disappearing tail lights. \nThe root of Britain's dismal productivity lies squarely with business leaders. Not all of them are woeful. Scientific evidence suggests that some leadership approaches the pinnacle of average. In short, we work long and we work stupid. \nIt is easy to spot ineptitude. Really bad management uses agile spaces, flexible working practices and new ways of working; all euphemistic terms for fitting more people into less space. \nOnce ensconced, management concentrates on eliminating waste and errors while standardising work processes, thereby saving money, not making it. The folly is obvious. \nCramming humans into a tight space causes stress; eliminating waste eradicates meaningful workplace enrichment with photos, souvenirs, bric-a-brac, plants and art. \nEradicating errors promotes the simplistic while stripping out the capacity for expansion, learning and knowledge. Meanwhile, would the standard human being please step forward? Science would call this pattern of management inadequate. Consequently, the average company board galvanises the plaudits. \nEnriching zoo animals' enclosures with logs, tyres, sandpits, slides and water features is usually seen as the bare minimum we need to do. Yet install these things in a workplace and design awards fly as if enchanted. \nAnd between these two stations, of misery or indulgence, businesses stop and congratulates themselves. Their workers are infantilised along the continuum that starts at unreliable, untrusted machine cogs and ends with preciously indulged Fauntleroys. \nYet, if every company chose simple kindness over stark process the likely increases in productivity could see the UK upgrade the NHS to match the German model and still have £30 billion left over. \nNot a bad return for organisations treating their employees as pets rather than pests. It is unfortunate that change managers tend never to regard junior colleagues as logical, trustworthy, equal beings; sovereign in their own unmonitored workplaces. \nDominion and expertise must, it seems, be vested in leaders and hired guns who don't work in the spaces, don't relate to the teams and consequently don't understand what is required. \nWere this country's employees allowed to modify their own systems, develop their own environments and realise their own identity then all evidence points to the world following our cold tyre tracks as we add scores of billions to our own domestic product. \nEvery business could benefit, just ask for straightforward help. That would be a true Brexit miracle. \nDr Craig Knight is an honorary research fellow at the University of Exeter. An expert psychology of the work space, he is a chartered psychologist and director of the workplace consultancy Haddleton Knight. \nREAD MORE", "external_links": [], "published": "2017-06-07T15:47:00.000+03:00", "crawled": "2017-06-07T11:40:31.007+03:00", "highlightTitle": ""}