{"organizations": [], "uuid": "69c16a28c3df2a4c12232cf792c8757a51cdd957", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12544230.ece/ALTERNATES/s1200/TMP_NEC_310117Bellway02JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13176973", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Bellway shrugs off Brexit and election concerns to build 10% more homes", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-14T15:25:00.000+03:00", "replies_count": 0, "uuid": "69c16a28c3df2a4c12232cf792c8757a51cdd957"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13176973", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Bellway shrugs off Brexit and election concerns to build 10% more homes", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "negative"}, {"name": "ted ayres", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "bellway", "sentiment": "negative"}, {"name": "bellway homes", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning   spin-out expands following £1m investment \nA spin-out company from Newcastle Univesity and the   Foundation Trust has recruited six new employees after receiving £1m in funding. \nChanging Health received conducted a funding round, with investors including Northstar Ventures’ Finance for Business North East Accelerator Fund. \nTe hires were paired with relocation into Newcastle offices and a partnership with Nuffield Health, the largest not-for-profit healthcare provider in the UK. Changing Health will deliver services to Nuffield’s corporate clients, expanding on the multiple NHS partnerships that are delivering Changing Health to thousands of patients across the country. \nJohn Grumitt. CEO of Changing Health, said: \nWe’re excited to expand and attract talent to the North East following the investment by Northstar Ventures. \nAmong appointed staff members are Business Development Director Mark Scorringe, who previously worked at global pharmaceutical company Eli-Lilly, and Marketing and Communications Director Jonathan Gwillim, who has over 10 years of experience in healthcare market insight. \nChanging Health, which launched last year, uses evidence-based behavioural change techniques to improve the lives of people with Type 2 Diabetes (T2D). Professor Mike Trenell, Chief Scientist at the spin-out, and a Senior Researcher at  , is highly regarded for his research into behavioural change in people with T2D. \nProfessor Trenell said: \nDiabetes is currently the single biggest health issue in the UK and the greatest cost to the NHS and other healthcare providers. Yet 70% of Type 2 Diabetes can be prevented or reversed with a healthy diet and physical activity. \nChanging Health addresses this need by reducing barriers to patients accessing the educational programme they need and for the first time making available evidence-based behavioural change tools that improve health outcomes and reduce delivery costs. \nAlex Buchan, Investment Manager at Northstar Ventures, said: \nChanging Health has taken an established educational programme and, through digitisation, developed a platform that could be a key factor in reducing the number of people living with Type 2 Diabetes. It is the only educational programme where trials have shown a direct reduction in key indicators of diabetes and it is encouraging to see the NHS and an established healthcare provider like Nuffield Health be so quick to adopt the technology. From left to right: Andrew Taws, Gemma Johnson, Jonathan Gwillim, Louise Taylor, John Grumitt, Mark Scorringe , Aarti Sahasranaman and Harley Fuller 9:16 Jonathon Manning Increased tourist spending helps Mulberry grow profits to £7.5m \nLuxury handbag maker Mulberry has reported rising full-year profits, helped by an increase in tourists taking advantage of the weak pound. \nThe company said pre-tax profits in the year to March 31 rose 21% to £7.5m, while revenue was up 8% to £168.1m. \nLike-for-like sales in the UK increased 5% in the period, and Mulberry said that in the 10 weeks to June 3 comparable sales grew 2% in Britain, helped by tourist spend. \nThe group said: \nIn the UK, like-for-like sales were up 2% and continue to benefit from an increase in tourist spending in London, although domestic demand has been softer. \nThe firm last year launched the first collection under recently-hired creative director Johnny Coca, with nine new bags - including a revamp of its best-selling Bayswater design. \nThe “Zipped Bayswater” bag has become an immediate bestseller since its launch in October, Mulberry said. \nMulberry chief executive Thierry Andretta said the new range has “generated strong creative momentum”. He added: \nDuring the year we have made good progress. Our sales and profits are growing, enhancing our strong cash position. \nWe have advanced our international growth strategy with a new partnership in Asia and the continued expansion of our omni-channel offer in key markets. \nThe group has staged a bounce-back over the past two years after seeing profits hammered as it attempted to move upmarket and compete with the likes of Gucci and Dior. \nThe group, which has more than 60 stores globally, announced in 2016 a deal to grow in Asia with its majority shareholder Challice, a company run by Singapore billionaire Christina Ong and her family. To this end, Mulberry opened new stores in Shanghai and Hong Kong earlier this year. Univerasl Design Studio - Mulberry, Manchester 9:15 Jonathon Manning London could lose Euro clearing market after Brexit \nEU authorities are taking back control of euro clearing with a new set of reforms that could see London stripped of the multi-billion pound market following Brexit. \nThe European Commission has put forward proposals that would impose stricter supervision of clearing houses by EU central banks and the European Securities and Markets Authority (ESMA), and in some cases force bigger operations to set up shop within its borders. \nThe move is meant to tighten up and streamline the bloc’s derivatives market, but brings London one step closer to losing its dominance over the euro clearing market, which settles business and trade conducted in the EU currency. \nOfficials said last month that EU institutions and member states had raised concerns over the fact up to 75% of euro-denominated interest rate derivatives are currently cleared in the UK, which will no longer be supervised by EU regulators once it leaves the bloc. \nValdis Dombrovskis, vice-president responsible for financial stability, financial services and capital markets union, said: \nThe continued safety and stability of our financial system remains a key priority. \nAs we face the departure of the largest EU financial centre, we need to make certain adjustments to our rules to ensure that our efforts remain on track. \nAn independent report conducted by EY for the London Stock Exchange last autumn said up to 83,000 British clearing jobs could be lost over the next seven years if euro-denominated clearing leaves London. \nThe proposal will hive off clearing houses into two tiers, determined by whether their operations are considered “systemically important”. Those which are not systemically important will continue to operate under the framework of the European Market Infrastructure Regulation while systemically important clearing houses will be subject to “stricter requirements”. \nThe so-called “tier 2” operations will be forced to comply with any additional requirements set forward by EU central banks like collateral conditions and extra cash cushions. They will also be subject to “on-site inspections” and will have to provide “all relevant information” to the European Securities and Markets Authority. \nHowever, some clearing houses “may be of such systemic importance” that those requirements will not be able to safeguard the EU financial system alone, forcing some businesses to move some of operations within EU borders. \nThat segment of the reforms could affect operations like the London Stock Exchange’s London Clearing House (LCH). The commission’s proposals will now be put forward to European Parliament and the Council of the European Union. The London skyline KEY EVENT   \nOne of the world’s most advanced robotics manufacturers will create up to 60 highly skilled jobs with a move to larger premises in the North East. \nComau UK has invested more than £200,000 and taken a 10-year lease on a plant at Follingsby Park in Gateshead, which will be the primary manufacturing base for the UK plant projects division. \nThe company, which has moved from a unit at the Glover Industrial Estate in Washington, is part of the Fiat Group and employs more than 12,500 people in 13 countries. The company has more than 100 patents and was one of the first robotics manufacturers in the world, working with all of the major automotive manufacturers. \nNeil Geeson, the company’s operations manager in the UK plant projects division, said Comau wanted to work with the North East automotive supply chain to support its future contracts. \nHe said: \nWe are the UK division of one of the world’s leading suppliers of automotive equipment and we differentiate ourselves in the market in that we manufacture our own standard product range including AGVs, laser sources and robots. \nWe don’t need to source these from any other suppliers, unlike our competitors. At the same time, it is our intention to collaborate and engage with other companies operating within the automotive sector who can assist us deliver projects. \nThis new facility provides us with the ideal opportunity to open up that engagement and one of the ways that we will do this is via the North East Automotive Alliance, which will assist us to access some very interesting businesses in the supply chain. Comau's new office at Follingsby Park, Gateshead (Photo: Staff) 9:00 Jonathon Manning Biffa reports £18.7m pre-tax loss after stock market flotation \nWaste management firm Biffa swung to a loss last year as the cost of its stock market flotation trashed the company’s balance sheet. \nBiffa reported an £18.7m pre-tax loss for the year to March 24, compared with a profit of £2.9m in 2016, after it was stung by £29m of exceptional costs linked to its initial public offering. \nStripping out the IPO costs, underlying profits rose from £21.1m to £45.1m. Revenue was up 6.8% to £990.4m as boss Ian Wakelin pointed to further acquisitions after the five Biffa made last year. He said: \nWe have the scale and the network to act as a consolidator in a highly fragmented market place. In the year we completed five acquisitions and have a strong pipeline of acquisition opportunities. \nAt the same time, we have continued to take actions to improve the efficiency of our operations, get closer to our customers and leverage new opportunities for investment. \nThe firm, which floated on the London Stock Exchange in October, is the second largest waste management group in the UK, serving 2.4m households and employing more than 7,000 staff. It believes the UK waste market will continue to grow rapidly - by around 5% a year - forecasting it will be worth £18.5bn by 2020, driven by the country’s rising population and household growth. (left to right) Biffa CEO Ian Wakelin with Owen Franklin, general manager at Biffa Polymers 8:55 Jonathon Manning Durham-made Hitachi train in the spotlight as Queen recreates first royal rail journey \nNorth East engineering has played a starring role as the Queen and Duke of Edinburgh recreated the first train journey made by a monarch 175 years ago. \nThe royal couple boarded a special service at Slough station and made the 19-minute trip to London Paddington to mark the anniversary of the journey made by Queen Victoria at midday on June 13 1842. \nWhile Queen Victoria’s made the journey by steam when rail travel was still in its infancy, the current monarch travelled in one of Great Western Railway’s (GWR) latest trains - an intercity express being built by Hitachi Rail at its factory in Newton Aycliffe, County Durham . \nThe factory is building 57 new trains for the Great Western Railway, one of a number of orders in the UK that is supporting the £82m facility, which created 900 new jobs, including 50 apprentices. \nThe hybrid trains are able to run on the Great Western route under either diesel or electric power, meaning that passengers can benefit from the new trains from the autumn while electrification of the line continues. \nKaren Boswell, managing director at Hitachi Rail Europe, said: \nWe trust that Her Majesty enjoyed the space, comfort and smooth ride on our new Intercity train. From the autumn, passengers will begin to feel the benefits of the new British-built fleet as they travel around the Great Western route. \nThe Great Western trains are one of a number of orders won by the Hitachi plant since it opened two years ago. It is also building trains for East Coast and Hull Trains, and calls have been made for the plant to get the order for HS2 rolling stock. \nHitachi’s global chairman Hiroaki Nakanishi has warned, however, that the long-term future of the plant would rely in part on the Government negotiating a Brexit deal that allowed the company to export trains to Europe. Queen Elizabeth II sits next to Isambard Thomas on a train travelling from Slough to Paddington Station (Photo: Paul Edwards/PA) 8:50 KEY EVENT WH Smith sees high street falls offset by airport and railway shops \nRetailer WH Smith has confirmed under-pressure high street sales continue to be offset by its growing chain of shops based at airports and railway stations. \nThe stationer and newsagent saw total sales in its travel arm jump 8% higher in the 15 weeks to June 10, including a 2% fillip from the weak pound on revenues at overseas stores. \nLike-for-like sales at the division rose 5%, while same-store sales fell 4% across its high street estate. This left total like-for-like sales flat in the quarter. \nWH Smith said rising passenger numbers have helped push travel sales higher, while it has also been benefiting from expansion efforts. It is on target to open 15 UK travel outlets this year, with more planned internationally including six in Rome due to open next month. \nThe group continues to focus on profits and cost cutting at its high street business and said the sales fall was expected, although it marks a steeper decline against the 3% drop seen in the first half. \nWH Smith said it remained “confident” in the full-year result, despite “some uncertainty with regard to the broader economic environment”. A WH Smith branch in London 8:45", "external_links": [], "published": "2017-06-14T15:25:00.000+03:00", "crawled": "2017-06-14T10:59:12.007+03:00", "highlightTitle": ""}