{"organizations": [], "uuid": "10bf1a53a517d3db8414400c991b194d8f8c844c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article11556603.ece/ALTERNATES/s1200/JS93951432.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/new-role-mp-guy-opperman-13191262", "country": "GB", "domain_rank": 21960, "title": "New role for Hexham MP Guy Opperman as work and pensions minister", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-15T22:02:00.000+03:00", "replies_count": 0, "uuid": "10bf1a53a517d3db8414400c991b194d8f8c844c"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/new-role-mp-guy-opperman-13191262", "ord_in_thread": 0, "title": "New role for Hexham MP Guy Opperman as work and pensions minister", "locations": [], "entities": {"persons": [{"name": "guy opperman", "sentiment": "neutral"}, {"name": "guy", "sentiment": "neutral"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "david gauke", "sentiment": "none"}, {"name": "gauke", "sentiment": "none"}, {"name": "ian lavery", "sentiment": "none"}, {"name": "opperman", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "guy opperman  downing street", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}], "locations": [{"name": "northumberland", "sentiment": "none"}], "organizations": [{"name": "hexham", "sentiment": "neutral"}, {"name": "northumberland conservative", "sentiment": "neutral"}, {"name": "house of commons", "sentiment": "none"}, {"name": "democratic unionist party", "sentiment": "none"}, {"name": "invalid email  northumberland", "sentiment": "none"}, {"name": "conservative", "sentiment": "none"}, {"name": "tynedale community bank", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "dup", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "New role for Hexham MP Guy Opperman as work and pensions minister Northumberland Conservative MP Guy Opperman is expected to take responsibility for pensions in Theresa May’s Government Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily   Thank you for subscribing!   \nNorthumberland MP Guy Opperman has been appointed to a key role as a work and pensions minister in Theresa May’s Government. \nThe MP, who represents Hexham, is expected to take responsibility for pensions. One of the Government’s goals has been to get more people enrolled in private pension schemes, to reduce poverty in old age. \nHe is also set to take a lead on what is called financial exclusion. This means people who do not have access to basic financial services such as a bank account, and incur additional costs because they are unable to set up direct debits or may have to depend on loan sharks for credit. \nMr Opperman has experience in this field as he helped create Tynedale Community Bank, a not-for-profit bank in Northumberland which allows people to save and borrow money, with interest at a much lower rate than other lenders. Hexham MP Guy Opperman \nDowning Street has announced that he will be a Work and Pensions Minister. Details of the work he will carry out in that role have not been confirmed. \nHe will report to David Gauke, the new Secretary of State for Work and Pensions. Mr Gauke was Chief Secretary to the Treasury before taking on the Work and Pensions role in Prime Minister Theresa May’ s post-election reshuffle. \nIt comes as the Government confirmed the Queen’s Speech, setting out its legislative programme for the next year, is to take place on Wednesday June 21. \nIt is likely to be a slimmed-down programme thanks to the Government’s precarious position in the House of Commons. Even if Mrs May agrees a deal with the Democratic Unionist Party (DUP), adding their 10 votes to the 317 Conservative MPs, she will still command a very fragile majority. \nMrs May is also likely to argue that her priority for the next 12 months will be Brexit. Guy Opperman \nA senior Conservative source said Mrs May is “confident” of getting the Queen’s Speech through the House of Commons whether or not a deal is reached with the Democratic Unionist Party by Wednesday. \nTalks with the DUP on a deal to shore up a minority Conservative administration are “progressing well” and the parties have reached “broad agreement” on the principles of the Speech, according to a senior Conservative source. Read More Would-be Hexham MP swaps honeymoon for campaign trail after snap election clashes with wedding plans \nBut the source confirmed there was no need for a deal on a so-called “confidence and supply” arrangement to be sealed in order to press ahead with the Speech, and said Mrs May wanted the Government to “get on with its business”. \n“Talks with the DUP have been progressing well and there is broad agreement on the principles of the Queen’s Speech,” said the source. \nWhile Mrs May has been reshuffling her Government, Labour leader Jeremy Corbyn has also conducted a reshuffle. \nWansbeck MP Ian Lavery, co-ordinator of Labour’s general election campaign, was rewarded with a new role as Labour Party Chair. He will continue in the election role as well, and has said Labour is prepared to fight another election later this year. Like us on Facebook", "external_links": [], "published": "2017-06-15T22:02:00.000+03:00", "crawled": "2017-06-15T17:14:13.007+03:00", "highlightTitle": ""}