{"organizations": [], "uuid": "29face25fcbd53372f8c6183ae250b51c1dca1e4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/30389142/16043150.jpg", "site_section": "http://www.thisisleicestershire.co.uk/specialolympics/rss.html?chid=181121", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/ukip-mep-roger-helmer-says-retirement-is-nothing-to-do-with-allegation-he-misused-eu-cash/story-30389142-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "danjmartin published UKIP MEP Roger Helmer says retirement is nothing to do with...", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-14T16:29:00.000+03:00", "replies_count": 0, "uuid": "29face25fcbd53372f8c6183ae250b51c1dca1e4"}, "author": "danjmartin", "url": "http://www.leicestermercury.co.uk/ukip-mep-roger-helmer-says-retirement-is-nothing-to-do-with-allegation-he-misused-eu-cash/story-30389142-detail/story.html", "ord_in_thread": 0, "title": "danjmartin published UKIP MEP Roger Helmer says retirement is nothing to do with...", "locations": [], "entities": {"persons": [{"name": "roger helmer", "sentiment": "negative"}, {"name": "klaus welle", "sentiment": "none"}, {"name": "margot parker", "sentiment": "none"}, {"name": "oakden", "sentiment": "none"}, {"name": "paul nuttall", "sentiment": "none"}, {"name": "helmer", "sentiment": "none"}, {"name": "jennifer rankin", "sentiment": "none"}, {"name": "paul oakden", "sentiment": "none"}, {"name": "paul", "sentiment": "none"}, {"name": "jack adcock", "sentiment": "none"}, {"name": "margot", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "lutterworth", "sentiment": "none"}, {"name": "east midlands", "sentiment": "none"}], "organizations": [{"name": "ukip", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "costa coffee shop", "sentiment": "none"}, {"name": "european parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "UKIP MEP Roger Helmer says retirement is nothing to do with allegation he misused EU cash By danjmartin | Posted: June 14, 2017 1 COMMENTS SHARES Roger Helmer is set to retire as MEP for the East Midlands UKIP MEP Roger Helmer says retirement is nothing to do with allegation he misuse... X \nCopy link to paste in your message / Comments (1) \nRoger Helmer has insisted his announced retirement from the European Parliament has nothing to do with allegations that he has misused public funds and dismissed them as 'politically motivated'. \nThe 73-year-old UKIP veteran said yesterday afternoon he would be stepping down as an MEP for the East Midlands at the end of July after 18 years in the post. \nHowever the Guardian has reported the Harborough-based politician is set to be asked to repay £100,000 of EU cash allegedly for illicitly employing a Ukip party worker, Paul Oakden, as his assistant. \nThe paper said MEPs are banned from hiring full-time assistants who have jobs in national political parties. \nThe Guardian says Mr Oakden was working for UKIP while acting as the MEP's assistant. \nThe Mercury has contacted Mr Helmer's office and been referred to a statement on his website. \nMr Helmer said: \"Naturally I have had many media bids from journalists who want more information (about the allegations). \n\"And I've had to tell them that in respect of this alleged demand for £100,000, I know no more than they do. \n\"I have had no communication whatever from the parliament on the question. \n\"This may seem surprising, but it is not the first time that some allegation of this type has emerged through a press leak, with no information from the parliament to the individuals concerned. \n\"Indeed the parliament has a technique where it deliberately leaks speculative allegations to friendly journalists, and then uses the consequent media reports as a basis for a hostile enquiry. \n\"This procedure is totally improper and prejudicial, but it seems to be common practice.\" \nMr Helmer added: \"The Guardian also seeks to link the £100,000 story to my resignation but I signed resignation papers on May 31, and my first inkling of the Guardian story was an e-mail yesterday (Tuesday) morning from Jennifer Rankin, a Guardian journalist. I immediately sent the Guardian e-mail to Klaus Welle, the parliament Secretary General, demanding an explanation, but so far I have no reply.\" \nThe story, such as it is, is a follows. The parliament indicated to me at the turn of the year that it was concerned about payments to two of my UK staff – though it was not at all clear why they had such concerns. \n\"Nonetheless, I prepared and submitted two very substantial dossiers of evidence supporting the work done by the employees. After some time and several enquiries, I was able to establish that they had cleared one case, related to my regional press officer. \nPaul Oakden joined me shortly after I moved to UKIP in March 2012, and had been a hugely committed and effective constituency Manager until his resignation in December last. \n\"Initially he worked for me, or for me plus my regional colleague Margot Parker MEP. In January 2015, Margot decided to make other arrangements, and I put Paul on a half-time contract, and reduced his salary accordingly by 50%. Paul naturally decided to seek other employment for the remaining 50% of his time, and took a second half-time contract with another employer, as he was perfectly entitled to do under UK employment law. The second contract was with UKIP. I can confirm there is no connection. But the \"scandal\" is simply one more politically motivated attack by the EP on a Eurosceptic MEP. https://t.co/JdLgB7ykTb — Roger Helmer (@RogerHelmerMEP) June 14, 2017 \n\"Paul's duties (for me) included running a busy office in Market Harborough, managing two or three administrative staff, dealing with or supervising correspondence with constituents, organisations, companies, pressure groups, charities and NGOs who phoned, or e-mailed, or visited the office in person. He had overall responsibility for my UK diary and managed my events in the region. He oversaw relations with the media and accompanied me on media meetings. \n\"He and I had regular review meetings at weekends in the region, in Market Harborough or at the Costa Coffee Shop in Lutterworth. He also occasionally accompanied me on overseas missions. \n\"He was even my driver of last resort to get me to the airport when my car was in for service.\" \n\"I do not issue my mobile phone number widely, but Paul's number was on a notice board outside the office. He was available to constituents 24/7. He was also available to me 24/7. Because of the nature of parliamentary work we often had to talk outside normal working hours, at anti-social times, and over weekends and so on. \n\"Against this background, to suggest that Paul wasn't working for me is simply risible.\" \nMr Helmer added: \"The problem, of course, is that the parliament is judge, jury and executioner in its own cause. \n\"In a criminal case, the onus of proof is on the prosecution. In a civil case, we deal with a balance of probabilities. But in the European parliament, they demand proof beyond doubt that work was done – in other words, the rule is guilty until proven innocent. \"Had I known that such an inquiry might arise, I might have required monthly reports and so on but I come from a business background, not a bureaucratic background. \n\"Rather than pile up interminable reports, I prefer to hire good people and delegate. \n\"There is an appeals procedure in the European parliament, but it amounts to little more than asking the same people who made the first decision to confirm it and the great majority of bodies in the parliament are dominated by pro-Europeans who would find against euro-sceptics on an automatic ideological basis. \n\"It may be time to consider other legal options.\" Former UKIP leader Paul Nuttall on the campaign trail He said he had provided 'extensive dossiers' about them with 'solid evidence of the work they had done and had heard nothing since from the European Parliament. \nYesterday Mr Helmer, a former Conservative who crossed the floor, issued a statement saying: \"There will inevitably be speculation that my retirement decision was influenced by the outcome of the June election. \nRead more: Doctor responsible for Jack Adcock's death suspended for a year \n\"But this is not the case. I had reached a decision soon after the Brexit referendum to retire in 2017, and I signed the formal resignation papers in the parliament a couple of weeks before the General Election.\" \nThe Mercury has also contacted the European Parliament to seek clarification on whether Mr Helmer is to be asked to repay any EU cash and if so, how much and why. \nA spokesman said it did not comment on individual cases. ", "external_links": [], "published": "2017-06-14T16:29:00.000+03:00", "crawled": "2017-06-14T13:19:35.000+03:00", "highlightTitle": ""}