{"organizations": [], "uuid": "1e456e902146e2a408241a1a53d982e565fe5847", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13150359.ece/ALTERNATES/s1200/pms.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/history/11-prime-ministers-north-east-13150370", "country": "GB", "domain_rank": 21960, "title": "11 Prime Ministers in the North East - from Churchill to Wilson, Thatcher, Blair and more", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-07T20:00:00.000+03:00", "replies_count": 0, "uuid": "1e456e902146e2a408241a1a53d982e565fe5847"}, "author": "David Morton", "url": "http://www.chroniclelive.co.uk/news/history/11-prime-ministers-north-east-13150370", "ord_in_thread": 0, "title": "11 Prime Ministers in the North East - from Churchill to Wilson, Thatcher, Blair and more", "locations": [], "entities": {"persons": [{"name": "wilson", "sentiment": "negative"}, {"name": "blair", "sentiment": "negative"}, {"name": "thatcher", "sentiment": "negative"}, {"name": "brown", "sentiment": "none"}, {"name": "douglas-home", "sentiment": "none"}, {"name": "winston churchill", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "churchill", "sentiment": "none"}, {"name": "clement attlee", "sentiment": "none"}, {"name": "edward heath", "sentiment": "none"}, {"name": "cameron", "sentiment": "none"}, {"name": "harold wilson", "sentiment": "none"}, {"name": "tony blair", "sentiment": "none"}, {"name": "jim", "sentiment": "none"}, {"name": "gordon brown", "sentiment": "none"}, {"name": "ted heath", "sentiment": "none"}, {"name": "john major", "sentiment": "none"}, {"name": "david cameron", "sentiment": "none"}, {"name": "hilary armstrong", "sentiment": "none"}, {"name": "margaret thatcher", "sentiment": "none"}, {"name": "macmillan", "sentiment": "none"}, {"name": "ramsay macdonald", "sentiment": "none"}, {"name": "james callaghan", "sentiment": "none"}, {"name": "heath", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "churchill", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "iraq", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "north west durham", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "liberal party", "sentiment": "none"}, {"name": "new labour", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "tories", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "cancel play", "sentiment": "none"}, {"name": "sedgefield in co durham", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "\nThe 2017 General Election is upon us. \nThe very first one way back in 1802 was very different to modern affairs. \nWomen weren’t allowed to vote, and the few men who had the right were usually wealthy landowners. \nMost people were excluded from the electoral process. \nThe two parties back then were the Tories (who as you might have guessed were the forerunners to the Conservatives), and the Whigs who were an early version of the Liberal Party. \nThe Conservatives first emerged in 1834, and the Liberals in 1859. \nThe Labour Party was formed in 1900 and formed its first government in 1924, with Ramsay MacDonald as Prime Minister. \nIt wasn’t until 1918 that all men were given the vote, as long as they were over 21. \nWomen were also allowed the vote for the first very time that year - but they had to be over 30. \nBy 1929, both men and women could vote - so long as they were over 21. \nAnd it wasn’t until as recently as 1969 that men and women could vote when they reached 18. \nMeanwhile, on the occasion of the 2017 General Election, we recall in pictures, 11 post-war Prime Ministers who visited the North East. View gallery Winston Churchill (Conservative: Prime Minster 1940-45 and 1951-55) \nA serious of political blunders and errors of judgment in his early career failed to derail Churchill. He returned from the political wilderness and was Britain’s victorious leader during World War II. He was re-elected in the 1950s. Clement Attlee (Labour: 1945-51) \nA loyal and competent deputy PM in the World War II coalition government, Attlee’s Labour won a landslide in 1945, his government forging the NHS, the welfare state, and the rebuilding of a shattered nation. Harold Wilson (Labour: 1964-70 and 1974-76) \nWilson followed a succession of Tory grandees - Douglas-Home, Macmillan and Eden - into number 10. In the 1960s he was keen to promote the new “white heat of technology”. His second term in the mid-70s was beset with problems as western economies faltered. Edward Heath (Conservative: 1970-74) \nKnown to most as Ted Heath, he was an embattled PM, tackling endless strikes and industrial disharmony, spiralling prices, the escalation of ‘the Troubles’ in Ulster, and the “three-day week” when Britain’s lights went out. Heath would serve as a Tory back-bencher until he was 85. James Callaghan (Labour: 1976-1979) \nThe former Chancellor, Home Secretary, and Foreign Secretary succeeded Harold Wilson as PM. “Sunny Jim”, as he was dubbed by the press, had a difficult time and a Labour minority in the Commons saw him seeking a deal with the Liberals. The widespread strikes of 1979’s “Winter of Discontent” played a large part in Labour’s defeat at the polls in May that year. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now Margaret Thatcher (Conservative: 1979-1990) \nLoved by some. Loathed by others. As Britain’s first woman Prime Minister , her right-wing economic policies and uncompromising style proved highly divisive. In the North East, her 11-year tenure was marked by the decline of traditional industries, high unemployment and increasing social problems. Read More Police officer dragged along A690 near Durham after carrying out breath tests John Major (Conservative: 1990-97) \nSometimes lampooned as ‘the grey man of politics’, the mild-mannered former insurance clerk was in stark contrast to his strident predecessor. His Premiership was marred by the Black Wednesday financial crisis and a host of “sleaze” headlines surrounding his party in the mid-90s. Tony Blair (Labour: 1997-2007) \nMP for Sedgefield in Co Durham, Blair won a landslide victory for ‘New Labour’ just over 20 years ago. With policies that often moved away from traditional socialism, he led his party to an unprecedented three consecutive election victories. In recent years Blair has faced criticism for his role in supporting the 2003 US invasion of Iraq. Gordon Brown (Labour: 2007-2010) \nAfter the longest stint as Chancellor in modern times, Brown succeeded his old friend and political rival, Blair, as Prime Minister. His arrival at number 10 coincided with the onset of a deep-rooted global recession and a decline in Labour’s popularity. Read More Labour's support on the rise as party steals voters from the Conservatives, new survey reveals David Cameron (Conservative: 2010-2016) \nThe 2010 election delivered the first hung parliament for decades and the Tories under Cameron were only able to govern - for the first time in 13 years - by going into coalition with the Lib Dems. One of the 2015 election manifesto pledges, the “Brexit” vote, saw him resign as PM in 2016. Cameron had supported Remain. Theresa May (Conservative: 2016 - ) \nOur photo shows 36-year-old May when she contested the North West Durham seat for the Tories in 1992. She lost to Labour’s Hilary Armstrong by 10,000 votes. Twenty-five years on, will she continue as Prime Minister? Is she “strong and stable”? Or is she “weak and wobbly”? The voters will soon decide. Like us on Facebook ", "external_links": [], "published": "2017-06-07T20:00:00.000+03:00", "crawled": "2017-06-07T15:32:11.000+03:00", "highlightTitle": ""}