{"organizations": [], "uuid": "a45cec619756c99b23482c07a107c936ec2c08f8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article13164632.ece/ALTERNATES/s1200/General-Election-2017-aftermath.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/what-general-election-result-mean-13164586", "country": "GB", "domain_rank": 21960, "title": "What does the General Election result mean for Brexit and the deal we're likely to get?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-09T22:53:00.000+03:00", "replies_count": 0, "uuid": "a45cec619756c99b23482c07a107c936ec2c08f8"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/news/north-east-news/what-general-election-result-mean-13164586", "ord_in_thread": 0, "title": "What does the General Election result mean for Brexit and the deal we're likely to get?", "locations": [], "entities": {"persons": [{"name": "arlene foster", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "republic of ireland", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "democratic unionist party", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "world trade organisation", "sentiment": "none"}, {"name": "dup", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News What does the General Election result mean for Brexit and the deal we're likely to get? The DUP and Conservatives want different Brexit deals and as it stands it is unknown who will get their way Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nTheresa May called a General Election with the belief that increasing the number of Tory MPs would allow her to easily force through a hard Brexit. \nThe plan ultimately backfired, and with the party losing 12 seats on a night of shocks, the Prime Minister has had to strike a deal with Northern Ireland’s Democratic Unionist Party (DUP). \nBrexit, of course, will go ahead but with two parties now working together on the deal it could look very different than how Theresa May imagined it. \nHere, we look at what the election result could - or could not - mean for Brexit negotiations . What is a ‘hard’ Brexit? \nA hard Brexit would involve a more stringent cut off from Europe. \nThe term is used to describe an arrangement where the UK completely removes itself from the EU . The UK would also give up full access to the single market and the EU customs union. This means that the freedom of movement of people, goods, capital and services would be stopped. \nUnder this arrangement the UK would have to make its own trade deals, would gain more control over its borders, and would not be bound by EU laws. \nHowever, many businesses would be subject to high tariffs when trading with EU countries, at least while working under World Trade Organisation rules. Arlene Foster (left), leader of the Democratic Unionist Party, with Prime Minister Theresa May (Photo: PA) So what is a ‘soft’ Brexit? \nA soft Brexit describes a situation where the UK leaves the EU but works to keep its laws as close as possible to those already in place. This arrangement is preferred by Remain voters. \nThe biggest difference is that fans of a soft Brexit want the UK to keep its access to the European single market. Businesses would be able to continue to trade with the EU without having to pay tariffs. So, will we get a hard or soft Brexit deal? \nAt the moment it is too early to tell what type of deal we are likely to get. \nTheresa May is in favour of a hard Brexit but this is directly against what the DUP has said it wants in its manifesto. \nThe party has said it wants a soft Brexit in order to make the border between Northern Ireland and the Republic of Ireland as “frictionless” as possible. Read More \nThe DUP’s manifesto has also called for a “comprehensive free trade and customers agreement with the European Union”. Will the DUP get its way? \nAlthough the DUP has shot into the limelight after helping the Tories secure a minority Government, it still only has 10 MPs. The power still lies with the Conservatives . \nBut the DUP has a number of controversial policies, which it could try and keep through negotiating with the Tories. Northern Ireland is the only remaining part of the UK where same-sex marriage is not legal, and senior DUP officials have called for that to remain. \nThe party’s leader Arlene Foster has also said the party remains opposed to any reform of Northern Ireland’s strict abortion laws. Read More", "external_links": [], "published": "2017-06-09T22:53:00.000+03:00", "crawled": "2017-06-09T18:55:05.002+03:00", "highlightTitle": ""}