{"organizations": [], "uuid": "8cea090b5a35d6a8474ed69d8d0d08367541cbf8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13143120.ece/ALTERNATES/s1200/politics.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/general-election-2017-campaign-live-13148392", "country": "GB", "domain_rank": 21960, "title": "General Election campaign LIVE: Parties in final push for votes on the day before polls open", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-07T14:12:00.000+03:00", "replies_count": 0, "uuid": "8cea090b5a35d6a8474ed69d8d0d08367541cbf8"}, "author": "Tom Eden", "url": "http://www.chroniclelive.co.uk/news/north-east-news/general-election-2017-campaign-live-13148392", "ord_in_thread": 0, "title": "General Election campaign LIVE: Parties in final push for votes on the day before polls open", "locations": [], "entities": {"persons": [{"name": "jeremy corbyn", "sentiment": "none"}, {"name": "tim farron", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "philip", "sentiment": "none"}], "locations": [{"name": "south east", "sentiment": "none"}, {"name": "north wales", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "glasgow", "sentiment": "none"}, {"name": "midlands", "sentiment": "none"}], "organizations": [{"name": "general election", "sentiment": "negative"}, {"name": "tories", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Theresa May wishes Diane Abbott a \"speedy recovery\" \nTheresa May has sent well-wishes to Diane Abbot 11:49 Tom Eden Abbott diagnosed with ‘serious, long-term condition’ \nLabour’s shadow international trade secretary Barry Gardiner has said that Diane Abbott has been diagnosed with “a serious, long-term condition”. \nHe told HuffPost: \nI have been told that Diane has been diagnosed with a serious, long-term condition. \nI hope people will simply say ‘Okay, fair dos, if that’s the reason she’s been under par, we should back off’. Scotland Tom Eden 'No referendum in next five years' — Tories \nThere will be no second independence referendum in the five years of the next Parliament, the Scottish Secretary said, as it could take until 2022 for Brexit to “play out”. (Photo: Huddersfield Examiner) \nDavid Mundell appeared to rule out the prospect of a fresh vote on the issue, saying he did “not see circumstances in which we would be having a referendum in the next five years”. \nScotland’s First Minister Nicola Sturgeon insists there should be such a ballot when the terms of the UK’s exit deal from the European Union (EU) are clear and has previously suggested a vote could be held between autumn 2018 and spring 2019. \nMs Sturgeon, the SNP leader, argues this is necessary to give Scots, who voted to remain in the EU, an alternative to the “extreme Brexit” proposed by Prime Minister Theresa May and the Conservatives. \nMrs May told the Scottish Daily Mail: \n“I have been very clear now is not the time to be talking about a second independence referendum. \n“That is because now - with the crucial Brexit negotiation starting 11 days after the poll on Thursday - we need to ensure we’re working together, not pulling apart. \n“I would say to people in Scotland that if they support the Union, if they believe in the Union as I do, then they should be voting Conservative on Thursday.” \nThe Tory leader said it was time “Nicola Sturgeon stopped having this tunnel vision about independence”, adding: “My message to Nicola Sturgeon and the Scottish nationalists won’t change on this - that now is not the time to be talking about an independence referendum.” London Bridge Tom Eden London attack death toll rises to eight \nThe death toll from the London Bridge terror attack has risen to eight after police searching for a French man missing since Saturday recovered a body from the River Thames. 10:52 Tom Eden Keir Starmer dismantles May's human rights pledge \nWell worth a listen - Sir Keir Starmer, the former director of public prosecutions and shadow Brexit secretary, said there was “nothing in the Human Rights Act that gets in the way of effectively tackling terrorism”. \nHe said in his former role he “worked very closely with the security and intelligence services and we prosecuted very, very serious criminals and the Human Rights Act did not get in the way of what we were doing”.Instead, Sir Keir said the “problem is people just coming onto the radar, then the question of how they are risk-assessed and what resource we’re putting in to deal with them”.“The Prime Minister, because she was facing searing questions about that yesterday, about resources, she’s now brought up the Human Rights Act as if that stands in the way of the current problem.”Sir Keir said: “The questions we need to ask ourselves are has the withdrawal of many thousands of police officers had an impact on the amount of intelligence that’s coming on the radar?”He added that there was “no incompatibility between protecting human rights and taking effective action against terrorists”. 10:30 Tom Eden Corbyn talks Scottish referendum \nJeremy Corbyn has said he does not see the “urgency or the need” for another independence referendum in Scotland. (Photo: PA) \nThe Labour leader was asked about the issue during broadcast interviews before he took to the stage in Glasgow city centre for the first of several rallies on the eve of the General Election. \nHis position on a second referendum has been questioned during the campaign, despite spelling out opposition to another ballot in the party’s manifesto. \nBut it was Scottish Labour leader Kezia Dugdale’s views that came under scrutiny on Tuesday evening, after SNP leader Nicola Sturgeon claimed during a television debate that she had told her following the Brexit vote that “Labour should stop opposing a referendum” - a claim Ms Dugdale denies. \nAsked about the exchange, Mr Corbyn refused to be drawn, saying: \n“The priority is the election of a Labour government... I do not see the urgency or the need for an independence referendum. \n“What matters is an economy that works for all, protecting our pensioners, investing in our young people, and negotiating a Brexit deal that guarantees tariff-free access to the European Union and guarantees the rights of European nationals living in every part of the UK.” 09:33 Tom Eden More on Abbot's stand-in \nDiane Abbot’s stand in, Lyn Brown has been the Member of Parliament for West Ham since 2005 and was a Shadow Minister at the Home Office between September 2015 to 28 June 2016. 09:25 KEY EVENT Government 'underestimated' ordinary people — Corbyn \nJeremy Corbyn has begun a marathon final day of General Election campaigning with a rally in Glasgow city centre. (Photo: PA) \nDespite Labour continuing to trail the Conservatives in the polls - even though the gap has narrowed since the start of the campaign - an upbeat Mr Corbyn insisted the party could win in Thursday’s vote. \nHe told the crowd: \n“They underestimated us didn’t they? \n“They underestimated the good sense of ordinary people, ordinary people all over Britain.” \nThe speech marked Mr Corbyn’s 84th campaign rally, with a further six events planned across the country over the course of the day, culminating in his Islington North constituency in the evening. 09:11 Tom Eden Lyn Brown to step in to fill Abbot's role \nJeremy Corbyn has announced that Lyn Brown will stand in for Diane Abbott as shadow home secretary for the period of her ill health. BREAKING Diane Abbot to be replaced \nDiane Abbott is still “not well”, Jeremy Corbyn has said.The shadow home secretary pulled out of two major election events on Tuesday due to illness amid relentless criticism from the Tories who see her as a weak link in Labour’s team. (Photo: Getty Images) \nHe said: “Of course Diane is somebody that works extremely hard and represents her community very well and I have to say has received totally unfair levels of attack and abuse not just recently - over many years.” \nAsked how long she would be taking a break, Mr Corbyn replied: “I’ll be talking to her later on today - she’s not well at the moment.” \nMs Abbott had been due to take part in a debate on BBC Radio 4’s Woman’s Hour and a hustings organised by the London Evening Standard, but was replaced by shadow foreign secretary Emily Thornberry. \nA Labour spokeswoman said Ms Abbott’s absence from the Woman’s Hour debate was because she had fallen ill but the last-minute decision meant Ms Thornberry had to cycle to the studio to fill in. Lib Dems Tom Eden 'Vote tactically to avoid Tory landslide' \nA Tory landslide will only be prevented if people vote tactically, Liberal Democrat leader Tim Farron has said. Liberal Democrats leader Tim Farron (Photo: Getty Images Europe) \nHe told the Press Association: \n“We are saying to people in areas where you know the Liberal Democrats are the main challengers, as we seek to minimise Theresa May’s majority, then backing the Liberal Democrats is a powerful way that you can send a message that she does not have a blank cheque to bring in the dementia tax, cut the police and do the damage that she is going to do to our health service.” \nDenying that the Lib Dem campaign had failed to break through with voters, Mr Farron said: “Our bid is to ask people to lend us their vote so that we can get out there and prevent Theresa May taking the country for granted.” \nMr Farron branded the Tories “hapless and heartless” as he accused Mrs May of dodging questions and changing position throughout the election battle.Attempting to move the agenda back on to Brexit, Mr Farron said the Tories could not be trusted to handle withdrawal negotiations. \n“They can’t even write a manifesto they can stand by, yet they want you to trust them with the biggest negotiations this country has ever done. \n“Have no doubt, Theresa May will get us a bad Brexit deal - and I mean dementia tax bad.” \nMr Farron has insisted the Lib Dems could double their tally of MPs to 18 despite poor poll ratings. 08:27 KEY EVENT #LastMinuteCorbynSmears \nIf you haven’t seen the front page of today’s Sun, it claims that in 2002, Jeremy Corbyn made a speech at a Trafalgar Square rally, which was attended by followers of hate preachers. \nIt has all the hallmarks of Lynton Crosby, the Conservative’s campaign strategist, who is revered in Tory circles for masterminding Boris Johnson’s mayoral victories and David Cameron’s 2015 shock majority. \nCrosby is well-known for his ‘dead cat’ strategy — the introduction of a dramatic, shocking, or sensationalist topic to distract voters. \nHowever, people on social media have reacted with some suggestions of their own. \nHere are some of the best Twitter reactions to this last-day onslaught aimed at Jeremy Corbyn, starting with Gateshead candidate, Ian Mearns: 07:55 Theresa May heckled visiting a market \nTheresa May has been booed on a very early morning visit to a butchers’ stall: 07:50 Tom Eden Theresa May slammed over human rights \nTheresa May’s vow to rip up some human rights laws if they stop her from tackling terrorism is not about keeping the country safe but rather making up for her “lacklustre” election campaign, Nick Clegg has claimed. (Photo: Getty Images Europe) \nThe former deputy prime minister attacked Mrs May’s plans as a “crass last-minute attempt to divert attention from the much more difficult questions around our anti-terrorism policy to appeal to the splenetic prejudices of the right-wing tabloids”. \nDuring a speech on Tuesday evening, the Prime Minister said she would change any laws that got in the way of preventing jihadis waging war on Britain. \nBut Mr Clegg said there was “absolutely no shred of evidence that human rights laws are the reasons why these murderous acts happened in Manchester and London”.The former Liberal Democrat leader told BBC Radio 4’s Today programme: \n“None of this posturing about human rights is about keeping us safe - it’s all about making up for her lacklustre, flagging election campaign. I think it’s very cynical and I don’t think people will be taken in by it. \n“Attacking the principles of human rights legislation is not the way to keep us safe - we know already in the last few days that there are issues about the information provided by communities to the police not perhaps being acted upon, we hear overnight that one of the perpetrators of this atrocity on London Bridge was on an EU-wide database and for some reason that was not acted upon by British authorities.” \nHe said the country instead needed to “enhance” its use of EU-wide databases, which he said were the “most sophisticated pool of information”. \nHowever, he claimed that Tory plans would make it “illegal” for the EU to share data with the UK. \n“It would be illegal for 27 other countries in the European Union to share data with us if we in the future, under Theresa May’s plans, rule out abiding by European Union data protection rules,” Mr Clegg told the programme. \n“Those are the difficult questions she has spent seven weeks ducking, and what she does 24 hours before an election to appeal to Nigel Farage and Ukip voters and others who she needs alongside tomorrow is to make this explosive claim free of any evidence whatsoever that the problem lies with human rights legislation.” 07:44 KEY EVENT Exclusive North East poll \nLabour’s backing in the North East is on the rise while fewer people are going to side with the Tories, according to an exclusive nationwide survey of voting intentions. \nAcross the region, 48% of people said they are planning to vote Labour on Thursday, compared to 39% who said that was their planned vote at the start of the election campaign. \nThe proportion of respondents backing the Tories is at 22%, compared to 23% backing the party at the start of the campaign. \nA similar survey at the start of May found 32% of respondents in the region said they were planning to vote Tory on June 8 compared to the 25% who said they voted for the party in 2015, while the Labour vote was at 42% - down from the 45% who said they had voted for the party in 2015. ", "external_links": [], "published": "2017-06-07T14:12:00.000+03:00", "crawled": "2017-06-07T09:32:50.000+03:00", "highlightTitle": ""}