{"organizations": [], "uuid": "3fb242a51b8bfb7458d7fdfb56d568c0593cf985", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/what-human-rights-act-theresa-13151403", "country": "GB", "domain_rank": 21960, "title": "What is the Human Rights Act which Theresa May wants to 'tear up'?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-07T22:45:00.000+03:00", "replies_count": 0, "uuid": "3fb242a51b8bfb7458d7fdfb56d568c0593cf985"}, "author": "Simon Meechan", "url": "http://www.chroniclelive.co.uk/news/north-east-news/what-human-rights-act-theresa-13151403", "ord_in_thread": 0, "title": "What is the Human Rights Act which Theresa May wants to 'tear up'?", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "neutral"}, {"name": "keir", "sentiment": "none"}, {"name": "keir starmer", "sentiment": "none"}, {"name": "blair", "sentiment": "none"}, {"name": "martha spurrier", "sentiment": "none"}, {"name": "wilson", "sentiment": "none"}, {"name": "thatcher", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "north london", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "hillsborough", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "churchill", "sentiment": "none"}], "organizations": [{"name": "european convention of human rights", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "slough", "sentiment": "none"}, {"name": "human rights group liberty", "sentiment": "none"}, {"name": "liberty", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News What is the Human Rights Act which Theresa May wants to 'tear up'? The Prime Minister said human rights laws could stop Britain from deporting foreign terrorists or restricting suspects' movement Share Prime Minister Theresa May speaking at a rally in Slough while on the General Election campaign trail (Photo: PA) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nTheresa May says it could be essential to tear up human rights laws so Britain can fight terrorism. \nThe Conservative leader told supporters in Slough she would seek to change human rights laws in Britain to give police and security forces “the powers they need” to combat an “evolving” terror threat, in light of deadly attacks in Manchester and London. \nShe said: “I mean longer prison sentences for people convicted of terrorist offences. I mean making it easier for the authorities to deport foreign terrorist suspects back to their own countries. \n“And I mean doing more to restrict the freedom and the movements of terrorist suspects when we have enough evidence to know they are a threat, but not enough evidence to prosecute them in full in court. \n“And if our human rights laws stop us from doing it, we will change the laws so we can do it.” So what human rights legislation is Mrs May talking about? \nThe Prime Minister has said she won’t seek to pull Britain out of the European Convention of Human Rights once Britain leaves the European Union (EU). The convention is a treaty between 48 European countries, including non-EU states. The convention is separate from the EU. \nIt seeks to protect basic human rights across the continent. Britain enshrined these into its own law when it adopted the Human Rights Act in 1998. \nBut the Tories, if re-elected, could potentially try and alter or amend parts of the 1998 act. What is the Human Rights Act? \nAdopted in 1998, the act made the European Convention’s human rights protections part of British law. \nCrucial parts include the right to life, a ban on torture and a guarantee for a fair trial. \nThe act also gives everyone in the UK, whether they are a citizen or not, the right to freedom of thought and expression, and freedom of religion. \nWhy would Theresa May want to alter it and what has it got to do with terrorism? \nThe act has been criticised by some for restricting the way police and security forces can fight terrorism and extremism. One example is control orders. \nIn 2007, a control order was issued against an Ethiopian, who security forces thought may be involved with terrorism. At first he was ordered to stay under curfew at an address in North London, but in 2008 the order was changed and he was told he would have to move to a midlands town 150 miles away. The aim was to limit his contact with “extremist associates” in London. \nHis lawyers argued the restriction contradicted his right to liberty under Article 8 of the Human Rights Act, which guarantees respect for private and family life. The man’s family lived in London, and the order made it harder for him to see them. \nThe act also places limits on the state’s ability to detain people when there is not sufficient evidence yet to charge them, as people in Britain have the right to be free under Article 5 of the act. \nUnless they are convicted, or in some cases charged, of an offence, people should not be detained for too long. \nHuman Rights Group Liberty has used to the act to over turn part of the Anti-Terrorism Crime and Security Act 2001. \nIntroduced after 9/11, the Anti-Terrorism Crime and Security Act gave the state the power to indefinitely detain foreign nationals suspected of terrorism without having to charge or convict them, if deporting them was impossible. \nIn 2004, this practice was deemed in contradiction of the Human Rights Act’s freedom guarantees. \nHowever, human rights campaigners say such powers could be abused by the Government and lead to innocent people being detained. Without the human rights act, they argue, the Government could find it easier to imprison people who have done nothing wrong. What else could Theresa May want to change? \nThere are also clauses about freedom of expression and freedom of conscience, which critics say can protect extremists. \nHowever, police can step in if actions compromise public safety, public order, health, morals and the rights or freedoms of others. \nThe act allows people to assemble peacefully and hold public demonstrations. However, if this compromises national security, the state can step in. \nIt also gives people a right to a trial within a “reasonable” time if they are detained in custody. That means the state can’t imprison suspected terrorists for too long without giving them their day in court, reducing the chances of suspects getting charged with little evidence. \nWhat do the critics say? Sir Keir Starmer \nHuman Rights group Liberty believes Mrs May’s plan could harm democracy. \nMartha Spurrier, Liberty’s director, said: “Our human rights laws are the legacy of World War Two, the brainchild of a Conservative Prime Minister and drafted by British lawyers. They’re a beacon of hope for those still fighting for basic rights elsewhere. And, most importantly, they continue to help ordinary people all over this country - from trafficking victims to the Hillsborough families. \n“If Theresa May does what she threatens, she will go down in history as the Prime Minister who handed terrorists their greatest victory. For cheap political points and headlines, she is willing to undermine our democracy, our freedom and our rights – the very things these violent murderers seek to attack. \n“All this and we’ll be no safer – our security services and police already have vast powers to tackle terror and hate speech and monitor those they suspect of doing us harm.” \nSir Keir Starmer, the former director of public prosecutions and shadow Brexit secretary, said there was “nothing in the Human Rights Act that gets in the way of effectively tackling terrorism”. \n11 Prime Ministers in the North East - from Churchill to Wilson, Thatcher, Blair and more \nHe said in his former role he “worked very closely with the security and intelligence services and we prosecuted very, very serious criminals and the Human Rights Act did not get in the way of what we were doing”. \nInstead, Sir Keir said the “problem is people just coming onto the radar, then the question of how they are risk-assessed and what resource we’re putting in to deal with them”. \n“The Prime Minister, because she was facing searing questions about that yesterday, about resources, she’s now brought up the Human Rights Act as if that stands in the way of the current problem.” \nSir Keir said: “The questions we need to ask ourselves are has the withdrawal of many thousands of police officers had an impact on the amount of intelligence that’s coming on the radar?” \nHe added that there was “no incompatibility between protecting human rights and taking effective action against terrorists”. Read More ", "external_links": [], "published": "2017-06-07T22:45:00.000+03:00", "crawled": "2017-06-07T18:34:04.000+03:00", "highlightTitle": ""}