{"organizations": [], "uuid": "b0b9cb967565a086867ef66499d680b2d00c0b20", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30405334/16055846.jpg", "site_section": "", "section_title": "", "url": "http://www.devonlive.com/exeter-uni-boss-and-brexit-negotiator-says-talks-look-tough/story-30405334-detail/story.html", "country": "GB", "title": "Exeter uni boss and Brexit leader says negotiators 'can't see way forward' one year on from vote | Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "", "spam_score": 0.006, "site_type": "news", "published": "2017-06-23T23:23:00.000+03:00", "replies_count": 0, "uuid": "b0b9cb967565a086867ef66499d680b2d00c0b20"}, "author": "", "url": "http://www.devonlive.com/exeter-uni-boss-and-brexit-negotiator-says-talks-look-tough/story-30405334-detail/story.html", "ord_in_thread": 0, "title": "Exeter uni boss and Brexit leader says negotiators 'can't see way forward' one year on from vote | Devon Live", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "none"}, {"name": "steve", "sentiment": "none"}, {"name": "devon live", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "steve smith", "sentiment": "none"}, {"name": "marie sklodowska-curie", "sentiment": "none"}, {"name": "dame julia goodfellow", "sentiment": "none"}], "locations": [{"name": "devon live exeter", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "eu countries", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "university of kent", "sentiment": "none"}, {"name": "exeter university", "sentiment": "none"}, {"name": "universities uk", "sentiment": "none"}, {"name": "framework programme", "sentiment": "none"}, {"name": "russel group university", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Exeter uni boss and Brexit leader says negotiators 'can't see way forward' one year on from vote By WMN_PGoodwin | Posted: June 23, 2017 1 COMMENTS SHARES Comments (1) \nSir Steve Smith, Vice-Chancellor at Exeter University and a leading player in the Brexit talks says negotiators 'cannot see a way forward'. \nSir Steve is chairman of the Universities UK policy group, which is negotiating the shape of relationships with European academics after Britain leaves the EU. \nHe is worried about the status of EU nationals working in Higher Education, including 579 in Exeter - 201 of which have applied for citizenship. \nConcern comes as numbers of EU students at the Russel Group university dropped 10 per cent this year to 3,000. \nSir Steve, an expert in international relations who predicted Brexit would be a \"disaster\" for UK universities, says £1billion in EU research is also at stake as talks begin in Brussels. \nAnd worryingly, academics are struggling to find common ground which will keep lines of communication open and protect staff. \n\"The negotiations are tough - we cannot see the way forward,\" he told Devon Live. \n\"We are trying to find a way that works for us and EU universities but at the moment, to be honest, we cannot see the clear picture of what's going to emerge afterwards.\" \n\nRead more: Call for Exeter's Naked Bike Ride to be called off after children exposed to nudity \n\nCurrently, 17 per cent (33,735) of academic staff at UK universities are from other EU countries and there are more than 125,000 EU students studying at UK universities. \nIn terms of research collaboration, the UK is one of the main players in the EU's research and innovation programme Horizon 2020. \nLast week, ahead of the formal start of Brexit talks this Monday, university leaders said that the UK's world-leading university sector should help shape the negotiations. \nA senior voice said Theresa May's failure to win a mandate for a so-called hard Brexit left cause for optimism among academics. \nDame Julia Goodfellow, President of Universities UK and Vice-Chancellor of the University of Kent, said it was \"important that the voice of universities is heard clearly in the negotiations\". \n\"The election result showed the need for an optimistic approach to Brexit that is outward-looking and internationally-minded. \n\"The UK has one of the strongest university sectors in the world. Our universities' international links are central to our impact and success. A thriving university sector, that drives local economic growth and builds global connections, will be key to the UK making a long-term success of Brexit. British universities are the antidote to the UK's Brexit challenges \nUniversities UK has published a set of five priorities for exit negotiations: Agree the residency and work rights for EU nationals currently working in the university sector, and their dependents, including full access to public services; Secure continued UK participation in the EU's research and innovation programme Horizon 2020 until the end of the programme; Negotiate UK access to, and influence over, the Framework Programme 9 – the next research and innovation programme – ensuring it maintains a focus on excellence; Secure continued access to Erasmus+ and the Marie Sklodowska-Curie Actions mobility programmes; Preserve and build on regulatory and standards equivalence with other EU Countries, including continued recognition of professional qualifications between the UK and EU member states. ", "external_links": [], "published": "2017-06-23T23:23:00.000+03:00", "crawled": "2017-06-23T23:03:02.002+03:00", "highlightTitle": ""}