{"organizations": [], "uuid": "7307c6332c24a04a4b6d8e31208e5a269f071391", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13148093.ece/ALTERNATES/s1200/IBP_NEC_060617formica_05JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/formica-opens-new-north-shields-13146936", "country": "GB", "domain_rank": 21960, "title": "Formica opens new North Shields offices as £40m investment plan is revealed", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-07T04:01:00.000+03:00", "replies_count": 0, "uuid": "7307c6332c24a04a4b6d8e31208e5a269f071391"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/formica-opens-new-north-shields-13146936", "ord_in_thread": 0, "title": "Formica opens new North Shields offices as £40m investment plan is revealed", "locations": [], "entities": {"persons": [{"name": "formica", "sentiment": "negative"}, {"name": "alan campbell", "sentiment": "none"}, {"name": "tynemouth", "sentiment": "none"}, {"name": "formica europe", "sentiment": "none"}, {"name": "liz mayes", "sentiment": "none"}, {"name": "peter rush", "sentiment": "none"}, {"name": "rush", "sentiment": "none"}], "locations": [{"name": "new zealand", "sentiment": "none"}, {"name": "newton aycliffe", "sentiment": "none"}, {"name": "formica", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}, {"name": "coast road", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "north shields", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "north tyneside", "sentiment": "none"}], "organizations": [{"name": "business formica", "sentiment": "negative"}, {"name": "eef", "sentiment": "none"}, {"name": "european hq", "sentiment": "none"}, {"name": "fletcher building", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "newcastle journal", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "formica group europe", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Formica opens new North Shields offices as £40m investment plan is revealed European directors say the Coast Road base will evolve and change significantly over the next three years, and jobs will be created Share Peter Rush, President and CEO of Formica, at its headquarters in North Tyneside (Photo: Newcastle Journal) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nBusiness leaders have heralded a new era at North Shields manufacturer Formica, where directors have unveiled a £40m investment plan to drive forward future growth. \nFormica has been a major employer in the North East’s manufacturing sector for more than 70 years, making laminate products for the residential and commercial sectors at its sites in North Shields and Newton Aycliffe, County Durham. \nNow, the New Zealand owners of the business, Fletcher Building, has pledged to plough £40m into the base over the next three years, radically transforming and upgrading its production facilities and offices in a move to drive up its UK market share. Peter Rush, President and CEO of Formica, at its headquarters in North Tyneside (Photo: Newcastle Journal) \nPeter Rush, president of Formica Group Europe, revealed full details of the investment plans for the first time at a special open day at the Coast Road site, bringing together industry leaders, politicians and directors as the firm cemented its commitment to the North East. \nThe investment is being made in three phases, the first of which has seen the relocation of around 100 office staff from Cobalt to the Coast Road base, which will now serve as the European headquarters – a decision backed by the New Zealand parent company after the Brexit vote last June. \nMr Rush outlined other significant spending plans which will bring new machinery and upgrades for existing machinery, which could potentially create new jobs. Peter Rush, President and CEO of Formica, at its headquarters in North Tyneside (Photo: Newcastle Journal) \nThere are plans to centralise manufacturing activities under one roof in the west factory, located behind the east building, and new products are also being introduced in a bid to grab a greater market share. \nMr Rush said: “In 2015 Formica took a big deep breath and said: ‘What are we going to do with Formica Europe?’. \n“If you look back at its performance over the previous five years, it was one of those moments when you either invest and get behind the business, or you might need to find another option. Peter Rush, President and CEO of Formica, at its headquarters in North Tyneside (Photo: Newcastle Journal) \n“They took the view that we’ll get behind the business, put a new leadership business in place, get behind the business and come up with a strategic plan and based on that plan give this a real good go, which is exactly where we are today. \n“Flectcher Building has been a fantastic parent company. They are thousands of miles away and they are allowing us to spend £40m over the next three years, and that’s a huge amount. Read More \n“This site will evolve and change over the next three years quite significantly.” Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nAs well as the new offices, a new 8,000-tonne press, costing around £1m, has been brought in, and a continuous laminate press costing between £8m and £9m is also being purchased, together with new treater machinery. \n“It’s great having these factories, we can be as good anyone in the world. But you have got to be able to sell the products. \n“We have lost market share – it’s at around 20% and it should be 40% to 50% in the UK, so we are fighting hard to get that share back. \n“We have more than doubled the sales team from around eight to 20 members of staff. Some people would say that’s very speculative but you have to speculate to accumulate. And the one thing that we have that our rivals don’t is the brand. Formica is synonymous with laminate, so we are really driving hard with that brand. Liz Mayes, new boss of the EEF \n“Going forward, the key thing for me is being customer focused and we are going to take this business to being a ‘customer first’ business.” \nPlans are also under way to create apprenticeships within engineering and customer service departments for the first time in many years, a move which was welcomed by Liz Mayes, regional director of manufacturers’ organisation EEF. \nShe said: “I think it’s fantastic to see such a huge investment in uK manufacturing, and to see such a modern environment being created to ensure that the next generation of engineers is inspired and make them see that we really are very good at manufacturing.” \nAlan Campbell, Labour parliamentary candidate for Tynemouth, added: “Formica has been a major local employer for many years but this is a major boost for us and to have a European HQ in this part of world is a big boost.” Like us on Facebook", "external_links": [], "published": "2017-06-07T04:01:00.000+03:00", "crawled": "2017-06-06T23:18:31.004+03:00", "highlightTitle": ""}