{"organizations": [], "uuid": "c34d8bcf4b0155c3fb252f4228ac35a7b0670f76", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article9794868.ece/ALTERNATES/s1200/JS57711317.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/farming/farmers-confidence-hits-three-year-13145773", "country": "GB", "domain_rank": 21960, "title": "Farmers' confidence hits three-year low as Brexit fears bite", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-06T22:05:00.000+03:00", "replies_count": 0, "uuid": "c34d8bcf4b0155c3fb252f4228ac35a7b0670f76"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/farming/farmers-confidence-hits-three-year-13145773", "ord_in_thread": 0, "title": "Farmers' confidence hits three-year low as Brexit fears bite", "locations": [], "entities": {"persons": [{"name": "joe giddens/pa wire", "sentiment": "negative"}, {"name": "meurig raymond", "sentiment": "negative"}, {"name": "raymond", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "defra", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "nfu", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Meurig Raymond (Photo: Joe Giddens/PA Wire) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nPressure is growing on the next Government to prioritise a Brexit deal that supports the agricultural sector after a survey showed farmers’ confidence hitting a three-year low. \nThe survey by the NFU shows an 18-point drop in farmers’ mid-term confidence over last two years, with the organisation saying that political environment since the UK voted to leave the EU is a key driver for the fall. \nFarmers were split in the Brexit vote, with many saying the loss of subsidies, potential levies on European trade and a lack of migrant labour could come together to present a major challenge to the agricultural industry. \nBut others backed the vote to leave the EU , saying that a break with European regulations provided the UK with a chance to formulate farming policy better suited to those working in the industry. \nNFU President Meurig Raymond has described the drop in mid-term confidence - farmers’ outlook for the next three years - as ‘unnerving’. \nThe fall in confidence has been echoed by a reduction in investment by farmers as they fear commiting outlay at a time of uncertainty. \nMr Raymond said: “Farmer confidence is absolutely critical to the future of a profitable and productive food and farming sector. In such a period of uncertainty politically, we need politicians to fully understand the impact this lack of clarity is having economically. \n“The outlook from farmers is positive for the next 12 months due to the weak sterling, but we all know farming businesses are long-term and cannot rely on currency fluctuations. \n“The Government elected later this week will need to take firm action to maximize on the future potential of British food and farming. We need a competent and reliable workforce, a fit for purpose domestic agricultural policy and the right trade deals. Read More Dairy farmers hit by cut in milk prices from some of UK's largest purchasers \n“And to address this debilitating uncertainty, they need to give the industry as many assurances as possible.” \nThe NFU survey showed that investment intentions - which are seen as a good indicator of future profitability – were falling, with farmers nearly twice as likely to be decreasing investment (20.1%) as a result of the EU referendum than increasing investment (10.7%) in the next 12 months. \nMr Raymond added: “Investment in farming businesses is integral to our ability to produce food efficiently and sustainably, ensuring food security and farming’s huge contribution to the health and wealth of the nation. \n“With just 10% willing to increase investment in their business, it does not paint a pretty picture for the progressive industry that we are striving to be. But this is exactly why we’ll be working closely with the newly elected team at Defra, to ensure that investment is a key part of a new domestic agricultural policy.” \nMeanwhile, a YouGov survey commissioned by the NFU has shown that 81% of UK adults think that online food retailers should provide the same amount of information about the product’s country of origin as there is on the food packaging in store, while 64% would find it helpful to have the option to view British produce only when shopping online. Like us on Facebook", "external_links": [], "published": "2017-06-06T22:05:00.000+03:00", "crawled": "2017-06-06T17:22:15.000+03:00", "highlightTitle": ""}