{"organizations": [], "uuid": "47adec86e89432bfba7e165b3db8e2291a1ead8a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30380663/16036873.jpg", "site_section": "http://www.westernmorningnews.co.uk/all-content.rss", "section_title": "Devon Live All Content Feed", "url": "http://www.devonlive.com/devon-s-new-labour-mp-who-is-luke-pollard/story-30380663-detail/story.html", "country": "GB", "title": "Neil_Shaw published Devon's new Labour MP: Who is Luke Pollard?", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-09T12:29:00.000+03:00", "replies_count": 0, "uuid": "47adec86e89432bfba7e165b3db8e2291a1ead8a"}, "author": "Neil_Shaw", "url": "http://www.devonlive.com/devon-s-new-labour-mp-who-is-luke-pollard/story-30380663-detail/story.html", "ord_in_thread": 0, "title": "Neil_Shaw published Devon's new Labour MP: Who is Luke Pollard?", "locations": [], "entities": {"persons": [{"name": "devon", "sentiment": "none"}, {"name": "luke pollard", "sentiment": "none"}, {"name": "sam blackledge", "sentiment": "none"}, {"name": "johnny mercer", "sentiment": "none"}, {"name": "ben bradshaw", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "yvette cooper", "sentiment": "none"}, {"name": "oliver colvile", "sentiment": "none"}, {"name": "gary streeter", "sentiment": "none"}, {"name": "jeremy", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "tim farron", "sentiment": "none"}, {"name": "pollard", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}], "locations": [{"name": "devon", "sentiment": "none"}, {"name": "devonport", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "colvile", "sentiment": "none"}, {"name": "millbay", "sentiment": "none"}], "organizations": [{"name": "gayle mcdonald comments", "sentiment": "none"}, {"name": "plymouth sound", "sentiment": "none"}, {"name": "royal marines", "sentiment": "none"}, {"name": "tory", "sentiment": "none"}, {"name": "herald", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "plymouth sutton", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "royal navy", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Devon's new Labour MP: Who is Luke Pollard? By Neil_Shaw | Posted: June 09, 2017 By Gayle McDonald Comments (0) \nDevon has a second Labour MP in the shape of Luke Pollard, who joins his Exeter colleague Ben Bradshaw as a beacon of red in a sea of blue across the county. \nLuke Pollard has been elected as MP for Plymouth Sutton and Devonport - taking the seat from the Conservative's Oliver Colvile. \nPlymouth-born Pollard, who almost claimed election victory in 2015, falling just 523 votes short of Colvile, has vowed to put his city first throughout his campaign. \nHe's clearly not a member of the Corbyn fan club - and he says he's prepared to stand up to his party's leader to ensure Plymouth gets the best deal. \nAfter being elected MP for Plymouth Sutton and Devonport - with a majority of 6,000 votes - Labour's Luke Pollard outlined his priorities for the city. \nIn his impassioned victory speech, he promised to fight for better schools, a better NHS, the expansion of the M5 and better rail links to the city. \nAnd in a stern warning to his Conservative counterparts, he warned he would be there to \"expose\" them if they voted against \"Plymouth's best interests\". \nHe said: \"Plymouth has its voice back in Parliament. I am proud of Plymouth. I am proud to have been born here, I'm proud to live here and now I'm very proud to be a member of parliament here.\" \nHe thanked those who had voted for Labour, particularly younger voters and people who voted for the first time, adding: \"We have seen so many young people in particular put their trust in politics casting their ballot for a better city and I want to say thank you to them.\" \nHe also thanked his predecessor Oliver Colvile for his service to the city and said he was looking to working with him on the effective handover of casework \"to make sure that everyone that has got in touch with a member of parliament gets the care and attention that they need\". \nLooking ahead to the future, Mr Pollard vowed to fight for Plymouth to receives its \"fair share\". He said: \"The campaign for better schools and a better NHS in Plymouth begins now. \n\"My campaign - our campaign – to extend the M5 from Exeter to Plymouth begins now. Our campaign to re-open Plymouth airport begins now. \n\"Our campaign for a cruise terminal at Millbay begins now. Our campaign for proper costed investment in our railway begins now. \n\"And so does the campaign to make that Plymouth Sound is designated as the UK's first national marine park.\" \nAnd in a warning to Plymouth's re-elected Conservative MP's Johnny Mercer and Gary Streeter, he added: \"But there's something else. I want to give notice to Plymouth's Tory MP's. \n\"Each time you vote against Plymouth's best interests, I will be there to expose you. I will be there to fight for Plymouth. \n\"Plymouth deserves a better deal. We deserve our fair share and the fight to have our fair share begins today.\" \nDuring his campaign, he told voters he intends to make it clear where the Royal Marines will be based in Plymouth, adding that he would strive to protect them as much as he could. \nHe also pledged to start a campaign to extend the M5 down to Plymouth, and said he would hold a 'Brexit summit' in Plymouth within the first 100 days of being elected. \nAnd He promised that if his party won power, it would spend £2.5bn to fix Plymouth's train line , and that he would strive to ensure his party invests more money into mental health provisions and the NHS. Pollard's pledges \nHere are the four pledges Luke Pollard based his campaign on. \n1. A good Brexit deal for Plymouth \nI will fight for a deal to secure our jobs and rights and to protect our environment, fishermen and exporters. \n2. Stand up for our armed forces \nI will always support our Royal Navy and Royal Marines, back Trident, fight defence cuts and support our veterans. \n3. Oppose Tory school cuts \nI will call for properly funded schools. I want teachers to have the resources to help Plymouth's children succeed. \n4. Protect our hospitals and the NHS \nI will oppose Tory cuts and NHS privatisation. We need to invest in our NHS and train more doctors and nurses. \n5. Always put Plymouth first \nI will put Plymouth before party each and every time. It is time we had an MP who always puts Plymouth first. \nMr Pollard is not a member of the Corbyn fan club. \nHe voted for Yvette Cooper in the first leadership election, and has at times struggled to contain his frustration at the party's plunging poll ratings. \nIn the run-up to polling day, he had a clear strategy – distance himself from the national picture and ask people to vote not for the Prime Minister, but for their local MP. \nPrior to the election, he told the Herald's political reporter, Sam Blackledge, said that he would put Plymouth first. \nReflecting on his 2015 defeat, he said he could have campaigned differently: \"In the last election I think I could have been more vocal. \n\"This election is being run purely and squarely on putting Plymouth first. I think that is exactly the right thing, at a time when people's trust in politics is so low. \n\"Rightly so, because politicians have really screwed up.\" \n\"They should be seeking to represent their constituency first, rather than their party.\" \nHe had some praise for Corbyn but made it clear that he did not follow all of his party leader's views - especially on defence and Trident. \n\"Jeremy has done some good things as leader,\" he said. \n\"He has inspired thousands of young people to get involved in politics. There's quite a lot I disagree with him about though. \n\"Trident is the most obvious one. My dad was a submariner, he worked for the dockyard, I've grown up knowing how important defence is to the country. \n\"Actually, our defence policies in the manifesto are pretty good. I would just like Jeremy to go along with them a bit more.\" \nAnd he pledged that if elected he wouldn't be a 'yes man' for Labour. \nHe said: \"I don't have a problem with standing up to Jeremy Corbyn, or Tim Farron, or Theresa May, or anyone else. \n\"If it's not right for Plymouth, I'm going to make my voice heard.\"", "external_links": [], "published": "2017-06-09T12:29:00.000+03:00", "crawled": "2017-06-09T08:11:38.000+03:00", "highlightTitle": ""}