{"organizations": [], "uuid": "7292018e05c6f733e376f163637e9dc3c88cc428", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13116007.ece/ALTERNATES/s1200/Pokemon-Go-Launches-In-The-UK.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/mobile-data-terrorist-funding-cricket-13115673", "country": "GB", "domain_rank": 21960, "title": "Mobile data, terrorist funding and cricket - the new laws coming into force in the next few months", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-01T12:00:00.000+03:00", "replies_count": 0, "uuid": "7292018e05c6f733e376f163637e9dc3c88cc428"}, "author": "Ian Robson", "url": "http://www.chroniclelive.co.uk/news/north-east-news/mobile-data-terrorist-funding-cricket-13115673", "ord_in_thread": 0, "title": "Mobile data, terrorist funding and cricket - the new laws coming into force in the next few months", "locations": [], "entities": {"persons": [{"name": "ben stokes", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "mark boucher", "sentiment": "none"}, {"name": "bond dickinson", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "south africa", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "time", "sentiment": "none"}, {"name": "mcc", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nA batch of new laws is coming into force affecting mobile phones, terrorist funding ... and cricket. \nRoaming charges from mobile operators will be abolished in June, while legislation making companies more responsible for monitoring financial rules will make it harder to fund terrorism. \nAnd, looking ahead, there are changes in cricket laws from October. \nBut how will these new laws affect you as you go about your everyday life? \nHere’s all you need to know about what is changing Data roaming Pokemenon Go game on a mobile phone (Photo: Getty Images Europe) \nMost will welcome changes in the way mobile operators charge for using phones overseas. \nFrom June 15 2017, roaming charges will be abolished within the EU . \nThe price comparison site uSwitch says: “This means you can use your regular allowance of calls, texts and data for no extra cost from anywhere in the European Union. \n“So, if you want to check your work emails or give all your followers holiday envy by posting sunny selfies on Facebook, you won’t have to pay any more than you would at home. \n“You’ll also be able to call or text anyone in the EU from anywhere else in the EU at your normal UK rate.” \nBut it’s not all good news - because Brexit could change everything. \nWhen the UK formally leaves the EU it’s possible that the existing caps on roaming charges will no longer apply. \nThe result is that Britons could be paying much more for roaming again. \nAnd there are still plans to add VAT to roaming charges outside the UK. \nMoneySavingExpert,com warns not to get too excited about the roaming ban on June 15. \nThey said: “It’s emerged in the small print that many who have unlimited or competitively priced data allowances CAN still be charged extra roaming fees above a certain level of usage. \n“And analysis by MoneySavingExpert.com shows it’s those on cheaper mobile deals who are most likely to be affected.” Money laundering \nThere are also changes to make money laundering harder. \nThe idea is to improve the current money laundering regulations which are 10 years old. \nCompanies will be expected to carry out extra due diligence on its financial systems to prevent terrorist funding including e-money and pre-paid cards. \nFor the first time all gambling providers, not just casinos, will be subject to the regulations. \nBut the new rules will not apply to people engaging in financial activity on a very occasional basis with a turnover of under £100,000. \n“Suddenly there is a sense of urgency around the UK’s implementation of the fourth Money Laundering Directive,” says the website for financial experts Bond Dickinson. Read More Drivers be warned: These new laws come into force on Wednesday, March 1 \n“Time is now running short, and the legislation must be in force by June 26. \n“All businesses covered by the regulations will need to make changes to their procedures, systems and controls to comply with the requirement.” The laws of cricket England's Ben Stokes in action (Photo: AP) \nThe first new Code of the Laws of Cricket since 2000 will take effect around the world from October 1. \nA major change is in the use of words with the 42 laws now written in non-gender phrases although the term “batsman” is still allowed. \nA new law will allow bails to be tethered to stumps in a bid to prevent injury. \nIn 2012, South Africa wicket-keeper Mark Boucher retired from international cricket after undergoing surgery on an eye injury caused by a bail. \nMeanwhile, limits will be placed on the thickness of the edges and overall depth of bats. Read More Are you ready for new laws in May on vaping, smoking, insurance and probate \nOther changes include a new law of the game addressing players’ conduct and giving an in-match consequence for poor on-field behaviour. \nThe MCC, which regulates the game, said the change was needed to counter bad behaviour on the field. \nIt said: “This is a new law that deals specifically with players’ misconduct and is introduced following widespread consultation, surveys with players and umpires and a series of trials of the different levels of sanctions. \n“It is widely accepted that there is a need both to provide the umpires with appropriate on-field sanctions to deal with deteriorating levels of behaviour, not just to report such matters, and that there should be different levels of sanction leading to sending off for acts of violence.” \nSanctions include the giving of extra points to opponents. Like us on Facebook", "external_links": [], "published": "2017-06-01T12:00:00.000+03:00", "crawled": "2017-06-01T08:23:43.000+03:00", "highlightTitle": ""}