{"organizations": [], "uuid": "03fa205b8376a935b388c5c1a0ccb62d99e1d4b4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30390869/16044905.jpg", "site_section": "http://www.middevongazette.co.uk/all-content.rss", "section_title": "Devon Live All Content Feed", "url": "http://www.devonlive.com/lib-dem-leader-tim-farron-quits-over-faith-row-reaction/story-30390869-detail/story.html", "country": "GB", "title": "WMN_PGoodwin published Lib Dem leader Tim Farron quits over faith row REACTION", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-15T01:52:00.000+03:00", "replies_count": 0, "uuid": "03fa205b8376a935b388c5c1a0ccb62d99e1d4b4"}, "author": "WMN_PGoodwin", "url": "http://www.devonlive.com/lib-dem-leader-tim-farron-quits-over-faith-row-reaction/story-30390869-detail/story.html", "ord_in_thread": 0, "title": "WMN_PGoodwin published Lib Dem leader Tim Farron quits over faith row REACTION", "locations": [], "entities": {"persons": [{"name": "tim farron", "sentiment": "none"}, {"name": "nick clegg", "sentiment": "none"}, {"name": "sarah olney", "sentiment": "none"}, {"name": "farron", "sentiment": "none"}, {"name": "vince cable", "sentiment": "none"}, {"name": "paddick", "sentiment": "none"}, {"name": "ed davey", "sentiment": "none"}, {"name": "isaac watts", "sentiment": "none"}, {"name": "jo swinson", "sentiment": "none"}, {"name": "connett", "sentiment": "none"}, {"name": "alan connett", "sentiment": "none"}, {"name": "tim", "sentiment": "none"}, {"name": "norman lamb", "sentiment": "none"}, {"name": "brian paddick", "sentiment": "none"}, {"name": "christ", "sentiment": "none"}], "locations": [{"name": "westminster", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "richmond park", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "east devon", "sentiment": "none"}], "organizations": [{"name": "opposition lib dems at devon county council", "sentiment": "none"}, {"name": "vince cable", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Lib Dem leader Tim Farron quits over faith row REACTION By WMN_PGoodwin | Posted: June 14, 2017 1 COMMENTS SHARES The Lib Dem has resigned Lib Dem leader Tim Farron quits over faith row REACTION X \nCopy link to paste in your message / \nTim Farron, the Liberal Democrat leader, has resigned. \nMr Farron quit the party, citing tension between his Liberal values and his Christian faith. \nThe resignation came after Lib Dem home affairs spokesman, Brian Paddick, left his post, citing concerns about the party leader's views. \nPaddick said he was concerned about the leader's views on various issues that were highlighted during the election. \nThroughout the campaign, Farron was dogged by questions over his attitude to homosexuality and abortion, though he has insisted he does not believe gay sex is a sin and has said he is pro-choice. \nMr Farron succeeded Nick Clegg in 2015 after the party's disastrous election result. \nAt the recent General Election the Liberal Democrats increased the number of MPs they have at Westminster from nine to 12, after making overturning Brexit the central thrust of their campaign. \nBut they also lost seats — including Richmond Park, which was won by Sarah Olney just months earlier. \nSome of the party's big beasts, including former ministers Vince Cable, Ed Davey, and Jo Swinson, have returned to Westminster and could be potential leadership contenders. \nIn his resignation statement, the MP said: \"The consequences of the focus on my faith is that I have found myself torn between living as a faithful Christian and serving as a political leader. A better, wiser person than me may have been able to deal with this more successfully, to have remained faithful to Christ while leading a political party in the current environment. \n\"To be a political leader - especially of a progressive, liberal party in 2017 - and to live as a committed Christian, to hold faithfully to the Bible's teaching, has felt impossible for me.At the last general election the Liberal Democrats increased the number of MPs they have at Westminster from nine to 12, after making overturning Brexit the central thrust of their campaign. But they also lost seats — including Richmond Park, which was won by Sarah Olney just months earlier. Some of the party's big beasts, including former ministers Vince Cable, Ed Davey, and Jo Swinson, have returned to Westminster and could be potential leadership contenders.\" \nAlan Connett, leader of the Opposition Lib Dems at Devon County Council said it was clear the leader was \"torn between his faith and leadership\" during the election. \n\"He is absolutely right to step down and bring this conflict to an end,\" Mr Connett added. \n\"Tim has done a fabulous job during the campaign leading us to win more seats and reassert Liberal Democrat values. \n\"I saw him deal with the issue on Question Time and I thought he did it very well and was satisfied but it is a matter for the individual and he's come to a view about it. \n\"The verdict of the election was on the mismanagement of the Tories on things like health and education more than anything else. \n\"I wish Tim well and am grateful for his leadership during a difficult period – now we can look forward to a leadership election. \n\"it is early days to talk about a successor but Vince Cable, Norman Lamb and Jo Swinson are three names who may feature on the list.\" \n\nRead more: Body found on East Devon beach was former Mormon bishop who was standing trial for sex offences \nHere is the statement in full: \"This last two years have seen the Liberal Democrats recover since the devastation of the 2015 election. \nThat recovery was never inevitable but we have seen the doubling of our party membership, growth in council elections, our first parliamentary by-election win for more than a decade, and most recently our growth at the 2017 general election. \nMost importantly the Liberal Democrats have established ourselves with a significant and distinctive role - passionate about Europe, free trade, strong well-funded public services underpinned by a growing market economy. \nNo one else occupies that space. Against all the odds, the Liberal Democrats matter again. \nWe can be proud of the progress we have made together, although there is much more we need to do. \nFrom the very first day of my leadership, I have faced questions about my Christian faith. I've tried to answer with grace and patience. Sometimes my answers could have been wiser. \nAt the start of this election, I found myself under scrutiny again - asked about matters to do with my faith. I felt guilty that this focus was distracting attention from our campaign, obscuring our message. \nJournalists have every right to ask what they see fit. The consequences of the focus on my faith is that I have found myself torn between living as a faithful Christian and serving as a political leader. \nA better, wiser person than me may have been able to deal with this more successfully, to have remained faithful to Christ while leading a political party in the current environment. \nTo be a political leader - especially of a progressive, liberal party in 2017 - and to live as a committed Christian, to hold faithfully to the Bible's teaching, has felt impossible for me. \nI'm a liberal to my finger tips, and that liberalism means that I am passionate about defending the rights and liberties of people who believe different things to me. \nThere are Christians in politics who take the view that they should impose the tenets of faith on society, but I have not taken that approach because I disagree with it - it's not liberal and it is counterproductive when it comes to advancing the gospel. \nEven so, I seem to be the subject of suspicion because of what I believe and who my faith is in. \nIn which case we are kidding ourselves if we think we yet live in a tolerant, liberal society. \nThat's why I have chosen to step down as leader of the Liberal Democrats. \nI intend to serve until the parliamentary recess begins next month, at which point there will be a leadership election according to the party's rules. \nThis is a historic time in British politics. What happens in the next months and years will shape our country for generations. \nMy successor will inherit a party that is needed now more than ever before. Our future as an open, tolerant and united country is at stake. \nThe cause of British liberalism has never been needed more. People who will fight for a Britain that is confident, generous and compassionate are needed more than ever before. \nThat is the challenge our party and my successor faces and the opportunity I am certain that they will rise to. \nI want to say one more thing: I joined our party when I was 16, it is in my blood, I love our history, our people, I thoroughly love my party. \nImagine how proud I am to lead this party. And then imagine what would lead me to voluntarily relinquish that honour. \nIn the words of Isaac Watts it would have to be something 'so amazing, so divine, (it) demands my heart, my life, my all.\" ", "external_links": [], "published": "2017-06-15T01:52:00.000+03:00", "crawled": "2017-06-14T21:56:04.004+03:00", "highlightTitle": ""}