{"organizations": [], "uuid": "0bfe77756ce770c171f8887977b34c2e3045c8ea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article13261620.ece/ALTERNATES/s1200/JS124213988.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/whats-on/comedy-news/full-hun-miss-rory-slays-13261667", "country": "GB", "domain_rank": 21960, "title": "Full of Hun! Miss Rory slays a sell out crowd at Newcastle's Tyne Theatre", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-30T12:36:00.000+03:00", "replies_count": 0, "uuid": "0bfe77756ce770c171f8887977b34c2e3045c8ea"}, "author": "Simon Duke", "url": "http://www.chroniclelive.co.uk/whats-on/comedy-news/full-hun-miss-rory-slays-13261667", "ord_in_thread": 0, "title": "Full of Hun! Miss Rory slays a sell out crowd at Newcastle's Tyne Theatre", "locations": [], "entities": {"persons": [{"name": "rory", "sentiment": "neutral"}, {"name": "dan cunningham", "sentiment": "none"}, {"name": "dan", "sentiment": "none"}, {"name": "tyne theatre", "sentiment": "none"}, {"name": "alan shearer", "sentiment": "none"}, {"name": "kelly llorenna", "sentiment": "none"}, {"name": "cheryl", "sentiment": "none"}, {"name": "rory- yes boulevard", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "glenn close", "sentiment": "none"}, {"name": "livin", "sentiment": "none"}], "locations": [{"name": "turkey", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "sahara", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "neutral"}, {"name": "newcastle pride", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "boulevard", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "What's On Opinion Full of Hun! Miss Rory slays a sell out crowd at Newcastle's Tyne Theatre Selling out the Tyne Theatre for the second time in nine months, Boulevard's cutting compere Miss Rory delighted with What's Up Hun Share Get what's on   Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe Hoppings, Cheryl, Alan Shearer, a Greggs pasty, Miss Rory- yes Boulevard’s resident ice queen has quite simply become a Tyneside institution. \nAnd while we keep hearing that times are hard, plenty of people shelled out their hard earned on tickets for What’s Up Hun- the second of Rory’s sell out stand up shows. \nA packed Tyne Theatre greeted the statuesque siren of all things sarcasm as she strutted onto the stage for a near three hour set that went by all too quickly. \nWith wit quicker than Usain Bolt dying to break a world record, humour drier than the Sahara desert and a tongue as sharp as Glenn Close’s knife in Fatal Attraction, Miss Rory has the key ingredients of a highly successful stand up comic. \nMix them all together and you get a show that if it were a CD would be covered in ‘Parental Advisory’ stickers but is all the better for it. \nYes the easily offended would have been ready to write a letter to Points of View (that’s still a thing right?) but those who snapped up their tickets knew exactly what they were in for and lapped up every cutting critique and non PC gag. \nMiss Rory has a real talent for making you chuckle at things you probably shouldn't. \nFrom Brexit to Theresa May’s wheat field dancing tendencies, What’s Up Hun stamped on popular culture like an over excited and E number filled child determine to pop a balloon - all with added vitriol of course. Read More Newcastle Pride lineup: Stooshe, Livin' Joy and Kelly Llorenna added to bill for annual celebration \nFull of vigour and genuine enthusiasm for both her craft and her city, Miss Rory was well at home on one of Newcastle’s most famous stages. \nAnd knowing her audience like the back of her bejewelled hand, there were of course plenty of local references to send the punters into applause and nervous sweats in equal measure. \nWell oiled patrons who dared to share a bit too much of their personal lives soon regretted it while there were a few shoulders hunched (mine included!) as Rory got up close and personal with her growing number of followers. \nThe inspiration for What’s Up Hun was people’s social media habits and armed with a huge smart phone backdrop and even its own Snapchat filter it was a stand up show for the ‘can’t be seen without a filter’ generation while still having plenty of humour that could resonate with those who don’t know their Twitter from their Tinder. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nOne minute it felt like you were in the salon chair as Miss Rory waxed lyrical about a recent trip to Turkey and the next you were left feeling anything but proud of your home furnishings as the Newcastle Pride host poured scorn on all things canvases, corduroy couches and twigs with lights on. A lesson in feng shui with no punches pulled! \nOf course behind every woman is a strong man, or is that the other way round? A standing ovation for Miss Rory at the Tyne Theatre \nAnd while his alter ego maintained she was just there for the money you could see just how much selling out one of the most iconic venues on home turf meant to Dan Cunningham. \nWhile its Miss Rory who delivers the venom laced punch lines, it’s Dan who comes up with them and with impeccable comic timing, a stage presence that both tickles the funny bone and terrifies and razor sharp whit, he should and probably will have a bright future ahead of him in the realms of stand up comedy. \nWhat’s Up Hun? For Dan it’s the pressure of coming up with the script for a third sell out show. No biggy! Like us on Facebook", "external_links": [], "published": "2017-06-30T12:36:00.000+03:00", "crawled": "2017-06-30T14:47:48.015+03:00", "highlightTitle": ""}