{"organizations": [], "uuid": "0acd04b71ae6a9797002b785a102c2fe892fd430", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article13214844.ece/ALTERNATES/s1200/JS123207894.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13212863", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Uber chief executive Travis Kalanick resigns under pressure from investors", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-21T15:00:00.000+03:00", "replies_count": 0, "uuid": "0acd04b71ae6a9797002b785a102c2fe892fd430"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13212863", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Uber chief executive Travis Kalanick resigns under pressure from investors", "locations": [], "entities": {"persons": [{"name": "travis kalanick", "sentiment": "negative"}, {"name": "kalanick", "sentiment": "none"}, {"name": "pidgley", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "tony pidgley", "sentiment": "none"}], "locations": [{"name": "south east", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "berkeley", "sentiment": "none"}, {"name": "silicon valley", "sentiment": "none"}], "organizations": [{"name": "berkeley gr", "sentiment": "negative"}, {"name": "coreena ford housebuilder berkeley", "sentiment": "negative"}, {"name": "menlo ventures", "sentiment": "none"}, {"name": "fidelity investments", "sentiment": "none"}, {"name": "new york times", "sentiment": "none"}, {"name": "berkeley group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford Nissan and other car makers face 'cliff edge' on Brexit, industry warns \nCar manufacturers like Nissan need the Government to guarantee access to European markets if they are to avoid a “cliff edge” that will hit jobs in the UK, an industry body has said . \nThe Society of Motor Manufacturers and Traders (SMMT) said it does not believe the Government can reach a full trade arrangement with the EU before the Article 50 negotiations are scheduled to end in March 2019. \nWithout interim arrangements offering full access to the European market, SMMT said, the automotive industry would be left to trade under World Trade Organisation rules –“the worst foreseeable outcome for the sector, its employees and the British economy”. \nNissan, which employs 7,000 people at Sunderland and supports thousands more jobs in the region through its supply chain, has said on a number of occasions in the last year that it will review the Wearside plant’s competitiveness once the UK’s relationship with the EU is settled. \nThe future of the company has taken on added significance in recent years with the development of a massive automotive park next to its factory which is hoped will create 5,000 jobs. \nThe International Advanced Manufacturing Park, on the border between Sunderland and South Tyneside, has taken a huge share of the public funding going to job creation in the North East. \nNegotiations between the UK and the EU formally began yesterday but trade talks will not begin until October at the earliest after the EU set the timetable and said citizens’ rights, the UK’s financial settlement – the so-called divorce bill – and other issues to do with separation had to be sorted first. \nSMMT chief executive Mike Hawes said: “We accept that we are leaving the European Union and we share the desire for that departure to be a success. \n“But our biggest fear is that, in two years’ time, we fall off a cliff edge – no deal, outside the single market and customs union and trading on inferior WTO terms. This would undermine our competitiveness and our ability to attract the investment that is critical to future growth. Workers at Nissan (Photo: Owen Humphreys/PA Wire) 9.05 Coreena Ford Port of Tyne sees turnover fall 22% as it seeks new sources of revenue \nThe Port of Tyne saw turnover slump in 2016 as massive falls in its traditional cargo business sparked investment in new ways of attracting revenue. \nThe Port saw conventional and bulk cargo halve in 2016, leading to a 22% drop in turnover from £58.8m to £45.9m. \nA number of global factors - particularly the shift away from coal-fire power stations, which meant no coal was imported to the Port in 2016 - affected the Port’s financial results. \nThe Port’s reaction to those factors has seen it invest £14.6m to develop its infrastructure, with the bulk of that - £8.8m - being spent on facilities to handle wood pellets that will be imported for use on the Lynemouth Power Station in Northumberland after its re-fit to renewable energy production. \nThe drop in business at the port led to a corresponding decrease in employment, with 437 members of staff at the end of the year, down by 46 on the same stage in 2015. Port of Tyne from the air (Photo: handout from Rebecca Taylor PR 07830 159 996) 9.00 Coreena Ford Oil and gas industry expects renewed growth \nThe UK’s oil and gas industry is eyeing a growth rebound despite concerns over rising costs and the impact of Brexit uncertainty, new research has found. Nearly 60% of businesses expect to expand this year, while optimism has surged to 39% from 2% in 2016, according to the Bank of Scotland Oil & Gas Report. Companies in the energy sector have seen their financial performance suffer and have been forced to slash their work forces after the oil price failed to recover from a collapse three years ago. \nHowever, the report said the rate of job losses was starting to ease, with the number of companies looking to trim staff over the next 12 months dropping to a fifth from a third in 2016. \nMore than half of companies are also looking to create more jobs in the year ahead, it added. \nStuart White, Bank of Scotland regional director for mid markets North of Scotland, said the jump in optimism proved the industry was one of the most resilient in the UK. \nHe said: “The expression of confidence in this year’s survey reflects an industry that appears to be turning a corner, with conditions for growth more favourable than they have been in recent times.” The oil and gas industry expects to see renewed growth despite Brexit uncertainty (Photo: Danny Lawson/PA Wire) 8.55 Coreena Ford Costa Coffee sales growth slows \nCosta Coffee owner Whitbread said it had rolled out its new “cold brew” and cooler drinks in time for this month’s heatwave, but revealed a further slowdown in sales growth at its coffee shops. \nThe group said like-for-like Costa sales grew by 1.1% in the first quarter to June 1, down from 2% growth in the previous year. \nWhitbread saw a stronger performance in its Premier Inn hotel chain, where comparable sales rose 4.7%, which helped overall group sales lift by 2.9% in the quarter. \nAlison Brittain, chief executive of Whitbread, said the group had seen a “good start to the year”. She said the firm was “focused” on its plans at Costa, rolling out the “cold brew” in more than 200 stores, while its latest summer Frostino and cooler drinks went on sale this month just as temperatures have soared. \nWhitbread warned in April over tougher consumer conditions for its new financial year, while its Costa chain is fighting back against competition from artisan cafes. \nCosta launched its new breakfast range towards the end of its first quarter and more food ranges are planned over the coming months. \nThe group is looking to overcome tougher trading with more expensive finer coffee concepts, while also expanding rapidly overseas and installing more Costa Express machines, with a net 300 opened during its first quarter alone. \nWhitbread also continued adding a raft of Premier Inn rooms, with more than another 1,000 rooms since March in the UK. It plans to open around 4,200 hotel rooms, 230-250 Costa coffee shops and install around 1,250 Costa Express machines this financial year. \nShares in Whitbread rose 5% after the update as Ms Brittain said she has “confidence that we will make further good progress this year”. \nBut Neil Wilson, at ETX Capital, said: “In a heatwave a hot coffee doesn’t quite hit the spot, so Costa-owner Whitbread will be hoping its Cold Brew and Frostino products will catch on. “They will need to - like-for-like sales growth at Costa continued their slow decline as the nation switches to a wider array of pricier artisan coffees.” (Photo: PA) Coreena Ford Start-ups offered space to work in Newcastle's coolest offices \nFledgling firms have the chance to work in one of the North’s coolest offices , based in Newcastle, following its £5.8m redevelopment. \nThe interior of the Old Post Office on St Nicholas Street now looks very different to when it first served customers in the 19th century following a complete transformation, spearheaded by NBS, which is now based inside the Grade II-listed building. \nThe makeover resulted in the building being recognised as one of the best workplaces in the North at the annual British Council for Offices (BCO), triumphing as winner of the Best Refurbished and Recycled Workplace. \nNow NBS is hoping to attract digital and technology start-ups to its state-of-the-art incubator space, created as part of the multimillion-pound redevelopment. \nThe units have a range of unique features, such as suspended ceilings, high-quality office furniture, a separate meeting room and a manned reception, and NBS hopes to draw in local digital and tech start-ups with clients in the built environment sector. The Old Post Office in Newcastle (Photo: (C)The Bigger Picture Agency Ltd) 8.45 Coreena Ford New look for Jesmond's Spy Bar following £400,000 investment by owners Cairn Group \nHospitality company Cairn Group is investing £400,000 into a transformation of Spy Bar in Jesmond , Newcastle to create extra space and a new look. \nThe North East firm’s refurbishment of the Osborne Road bar and eatery is extending space in the lounge area for customers and refreshing its decor, which now has bare brick walls, dark wood tables with metal chairs, burnt orange leather booth seating and exaggerated light fittings. \nA favourite with students and football fans, the bar’s TV screens have been replaced by a collection of 60in plasma screens. \nMeanwhile, the outdoor drinking and dining terrace has also benefitted from the works, with new furniture costing almost £6,000 to replace the weathered pub-style tables. \nNew cushioned sofas and seats, set under parasols with heat lamps, and gold and black metallic chairs and tables are now arriving to increase seating capacity. \nA new food menu featuring a mix of burgers, pizzas is also being introduced, alongside a new cocktail collection. \nThe bar’s makeover is set to be officially launched on July 6. Spy Bar in Jesmond has benefitted from a £400,000 makeover (Photo: Cairn Group) 8.40 KEY EVENT Revenues rise after 'year of stabilisation' at pharma firm Immunodiagnostics Systems \nA year of stabilisation at South Tyneside pharmaceutical firm Immunodiagnostic Systems Holdings has led to a 4% a rise in revenues, reversing two years of decline. The Boldon-based business, which develops medical testing kits for clinical and research laboratories, reported group revenue of £40.0m for the year ended March 31 2017, up from £38.3m), following a year of streamlining, cost management and changing the firm’s culture. During the year IDS benefitted by around £4.7m as a result of the weaker pound - with 31% of group revenues denominated in US Dollars and 58% in Euros. However, conversely IDS also had a significant cost base denominated in Euros and US Dollars, so adjusted EBITDA improved by £1.4m overall through the currency exchange rates. While overall revenues rose, the firm said that on a like-for-like basis revenues declined following the loss of royalty income in the US, which declined by £2.4m. Management roles within its sales organisation were streamlined in the year, and the cost management initiative led to headcount dropping by 40, from 315 employees to 275. The Boldon firm also expects to see further cost savings this year. Regis Duval, CEO, said: “Group revenues increased 4% year on year, though like for like, they showed a decline of 8%. “A strong performance in our speciality automated business helped offset the expected declines in 25-OH Vitamin D and royalty income. “We will continue restructuring our business footprint during FY2018, and will invest further in our sales and assay development teams. “We have made good progress in stabilising the financial performance of the Group, and believe we are well positioned to return to growth in the medium term. During the next financial year we will be exposed to both declining 25-OH Vitamin D business and antibody royalty income, which will make exceeding the 2017 comparative revenue numbers challenging.” The Immunodiagnostic Systems Holdings base in Boldon, South Tyneside 8.27 Coreena Ford Newcastle's durhamlane gets £125,000 investment for spin-out company \nThe team behind a successful sales consultancy in the North East has received £125,000 investment to help it grow a spin-out company. \nThe funding for Richard Lane and Lee Durham, who run Newcastle firm durhamlane, has comes from the Finance for Business North East Proof of Concept Fund, managed by Northstar Ventures, to set up a software development company called Powerhouse Software. \nThe new firm has been established to develop products focussing on the accounting marketplace. Mr Lane and Mr Durham set up the company with accountant Will Tombs at the end of 2015 to capitalise on their knowledge and experience of the accountancy sector and of selling software products to it. \nSince then, the company has recruited Nick Longden, a former executive with Xero and Sage, as non-executive chairman. \nIt has also taken on three developers and has launched its first product, an app that helps individuals and businesses manage their expenses more efficiently by allowing users to track their mileage via GPS. Lee Durham, William Tombs and Richard Lane (Photo: www.crestphotography.co.uk) 8.20 KEY EVENT Atom Bank gets £30m funding to continue its growth \nNorth East challenger bank Atom has secured £30m of new funding as it moves to the next stage of its growth. \nThe Durham bank has agreed the Tier 2 capital from the British Business Bank to add to its capital base and allow it to draw on additional capital in a flexible manner as it grows. \nIn particular, the capital will allow Atom to increase its lending to business clients, with the British Business Bank wanting to increase competition in the business lending market. \nAtom is looking to lend to both large corporate organisations and smaller businesses, and included an SME proposition in its first product suite. \nAtom founder and chairman Anthony Thomson said: “Access to Tier 2 capital at such an early stage of the growth cycle is rare and we are extremely pleased to be gaining this support from British Business Bank Investments. \n“Together with the British Business Bank, we are sending a clear sign – we are here to support UK SMEs. The Atom Bank headquarters Coreena Ford Model railway firm Hornby back on track \nLosses at troubled toymaker Hornby narrowed last year as the firm’s boss declared his turnaround strategy is on track. \nThe group reported a pre-tax loss of £9.5m in the year to March 31, compared with a £13.5m loss in 2016. Revenue fell from £55.8m to £47.4m as Hornby scaled back on international brands. \nChief executive Steve Cooke said: “Our results to March 2017 provide solid evidence of our delivery in phase one of our turnaround plan; notably in terms of cash flow performance and gross margin improvement during the year. \n“We are determined to build on this progress as we move to the next phase of the turnaround plan. \n“The current financial year has started positively and we are well placed to achieve the board’s expectations for the year.” \nThe Scalextric-to-Airfix firm, best known for its model railways, has embarked on a painful turnaround which has seen it reduce product ranges and cut back on investment as part of plans to shore up the balance sheet. \nThe firm has also faced shareholder pressure to replace chairman Roger Canham, with the firm’s second biggest investor, New Pistoia, having recently said the company’s current strategy is “ineffective”, “will continue to destroy value” and is “not aligned with creating wealth for all shareholders”. A Hornby Class 29 model train. The toymaker has narrowed its losses. 8.10 Coreena Ford Housebuilder Berkeley warns of market uncertainty \nThe boss of housebuilder Berkeley Group has warned over a sharp drop in the levels of new builds across London as the property market faces a period of “prolonged uncertainty” amid Brexit talks. \nChairman Tony Pidgley said buyer confidence is being hit by Brexit and wider global instability, while recent tax hikes and planning red tape are holding back development. \nThe group, which is focused on London and the South East, called for “conditions for growth” to help the sector meet increasing housing demands in the capital. \nBut Mr Pidgley insisted Berkeley is in “excellent shape” after posting a 53% hike in profits to £812.4m for the year to April 30. \nThe group remains on track to notch up at least £3bn in pre-tax profits over the five years to May 2021, as long as property market conditions remain stable. Mr Pidgley said: “It is an inescapable fact that we are facing a number of headwinds and a period of prolonged uncertainty. \n“Brexit and wider global macro instability impact both confidence and sentiment and will result in constrained investment levels. \n“While these conditions are adequate to meet our profit guidance, they do not support the much needed growth in housing delivery in London.” \nRecent industry figures suggest the number of new house builds in London have tumbled by 30%, according to the group. Berkeley Group Chairman Tony Pidgley 8.05 FTSE and Pound latest \nThe FTSE-100 index opened at 7472.71. \nThe pound at 8am was 1.2610 dollars compared to 1.2626 dollars at the previous close. The euro at 8am was 0.8828 pounds compared to 0.8812 pounds at the previous close. 8.00 KEY EVENT Uber CEO Travis Kalanick resigns following shareholder pressure \nTravis Kalanick has resigned as chief executive of taxi hailing firm Uber following a series of scandals. \nMr Kalanick helped found the company in 2009 and has been instrumental in turning it into a transport behemoth, is reported to have quit following shareholder unrest over his leadership. \nUber has been dogged by questions over its working culture, including sexual harassment, allegations of trade secrets theft and an investigation into efforts to mislead government regulators. \nHeavyweight investors - Benchmark, First Round Capital, Lowercase Capital, Menlo Ventures and Fidelity Investments - wrote a letter titled “Moving Uber Forward”, demanding Mr Kalanick steps down, according to The New York Times. \nAs well as Mr Kalanick’s immediate resignation, they demanded the board appoints more “truly independent directors” and that Uber hires an experienced finance chief. \nMr Kalanick said in a statement to the newspaper: “I love Uber more than anything in the world and at this difficult moment in my personal life I have accepted the investors’ request to step aside so that Uber can go back to building rather than be distracted with another fight.” \nMr Kalanick had already been on indefinite leave, having announced he would be taking a leave of absence for an unspecified period of time last week. \nHe had said that he needed time off to grieve for his mother, who had died in a boating accident in May. \nThe Silicon Valley company is valued at more than $60bn (£47.5bn) and is now available as a service in 570 countries worldwide. Uber CEO Travis Kalanick has resigned Share", "external_links": [], "published": "2017-06-21T15:00:00.000+03:00", "crawled": "2017-06-21T10:16:40.000+03:00", "highlightTitle": ""}