{"organizations": [], "uuid": "2fa1fdbefdd5a33ad031d53e24d10feea8ff3f4f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30384858/16040053.jpg", "site_section": "http://www.middevongazette.co.uk/politics.rss", "section_title": "Devon Live Politics RSS feed", "url": "http://www.devonlive.com/devon-s-new-mp-claims-there-s-a-tory-plot-to-get-rid-of-theresa-may/story-30384858-detail/story.html", "country": "GB", "title": "Devon's new MP claims there's a 'Tory plot' to get rid of Theresa...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-12T18:43:00.000+03:00", "replies_count": 0, "uuid": "2fa1fdbefdd5a33ad031d53e24d10feea8ff3f4f"}, "author": "Devon Live", "url": "http://www.devonlive.com/devon-s-new-mp-claims-there-s-a-tory-plot-to-get-rid-of-theresa-may/story-30384858-detail/story.html", "ord_in_thread": 0, "title": "Devon's new MP claims there's a 'Tory plot' to get rid of Theresa...", "locations": [], "entities": {"persons": [{"name": "devon", "sentiment": "none"}, {"name": "theresa", "sentiment": "none"}, {"name": "jeremy", "sentiment": "none"}, {"name": "luke", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "luke pollard", "sentiment": "none"}, {"name": "carl eve comments", "sentiment": "none"}, {"name": "oliver colvile", "sentiment": "none"}], "locations": [{"name": "westminster", "sentiment": "none"}, {"name": "devonport", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "west country", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}], "organizations": [{"name": "democratic unionist party", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "plymouth herald", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "plymouth sutton", "sentiment": "none"}, {"name": "dup", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Devon's new MP claims there's a 'Tory plot' to get rid of Theresa May By Devon Live | Posted: June 12, 2017 By Carl Eve Comments (1) \nDevon's newest MP has claimed there is a 'Tory plot' to oust Prime Minister Theresa May. \nLabour's Luke Pollard dramatically took the Plymouth Sutton and Devonport seat from Conservative Oliver Colvile, with 23,808 votes – although following the exposure of the latest vote shambles surrounding Plymouth, the true figure of votes cast in his favour was 27,283, reports the Plymouth Herald. \nAs he prepared to head to Westminster today, ahead of his first day at work on Monday representing his constituents, he was scathing in his view of Theresa May who has been force to turn to the Democratic Unionist Party and its ten MPs to secure a parliamentary majority. \nRead more: More suicides dealt with by Devon region's coroners than anywhere else \nHe said: \"She's toast. \n\"With the campaign that she ran, telling the public how strong and stable she is, to see her now, how weak and vulnerable she's left her government and her country, just a few days away from Brexit negotiations – I can't see her surviving. \n\"There will be a plot by the Conservatives to oust her and I expect her to go shortly. \n\"I expect that we will be back at the polling station within a couple of months. \n\"The irony is that everything that they tried to smear Labour with, that we'd have a coalition of chaos, that Jeremy was a weak leader, has been turned on it's head. \nRead more: Devon man has been living with someone else's heart for 30 years \n\"It's like she was reading about herself in a crystal ball but didn't realise.\" \nLuke has also rounded on the beleaguered Prime Minister for ditching the South West and snubbing even her own Conservative MPs in the region in her desperation to prop up her majority with her new friends in Northern Ireland. \nHe said: \"What is this deal with the DUP going to look like? \n\"We're hearing she's promised billions of pounds of extra funding for Northern Ireland while we've been battling for years to get the South West's fair share. \n\"The Tories have something like 50 MPs in the South West and Theresa May's offering millions to get the support of just 10 MPs in Northern Ireland. \n\"If you look at these Conservative South West MPs they all made of point on their literature that they were standing with Theresa May. Now that she's on her way out who will they be standing with. \n\"They've shown this loyalty to her and what can they show for it? \n\"Are we still going to see more of the same? The dementia tax, more cuts to policing, more cuts to school budgets? Will all the money now go to Northern Ireland? Will the South West get even less money? \n\"When they said 'coalition of chaos' they were right – except it was her Conservative coalition. \n\"We have Brexit negotiations starting his week and we've a weak Prime Minister who has lost her closest advisors and has cabinet members plotting against her. \n\"We're going into these Brexit negotiations looking weak and vulnerable. This was all down to vanity politics to get a powergrab and it has backfired.\" \nFor his own party, Luke said he wants to see it unite behind it's leader. \nHe said: \"In Plymouth thousands of young people got involved. People who spent their lives trying to get young people coming out and voting have seen Jeremy come along and inspire young people. \n\"I got a lot of stick from the Conservatives that I backed Jeremy. Yet no-one can be in any doubt that when he went out and met the public, spoke to them face to face, that he has the ability to inspire people. \n\"He improved as a leader while Theresa May has crumbled. \n\"I'm looking forward to getting to Westminster, of the Labour party uniting as one to fight a weak and vulnerable Government. \n\"We now have two Labour MPs in the West Country and our intention is not to just hold those seats, but to increase them simply on the basis that there's been a complete and utter collapse of confidence in the Tories. \n\"We've a unique opportunity to do something special. To get young people involved and kept energised all year round, to show them that they do have a voice in the South West and that they can help change the course of this country.\" \nLuke said he hoped to bring the Labour leader to Plymouth in the near future to show him \"the huge levels of support he has here\" and to seek support for the region. \n\"We want to see the upgrading of the railway line, protect our hospitals, support young people at the city's educational institutions, at the universities, colleges, working on apprenticeships. \n\"He speaks to all of them in a way the right-wing national press don't understand and don't do. \n\"The young people were right – for too long politics has been broken and its got to be better for everyone. \n\"I think there will be an election soon – otherwise what else will there be? More cuts, more austerity, more deals with a coalition of chaos?\"", "external_links": [], "published": "2017-06-12T18:43:00.000+03:00", "crawled": "2017-06-12T16:22:37.002+03:00", "highlightTitle": ""}