{"organizations": [], "uuid": "67094e08b9f2b8ad6adb405f0798061753f66043", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13130580.ece/ALTERNATES/s1200/slavery.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/slavery-gang-baited-polish-workers-13127732", "country": "GB", "domain_rank": 21960, "title": "Slavery gang baited Polish workers with well-paid jobs - but inside their homes lay haunting secrets", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-04T01:00:00.000+03:00", "replies_count": 0, "uuid": "67094e08b9f2b8ad6adb405f0798061753f66043"}, "author": "Lisa Hutchinson", "url": "http://www.chroniclelive.co.uk/news/north-east-news/slavery-gang-baited-polish-workers-13127732", "ord_in_thread": 0, "title": "Slavery gang baited Polish workers with well-paid jobs - but inside their homes lay haunting secrets", "locations": [], "entities": {"persons": [{"name": "benwell", "sentiment": "none"}, {"name": "steve barron", "sentiment": "none"}, {"name": "jim hope", "sentiment": "none"}, {"name": "stephen ashurst", "sentiment": "none"}, {"name": "jarrow", "sentiment": "none"}, {"name": "pawel majewski", "sentiment": "none"}, {"name": "mandzik", "sentiment": "none"}, {"name": "szymt", "sentiment": "none"}, {"name": "seweryn szymt", "sentiment": "none"}, {"name": "sabastian mandzik", "sentiment": "none"}, {"name": "ashurst", "sentiment": "none"}, {"name": "robert majewski", "sentiment": "none"}, {"name": "nicole roberts", "sentiment": "none"}, {"name": "sabastian mandsik", "sentiment": "none"}], "locations": [{"name": "west end", "sentiment": "none"}, {"name": "benwell", "sentiment": "none"}, {"name": "deckham terrace", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "percy street", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "ilford road", "sentiment": "none"}, {"name": "russell street", "sentiment": "none"}, {"name": "atkinson road", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "poland", "sentiment": "none"}, {"name": "split crow road", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "ethel street", "sentiment": "none"}, {"name": "tyneside", "sentiment": "none"}], "organizations": [{"name": "northumbria police", "sentiment": "none"}, {"name": "human trafficking foundation", "sentiment": "none"}, {"name": "newcastle crown court", "sentiment": "none"}, {"name": "cps", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now     \nNestled amongst oblivious families lay a sordid slavery ring hidden behind closed doors. \nHeld up in squalid houses in Newcastle’s West End and Gateshead , hopeful Polish men and women were promised a better life on Tyneside. \nThey hung onto hope as they were told jobs and secure housing would come their way after leaving their homeland behind. \nBut beneath the empty promises lay a despicable con. A wicked slavery gang had different plans for those who came to Britain and the land of plenty. \nSabastian Mandzik, Seweryn Szymt, Pawel Majewski and Robert Majewski were part of a £1m operation that enticed their victims from their native country to the UK using well-paid jobs as bait. Pawel Majewski, who has been jailed for slavery at Newcastle Crown Court (Photo: Police handout) \nBut when they arrived they were forced to live in appalling living conditions, where they had to scavenge and roam the streets looking for basic furnishings such as mattresses, and were then tricked into low-paid work. \nNewcastle Crown Court heard the gang - jailed this week for a total of 32 years - then controlled their victims’ finances by taking their bank cards and wages and leaving them with a “pittance” to live on. \nNow, neighbours on Ethel Street and Atkinson Road, in Benwell , and Deckham Terrace, in Gateshead, have labelled the crew as “scum” as they tell of their shock after being unaware of the sinister goings on only doors away. \n“You would never think slavery was going on in this day and age and especially on your doorstep,” said Nicole Roberts, 26. Shocked resident Nicole Roberts, 26 \n“Who would imagine slavery is going on in England? You would think this would never happen now, it was something that happened in the past. \n“This gang is pure scum. If you bring people over from Poland with the prospects of better housing and jobs, then that is what you should give them. \n“Instead, they were brought across to live in worse conditions and had their money taken from them. It is totally immoral. I don’t know what people are like any more. \n“Atkinson Road is quite quiet, I suppose they might have chosen this road as people wouldn’t notice what was going on. It’s just awful.” Atkinson Road in Benwell, Newcastle (Photo: Newcastle Chronicle) \nThe four culprits were found guilty after trial of two counts of conspiring to force people into labour and one of conspiring to conceal criminal property. \nMandzik, described as the “linchpin” of the operation, was also convicted of a further charge of transporting people for exploitation. \nLocking them up, Judge Stephen Ashurst said: “Throughout the ages, vulnerable people have been exploited and, despite the efforts of reforms over the country to outlaw slavery, it has not been eradicated and it continues to thrive in various parts of the world. \n“Sadly, as this case demonstrated, the exploitation of such people continues in our own country.” \nThe court heard the operation, described by the judge as a “family business”, ran between June 2014 and September 2016. \nInside the slave houses lay haunting secrets, yet they were only yards away from the hustle an bustle of busy Benwell’s Adelaide Terrace and Split Crow Road in Gateshead. Sabastian Mandsik, who has been jailed for slavery at Newcastle Crown Court (Photo: Police handout) \nA neighbour in Ethel Street said: “You wouldn’t think this is happening on your doorstep. Unfortunately it is happening in Benwell. I understand some of them were young, I feel very sorry for them. \n“They were promised the earth and tricked to come here. It’s terrible.” \nAnother neighbour said: “No-one knew what was going on. We knew they were foreign but we didn’t know it was slavery. \n“There were people coming and going, lads and lasses. To think they were made to work and had their money taken from them. It’s despicable really.” \nAnother neighbour added: “I don’t think 32 years between them was enough. They should lock them up and throw away the keys.” \nThe victims were enticed to the North East on the belief they could earn at least four times their wages in Poland, prosecutors said. \nBut,they were put-up in sub-standard, cramped accommodation which lacked basic facilities and were known as “tents”. \nOn the south side of the Tyne, the gang were also operating a team in Deckham Terrace. Deckham Terrace in Gateshead (Photo: Newcastle Chronicle) \nA 71-year-old neighbour said: “They are evil, scum. I have lived here for 40 years and I never expected this to be happening near me. How can they do that? I’m finding it hard to believe this was happening on my street, they are scum.” \nAnother neighbour said: “It’s so sinister. I can’t understand how people treat others like this. The victims were conned, they were led to believe they would have a better life over here. They led them down the garden path and made their lives hell.” \nSpeaking to the gang, Judge Ashurst said: “What you did was to create what has been called tents. In other words, large, unfurnished properties, which you either let or sublet from other landlords. \n“These were very basic affairs, often without any modern facilities, and there was a body of evidence to show those placed in tents were at a very considerable disadvantage. \n“All were required to scavenge for items and there was compelling evidence as to how they had to roam the streets looking for discarded mattresses.” Seweryn Szymt, who has been jailed for slavery at Newcastle Crown Court (Photo: Police handout) Read More Could Brexit mean an increase in slavery and people trafficking in the North East? \nThe victims were then put to work through a legitimate agency picking through litter at recycling plants, where the pay was low and the hours long. \nThe court heard the gang took control of their victims’ bank accounts and took their wages and used abuse and violence against anyone who resisted. \nProsecutors said that, when the victims complained, they were physically assaulted, spat at or their families were threatened. \nJobs that were found for them were legitimate, the court heard , but they were “menial” and involved standing for up to eight hours a day picking refuse on recycling plants. \nThe victims, both men and women, were then left with just “a few pounds a week” to live on as the gang pocketed the rest. \nThe court was also told the gang used their victims’ bank accounts to launder hundreds of thousands of pounds, although it is still not known where that money has gone, \nThe police finally became involved when one of the workers reported what had been going on and an investigation was launched. Robert Majewski, who has been jailed for slavery at Newcastle Crown Court (Photo: Police handout) \nMandzik, 40, of Percy Street, Jarrow, was jailed for 12 years; Szymt, 20, of Percy Street, Jarrow, for five years; Pawel Majewski, 28, of Russell Street, Jarrow, for seven years; and Robert Majewski, 46, of Ilford Road, London, for eight years. \nSpeaking after the case, Jim Hope, from the Crown Prosecution Service said: “Once this group became aware of the police investigation, they made a calculated effort to remove or destroy any evidence linking them to this case. \n“Despite their attempts, the CPS worked closely with police to build a complete picture of the scale and scope of their criminal operations. \n“We are pleased with the sentences handed down to these four men and sincerely hope that, in bringing them to justice, other victims of modern slavery are encouraged to come forward and report their situation to police.” Read More 12 arrested as part of major human trafficking operation in Newcastle \nDet Supt Steve Barron, of Northumbria Police , said: “Unfortunately, once here, the victims were forced to live in horrible conditions and carry out work for little or no pay. \n“They are now in safe locations and are being supported by specialists from partner agencies and our officers.” \nThe gang’s actions have been slammed by the Human Trafficking Foundation. \nA spokesman said: “Sadly, cases such as this are all too common right across the UK. However, it is encouraging that law enforcement agencies are beginning to understand the complexities of the problem of human trafficking. \n“Substantial prison sentences for perpetrators of modern slavery are to be welcomed, as they send a clear message to traffickers that such exploitation will not be tolerated in the UK.” Like us on Facebook", "external_links": [], "published": "2017-06-04T01:00:00.000+03:00", "crawled": "2017-06-03T20:31:51.014+03:00", "highlightTitle": ""}