{"organizations": [], "uuid": "c1dc198b0ff72fb69d9e9e050602d919c8938a81", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article13230415.ece/ALTERNATES/s1200/brexit.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/brexit-one-year-12-key-13230028", "country": "GB", "domain_rank": 21960, "title": "Brexit one year on - the 12 key dates in a momentous year in British politics", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-23T21:50:00.000+03:00", "replies_count": 0, "uuid": "c1dc198b0ff72fb69d9e9e050602d919c8938a81"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/brexit-one-year-12-key-13230028", "ord_in_thread": 0, "title": "Brexit one year on - the 12 key dates in a momentous year in British politics", "locations": [], "entities": {"persons": [{"name": "donald tusk", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "deir dos santos", "sentiment": "none"}, {"name": "philip may", "sentiment": "none"}, {"name": "david davis", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "samantha", "sentiment": "none"}, {"name": "nigel farage", "sentiment": "none"}, {"name": "michel barnier", "sentiment": "none"}, {"name": "cameron", "sentiment": "none"}, {"name": "leadsom", "sentiment": "none"}, {"name": "david cameron", "sentiment": "none"}, {"name": "tim barrow", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "andrea leadsom", "sentiment": "none"}, {"name": "gina", "sentiment": "none"}, {"name": "michael gove", "sentiment": "none"}, {"name": "gina miller", "sentiment": "none"}, {"name": "theresa", "sentiment": "none"}, {"name": "boris johnson", "sentiment": "none"}, {"name": "nigel farage  he", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}], "locations": [{"name": "brussels", "sentiment": "none"}, {"name": "berlaymont", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "downing street", "sentiment": "none"}, {"name": "belgium", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "atlantic", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "european council of britain", "sentiment": "none"}, {"name": "supreme court", "sentiment": "none"}, {"name": "eu council", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "house", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "european commission", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}, {"name": "icm", "sentiment": "none"}, {"name": "high court", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "conservative", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "dup", "sentiment": "none"}, {"name": "european council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nOn the first anniversary of the European Union referendum vote in which the UK opted for Brexit, we look at 12 key dates in the course of a year like no other in British politics. 1. June 23 - The EU referendum vote \nBy 51.9% to 48.1%, the UK chose to leave the European Union . Famously the first hint of the result came here in the North East when Newcastle voted Remain by a much narrower margin than expected while Sunderland chose Leave by an unexpectedly huge majority. 2. June 24 - David Cameron quits Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nDuring the Brexit campaign Prime Minister David Cameron had vowed to stay on whichever side won. He stayed true to his word - for about six hours. \nCameron announced his attention outside Number 10 with wife Samantha at his side. \nHe said: “This is not a decision I’ve taken lightly but I do believe it’s in the national interest to have a period of stability and then the new leadership required.” 3. June 25 - until November 25 \nAn online petition for a second EU Referendum begins to gain momentum. Ironically it was set up by a Leave campaigner who feared a close defeat for his side. It said: “We the undersigned call upon HM Government to implement a rule that if the remain or leave vote is less than 60% based a turnout less than 75% there should be another referendum.” \nBy the time it closed on November 25, it had been signed by 4,150,262 people. 4. July 4 - UKIP leader Nigel Farage steps down Handout photo of Donald Trump and Nigel Farage \nHe did so, he said, as his “political ambition has been achieved”, declaring the result “independence day”. Farage then headed across the Atlantic to champion another no-hope election candidate, Donald Trump for US president . 5. July 13 - Theresa May officially becomes Prime Minister Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nAfter a lively Conservative party leadership battle which saw favourite Boris Johnson stabbed in the back by his long term pal Michael Gove who was then stabbed in the front by most everybody else in revenge, the field was reduced to two - Andrea Leadsom and Theresa May . Leadsom pulled out, for the sake of the country she said publicly, although in private it was reported she quit because she was sick of the grief she was getting. 6. November 3 - The High Court puts a spanner in the works of Theresa May’s Brexit plans Gina Miller speaks outside the Supreme Court (Photo: Getty Images Europe) \nBusinesswoman Gina Miller sees the High Court rule in her favour and ensure Theresa May had to give MPs a vote before triggering Article 50. \nCampaigners launched the legal action by arguing Mrs May had no constitutional right to take a step that would extinguish British rights established in law over 40 years ago and it was for Parliament to decide. \nGina, who brought the case with hairdresser Deir Dos Santos, and her many supporters describe the result a “victory for democracy”. Her opponents aren’t quite so generous with their response. 7. February 8 - MPs back Brexit Bill \nThe House of Commons approved the Brexit bil l at its third reading, allowing the Prime Minister to begin withdrawal talks under Article 50. \nAfter two days of debate, the House voted in favour of the bill by 494 to 122 - a majority of 372. \nIt cleared the Lords unamended one month later on March 13. 8. March 29 - Article 50 triggered Britain's permanent representative to the European Union Tim Barrow, left, hand delivers British Prime Minister Theresa May's Brexit letter in notice of the UK's intention to leave the bloc under Article 50 of the EU's Lisbon Treaty to EU Council President Donald Tusk (Photo: REUTERS POOL) \nThe letter informing the European Council of Britain’s intention to leave the EU was handed over to European Council president Donald Tusk in Brussels. \nThe declaration, signed by Theresa May, set in train a two-year process of negotiation under Article 50 of the EU treaties leading to Britain’s expected withdrawal in 2019. \nIt was personally hand-delivered to Mr Tusk by the UK’s permanent representative to the EU, Sir Tim Barrow. 9. April 18 - Snap election called Prime Minister Theresa May makes a statement in Downing Street, London, announcing a snap general election on June 8 (Photo: PA) \nAfter ruling out a snap election on numerous occasions since becoming PM, Theresa May calls a snap election. \nShe accused opposition parties of trying to jeopardise her government’s preparations for leaving the EU and said she was looking for a clear mandate from the British people to take into Brexit talks \nLabour leader Jeremy Corbyn , responded by saying he would welcome the opportunity to fight an election opposing Tory austerity. 10. April 19 - Commons backs snap election Labour leader Jeremy Corbyn (Photo: PA) \nDue to the Fixed Term Parliament Act, Mrs May needed a two thirds Commons majority to get the go ahead. It was easily achieved by 522 votes to 13. \nPolitical commentators said it was a monumental tactical blunder by Jeremy Corbyn who backed the vote as if all Labour MPs abstained Mrs May would have failed to get the two thirds majority needed. \nWith Labour trailing by 21 points in ICM poll, many predicted it as the death throes of the party. 11. June 8 - The General Election gamble goes disastrously wrong for Theresa May British Prime Minister Theresa May and husband Philip May wave outside 10 Downing Street (Photo: Getty Images Europe) \nThe Prime Minister’s attempt to increase her authority in Brexit negotiations backfires spectacularly. \nThe Tory majority is wiped out, a hung parliament results with Mrs May left seeking a deal with the DUP to prop up her Government. Perversely although Labour did not win, Labour leader Jeremy Corbyn’s authority is strengthened as the party did so much better than expected. 12 . June 19 - Brexit talks begin Brexit Secretary David Davis exchanging mountaineering gifts with European Commission's chief negotiator Michel Barnier at the commission's Berlaymont headquarters in Brussels, Belgium (Photo: PA) \nBritain and the EU embark on the first day of formal Brexit negotiations on Monday, aiming for a constructive, orderly launch that avoids a noisy clash on the big policy differences over Britain’s exit. \nDavid Davis, Britain’s Brexit Secretary, sees Michel Barnier, the EU’s chief negotiator, in Brussels for the debut round of a complex negotiating process that is expected to stretch to November 2018 with ever increasing pace and intensity. Like us on Facebook", "external_links": [], "published": "2017-06-23T21:50:00.000+03:00", "crawled": "2017-06-23T17:13:04.005+03:00", "highlightTitle": ""}