{"organizations": [], "uuid": "4b1f031848c50aa9e3383f10427358e52d6727ab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/30388118/16042715.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/ukip-veteran-east-midlands-mep-roger-helmer-to-retire-from-the-european-parliament/story-30388118-detail/story.html", "country": "US", "domain_rank": 48128, "title": "UKIP veteran East Midlands MEP Roger Helmer to retire from the European Parliament | Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.031, "site_type": "news", "published": "2017-06-14T02:23:00.000+03:00", "replies_count": 0, "uuid": "4b1f031848c50aa9e3383f10427358e52d6727ab"}, "author": "", "url": "http://www.leicestermercury.co.uk/ukip-veteran-east-midlands-mep-roger-helmer-to-retire-from-the-european-parliament/story-30388118-detail/story.html", "ord_in_thread": 0, "title": "UKIP veteran East Midlands MEP Roger Helmer to retire from the European Parliament | Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "roger helmer", "sentiment": "negative"}, {"name": "jonathan bullock", "sentiment": "none"}, {"name": "helmer", "sentiment": "none"}, {"name": "jonathan", "sentiment": "none"}], "locations": [{"name": "east midlands", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "ukip east midlands", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "south leicestershire", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "european parliament", "sentiment": "negative"}, {"name": "leicester mercury ukip", "sentiment": "negative"}, {"name": "ukip", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "paris climate treaty", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "UKIP veteran East Midlands MEP Roger Helmer to retire from the European Parliament By danjmartin | Posted: June 13, 2017 0 COMMENTS SHARES East Midlands MEP Roger Helmer is retiring UKIP veteran East Midlands MEP Roger Helmer to retire from the European Parliame... X \nCopy link to paste in your message / Comments (0) \nUKIP East Midlands MEP Roger Helmer is to retire from the European Parliament at the end of July. \nThe 73-year-old political veteran was first elected to the European Parliament 18 years ago as a Conservative and was re-elected twice before defecting to UKIP. \nHe stood unsuccessfully as a candidate in South Leicestershire in last week's election but says he made the decision to step down shortly after last year's EU referendum. \nRead more: Major Leicestershire roundabout to close for up to three weeks \nMr Helmer said: \"It has been a great privilege to serve the voters of the East Midlands as their MEP for nearly two decades, spanning not just two centuries but two millennia. \n\"The main objective of my political career has been to free our country from the morass of the European Union, and to re-establish our proper status as a great global trading nation, and as an independent, self-governing country. \n\"Despite the current turmoil around the Government's position and the Brexit negotiations, I see last year's Brexit vote as the vindication of a long campaign and a long career.\" \nHe added: \"As UKIP's energy spokesman, my second major focus has been climate and energy, and I am encouraged to see the first tentative steps away from climate hysteria, with the current US administration withdrawing from the hugely damaging Paris Climate Treaty, and the UK government cutting back on renewables subsidies\". \nMr Helmer has been a long-time critic of the EU and a climate change sceptic. \nRead more: Brutal city centre attack by gang leaves woman needing facial surgery \nHarborough-based Mr Helmer added: \"There will inevitably be speculation that my retirement decision was influenced by the outcome of the June election. \n\"But this is not the case. I had reached a decision soon after the Brexit referendum to retire in 2017, and I signed the formal resignation papers in the parliament a couple of weeks before the General Election.\" \nMr Helmer said he expected to be replaced by the next candidate on UKIP's 2014 East Midlands candidate list, Jonathan Bullock adding: \"I have known Jonathan for many years, and we have campaigned together as euro-candidates more than once. \n\"He is an extremely sound man, especially on the Brexit issue, and has extensive commercial experience. \n\"I am convinced that he will do a fine job riding shotgun on the Brexit negotiations and representing the voters of the East Midlands in Brussels during the remaining pre-Brexit years.\" \n&amp;amp;amp;amp;amp;amp;amp;amp;lt;p&amp;amp;amp;amp;amp;amp;amp;amp;gt;&amp;amp;amp;amp;amp;amp;amp;amp;lt;/p&amp;amp;amp;amp;amp;amp;amp;amp;gt;", "external_links": [], "published": "2017-06-14T02:23:00.000+03:00", "crawled": "2017-06-13T20:53:46.007+03:00", "highlightTitle": ""}