{"organizations": [], "uuid": "8cdf822e23cb6a3604ddcda0f1fddb09169aef66", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/30413730/16061625.jpg", "site_section": "http://www.thisisleicestershire.co.uk/weathernews/rss.html?chid=182806", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/freight-specialist-pall-ex-lays-foundations-to-grow/story-30413730-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "Leicester Mercury published Freight specialist Pall-Ex lays foundations to grow", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-28T13:38:00.000+03:00", "replies_count": 0, "uuid": "8cdf822e23cb6a3604ddcda0f1fddb09169aef66"}, "author": "Leicester Mercury", "url": "http://www.leicestermercury.co.uk/freight-specialist-pall-ex-lays-foundations-to-grow/story-30413730-detail/story.html", "ord_in_thread": 0, "title": "Leicester Mercury published Freight specialist Pall-Ex lays foundations to grow", "locations": [], "entities": {"persons": [{"name": "kevin buchanan", "sentiment": "none"}, {"name": "hilary devey", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "tom pegden pall-ex", "sentiment": "none"}, {"name": "pavel penchev", "sentiment": "none"}, {"name": "buchanan", "sentiment": "none"}], "locations": [{"name": "leicester mercury", "sentiment": "none"}, {"name": "romania", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "benelux", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "portugal", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}, {"name": "ellistown hub", "sentiment": "none"}, {"name": "highcross leicester", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}, {"name": "fosse park", "sentiment": "none"}, {"name": "bulgaria", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "leicester mercury", "sentiment": "negative"}, {"name": "hammerson", "sentiment": "none"}, {"name": "pall-ex bulgaria", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Freight specialist Pall-Ex lays foundations to grow By Leicester Mercury | Posted: June 28, 2017 By Tom Pegden Pall-Ex has expanded into Bulgaria Freight specialist Pall-Ex lays foundations to grow X \nCopy link to paste in your message / Comments (0) \nThe boss of Pall-Ex says they have laid the foundations for growth with board changes, better IT, and expansion overseas. \nKevin Buchanan, group managing director of the Ellistown-based palletised freight specialist, said they had already seen growth this financial year following a period of intensive change. \nIt comes as Pall-Ex officially launched a new network in Bulgaria, thanks to a deal with one of the country's biggest courier providers. \nIt is the latest country to join Pall-Ex's European network, which now includes Italy, Spain, Portugal, France, Romania and the Benelux territories. \nThe Pall-Ex group – owned by TV star Hilary Devey – uses a network of members to move pallets for one another. \nMost of its UK freight passes through its central Ellistown hub. \nRead more: Owner of Fosse Park announces record breaking profits \nThere are similar hub and spoke operations in its member countries. \nLatest annual figures for Pall-Ex (UK) showed a £60 million turnover for the year to July 31 last year, on a par with the previous 12 months. Pre-tax profits were around £500,000. \nMr Buchanan said following a year of consolidation, turnover was already on the way up. \nHe said: \"We have been focusing on quality rather than growth. We are up slightly on turnover, but over the last 12 months we were concentrating more on strengthening the foundations of the business. \n\"We have changed almost the entire board over the course of the last two years, with people retiring or leaving and we are not embarrassed by that. We want to be the market leader in what we do. \n\"We have been focusing on getting the operational structure right – we have re-jigged the board and recruited something like 26 to 28 members over the last two years – which took a lot of management time and you do not grow during a transition like that.\" \nMr Buchanan said shipping direct to shoppers was a fast-growing part of the business, representing 15-20 per cent of turnover, thanks to the growth of online shopping. \nHe added: \"We are building a new IT system to cope better with the requirements of B to C deliveries.\" \nNew IT will also improve the complicated process of moving freight right across Europe on a single label. \nMr Buchanan said they also wanted to create a joint venture to crack the German market. \nHe said: \"We are talking to two or three exciting partner opportunities and hope to have something concluded in 2017, and probably launched in 2018. \n\"It is critical to get Germany right to get Europe right.\" \nHe said it was unlikely that Brexit would close borders between Britain and the EU., but even if that did happen, moving freight into and out of the UK was only a small part of the business. \nRead more: Hammerson gets green light for redevelopment of Highcross Leicester \nPall-Ex Bulgaria's operation already has 18 transport company's signed up. \nPavel Penchev, managing director at Pall-Ex Bulgaria, said that the network was helping the Bulgarian freight market as a whole. \nHe said: \"Compared to other countries in Europe, the domestic market is fairly unstructured and we often see freight being delivered through courier networks or long distance multi drops, which can be slower and more expensive. \n\"We see the demand for pallet services increasing throughout the region, and we are keen to revolutionise the market with Pall-Ex Bulgaria. \n\"We are proud to have played a pivotal role in the introduction of a new form of palletised distribution to Bulgaria.\" ", "external_links": [], "published": "2017-06-28T13:38:00.000+03:00", "crawled": "2017-06-28T14:46:56.003+03:00", "highlightTitle": ""}