{"organizations": [], "uuid": "b26bf1a0752494494ec39949bd5b328a523d6faf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/30379600/16036508.jpg", "site_section": "", "section_title": "", "url": "http://www.leicestermercury.co.uk/mercury-readers-priorities-for-the-new-government/story-30379600-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "Mercury readers' priorities for the new Government | Leicester Mercury", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.984, "site_type": "news", "published": "2017-06-09T02:26:00.000+03:00", "replies_count": 0, "uuid": "b26bf1a0752494494ec39949bd5b328a523d6faf"}, "author": "", "url": "http://www.leicestermercury.co.uk/mercury-readers-priorities-for-the-new-government/story-30379600-detail/story.html", "ord_in_thread": 0, "title": "Mercury readers' priorities for the new Government | Leicester Mercury", "locations": [], "entities": {"persons": [{"name": "glenfield", "sentiment": "none"}], "locations": [{"name": "rutland", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}], "organizations": [{"name": "leicester mercury mercury", "sentiment": "negative"}, {"name": "leicestershire police", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "ares mercury", "sentiment": "none"}, {"name": "glenfield hospital", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Mercury readers' priorities for the new Government By Tom_Mack | Posted: June 08, 2017 1 COMMENTS SHARES Mercury readers know what they want from the new Government Mercury readers' priorities for the new Government X \nCopy link to paste in your message / Comments (1) \nMore than 750 Mercury readers have taken part in a poll about their top priorities for the new Government. \nSaving Glenfield Hospital's heart unit came out on top, followed by maintaining or improving school budgets and giving more cash to Leicestershire Police. \nRead more: Our guide to General Election 2017 for voters in Leicestershire \nThe survey was conducted online and people were asked to choose from nine options and pick the three issues that were most important to them. \nSaving the Glenfield children's heart unit was a top priority for more than 60 per cent of those taking part. \nThe future of the county's children was clearly on people's minds when they went to polling stations today, as the second concern was school budgets, which 57 per cent had as one of their top three. \nFighting crime was also a top priority, with increasing the police budget in the county being the third most popular choice. \nThey were followed by keeping roads up to scratch, which 28 per cent of respondents had among their top three, and keeping the ban on fox hunting in place, prioritised by more than 22 per cent of voters. \nThe survey also asked people about their views on the big national debates and the funding of the NHS came out on top as a major concern, with more than 71 per cent putting it in their top three. \nIn second place was getting a good Brexit deal, with more than 52 per cent of voters putting it in their top three and in third place, with more than 38 per cent of people calling it a priority, was reducing immigration. \nOther popular priorities were increasing the minimum wage, cutting the cost for students going to university and reducing the tax paid by low earners. \nThe completion of the HS2 train line was only a top-three priority for 1.5 per cent of people who responded to the poll. \nThe survey was completed by 769 Mercury readers from a wide range of age groups. \nOf those answering, 391 lived in one of the three city constituencies and 364 lived elsewhere in Leicestershire and Rutland. The remaining 14 lived outside the two counties.", "external_links": [], "published": "2017-06-09T02:26:00.000+03:00", "crawled": "2017-06-08T23:32:47.000+03:00", "highlightTitle": ""}