{"organizations": [], "uuid": "10826080ffd3ca9148ddaea35f97113929a525bf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30406663/16056753.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "Devon Live Editor's Choices RSS feed", "url": "http://www.devonlive.com/south-devon-stabbing-appeal-features-on-bbc-tv-show/story-30406663-detail/story.html", "country": "GB", "title": "South Devon stabbing appeal features on BBC TV show", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-24T00:16:00.000+03:00", "replies_count": 0, "uuid": "10826080ffd3ca9148ddaea35f97113929a525bf"}, "author": "Zoe_Stevens", "url": "http://www.devonlive.com/south-devon-stabbing-appeal-features-on-bbc-tv-show/story-30406663-detail/story.html", "ord_in_thread": 0, "title": "South Devon stabbing appeal features on BBC TV show", "locations": [], "entities": {"persons": [{"name": "berry head", "sentiment": "none"}, {"name": "algren", "sentiment": "none"}, {"name": "steve crowther", "sentiment": "none"}, {"name": "devon live", "sentiment": "none"}, {"name": "david davis", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "crowther", "sentiment": "none"}], "locations": [{"name": "south devon", "sentiment": "none"}, {"name": "north devon", "sentiment": "none"}, {"name": "paris street", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "central station", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "south devon coast", "sentiment": "none"}, {"name": "regent street", "sentiment": "none"}, {"name": "reddit", "sentiment": "none"}, {"name": "brixham", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "teignmouth", "sentiment": "none"}, {"name": "braunton", "sentiment": "none"}], "organizations": [{"name": "bbc tv", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "bbc", "sentiment": "none"}, {"name": "exeter central station.the", "sentiment": "none"}, {"name": "real food store", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}, {"name": "ikea", "sentiment": "none"}, {"name": "cctv", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "South Devon stabbing appeal features on BBC TV show By Zoe_Stevens | Posted: June 23, 2017 0 COMMENTS SHARES Police released a CCTV image of a man they want to speak to in connection with the serious assault. South Devon stabbing appeal features on BBC TV show X \nCopy link to paste in your message / Police released a CCTV image of a man they want to speak to in connection with the serious assault. Comments (0) \nA police appeal to identify a man in connection with a stabbing in Teignmouth during regatta week last year has featured on BBC's Crime Watch Roadshow. \nA 33-year-old man from Teignmouth received a puncture wound to the abdomen and was taken to hospital where he later required surgery, police said at the time. \nThe incident happened at just after midnight on Saturday, July 31 last year, when police received reports of a disturbance between four men on Regent Street, Teignmouth. \nPolice released a CCTV image of a man they want to speak to in connection with the serious assault. \nA police spokesman said: \"The incident in question took place during regatta week which means that we are keeping an open mind that the person we wish to identify may not be local. \n\"We would like to identify the man pictured in connection with the assault. He is described as wearing a black baseball cap, white T-shirt with distinctive skull design and carrying a rucksack. He is a white male, with long brown hair in a bun and has a full beard.\" \nIf you can help police identify the man pictured, contact the police by email at 101@dc.police.uk or by calling call 101, quoting crime reference CR/52243/16. READ NEXT: Three whales spotted off South Devon coast Whales were spotted off the South Devon coast on Friday morning.Berry Head Ranger tweeted to alert photographers to the sighting, saying that three whales had been seen heading south at 9am of the nature reserve in Brixham. A spokesperson from the Guardhouse Café on Berry Head, said that they had heard a ranger speaking about a sighting of some whales on Friday morning. Exeter's Real Food Store is moving to a new location at Central Station Community-owned business The Real Food Store is moving to new premises in a former haberdashers next to Exeter Central Station.The popular store had to move out of its current home after six years on Paris Street, which will be demolished to make way for a retail development called Princesshay Leisure at the Bus and Coach Station site , which will include shops, cafes, restaurants, a cinema and an large outdoor public amphitheatre. Here's the inside secrets of Ikea ahead of the Exeter opening - Revealed by a store worker Fans of Ikea, the mega-store heading to Exeter, can now get the best deals on their Swedish meatballs as well as flat-pack furniture after a store worker revealed industry secrets online.A member of staff, who works at a store in the UK, took to news website Reddit this week to lift the lid on life behind-the-scenes at Ikea.As well as sharing tips on the best value meal to buy at the store's in-house restaurants, the worker, called Algren, revealed the best way to make a complaint, the best time to shop and how much staff receive in discount. UKIP leader Steve Crowther calls for 'hardball' Brexit talks UKIP's interim leader has called on the British negotiating team to \"play hardball\" in negotiations to leave the European Union.In an interview to mark one year since the EU referendum, Devon's Steve Crowther has urged Brexit minister David Davis to take a tough stance in Brussels talks.Mr Crowther, who lives near Braunton in North Devon, spoke with Devon Live after officially becoming the party's leader until a permanent successor is named in September.", "external_links": [], "published": "2017-06-24T00:16:00.000+03:00", "crawled": "2017-06-23T19:50:48.008+03:00", "highlightTitle": ""}