{"organizations": [], "uuid": "fb76ee45dfd4ff9d4a29b17da61e980b71cf4a0e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article13158921.ece/ALTERNATES/s1200/DMR_NEC_080617prime_11.jpg", "site_section": "", "section_title": "", "url": "http://www.chroniclelive.co.uk/news/north-east-news/general-election-exit-poll-result-13158873", "country": "IE", "domain_rank": 21960, "title": "Why a hung parliament might mean yet ANOTHER general election - Chronicle Live", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.188, "site_type": "news", "published": "2017-06-09T06:08:00.000+03:00", "replies_count": 0, "uuid": "fb76ee45dfd4ff9d4a29b17da61e980b71cf4a0e"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/general-election-exit-poll-result-13158873", "ord_in_thread": 0, "title": "Why a hung parliament might mean yet ANOTHER general election - Chronicle Live", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "none"}, {"name": "harold wilson", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "newcastle airport", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}], "organizations": [{"name": "snp", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Why a hung parliament might mean yet ANOTHER General Election We look at why the country could go the polls yet again - if the 2017 exit poll proves to be correct and Theresa May doesn't get a majority Share Click to play Tap to play The video will start in 8 Cancel Play now   Thank you for subscribing!   \nSo the exit poll says it will be a hung parliament, meaning Theresa May’s gamble to call a snap election will have backfired. \nShe won’t be happy and while Labour supporters are celebrating - and who can blame them - there is a dark cloud on the horizon. And that dark cloud is? \nAnother General Election. You’re kidding. The country can’t take another ballot. Why? \nWell here’s the thing. If the exit poll is accurate, the Tories will be 12 seats short of a majority. To make up those 12 seats they need to form a Coalition. And their options are limited. Read More General Election 2017 North East results in full: How North East constituencies voted In what way are they limited? \nThey could rely on around 10 unionist MPs in Northern Ireland but will still need a couple more. They could get over the line if they hooked up with the Lib Dems, who it is predicted will get 14 seats. But ... But ... ? \nWell, the whole point of the election was to provide a strong mandate for Theresa May at the Brexit negotiating table. The Lib Dems want another EU referendum of sorts. And after the 2010 to 2015 Con/Lib Dem coalition which nearly wiped them out, it could well be a case of once bitten twice shy. Other options for Theresa May are? \nForming a Coalition with the SNP or Labour. Read More Follow the General Election 2017 results and updates on our interactive map Enough said. Moving swiftly on. How about Labour forming a coalition? \nIt would be a true rainbow coalition or coalition of chaos, depending on your politics. It would mean Labour having to form an alliance with every political party bar the Conservatives and the Northern Ireland unions which could almost given them a majority. Not a strong mandate for them. Labour Prime Minister Harold Wilson, front left, at Newcastle Airport, 1967 (Photo: Newcastle Chronicle) So, another General Election? \nSimilar circumstances happened in 1974 when Labour’s Harold Wilson won the election in the February of that year but not an overall majority. He called a second election that year in October to get a stronger mandate to govern - and got a majority of three. \nIf no-one gets a majority we could yet go back to the polls to give the British public a second chance to get a majority Government. Read More", "external_links": [], "published": "2017-06-09T06:08:00.000+03:00", "crawled": "2017-06-09T01:16:16.003+03:00", "highlightTitle": ""}