{"organizations": [], "uuid": "4db54a085acd9a2a5f0a9cd6e6c0ed215ec91a5e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30380864/16037153.jpg", "site_section": "http://www.middevongazette.co.uk/business.rss", "section_title": "Devon Live Business RSS feed", "url": "http://www.devonlive.com/we-need-certainty-say-devon-business-leaders/story-30380864-detail/story.html", "country": "GB", "title": "We need certainty, say Devon business leaders", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-09T16:59:00.000+03:00", "replies_count": 0, "uuid": "4db54a085acd9a2a5f0a9cd6e6c0ed215ec91a5e"}, "author": "HannahFinch", "url": "http://www.devonlive.com/we-need-certainty-say-devon-business-leaders/story-30380864-detail/story.html", "ord_in_thread": 0, "title": "We need certainty, say Devon business leaders", "locations": [], "entities": {"persons": [{"name": "devon", "sentiment": "none"}, {"name": "michael beadel", "sentiment": "none"}, {"name": "philip letts", "sentiment": "none"}, {"name": "greg saunders", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "dale edwards", "sentiment": "none"}, {"name": "stephens scown", "sentiment": "none"}, {"name": "foot anstey", "sentiment": "none"}], "locations": [{"name": "great south west", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "somerset", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}], "organizations": [{"name": "somerset chamber of commerce", "sentiment": "none"}, {"name": "swig finance", "sentiment": "none"}, {"name": "tech south west", "sentiment": "none"}, {"name": "stephens scown llp", "sentiment": "none"}, {"name": "falmouth university", "sentiment": "none"}, {"name": "mole valley farmers", "sentiment": "none"}, {"name": "university of exeter", "sentiment": "none"}, {"name": "pennon group", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "We need certainty, say Devon business leaders By HannahFinch | Posted: June 09, 2017 0 COMMENTS SHARES Tech South West chairman Philip Letts said the success of the region's tech industry relies on political stability We need certainty, say Devon business leaders X \nCopy link to paste in your message / Tech South West chairman Philip Letts said the success of the region's tech industry relies on political stability Comments (0) \nThe region's business leaders are calling for stability in the wake of the General Election result . \nThey say uncertainty over the formation of the next government and leadership without a convincing mandate will add to the pressures of Brexit. \nAnd what the economy needs now is to stay focused on priorities. \nMichael Beadel, Chairman of Stephens Scown LLP, a partner in the Western Morning News' #BackTheSouthWest campaign , said: \"We face uncertainty over the form the next government will take and the knock on uncertainty over the Brexit process. The #BackTheSouthWest campaign is now more important than ever to ensure our voice is heard in Westminster.\" \nA prospectus for our Great South West, designed to showcase the region is currently being drawn up. It is the next stage of the #BackTheSouthWest campaign that has also seen the formation of the South West Business Leaders' forum - made up of chief executives of major businesses across all sectors. \nLast year, the campaign spearheaded by the Western Morning News and the Pennon Group and with support of the region's LEPs, culminated in the publication of the South West Growth Charter, which was delivered to Government. \nSome of the region's largest employers – Stephens Scown, Foot Anstey, Falmouth University, University of Exeter, SWIG Finance and Mole Valley Farmers – have joined the campaign that champions the region, aims to pool resources and take a unified voice to government. \nNow the task is to make the aspirations set out in the charter a reality. \nBut it needs a government ready to listen and respond. \nPhilip Letts, chairman of Tech South West and founder of the blur Group in Exeter, said: \"Economic and political uncertainty does not help our region's thousands of technology firms. We need reassurance around creating and supporting the environment we need to help our region's fastest growing sector to thrive, backing innovation, investment and talent for the long-term. \n\"The General Election result creates yet more uncertainty for businesses. Tech South West polled its members earlier this year and Brexit was a worry then. Today, we have multiple concerns. Delays on crucial Brexit negotiations, a Government with a weakened mandate, talk of coalitions and potentially another General Election. \" \nThe Somerset Chamber of Commerce has highlighted the need for an urgent refocus on business and the economy following the General Election result, saying there has been \"too much talk and not enough action\" in recent times. \nThe election on 8 June resulted in a hung parliament, with the Conservatives being the largest party but unable to secure a majority government. \nChairman Greg Saunders said: \"This is the outcome we least wanted or needed, with a hung parliament continuing the uncertainty that this country has faced over recent years. What everyone needs now, particularly the business community, is stability and clarity. \n\"There are substantial challenges facing the UK, not least the impending Brexit negotiations, and the politicians must quickly provide clarity on their direction and purpose. \n\"While the immediate attention of the new administration must be on securing the best possible outcome for the country during the Brexit negotiations, there are also significant issues that must be addressed within the UK. The economy needs to move back up the agenda, with improvements to our road, rail and broadband infrastructure – particularly here in Somerset and the South West – being fundamental to future business growth. \n\"There has been far too much talk and not enough action over recent years. The government must stabilise as quickly as possible and move on from the election, then refocus immediately on the needs of business, our economy and the country as a whole.\" \nConservative MPs were re-elected across Somerset. Commenting on the next steps for the Chamber, Chief Executive, Dale Edwards, said, \"The Chamber will be reaching out to Somerset's elected Members of Parliament over the next few days and we look forward to working closely with them for the benefit of our local and regional businesses. \n\"We will be drawing their attention once again to the Chamber's recently published manifesto, which outlines the priorities that will support and encourage a strong, vibrant Somerset economy. We will also be arranging meetings with each of them over the coming weeks to discuss the important topics covered within the manifesto and other business critical issues including Brexit and beyond. \n\"We now need a quick resolution from the political parties to provide much-needed stability, and we need politicians to stop using clichés and focus on supporting the economy to enable business growth.\" NEWS ", "external_links": [], "published": "2017-06-09T16:59:00.000+03:00", "crawled": "2017-06-09T12:39:11.002+03:00", "highlightTitle": ""}