{"organizations": [], "uuid": "1bd2648c40ee5b30d2201ce66721aff6079683ed", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30377540/16034844.jpg", "site_section": "http://www.middevongazette.co.uk/news.rss", "section_title": "Devon Live news RSS feed", "url": "http://www.devonlive.com/boris-johnson-visits-devon-on-last-day-of-election-campaign/story-30377540-detail/story.html", "country": "GB", "title": "Boris Johnson visits Devon on last day of election campaign", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-08T00:37:00.000+03:00", "replies_count": 0, "uuid": "1bd2648c40ee5b30d2201ce66721aff6079683ed"}, "author": "Devon Live", "url": "http://www.devonlive.com/boris-johnson-visits-devon-on-last-day-of-election-campaign/story-30377540-detail/story.html", "ord_in_thread": 0, "title": "Boris Johnson visits Devon on last day of election campaign", "locations": [], "entities": {"persons": [{"name": "boris johnson", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "sam blackledge", "sentiment": "none"}, {"name": "johnson", "sentiment": "none"}, {"name": "johnny mercer", "sentiment": "none"}, {"name": "johnny", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "sutton", "sentiment": "none"}, {"name": "becton dickinson vacutainer", "sentiment": "none"}, {"name": "roborough", "sentiment": "none"}, {"name": "oliver colvile", "sentiment": "none"}], "locations": [{"name": "devon", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}, {"name": "devonport", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "roborough", "sentiment": "none"}, {"name": "honiton", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "uxbridge", "sentiment": "none"}], "organizations": [{"name": "tory moor view", "sentiment": "none"}, {"name": "plymouth herald", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Boris Johnson visits Devon on last day of election campaign By Devon Live | Posted: June 07, 2017 By Sam Blackledge Comments (2) \nForeign Secretary Boris Johnson said he is 'fighting for every vote' in Plymouth as he visited the city on the final day of election campaigning. \nSpeaking to the Plymouth Herald during a visit to Becton Dickinson Vacutainer Systems in Roborough, Mr Johnson said the Labour Party has been \"captured by a tiny cell of crypto-communists from the loony London left\", and urged people to vote for Tory Moor View candidate Johnny Mercer. \n\"I'm here to campaign for the Conservative message,\" Mr Johnson said. \n\"I've been all over the country, Johnny got in touch with me ages ago asking me to come down. \n\"Of course we're fighting for every vote. We're not remotely complacent. \n\"The South West is crucial for everybody, I'm not going to deny that. It's a crucial part of the UK economy. \n\"We are fighting for every vote here, and I want to emphasise to voters in the South West this is a massive choice. \n\"I really think our country stands at a crossroads. If we go for Jeremy Corbyn and the Labour Party – and it's not really the Labour Party by the way, 75 per cent of his own MPs don't support him – it's a tiny cell of crypto-communists from the loony London left who have captured the Labour Party.\" \nRead more: Watch as Devon wind turbines are switched off...in 50mph winds \nMr Johnson was given a tour of the BD factory, meeting bosses and examining some of the medical technology the firm produces. \nAsked how Brexit will impact on Plymouth businesses, he said: \"We are absolutely confident that we will get a great deal. \n\"I've just actually been discussing this with the management and they are also very confident. \n\"At the moment they take in items from Singapore and from the US without any friction, without any barriers, and we are going to maintain a completely seamless, frictionless trade with the EU as well. \n\"The reason we can be confident about that is our EU friends have a £69bn a year trade surplus with us, so it's in their interests to keep this thing flowing smoothly. \n\"But it will liberate us at the same time to do free trade deals around the world.\" \nRead more: Man stabbed to death in Honiton named locally \nAsked if he wants to remain as Foreign Secretary after the election, and whether he has any ambitions to be Prime Minister, Mr Johnson said: \"I want to be elected. Like Johnny, neither of us are MPs at the moment. \n\"The job I'm after is MP. I'm campaigning to be returned in Uxbridge and South Ruislip, which is also very important.\" \nMr Johnson said he was \"bowled over\" by his brief visit to BD, which he described as \"a phenomenal success story of British manufacturing.\" \n\"This is a company with annual revenues of $12bn, huge investments around the world, and people don't know about it. \n\"They're seeing more investment come in, another £100million to develop this plasma separator gizmo stuff they've got going. It's incredibly encouraging. \n\"The other thing that's really struck me is the way the apprenticeship schemes we've been supporting have worked so well. \n\"Several employees joined as apprentices and have stayed with the company, been here for 17, 20 years. That's very encouraging to see how they're doing. \n\"What really strikes me about a company like this is that it's going gangbusters at the moment. What a shame it would be if it was to face huge hike in corporation tax.\" \nAfter his visit to Roborough, Mr Johnson took a tour of the Barbican and met with Sutton and Devonport candidate Oliver Colvile. \nReporting by Plymouth Herald. ", "external_links": [], "published": "2017-06-08T00:37:00.000+03:00", "crawled": "2017-06-07T20:26:03.001+03:00", "highlightTitle": ""}