{"organizations": [], "uuid": "588d7bfd2ccb5c7fe1fab97d56764f61f55ae721", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13186526.ece/ALTERNATES/s1200/DHR_CHS_270616frackingJPG.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/fracking-could-agenda-after-surprise-13186111", "country": "GB", "domain_rank": 21960, "title": "Fracking could be off the agenda after surprise election result", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-15T01:00:00.000+03:00", "replies_count": 0, "uuid": "588d7bfd2ccb5c7fe1fab97d56764f61f55ae721"}, "author": "Peter McCusker", "url": "http://www.chroniclelive.co.uk/business/business-news/fracking-could-agenda-after-surprise-13186111", "ord_in_thread": 0, "title": "Fracking could be off the agenda after surprise election result", "locations": [], "entities": {"persons": [{"name": "ferris", "sentiment": "none"}, {"name": "jon gluyas", "sentiment": "none"}, {"name": "david stroud", "sentiment": "none"}, {"name": "sammy wilson", "sentiment": "none"}, {"name": "ken cronin", "sentiment": "none"}, {"name": "lee rowley", "sentiment": "none"}, {"name": "jon ferris", "sentiment": "none"}, {"name": "hargreaves", "sentiment": "none"}, {"name": "rowley", "sentiment": "none"}, {"name": "peter mccusker", "sentiment": "none"}, {"name": "natascha engel", "sentiment": "none"}], "locations": [{"name": "mickle trafford", "sentiment": "none"}, {"name": "ukoog", "sentiment": "none"}, {"name": "usa", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "east antrim", "sentiment": "none"}, {"name": "bridge trafford", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "north sea", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "utilitywise", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "derbyshire north east", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "democratic unionist party", "sentiment": "none"}, {"name": "stormont", "sentiment": "none"}, {"name": "bellway", "sentiment": "none"}, {"name": "durham energy institute", "sentiment": "none"}, {"name": "durham university", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "future energy", "sentiment": "none"}, {"name": "ineos", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "dup", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Fracking could be off the agenda after surprise election result Conservative manifesto polity to back fracking could be under threat after party's failure to win a majority Share A 'Hoot and Toot' awareness event when Mickle Trafford residents joined up with the existing anti-fracking protest camp at Bridge Trafford close to a potential fracking site (Photo: PUBLICITY PIC) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe UK shale gas industry may struggle to get going and investment will be delayed. Peter McCusker reports on the impact of the Election on the energy sector. \nThe Conservatives are the only main British party to support fracking for shale gas in the UK . \nIts manifesto claimed Britain had the potential to ‘replicate the shale boom that has transformed the US energy landscape’. \nPlanning processes for shale developments would be streamlined and a higher share of tax revenues paid into a national ‘shale wealth fund’, for local communities in a bid to overcome opposition. \nHowever, the election result leaves that pledge, as with all of the party’s Manifesto promises, in the balance. \nWhilst it potential alliance partners the Democratic Unionist Party (DUP) are likely to support it, dissent in their own Tory ranks may stymie any bold policy moves with such a slim working majority. \nKen Cronin, chief executive of UKOOG, the representative body for the UK’s onshore oil and gas industry, says the ‘fundamentals of why we need shale gas are as strong today as they were last week.’ \nHe said: “84% of our homes use gas for heating and a significant number of UK industries, such as textiles, chemicals and beverages, relying on gas for feedstocks and energy.” \nHe went on to say UKOOG is ‘looking forward to working with the new government to help ensure that we realise our ambition to see a mix of energy sources produced here in the UK, which will reduce our dependency on imported energy, improve our balance of payments and create jobs’. Read More Bellway shrugs off election uncertainty as housing marker remains strong \nWhile a domestic shale industry would boost the UK energy security, Prof Jon Gluyas, executive director at the Durham Energy Institute (DEI) at Durham University , says ‘the evidence that the UK could replicate the US experience is close to zero’. \n“Our shales are gas rich but that is where the similarity ends. Extraction will be difficult due to unfavourable geological and geographical factors and societal opposition. In the last decade only a handful of wells have been drilled compared with the tens of thousands in the USA. \n“Moreover, not one of the UK wells has led to development of a shale-gas field.” \nAll of the main parties have signalled their ongoing support for the North Sea oil and gas industry and this is likely to continue as a central plank of energy policy. \nOne Conservative pledge was to ensure the UK has ‘the cheapest energy prices in Europe’. \nPrior to the release of its Manifesto the Conservative promised to deliver this with an energy price cap, by the time the Manifesto it arrived this pledge had been watered down, says David Stroud, chief executive of Newcastle supply company Future Energy. \nHe believes it is the wrong approach and highlights how market interventions will have to take ‘detailed account of the regulatory costs included in an energy bill’. \n“These are a large portion of domestic costs and are being further burdened by the ongoing delays to the smart meter rollout. \n“It would be much better to spend the time removing the barriers to entry for newer technologies and ideas rather than trying to identify where inefficiencies may lie because those new technologies will ultimately ensure the affordable and reliable energy we all require,” he said. Read More North East is UK leader in science and technology, new figures show \nJon Ferris, strategy director at one of the North East’s fastest growing companies, Utilitywise, says the minority Conservative Government needs to develop a collaborative Parliamentary approach. \n“It is time to restore business and domestic consumers’ confidence that there is still cross-party consensus for the direction of travel, and for policy that may last beyond the next election. \n“It is hard to see how to achieve the ambition of the lowest energy prices in Europe without making full use of the UK’s abundant wind resource, where the generation technology is mature and competitive with fossil fuel generation. \n“While the UK remains dependent on imported gas, the production of domestic shale gas would have limited impact on prices, and would not replicate the transformation of the US energy sector. \n“While there may be some fiscal benefit to producing more gas domestically, it would have limited impact on decarbonising electricity generation as the share of coal has already declined substantially.” \nThe energy industry is awaiting the publication of the Government’s Clean Growth Plan which will set out carbon emission reduction targets over the coming decades. \nMr Ferris added: “It is unclear how much of the Conservatives’ Manifesto for energy will be enacted during this parliament, given their lack of majority and pressures on parliamentary time due to Brexit, but any further interventions should result from a long-term strategy for the energy sector. \n“The energy industry has long been waiting for the Clean Growth Plan to set out the policies to achieve the fourth and fifth carbon budgets, and for the Industrial Strategy Green Paper and Smart, Flexible call for evidence to be translated into policy.” \nIF the Conservatives press ahead with their shale gas plans they are likely to get support from their alliance partners the Democratic Unionist Party (DUP). Read More Hargreaves continues to diversify away from coal by creating new energy business \nNorthern Ireland is the only part of the UK not to have its own legally binding targets to cut carbon emissions. \nIn 2008 the DUP appointed Sammy Wilson as environment minister and he was re-elected to the East Antrim constituency last week by a margin of more than 15,000. \nShortly after taking office he called climate change a ‘giant con’ a ‘waste of billions of pounds’, saying it is surrounded by a degree of ‘fairly uninformed hysteria’. \nHe backs fracking, and recently said: “The UK needs to fully exploit the natural resources available to it.” \nBut the Conservatives may have shale as issues closer to home; in Derbyshire North East, the anti-fracking Conservative candidate Lee Rowley beat pro-fracking Labour incumbent Natascha Engel by just under 3,000 votes. \nHydrocarbon processing company Ineos has applied for planning permission for a drilling rig in the constituency to assess its suitability for fracking. \nBut the company’s path may have become slightly more rocky with Mr Rowley as MP, and the Conservative party short of an overall majority. \nThe DUP’s record in the energy sector was recently tarnished by the scandal over the scale of subsidies it hands out under the Renewable Heat Incentive, which has led to the suspension of Stormont, the Northern Irish parliament. Like us on Facebook", "external_links": [], "published": "2017-06-15T01:00:00.000+03:00", "crawled": "2017-06-14T20:29:52.004+03:00", "highlightTitle": ""}