{"organizations": [], "uuid": "7fa846509ee9409b9a5d80a56e2a42af4c2070a3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article13223362.ece/ALTERNATES/s1200/JS123371049.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/more-needs-spent-protect-uk-13223169", "country": "GB", "domain_rank": 21960, "title": "More needs to be spent to protect the UK in 'deeply troubling and dark times', MPs say", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-22T20:03:00.000+03:00", "replies_count": 0, "uuid": "7fa846509ee9409b9a5d80a56e2a42af4c2070a3"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/more-needs-spent-protect-uk-13223169", "ord_in_thread": 0, "title": "More needs to be spent to protect the UK in 'deeply troubling and dark times', MPs say", "locations": [], "entities": {"persons": [{"name": "jones", "sentiment": "none"}, {"name": "mrs trevelyan", "sentiment": "none"}, {"name": "kevan jones", "sentiment": "none"}, {"name": "catherine mckinnell", "sentiment": "none"}, {"name": "anne-marie trevelyan", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "chi onwurah", "sentiment": "none"}, {"name": "theresa may share theresa may", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "westminster", "sentiment": "none"}, {"name": "usa", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "north durham", "sentiment": "none"}], "organizations": [{"name": "ministry of defence", "sentiment": "none"}, {"name": "newcastle central", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "nato", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}, {"name": "pa", "sentiment": "none"}, {"name": "newcastle north", "sentiment": "none"}, {"name": "navy", "sentiment": "none"}, {"name": "royal marines", "sentiment": "none"}, {"name": "berwick", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "royal navy", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News More needs to be spent to protect the UK in 'deeply troubling and dark times', MPs say Defence cuts make the UK less safe in dangerous times, both Labour and Conservative MPs tell Prime Minister Theresa May Share Theresa May, Kevan Jones and Anne-Marie Trevelyan Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nLabour and Conservative MPs have warned Theresa May the armed forces need more resources to protect the UK in “deeply troubling and dark times”. \nKevan Jones, a Labour former defence minister, and Anne-Marie Trevelyan, a Conservative MP, both said more funding was needed. \nThey spoke in the House of Commons following the Queen’s Speech , in which the Government set out its plans for the next two years. Prime Minister Theresa May (Photo: PA) \nPrime Minister Mrs May has said the UK will meet its commitment to spend 2% of national income on defence. This is a target agreed by all members of NATO, the transatlantic defence treaty including the USA, Canada and a number of European countries. \nBut North East MPs said this may not be enough. \nMr Jones, Labour MP for North Durham, said that “years of squeezed budgets” had damaged the UK’s military capabilities and the army was now smaller than at any time since the early 19th century. Kevan Jones, Labour MP for North Durham (Photo: PA) \nHe said: “The Navy faces a manning crisis, and the number of new warships being ordered is at an all-time low. Some of the operations that it should be doing can no longer be done. \n“We are proud of the work done by the Royal Marines for the sake of this country, but the numbers of Royal Marines are to be cut to fill the manning gaps at the Royal Navy.” \nHe warned: “The Ministry of Defence faces a multi-billion pound black hole in its budget. If it is not faced up to shortly, it will affect the way in which this country can protect itself.” Members of the army join police officers in Westminster, London (Photo: PA) \nMr Jones said the UK needed a strong armed forces, saying: “The events of the past few weeks have shown that we live in deeply troubling and dark times, both at home and abroad.” Read More How will the Queen's Speech affect you? We look at the key points \nAnd concerns were also raised by Mrs Trevelyan, Conservative MP for Berwick-upon-Tweed , who said the 2% spending target may not be enough. \nShe told the House of Commons: “I shall be raising questions about whether that 2% is really enough.” Conservative MP for Berwick Anne-Marie Trevelyan \nThe MP added: “We can and perhaps should be doing much more to ensure that the Treasury can support the Ministry of Defence in the work it has to do.” \nMrs Trevelyan said: “If, in this Year of the Navy, we are to ensure that we can afford to build the ships we need to protect our nation’s interests in conflict and in peace, we must be honest about what it will take to do so.” Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nOther North East MPs raised a series of concerns about the Government’s plans, and urged the Government to ensure the region was protected as Brexit takes place. \nChi Onwurah, Labour MP for Newcastle Central, said: “Theresa May is still hell-bent on a destructive hard-right Brexit and further cuts that will destroy jobs and public services in Newcastle and elsewhere.” Chi Onwurah (Photo: Newcastle Chronicle) \nAnd Catherine McKinnell, Labour MP for Newcastle North, told MPs that the North East must be consulted as talks between the UK and the EU begin. \nShe said: “I understand that ad hoc meetings may have taken place, but there is still no commitment from the Government on how they will properly engage with the North East on its priorities for the Brexit negotiations throughout this historic process. \n“Nor is there any clear means or a forum for that to take place.” Like us on Facebook", "external_links": [], "published": "2017-06-22T20:03:00.000+03:00", "crawled": "2017-06-22T16:09:35.000+03:00", "highlightTitle": ""}