{"organizations": [], "uuid": "663f686028d1abc360ba27f3468be6f0b7db8a9d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article13159706.ece/ALTERNATES/s1200/humb.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/long-wait-northumberland-count-under-13159664", "country": "GB", "domain_rank": 21960, "title": "Long wait in Northumberland as count is under way in General Election", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-09T09:51:00.000+03:00", "replies_count": 0, "uuid": "663f686028d1abc360ba27f3468be6f0b7db8a9d"}, "author": "Michael Muncaster", "url": "http://www.chroniclelive.co.uk/news/north-east-news/long-wait-northumberland-count-under-13159664", "ord_in_thread": 0, "title": "Long wait in Northumberland as count is under way in General Election", "locations": [], "entities": {"persons": [{"name": "jeremy corbyn", "sentiment": "none"}, {"name": "jeff reid", "sentiment": "none"}, {"name": "ian lavery", "sentiment": "none"}, {"name": "geoff paul", "sentiment": "none"}, {"name": "lavery", "sentiment": "none"}, {"name": "ronnie campbell", "sentiment": "none"}, {"name": "campbell", "sentiment": "none"}, {"name": "blyth", "sentiment": "none"}, {"name": "anne-marie trevelyan", "sentiment": "none"}, {"name": "chris galley", "sentiment": "none"}, {"name": "guy opperman", "sentiment": "none"}, {"name": "galley", "sentiment": "none"}], "locations": [{"name": "northumberland", "sentiment": "none"}, {"name": "blyth valley", "sentiment": "none"}, {"name": "wansbeck", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "berwick", "sentiment": "none"}, {"name": "morpeth", "sentiment": "none"}, {"name": "hexham", "sentiment": "none"}, {"name": "blyth sports centre", "sentiment": "none"}], "organizations": [{"name": "blyth sports centre  voter", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}, {"name": "lib dem", "sentiment": "none"}, {"name": "the labour party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Long wait in Northumberland as count is under way in General Election Counting is under way in Northumberland but a long wait is expected before any results are confirmed Share Click to play Tap to play The video will start in 8 Cancel Play now     \nThe counting was today under way to determine the four MPs who will represent Northumberland . \nPeople from across the county turned out to 228 polling stations yesterday to cast their votes. \nReturning officer Geoff Paul has been overseeing the count at Blyth Sports Centre since 10pm last night. The first round of ballot boxes began arriving at around 10.10pm. \nLabour leader Jeremy Corbyn campaigned in Blyth Valley just days before the election and the party’s candidate Ronnie Campbell is confident he will hold onto the seat. \nMr Campbell, who has held the post since June of 1987, said: “I’m feeling easy - the way I do before any election. \n“It is going to be a funny election. When I’ve been on the doors, I go to a council estate and they say they are voting Tory. \n“I go to a private estate and they are voting Labour. It is a mixed bag really. With no UKIP this year, it will be interesting to see where the votes go.” Anne-Marie Trevelyan (left) and the count under way at Blyth Sports Centre \nVoter turnout was up from 60.1% in 2015 to 67%. \nBut Lib Dem’s Blyth Valley candidate Jeff Reid predicts a bleak outcome for his party, saying “we won’t have a good night”. \n“Blyth is not going to be very good for us and we might be on about 6%,” he said. \n“It is the return of two party politics. All our helpers are tired and we’ve got limited resources. Nobody was expecting this election.” \nIn Wansbeck, Labour’s Ian Lavery claimed a landslide victory in 2015 with 19,267 votes - approximately half of the total votes cast. \nHe said: “I have been very blessed with this constituency and I’m welcomed regardless of the towns or villages I’m in. \n“I think it is the best in the country and hopefully they think that I’m the best MP to represent them.” Read More General Election 2017 North East results in full: How North East constituencies voted \nMr Lavery is standing against Conservative Chris Galley, who came second in 2015 with 8,386 votes. \nMr Galley said: “It has been an interesting campaign and we’ve had a good response in Morpeth. \n“It maybe too early for me to be the next MP but we are making progress in the right direction. \n“The Labour Party is slowly loosing its grip in the North East and it is changing.” Read More Follow the General Election 2017 results and updates on our interactive map \nMeanwhile, Conservative Anne-Marie Trevelyan, who is standing in Berwick, is confident the constituency will remain blue. \n“We’ve had a great campaign and there was a lot of support for Brexit in Berwick so we hope to have done really well,” she said. \n“I hope the people support me to carry on the projects that I have started so we can keep them going.” \nIn Hexham, Guy Opperman won with an overall majority in 2015, but barring any shock voting, he expects to retain the seat. Read More", "external_links": [], "published": "2017-06-09T09:51:00.000+03:00", "crawled": "2017-06-09T05:28:17.015+03:00", "highlightTitle": ""}