{"organizations": [], "uuid": "f86ba16c55bfccc3656111b70fdc71289e0c0214", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article13160735.ece/ALTERNATES/s1200/General-Election-2017-aftermath.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/disaster-theresa-general-election-gamble-13161082", "country": "GB", "domain_rank": 21960, "title": "Disaster for Theresa May as her general election gamble backfires spectacularly", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-09T14:46:00.000+03:00", "replies_count": 0, "uuid": "f86ba16c55bfccc3656111b70fdc71289e0c0214"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/disaster-theresa-general-election-gamble-13161082", "ord_in_thread": 0, "title": "Disaster for Theresa May as her general election gamble backfires spectacularly", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "hull", "sentiment": "none"}, {"name": "emily thornberry", "sentiment": "none"}, {"name": "george osborne", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "tim farron", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "tom watson", "sentiment": "none"}, {"name": "boris johnson", "sentiment": "none"}, {"name": "bridget phillipson", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "teesside", "sentiment": "none"}, {"name": "houghton", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "north east  the north east", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "sheffield", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}], "organizations": [{"name": "bbc", "sentiment": "none"}, {"name": "liverpool", "sentiment": "none"}, {"name": "leeds", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "sunderland south", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}, {"name": "sky news", "sentiment": "none"}, {"name": "labour and conservative", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "snp", "sentiment": "none"}, {"name": "northern powerhouse", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Disaster for Theresa May as her general election gamble backfires spectacularly Theresa May could be one of the UK's shortest-serving Prime Ministers after her snap-election gamble backfired Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nTheresa May’s gamble in calling a general election ended in disaster after her Conservatives failed to win a majority in the 2017 general election. \nAs the votes continued to be counted, it appeared the UK was heading for a hung Parliament- and she would have to resign. \nThe Conservatives are set to be the largest party with around 317 seats, a loss of 13 seats and short of the 326 needed for a majority in the House of Commons. \nLabour were expected to win around 262 seats. \nA Government without a majority cannot be sure of winning crucial votes on their programme for government or Budget proposals. \nLiberal Democrats have ruled out a Coalition with the Tories. It raises the prospect of Mrs May, the Prime Minister and Conservative leader, attempting to lead a weak and unstable government as she embarks on Brexit negotiations with the EU. \nThe result plunged British politics into chaos. Theresa May could be forced to call another election. \nAnd she may come under pressure to resign and make way for a new Conservative leader. \nCalls for Theresa May to quit as snap election delivers hung parliament \nMeanwhile, Labour politicians said their party could attempt to form a government instead, making Labour leader Jeremy Corbyn Prime Minister. \nLabour leader Jeremy Corbyn said Mrs May should “go and make way for a government that is truly representative of this country”. \nMrs May said: “The country needs a period of stability and whatever the results are the Conservative Party will ensure we fulfil our duty in ensuring that stability so that we can all, as one country, go forward together.” \nHer reference to the Conservative Party - rather than to her personally - left it unclear whether she intended to carry on as Prime Minister. \nAnd senior Tory politicians such as Boris Johnson refused to say they had confidence in her, when they were questioned early on Friday morning. \nThere was shock as an exit poll was published by Sky News, ITV and the BBC at 10pm on the day of the election, as soon as polling stations closed. \nIt suggested that Theresa May’s party would have 314 seats, below the 326 they need for a majority. \nLabour were set to win 266 seats, the exit poll suggested. \nAnd a result along these lines is a disaster for Conservative leader and Prime Minister Theresa May , who chose to call an early general election in an attempt to increase her majority in the House of Commons. Liberal Democrats rule out a new coalition \nAs the largest party in a hung Parliament, you’d expect the Conservatives to lead the government. In the hung Parliament following the 2010 general election, they did this by forming a Coalition with the Liberal Democrats. \nThis time, that may be impossible. \nLib Dem leader Tim Farron has said he will not be part of any Coalition. \nAnd a Lib Dem spokesman confirmed last night: “No coalitions. No deals.” \nYou can understand why. Voters punished the Lib Dems for the last coalition, and their vote collapsed. \nWhat’s more, the Lib Dems are against Brexit - and Mrs May, of course, has presented herself as Brexit’s champion. \nIt’s hard to see how they could do a deal. \nLabour say they could form a Government and make Jeremy Corbyn Prime Minister \nLabour Shadow Foreign Secretary Emily Thornberry said early this morning that Labour would refuse to do a deal with any parties, but would put forward a programme for government and just expect other parties to back it. \nIf parties such as the Lib Dems, Greens or SNP voted Labour’s plans down then they would effectively be allowing the Conservatives into government, she said. \nOn that basis, it’s possible that Labour could actually form a government with Jeremy Corbyn as Prime Minister. The experts were proved wrong \nTrump, Brexit and now this. \nThis is an era of shocks in politics. \nThe political establishment - the experts, the media and most politicians - have got it wrong time after time. \nAnd when broadcasters published their general election exit polls at 10pm last night, it appeared they were wrong again. \nThe exit poll showed the UK was heading for a hung Parliament. \nBoth Labour and Conservative politicians had said during the campaign that they believed the Conservatives would make gains in this election. \nBut it seemed they were wrong. \nThey weren’t alone. The media were also taken completely by surprise. \nBut it’s happened before - when Donald Trump was elected president, and when the UK voted to leave the EU. \nPolitics is changing in a way that they people who think they know it all just don’t seem to understand. Can Theresa May carry on as Prime Minister? Prime Minister Theresa May (Photo: PA) \nMrs May said on Twitter on May 20: “If I lose just six seats I will lose this election and Jeremy Corbyn will be sitting down to negotiate with Europe.” \nIt turns out she’s lost more seats than that. So must she resign as Prime Minister? \nIt’s not true that the Tories losing seats puts Jeremy Corbyn in charge. \nIt just means the Conservatives have lost their majority in the House of Commons, but they remain the largest party in a hung Parliament. \nHowever, Labour’s deputy leader Tom Watson reminded Mrs May of her promise. \nHe said: “We’re going to hold her to that.” \nThere’s another problem for Theresa May. \nHer own party may be furious at her, both for calling and unnecessary election and for running a lousy campaign. \nBridget Phillipson, re-elected Labour MP for Houghton and Sunderland South, said: “Theresa May must have fancied her chances and wouldn’t have called a snap election if she didn’t think she was in with a chance of increasing her majority. \n“Maybe history tells us that prime ministers should be a bit more careful in taking those kinds of decisions because there is precedent where you can end up with egg on your face.” \nAnd a lot of Tory MPs will agree. \nWill they forgive her? George Osborne, the former Tory Chancellor, said the mood in the party “will quickly turn to anger”. \nIt’s been a good campaign for the North East \nThe North East has been ignored in previous election campaigns. \nNot this time. \nConservative Theresa May was in the region twice while Labour leader Jeremy Corbyn conducted something of a tour of the region, visiting Northumberland, Country Durham, Gateshead and Teesside. \nIt’s good news for the region if the national party leaders are forced to pay attention to us. Long may it continue. \nBut it seemed to be bad news for Labour. The focus on the North East reflected a belief that the Conservative Party could, possibly, win seats in the region that had always been solidly Labour in the past. What does this result mean for the North? \nWe don’t know - because the Tories might have to do a deal with another party to be able to govern, or might not be able to govern at all. \nBut we know what was in the Tory manifesto. \nWe could get a new rail line. The Conservative manifesto included a commitment to build a “Northern Powerhouse rail” line, expected to link Liverpool, Manchester, Leeds, Hull, Sheffield and Newcastle. \nIt also said the Government would move civil servants out of London, creating jobs in other regions, and force Channel 4 to move its headquarters out of London, even though the broadcaster wants to stay where it is. \nLocal politicians are expected to campaign to try to get Channel 4 moved to Newcastle. \nThe manifesto promised £8billion extra for the NHS and £4 billion for schools. \nBut it also promised to take away some perks away from middle class people. \nPrimary school pupils from wealthier families will lose the right to free school meals, and the winter fuel allowance of up to £300 will be taken away from all but the poorest pensioners. \nThere will also be an increase in the contribution many elderly people are expected to make to the cost of social care in their home, the so-called dementia tax, although Mrs May was forced to promise during the election campaign that this will be watered down. What does it mean for Jeremy Corbyn? \nJeremy Corbyn ran a good election campaign. \nWith hindsight, that shouldn’t be a surprise. He proved he was a good campaigner during the 2016 Labour leadership contest. \nIt’s worth remembering that it does look like Labour lost, in the sense that it came second. \nBut the fact that he managed to make gains, and deny the Conservatives a majority, means his position as Labour leader is safe. His enemies within the Labour Party won’t try to remove him now. \nWhether he actually wants to carry on as Labour leader until the next election remains to be seen. \nWhat nobody can guess at this stage is whether Theresa May’s Conservatives will manage to form a stable government - or whether there really is a chance of Mr Corbyn becoming Prime Minister. How much did the collapse of UKIP help Theresa May? \nIn the 2015 general election, UKIP gained 12.6% of the vote. And in the North East, UKIP got 16.7% of the vote. \nMany people had expected UKIP’s vote to collapse this time. That seems to be what’s happened. \nConservatives also expected the UKIP vote to move to them. \nBut it seems that former UKIP voters are split - and a large minority of them have chosen to vote Labour. \nIt means Theresa May’s plan for winning the general election just hasn’t worked. Like us on Facebook ", "external_links": [], "published": "2017-06-09T14:46:00.000+03:00", "crawled": "2017-06-09T10:24:28.002+03:00", "highlightTitle": ""}