{"organizations": [], "uuid": "ae694f7d9c8eedeba941827dde5534dc3bfb9d3f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article13146921.ece/ALTERNATES/s1200/IBP_NEC_060617boris_03JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/boris-johnson-launches-fresh-attack-13146730", "country": "GB", "domain_rank": 21960, "title": "Boris Johnson launches fresh attack on 'soft and muddle-headed' Jeremy Corbyn on North East visit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-06T23:57:00.000+03:00", "replies_count": 0, "uuid": "ae694f7d9c8eedeba941827dde5534dc3bfb9d3f"}, "author": "Katie Dickinson", "url": "http://www.chroniclelive.co.uk/news/north-east-news/boris-johnson-launches-fresh-attack-13146730", "ord_in_thread": 0, "title": "Boris Johnson launches fresh attack on 'soft and muddle-headed' Jeremy Corbyn on North East visit", "locations": [], "entities": {"persons": [{"name": "boris johnson", "sentiment": "negative"}, {"name": "jeremy corbyn", "sentiment": "negative"}, {"name": "johnson", "sentiment": "none"}, {"name": "helen goodman", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "galtieri", "sentiment": "none"}, {"name": "chris turner", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "northumbria", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}, {"name": "shildon civic hall in county durham", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "shildon", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "hamas", "sentiment": "none"}, {"name": "tories", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "ira", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "chronicle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "bishop auckland", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily   Thank you for subscribing! Could not subscribe, try again later Invalid Email \nBoris Johnson promised a “fantastic future” for the North East if the Tories are voted back in as he visited the region two days before the general election. \nThe foreign secretary delivered a speech at Shildon Civic Hall in County Durham as the Conservatives attempted to revitalise their flagging election campaign. \nHis arrival was marked by crowds of protestors, carrying signs in support of Labour’s Bishop Auckland candidate Helen Goodman and shouting “Tories out”. Labour supporters outside Shildon Civic Hall in County Durham where Boris Johnson was giving a speech (Photo: Newcastle Chronicle) \nBut the Conservative MP avoided the demonstrators twice by arriving via the back door and leaving through the front door. \nSpeaking to the Chronicle , he said the North East had “a fantastic future” and was “one of the great centres of innovation”. \nHe said: “It is about jobs, growth and understanding there is not a magic money tree.” Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nMr Johnson was also asked if he thought the North East could cope with a terror attack in the wake of cuts to armed officers between 2010 and 2016 - 15% across Durham and Northumbria forces. \nHe did not comment on the North East but said that the Tories will invest 30% more into counter terrorism and ‘a lot more’ into armed police. \nChallenged over cuts in police numbers following his speech in Shildon, Mr Johnson said: “Every year I was mayor in London we were able to keep police numbers at or around 32,000 and I think they’ve been higher in our period in office than virtually every year Labour was in office in the 13 years before then. Boris Johnson during a speech at Shildon Civic Hall in County Durham (Photo: Newcastle Chronicle) \n“We are investing in counter-terrorism, we are putting 1,900 more into our counter-terrorist operations as well as putting more armed police officers out on the street.” \nMr Johnson also launched a fresh attack on Jeremy Corbyn during his speech — the day after the Labour leader drew giant crowds to hear him speak in Gateshead - calling him “soft and muddle-headed”. Read More Boris Johnson's North East visit LIVE: Foreign secretary challenged over the Tories' police cuts \nBrexit was the key theme of the speech, with Mr Johnson saying negotiations would “founder” if Thursday’s General Election resulted in a coalition government led by Jeremy Corbyn, claiming the “herbivorous” Labour leader would be “eaten for breakfast” by Brussels bureaucrats. Boris Johnson during a speech at Shildon Civic Hall in County Durham (Photo: Newcastle Chronicle) \nHe warned: “For 30 years, (Corbyn) has been soft and muddle-headed on terror. He has been soft and muddle-headed on defence. He has taken the side of just about every adversary this country has had in my lifetime, from the IRA to Hamas, from Soviet communism to General Galtieri. \n“I don’t mean to compare our European friends to any of these people, but it is psychologically impossible to imagine him having the grip or the firmness to get the right Brexit deal for this country.” Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nMr Johnson said that there were “plenty of people in Brussels and some in this country who have spent night and day since June 23 dreaming, hoping, scheming and plotting that they will be able to reverse that decision”. \nHe asked: “Do we want them to frustrate the will of the people? Do we want them to overturn our democratic decision of last year? Do we want them to frustrate Brexit? I don’t think we do.” Read More See Boris Johnson dodge protestors following County Durham appearance \nOne protestor outside the civic hall, Chris Turner, said: “This election is very important in saving the NHS, with the Tories planning more cuts. \n“Last year Boris Johnson promised an extra £350m a week for the NHS if we left the EU - 24 hours later he said this was not the case. \n“How can we believe him now?” \nBut Mr Johnson denied this, saying, “He says: “There’s only one way to get any of our money back and that’s to make sure we leave.” Like us on Facebook", "external_links": [], "published": "2017-06-06T23:57:00.000+03:00", "crawled": "2017-06-06T19:25:51.001+03:00", "highlightTitle": ""}