{"organizations": [], "uuid": "bbd04e3c3de2e5effa1bd1c16b2489b98d661211", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article13143044.ece/ALTERNATES/s1200/PROD-Theresa-May-Resumes-The-Conservative-Party-Election-Campaign.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/know-how-feels-want-just-13143040", "country": "GB", "domain_rank": 21960, "title": "I know how it feels to want to just slink off the stage. It looks like Theresa May does too", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-07T01:00:00.000+03:00", "replies_count": 0, "uuid": "bbd04e3c3de2e5effa1bd1c16b2489b98d661211"}, "author": "chroniclelive.co.uk", "url": "http://www.chroniclelive.co.uk/news/north-east-news/know-how-feels-want-just-13143040", "ord_in_thread": 0, "title": "I know how it feels to want to just slink off the stage. It looks like Theresa May does too", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "wansbeck", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "paul benneworth", "sentiment": "none"}, {"name": "cameron", "sentiment": "none"}], "locations": [{"name": "metro", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "vienna", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "ashington", "sentiment": "none"}], "organizations": [{"name": "nasty party", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "big society", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Opinion I know how it feels to want to just slink off the stage. It looks like Theresa May does too Tyneside-born Dutch academic Paul Benneworth on how the Conservatives are running out of energy in the election race Share Theresa May (Photo: Getty Images Europe) Share Get daily   Thank you for subscribing! Could not subscribe, try again later Invalid Email \nMy attitude to elections was scarred by my experiences in standing as a school class representative. I’m happy with my own opinions and ideas but, since that disaster, I’ve never felt the need to try impose them on others at the ballot box. \nI’m a terrible salesman, and I’ve never been good at closing the deal. I can remember all too well the awful sinking feeling at a conference trying to persuade university managers to want to understand their performance rather than just selling them another league table. \nStanding on stage in Vienna was one of my worst professional experiences. The slow ebb then collapse of energy, motivation and self-confidence in the face of sceptical and increasingly hostile faces stayed with me ever since. \nI was delighted when the chair banged the hammer to end the day and put me out of my misery, letting me slink off into the background. I was a wreck, emotionally drained, stunned and embarrassed at it getting so out of control. \nWatching Theresa May’s election campaigning in recent weeks, I get the sense she’s going to be delighted when she can finally slink off stage. \nShe was nicknamed “Submarine” by civil servants in her time at the Home Office for her unerring ability to dive into the depths as trouble approached, only emerging once more once others had taken the blame. \nThe Tories have so long been used to blowing their racist dogwhistles to get votes scurrying to them that they seem to be collapsing as their ill-thought through plans collapse around them. And her submarine dived once more in the face of hostile reception to her election plans, crying off appearances at leadership debates, while not even deigning to answer interviewers’ questions. \nShe seems in denial about the state of the country today, with her government’s cuts leaving the NHS, schools, policing and even elderly home care facing collapse. Cameron’s Big Society has millions of hard-working families using foodbanks and trapped in zero-hours contracts as they presided over a 10% slump in real wages since their election. \nSo when they called for immigration controls, dementia tax and a return to fox hunting, no one doubted that Theresa May was the new face of the Nasty Party. And, as voters’ antipathy to the Invisible PM grew, so they have slowly started warming to the Labour Party’s well-costed constructive manifesto. Read More Five things we learnt from Jeremy Corbyn's visit to the North East \nListening to the Shadow Chancellor setting out his plans for the North East two months ago, it’s hard to understand how we could oppose them. A regional investment bank might make up for the gaping hole left when the Tories senselessly trashed the regional development agency, and I’ve long supported extending the Metro to Ashington to drive Wansbeck’s revival. \nThe offshore tax dodgers running the gutter press might not want you to hear it, but Labour have a message of hope, for the North East and the whole country. We remain a rich country and, as long as we look after each other and not the fat cats, we can afford to offer dignity for all. \nA Labour victory might even get a Brexit pause to pull back from economic suicide, and stop Theresa May’s government zombie shuffle to a “no deal” Brexit. Read More Jeremy Corbyn in the North East - 'they wrote us off didn't they' he tells cheering crowd \nAnd you sense that Corbyn is picking up energy from his audience’s reaction to his ideas, not yet enthused but willing to give him a hearing. \nAs a human being, I feel for Theresa May, and the humiliation and exhaustion her election campaign debacle is heaping on her. \nSo I urge you to do the decent thing on Thursday, bring the curtain down on these unloved Tory scoundrels, and allow our PM to slink off for much-needed recuperation. Read More", "external_links": [], "published": "2017-06-07T01:00:00.000+03:00", "crawled": "2017-06-06T20:50:25.021+03:00", "highlightTitle": ""}