{"organizations": [], "uuid": "7ba867b24cc73fd08afa09c5ffc39c4638b61f25", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bostonstandard.co.uk", "main_image": "http://res.cloudinary.com/jpress/image/fetch/w_300,f_auto,ar_3:2,c_fill/http://www.skegnessstandard.co.uk/webimage/1.7996416.1496824673!/image/image.jpg", "site_section": "http://www.skegnessstandard.co.uk/rss/cmlink/1.346949", "section_title": "Skegness Standard MSKP.news.feed", "url": "http://www.bostonstandard.co.uk/news/general-election-boston-and-skegness-candidates-final-plea-to-voters-1-7996423", "country": "GB", "title": "GENERAL ELECTION: Boston and Skegness candidates final plea to voters", "performance_score": 0, "site": "bostonstandard.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-07T16:38:00.000+03:00", "replies_count": 0, "uuid": "7ba867b24cc73fd08afa09c5ffc39c4638b61f25"}, "author": "", "url": "http://www.bostonstandard.co.uk/news/general-election-boston-and-skegness-candidates-final-plea-to-voters-1-7996423", "ord_in_thread": 0, "title": "GENERAL ELECTION: Boston and Skegness candidates final plea to voters", "locations": [], "entities": {"persons": [{"name": "mike gilbert", "sentiment": "none"}, {"name": "phil smith", "sentiment": "none"}, {"name": "victoria percival  matt warman", "sentiment": "none"}, {"name": "rudd", "sentiment": "none"}, {"name": "paul nuttall", "sentiment": "none"}, {"name": "skegness", "sentiment": "none"}, {"name": "paul nuttall", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "john mcdonnell", "sentiment": "none"}, {"name": "paul kenny", "sentiment": "none"}, {"name": "diane abbott", "sentiment": "none"}, {"name": "david cameron", "sentiment": "none"}, {"name": "paul kenny", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "philip smith", "sentiment": "none"}, {"name": "victoria percival", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "boston", "sentiment": "none"}, {"name": "brexit britain", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "pilgrim hospital", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "great britain", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}, {"name": "wesminster", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "westminster", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "skegness academy", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}, {"name": "haven high", "sentiment": "none"}, {"name": "green party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "- Education \nMIKE GILBERT (BLUE REVOLUTION) – The reception we have received on doorsteps has been positive. People feel there is something wrong with politics. Standing has confirmed how the party system works against the interests of taxpayers and workers. Politicians of the left and right only talk about fixing a broken system that relies on indebtedness and waste they don’t seem to understand how to change it. Politicians go on taxing and spending whilst democracy is diminished and the expensive structures of the state are maintained in times of reduced national income and increasing debt. At its worst, this system ignores the needs of ordinary people and gave us the EU, banking crisis, the war in Syria, cultural unemployment and student debt instead. Outside the EU we can put our house in order. If you agree with me that revolutionary change is necessary please vote for me and help me keep my deposit. Victoria Percival \nMATT WARMAN (CONSERVATIVE) – This election is a straight choice: Theresa May has a clear plan for Brexit that sees us managing our own migration policy, doing our own trade deals and making sure that Brussels never takes precedence over Westminster. And she also has a plan that will make sure the British economy continues to produce the jobs and growth we need. We will train more British doctors for our NHS, and tackle the local challenges around funding our schools, our police, our broadband and our roads. It’s an optimistic plan for a Great Britain standing tall on the world stage. The alternative is Prime Minister Jeremy Corbyn, Home Secretary Diane Abbott and Chancellor John McDonnell. That’s a Prime Minister who voted against counter terrorism measures, a Home Secretary who can’t count and a Chancellor who believes a magic money tree will pay for vital public services. The choice couldn’t be clearer. Britain needs Theresa May at helm, and a vote for me will help secure this. \nVICTORIA PERCIVAL (GREEN PARTY) – Some say you can’t afford ethics in business and politics. The last prime minster, David Cameron, thought it was morally OK to use legal off shore accounts and not be contributing to the pot, while cutting public services. Amber Rudd said it’s ‘business’ to sell arms to a country on the human rights watch list.UKIP think investing in renewables are a waste of money despite every creditable scientist saying climate change is the biggest threat to the next generation, way more than immigration. We are told Boston and Skegness is a safe Conservative seat and always will be. We had a ‘meet the Green Party’ and people told us they are fed up, they want change. They want politicians to tell the truth, they want politicians to be fair, treat people equality. A vote for the Green Party is a vote for different politics. If you have any questions please email me victoria.percival@greenparty.org.uk \nPAUL KENNY (LABOUR) – This election is our chance to ensure a post Brexit Britain is one for the many and not one that only benefits a wealthy few. The Tory manifesto will see the few do very well, whilst in Boston and Skegness 82 per cent of pensioners, that’s 21,240 people, will lose winter fuel payments as May having squeezed working families dry turns on them. How can we be successful as a country when we starve our schools of the resources needed to give our children and grandchildren the start in life they deserve? The Tory cuts to education will see schools in Boston and Skegness lose £7,214,354. This means Haven High will lose £1,097,327, Skegness Academy down by £597,176. Labour will put the needs of the many at the heart of everything we do, an NHS that works for all, education for your whole life, decent housing and a living wage. \nPHILIP SMITH (LIBERAL DEMOCRAT) – LibDem policies for Boston and Skegness will help you and your family: every vote for me helps us to: Save our NHS and care services – 1p on income tax, cut waiting times and limit the amount older people pay for social care; Put children first; Build an economy that creates jobs and opportunities; Keep our country green – cut air pollution to prevent premature deaths, ban fracking, double green electricity by 2030 and insulate 4 million homes by 2022; Support families and communities – build 300,000 homes by 2022 and extend free childcare to all two-year-olds; Increase community policing, defend rights and promote justice and equalities; Protect Britain’s place in Europe - if you don’t like the Conservatives’ deal, you should have the choice to remain in the EU; Fix a broken system to give people power over their own lives and how the country is run. Please vote LibDem on Thursday. Paul Kenny outside Pilgrim Hospital. \nPAUL NUTTALL (UKIP) – The people of Boston and Skegness made it clear what they wanted when 75 per cent of you voted to leave the EU last June. However, a massively increased Conservative majority will see them compromise on key issues. UKIP will not let them do that. We’ll fight for the Brexit you voted for and ensure that is what you get. It’s not just Brexit we’re looking to protect, UKIP wants to: cut immigration, create a more secure Britain, put the NHS before foreign aid, protect British culture, and build a modern and fair democracy. And while I’m at it, I’ll campaign to get Boston’s streetlights turned back on after midnight, back the call for extending the Skegness holiday season until Christmas and sort out the expensive mess of local parking. All I need is your vote tomorrow and then, as your voice in Wesminster, I can get to work for you. Liberal Democrat Phil Smith UKIP leader, Paul Nuttall, launching his campaign bus at Boston bus park, followed by a campaign walk on High Street. Pictured meeting Boston fishermen. Sign in", "external_links": [], "published": "2017-06-07T16:38:00.000+03:00", "crawled": "2017-06-07T17:22:01.000+03:00", "highlightTitle": ""}