{"organizations": [], "uuid": "85972f468993548a2b8d3fab1ba7d3065b6b3aa0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30380810/16037074.jpg", "site_section": "http://www.middevongazette.co.uk/news.rss", "section_title": "Devon Live news RSS feed", "url": "http://www.devonlive.com/video-neil-parish-wins-tiverton-honiton-full-report/story-30380810-detail/story.html", "country": "GB", "title": "VIDEO: Neil Parish holds Tiverton & Honiton for the...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-09T15:31:00.000+03:00", "replies_count": 0, "uuid": "85972f468993548a2b8d3fab1ba7d3065b6b3aa0"}, "author": "Lewis_Clarke", "url": "http://www.devonlive.com/video-neil-parish-wins-tiverton-honiton-full-report/story-30380810-detail/story.html", "ord_in_thread": 0, "title": "VIDEO: Neil Parish holds Tiverton & Honiton for the...", "locations": [], "entities": {"persons": [{"name": "neil parish", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "matthew wilson", "sentiment": "none"}, {"name": "caroline kolek", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "oliver colville", "sentiment": "none"}, {"name": "gill westcott", "sentiment": "none"}, {"name": "parish", "sentiment": "none"}], "locations": [{"name": "plymouth", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "axminster", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}], "organizations": [{"name": "tiverton & honiton", "sentiment": "none"}, {"name": "neil parish", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "parliament for tiverton & honiton", "sentiment": "none"}, {"name": "green party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "VIDEO: Neil Parish holds Tiverton & Honiton for the Conservatives - Full Report By Lewis_Clarke | Posted: June 09, 2017 0 COMMENTS SHARES Comments (0) \nNeil Parish has called for the Conservatives to \"get on with it\" following a disastrous result for his party. \nMr Parish was returned as Member of Parliament for Tiverton & Honiton with 35,471 votes, up 7.4 per cent on 2015 with 64.1 per cent of the vote. Labour's Caroline Kolek saw an increase of 14.4 per cent on 2015 with 27.1 per cent. Liberal Democrat Matthew Wilson saw the parties swing 2.4 per cent with 4639 votes and an eight per cent vote share. Green's Gill Westcott also saw a -2.8 per cent swing with 2.035 and 3.5 per cent of the vote. \nThis leaves Mr Parish with a majority of 19,901. The turnout was 71.5 per cent. \nMr Parish said he was very disappointed with the result and said the one silver lining was Scotland where he said he did not believe another independence referendum would be held. \n\"As far as putting a Government together I think we can just about manage to do it. I've lost personal friends, I've lost Oliver Colville down in Plymouth and I'm really sad about that. We will have reflect on the fact that people are worried about our hospitals, worried about our schools, worried about various things that are out there, and I think there's got to be reflection. \n\"I also think we probably will have to have a little look at how we came about our manifesto and what we put in it because that has to take some of the blame.\" \nMr Parish also criticised the Conservative election campaign. \n\"I think if I was writing a school report, I would say we could have done better,\" he added. \"I think that's probably an understatement. \n\"I also think perhaps when you're in Government it's more difficult because in this county of Devon we control the Government, we control the County and we control the Districts, anything out there could be good, but anything out there that's bad is down to the Conservatives as far as the votes are concerned.\" \nHe added that Labour leader Jeremy Corbyn has offered things \"he probably wouldn't have been able to have bought.\" \n\"He nonetheless won the campaign and we're inclined to think campaigns don't matter but I think in this instance they probably did.\" \nMr Parish also discussed Conservative Leader Theresa May and her decision to call the election. \n\"She called the election because she wanted a stronger mandate, particularly for exiting the European Union; unfortunately we have a weaker government now. I just want to make sure we can negotiate a strong deal but I feel we have made life a little bit more difficult for ourselves. \n\"For the good of the country and for the good of getting a deal as we leave the European Union, it's right that we pull ourselves together, pull the government together and get on with.\" \nEmotions were different for Labour candidate who was visible excited at the unexpected vote for her party. \n\"I'm absolutely thrilled; I never had any doubt over Jeremy Corbyn. Being out and about over the last four or five weeks in the constituency it's quite clear that the election that May called on the basis of Brexit, it wasn't at the forefront of people's minds, it was about NHS and education. \n\"I never had any doubt, he's (Jeremy Corbyn) gauges so many people whether you're a Corbynista or not, he has certainly enthused a new generation of voters and that is so important. We're obviously going to build on the result we've had this evening, getting out and engaging with more people across the constituency getting ready for the next election. \n\"We increased the vote two years ago, we increased the vote substantially this time, and we're chipping away.\" \nMeanwhile it was disappointment for the Liberal Democrats who saw a fall in their vote share. Dr Matthew Wilson said: \"I think the centre of gravity for the party has moved a little bit so the seats we've done better in are towards the London area, big areas where people are disappointed with the EU referendum result. \n\"The South West has been a little trickier with the demographics around here and the way people voted in the EU referendum and our position on that. Disappointing, but that's the way things go sometimes.\" \nGill Westcott for the Green Party added: \"I think that it's very interesting that the electorate hasn't responded to the snap election in the way that Theresa May thought that they might and despite the alarms about security and policing, it looks to me as if there has been quite a reaction against some aspects of Government policy. \n\"It's been a very abbreviated campaign because we only got to do hustings in Axminster. We've had a huge amount of correspondence though which is encouraging because it shows people care strongly about lots of aspects. \n\"We haven't had the discussion of economics and democracy that I would have liked to have had, and having our democracy improved so more people can participate in a more equal way.\" ", "external_links": [], "published": "2017-06-09T15:31:00.000+03:00", "crawled": "2017-06-09T12:09:34.000+03:00", "highlightTitle": ""}