{"organizations": [], "uuid": "aaea1ffba322deca1b38f290fa473f69c0f391f1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article13188149.ece/ALTERNATES/s1200/JS122796917.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13182687", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Lord Mayor of London calls for single market access in Brexit deal", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-15T15:30:00.000+03:00", "replies_count": 0, "uuid": "aaea1ffba322deca1b38f290fa473f69c0f391f1"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13182687", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Lord Mayor of London calls for single market access in Brexit deal", "locations": [], "entities": {"persons": [{"name": "jonathan", "sentiment": "none"}, {"name": "parmley", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "andrew parmley", "sentiment": "none"}, {"name": "mark carney", "sentiment": "none"}, {"name": "philip hammond", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "teesside park", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "mansion house", "sentiment": "none"}], "organizations": [{"name": "dfs", "sentiment": "negative"}, {"name": "general election", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "city corporation", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "bank of england", "sentiment": "none"}, {"name": "tories", "sentiment": "none"}, {"name": "world trade organisation", "sentiment": "none"}, {"name": "cities of westminster", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning Sales growth dip for H&M amid 'tough market conditions' \nFashion chain H&M has reported slowing sales growth after it faced a tough start to May across a number of its international markets. \nThe retail giant said sales rose 4% last month on a constant currency basis, down from growth of 7% in April. This left overall second quarter sales growth to the end of May at 5%. \nBut H&M was boosted as currency movements flattered its earnings, with total second quarter sales excluding VAT up 10% at 51.4bn Swedish crowns (£4.6bn). \nH&M, which has nearly 4,500 stores worldwide, said: \nIn the first half of the month sales were affected by tough market conditions in several countries. \nSales improved considerably in the second half of the month. \nIts performance comes after bigger rival Inditex, which owns fast fashion chain Zara, posted figures on Wednesday showing constant current sales jumped 12.5% in its quarter to May 1. \nH&M said it had expanded its global store base by 421 in the year to May to 4,498. Adam Tomlinson, a retail analyst at Liberum, said: \nIn our view, the push for space growth is coming at the expense of margins. H&M store (Photo: Chris Radburn/PA Wire) 9:15 Shield Therapeutics plans to raise £12m through share sale \nGateshead pharmaceutical company Shield Therapeutics is planning to raise around £12m through share dealings. \nThe firm plans to used the cash to increase sales of its Feraccru product, which is used to trate iron deficiency anaemia, in the UK and Germany. \nThe increased funds will also allow Shield Therapeutics to continue its study into kidney disease medication, as well as to fund a New Drug Application in the US for Feraccru. \nCarl Sterritt, Chief Executive Officer and Co-Founder of Shield Therapeutics, commented: \nSince our IPO in 2016 Shield has transitioned into a commercially focused specialty pharma business that is now actively generating revenue in both Germany and the UK from its lead product, Feraccru. \nWith key data and pipeline progress due in the coming months, which are expected to provide significant additional value creating opportunities for the Company, the Board and management team remain focused on execution of our plans. \nI am grateful for the support indicated for the Fundraise from our existing shareholders at this exciting time as these funds will enable us to reach and go beyond the upcoming key inflection points. Carl Sterritt, Shield Therapeutics KEY EVENT Workers miss out on almost £3bn of wages and holiday pay every year, report claims \nAlmost £3bn of wages and holiday pay are unpaid every year and the figures could be the “tip of the iceberg”, a report has found. \nResearchers from Middlesex University London also discovered that one in 20 workers do not have paid holidays while one in 12 workers are not given a payslip, both in breach of employment rights. \nThe impact of unpaid or delayed wages is so severe, it leads to thousands of workers having no food, said the report. \nSectors most likely to abuse workers, such as failing to pay wages, include sports activities, amusement and recreation, food and beverage services, arts and entertainment, and construction, according to the research which was funded by the Trust For London charity. \nNick Clark, from Middlesex University London, said: \nIt has not been easy to find accurate data on the true scale of failure to pay wages in this country and I fear that this is the tip of the iceberg in terms of painting a realistic picture of unpaid Britain. \nOne of the problems is that there is no official data on non-payment. Not paying wages is a civil rather than a criminal offence which means there are no crime statistics. \nOur interim findings demonstrate that there is a desperate need for improved workers’ protection and better guidance on their rights and how these can be enforced. \nWith an uncertain Brexit around the corner there has never been a more important time to safeguard, protect and enhance workers’ rights. Almost £3bn of wages and holiday pay are unpaid every year 9:02 Jonathon Manning Diabetes care company creates new jobs after receiving £1m backing \nA healthcare company that spun out of Newcastle University and the city’s hospital trust has created jobs after receiving £1m in growth funding . \nChanging Health, which helps people with Type 2 diabetes control their symptoms, has recruited six new members of staff after receiving £1m from the Finance for Business North East Accelerator Fund, which is managed by Northstar Ventures, and signing a deal with healthcare giant Nuffield. \nThe company emerged from a partnership between the university and the Newcastle Hospitals NHS Foundation Trust, which uses groundbreaking research to develop behavioural change techniques to improve the lives of people with Type 2 diabetes. \nThe platform the company has developed provides users with educational content about managing their condition, as well as healthy eating and exercise. Users can track their personal data, set realistic goals and receive personal interaction with trained coaches. \nCEO John Grumitt said: \nWe’re excited to expand and attract talent to the North East following the investment by Northstar Ventures. Among appointed staff members are business development director Mark Scorringe, who previously worked at global pharmaceutical company Eli-Lilly, and marketing and communications director Jonathan Gwillim, who has over 10 years of experience in healthcare market insight. \nThe expansion at Changing Health comes as figures show that the North East has the largest proportion of people working in life sciences of any region in England, based in part of the excellence built up in many years from Newcastle University’s medical school. Changing Health team. From left to right: Andrew Taws, Gemma Johnson, Jonathan Gwillim, Louise Taylor, John Grumitt, Mark Scorringe , Aarti Sahasranaman and Harley Fuller (Photo: publicity handout) 8:57 Jonathon Manning Hargreaves continues to diversify away from coal by creating new energy business \nDurham’s Hargreaves Services has created a new energy company and recruited a high profile leader as it aims to diversify away from its traditional coal market. \nBrockwell Energy Limited will focus on the development of onshore wind farms, energy from waste facilities and flexible gas generation projects. \nThe new company represents a major step by Hargreaves, which has traditionally focused on the difficult coal and logistics markets. \nHargreaves first made the move into its energy projects to improve its propoerty portfolio, with the hope of locking in long term land rentals. \nBut now the company said the projects could “create significant value as they are taken through the planning and development process”. \nBrockwell will be led by new chief executive Alex Lambie, who will be supported by Hargreaves’ group finance director Iain Cockburn. \nMr Lambie has worked in the energy sector for over 40 years, most recently at Welsh Power Group Ltd. As the majority shareholder and non-executive chairman, he built Welsh Power into a £1bn business after initially receiving only £38m in investment. \nMr Lambie said: \nSince first engaging with Hargreaves to advise on the development of its energy projects, I have been struck by the quality of the project portfolio and the drive and professionalism of the team that has been assembled within the group to develop and manage these projects. \nTogether, the projects and the team offer the opportunity to create significant value from the current project portfolio and provide a strong platform to develop a larger business focused on the development and delivery of energy projects across a balanced portfolio of technologies. I am delighted to be tasked with leading the team and excited by the opportunities that lie ahead. Hargreaves Services Jonathon Manning Majestic wine 'confident' on outlook despite £1.5m loss \nMajestic Wine has insisted it is “past the tipping point” with its recovery plan despite swinging to a full-year loss. \nThe retailer posted pre-tax losses of £1.5m for the year to April 3 against profits of £4.7m the previous year, while underlying profits tumbled 29% to £12.9m on surging costs from the overhaul. \nIt said underlying earnings shot up 51% in the second half as its turnaround started to bear fruit, with underlying sales growth of 12.1% in the final six months. \nIts core Majestic Wine warehouse chain saw like-for-like sales lift 5.7% over the full year as it notched up eight consecutive quarters of rising sales. \nRowan Gormley, group chief executive of Majestic, said: \nWe are past the tipping point, both financially and operationally. \nWe remain confident about the medium-term outlook, despite tough economic conditions, as transformation benefits are coming through and our costs are naturally coming down as a result of us reaching the next stage of the transformation plan. \nHe added the group is on track to make £500min sales by 2019. \nThe group also announced that chairman Phil Wrigley would retire at the annual general meeting in August. He will be replaced by non-executive director Greg Hodder. Majestic Wine chief executive Rowan Gormley (Photo: Majestic Wine/PA Wire) 8:47 ", "external_links": [], "published": "2017-06-15T15:30:00.000+03:00", "crawled": "2017-06-15T10:46:33.003+03:00", "highlightTitle": ""}