{"organizations": [], "uuid": "cf6c5200018e683756619e7f2190eafaadb05ec0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13145578.ece/ALTERNATES/s1200/General-Election-2017.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/boris-johnson-durham-general-election-13147374", "country": "GB", "domain_rank": 21960, "title": "What Boris Johnson's visit told us about Brexit, his thoughts on Corbyn and the Tories' chances", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-07T01:22:00.000+03:00", "replies_count": 0, "uuid": "cf6c5200018e683756619e7f2190eafaadb05ec0"}, "author": "Katie Dickinson", "url": "http://www.chroniclelive.co.uk/news/north-east-news/boris-johnson-durham-general-election-13147374", "ord_in_thread": 0, "title": "What Boris Johnson's visit told us about Brexit, his thoughts on Corbyn and the Tories' chances", "locations": [], "entities": {"persons": [{"name": "corbyn", "sentiment": "negative"}, {"name": "boris johnson", "sentiment": "negative"}, {"name": "brexit", "sentiment": "negative"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "johnson", "sentiment": "none"}, {"name": "tim farron", "sentiment": "none"}, {"name": "helen goodman", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "boris", "sentiment": "none"}, {"name": "shildon", "sentiment": "none"}, {"name": "nicola sturgeon", "sentiment": "none"}], "locations": [{"name": "brexit britain", "sentiment": "none"}, {"name": "northumbria", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}, {"name": "shildon civic hall in county durham", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "newcastle city centre", "sentiment": "none"}, {"name": "auckland", "sentiment": "none"}, {"name": "shildon civic hall", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "shildon", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "tories", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "home office", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News What Boris Johnson's visit told us about Brexit, his thoughts on Corbyn and the Tories' chances The Foreign Secretary visited Shildon in County Durham with two days to go before the eagerly-awaited General Election Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily   Thank you for subscribing! Could not subscribe, try again later Invalid Email \nBoris Johnson visited the North East with two days left before voters go to the polls. \nThe Foreign Secretary delivered a speech to invited guests inside Shildon Civic Hall in County Durham, while dodging the crowds outside. \nHis key message revolved around Brexit, with Mr Johnson claiming that Labour leader Jeremy Corbyn isn’t fit to handle negotiations. \nHere are five things we learned from the Conservative’s visit. 1. Boris will go to any lengths to avoid being heckled Labour supporters outside Shildon Civic Hall in County Durham where Boris Johnson was giving a speech (Photo: Newcastle Chronicle) \nA crowd of protestors awaited Mr Johnson as he visited Shildon Civic Hall for a speech to invited guests. \nBut, perhaps understandably, he chose to avoid the group and their shouts of “Tories out” by going into the building through the back door. \nThere was an audible murmur of disappointment and cries of “coward” as demonstrators realised the Foreign Secretary was already inside ahead of his speech at 11.15am. \nThe group, carrying signs supporting Labour’s Bishop Auckland candidate Helen Goodman, then moved round to the back entrance to greet Mr Johnson on his way out, chanting “back door Boris”. \nBut after around 20 minutes of waiting he stealthily dodged them again, this time by using the front entrance. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now 2. From ‘mutton-headed’ to ‘muddle-headed’ Labour leader Jeremy Corbyn addresses a huge crowd at the Sage in Gateshead (Photo: newcastle chronicle) \nThe Tories are stepping up their attacks on Jeremy Corbyn as the election looms, with Mr Johnson calling him everything from a “herbivore” to “muddle-headed” in his speech. \nMr Johnson, who famously once referred to the Labour leader as a “mutton-headed old mugwump”, said Brexit talks would “flounder” if Mr Corbyn wins power. Read More \nHe claimed Labour’s “herbivores” would be “eaten for breakfast” by Brussels bureaucrats, and Mr Corbyn’s position would be fatally undermined by the “jabbering” of possible coalition partners Nicola Sturgeon and Tim Farron demanding Britain stays in the EU. 3. The future’s bright with Brexit? Foreign Secretary Boris Johnson in Shildon (Photo: PA) \nMr Johnson played a leading role in the successful Leave campaign during last year’s EU referendum. \nAnd Brexit was the key theme throughout his speech, as he claimed Corbyn doesn’t have the “grit, determination or purpose” to lead the negotiations. \nHe said that without the right economic policies, Britain will be unable to take advantage of the opportunities that will open up once the UK has left the European Union. Read More See Boris Johnson dodge protestors following County Durham appearance \n“This is the moment to believe in the huge potential of Brexit Britain. Let’s get Brexit done. Let’s get Brexit right. Let’s believe in Britain. And let’s work for the next 48 hours to make sure our negotiations are led by Theresa May and the Conservatives.” \nAnd he promised the North East had a “fantastic future” in terms of investment. \nAsked about the NHS, he said: “We can do a lot of good things, like spend money on the NHS, but we can’t do it unless we get out of the EU.” Video Loading Click to play Tap to play The video will start in 8 Cancel Play now 4. Promises for more armed officers Armed police mingle with shoppers in Newcastle City Centre, the day after the Manchester attack (Photo: newcastle chronicle) \nAsked about cuts in police numbers, Mr Johnson said: “Every year I was Mayor in London we were able to keep police numbers at or around 32,000 and I think they’ve been higher in our period in office than virtually every year Labour was in office in the 13 years before then. \n“We are investing in counter-terrorism, we are putting 1,900 more into our counter-terrorist operations as well as putting more armed police officers out on the street.” \nHe did not comment on whether he was confident the North East could cope with a terror attack after Home Office statistics showed that there was a 15% cut in armed officers between Durham and Northumbria forces between 2010 and 2016. 5. The Tories have ‘a great chance’ in the North East Boris Johnson during a speech at Shildon Civic Hall in County Durham (Photo: Newcastle Chronicle) \nWith a poll suggesting the Conservatives and Labour are neck-and-neck with just two days until the election, Mr Johnson said the Tories are still “fighting for every seat”. \nWhen asked whether he believed they could make a dent in Labour’s North East heartland, he said: “I think people are coming over to us. \n“I spoke to a man the other day who had been a trade union official for 40 years who just couldn’t vote for Jeremy Corbyn - his approach to security and the economy. \n“We’ve got a great chance in the North East and we’re taking nothing for granted.” Read More", "external_links": [], "published": "2017-06-07T01:22:00.000+03:00", "crawled": "2017-06-06T20:49:44.000+03:00", "highlightTitle": ""}