{"organizations": [], "uuid": "4b0671b72c39c9195c137085ddc7a50a0597676a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13160601.ece/ALTERNATES/s1200/Untitled-design.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/who-would-lead-coalition-government-13160533", "country": "GB", "domain_rank": 21960, "title": "Who would lead a coalition government and how would it be formed?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-09T12:43:00.000+03:00", "replies_count": 0, "uuid": "4b0671b72c39c9195c137085ddc7a50a0597676a"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/who-would-lead-coalition-government-13160533", "ord_in_thread": 0, "title": "Who would lead a coalition government and how would it be formed?", "locations": [], "entities": {"persons": [{"name": "johnson", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "ruth davidson", "sentiment": "none"}, {"name": "boris johnson", "sentiment": "none"}], "locations": [{"name": "maidenhead", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}], "organizations": [{"name": "tories", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Who would lead a coalition government and how would it be formed? We look at the options after an extraordinary night in British politics which has seen a hung parliament Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nEven with the results of the 2017 general election still to come in, the back stage plotting about what happens next on this extraordinary night had begun. \nWhat is clear, despite being the largest party, is that Theresa May ’s position is virtually untenable as leader of the Conservative party. \nIt was her gamble to call a snap election to strengthen her hand at the Brexit negotiation. \nThat gamble has spectacularly backfired, the party actually losing seats, and already Tory MPs are reportedly ‘spitting feathers’ about it. \nIn her acceptance speech after winning her Maidenhead constituency she talked of a ‘period of stability’ and the Conservative party ‘doing what was in the national interest’. Ruth Davidson, Boris Johnson and Theresa May (Photo: PA/Getty) \nThat, ultimately, will likely mean she stands down. \nWho decides on a coalition? \nAs the incumbent government the Tories get the first chance at creating a coalition. \nIt is unlikely it can form one with any of the major parties so it might have to go with the unionist MPs in Northern Ireland. \nEven then it might not quite get the 326 seats required for a majority. \nIts option then is govern with a minority of MPs but it would have to pass a Queen’s speech with the help of another or more than one other party. Read More \nWho would be Prime Minister? \nWith Mrs May’s authority undermined, it will see other figures jockeying for position. \nAlready Foreign Secretary Boris Johnson is being talked of as a replacement. \nHowever, Johnson is a divisive figure. One person who is not is Ruth Davidson, the leader of the Tories in Scotland who has had a great night north of the border. \nShe has previously said she would not be interested in taking the top job, but these are extraordinary times with Brexit negotiations due to start in about 10 days time. \nWhat if the Tories can't make a deal? \nIf the Tories can’t come up with a solution, it would be down to Labour. \nBefore the election, Mr Corbyn said there would be ‘no deals’ as the Tories spoke of a coalition of chaos. \nIf it were indeed to form a coalition it would have to be with more than one party - a so-called ‘rainbow coalition’. \nTheoretically the two main parties could get together in what is known as a ‘grand coalition’ but that isn’t going to happen. \nAnd if Labour can't make it work? \nAnother possibility for a pact is a looser “confidence and supply” arrangement. This means the minor party or parties would commit to voting with the government on key events - for example Brexit - such as the budget and Queen’s speech, but take all other votes on a case-by-case basis. Read More ", "external_links": [], "published": "2017-06-09T12:43:00.000+03:00", "crawled": "2017-06-09T08:09:32.009+03:00", "highlightTitle": ""}