{"organizations": [], "uuid": "8d248d6594cf0d3dae5c336a33c37c3e38a68ed2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13153284.ece/ALTERNATES/s1200/UK-General-Election-2017-Daily-Sightings.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/you-cant-back-any-party-13153291", "country": "GB", "domain_rank": 21960, "title": "If you can't back any party, at least back the local candidate who will work for you", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-08T02:30:00.000+03:00", "replies_count": 0, "uuid": "8d248d6594cf0d3dae5c336a33c37c3e38a68ed2"}, "author": "Kate Thick", "url": "http://www.chroniclelive.co.uk/news/north-east-news/you-cant-back-any-party-13153291", "ord_in_thread": 0, "title": "If you can't back any party, at least back the local candidate who will work for you", "locations": [], "entities": {"persons": [{"name": "ka", "sentiment": "neutral"}, {"name": "merkel", "sentiment": "none"}, {"name": "czeslaw milosz", "sentiment": "none"}, {"name": "farron", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "julie pörksen", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "mosul", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "scandinavia", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "financial times", "sentiment": "none"}, {"name": "economist", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Opinion If you can't back any party, at least back the local candidate who will work for you Kate Thick on the last stages of an election campaign which could have devastating consequences for the future Share A man looks at a general election display (Photo: Getty Images Europe) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \n“The tree of good and evil is stripped bare,” wrote the poet Czeslaw Milosz who used words as a kind of moral X-ray; my touchstone to ferret out truths in a media blizzard. \n“No prime minister is better than a bad prime minister,” is the only line to make me chortle during this campaign coloured by tragedy. \nCurled up on the sofa reading last weekend, I had to put down my wine glass and pinch myself. \nThe scrupulous and highly regarded Economist magazine, hardly a champion of the left, urged readers to consider voting Lib Dem “as a down-payment for the future” - hoping they become one element of a party of the radical centre – even while predicting a poor result for them in today’s election. \nA clunky, misjudged election call and campaign reveal the starched edges of May’s comfort zone. In contrast, Corbyn looks more resilient under pressure and comes across as more humane and honest having twigged most voters are fed up with austerity. \nFarron’s worthy promise to push for a referendum on the terms of EU withdrawal has turned out to be a huge damp squib; the Economist’s endorsement for the Lib Dems is bravely perspicacious, warning Brexit will affect us more than anything else over the next five years. \nThe consequence of “no deal” would not be “better”, it would be ruinous. Brexit talks start later this month so how will May’s brittleness fare in face-to-face negotiations? Other than her hollow slogan, no whiff yet of May’s hard Brexit manifesto. \nThe Financial Times reports that to keep exports of goods and services flowing to the rest of the world merely on the same terms as now, even before negotiating new deals, Britain will have to renegotiate 759 agreements with 168 countries that are now held by the EU. No replacement deals are ever going to better that. \nDeal or no deal, Britain will emerge a loser. The pragmatic Merkel won’t bat an eyelid if we walk away from the negotiating table. If Corbyn wins, he’ll invite Merkel to watch his beloved Arsenal during the Brexit negotiations, a far more positive approach. \nWith security threats so sadly highlighted in an election supposedly to ratify British detachment from the EU, affinity with the rest of Europe has never looked so compelling. \nA tree May does not seem to want to strip bare is the billions of pounds worth of arms we sell to the Saudis and the flow of funds from them to jihadi groups. \nThere is no space here to argue the complicated line from Mosul to Manchester, but linking terrorism to issues of social justice and human rights is easy. Read More Ever voted in a pub before? You can in one corner of rural Northumberland \nEvidence shows that unequal societies tend to be more violent and have lower levels of social cohesion than equal societies. \nWhile thinking about which box to tick today, remember the UK has the highest levels of regional inequality in Europe and the third highest inequality levels of all high-income countries. All our ‘frontline’ services – the NHS, mental health services, education, welfare and community policing – are stretched or struggling. Teachers and nurses are now resorting to food banks and poverty is seriously affecting the health of many British children. \nThe UK is (with Italy) the worst performing G7 economy this year given the sterling’s slump since the referendum. There is no rational discussion about the economy because Brexit is an ideology burying heads in the sand. \nAnother tree to strip bare: The Conservative claim that our welfare state is bloated and counterproductive. \nThe UK welfare state is not large at all. As of 2016, the British welfare state was, at 21.5% of GDP, barely three-quarters of welfare spending in comparably rich countries. Unemployment benefits, especially combined with good publicly funded retraining and job-search programmes, such as in Scandinavia, preserve the human productive capabilities that would otherwise be lost, as we have seen in so many former North East industrial towns. Read More Will Labour win the general election? We look at the chances of the party claiming victory \nDemocracy is not about brand loyalty, nor is it about left and right. This vote could have devastating consequences for the future. \nWhere, I wonder, will the discontent misdirected at the EU be fired at next if Brexit fails to deliver? \nCould a vote for the Lib Dems send a signal, if parties regroup and rebuild after defeat, that there is hope yet for a centre-ground, progressive politics the Economist advocates? \nJulie Pörksen, Lib Dem candidate for the Berwick-upon-Tweed constituency, told me when she stopped by for tea: “This election should be about what sort of country we want to live in. May says it’s about increasing her mandate for Brexit but she’s after more power to cut state services for ideological reasons which will become an economic necessity in three years when the country is poorer. \n“What happens to the NHS reflects so much about our values and economy, it is a microcosm about how we treat others and expect to be treated.” \nIf our main political parties remain undeserving of wholehearted backing, vote for the local candidate who is going to fight for you, for the North East, and who is honest about the impact of Brexit. Read More ", "external_links": [], "published": "2017-06-08T02:30:00.000+03:00", "crawled": "2017-06-07T22:10:24.001+03:00", "highlightTitle": ""}