{"organizations": [], "uuid": "fa13e820954b439ed10af52cbae91a3dc01ce1a3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13161664.ece/ALTERNATES/s1200/Front-page.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/uk-election-front-pages-newspapers-13161453", "country": "GB", "domain_rank": 21960, "title": "UK election front pages: Newspapers say Theresa May's gamble backfired spectacularly", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-09T16:23:00.000+03:00", "replies_count": 0, "uuid": "fa13e820954b439ed10af52cbae91a3dc01ce1a3"}, "author": "Tom Eden", "url": "http://www.chroniclelive.co.uk/news/north-east-news/uk-election-front-pages-newspapers-13161453", "ord_in_thread": 0, "title": "UK election front pages: Newspapers say Theresa May's gamble backfired spectacularly", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "neutral"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "daily mail", "sentiment": "none"}, {"name": "financial times", "sentiment": "none"}, {"name": "snp", "sentiment": "none"}, {"name": "times", "sentiment": "none"}, {"name": "tories", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "journal", "sentiment": "none"}, {"name": "northern irish democratic unionist party", "sentiment": "none"}, {"name": "chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nTheresa May has been hung out to dry after her election gamble backfired — that is the consensus from this morning’s newspapers. \nThe Conservatives squandered their parliamentary majority at the 2017 snap general election, following a successful campaign by Jeremy Corbyn and Labour. \nBritain is waking up to the news that there will be a hung parliament , with 646 out of 650 constituencies declared, the Tories had 315 seats, Labour 261, the SNP 35 and the Liberal Democrats 12. Read More UK Election 2017 results LIVE: Theresa May expected to cling on in hung parliament as election gamble backfires \nThe Northern Irish Democratic Unionist Party, which increased its representation at Westminster from eight to 10, signalled it was ready to discuss working with the Tories on issues such as Brexit. \nSources suggest Theresa May has indicated she will look to stay on as Prime Minister and Tory leader despite failing to win a majority after her decision to hold a snap election backfired spectacularly. Read More General Election 2017 North East results in full: How North East constituencies voted Here are the views of the newspapers this morning: \nThe latest edition of the Chronicle — a new edition is going to print at 9am — described the aftermath of the general election as ‘mayhem’: \nThe Journal questioned whether Theresa May’s gambled had backfired, something that looks increasingly likely as the results came in. \nThe front page is a rare beast in the newspaper world — asking a question in a headline to which the answer is probably ‘yes’: \nThe latest edition of the Mirror said Theresa May’s job is “on the line” as the UK headed for a hung parliament: \nIn their 4am edition, the Daily Mail - usually a cheerleader for Theresa May - calls her leadership into question, saying her decision to call an election backfired “disastrously”: \nAfter savaging Labour leader Jeremy Corbyn with a number of hostile front pages, the Sun have led with “dismay” for Theresa May, saying Britain has been ‘plunged into political chaos’, adding that Mrs May’s election gamble was a ‘disaster’. \nThe Times describes the election as a ‘nightmare’ for Theresa May after squandering the huge lead she had in the polls: \nThe Financial Times says May’s gamble “appeared to have triggered another period of turmoil in British politics”, adding voters rejected her bid for a stronger mandate: Read More", "external_links": [], "published": "2017-06-09T16:23:00.000+03:00", "crawled": "2017-06-09T11:48:53.001+03:00", "highlightTitle": ""}