{"organizations": [], "uuid": "79fc529cb91ba60b7a3b8116fca37510f25bf35b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30377462/16034903.jpg", "site_section": "http://www.westernmorningnews.co.uk/all-content.rss", "section_title": "Devon Live All Content Feed", "url": "http://www.devonlive.com/guide-to-the-general-election-in-devon/story-30377462-detail/story.html", "country": "GB", "title": "WMN_PGoodwin published As the polls close and the count begins we reveal our predictions...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-09T04:51:00.000+03:00", "replies_count": 0, "uuid": "79fc529cb91ba60b7a3b8116fca37510f25bf35b"}, "author": "WMN_PGoodwin", "url": "http://www.devonlive.com/guide-to-the-general-election-in-devon/story-30377462-detail/story.html", "ord_in_thread": 0, "title": "WMN_PGoodwin published As the polls close and the count begins we reveal our predictions...", "locations": [], "entities": {"persons": [{"name": "devon", "sentiment": "none"}, {"name": "phillipa davey", "sentiment": "none"}, {"name": "nick clegg", "sentiment": "none"}, {"name": "james taghdissian", "sentiment": "none"}, {"name": "davenport", "sentiment": "none"}, {"name": "ben bradshaw", "sentiment": "none"}, {"name": "streeter", "sentiment": "none"}, {"name": "neil parish", "sentiment": "none"}, {"name": "sue dann", "sentiment": "none"}, {"name": "tory geoffrey cox", "sentiment": "none"}, {"name": "bradshaw", "sentiment": "none"}, {"name": "david cameron", "sentiment": "none"}, {"name": "gary streeter", "sentiment": "none"}, {"name": "steve crowther", "sentiment": "none"}, {"name": "pollard", "sentiment": "none"}, {"name": "anthony steen", "sentiment": "none"}, {"name": "tory oliver colvile", "sentiment": "none"}, {"name": "morris", "sentiment": "none"}, {"name": "nick harvey", "sentiment": "none"}, {"name": "tory anne marie morris", "sentiment": "none"}, {"name": "johnny mercer", "sentiment": "none"}, {"name": "deborah brewer", "sentiment": "none"}, {"name": "nick", "sentiment": "none"}, {"name": "claire wright", "sentiment": "none"}, {"name": "kevin foster", "sentiment": "none"}, {"name": "ben", "sentiment": "none"}, {"name": "mr cox", "sentiment": "none"}, {"name": "luke pollard", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "hugo swire", "sentiment": "none"}, {"name": "mel stride", "sentiment": "none"}, {"name": "caroline voaden", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "lib dem adrian sanders", "sentiment": "none"}, {"name": "oliver colville", "sentiment": "none"}, {"name": "peter heaton-jones", "sentiment": "none"}, {"name": "sarah wollaston", "sentiment": "none"}, {"name": "mercer", "sentiment": "none"}], "locations": [{"name": "north devon", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "wollaston", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "tiverton", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "east devon", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}], "organizations": [{"name": "a&e", "sentiment": "none"}, {"name": "bbc", "sentiment": "none"}, {"name": "tory", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "foinavon", "sentiment": "none"}, {"name": "cox", "sentiment": "none"}, {"name": "cox  totnes  popular gp", "sentiment": "none"}, {"name": "moor view  if labour", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "armed forces", "sentiment": "none"}, {"name": "former army", "sentiment": "none"}, {"name": "conservative", "sentiment": "none"}, {"name": "coalition", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "labour tory", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}, {"name": "newton", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "As the polls close and the count begins we reveal our predictions for the Devon seats By WMN_PGoodwin | Posted: June 08, 2017 0 COMMENTS SHARES Devon's dozen MPs are all odds-on to be re-elected As the polls close and the count begins we reveal our predictions for the Devon... X \nCopy link to paste in your message / Comments (0) \nAs the polls close and the count begins, here is a seat-by-seat guide to how the results are expected to go in Devon. \nAccording to the bookies, all 12 former MPs - 11 Tory and one Labour - are odds-on favourites to be re-elected to Parliament. \nMany of the contests appear one-sided but highlights of the night will be whether Ben Bradshaw can cling onto Exeter for Labour - his \"little red dot in a sea of blue\". FOLLOW OUR LIVE COVERAGE HERE. \nExeter is the closest predicted race with Mr Bradshaw 1/5 to beat Conservative barrister James Taghdissian at 3/1. \nPlymouth is the next place to look for surprises with Tories Johnny Mercer and Oliver Colville defending slim majorities. \nEast Devon Tory Sir Hugo Swire faces a renewed challenge from Claire Wright, a 5/1 chance and the only Independent in the country included in a list of candidates likely to unseat incumbent Tories. \nPundits expect UKIP to lose huge numbers of votes with the destination of the Leave support from 2015 likely to be key in marginal Labour Tory seats. \nLiberal Democrats are hoping to win back MPs in Torbay and in North Devon, where former Armed Forces minister Sir Nick Harvey is bidding to snatch back the seat. \nHere is how we see the dozen Devon battles playing out: \nCENTRAL DEVON \nLooking for an upset? This is not the place to start. Conservative Mel Stride won the seat in 2010 with 51 per cent of the vote then increased his majority to 52 per cent in 2015, even with the Brexit swing to UKIP, giving him an advantage of 21,265. \nBookies' odds on the favourite : 1/500. \nLikely result : Practically nailed on Tory win. One of the safest seats in the county \nEAST DEVON \nPerhaps the most interesting of the contests for the so-called safe Tory seats. Conservative Hugo Swire, an old pal of David Cameron who was controversially knighted when the PM fell on his swords after the EU referendum, is tipped to hold on, but maybe with slightly less than the 12,261 majority he enjoyed in 2015. But this could be closer than two years ago. His closest rival, as in 2015, is likely to be Independent candidate Claire Wright, who bookies are offering at odds of 5/1. She was the only Indie in the country selected as the anti-Tory alternative by the progressive alliance and has mounted a bigger and better-funded campaign this time. There could be a nervous moment or two for Hugo but defeat would rank among the biggest shocks of the night. \nBookies' odds on the favourite: 1/14. \nLikely result: Hugo to hold on with reduced majority \nEXETER \nThis is definitely one of the few to keep an eye out for on election night. Former BBC journalist-turned MP and later Culture Secretary Ben Bradshaw remains favourite to hold onto his \"little red dot\" of opposition to the Tories in the South West. Bradshaw, a critic of leader Jeremy Corbyn, believes the contest will be close but the surge in support for Labour looks set to push him over the line. Majority in 2015: 7,183. Conservative rival James Taghdissian, a barrister, is 3/1 against with the rest at 100/1 or more. \nBookies' odds on the favourite : 1/5. \nLikely result : Ben again after a nervous night in the city. \nNEWTON ABBOT \nStill looking for shocks? Nothing to see here in the town famous for its racecourse. Tory Anne Marie Morris is expected to be returned again this time around. During the campaign Ms Morris distanced herself from comments made by her electoral agent and partner who claimed 'that the crisis in education was due entirely to non-British born immigrants and their high birth rates'. There was a large Leave vote of 56 per cent in the EU referendum but some of this seems likely to go to the Conservatives who have a comfortable majority of 11,288. The Liberal Democrats are likely to take second place but given they are not going to hoover up any UKIP support, odds of 10/1 seem a little tight given the lead. \nBookies' odds on the favourite 1/50 \nLikely result: Blue colours first past the winning post. \nNORTH DEVON \nThis could be interesting if the Liberal Democrats enjoy a good night. Conservative candidate and former BBC man Peter Heaton-Jones is expected to retain his seat but he faces a tough challenge from the Lib Dem Sir Nick Harvey, a former Armed Forces Minister under the coalition. Sir Nick, who is priced at 7/2 with the bookies, could get close to the 6,936 majority, but any collapse in the high UKIP vote of 7,719 is again unlikely to go the pro-Remain Lib Dems. UKIP candidate and former party chairman Steve Crowther is third favourite at 100/1. \nBookies' odds on the favourite 2/7 \nLikely result: Another seat for the Conservatives. \nPLYMOUTH MOOR VIEW \nIf Labour is to make any inroads into the expected Tory lead then this is one they will probably have to take. Former Army captain Johnny Mercer, whose good looks and physique earned him a slot in a shower gel commercial, snatched this seat for the Conservatives from Labour in 2015 and his strong, campaigning, pro-forces standpoint is expected to be popular again with Plymothians. Sue Dann is given a 10/1 chance to take it back and with Labour only trailing by 1,026 she will fancy her chances. The cock-up over postal votes by the city council could be a factor in what will likely be a close race. Whoever takes the large Leave vote of 57 per cent (9,152) is probably going to emerge victorious. \nBookies' odds on the favourite 1/10 \nLikely result: Too close to call with confidence but military support to give Mr Mercer the competitive edge. \nPLYMOUTH SUTTON AND DAVENPORT \nAnother key seat likely to determine whether or not Labour has a good night. If Corbyn is to cash in on Mrs May's poor campaign and take seats then this one must turn red. Tory Oliver Colvile is expected to retain this seat, which he won with a slender majority of 523 in 2015, but he faces a tough challenge from second-time Labour candidate Luke Pollard, who was second last time around. UKIP's 6,731 votes could again be crucial. If Mr Pollard wins it will buck the polls and mean the Tories are having a bad night. \nBookies' odds on the favourite 1/3 \nLikely result: Nip and tuck. Tory win but only by the odd hundred. \nSOUTH WEST DEVON \nNothing to see here, thrill seekers. Gary Streeter is expected to continue as the MP unless we see a shock bigger than Trump, Brexit and Foinavon's 1967 Grand National win combined. as bookies have him a 1/500 to win the seat. Caroline Voaden of the Liberal Democrats, and Labour's city councillor Phillipa Davey, both joint second favourites at 40/1, would need to peg back a lead of more than 20,000 against a candidate more likely to take some of the 7,306 UKIP votes. \nBookies' odds on the favourite 1/200 \nLikely result: A stroll in the park for Streeter \nTIVERTON AND HONITON \nRural favourite Neil Parish is expected to comfortably retain this seat, another of the 20,000-majority Devon strongholds. Mr Parish doubled his majority to 21,156 while UKIP came second in 2015, with 8.857, as the Liberal Democrats suffered a 22 per cent fall in support, winning just 5,626. The problem for the Lib Dems is the big Leave vote will not come their way and a Labour win would need to see them add more than 20,000 votes to their last tally. \nBookies' odds on the favourite 1/500 \nLikely result: Put the farm on a Tory win by some distance. \nTORBAY \nConservative candidate Kevin Foster won this for the first time in 2015, snatching the seat from veteran Lib Dem Adrian Sanders as his party were punished for the Coalition's austerity and routed. Foster, is expected to once again be elected in Torbay but could face a close challenge from the Liberal Democrats. Mr Foster is odds on to hold on to his majority of 4,078 from Liberal Democrat Deborah Brewer, who is 4/1 to snatch back the seat. Very big Leave vote last year of 62 per cent (6,540) likely to profit the Tories in as expected UKIP leak support. \nBookies' odds on the favourite 1/7 \nLikely result: Tory deckchairs on the seafront \nTORRIDGE AND WEST DEVON \nA high-earning barrister who barely needs his MP's salary, Tory Geoffrey Cox is not known for radical political protests. But this year Mr Cox has stepped out of his Conservative comfort zone and vowed to chain himself to the railings of his local hospital and quit his party if its A&E department is closed down. \nThe remarks reveal the anger at the NHS crisis but hardly reflect a candidate in trouble. Cox won in 2010 by just under 3,000 then held on again last time with an 18,403 majority, thanks to the Lib Dem collapse. If this is close then the Lib Dems (at odds of 12/1) are having a storming night with support back at pre-2010 Nick Clegg levels. Again, the destination of the UKIP vote of 10,371, could be the deciding factor. \nBookies' odds on the favourite 1/40 \nLikely result: Clear verdict in favour of Cox \nTOTNES \nPopular GP turned health campaigner Dr Sarah Wollaston was the only MP in Devon selected by the open primary system ahead of her 2010 win in Devon's hippy enclave. Without any political experience, she won the poll and replaced former MP Anthony Steen, who found infamy after submitting an invoice for a duck house during the 2009 expenses scandal. Dr Wollaston's campaigning and rebellious style saw her majority increase to 18,385 in 2015. \nBookies' odds on the favourite 1/200 \nLikely result: Three in a row for the Tory doctor ", "external_links": [], "published": "2017-06-09T04:51:00.000+03:00", "crawled": "2017-06-09T00:28:54.002+03:00", "highlightTitle": ""}