{"organizations": [], "uuid": "06bef0e084c0546400c156aa53921408cc74c57e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article11694493.ece/ALTERNATES/s1200/JS65560687.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13171955", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Terror attacks lead to fall in visitor number at UK attractions, claims Merlin", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-13T15:25:00.000+03:00", "replies_count": 0, "uuid": "06bef0e084c0546400c156aa53921408cc74c57e"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13171955", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Terror attacks lead to fall in visitor number at UK attractions, claims Merlin", "locations": [], "entities": {"persons": [{"name": "squires barn", "sentiment": "negative"}, {"name": "merlin jonathon manning newcastle", "sentiment": "negative"}, {"name": "squires barnett", "sentiment": "none"}, {"name": "louise squires", "sentiment": "none"}, {"name": "george musson", "sentiment": "none"}, {"name": "warren barnett", "sentiment": "none"}, {"name": "mark squires", "sentiment": "none"}, {"name": "merlin", "sentiment": "none"}, {"name": "nick varney", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "merlin’s legoland parks", "sentiment": "none"}, {"name": "gosforth", "sentiment": "none"}, {"name": "ramside hall hotel", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "thorpe park", "sentiment": "none"}, {"name": "plummer tower", "sentiment": "none"}, {"name": "peterborough", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "durham city", "sentiment": "none"}, {"name": "hexham", "sentiment": "none"}, {"name": "merlin", "sentiment": "none"}], "organizations": [{"name": "squires barnett architects", "sentiment": "negative"}, {"name": "squires barnett", "sentiment": "none"}, {"name": "merlin entertainments", "sentiment": "none"}, {"name": "hill top farm", "sentiment": "none"}, {"name": "durham hill top farm", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "vista development", "sentiment": "none"}, {"name": "durham hill top development", "sentiment": "none"}, {"name": "westfield school", "sentiment": "none"}, {"name": "alton towers", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning Capita shares soar as turnaround plan progresses \nShares in Capita have rocketed this morning after the outsourcing firm said it was making progress with a turnaround plan. \nThe group, which sent out profit alerts twice in three months at the end of last year and ousted its chief executive in March, said that as a result of a series of initiatives, trading will “continue to steadily improve”. \nThe firm said: \nWe continue to expect profitability to improve in the second half, reflecting the cumulative benefit from performance improvement initiatives and lower attrition, and our current view that the trading businesses will continue to steadily improve. \nThe update sent shares soaring by more than 13% to 624p. Capita also confirmed it has entered an “exclusive engagement” with British Airways to explore forming a potential partnership to support its global customer contact operations, which handles approximately 9.5m calls per year. \nA deal with BA would likely see the airline’s call centres in Manchester and Newcastle, which employ 1,400 people, outsourced to Capita. BA came under intense fire after an IT meltdown that affected thousands of customers was blamed by some on aggressive cost cutting. \nCapita, which will hold its AGM today, has come under fire from union bosses over planned changes to its defined benefit pension scheme. \nUnite claimed the changes would mean staff lose a large element of their pension benefits, with the workers’ organisation planning to challenge the decision at the annual meeting. \nDominic Hook, Unite national officer, said: \nThe disgraceful plans by Capita to slash the deferred pay that hard-working staff will get in retirement is utterly unacceptable. \nThis move risks further industrial unrest and reputational damage which Capita simply cannot afford following the pay dispute last year which resulted in strike action. \nCapita’s own figures show that staff could lose as much as £8,000 per year in deferred pay. There is no justification for highly-profitable Capita to treat its workforce in this manner. Capita have an office at Lingfield Point in Darlington 9:15 KEY EVENT Data roaming charges across the European Union ending this week \nMobile roaming charges across the EU are to finally end this week amid warnings to consumers to check their tariffs and remain aware of unexpected costs. \nThe charges will be abolished from June 15, meaning UK mobile phone users can use their regular allowance of calls, texts and data for no extra cost from anywhere in the EU. \nThe Roam Like Home legislation aims to prevent consumers receiving huge bills after downloading films or other data while travelling in Europe, but watchdog Which? has warned that differences between providers when it comes to the details of tariffs could lead to unexpected costs for customers. \nSo-called “bill shock” from holidaying in the EU affected more than 9m UK mobile users a year, according to research by comparison website uSwitch, with consumers especially vulnerable since the smartphone market exploded and mobile data consumption soared. \nUK consumers will benefit from the agreement while the country remains a member of the EU, but there is uncertainty as to whether or not it will continue following Brexit. \nWhich? warned consumers to remember that, even though the UK is still part of the EU, the regulations only apply to roaming, not to calling EU countries from the UK and prices vary significantly. It found calling Spain from the UK can cost between 9p with provider Giffgaff to £1.50 per minute on O2. \nAlex Neill, Which? managing director of home products and services, said: \nMany will reap the benefits of these changes and will no longer be put off from making calls abroad. “However, it is important that you take a close look at what is or isn’t included in your current mobile deal. \nNot knowing what’s included could lead to some surprising charges on your next bill. You won't pay roaming charges in the EU from Friday (Photo: PA) 9:10 Jonathon Manning Ted Baker's global expansion fuels rise in sales \nSales at fashion chain Ted Baker continued their upward trajectory in the first quarter, with the retailer helped by continued global expansion and online growth. \nTed Baker said group revenue rose 14.2% in the 19 weeks to June 10, while retail sales grew 8.4% on a constant currency basis. Online sales increased 32.3% in the period and wholesale revenues rose 8.9%. \nTed Baker opened stores in Los Angeles, Paris, Shanghai and the Netherlands during the quarter. \nThe stellar growth came “despite external factors” impacting trading across some of its global markets, the retailer said. \nChief executive Ray Kelvin said: \nThis continued good performance across all of our distribution channels is a reflection of the strength and appeal of Ted Baker as a global lifestyle brand. \nThe continued expansion of the brand remains underpinned by an unwavering focus on quality and attention to detail as well as the passion, skill and ‘Tedication’ of our team. \nWe are very pleased with the customer response during the period and, despite an uncertain macro environment, we remain positioned to deliver further progress and our expectations for the full year. \nIn January, Mr Kelvin vowed shoppers will not be subjected to price hikes this year with the combination of hedging against currency fluctuations and a dollar-denominated income from its US operations helping to mitigate the collapse in sterling following the Brexit vote. \nAhead of last year’s referendum, Ted Baker extended its hedging arrangements to April 2018, giving it an extra breathing space compared to other retailers. A Ted Baker clothes store in Birmingham 9:03 Jonathon Manning Beer prices could rise after Heineken's Punch deal, says competition watchdog \nHeineken’s £403m takeover of pub chain Punch Taverns could impact competition and see pub goers face higher prices in 33 areas across Britain, the competition watchdog has warned. \nBut the Competition and Markets Authority (CMA) said it did not believe the controversial tie-up would significantly cut the choice of tipples available. \nThis comes despite industry fears Heineken would give preference to its own beers and ciders and close off an important route to market for brewers that compete with the Dutch giant. \nThe CMA said the 1,895 Punch pubs being snapped up by Heineken, which it will add to 1,100 leased pubs it already owns across the UK, only account for 4% of the market and is therefore “not a major route to market for brewers”. \nIt added Heineken was likely not to risk losing customers by reducing the range of beers and ciders on offer. \nHeineken now has to address the CMA’s concerns over the 33 areas where competition could be reduced by June 20, or face an in-depth probe. \nAndrea Coscelli, acting chief executive of the CMA and decision-maker in the case, said: \nWe have listened very carefully to a range of concerns about this merger. \nThe companies will own less than 10% of all British pubs after any deal, but we are concerned about the loss of competition for pub goers in a number of local areas. \nWithout sufficient competition from rivals, pubs in these areas might be able to raise prices or worsen the service they offer customers. Drink Beer Heineken beer tap 8:58 Jonathon Manning North East Company of the Year Omega Plastics invests to create new jobs \nThe reigning North East Company of the Year has invested in two of its sites in the region to improve productivity and create new jobs . \nOmega Plastics, which last year invested more than £1m on a new factory and headquarters in Washington, has installed new machinery at its plants in Blyth and Hartlepool. \nThe company - which manufactures specialised equipment for the healthcare, automotive and defence industries - was the big winner at this year’s North East Business Awards, which are run by The Journal. \nNow it is looking to add to its headcount after the investment in new machinery allowed it to add to its product range and improve order times. \nManaging director Gary Powner said: \nOur ongoing investment programme, combined with the development of our technical team, is in response to increased demand from existing, long-term customers and keeps Omega Plastics at the forefront of the international market as new opportunities present themselves. \nBy working with world-class machinery suppliers such as Fanuc and DMG MORI we’re able to respond quickly to customer demands that are becoming increasingly complex without any compromise on quality and performance. \nOmega has invested in a 50-tonne injection moulding machine at its Hartlepool plant, which it says will enable a 25% increase in production for customers in the medical sector. Omega Plastics managing director Gary Powner (Photo: Copyright unknown) 8:53 Jonathon Manning Fish and chip firm hopes to make £1m from cooking oil energy scheme \nA North East company that is one of the country’s largest suppliers to the fish and chip market is eyeing increased turnover after help from a local manufacturing scheme. \nHenry Colbeck, which employs 150 people at its headquarters on the Team Valley, is hoping to pull in £1m after being given help from the North East LEP’s manufacturing growth programme which will allow it to turn used cooking oil into green energy. \nThe firm used the scheme to access expert advice that helped it gain the Environment Agency permits necessary for the oil conversion project. \nChairman Bill Colbeck said: \nWe had built up a lot of knowledge regarding setting up a safe, efficient processing plant, but we needed advice on obtaining the necessary environmental permits. We had hit a bottleneck, preventing us from developing the project into a successful commercial venture. \nThe company worked with BE Group and Improvement Architecture to draw up a plan necessary to achieve the necessary approvals. \nIt is now awaiting an audit from the Environment Agency and expects a processing plant for used cooking oil will add £1m to its turnover within 18 months. \nColin Bell, business growth director at the North East LEP said: \nThe Manufacturing Growth Programme supports the goal set out in our Strategic Economic Plan; to create more and better jobs in key areas of growth for the region. \nIt’s great to see the positive impact that the programme has had on Henry Colbeck and we look forward to hearing from other companies who’d like to pursue growth. The Henry Colbeck headquarters in Gateshead (Photo: Publicity Pic) 8:48 KEY EVENT Manufactures urge Government to keep single market access \nAccess to the single market should be put firmly back on the agenda following the General Election result or work could be lost to other countries, a business group is urging. \nThe EEF, which represents 20,000 manufacturing firms, said that unless a more pro-business stance is taken in Brexit negotiations, companies could be forced to switch business plans away from the UK. \nAlmost one in four manufacturers were already reviewing their business strategy before last week’s election, said the EEF. \nChief executive Terry Scuoler said: \nThe new Government’s priorities must radically re-focus Brexit negotiations around trade and close co-operation ensuring a smooth exit from the EU. \nThere are numerous ways of establishing a new relationship with the EU and, given we’ve just wasted a year, the Government needs to move away from its previous rhetoric and start repairing relations with EU partners. \nThis means putting access to the single market and a form of customs union at the heart of a revised strategy. \nThe UK can surely manage who is and who is not in the country by introducing a more effective and robust form of immigration control which maintains the rights of EU citizens and UK citizens across Europe. \nWith less than two years to negotiate a meaningful deal, the Government should commit to a significant period of transition to manage uncertainty for businesses and bolster confidence. Terry Scuoler (Photo: EEF)", "external_links": [], "published": "2017-06-13T15:25:00.000+03:00", "crawled": "2017-06-13T10:44:07.002+03:00", "highlightTitle": ""}