{"organizations": [], "uuid": "544a71d8340b17eb3defd8e3033e154ead8a9d33", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30373641/16031486.jpg", "site_section": "http://www.middevongazette.co.uk/news.rss", "section_title": "Devon Live news RSS feed", "url": "http://www.devonlive.com/money-and-reform-to-cure-nhs-ills-in-devon-and-cornwall/story-30373641-detail/story.html", "country": "GB", "title": "Only money and reform can cure NHS in Devon and Cornwall", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-06T17:02:00.000+03:00", "replies_count": 0, "uuid": "544a71d8340b17eb3defd8e3033e154ead8a9d33"}, "author": "Western Morning News", "url": "http://www.devonlive.com/money-and-reform-to-cure-nhs-ills-in-devon-and-cornwall/story-30373641-detail/story.html", "ord_in_thread": 0, "title": "Only money and reform can cure NHS in Devon and Cornwall", "locations": [], "entities": {"persons": [{"name": "andrew lansley", "sentiment": "none"}, {"name": "stuart logan", "sentiment": "none"}], "locations": [{"name": "devon", "sentiment": "none"}, {"name": "cornwall", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}], "organizations": [{"name": "cornwall by western morning news", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "institute of health research", "sentiment": "none"}, {"name": "office of budget responsibility", "sentiment": "none"}, {"name": "university of exeter medical school", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Western Morning News   0 COMMENTS SHARES The new government must take urgent action on the NHS, says Professor Stuart Logan Only money and reform can cure NHS in Devon and Cornwall   Comments (0) \nSumming up the political challenges and opportunities facing health in the Westcountry is in some ways ludicrously easy – one word will suffice: resources. \nOf course the picture is also mind-bogglingly complex with debates about how best to divide the work and the resources between different bits of the health service and between health and social. \nYet the simple fact remains that the major problem is funding. Spend on healthcare has declined, as a proportion of GDP, per person and compared to demand. We now spend a smaller proportion of GDP on health than any rich country other than Italy. All organisations have room to become more efficient but the NHS is the most efficient healthcare service in the world in terms of what we achieve with the resources we have. The problems are worsened by a dramatic decline in spend on social care, of nearly a third. We have the greatest need for health services at either end of life, first as children and then as older people. \nIn 2016/17, the number of over 65s rose by 2% – yet the number of people over 65 receiving social care services fell by that same number. That has a knock-on effect. People who were managing to live at home, with care support, are now getting less help, making them more vulnerable when things go wrong. A minor illness or fall can be enough to tip them over the edge, no longer able to fend for themselves. The lack of easily accessed crisis support means they often end up being admitted and may stay longer than needed because of a lack of community back up. This is bad for the patients and for hospitals trying to manage scarce beds. \nThis is particularly problematic in the Westcountry, which is around 20 years ahead of other parts of the country in terms of the increasingly ageing population. \nThe really frustrating aspect is that we now have so much more ability to help people live longer, happier, more productive and fulfilling lives. Much of the increased need for funding in the health service is driven by us wanting to deliver effective ways of saving lives and reducing disability. \nTake stroke, the fourth biggest killer in the UK. We've seen incredible progress. A generation ago we just treated people's symptoms when they had a stroke and tried to rehabilitate them afterwards. We now have drugs that break up the clots that cause strokes and dramatically improve what happens. Recent evidence suggests that a new procedure where doctors use a hi-tech piece of equipment which essentially \"fishes\" the clot out of the blood vessels can revolutionise the outcome even further. But if we want to make sure that the people who need the procedure can benefit then we need to fund the necessary facilities and doctors. \nThe same is true across most areas of health care with big advances being made in science but us battling to deliver their benefits across the country. Often we languish behind other developed countries in terms of delivery, with cancer death rates for instance being significantly poorer than other parts of Europe. \nIf we want a health and social service which supports people to be independent and healthier for longer, and uses the best technological and research advances then, as a society, we need to be willing to pay for it. The Office of Budget Responsibility says we need to increase healthcare spend4% above inflation – that is a stark figure, but if we are to provide quality healthcare there is no other choice. Rightfully, the NHS is a source of great pride in this country, and I believe people are willing to contribute to its success, with the right assurances that the money would make improvements that would benefit all of us. \nIf we want the most benefit, we also need to scrap many of the NHS reforms initiated by Andrew Lansley. These tried to force competition between organisations and the contracting out of chunks of the service into the private sector into a system which desperately needs cooperation and integration. The changes have been a disaster – they've caused chaos in the system, with a lack of clarity over who is responsible for what. We need to abolish this waste of resources and build a properly-managed system with a clear strategic vision and clear accountability. \nIt's also imperative that we scrap the idea of companies profiting from healthcare. There is not a jot of evidence that contracting out services into the private sector has improved efficiency and lots of evidence that it has led to fragmentation of services. \nIt is bureaucratic, wastes money and diverts attention from the strategic delivery of service where, when and how it is needed. We need to involve patients and the public in the way we design services, put our faith back into the people within the NHS and ensure they have the resources to deliver the best quality service. \nPromises over healthcare were one of the key factors that swayed the Brexit vote, and will be key in this election too. The NHS is under extreme pressure, but it is not yet broken. The next Government will need to invest and prioritise healing the system to avoid it ending in intensive care. \nProfessor Stuart Logan is director of the Institute of Health Research, University of Exeter Medical School. \nREAD NEXT", "external_links": [], "published": "2017-06-06T17:02:00.000+03:00", "crawled": "2017-06-06T12:48:27.003+03:00", "highlightTitle": ""}