{"organizations": [], "uuid": "1f1c109b8d36d5ffc6641d3b53ad4667ef017e4b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13219376.ece/ALTERNATES/s1200/The-State-Opening-Of-Parliament-2017.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/how-queens-speech-affect-you-13219242", "country": "GB", "domain_rank": 21960, "title": "How will the Queen's Speech affect you? We look at the key points", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-21T23:06:00.000+03:00", "replies_count": 0, "uuid": "1f1c109b8d36d5ffc6641d3b53ad4667ef017e4b"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/how-queens-speech-affect-you-13219242", "ord_in_thread": 0, "title": "How will the Queen's Speech affect you? We look at the key points", "locations": [], "entities": {"persons": [{"name": "prince charles", "sentiment": "none"}, {"name": "bill  the bill", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "bill", "sentiment": "none"}, {"name": "elizabeth ii", "sentiment": "none"}, {"name": "jonathan walker", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "westminster", "sentiment": "none"}, {"name": "north east england", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "house of lords", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "chamber of commerce", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News How will the Queen's Speech affect you? We look at the key points The Queen's Speech lays out new laws that ministers want to pass in the coming year - here's how they affect you Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily     \nHow will the Queen’s Speech affect you? \nThe Queen’s Speech is when the Government sets out its plans for the future. \nUsually, this means the next year. \nBut this time, Prime Minister Theresa May decided it should cover the next two years. \nThere weren’t many big announcements, perhaps partly because the focus at Westminster is going to be about Brexit. \nHere’s how the Queen’s Speech could affect you: Brexit Queen Elizabeth II reading the Queen's Speech in the House of Lords (Photo: PA) \nThe Government announced a number of laws designed to make Brexit happen. So if you back Brexit, rest assured that the Government is pressing ahead. \nAnd if you hoped it might not happen after all, then it’s bad news. \nFishermen might be pleased that the Government plans a specific law to allow it to control fishing quotas, currently controlled by the EU. \nAnd farmers might be reassured by plans for an Agriculture Bill, to support them once we quit the EU and no longer receive subsidies under the Common Agricultural Policy. \nAn Immigration Bill will allow the UK to control immigration from EU countries . \nBut there was no announcement about what will happen to EU migrants already living legally here in the UK. Car workers \nCar workers might be pleased that the Government is attempting to boost the automotive sector by planning new chargepoints for electric cars at garages and motorway service stations. \nThe idea is to encourage people to buy electric cars. \nAnd laws will also ensure automated vehicles can be insured. \nThis will help manufacturers build and sell self-driving cars in the UK. Aerospace workers Queen Elizabeth II and Prince Charles (Photo: Getty Images Europe) \nAerospace workers and other people in manufacturing might welcome laws designed to encourage commercial spaceflight, such as launching satellites and “spaceplanes” from the UK. Fuel bills \nThe Government will press ahead with introducing smart meters in homes, which it says will help people monitor how much fuel they use and allow them to cut bills. \nBut a previous plan to cap fuel bills for some people appears to have been scrapped. Holidaymakers \nLaws will extend existing protection for holidaymakers - such as compensation if you book a holiday with a company which goes out of business - to people who booked online. Tenants \nA new law will ban firms from charging “letting fees” when they find a property for tenants in the private sector. \nIt will also cap holding deposits at no more than one week’s rent and security deposits at no more than one month’s rent Domestic violence \nA new law will create a Domestic Violence and Abuse Commissioner to stand up for victims and survivors. It will also ensure that courts can hand down tougher sentences if abusive behaviour involves a child. Drivers \nChanges to insurance law to crack down on fraudulent whiplash claims are expected to reduce motor insurance premiums by about £35 per year. Read More Government vows to continue military battle against ISIS but victory will take 'time and patience' Financial Guidance and Claims Bill \nThe Bill will combine three financial advice bodies into one, ensuring that people across the UK are able to seek the help and advice they need to manage their finances. Armed forces \nA new law will allow Service personnel returning from special leave including maternity, shared parental and adoption leave to have more options to support an easier transition back into duty. Patients \nLegislation will establish a Health Service Safety Investigation Body to conduct independent and impartial investigations into patient safety in the NHS in England. This is designed to improve safety and also to reassure patients. Low-paid workers \nThe Government said it will continue to increase the living wage. Business \nThe Government will continue to develop an industrial strategy “to ensure all parts of the country share in economic success”, it says. \nNorth East Business leaders gave the speech a cautious welcome. \nJonathan Walker, head of policy and campaigns at North East England Chamber of Commerce said: “As we expected the issue of Brexit will dominate parliamentary business for the next two years. \n“The range of bills and policy announcements demonstrated what a multi-faceted and complex process that will be. The Government has to stay true to its promise to build a consensus with business on the final shape of Brexit. \n“We welcome the continued commitment to implement an industrial strategy. \n“Our members know that unique economic conditions exist in different parts of the country and want national decision making to recognise this. \n“Business has responded strongly to the Green Paper on issues such as energy, infrastructure and the role of place. The final strategy must be developed in partnership with the business community. \n“The Chamber has been a strong voice for increased support for exporters, especially in the context of Brexit so we are pleased the Government has heeded this call. \n“This is something we have campaigned for over many years. This needs to be a substantial investment and matched to the actual needs of business. \n“We also welcome the investment in electric cars and satellite technology both of which must be developed on the back of the unique expertise that exists in the North East in both of these fields.” Like us on Facebook", "external_links": [], "published": "2017-06-21T23:06:00.000+03:00", "crawled": "2017-06-21T18:17:45.002+03:00", "highlightTitle": ""}