{"organizations": [], "uuid": "c5a667c53b0b21fbf870468320acc4b684ab6e35", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13251916.ece/ALTERNATES/s1200/Virgin-Trains-East-Coast-workers-strike.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/east-coast-rail-operation-talks-13251770", "country": "GB", "domain_rank": 21960, "title": "East Coast rail operation in talks with Government over franchise after profits slump", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-28T15:59:00.000+03:00", "replies_count": 0, "uuid": "c5a667c53b0b21fbf870468320acc4b684ab6e35"}, "author": "Agency Staff", "url": "http://www.chroniclelive.co.uk/business/business-news/east-coast-rail-operation-talks-13251770", "ord_in_thread": 0, "title": "East Coast rail operation in talks with Government over franchise after profits slump", "locations": [], "entities": {"persons": [{"name": "julie palmer", "sentiment": "none"}, {"name": "mick cash", "sentiment": "none"}, {"name": "martin griffiths", "sentiment": "none"}], "locations": [{"name": "east coast", "sentiment": "none"}, {"name": "east midlands trains", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "stagecoach share a virgin trains east coast", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "edinburgh", "sentiment": "none"}, {"name": "west coast", "sentiment": "none"}, {"name": "virgin trains east coast", "sentiment": "none"}, {"name": "east midlands", "sentiment": "none"}], "organizations": [{"name": "east coast", "sentiment": "negative"}, {"name": "bank", "sentiment": "none"}, {"name": "west coast partnership", "sentiment": "none"}, {"name": "department for transport", "sentiment": "none"}, {"name": "virgin trains east coast and virgin rail group", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "invalid email  stagecoach", "sentiment": "none"}, {"name": "begbies traynor", "sentiment": "none"}, {"name": "virgin trains east coast", "sentiment": "none"}, {"name": "south eastern", "sentiment": "none"}, {"name": "rail", "sentiment": "none"}, {"name": "sncf", "sentiment": "none"}, {"name": "rmt", "sentiment": "none"}, {"name": "maritime and transport", "sentiment": "none"}, {"name": "stagecoach", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "network rail", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "East Coast rail operation in talks with Government over franchise after profits slump Line serving Newcastle and the North East has led to profits falling at transport giant Stagecoach Share A Virgin Trains East Coast train (Photo: PA) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nStagecoach is in talks with the Government over its contract to operate the East Coast Main Line after exceptional charges linked to the loss-making franchise hit its profits last year. \nThe train and bus operator said pre-tax profit plunged from £104.4m to £17.9m in the year to April 29 after booking an £84.1 million exceptional charge to “provide for anticipated losses” under the East Coast contract, which it jointly runs with Virgin. \nStagecoach was also hit by a £44.8m non-cash exceptional impairment linked to the Virgin Trains East Coast franchise , which links Newcastle with London and Edinburgh. \nChief executive Martin Griffiths said: “We are engaged in discussions with the Department for Transport regarding our respective contractual rights and obligations under the current Virgin Trains East Coast franchise and reflecting the reprioritisation of Network Rail’s infrastructure programme. \n“However, separately we have made financial provisions to reflect the short-term outlook for that business over the next two years, including in view of the weak growth environment affecting the UK rail sector as a whole. \n“We are disappointed to report losses at Virgin Trains East Coast. However, I am confident that we can return the business to profitability.” \nTo compound matters, Stagecoach also said that slowing economic growth, the Brexit vote and terrorism have begun to take their toll on the company. \nRevenue is not growing as strongly as anticipated as sales are hit by “increased terrorism concerns and political uncertainty”, as well as “macroeconomic” factors, the firm said. \nRevenue came in at £3.9bn last year compared with £3.8bn. \nThe firm said it is taking action across its bus network, including targeted network, pricing and management changes. \nThe company operates routes such as South West Trains, East Midlands Trains, Virgin Trains East Coast and Virgin Rail Group’s West Coast franchise. Read More \nIt has also been shortlisted for new East Midlands and South Eastern rail franchises and has embarked on a new joint venture with Virgin and SNCF, which is shortlisted to bid for the West Coast Partnership rail franchise. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nStagecoach shares were derailed in morning trading, with the firm the biggest faller on the FTSE 250. \nThe stock was down more than 7% to 188.6p as investors digested the news. \nJulie Palmer, partner at Begbies Traynor, said: “Despite cheaper fuel prices reducing the group’s cost base, Stagecoach’s profit margins continue to shrink as the transport giant struggles to maintain dwindling passenger numbers in the face of growing economic headwinds and rising inflation. \n“All hopes now rest with the rail division’s high-profile tenders for the new East Midlands, South Eastern and West Coast rail franchises, including the first few years of operation of HS2 services. \n“Securing these significant opportunities would provide a much-needed boost to shareholder morale following recent disappointments.” \nMick Cash, general secretary of the Rail, Maritime and Transport (RMT) union, said the announcement gives further weight to the idea that the franchise should be re-nationalised. Read More Co-operative Bank secures rescue package after getting £700m from existing investors \n“RMT warned that re-privatising East Coast, after it had been successfully run in the public sector following the last private failure, was a gamble doomed to failure. We have been proved right. \n“This is the third private operator to run the vital East Coast inter-city routes into the ground and rather than waiting for the inevitable financial collapse it should be brought back into public ownership immediately,” he said. Like us on Facebook", "external_links": [], "published": "2017-06-28T15:59:00.000+03:00", "crawled": "2017-06-29T03:01:27.024+03:00", "highlightTitle": ""}