{"organizations": [], "uuid": "88cb72a35edad93b4382eb62f91ae550da8f5539", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article13252207.ece/ALTERNATES/s1200/eu.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/50000-eu-nationals-north-east-13251541", "country": "GB", "domain_rank": 21960, "title": "50,000 EU nationals in the North East may have to apply for 'settled status'", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-28T18:00:00.000+03:00", "replies_count": 0, "uuid": "88cb72a35edad93b4382eb62f91ae550da8f5539"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/50000-eu-nationals-north-east-13251541", "ord_in_thread": 0, "title": "50,000 EU nationals in the North East may have to apply for 'settled status'", "locations": [], "entities": {"persons": [{"name": "jeremy corbyn", "sentiment": "none"}, {"name": "tyne", "sentiment": "none"}, {"name": "helena", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "lianna", "sentiment": "none"}, {"name": "maria hussaini", "sentiment": "none"}, {"name": "maria", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "glastonbury", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "romania", "sentiment": "none"}, {"name": "cyprus", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "scandinavia", "sentiment": "none"}, {"name": "malta", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "sweden", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "poland", "sentiment": "none"}, {"name": "slovakia", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "bulgaria", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "croatia", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News 50,000 EU nationals in the North East may have to apply for 'settled status' But as the uncertainty over the Brexit terms continues many might just choose to up sticks and go Share Maria Hussaini (right) says she may leave the UK rather than apply for 'Settled Status' following Brexit Share Get daily updates   Thank you for subscribing! Could   \nAs many as 50,000 EU nationals in the North East may have to apply for ‘settled status’ to stay in Britain after Brexit , we can reveal. \nHowever as the uncertainty over the specifics of the arrangement continue, many could choose to up sticks and leave. \nTheresa May said yesterday the three million EU citizens in Britain will have to apply for ‘settled status’ to stay living here after we leave the EU, which will likely happen in 2019. \n‘Settled status’ will mean they will be allowed to carry on living in Britain indefinitely after we leave the EU . \nTo qualify they will have to lived in the UK for five years but no clear cut-off date has been set. EU and Union flags (Photo: PA) \nFor some like Maria Hussaini from Slovakia who has lived in Newcastle for 15 years, it might be a reason to pack her bags and leave. \nShe said: “To be honest I’m really not following the news about it now. But if it’s a case of the authorities saying you have to go I’ll say, no problem, goodbye. \n“I have Polish friends who would rather go than have to apply for permission to stay if it’s too complicated. A number have left already.” \nMaria, 35, arrived in the region in 2002 as an Au Pair. She has since married - and divorced - and has two children, Lianna, aged five, and two-year-old Helena. She even holds a residency card. \nMaria, a part time dinner lady, said: “I’d like to thank the UK for offering me the opportunity to live and work here but I can still go back to my home country.” Read More \nShe said that while she has enjoyed her time in Britain, for many EU nationals who come here, it would be easy for them to move on. Maria Hussaini \n“In parts of the EU people have the ‘big eye’ for England. They see it as a powerful country. The reality is, it’s not a huge difference to the country they come from. \n“You still have to work - you don’t get anything for free.” Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nOf the 50,000 EU nationals living in the North East , according to the latest government figures, about half are thought to be in Tyne and Wear with the remainder living in the rest of the region. About 26,000 of the total are from the so-called ‘EU14’, which roughly corresponds to the EU countries in western Europe and Scandinavia such as France, Germany and Sweden. \nAnother 19,000 are from the countries in central Europe such as Poland and Slovakia that joined the EU in 2004. A further 5,000 are from Romania and Bulgaria and 1,000 from Malta, Cyprus or Croatia. \nThe overall number of European citizens living in the North East has risen from 43,000 in 2010. Prime Minister Theresa May (Photo: PA) \nAt some point the Government will declare a ‘specified date’ after which EU nationals won’t be almost guaranteed the right to stay. \nThis will be set as sometime between March 2017, when we notify Brussels of our intention to withdraw from the EU, and the date we actually leave. Read More Jeremy Corbyn receives rockstar welcome in front of thousands at Glastonbury \nEffectively any EU citizens living in Britain before this date will be able to apply for settled status. \nMaria added: “It’s all a bit of a mess. I don’t think they’ll be able to sort it out in two or three years. I think there will be a mess for another five years.” Like us on Facebook", "external_links": [], "published": "2017-06-28T18:00:00.000+03:00", "crawled": "2017-06-28T18:43:10.000+03:00", "highlightTitle": ""}