{"organizations": [], "uuid": "28346c41c5c3ed3d796408b752538b5a595e6108", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30366575/16026591.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "Devon Live Editor's Choices RSS feed", "url": "http://www.devonlive.com/tax-bills-could-help-decide-who-gets-winter-fuel-allowance-hustings-told/story-30366575-detail/story.html", "country": "GB", "title": "Tax bills could help decide who gets winter fuel allowance,...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-01T22:21:00.000+03:00", "replies_count": 0, "uuid": "28346c41c5c3ed3d796408b752538b5a595e6108"}, "author": "TinaCrowson", "url": "http://www.devonlive.com/tax-bills-could-help-decide-who-gets-winter-fuel-allowance-hustings-told/story-30366575-detail/story.html", "ord_in_thread": 0, "title": "Tax bills could help decide who gets winter fuel allowance,...", "locations": [], "entities": {"persons": [{"name": "deborah brewer", "sentiment": "none"}, {"name": "sam moss", "sentiment": "none"}, {"name": "kevin foster", "sentiment": "none"}, {"name": "devon  tony mcintyre", "sentiment": "none"}, {"name": "paul raybould", "sentiment": "none"}], "locations": [{"name": "torquay", "sentiment": "none"}, {"name": "brixham", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "torquay herald express", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}, {"name": "lib dem", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "torquay general election", "sentiment": "none"}, {"name": "green party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Tax bills could help decide who gets winter fuel allowance, hustings told X \nCopy link to paste in your message / Comments (0) \nTHE taxman could be given the job of sorting out who gets winter fuel payments, it was revealed at a Torquay General Election hustings. \nThe Conservatives' proposal to means test the winter fuel allowance for pensioners was among the issues raised at the grilling of the seven Torbay candidates at the Princess Theatre at hustings organised by the Torquay Herald Express and Torbay Business Forum. \nTorbay has a high proportion of pensioners and a member of the audience warned that any introduction of means testing of the benefit would mean the elderly in particular would be likely to miss out, even if they qualified, because they are less likely to apply. \nThe resident who raised the question during a discussion on funding social care, said the weather did get cold in Torquay and if the elderly get cold they are at more risk of falls and health problems like strokes, heart attacks and respiratory problems, which would cost more in the long term to resolve. \nRead more: Torbay Airshow 2017: Absolutely everything you need to get the best out of the show \nMost older people would need help filling out forms and this would make administration expensive. “If we believe means testing is a fair system, why don't we apply it to every other aspect of social care, and the answer is because it's not fair,\" he said calling for the withdrawal of the proposal. \nKevin Foster, the Tory candidate, said under the proposal it was likely to be administered by the taxman, those who don't pay income tax would still receive it, those in the 40 per cent band would almost certainly not. “I think it's safe to say if you are paying 40 per cent tax most would say you don't perhaps need £200 to heat your house this Christmas.\" \nHe said there would be consultation. His own view was that there would be a sliding scale and that the line would be drawn at around the average income, around £17,000. “We have to make choices, it has been suggested before by other parties that this is one to ask people on higher incomes to in retirement to give up and it's a suggestion we now accept.\" He said a similar system had been used for child benefit payments. \nRead more: Police appeal after group try to kick down gates in South Devon \nTony McIntyre (UKIP) said the fuel allowance had originally been sold as a cost effective way of putting more money into helping pensioners with winter costs. “If you introduce a series of rather complicated rules and regulations, you are going to have to have people to process those. I cannot see for the life of me how any money will be saved. If the whole point is to save money, then it is a complete and utter waste of time.\" \nDeborah Brewer (Lib Dem), said she totally disagreed with it. “I think everyone should have it. My mother might fall into the category where she is considered to have enough money, but it makes the difference between whether she turns the heating on or not.\" \nSam Moss, Green Party, said the bigger picture was that British homes needed to be made warm and dry to winter fuel payments were not needed. He said means testing was a 'real pain in the arse' and it should not be used for benefits for anyone. There should be a citizens' pension which would save the state money and give people a better quality of life. \nPaul Raybould, Labour, said:\" to think the elderly are going to be means tested for any benefit is utterly abhorrent. They paid their taxes and national insurance through their lives. They want to be treated with dignity, properly for the rest of their days.\" \nSchool funding, transport, the impact of Brexit on foreign workers in tourism and the care industry and Brixham fishermen were among the other hot topics of the night. \nA straw poll taken afterwards of the non representative audience showed 93 'votes' cast were: \nLib Dem 31 (33.3 per cent) \nCons 24 (25.8 per cent) \nLab 19 (20.4 per cent) \nGreen 12 (12.9 per cent) \nUKIP 7 (7.5 per cent).", "external_links": [], "published": "2017-06-01T22:21:00.000+03:00", "crawled": "2017-06-01T18:01:14.005+03:00", "highlightTitle": ""}