{"organizations": [], "uuid": "c9f9c00a13082697c63cfe48b06975188dab0138", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article12113489.ece/ALTERNATES/s1200/Nissan-Qashqai-SUV-to-be-built-at-Sunderland.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/nissan-car-makers-face-cliff-13211468", "country": "GB", "domain_rank": 21960, "title": "Nissan and other car makers face 'cliff edge' on Brexit, industry warns", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-20T20:28:00.000+03:00", "replies_count": 0, "uuid": "c9f9c00a13082697c63cfe48b06975188dab0138"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/nissan-car-makers-face-cliff-13211468", "ord_in_thread": 0, "title": "Nissan and other car makers face 'cliff edge' on Brexit, industry warns", "locations": [], "entities": {"persons": [{"name": "mike hawes", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "south tyneside", "sentiment": "none"}], "organizations": [{"name": "society of motor manufacture", "sentiment": "negative"}, {"name": "nissan", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "wto", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "smmt", "sentiment": "none"}, {"name": "world trade organisation", "sentiment": "none"}, {"name": "society of motor manufacturers", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Nissan and other car makers face 'cliff edge' on Brexit, industry warns Society of Motor Manufacturers and Traders says Government must ensure access to European markets after 2019 Share Workers at Nissan (Photo: Owen Humphreys/PA Wire) Share Get business updates   \nCar manufacturers like Nissan need the Government to guarantee access to European markets if they are to avoid a “cliff edge” that will hit jobs in the UK, an industry body has said. \nThe Society of Motor Manufacturers and Traders (SMMT) said it does not believe the Government can reach a full trade arrangement with the EU before the Article 50 negotiations are scheduled to end in March 2019. \nWithout interim arrangements offering full access to the European market, SMMT said, the automotive industry would be left to trade under World Trade Organisation rules - “the worst foreseeable outcome for the sector, its employees and the British economy”. \nNissan, which employs 7,000 people at Sunderland and supports thousands more jobs in the region through its supply chain, has said on a number of occasions in the last year that it will review the Wearside plant’s competitiveness once the UK’s relationship with the EU is settled. \nThe future of the company has taken on added significance in recent years with the development of a massive automotive park next to its factory which is hoped will create 5,000 jobs. \nThe International Advanced Manufacturing Park, on the border between Sunderland and South Tyneside, has taken a huge share of the public funding going to job creation in the North East. \nNegotiations between the UK and the EU formally began yesterday but trade talks will not begin until October at the earliest after the EU set the timetable and said citizens’ rights, the UK’s financial settlement - the so-called divorce bill - and other issues to do with separation had to be sorted first. \nSMMT chief executive Mike Hawes said, “We accept that we are leaving the European Union and we share the desire for that departure to be a success. Read More Nissan to let drivers sell electricity back to the grid through new partnership \n“But our biggest fear is that, in two years’ time, we fall off a cliff edge – no deal, outside the single market and customs union and trading on inferior WTO terms. This would undermine our competitiveness and our ability to attract the investment that is critical to future growth. \n“That’s why we have to be honest with ourselves. If the UK cannot secure – and implement – a bespoke and comprehensive new relationship with the EU in two years’ time, we need a back-up plan. \n“Having looked at all the alternatives, we need Government to seek an interim arrangement whereby we stay within the single market and customs union until that new relationship is implemented.” \nSMMT said it was time to be pragmatic about what can be achieved in the time available for talks with the EU and what the consequences would be if the UK left without a deal. \nThe UK and EU automotive sectors are highly integrated and any new relationship will need to address complex issues around tariffs, regulations and labour issues. \nThe SMMT call came as it announced the UK automotive industry recorded turnover of £77.5bn in 2016, the highest amount on record, while productivity was also at a record high. \nNissan declined the comment.", "external_links": [], "published": "2017-06-20T20:28:00.000+03:00", "crawled": "2017-06-20T16:02:34.000+03:00", "highlightTitle": ""}