{"organizations": [], "uuid": "51079d0968907e003e3fc13ca0bf8b96dae99936", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30402378/16053137.jpg", "site_section": "http://www.middevongazette.co.uk/politics.rss", "section_title": "Devon Live Politics RSS feed", "url": "http://www.devonlive.com/mps-must-work-together-to-stop-gross-act-of-self-harm-hard-brexit-ben-bradshaw-opinion/story-30402378-detail/story.html", "country": "GB", "title": "Ben Bradshaw Column: MPs must work together to stop 'gross act of...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-21T18:51:00.000+03:00", "replies_count": 0, "uuid": "51079d0968907e003e3fc13ca0bf8b96dae99936"}, "author": "DanielClark", "url": "http://www.devonlive.com/mps-must-work-together-to-stop-gross-act-of-self-harm-hard-brexit-ben-bradshaw-opinion/story-30402378-detail/story.html", "ord_in_thread": 0, "title": "Ben Bradshaw Column: MPs must work together to stop 'gross act of...", "locations": [], "entities": {"persons": [{"name": "danielcl", "sentiment": "none"}, {"name": "ben bradshaw", "sentiment": "none"}, {"name": "ted heath", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "jeremy", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}], "locations": [{"name": "exeter", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}], "organizations": [{"name": "nhs", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Ben Bradshaw Column: MPs must work together to stop 'gross act of self-harm' hard Brexit By DanielClark | Posted: June 21, 2017 0 COMMENTS SHARES \nBen Bradshaw is the Labour MP for Exeter and has been since 1997 \nWhat an extraordinary election that was! \nJust over two months ago, when Theresa May called her unnecessary snap poll, I thought I might be spending this week down the Job Centre. The Conservatives were 24% ahead in the opinion polls and looked to be heading for a landslide. \nSo what happened? \nFirstly, the British public don't like being taken for granted. The last Prime Minister to call an unnecessary early election, sensing electoral advantage, was Ted Heath in 1974. He lost. Read more MP Ben Bradshaw officially opens bike workshop which offers training to vulnerable people \nSecondly, the Conservative campaign was the worst in living memory. Exeter was the Tories' only target seat in the South West, yet their activists were almost non-existent. My campaign had scores of enthusiastic volunteers knocking on voters' doors ten hours daily. The Conservatives relied on nationally-produced direct mail focusing heavily on Theresa May and ignoring local issues. The Tories only wanted to talk about Brexit, while the public were concerned about falling living standards, damaging cuts to schools and the NHS and our housing affordability crisis. \nThirdly, Mrs May's manifesto was a disaster. I had life-long Tory voters come up to me in the street the day it came out saying they'd be voting Labour because of the dementia tax. It wasn't just the Conservatives' assault on pensioners - their manifesto had little to offer anyone, except five more years of misery. Labour's manifesto, by contrast, had policies people actually liked. It offered hope. Read more Exeter's Ben Bradshaw spreading the love is the must watch video of the election \nFourthly, Jeremy Corbyn and the national Labour Party had a cracking campaign. While Theresa May was hidden from ordinary folk and journalists, Jeremy was in his element, throwing himself into crowds and exceeding people's expectations on TV and radio. He looked comfortable in his own skin and talked about things people care about, while Mrs May sounded increasingly robotic, repeating her empty campaign slogan \"strong and stable\", to widespread ridicule. \nFinally, the inaccurate opinion polls worked, for the first time, to Labour's advantage. Previously, the polls had always underestimated the Conservatives' lead. This time, they overestimated it, by failing to predict the higher than usual turn-out among young people. The assumption of most people, right to the end, was an increased Conservative majority. I felt positive on polling day in Exeter and satisfied we couldn't have worked harder. But, never did I imagine, until I saw the ballot papers piling up at the count, the result we achieved, locally or nationally. The public had recoiled from giving Mrs May her landslide and delivered, instead, a hung Parliament. \nThe election has changed everything, but Mrs May and her Ministers don't seem to understand that. Parliament, instead of dealing with the big, urgent challenges facing Britain, is now being asked to spend the whole of the next two years implementing Mrs May's extreme, damaging version of Brexit. MPs of all parties must work together in the national interest to stop this gross act of self-harm. For Labour, this is a huge opportunity to prove we are a credible alternative Government-in-waiting and can win the next election, whenever it comes. ", "external_links": [], "published": "2017-06-21T18:51:00.000+03:00", "crawled": "2017-06-21T15:06:57.006+03:00", "highlightTitle": ""}