{"organizations": [], "uuid": "82cfcf235698d9ae5eb78636d00a12e7806e9a80", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13127363.ece/ALTERNATES/s1200/JS121500589.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/election-exit-poll-hung-parliament-13158705", "country": "GB", "domain_rank": 21960, "title": "Exit poll says it will be a hung parliament in General Election sensation", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-09T05:50:00.000+03:00", "replies_count": 0, "uuid": "82cfcf235698d9ae5eb78636d00a12e7806e9a80"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/election-exit-poll-hung-parliament-13158705", "ord_in_thread": 0, "title": "Exit poll says it will be a hung parliament in General Election sensation", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "jenny chapman", "sentiment": "none"}, {"name": "bridget phillipson", "sentiment": "none"}, {"name": "yougov", "sentiment": "none"}], "locations": [{"name": "sunderland west", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "darlington", "sentiment": "none"}, {"name": "sunderland south", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "houghton", "sentiment": "none"}], "organizations": [{"name": "general election sensation news exit", "sentiment": "negative"}, {"name": "bbc", "sentiment": "none"}, {"name": "snp", "sentiment": "none"}, {"name": "sunderland central", "sentiment": "none"}, {"name": "conservative", "sentiment": "none"}, {"name": "newcastle central and newcastle east", "sentiment": "none"}, {"name": "ipsos mori", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}, {"name": "sunderland south", "sentiment": "none"}, {"name": "gfk", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Britain heading for hung parliament putting Theresa May's future in doubt Tories set to be the biggest party but just short of an overall majority as Labour confound critics Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nJeremy Corbyn’s campaign manager has revealed his reaction to the exit polls which predicted a hung parliament. \nIan Lavery, candidate for the Wanbeck constituency in Northumberland , said: “To say that I was surprised is an understatement.” \nMr Lavery admitted he was late getting ready to attend his own constituency vote when he saw the exit poll come through. \n“I was standing half naked in front of the telly and I screamed when I saw it,” he said. \n“My wife shouted what’s the matter with you?” \nHe added: “We’ll wait and see what the final result is. \n“At the beginning of the night we thought there would be four scenarios. That we could win, which we knew was highly unlikely. \n“That there would be a hung parliament, which would be an uphill battle. \n“That we could minimise the amount of seats we lost - potentially. \n“That there would be Tory landslide - again, potentially.” Theresa May and Jeremy Corbyn \nHe added: “We have come an awful long way in six or seven weeks. When we started we were 24% down in the opinion polls. \n“But there was a buzz on the streets. People were excited and they wanted to vote. There is something happening in politics. \n“We’ve got a massive foundation to build on to change things.” \nHe said for along time Corbyn and his team were “putting out fires” as their work was hindered by internal party strife. \nSome MPs who have held their seats were out-and-out anti-Corbyn. \n“I hope all our MPs will get behind us. This is just the start. \n“We’re offering something new to the people. It’s brilliant. \n“The Tories ran a disgraceful campaign and it didn’t work.” \nAs of 3am, Labour had comfortably held all the North East seats they won in Newcastle, Sunderland, South Shields, Jarrow and North Tyneside in 2015. \nAnd, against the odds, they held Darlington where Jenny Chapman was returned with a slightly increased majority despite the marginal being heavily targeted by the Tories. Ballot boxes waiting to be counted \nThey even held Bishop Auckland, another seat Theresa May’s party was confident of taking. \nAnd in Stockton South, former Northern Powerhouse Minister James Wharton lost to Labour’s Dr Paul Williams. \nWhile there are still a number of County Durham and Northumberland seats still to declare, Labour is on course to hold all of them. \nIt has been a night full of surprises, starting from the exit poll at 10pm. \nIt said that while Theresa May’s Conservatives would be the largest party with 314 seats which would leave it 12 short of an overall majority and down 17 on 2015. \nJeremy Corbyn’s Labour would win 266 seats it said, up 34 from 2015. \nMeanwhile the Liberal Democrats would win 14 seats, up from eight at the last general election while the SNP would see its number of MPs reduced from 54 to 34. \nWhen the first results came in at Newcastle Central which beat Houghton and Sunderland South to be first to declare, it did raise some question marks about how accurate the exit poll was. Read More Follow the General Election 2017 results and updates on our interactive map \nWhile, as expected, Labour’s Chi Onwurah won the seat with nearly a 15,000 majority and, the Conservatives did better than the exit poll predicted. \nAnd when five minutes later the Houghton and Sunderland South result came in with Labour Bridget Phillipson winning as expected, her margin of victory was also much less than the exit poll predicted. \nIt should have meant a 3.5% swing to Labour, instead it was a 3.5% swing to the Conservatives. \nHowever as the night progressed the prediction was revised to the Tories winning 322 seats, still four short of a majority. \nDespite coming second, Labour is the clear winner on the night which will could prove a personal triumph for Mr Corbyn. \nThe Conservatives had as much as a 24-point lead when the snap election was called by the Prime Minister last April. \nAnd even before the exit poll there was talk of Mrs May winning as much as a 100-seat majority. \nNow her political future is in severe doubt to the extent that bookmakers Paddy Power have made Jeremy Corbyn 10/11 to be the next Prime Minister. \nMeanwhile the result casts huge doubt over Brexit talks which were due to start in 10 days time. Read More ", "external_links": [], "published": "2017-06-09T05:50:00.000+03:00", "crawled": "2017-06-09T01:08:46.655+03:00", "highlightTitle": ""}