{"organizations": [], "uuid": "3eddaf39abaa8bc4caa3f9833221c233f53cee09", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13211943.ece/ALTERNATES/s1200/CFR_NJL_091015port_01.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/port-tyne-sees-turnover-fall-13212064", "country": "GB", "domain_rank": 21960, "title": "Port of Tyne sees turnover fall 22% as it seeks new sources of revenue", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-20T21:30:00.000+03:00", "replies_count": 0, "uuid": "3eddaf39abaa8bc4caa3f9833221c233f53cee09"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/port-tyne-sees-turnover-fall-13212064", "ord_in_thread": 0, "title": "Port of Tyne sees turnover fall 22% as it seeks new sources of revenue", "locations": [], "entities": {"persons": [{"name": "tyne", "sentiment": "negative"}, {"name": "andrew moffat", "sentiment": "none"}, {"name": "hilary florek", "sentiment": "none"}, {"name": "rebecca taylor", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "port", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "riverside quay", "sentiment": "none"}], "organizations": [{"name": "business port of tyne", "sentiment": "negative"}, {"name": "lynemouth power station", "sentiment": "none"}, {"name": "port", "sentiment": "none"}, {"name": "lpl", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "lynemouth power ltd", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Port of Tyne sees turnover fall 22% as it seeks new sources of revenue Global drop in coal use has hit the Port hard and sparked investment in facilities for renewable energy Share Port of Tyne from the air (Photo: handout from Rebecca Taylor PR 07830 159 996) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe Port of Tyne saw turnover slump in 2016 as massive falls in its traditional cargo business sparked investment in new ways of attracting revenue. \nThe Port saw conventional and bulk cargo halve in 2016, leading to a 22% drop in turnover from £58.8m to £45.9m. \nA number of global factors - particularly the shift away from coal-fire power stations, which meant no coal was imported to the Port in 2016 - affected the Port’s financial results. \nThe Port’s reaction to those factors has seen it invest £14.6m to develop its infrastructure, with the bulk of that - £8.8m - being spent on facilities to handle wood pellets that will be imported for use on the Lynemouth Power Station in Northumberland after its re-fit to renewable energy production. \nThe drop in business at the port led to a corresponding decrease in employment, with 437 members of staff at the end of the year, down by 46 on the same stage in 2015. \nIn the Port’s annual report, chairman Hilary Florek said: “In 2016, the Port of Tyne has performed well across all of its business areas, with the exception of conventional and bulk cargoes which have been adversely impacted by the dramatic reduction in imported coal volumes across the UK during the past three years. \n“ Port of Tyne coal volumes adversely impacted the overall financial performance, and profitability of the business in 2016. \n“The Port, however, is in a strong position to recover from the decline in coal handling as construction of new multimillion-pound wood pellet handling and storage facilities for Lynemouth Power Ltd (LPL) is well under way and due for commissioning in the second half of 2017. Associated volumes are anticipated to be in excess of 1.8m tonnes per annum over an agreement period of 10 years. \n“The business will also be in a position to benefit from the investment made in extending its main operational Riverside Quay, which when commissioned will be nearly 1 kilometre in length. The Port is also well-placed to accommodate expansion opportunities having two large sites each having Enterprise Zone status, available for development. Read More Avid Technology targets robotics industry after £1m investment in new facilities \n“Activity at the Port’s three car terminals has remained strong and the business has retained its position as the UK’s No. 2 exporting port. \n“During the year, a record number of passengers used the Port’s International Passenger Terminal as a result of a record number of cruise ships visiting the Port. \n“The Port continued to invest heavily in the development of infrastructure with nearly £15m allocated to secure business opportunities and to improve operational efficiency. This included investment in state-of-the-art quayside unloading and conveying equipment for the LPL project, extending car terminal storage capacity for Nissan by 10 acres, taking its footprint to 80 acres, and expenditure relating to the final phases of the extension to Riverside Quay, due for completion in 2017.” Read More Nissan and other car makers face 'cliff edge' on Brexit, industry warns \nChief executive Andrew Moffat said the Port would face “further challenges” and “new uncertainties” but that “with the continue support of employees, customers and all other stakeholders, we look forward to the coming period and taking advantage of the opportunities that lie ahead.” \nThe Port said that its contribution to the region’s economy had been measured at £678m in 2016, including £51m to the tourism sector. Like us on Facebook", "external_links": [], "published": "2017-06-20T21:30:00.000+03:00", "crawled": "2017-06-20T17:02:44.004+03:00", "highlightTitle": ""}