{"organizations": [], "uuid": "6c1a824b5dac57bf5d984125045465674ecef814", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/time-lower-voting-age-16-13203801", "country": "GB", "domain_rank": 21960, "title": "Is it time to lower the voting age to 16? Labour MP says so and is building a team to do it", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-19T16:50:00.000+03:00", "replies_count": 0, "uuid": "6c1a824b5dac57bf5d984125045465674ecef814"}, "author": "Simon Meechan", "url": "http://www.chroniclelive.co.uk/news/north-east-news/time-lower-voting-age-16-13203801", "ord_in_thread": 0, "title": "Is it time to lower the voting age to 16? Labour MP says so and is building a team to do it", "locations": [], "entities": {"persons": [{"name": "jeremy corbyn", "sentiment": "none"}, {"name": "kyle", "sentiment": "none"}, {"name": "lord adonis", "sentiment": "none"}, {"name": "philip davies", "sentiment": "none"}, {"name": "andrew adonis", "sentiment": "none"}, {"name": "sydney silverman", "sentiment": "none"}, {"name": "peter kyle", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}], "organizations": [{"name": "invalid email  a labour", "sentiment": "none"}, {"name": "warwick", "sentiment": "none"}, {"name": "canterbury", "sentiment": "none"}, {"name": "hove", "sentiment": "none"}, {"name": "tory", "sentiment": "none"}, {"name": "former labour", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Is it time to lower the voting age to 16? Labour MP says so and is building a team to do it Hove MP Peter Kyle is tabling a private member's bill which aims to give the vote to 16 and 17-year-olds - but will it get through? Share Click to play Tap to play The video will start in 8 Cancel Play now   Thank you for subscribing!   \nA Labour MP says he will launch a private member’s bill which seeks to lower the voting age to 16. \nHove MP Peter Kyle and Lord Andrew Adonis tweeted about the plan on Sunday evening. \nIn the message sent to his 11,500 followers, Mr Kyle said: “The time has come to enfranchise 16 & 17-year-olds. I’m partnering with Lord Andrew Adonis to build a coalition that will deliver it.” \nFormer Labour whip and now independent peer, Lord Adonis, described the move as a way to expand democracy. \nHe posted: “I‘m tabling a private member’s bill with @peterkyle MP to lower the voting age to 16. Please message/retweet your support.” \nPrivate member’s bills are put forward by MPs who are not cabinet members. Controversial private members bills rarely pass and become laws, as opposing MPs can sabotage discussions by filibustering - where MPs stand-up and just talk continuously during the debate until the time limit expires. Read More Brexit negotiations: What will be discussed and what does the Government want? \nBut even if time runs out before the debate is closed, if 100 MPs do support the bill, it can make its way through Parliament and ultimately become law. \nSimilarly, if the bill isn’t filibustered and it wins a vote in the commons, it can move onto the second reading, the committee stage, a report, a third reading and eventually create a new law. Read More 'Not another one': A UK general election is imminent according to the bookies \nTory MP Philip Davies has become a notorious filibusterer, and ate up debate time on bills seeking to make hospital parking free for carers, a potential law which required landlords to make homes “fit for human habitation”, and an attempt to reverse NHS privatisation. \nBut private member’s bills can drive huge changes, such as the one which led to the abolition of the death penalty, which was tabled by Labour MP Sydney Silverman in 1965. Labour Leader Jeremy Corbyn speaks to party supporters (Photo: Getty Images Europe) \nWith younger voters pushing Labour into previously unlikely seat wins in the likes of Warwick and Canterbury, it’s likely the Conservatives could be less open to lowering the voting age than Jeremy Corbyn’s party. \nIn the 18-19 age group, 66% voted for Labour on June 8, compared to 19% for the Conservatives . \nTeenagers aged 16 and over were allowed to vote in the 2014 Scottish Independence referendum, with around 100,000, or 80%, registering to take their chance. It was the first time under 18s have voted in a UK election. poll loading Should 16 and 17-year-olds be allowed to vote? 0+ VOTES SO FAR", "external_links": [], "published": "2017-06-19T16:50:00.000+03:00", "crawled": "2017-06-19T12:18:14.002+03:00", "highlightTitle": ""}