{"organizations": [], "uuid": "cfb8725ba0dc6d321663b7576953a10b8a319c5b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13168051.ece/ALTERNATES/s1200/2017-General-Election.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/post-election-crisis-what-happens-13167627", "country": "GB", "domain_rank": 21960, "title": "Post-election crisis: What happens now and can Theresa May cling on to power?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-11T15:00:00.000+03:00", "replies_count": 0, "uuid": "cfb8725ba0dc6d321663b7576953a10b8a319c5b"}, "author": "Michael Muncaster", "url": "http://www.chroniclelive.co.uk/news/north-east-news/post-election-crisis-what-happens-13167627", "ord_in_thread": 0, "title": "Post-election crisis: What happens now and can Theresa May cling on to power?", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "arlene foster", "sentiment": "none"}, {"name": "ed balls", "sentiment": "none"}], "locations": [{"name": "downing street", "sentiment": "none"}, {"name": "invalid email  britain", "sentiment": "none"}], "organizations": [{"name": "house of commons", "sentiment": "none"}, {"name": "democratic unionist party", "sentiment": "none"}, {"name": "eu parliament", "sentiment": "none"}, {"name": "conservatives", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "dup", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nBritain faces an uncertain political future after a shock general election saw the Conservatives lose their Commons majority. \nMany in Westminster thought Prime Minister Theresa May would lead the Tory party to victory when she called the snap election in April. \nBut the exit poll on Thursday night correctly predicted that there would be no clear winner. \nIt comes as a huge embarrassment to Mrs May, who had set her sights on increasing her party’s majority ahead of Brexit negotiations. \nHer future is now dangling by a thread and Labour leader Jeremy Corbyn has called for her to resign. \nSo what happens when there is a hung parliament; will it affect Brexit; and could there be another election? \nHere is everything you need to know. What is a hung parliament? \nIt is when no party has an overall majority - more seats than all the other parties put together. \nThere are 650 seats in the House of Commons so an overall majority would mean winning 326. \nWithout at least 323 seats, the Government won’t be able to pass laws if all the other MPs try to stop them. Is Theresa May still prime minister? \nYes, for now. Mrs May will stay in office and live in Downing Street until it is decided who will attempt to form a new Government. \nFollowing the election, the Conservatives announced plans to form a minority Government with the Democratic Unionist Party. Are we going to have another Conservative Government? \nIf the DUP supports the Tories, then yes. \nThe two parties would together have more than the 326 seats required for a majority. \nDUP leader Arlene Foster confirmed the party would enter discussions with the Tories to “explore how it may be possible to bring stability to our nation at this time of great challenge”. Read More But could there be a coalition? \nA coalition is when two or more parties join forces, but it looks unlikely. \nAll parties talked down the prospect of forming a coalition during the election campaign. When will we know the outcome? Theresa May speaking outside Downing Street after she had been to see the Queen following the 2017 General Election result (Photo: Daily Mirror) \nThe first deadline is June 13 when the new Parliament meets for the first time. \nMrs May has until this date to put together a deal to keep herself in power or resign. \nHowever, she can wait until the new Parliament to see if she has the confidence of the House of Commons. What does it mean for Brexit? \nThe talks are expected to begin on June 19 but if the new Government isn’t formed then talks could be delayed. \nThe EU Parliament’s chief negotiator said the outcome “will make already complex negotiations even more complicated”. Read More We have a hung parliament - so what does that mean? And what is a coalition government? Could there be a second election? \nIt could well happen. Often when there is a minority Government, the prime minister will hold another election at the earliest opportunity. \nAccording to the fixed-term parliament act, an election can only be called if two-thirds of MPs vote for it. \nEd Balls, the former chancellor, said he thought there would be no coalition and we would have a second general election later this year. Like us on Facebook", "external_links": [], "published": "2017-06-11T15:00:00.000+03:00", "crawled": "2017-06-11T12:46:47.000+03:00", "highlightTitle": ""}