{"organizations": [], "uuid": "10658e30f924e65ba4ccef238958081f449185d7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://brightcove01.brightcove.com/24/4221396001/201706/1554/4221396001_5477641744001_5477638473001-vs.jpg?pubId=4221396001", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/special-features/sellick-partnership-celebrates-15-successful-13225146", "country": "GB", "domain_rank": 21960, "title": "Sellick Partnership celebrates 15 successful years as a leading provider of expert recruitment services", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-23T19:00:00.000+03:00", "replies_count": 0, "uuid": "10658e30f924e65ba4ccef238958081f449185d7"}, "author": "Anne Southby", "url": "http://www.chroniclelive.co.uk/special-features/sellick-partnership-celebrates-15-successful-13225146", "ord_in_thread": 0, "title": "Sellick Partnership celebrates 15 successful years as a leading provider of expert recruitment services", "locations": [], "entities": {"persons": [{"name": "jo", "sentiment": "none"}, {"name": "sellick partnership", "sentiment": "none"}, {"name": "jo sellick", "sentiment": "none"}, {"name": "sellick", "sentiment": "none"}, {"name": "helen dodds", "sentiment": "none"}, {"name": "kathryn heeler", "sentiment": "none"}, {"name": "helen", "sentiment": "none"}], "locations": [{"name": "liverpool", "sentiment": "none"}, {"name": "greater manchester", "sentiment": "none"}, {"name": "cumbria", "sentiment": "none"}, {"name": "leeds", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "yorkshire", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "collingwood street", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "advertorial sellick partnership", "sentiment": "positive"}, {"name": "sellick partnership", "sentiment": "positive"}, {"name": "northumbria university", "sentiment": "none"}, {"name": "hfma", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "newcastle college", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "paul currie photography ltd", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Advertorial Sellick Partnership celebrates 15 successful years as a leading provider of expert recruitment services Business has expanded rapidly and now employs 80 employees operating across seven offices around the country Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily   \nThis is a big year for one of the UK’s fastest growing and most influential recruitment agencies which has a highly successful base here in the North East. \nSellick Partnership, which was set up in 2002 is celebrating its 15th anniversary this year. The company has built up an enviable reputation as a leading provider of expert recruitment services across the UK, specialising in professional services recruitment for the private, public and not-for-profit sectors. \nThe business places professionals into a variety of positions for a wide range of companies and organisations nationwide. The business works across a range of disciplines including: Finance and accountancy, legal, HR, housing & property services, actuarial, procurement and change and transformation. \nSellick Partnership was originally set-up in Manchester, but has expanded rapidly over the past 15 years. The business now employs 80 employees and operates across seven offices nationwide, providing both employers and job seekers with a full recruitment service. Managing Director Jo Sellick (Photo: Paul Currie Photography Ltd) \nTheir first move to expand away from Manchester was to open an office in Newcastle on Collingwood Street where the team have gone from strength to strength, focusing on the requirements of businesses and individuals here in the North East. You can’t beat a bit of local knowledge. It doesn’t matter whether you are a client of Sellick Partnership or a professional who is interested in one of their vacancies, everyone receives the same, detailed, meticulous service. \nAs well as local knowledge, you can’t beat experience. \nThe man who started the business and is now Sellick Partnership’s managing director, is Jo Sellick. He knows the North East extremely well after spending four years at Northumbria University studying politics. \n“I loved it” said Jo. “I currently live in Greater Manchester where we set up our first base, but if I had to move, I’d be off to Newcastle without a moment’s thought. It’s a wonderful thriving part of the world with an intimate business community. Everyone knows everyone else. I discovered that North East businesses know how to work at their market, how to prove themselves and how to build the right relationships.” Manager Helen Dodds and the Newcastle team \nAs managing director of Sellick Partnership there might be an assumption that Jo is now rather detached from the day-to-day activity of helping companies fill vacancies or help individuals secure a new role. Think again. \n“I’m currently sat in our Newcastle office. I’m meeting two candidates who have applied for a position with one of our clients. The first one is coming here; I’m meeting the second one in Washington. \n“I’m a great believer in being part of the team. The same applies to all of our senior management team. I think it is important that other colleagues see we all have the same frustrations yet share the same sense of pride when we link a professional to their perfect position and help a company find their ideal candidate.” \nSo, how important is the Newcastle office to the Sellick Partnership? \n“Very. Newcastle was our first regional office and covers one of our largest geographical areas extending from the Borders, across to Cumbria and South to Yorkshire. Newcastle links all of the North East together and is frequently involved with our other offices, especially those in Leeds, Manchester and Liverpool. Many of our clients are large, blue chip companies who need to attract candidates from a wide area, not just locally.” The full Sellick Partnership team \nJo is one of the UK’s leading recruitment experts, so we wondered whether he was seeing any employment or recruitment trends in the North East? \n“Public sector recruitment has always been strong in the North East. We do a lot of work with the NHS as well as with charities. Our Newcastle office also deals with SMEs, multi-national firms…indeed anyone who needs to find a candidate to fit an important role. \n“Being compliant is becoming increasingly important. More and more organisations, especially in the public sector, require incredibly detailed background checks, passports, references, work history etc. Gone are the days when a quick chat would suffice. We now have to do a huge amount of research before finally placing a candidate with a business or organisation.” \nBearing in mind that the Newcastle team at Sellick Partnership specialise in finance recruitment, what sort of person do they ask them to find? \n“When it comes to the North East, our typical finance client will be someone who is looking for a fully qualified accountant. Manager Helen Dodds and resourcing consultant Kathryn Heeler at HFMA NE \n“We sometimes place a part-qualified accountant if we feel as though they have the potential to successfully continue with their qualifications. It is no secret that we are experiencing a massive skills-shortage across the UK so when it comes to candidates, especially within the finance and accountancy sector, gaining relevant qualifications is crucially important to our clients across the North East.” \nThat being said, anyone who goes onto our Sellick Partnership website www.sellickpartnership.co.uk will quickly spot that we offer a wide range of vacancies across the UK.” \nSellick Partnership has been around for 15 years so what lies in the future for the business? \n“Last year we had a turnover in the region of £38m. By this time next year, I expect that to have grown to around £45m. The number of people within Sellick Partnership will grow to near 100 and, yes, the Newcastle office will continue to expand. We have a highly skilled, experienced team in Newcastle who’ve been hugely successful, and I fully expect that success to continue. \nThe Newcastle team is currently headed up by manager Helen Dodds who, like Jo Sellick, graduated in the North East, (BA in Business Management), attending Newcastle College. She started with Sellick Partnership as a resourcing consultant in 2012. Helen has since been promoted through the ranks and now manages a team of four consultants with plans to expand further in the future. \nThe message that comes across from Jo Sellick is that the North East, despite the latest election results and Brexit, is still a thriving place in which to do business. The reputation of the North East as being a great place in which to live and work helps attract candidates from outside the region. \nSellick Partnership is leading from the front when it comes to recruitment in professional services. The company is celebrating 15 years of sustained growth and the Newcastle office has played a key role in that success. \nWhen you have local knowledge and a vast amount of experience, it’s easy to see that Sellick Partnership will continue to go from strength to strength. \nHere’s to the next 15 years of putting people first. To contact Sellick Partnership to discuss your current recruitment needs call the Newcastle office on 0191 261 8585 or send an email helen.dodds@sellickpartnership.co.uk. Alternatively you can keep up-to-date with latest news and vacancies by visiting www.sellickpartnership.co.uk Like us on Facebook", "external_links": [], "published": "2017-06-23T19:00:00.000+03:00", "crawled": "2017-06-23T14:35:27.045+03:00", "highlightTitle": ""}