{"organizations": [], "uuid": "e3eed94ae431fd791dbe8ee7ad2263ba77bfe974", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13142844.ece/ALTERNATES/s1200/rbp_mai_21116glam2452JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/north-easts-nhs-could-lose-13141971", "country": "GB", "domain_rank": 21960, "title": "North East's NHS 'could lose hundreds of staff over extreme Brexit'", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-06T15:00:00.000+03:00", "replies_count": 0, "uuid": "e3eed94ae431fd791dbe8ee7ad2263ba77bfe974"}, "author": "Katie Dickinson", "url": "http://www.chroniclelive.co.uk/news/north-east-news/north-easts-nhs-could-lose-13141971", "ord_in_thread": 0, "title": "North East's NHS 'could lose hundreds of staff over extreme Brexit'", "locations": [], "entities": {"persons": [{"name": "wendy taylor", "sentiment": "none"}, {"name": "taylor", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "george rae", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "newcastle east", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}], "organizations": [{"name": "nhs", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "newcastle east", "sentiment": "none"}, {"name": "bma", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "liberal democrats", "sentiment": "none"}, {"name": "general medical council", "sentiment": "none"}, {"name": "european economic area", "sentiment": "none"}, {"name": "british medical association", "sentiment": "none"}, {"name": "freeman hospital", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News North East's NHS 'could lose hundreds of staff over extreme Brexit' The region could lose more than 500 staff members and face a £4.4m bill to replace them, the Liberal Democrats have claimed Share Hospital staff (Photo: Western Mail) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe North East’s NHS could lose more than 500 staff members and face a £4.4m bill to replace them if Theresa May’s “extreme Brexit” goes ahead, the Liberal Democrats have claimed. \nA survey by the General Medical Council (GMC) in February found that 42% of nurses and more than half (56%) of all doctors from the EU were considering leaving the UK because of Brexit. \nThis could mean the loss of an estimated 177 NHS staff members in Newcastle, including 112 doctors and nurses. \nThe Lib Dems say this would create a £1.1m bill for Newcastle hospitals to re-hire doctors and nurses from the EU after 2019, due to Theresa May’s plans for a £2,000 immigration skills charge for each doctor, nurse and health worker brought in from abroad. A doctor with a baby and its mother (Photo: handout) \nThe Liberal Democrats have called for an immediate guarantee that all EU nationals in the UK, including those working in the NHS and social care, can stay after Brexit. \nAcross the North East, the survey indicates that more than 500 staff members are who qualified in European Economic Area (EEA) countries are considering leaving in the wake of Brexit - costing a total of £4,370,000 to rehire. \nLib Dem candidate for Newcastle East, Dr Wendy Taylor, said: “Hospitals in Newcastle depend on doctors, nurses and other support staff from the EU. But many are now planning to leave because of the uncertainty caused by Brexit. Read More \n“We must guarantee their rights to stay here immediately to prevent a damaging exodus of these skilled and hard-working people. Our NHS, and the care we all rely on, would suffer without them.” Liberal Democrat candidate for Newcastle East Dr Wendy Taylor with NHS colleagues \nDr Taylor, who is a consultant at the Freeman Hospital, added: “The NHS is far too precious to be damaged by Theresa May’s decision to pursue a UKIP-style Brexit. \n“The Liberal Democrats stand up to Theresa May’s extreme Brexit and give the people the final say, with the choice to remain in the European Union if they don’t like the deal on offer.” Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nIn March the British Medical Association’s (BMA) North East chair, Dr George Rae, also called on the Government to grant permanent residency to EU doctors working in the region, saying Brexit would have a “calamitous” effect on our NHS services if their future was not assured. \nThe focal point of the Conservative manifesto revolves around continued commitment to the NHS and an increase of spending. Read More Brexit will be 'calamitous' for the North East's NHS if EU doctors leave, senior medic warns \nTwo years ago, Mrs May’s party pledged to spend a minimum of £8bn in real terms over the next five years and the manifesto says this is still the case. \nThe full estimates for how each trust could be affected, based on the percentages in the survey, are outlined below: \nEU staff members considering leaving Total cost to replace Trust", "external_links": [], "published": "2017-06-06T15:00:00.000+03:00", "crawled": "2017-06-06T11:10:48.001+03:00", "highlightTitle": ""}