{"organizations": [], "uuid": "819863b7d4fbcb9c6fe5c82624715ba09db53885", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article13186626.ece/ALTERNATES/s1200/GWR_-NJL_140617meetingwith_01.jpg", "site_section": "", "section_title": "", "url": "http://www.chroniclelive.co.uk/business/business-news/meeting-with-vivien-herrera-lee-13185830", "country": "IE", "domain_rank": 21960, "title": "A Meeting With: Vivien Herrera-Lee of Properties Unique - Chronicle Live", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 0, "title_full": "", "spam_score": 0.176, "site_type": "news", "published": "2017-06-15T12:00:00.000+03:00", "replies_count": 0, "uuid": "819863b7d4fbcb9c6fe5c82624715ba09db53885"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/meeting-with-vivien-herrera-lee-13185830", "ord_in_thread": 0, "title": "A Meeting With: Vivien Herrera-Lee of Properties Unique - Chronicle Live", "locations": [], "entities": {"persons": [{"name": "vivien herrera-lee", "sentiment": "negative"}, {"name": "ishmael", "sentiment": "none"}, {"name": "ramon", "sentiment": "none"}, {"name": "judith chalmers", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Vivien Herrera-Lee of Properties Unique (Photo: publicity handout) Share Get business updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email What is the best thing about your job? \nProbably the most interesting is meeting people from all over the world - many of them famous faces! Newcastle is an amazing city so it’s easy to boast the culture, international cuisine, beautiful riverside and coastline that’s on offer to guests. What is your proudest achievement? \nI am extremely proud of Properties Unique’s unrivalled reputation throughout the world. We are the only Serviced Accommodation Provider to have won the prestigious Outstanding Customer Service Award, which we did for two consecutive years. Also, in view of the financial contribution Properties Unique has generated in tourism in the region, I was named as Ambassador For Tourism. Then, ultimately in 2014 I received the accolade of Business Woman of The Year which obviously was another great honour. What advice would you give to someone starting in your career? \nAlways work with honesty, integrity and never make a promise that you cannot fulfil. Which individual has inspired you most and why? \nEven today I’m still guided by my dad’s old fashioned, but very wise words: “It costs nothing to be civil, courteous and kind to people.” This advice has stood always stood me in good stead. What’s the best piece of advice you’ve been given? \nAlways conduct yourself so that you can look people in the eye and know you have always been honest and genuine with them. What was the biggest challenge you’ve faced in your career so far? \nRamon, my late husband, and my son Ishmael were both so very instrumental to starting the business and when Ramon passed away, I must admit I wanted to throw the towel in. However knowing just how much Ramon had contributed in achieving our excellent reputation, coupled with all the amazing reivews and feedback we still constantly receive, these are the things that keep me going. How is your business going to change in the next 10 years? \nI have always ran Properties Unique on a personal contact basis, so it’s been a bit difficult for me coming into the 21 century world of social media, though I know one has to embrace change. That is what we are concentrating on right now. However personal contact remains and always will be a priority. Also, we had plans in place to expand overseas, and now with the uncertainty surrounding Brexit, things may have to move at a quicker pace than previously. What do you like to do out of work? \nLife is always hectic for me, so I do enjoy going home and relaxing after a busy day. I am indeed blessed with many friends, and enjoy quite a bit of worldwide travelling – in fact my staff say I have clocked up more air miles than Judith Chalmers! What do you always carry with you? \nWhen Ramon died I had a card made with his photo and special words on. He goes absolutely everywhere with me. What would you do if you had to change career? \nRetirement is high on my list as my next career move. Mind you I’ve always fancied becoming a Pole Dancer so you never know! Like us on Facebook", "external_links": [], "published": "2017-06-15T12:00:00.000+03:00", "crawled": "2017-06-15T07:37:13.001+03:00", "highlightTitle": ""}