{"organizations": [], "uuid": "8efe1668c7ea5584d5f35ae7b609123ef6a4dc2a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13244214.ece/ALTERNATES/s1200/HSR_NEC_140617Chemoxy_09JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/how-bgfs-funding-helped-chemoxy-13244181", "country": "GB", "domain_rank": 21960, "title": "How BGF's funding helped Chemoxy grow its business to new levels", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-28T07:01:00.000+03:00", "replies_count": 0, "uuid": "8efe1668c7ea5584d5f35ae7b609123ef6a4dc2a"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/how-bgfs-funding-helped-chemoxy-13244181", "ord_in_thread": 0, "title": "How BGF's funding helped Chemoxy grow its business to new levels", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sponsored How BGF's funding helped Chemoxy grow its business to new levels Since partnering with the Business Growth Fund, the Middlesbrough chemicals plant has opened a new site and doubled its headcount Share 00:01, 28 JUN 2017 Sponsored Ian Stark (left) CEO and Barry Jackson from the Business Growth Fund (Photo: Doug Moody Photography) Share Get   \nChemoxy CEO Ian Stark says: Chemoxy’s chemical works has been here since 1868 through many multiple ownerships. \nWe are an exemplar for UK manufacturing as we tick all of the boxes for what the UK needs. We are a growing SME , with a huge percentage of export sales. Over 60% of our sales revenue comes from products we export, including distant markets such as China and the USA. \nWe are involved in advanced manufacturing, and we have a highly trained and skilled workforce who earn salaries much higher than the norm for the North East. \nOne of our main products goes into low toxicity paints. People are increasingly worried about the smell and solvent contents of paints and we manufacture an innovative product that makes emulsion paints more environmentally friendly. \nMore recently we have been putting a focus on the personal care sector and have developed a range of skin friendly ingredients which also act as preservatives. \nFive years ago, we did a management buyout from a huge American corporation called Dow Chemicals. Since then we have changed the strategy of the company, which has proved to be a recipe for success. \nWe have grown from 78 people to 150 people today. We’ve trebled our profitability since the start of the business, and we have invested £15m of capital into the plant over the last five years. This includes the building of the major new plant at our Billingham site. \nWe had lots of approaches from private equity and other financial institutions wanting to invest in the business and the reason we chose BGF is they were happy to take a minority share. \nThey provided growth capital and were much more light touch than other institutions that had approached us. We maintained control of our own business and at the same time got on board an investor that could help with the growth of the company. \nWhen looking for external investment there were concerns about over interference, but that has not materialised. BGF has been quite a passive and constructive investor. \nWe have found BGF to be an excellent partner. They are responsive, not over bureaucratic and their reporting requirements are reasonable. \nThrough BGF we received £10m in investment. We used some of the funds to help with our expansion plans in both our Middlesbrough and Billingham sites. As well as to provide financial stability to the business. \nBillingham is our most strategic site in that it’s in an ideal location, in the middle of a chemical complex. We are able to carry out a much wider variety of chemistries on that site as well as more exotic processing for the flavour and fragrance market, personal care, oil and gas, and paints. \nOur success has been built around agility, speed to market, and building a broad and diversified product and market portfolio so that we have not had overexposure to any one sector. BGF has been very helpful in providing advice in that area. It has helped to accelerate our growth and provide more financial confidence in the business. \nBGF investor and Chemoxy board director Barry Jackson says: The investment in Chemoxy happened in February 2015 but we first met the team in early 2014. \nAs a result of the management buyout Ian and Martyn Bainbridge (COO) had grown the business very rapidly since they had taken it on from Dow. Everything Ian said about the opportunities in front of the business made it clear this was a management team with the experience, track record, and capability to deliver further growth. Read More Springfield Cars sees profits plummet 'challenging' Brexit year \nThe question for me at the start was: ‘Would having a growth capital partner like BGF help them on their journey?’ \nWhat is important for us, in any investment, is to feel aligned with management and to go into an investment feeling that management want an equity partner and an inclusive relationship. That is definitely what we have here with Chemoxy. \nIt’s why this partnership has worked very well. Ian has felt like he and his team have been left to get on with things. And I have felt that Ian includes me and BGF to the extent we need to be involved. There are no surprises, which as a financial investor is key. \nWhen Ian and Martin took control of the business they had invested £10m of capital back into the business before we got involved. That is very impressive for what is effectively an owner managed business now. They are investing in creating capacity, creating opportunity and creating jobs. Read More 60 years of global innovation celebrated at P&G centre in Newcastle \nAs well as funding BGF offers a number of benefits to the firms it supports. One thing we are keen to do is get the CEOs who we back together in a formal, or informal, setting to bounce ideas off each other, socialise and network. It’s interesting to see what often comes out of that. \nWe have the benefit of backing lots of entrepreneurs in different sectors. Although our entrepreneurs operate in very different businesses, often the challenges they face can be the same. \nWhen we first got involved, Chemoxy was in the very fortunate position of having many different funding options. They could have gone down the private equity route, but with the management team having worked under somebody else for a long time, ceding control very early on was not something they wanted to do. \nAs a partner BGF was able to provide funding in the most risk appropriate way for the management team. \nAnd because of our relationship with Ian and our approach to the partnership ultimately, we provide financial backing and support and they get on and keep on doing what they are good at. Like us on Facebook", "external_links": [], "published": "2017-06-28T07:01:00.000+03:00", "crawled": "2017-06-28T03:55:37.000+03:00", "highlightTitle": ""}