{"organizations": [], "uuid": "b322ed3241293b2eb308152a148434e738bdd63d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30403328/16054195.jpg", "site_section": "http://www.middevongazette.co.uk/all-content.rss", "section_title": "Devon Live All Content Feed", "url": "http://www.devonlive.com/rising-global-demand-for-uk-organic-milk-new-report-finds/story-30403328-detail/story.html", "country": "GB", "title": "AthwennaIrons published Rising global demand for UK organic milk, new report finds", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-22T00:09:00.000+03:00", "replies_count": 0, "uuid": "b322ed3241293b2eb308152a148434e738bdd63d"}, "author": "AthwennaIrons", "url": "http://www.devonlive.com/rising-global-demand-for-uk-organic-milk-new-report-finds/story-30403328-detail/story.html", "ord_in_thread": 0, "title": "AthwennaIrons published Rising global demand for UK organic milk, new report finds", "locations": [], "entities": {"persons": [{"name": "ben", "sentiment": "none"}, {"name": "richard hampton", "sentiment": "none"}, {"name": "richard", "sentiment": "none"}, {"name": "birchall", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "hampton", "sentiment": "none"}, {"name": "ben birchall", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "usa", "sentiment": "none"}, {"name": "united states of america", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "western europe", "sentiment": "none"}], "organizations": [{"name": "athwennairons", "sentiment": "none"}, {"name": "organic milk suppliers cooperative", "sentiment": "none"}, {"name": "nordics", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Rising global demand for UK organic milk, new report finds By AthwennaIrons   0 COMMENTS SHARES Ben Birchall / PA The Organic Milk Suppliers Cooperative, (OMSCo) collects milk from 270 dairy farms spread across the UK Rising global demand for UK organic milk, new report finds X \nCopy link to paste in your message / Pictures: Ben Birchall / PA Comments (0) \nOrganic milk is continuing to buck the trend over its conventional counterpart, a new report has found, with increasing milk volumes and potential significant growth opportunities ready to be unlocked. \nBritish organic milk volumes rose by 4.4% in 2016, compared to the standard milk category which fell by 1.9% during the same period. This increase is being attributed to an organic milk recovery, in spite of reducing conventional prices and increasing organic shelf premiums. \nAccording to the 2017 organic milk market report, produced by the Organic Milk Suppliers Cooperative, (OMSCo), over the last year one in four households now purchase organic milk, which is an increase of 15%. \n\"Last year the organic milk category attracted one million new households – more than any other milk sector in the UK,\" says OMSCo managing director, Richard Hampton. \"This is despite it being a private label dominated category, and therefore subject to less advertising and innovation than other growth milk segments such as dairy alternatives and filtered milk, and increasing shelf premiums as conventional prices fell. \n\"However, UK organic dairy growth is still behind other key international markets, growing at a rate of just 2.2%. This is compared to the USA market which is growing 10% year-on-year and European markets, such as Germany and France, which are also witnessing significant growth.\" \nOMSCo is the largest producer of organic dairy – representing 65% of the UK's organic milk market – and is also the longest established organic dairy cooperative in the UK, now with an annual turnover of £100 million. Collecting from 270 dairy farms spread across the UK – including the Westcountry – it is the only national 100% organic, farmer-owned and farmer-run dairy cooperative in the UK. \nREAD ALSO: Broccoli crowned nation's favourite vegetable after superfood reinvention \nGlobally, organic dairy is in a period of strong growth and is one of the largest sectors within the organic food and drink market, worth $9.5bn in a market valued at $82bn. \"For this reason, exports have become an increasingly important market for UK organic dairy products,\" explains Richard. \"Over the last 10 years exports have grown from zero to 20% of UK organic milk sales. They play an important role in balancing UK market fluctuations, and therefore delivering a stable return to UK organic dairy farmers.\" \nIn the past year the UK's organic market has continued to grow and is now worth £2.9 billion, up 7.1% year on year. This is the fifth consecutive year of growth and is especially impressive considering non-organic sales fell by 0.6%. \nUK organic milk retail sales increased 3.3% in 2016, bringing the value of the market up to £150 million, the report states. Volume sales were also up on the previous year by 4.4% to 169 million litres. Sales are back up to 2014 levels, having now recovered from the impact of the retailer price wars which caused a retail-wide major drop in the conventional milk price. \nMost of the growth has been driven by new consumers entering the market across all demographics. There was a 15% increase in household penetration over the last year and the absolute increase in households purchasing organic milk was higher than any other of the milk sectors currently in growth (i.e. filtered milk and dairy alternatives). \nAccording to the report, export demand for British organic dairy continues to offer \"significant growth opportunities\", and is currently outpacing that of the domestic market – with UK organic exports on the rise and accounting for on average 9% of organic producer sales. \"In order to unlock the growth potential there continues to be a need to communicate the organic benefits to consumers in a more compelling way and / or to offer a better price: value proposition,\" the report states. \nThe report also outlines the top five global organic markets of interest, which are: the United States of America, China, Canada, the Nordics and Western Europe. \nREAD NEXT: Devon sheep farming family discovers new way to target the market \nOrganic is the fastest growing sector in the US food industry with sales up 11% in 2015, far surpassing growth in the wider food market of 3%. \"US organic production is struggling to meet this rapidly increasing demand and there is a significant reliance on imports,\" claims the report. \nIn China, widespread distrust of domestic dairy is driving the demand for foreign imported milk. Organic dairy is growing fast and this is expected to continue over the next five years. However, there have been some challenges for exports based on changing government regulations and this is likely to continue. \nThe Canadian organic market is of similar size to the UK and the possibility of a free trade deal between Canada and the UK looks plausible. There is \"substantial opportunity\" for exports to the Nordics, with good growth and some of the highest per capita spending on organic in the world. Consumers here also typically respond favourably to UK products. \nWestern Europe is also an organic market of \"undeniable importance\", with sales in France and Germany alone amounting to 1.4 billion Euros. \nDespite these opportunities, export expansion has been constrained in the last couple of years by a lack of supply due to the UK market recovery and last year's poor growing season, stressed Mr Hampton. \n\"However, new organic milk supplies – the vast majority of whom are joining OMSCo – will emerge during 2017 and 2018 to support the growth of these markets, and together with like for like expansion we are seeing from existing producers, we expect the UK to be able to cover growing UK demand and export opportunities without there being requirement for further milk at this stage,\" he explained. \nRichard added that he attributes global growth drivers to consumer demand for products with health and wellbeing benefits as well as a solid provenance story. \"Organic dairy offers consumers a host of benefits including increased levels of omega-3, and we remain confident that UK and global demand for high quality, sustainable and healthy organic dairy will remain strong,\" he said. \n\"However, there are threats, notably the emergence of 'single issue' products (Free Range; Ethical) the benefits of which are covered by the organic standard but may not be understood by consumers, whilst on the export front Brexit poses a significant threat to export-led food sectors, including organic dairy, as well as any potential downturn.\" READ NEXT:", "external_links": [], "published": "2017-06-22T00:09:00.000+03:00", "crawled": "2017-06-21T20:11:25.017+03:00", "highlightTitle": ""}