{"organizations": [], "uuid": "01d39e706ade7fdeda3801ab7fc786e37cfeb0d4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30367804/16027247.jpg", "site_section": "", "section_title": "", "url": "http://www.devonlive.com/trumps-paris-climate-deal-devon-climate-specialists-and-green-party-reaction/story-30367804-detail/story.html", "country": "GB", "title": "Trumps' Paris climate deal: Devon specialists and Green Party reaction | Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "", "spam_score": 0.466, "site_type": "news", "published": "2017-06-02T17:18:00.000+03:00", "replies_count": 0, "uuid": "01d39e706ade7fdeda3801ab7fc786e37cfeb0d4"}, "author": "", "url": "http://www.devonlive.com/trumps-paris-climate-deal-devon-climate-specialists-and-green-party-reaction/story-30367804-detail/story.html", "ord_in_thread": 0, "title": "Trumps' Paris climate deal: Devon specialists and Green Party reaction | Devon Live", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "peter cox", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "molly scott cato", "sentiment": "none"}, {"name": "cox", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "paris", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "usa", "sentiment": "none"}, {"name": "nicaragua", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}], "organizations": [{"name": "green party", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "university of exeter", "sentiment": "none"}, {"name": "bristol west", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Comments (0) \nThe decision by Donald Trump to announce that the US will quit the Paris climate agreement has been called a backward step to a bygone age by experts in Devon. \nThe University of Exeter's climate specialist expert Professor Peter Cox said it was 'bad news for the world but even worse news for the US'. And Devon's MEP Molly Scott Cato said Trump had 'waged war on the environment' calling it a an 'assault on scientific evidence' and a backward step to a 'bygone era where fossil fuels ruled'. \nThe President of the USA confirmed that he will withdraw the US from the Paris climate agreement, in effect ensuring the world's second largest emitter of greenhouse gases will quit the international effort to address global warming. The US will remove itself from the deal , joining Syria and Nicaragua as the only countries not party to the Paris agreement. \nRead next: Baby hurt after gang of youths stone family home \nProf Cox, Professor of Climate System Dynamics at the University of Exeter said: \"I always hope that common human interests will win the day, but under the Trump administration I'm not surprised when they don't. Bad news for the world, but even worse news for the US. This can't be allowed to stop progress towards a more sustainable world. It just means the US may be left behind.\" \nSouth West MEP and Green Party parliamentary candidate for Bristol West, Molly Scott Cato, said: \"Trump has just confirmed his intention to wage war on the environment. Ejecting the US from the Paris Agreement is an assault on scientific evidence and a confrontation with businesses and the US and global economy; one that is marching rapidly towards decarbonisation. This decision attempts to take the US back to a bygone era where fossil fuels ruled, just at a time when we are at the dawn of a green energy revolution. \n\"Clean energy jobs outnumber fossil fuel jobs by more than 2.5 to 1 in the US. They overwhelm dirty fuels jobs in nearly every state across America, and this growth will only continue as renewable energy technologies become ever cheaper. Solar and wind jobs are now growing at a rate 12 times faster than the rest of the US economy. \n\"As for the UK, Brexit poses a serious threat to the way in which we respond to Trump over climate change. Our voice will be diminished on the global stage after we leave the EU, and, despite Theresa May's stated commitment to the Paris Agreement, may be deliberately silenced altogether as the UK attempts to forge a new trade agreement with the US. If she remains prime minister, we could end up walking hand in hand with the world's greatest environmental polluter and sacrificing the climate at the altar of a dodgy trade deal. Read next: Devon businessman in court on drugs charges \n\"But Trump has at least achieved one thing. The outrage over his decision to turn his back on one of the globe's most important treaties has raised climate change up the political agenda just in time for this week's general election. With that in mind, it is clear that more Green MPs demanding stronger action on climate change are needed now more than ever.\" Read next:", "external_links": [], "published": "2017-06-02T17:18:00.000+03:00", "crawled": "2017-06-02T18:14:56.000+03:00", "highlightTitle": ""}