{"organizations": [], "uuid": "721d1d0eec9065507bac0d625435397e776bcea9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30417314/16064214.jpg", "site_section": "", "section_title": "", "url": "http://www.devonlive.com/why-brexit-has-made-your-devon-retail-job-unsafe/story-30417314-detail/story.html", "country": "US", "title": "Has Brexit made your Devon retail job unsafe? | Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "", "spam_score": 0.189, "site_type": "news", "published": "2017-06-30T15:47:00.000+03:00", "replies_count": 0, "uuid": "721d1d0eec9065507bac0d625435397e776bcea9"}, "author": "", "url": "http://www.devonlive.com/why-brexit-has-made-your-devon-retail-job-unsafe/story-30417314-detail/story.html", "ord_in_thread": 0, "title": "Has Brexit made your Devon retail job unsafe? | Devon Live", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "none"}, {"name": "devon live has brexit", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "gary fenn", "sentiment": "none"}], "locations": [{"name": "devon", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "bristol", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "birmingham new street station", "sentiment": "none"}, {"name": "edinburgh", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}], "organizations": [{"name": "office of national statistics", "sentiment": "none"}, {"name": "ons", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Has Brexit made your Devon retail job unsafe? By Neil_Shaw | Posted: June 30, 2017 1 COMMENTS SHARES Has Brexit made your Devon retail job unsafe? Has Brexit made your Devon retail job unsafe? X \nCopy link to paste in your message / Comments (1) \nThe retail job market has grown by 0.69% across the UK a year on from the Brexit referendum, according to the latest study from Fish4jobs , but in the South West there has been a big decline in jobs in the sector.. \nThere has been a sharp 10% increase in the number of retail jobs available in London one year on from the Brexit referendum. London was the most sought after city for retail investment in Europe last year, with 65 new brands opening up stores in the capital - reflecting the influx of retail jobs advertised in the capital. \nDespite unfavourable predictions, it appears that the Brexit referendum has not had a negative effect on the number of available jobs in the retail industry within London one year on, according to this latest study. \nIn contrast, there has been a sharp 12% decline in the number of retail jobs available in Birmingham a year on from the Brexit referendum. Recent reports highlight that Grand Central shopping centre above Birmingham New Street Station has 14 empty outlets, just two years after it opened, echoing the gloomy outlook for retail jobs in Birmingham. \nIn the South West, Bristol has seen a drop of more than eight per cent in the last year. LOOKING FOR A JOB? THERE ARE THOUSANDS IN DEVON AVAILABLE ONLINE RIGHT NOW \nThe impact of the Brexit referendum is varied across the UK's major cities. Edinburgh, a city which voted overwhelmingly to stay in the EU, has seen a 16% decline in the number of available retail jobs than last year pre-Brexit referendum. \nThe Office of National Statistics (ONS) released a report in April this year highlighting that an estimated 508,000 employees working in the UK's retail, wholesale and restaurants are from the 27 other EU nations. There have been fears that companies would refrain from hiring new employees until uncertainty around foreign nationals working the UK was resolved as part of the Brexit negotiations. \nGary Fenn, Insight Analyst at Fish4jobs states, \" We are now one year on from the Brexit referendum, and it's intriguing to see the effect it has had on the job market across the UK. There has been a lot of uncertainty for businesses and employees which has clearly impacted the retail job market differently across the UK.\" \nIn Q1, the UK was reported as having the slowest economic growth out of all the G7 countries. UK retail sales fell by 0.4% in May as consumers tighten their purse strings, likely due to foreboding over what Brexit will mean for the UK economy. \nThis latest job market data is sourced from Job Market Insights - which has an 85% representation of the UK job market. \nCity \nYOY % Change in Retail Jobs \nLondon ", "external_links": [], "published": "2017-06-30T15:47:00.000+03:00", "crawled": "2017-06-30T21:09:21.012+03:00", "highlightTitle": ""}