{"organizations": [], "uuid": "e149a6fbb299a695a1a90a4bb07f40e0ef04f678", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article12569911.ece/ALTERNATES/s1200/BHR_nec_040217rally_05.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/you-should-vote-labour-general-13129840", "country": "GB", "domain_rank": 21960, "title": "Why you should vote Labour at the General Election - in the party's own words", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-08T01:00:00.000+03:00", "replies_count": 0, "uuid": "e149a6fbb299a695a1a90a4bb07f40e0ef04f678"}, "author": "nechronicle", "url": "http://www.chroniclelive.co.uk/news/north-east-news/you-should-vote-labour-general-13129840", "ord_in_thread": 0, "title": "Why you should vote Labour at the General Election - in the party's own words", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "none"}, {"name": "chi onwurah", "sentiment": "none"}], "locations": [{"name": "northumbria", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}], "organizations": [{"name": "general election", "sentiment": "negative"}, {"name": "labour", "sentiment": "negative"}, {"name": "a&e", "sentiment": "none"}, {"name": "northumbria police", "sentiment": "none"}, {"name": "middlesbrough", "sentiment": "none"}, {"name": "national education service", "sentiment": "none"}, {"name": "newcastle central", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "tories", "sentiment": "none"}, {"name": "nissan qashqai", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nWith the June 8 General Election fast approaching, we have asked North East political figures from the five main parties to tell us why people should vote for them and explain what they will do for the region. \nToday it is the turn of Chi Onwurah, Labour candidate for Newcastle Central. Newcastle Central MP Chi Onwurah \nThe North East is a region of innovators and creators. \nWe were at the heart of the first industrial revolution and over the centuries we powered country’s manufacturing engine, putting the steel into our landscape and building the ships that carried our products around the world. \nBut our success has always been built on hard work and fair rewards, and under the Tory government this deal has broken down. \nOrdinary working people are poorer, with a quarter of jobs in the North East paying less than the living wage. This isn’t fair, and it’s no way to build a prosperous country for the future. \nLabour has a bold plan to invest for the future and get our economy moving. \nWe’ll create a million good jobs, with a new £10 minimum wage so working people have money in their pockets. \nWe’ll also invest £250bn over ten years – including an initial £1.4bn in North East transport. \nWe all know how difficult it is to catch a decent train to Middlesbrough, or to get a 4G signal on the Northumbria coast. \nLabour’s plans will change that and make our national infrastructure fit for the 21st century. \nWe’ll invest in our children’s future by creating a National Education Service to provide free education throughout people’s lives. Instead of obsessing over niche obsessions like free schools and grammars, we’ll focus on what really matters by driving down class sizes and providing free school meals for all primary pupils. \nWe’ve pledged to abolish fees on university and adult learning – because everyone deserves the chance to learn and re-skill, no matter what age they are. A doctor on a hospital ward (Photo: PA) \nOur party created the NHS according to the principle that no-one should have to pay for their own healthcare. The Tories have abandoned this with their unfair ‘dementia tax’, and NHS services are continuing to suffer. \nIn Government, Labour will stop the Tory hospital cuts programme, take a million people off waiting lists, and ensure that people get seen in A&E within four hours. \nWe’ll bring dignity back to the care system and introduce a fair system of funding through a service integrated with the NHS. \nOur country is less safe after seven years of Tory cuts. In the Northumbria Police area 924 police officers have been cut since 2010 and crime has risen by 38% in the last year alone. \nLabour understands the contribution made by the heroes in our frontline security services, and in Government we’ll recruit 10,000 more police, 3,000 firefighters, 3,000 prison officers, 1,000 security and intelligence staff and 500 extra border guards. \nBritain voted to leave the European Union, but no-one voted to lose their job and no-one wanted the Trumpian, hard right Brexit that the Tories are proposing. Nissan Qashqai (Photo: Handout) \nOver 100,000 North East jobs depend on single market access – which the Tories have recklessly ruled out – and our world-class universities rely on European relationships. \nLabour will scrap this Government’s confused and chaotic Brexit plan and replace it with one that puts the economy and people’s jobs first. \nGrowing up in Newcastle taught me that working people succeed when we build a better future for ourselves – together. \nThis is what Labour is offering on June 8: a chance to end seven years of Tory cruelty and incompetence, and create an economy that works for all of us. Read More ", "external_links": [], "published": "2017-06-08T01:00:00.000+03:00", "crawled": "2017-06-07T20:23:28.000+03:00", "highlightTitle": ""}