{"organizations": [], "uuid": "020e4a5764ba4addcabf7bcc72d6f362ad52b93d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12960334.ece/ALTERNATES/s1200/politics-thing.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/election-polls-2017-whos-winning-13122803", "country": "GB", "domain_rank": 21960, "title": "Election polls 2017: Who's winning as Conservatives battle Labour?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-01T20:44:00.000+03:00", "replies_count": 0, "uuid": "020e4a5764ba4addcabf7bcc72d6f362ad52b93d"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/election-polls-2017-whos-winning-13122803", "ord_in_thread": 0, "title": "Election polls 2017: Who's winning as Conservatives battle Labour?", "locations": [], "entities": {"persons": [{"name": "jeremy corbyn", "sentiment": "none"}, {"name": "tim farron", "sentiment": "none"}, {"name": "jeremy corbyn  labour", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "ipsos mori", "sentiment": "none"}, {"name": "nicola sturgeon", "sentiment": "none"}, {"name": "danny lawson/pa wire", "sentiment": "none"}, {"name": "yougov", "sentiment": "none"}], "locations": [{"name": "westminster", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "negative"}, {"name": "stv", "sentiment": "none"}, {"name": "snp", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "scotland labour party", "sentiment": "none"}, {"name": "times", "sentiment": "none"}, {"name": "conservative", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email \nThe latest opinion polls show Labour is closing the gap with the Conservatives . \nA new poll by YouGov commissioned by The Times newspaper found the Tory lead had fallen dramatically, with 42% of voters saying they will vote Conservative and 39% saying they will vote Labour. \nIt means the Conservative lead is just three points. \nAnd this is a massive fall from when the general election campaign began in April. Some polls at the time put the Conservatives as much as 24 points ahead. Prime Minister Theresa May (Photo: Getty Images Europe) \nIt suggests that Conservative Prime Minister Theresa May is in danger of losing her majority when the general election takes place on June 8, leading to a hung Parliament. \nAnd it suggests it’s possible that Labour leader Jeremy Corbyn could become Prime Minister. It’s worth remembering, however, that polls have consistently put the Conservatives ahead, even if Labour is catching up. \nThe Liberal Democrats, led by Tim Farron, don’t seem to be doing well. Their share of the vote slipped to just 7%. \nTheresa May attempted to lead a fightback as he made a speech about Brexit and presented herself as a strong leader with a “great national mission” to take the United Kingdom out of the European Union. Liberal Democrat leader Tim Farron (Photo: PA) \nSpeaking in the North East, she said: “I am confident that we can fulfil the promise of Brexit together and build a Britain that is stronger, fairer and even more prosperous than it is today. \n“Because the promise of Brexit is great – the opportunities before us enormous.” \nLabour attacked Mrs May for failing to take part in a TV debate on Wednesday night. A spokesperson for Jeremy Corbyn said: “Theresa May won’t even debate her opponents here in the UK, in an election she called. How on earth can she be trusted to negotiate in Europe and get the best deal for the British people?” \nLabour and Conservatives neck and neck in Scotland Labour Party leader Jeremy Corbyn \nLabour is running neck-and-neck with the Tories in Scotland, with both parties attracting around 25% of the vote, a new opinion poll has indicated. \nWhile the latest Ipsos Mori findings for STV put the SNP out in front with backing from 43% of Scots certain to vote - down from its 2015 result of 50% - Scottish Labour and the Scottish Conservatives are tied on 25% each. \nLabour used to dominate Scotland, but lost seats to the SNP at the last election. \nWith just one Westminster seat each in Scotland, both Labour and the Tories are targeting gains from the SNP, which secured 56 of the 59 constituencies north of the border in the last general election. Nicola Sturgeon (Photo: Danny Lawson/PA Wire) \nThe poll is a boost for Labour, with previous surveys suggesting its vote share could drop from the 24.3% it secured in Scotland in 2015 to as low as 13%. \nApproval ratings for the party leaders indicate Mrs May is more unpopular in Scotland than Mr Corbyn, with the former scoring a satisfaction rating of -27 and the latter -13. Read More \nVoters were split on which of the leaders would make the “most capable Prime Minister”, with 42% backing Mrs May and 40% opting for Mr Corbyn. \nTheresa May says the only poll that matters is the one on June 8 The ITV Leaders Debate (Photo: Getty Images Europe) \nTheresa May has played down polling that puts her on course to lose the General Election. \nThe Prime Minister insisted the only poll that matters is the June 8 vote, after a seat projection study suggested the UK faces a hung parliament. \nA constituency-by-constituency estimate for The Times by YouGov indicates the Conservative Party could lose 20 seats and see its majority wiped out, while Jeremy Corbyn’s Labour may gain 28 seats. \nThe analysis is based on a complex model and suggests Mrs May’s gamble of calling a snap election in the hope of a landslide win could backfire spectacularly. Read More", "external_links": [], "published": "2017-06-01T20:44:00.000+03:00", "crawled": "2017-06-01T16:15:44.004+03:00", "highlightTitle": ""}