{"organizations": [], "uuid": "f504a8f3e25bdb6956d22f035743a64f678e6b67", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article12620833.ece/ALTERNATES/s1200/Mortgage-survey.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/inflation-hits-four-year-high-13177323", "country": "GB", "domain_rank": 21960, "title": "Inflation hits four-year high as cost of living rises faster than expected", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-13T17:57:00.000+03:00", "replies_count": 0, "uuid": "f504a8f3e25bdb6956d22f035743a64f678e6b67"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/inflation-hits-four-year-high-13177323", "ord_in_thread": 0, "title": "Inflation hits four-year high as cost of living rises faster than expected", "locations": [], "entities": {"persons": [], "locations": [{"name": "dalton park", "sentiment": "none"}], "organizations": [{"name": "mpc", "sentiment": "none"}, {"name": "office for national statistics", "sentiment": "none"}, {"name": "ons", "sentiment": "none"}, {"name": "bank of england", "sentiment": "none"}, {"name": "bank’s monetary policy committee", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Inflation has hit a four-year high (Photo: PA) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nInflation hit its highest level in nearly four years in May, as the rising cost of foreign holidays and computer games drove up the cost of living. \nThe Office for National Statistics (ONS) said the Consumer Price Index (CPI) measure of inflation reached 2.9% last month, up from 2.7% in April and surpassing economists’ expectations for another reading of 2.7%. \nThat is the highest level since June 2013 when CPI also reached 2.9%, and was last surpassed in April 2012 when the index rose to 3%. \nThe increase in the cost of living remains above the Bank of England’s 2% target, and is likely to raise pressure on the Bank’s Monetary Policy Committee (MPC) to consider hiking interest rates beyond 0.25% when it meets later this week. \nThe biggest upward impact on the cost of living came from recreational and cultural goods and services - including holidays abroad - which overall rose 0.9% between April and May compared with a fall of 0.4% a year earlier. Read More Dalton Park outlet centre to get £2m improvements as visitor numbers grow \nThe cost of package holidays alone was up 0.6% in May. \nBritons have seen the cost of foreign travel increase following the post-Brexit vote collapse of sterling, which has knocked purchasing power abroad where the local currencies have gained strength versus the pound. \nThe cost of games, toys and hobbies shot up 2.7%, thanks in part to a jump in computer game prices - though the ONS stressed that these are often dependent on bestseller charts and can fluctuate from month to month. \nComputer equipment also rose, particularly in areas like data processing which saw costs rocket 3.4% \nThe price of clothes jumped by 0.6% between April and May, compared with a drop of 0.3% last year, with children’s clothing the biggest driver behind the rise. Read More Business groups raise pressure on PM to deliver better Brexit deal \nConsumers also saw decorating costs creep higher, thanks to higher prices for lounge furniture and textiles, which helped push household goods and furniture up 1.2% overall. \nPrice hikes from utility companies sent the cost of electricity soaring 4%, and comes after two of the Big Six energy providers - SSE and E.ON - introduced tariff increases at the end of April. \nDownward pressure on the cost of living came from fuel pump prices, with petrol falling 1p to 116.4p per litre and diesel also dropping 1.6p to 118.7p per litre between April and May. \nAirline prices also fell by 6.4% month on month, after the effect of Easter travel boosted air fares in April. \nThe Consumer Price Index including owner occupiers’ housing costs (CPIH) hit 2.7% after reaching 2.6% in April. \nCPIH is the ONS’s preferred measure of inflation, which includes costs associated with living in, maintaining and owning a home. \nThe Retail Price Index (RPI), a separate measure of inflation which includes council tax and mortgage interest payments, reached 3.7% last month, up from 3.5% in April. Like us on Facebook", "external_links": [], "published": "2017-06-13T17:57:00.000+03:00", "crawled": "2017-06-13T13:42:28.010+03:00", "highlightTitle": ""}