{"organizations": [], "uuid": "39bbd49a01ac2b61d1ac63a6a36c08f3e4a62006", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30416201/16063621.jpg", "site_section": "http://www.middevongazette.co.uk/all-content.rss", "section_title": "Devon Live All Content Feed", "url": "http://www.devonlive.com/crime-crackdown-zone-in-dawlish-has-stopped-anti-social-behaviour-in-the-town/story-30416201-detail/story.html", "country": "GB", "title": "DanielClark published Crime crackdown zone in Dawlish 'has stopped anti-social...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-29T17:10:00.000+03:00", "replies_count": 0, "uuid": "39bbd49a01ac2b61d1ac63a6a36c08f3e4a62006"}, "author": "DanielClark", "url": "http://www.devonlive.com/crime-crackdown-zone-in-dawlish-has-stopped-anti-social-behaviour-in-the-town/story-30416201-detail/story.html", "ord_in_thread": 0, "title": "DanielClark published Crime crackdown zone in Dawlish 'has stopped anti-social...", "locations": [], "entities": {"persons": [{"name": "danielclark | pos", "sentiment": "none"}, {"name": "danielclark", "sentiment": "none"}, {"name": "rob kingdon", "sentiment": "none"}, {"name": "dawlish", "sentiment": "none"}, {"name": "kingdon", "sentiment": "none"}], "locations": [{"name": "dawlish", "sentiment": "none"}, {"name": "richmond place", "sentiment": "none"}, {"name": "piermont place", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "teignbridge", "sentiment": "none"}, {"name": "barton hill car park", "sentiment": "none"}, {"name": "lee mount", "sentiment": "none"}, {"name": "south devon", "sentiment": "none"}, {"name": "teignmouth hill", "sentiment": "none"}], "organizations": [{"name": "teignbridge council", "sentiment": "none"}, {"name": "pspo", "sentiment": "none"}, {"name": "coryton's cove", "sentiment": "none"}, {"name": "brunswick place", "sentiment": "none"}, {"name": "dartmoor community safety partnership", "sentiment": "none"}, {"name": "public spaces protection order", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Crime crackdown zone in Dawlish 'has stopped anti-social behaviour in the town' By DanielClark | Posted: June 29, 2017 0 COMMENTS SHARES The Dawlish PSPO has been in place for nine months Crime crackdown zone in Dawlish 'has stopped anti-social behaviour in the town' X \nCopy link to paste in your message / Comments (0) \nThe introduction of a crime crackdown zone in Dawlish last year has stopped anti-social behaviour in the town, the council's anti-social behaviour officer has stated. Last summer, Teignbridge Council approved the introduction of a public space protection order (PSPO) for the heart of Dawlish, which bans anti-social behaviour such as drinking and rough sleeping, drug taking and littering. \nFailure to comply with the PSPO being a criminal offence and it came after years of concern the green space in the heart of the town has been taken over by anti-social behaviour which has affected the image of the town as a family friendly destination. \nNine months since the introduction, Rob Kingdon the safeguarding and anti-social behaviour officer for the South Devon and Dartmoor Community Safety Partnership, said that the PSPO has helped to put a stop to anti-social behaviour in the town. Read more Exeter's massive crime crackdown zone is here - are you covered by it? \nIt comes as Exeter's controversial crime crackdown zone, the Public Spaces Protection Order (PSPO), i s now in place after years of council and police planning. \nThe major order outlaws certain types of anti-social behaviour in Exeter city centre and sections of surrounding wards – landing anybody who breaks the rules with hefty cash fines. \nMr Kingdon said: \"We won't tolerate anti-social behaviour in our towns and have an excellent track record tackling these issues. In the majority of cases early intervention is successful, helping keep Teignbridge a safe and pleasant place to live and visit. This PSPO helps put a stop to anti-social behaviour in a place where it was having a really negative impact on the local community. \n\"Since the PSPO was introduced in Dawlish there's been a noticeable drop in anti-social behaviour and it's given police additional powers to deal with any anti-social behaviour or problems when they are reported. The local policing team for Dawlish have been really proactive and we are grateful in supporting and helping to enforce the order. Read more What's that noise? Here come the muscle cars \n\"Fixed penalty notices have been issued where people are found to be in breach of the order. We recognise that a PSPO is not a quick-fix or a single answer. We are continuing to work with partner organisations so we can continue to understand and deal with the underlying issues. If anyone believes the conditions of this PSPO have been breached, please call the police on 101.\" \nThe area for the PSPO covers The Lawns, and runs from the toilets by Barton Hill Car Park to the seafront bordered by Brunswick Place and the Strand. Read more Hard and Soft Brexit are meaningless - we need a good Brexit:... \nIt includes Station Road and the rail station, Richmond Place and the A379 passing from Teignmouth Hill to Piermont Place. \nOn the seafront it includes up to the pedestrian bridge on the Exeter side of the seafront which leads into The Rockstone. \nOn the Teignmouth side, it runs to the small beach by Coryton's Cove, and also include Lee Mount. \nHe added: \"The prohibitions do not affect the law-abiding majority. \n\"The legislation does target those whose alcohol and drug consumption leads to anti-social behaviour. \n\"The Dawlish community have asked for this legislation and we hope its implementation will improve the quality of life for residents, businesses and visitors to Dawlish.\" \nA Teignbridge Council spokesman added that no fixed penalty notices had been issued since February.", "external_links": [], "published": "2017-06-29T17:10:00.000+03:00", "crawled": "2017-06-29T18:57:10.003+03:00", "highlightTitle": ""}