{"organizations": [], "uuid": "58a36ed1355e85a33e41e5e01c3e392f02aa302c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30374190/16032447.jpg", "site_section": "", "section_title": "", "url": "http://www.devonlive.com/conservative-mp-vows-to-chain-himself-to-hospital-railings-and-quit-his-party-if-a-e-closes/story-30374190-detail/story.html", "country": "GB", "title": "Conservative MP vows to chain himself to hospital railings and quit his party if A&E closes | Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "", "spam_score": 0.042, "site_type": "news", "published": "2017-06-06T23:41:00.000+03:00", "replies_count": 0, "uuid": "58a36ed1355e85a33e41e5e01c3e392f02aa302c"}, "author": "", "url": "http://www.devonlive.com/conservative-mp-vows-to-chain-himself-to-hospital-railings-and-quit-his-party-if-a-e-closes/story-30374190-detail/story.html", "ord_in_thread": 0, "title": "Conservative MP vows to chain himself to hospital railings and quit his party if A&E closes | Devon Live", "locations": [], "entities": {"persons": [{"name": "joebu", "sentiment": "none"}, {"name": "devon mp", "sentiment": "none"}, {"name": "devon live", "sentiment": "none"}, {"name": "geoffrey", "sentiment": "none"}, {"name": "vince barry", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "robin julian", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "mr cox", "sentiment": "none"}, {"name": "david chalmers", "sentiment": "none"}, {"name": "geoffrey cox", "sentiment": "none"}, {"name": "cox", "sentiment": "none"}, {"name": "chris jordan", "sentiment": "none"}], "locations": [{"name": "north devon", "sentiment": "none"}, {"name": "torrington", "sentiment": "none"}, {"name": "torridge", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "north devon district hospital", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}, {"name": "west devon", "sentiment": "none"}], "organizations": [{"name": "a&e", "sentiment": "none"}, {"name": "devon live conservative", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "plough arts centre", "sentiment": "none"}, {"name": "barnstaple hospital", "sentiment": "none"}, {"name": "green party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Conservative MP vows to chain himself to hospital railings and quit his party if A&E closes By JoeBulmer | Posted: June 06, 2017 7 COMMENTS SHARES Comments (7) \nA Conservative Devon MP has vowed to chain himself to the railings of his local hospital and quit his party if its A&E department is closed down. \nTorridge and West Devon MP Geoffrey Cox made the statement during a hustings event in Torrington last night. \nNorth Devon District Hospital's A&E, maternity and stroke services are all under consultation at the moment with a decision being made on their future later this month. \nThe Hustings event was organised by the Plough Arts Centre in Torrington and streamed live by Devon Live. \nIt was attended by all of the general election candidates for Torridge and West Devon including: the current Conservative MP Geoffrey Cox, Labour's Vince Barry, Liberal Democrat David Chalmers, Green Party candidate Chris Jordan and independent Robin Julian. \nIn his opening statement Mr Cox said: \"Let me say this I have never been a man who jumps to the party whip I have voted against the party on frequent occasions and I'll tell you this, if I think it's in the interests of this constituency I will do so again. \n\"Now in relation to our health services and our education services I have spoken in the house quite recently on the question of our health and community services here, I intend to fight for them again. \n\"Do not believe for a moment that A&E will be closed at Barnstaple Hospital because I've seen the secretary of state himself about it, I've seen the managers about it and I'll tell you straight forwardly if that is ever threatened with closure I will chain myself to the railings and resign the party whip.\" \nThe event was subject to many lively exchanges with Mr Cox getting the majority share of heckling from the audience. \nAt one point Mr Cox said: \"I've told the head of the health service that they are closing too many community beds in rural areas where people have long distances to travel.\" \nTo which one audience member replied: \"I don't want you to knock on his door Geoffrey I want you to kick it down. \nREAD NEXT: Devon hospital which relies on 98 EU nationals fears Brexit will cause staffing crisis \nRetaining acute services at North Devon District Hospital was one of the only areas in which the candidates could agree. \nIn his opening statement independent Robin Julian said: \"If the conservatives get back in your giving them a blank cheque to further cut, and I mean they are going to be savage cuts. \n\"In the police service we are going to have 168 officers cut as well because of all the cut backs. \n\"We have not got any police here, when you have a 999 call they are coming from Plymouth and Exeter, I mean that can't be environmentally friendly to keep travelling hours trying to get to an incident, it's crazy. \n\"If we had our community police and stations open it would be far better, so I'm asking you to vote for me as an independent because I will be the independent voice for the community. \n\"That's what we have not got in North Devon, we have not got anybody to actually speak on your behalf.\" \nREAD NEXT: Exeter call handler sacked over death of woman in fire \nLabour candidate Vince Barry also focused on the NHS in his opening statement: \"This election is a choice about the future of our country. We stand at a crossroads where our country is going to go in one direction or the other. \n\"I'm standing to be your MP because I believe in a country which is fair and a country which invests in its public services, a country where we don't cut the NHS, where children get the education they deserve, where our economy in the south west is looked after by those in Westminster because too often, by many MPs of different colours, we have been forgotten. \n\"If you elect me I'll be an MP who stands up for Devon because we need a strong voice that will not be cowed by the party whips and will not be cowed by increasing strain on services. We need an MP who will stand to invest in our communities. \n\"The NHS in Devon has been absolutely decimated, I think it's absolutely disgusting and shameful that the Conservative Government has been cutting the NHS to the bone.\" \nGreen Party candidate Chris Jordan focused his opening statement on the environment, he said: \"I'll give you no surprises on this one as a member of the Green Party I believe the most important issue of our day is global warming. \n\"I'm saying this not to diminish the relevance of any other issues at all but the issue has been around for such a while now and has been accepted as policy but I think the eye has been taken off really how precarious the situation really is. \n\"I would contend that we are quite rapidly approaching what we would call tipping point by which time we will have no choice but to actually cope with the consequences of global warming that will be coming. \n\"This will effect just about every other aspect of our lives from the health service that I care about, and have worked in for many years, to agriculture to international relations, the consequences are enormous. \nHe added: \"The very survival of our race and the very survival of many other species on this planet depend on global warming being controlled.\" \nREAD NEXT: Two Devon men in Big Brother house - and one sparks an instant apology \nOn leaving the single market Liberal Democrat David Chalmers said: \"Leaving the single market would be an absolute disaster for our local economy, our farmers, businesses and for opportunity in this country so we need to make sure that we challenge that. \n\"We may have voted to leave last year but we certainly didn't vote on the destination of where we are going and we may need to make sure that the Government understands the strength of feeling in the country that actually we need to make sure that it's the right one for us. \n\"The Lib Dems have said that we don't want to leave the EU negotiations and the final decision up to politicians, we actually want the people of this country to have a final say on what they want and whether they feel the deal they come back with, and if that is leaving the single market then we have to be able to say actually we don't agree with and we have the option, if we want to, to vote to remain in the EU. \n\"So we will be actually putting forward, along with other parties, a plan to have a second referendum, or a first referendum on the deal of the negotiations, as they go forward.\" ", "external_links": [], "published": "2017-06-06T23:41:00.000+03:00", "crawled": "2017-06-06T17:45:42.000+03:00", "highlightTitle": ""}