{"organizations": [], "uuid": "50021b6843ebce5052f07f9077c1a83d7c5a1184", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13143120.ece/ALTERNATES/s1200/politics.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/judgement-day-theresa-jeremy-corbyn-13152202", "country": "GB", "domain_rank": 21960, "title": "Judgement day for Theresa May and Jeremy Corbyn after General Election campaign full of surprises", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-08T07:01:00.000+03:00", "replies_count": 0, "uuid": "50021b6843ebce5052f07f9077c1a83d7c5a1184"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/judgement-day-theresa-jeremy-corbyn-13152202", "ord_in_thread": 0, "title": "Judgement day for Theresa May and Jeremy Corbyn after General Election campaign full of surprises", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "jeremy corbyn", "sentiment": "negative"}, {"name": "greg stone", "sentiment": "none"}, {"name": "lyn brown", "sentiment": "none"}, {"name": "nicola sturgeon", "sentiment": "none"}, {"name": "diane abbott", "sentiment": "none"}, {"name": "abbott", "sentiment": "none"}, {"name": "john major", "sentiment": "none"}, {"name": "george osborne", "sentiment": "none"}, {"name": "barry gardiner", "sentiment": "none"}, {"name": "margaret thatcher", "sentiment": "none"}, {"name": "nick timothy", "sentiment": "none"}, {"name": "kezia dugdale", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "guy opperman", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}], "locations": [{"name": "weaver vale", "sentiment": "none"}, {"name": "westminster", "sentiment": "none"}, {"name": "east anglia", "sentiment": "none"}, {"name": "north west", "sentiment": "none"}, {"name": "wales", "sentiment": "none"}, {"name": "glasgow", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}, {"name": "clwyd west", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "north tyneside", "sentiment": "none"}, {"name": "hexham", "sentiment": "none"}, {"name": "norfolk", "sentiment": "none"}, {"name": "solihull", "sentiment": "none"}], "organizations": [{"name": "general election", "sentiment": "negative"}, {"name": "conservative party", "sentiment": "none"}, {"name": "snp", "sentiment": "none"}, {"name": "tory", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "standard", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "scottish labour", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Judgement day for Theresa May and Jeremy Corbyn after General Election campaign full of surprises Voters go to the polls on Thursday following an election campaign which saw Theresa May run into trouble and Jeremy Corbyn's reputation enhanced Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe nation goes to the polls on Thursday following one of the most unpredictable election campaigns in living memory. \nLabour leader Jeremy Corbyn continued to attract large crowds as he travelled across the country for an energetic final day of campaigning. \nHe began the day by speaking in Glasgow and travelled to events at Weaver Vale, in the North West, and Clwyd West, in Wales, before addressing no fewer than three rallies in London. \nMr Corbyn said: “Every vote for Labour will be a vote to put power, wealth and opportunity back in the hands of the many, not the few.” \nConservative leader Theresa May flew to Norfolk for a final push of campaigning in East Anglia. \nAnd her final campaign event was an evening appearance in Solihull, near Birmingham, where there are a number of marginal seats. \nThere was a reshuffle in Mr Corbyn’s team as Shadow Home Secretary Diane Abbott stood down, citing ill-health, to be replaced by former Shadow Policing Minister Lyn Brown. \nMs Abbott had been criticised for her performance in media interviews. He Labour colleague, Barry Gardiner, said she had been diagnosed with a “serious, long-term condition”. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nAnd Labour faced an unhelpful intervention from SNP leader Nicola Sturgeon, who claimed that Scottish Labour leader Kezia Dugdale had told her privately she felt Brexit could justify a second independence vote. \nIt added fuel to the Tory claim that Mr Corbyn as Prime Minister would oversee a “coalition of chaos” by offering the SNP the chance of a second referendum in return for their support at Westminster. \nNorth East Conservative Guy Opperman, the party’s candidate in Hexham, urged voters to back Theresa May. \nHe said: “The person who is best-placed to protect our country, grow our economy and secure the best possible outcome for Brexit is clearly Theresa May. \n“Jeremy Corbyn does not represent the true Labour Party and is manifestly unfit to be Prime Minister.” \nLiberal Democrat candidate for North Tyneside , Greg Stone, said: “We urge middle ground voters who are underwhelmed and abandoned by a right wing Conservative party and a hard left Labour Party to vote for a brighter future. \n“A vote for the Lib Dems is a vote for effective opposition, liberal values, progressive policies, investment in education and the NHS, and sanity on Brexit.” \nThe campaign began with Mrs May’s surprise announcement on April 17 that she had decided to hold a snap election. Read More Will Labour win the general election? We look at the chances of the party claiming victory \nPolling firms and politicians from all parties expected her to win an overwhelming majority. \nBut the Conservative campaign faltered in mid-May, when the Tory manifesto included plans to make the elderly pay more for social care at home. \nMeanwhile, Mr Corbyn showed that he could still attract massive crowds at rallies across the country. \nAs opinion polls showed the Tory lead falling, and Mr Corbyn’s supporters dared to dream that he could become Prime Minister. \nTwo terror attacks, in Manchester and London, shifted the focus of the election away from Brexit and on to issues of security and policing. \nWhile Mr Corbyn was vulnerable to claims that he had been soft on terror in the past, Mrs May was criticised for allowing police numbers to fall while Prime Minister. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nBut many campaigners, from both major parties, reported that the supposed narrowing in the polls was not being confirmed by what voters were telling them on the doorsteps. \nWhile the outcome is uncertain, so is the fate of the party leaders once the votes are counted. Read More Ever voted in a pub before? You can in one corner of rural Northumberland \nIf Mrs May wins with a majority of more than 21 - the figure achieved by former Tory leader John Major in 1992 - she will have achieved the best election result of any Conservative leader since Margaret Thatcher in 1987. \nHowever, the troubled campaign has damaged her authority. And some Conservatives are furious at one of her most senior advisers, Nick Timothy, who they blame for the campaign errors. \nMeanwhile, supporters of Mr Corbyn will insist that he has proved his critics wrong even if Labour ends up losing. \nBut other Labour politicians will agree with the verdict of London’s Evening Standard newspaper, edited by former Conservative Chancellor George Osborne, which claimed that Mrs May would lose this election if she faced a better opposition. \nThe Standard editorial said: “Conservative mistakes should have been exploited by their political opponents. \n“Indeed, the Tories would be facing near-certain defeat tomorrow if they had faced an effective force from the centre. But no such force exists.\" Read More ", "external_links": [], "published": "2017-06-08T07:01:00.000+03:00", "crawled": "2017-06-08T02:38:21.001+03:00", "highlightTitle": ""}