{"organizations": [], "uuid": "8dbe23a56def82da0c649b6dee543fe5716cedb2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13237963.ece/ALTERNATES/s1200/JS91648723.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13229715", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Australian stationer Smiggle to open new UK stores despite Brexit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-26T14:55:00.000+03:00", "replies_count": 0, "uuid": "8dbe23a56def82da0c649b6dee543fe5716cedb2"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-13229715", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Australian stationer Smiggle to open new UK stores despite Brexit", "locations": [], "entities": {"persons": [{"name": "smiggle", "sentiment": "neutral"}, {"name": "brexit", "sentiment": "none"}, {"name": "jonathon manning", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "frankfurt", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "brexit a smiggle", "sentiment": "neutral"}, {"name": "woori", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "smiggle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The FTSE-100 index at 8:15am was up 44.66 at 7468.79. \nThe pound at 8am was 1.2745 dollars compared to 1.2727 dollars at the previous close. \nThe euro at 8am was 0.8780 pounds compared to 0.8798 pounds at the previous close. 8:41 Jonathon Manning Looking for love? Entrepreneur launches Clikd dating app to help North East seek soulmates \nA new dating app has been launched by a North East entrepreneur , using pictures to match potential couples together. \nClikd was originally trialled in London and has now been rolled out across the region and the rest of the UK, helping people to find love matches by giving them the chance to ask questions while seeking out soulmates, which are then answered in pictures. \nThe app, which has been hailed as the “Instagram of the dating world” was co-launched by former corporate lawyer Michael Blakeley, who is originally from Birtley, Gateshead, and Robert Coney. \nDuring a successful beta test Clikd made a number of improvements to its app before it launched this week. \nThe app, available for Apple and Android, asks questions of those looking for love, such as who they follow in football. They answer by clicking on a picture of their team’s home ground, such as St James’ Park or the Stadium of Light. Recommendations based on shared interests are then sent to those who have signed up. \nMr Blakeley said: \nWe have introduced the ability to crop and edit photos within the app. We have also introduced notifications so people get told every day when their new recommendations come up. \nOne of the main changes we made was we were giving 10 recommendations a day, and loads of people complained. \nWe are now giving people 30 recommendations a day. Clikd's advertising appears on a 20ft electronic billboard in Liverpool Street station (Photo: Unknown) 8:36 Jonathon Manning Springfield cars sees profits fall by 60% \nCar seller Springfield Cars has revealed its operating profit has fallen by 60% after the business suffered from a “challenging year”. \nThe retailer, which is based on Crowther Road, Washington, also saw turnover fall from £47.2m to £46.6m for the year ending 31 December 2016. \nIn the company accounts, director Ronald Price said: \nAlthough the new car market as a whole increased by 2.25% in volume terms in 2016 compared with the prior 12 months with over 2.69m vehicle registrations, the franchises which Springfield represents decreased in the period by 5.2% nationally. This resulted in margins being squeezed in an attempt to maximise sales. \nAs the economy continued to grow, and historically low interest rates continued, the uncertainty before and after Brexit, affected the demand for new vehicles. Bank notes in a wallet (Photo: PA) 8:28 Jonathon Manning Dixons Carphone to reveal rise in profits despite consumer spending squeeze \nDixons Carphone is expected to show signs of wear from the squeeze on consumer spending, despite boosting profits, when it announces full-year results on Wednesday. \nThe electricals giant is set to reveal a 9% jump in annual pre-tax profits to around £487.5m, slowing from a 17% rise to £447m in 2016. Analysts have warned that the firm is likely to feel the strain from customers tightening their belts in the face of rising inflation. \nGraham Spooner, analyst at The Share Centre, said: \nRetailers in the UK have begun to report poor trading updates and express caution about their prospects going forward. \nThis may be the case with Dixons as the UK consumer feels the squeeze on real incomes from rising inflation through higher import costs and modest wage rises. \nThe latest slew of official data for the UK economy suggests shoppers are starting to succumb to Brexit-induced price hikes, with household spending eking out its slowest quarter-on-quarter growth since 2014 in the first quarter of this year. \nInflation also hit its highest level in nearly four years in May while retail sales took a tumble last month, with increased prices “across all sectors” being pinpointed as the key driver behind the fall. \nDixons Carphone chief executive Seb James said in January that the retailer is primed to ride out an economic slowdown and backed UK shoppers to keep spending with credit while borrowing is cheap. \nIn May, he said the firm was growing despite the “lively political backdrop”, reporting a 9% rise in annual sales and 2% climb in UK revenues for the period. Group revenue is forecast to come in at £10.5bn, up from £9.7 bn last year. \nMr Spooner added: \nConsumers were in buoyant moods during much of 2016 and the early part of 2017 and the trading update in May suggested that full year profits should be in the range of £485m to £490m. \nHSBC analyst Andrew Porteous said Dixons Carphone had made “strategic progress” over the past year. He added: \nWhile the near term demand outlook is challenging as indicated by the return of real wage declines, recent inflation data and retail sales data, the long term position of the business is as strong as ever. 8:23 Jonathon Manning TUC urgest workers to 'score' employers in bid to improve rights \nThe TUC is launching a new drive to make sure workers are paid the rate for their jobs, giving them the chance to “score” their employer. \nUnder a Great Jobs Agenda, the TUC wants workers to check if women are paid fairly, workplaces are safe and disabled people and parents are supported. \nTUC general secretary Frances O’Grady will tell a conference in London: \nOur Great Jobs Agenda will lift the cloak of secrecy that too many employers are hiding behind. \nWe want all workers - from zero-hours temps to permanent employees - to rank how their workplace performs. “Great jobs for everyone, in every part of the UK, must become as much a shared national objective as growth or productivity. \nIn the Queen’s Speech the Government promised to improve and enhance rights at work. Britain’s workers are desperate for change and control at work. Now’s the time for action. \nThe TUC will also call for a ban on zero-hours contracts, replacing them with the right to guaranteed hours. TUC General Secretary Frances O'Grady (Photo: Daily Mirror) 8:18 KEY EVENT Co-op bank discontinues sale process amid rescue deal hopes \nThe Co-operative Bank is no longer up for sale as it closes in on agreeing a rescue package with existing investors which would put it on a secure financial footing. \nThe lender, put up for sale in February, said it is in advanced discussions with a group of existing investors with a view to a prospective raising of equity cash and recapitalisation, thought to be worth around £700m. \nThe proposal would give Co-op Bank the ability to meet its long-term capital requirements, avoid it being wound down and allow it to continue as a stand-alone entity. \nThe group said: \nThe bank confirms that a majority of the key commercial aspects of the proposal have been substantially agreed between the bank and the Investors. \nThe proposal would also safeguard the bank’s values and ethics. \nCo-op said that, given the advanced nature of the proposal, it has decided to discontinue the formal sale process. The lender added that discussions continue regarding the separation of the Co-op Group pension scheme. \nIn a financial update, the bank said it is targeting “sustainable profitability” in the medium term and is now targeting a mid-single digit return on equity in 2021. In March, the bank, which has four million customers, said its ability to meet longer-term UK bank regulatory capital requirements has been hampered by low interest rates and higher than anticipated transformation and “conduct remediation” costs. \nCo-op Bank almost collapsed in 2013 after the discovery of a £1.5bn black hole in its finances and it was forced into a painful debt-for-equity swap. As a result, the loss-making lender is now majority controlled by US hedge funds. The Co-operative Group owns just 20% of the bank. The Co-op Bank (Photo: Getty Images Europe) 8:13 Jonathon Manning Newcastle United owner Mike Ashley sells entire sharehold in Rangers \nNewcastle United owner Mike Ashley has severed his ties with Rangers after selling his shares in the club to a fans’ group and a Hong Kong investor. \nIt emerged this week that the Sports Direct founder had agreed to shed his shares, having ended a retail contract which saw Ibrox take just 7p out of each pound brought in from club merchandise. \nThe news comes months after it was believed the billionaire club owner was plotting a £30m takeover of Rangers amid a long-running feud with chairman Dave King, who booted him from the board two years ago. \nThat feud came to an end this week when a short, 12-month contract was signed, which is likely to bring in an extra £5m a year. \nEarlier this week Ibrox chairman Dave King wouldn’t comment on the future of Mr Ashley’s stake , believed to be 8.92%, saying an announcement was due soon. \nThat announcement came this afternoon when Mr King took to the club’s official site to announce news that fan group Club 1872 has increased its stake and a new investor is now on board. \nClub 1872 and Julian Wolhardt have each made a £1m investment in shares in Rangers International Football Club PLC. \nThe club said the purchase marks a “significant milestone for Rangers and follows completion of the renegotiation of the Club’s retail deals earlier this week”. \nWhen seeking regime change at Ibrox, Mr King committed to work with Rangers supporters for the benefit of the Club and seeing Club 1872 increase its stake to almost 11% is a massive endorsement of that strategy. \nthe chairman said: \nThis is the partnership I want to see lead Rangers forward. \nRangers run by those who care for it most, not what has been dismissively described by some as ‘fans with calculators,’ but a mature and structured organisation which can galvanise and represent our supporters and use their skills and talents to drive our Club back to the top of Scottish and European Football. Newcastle United owner Mike Ashley (Photo: Andy Stenning) 8:08 Jonathon Manning South Korea's Woori Bank to open Frankfurt subsidiary \nOne of South Korea’s biggest banks will open a subsidiary in Frankfurt this autumn, making it the latest lender to commit to the German city in the wake of the Brexit vote. \nWoori Bank currently offers wholesale and corporate banking services to clients through its London branch, which has been operating since 1978, but will soon extend those services through a Frankfurt subsidiary set to open later this year. \nWoori already has a subsidiary in Poland, but is expanding its European operations to build relationships with South Korean businesses in Germany and also to ensure it can capture business on the continent no matter the outcome of Brexit negotiations. \nA number of banks have announced similar contingency plans after Prime Minister Theresa May confirmed that Britain will ditch the single market, which would subsequently see City firms lose passporting rights that provide wide-ranging EU access for UK-based financial services firms. \nThe South Korean bank’s decision to set up the subsidiary was made at the start of this year and will likely see it set up shop with five staff this autumn - all of which are expected to be new hires. Woori’s London office is set to continue operating as normal, with its 17 staff unlikely to face transfers. \nHubertus Vath, the managing director of city lobby group Frankfurt Main Finance (FMF), says he expects a total of 10,000 jobs to move to Frankfurt over the next five years, assuming that the European Banking Authority and euro clearing are moved to the German hub. \nMr Vath said that his organisation is currently in ongoing discussions with more than 20 financial services firms about potential moves to Frankfurt. He added: \nWe have at least three, four, five exchanges a week and more or less a stable universe of roughly two dozen financial services companies which regularly consult us. \nSome have small operations, or some have a rep office, and they think about expanding. \nWe see the biggest interest from the US, from the European banks and from Asia - Japan, Korea, China - and now slowly we see also increasing interest from South Asia as well as from the Middle East and Latin America. \nJapanese bank Daiwa earlier this week confirmed that it had settled on Frankfurt as the location for its new EU subsidiary, with plans to submit its license application to German regulator Bafin by year-end. \nNomura is also on track to expand its operations in Frankfurt, and Standard Chartered confirmed last month that it had contacted the regulator about setting up a subsidiary in the city where it already has a presence and employs “a small number of colleagues”. Others such as JP Morgan, which currently has 16,000 staff in the UK, is to ramp up operations at a number of its EU sites, with plans to move up to 1,000 London jobs to offices in Frankfurt, Luxembourg and Dublin in light of Brexit. The Union Jack flag flies besides the flag of the European Union 8:03 KEY EVENT Australian stationer Smiggle may increase UK store openings to 240 \nAustralian stationery retailer Smiggle is considering ramping up its UK store opening programme as sales continue to accelerate, defying the gloom hanging over the high street. \nManaging director John Cheston said that after pausing following last year’s referendum result, Smiggle has its foot back on the gas. \nHe said: \nAfter the vote we took our foot off the gas, we paused. But then like-for-like sales actually went up in the post-Brexit vote period, so we put our foot back on the accelerator. \nWe are elated with business in the UK, and our intention was to open 200 stores by 2019, and that’s still the aim, but we might increase that. \nIt’s not a perfect science. Depending on the circumstances, we could open 235 to 240. \nPart of the reason for Smiggle’s continued success, Mr Cheston explained, is its “affluent” customer base which is more immune from the impact of soaring inflation which is hitting high street sales. \nInflation reached its highest level in nearly four years in May, with retail sales tumbling last month as increased prices “across all sectors” put the breaks on spending. \nSmiggle - which bills itself as the “ultimate creator of colourful, fun, fashion-forward stationery” - currently employs 1,000 people in the UK, but this will grow to over 2,000 with 200 stores. \nFounded as a single shop in Melbourne in 2003, the firm has since expanded into the UK, New Zealand and Singapore. Its British arm reported sales of £29m last year and recorded a £3.8m pre-tax profit, according to accounts filed at Companies House. Mr Cheston said the aim is to be raking in £125m in revenues by 2019. \nWhile Brexit has not impacted sales, the London and Manchester terror attacks have dented footfall, the managing director added. \nMr Cheston added: \nWhat’s had the bigger impact is the London and Manchester terror attacks, that’s seen lower footfall in shopping centres, for example. \nBut Brits have been through it all before with the IRA, so they are again just getting on with their lives. \nSmiggle is ultimately owned by Premier Investment, the firm chaired by Australian billionaire Solomon Lew. A Smiggle store packed with goodies Share", "external_links": [], "published": "2017-06-26T14:55:00.000+03:00", "crawled": "2017-06-26T10:00:37.001+03:00", "highlightTitle": ""}