{"organizations": [], "uuid": "0a3c46ee1cb7339de31608ba32c25192d91196ad", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30402697/16053577.jpg", "site_section": "http://www.middevongazette.co.uk/all-content.rss", "section_title": "Devon Live All Content Feed", "url": "http://www.devonlive.com/what-was-in-the-queen-s-speech/story-30402697-detail/story.html", "country": "GB", "title": "WMN_PGoodwin commented Trump visit, fair schools funding and all the highlights of the...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-21T20:47:00.000+03:00", "replies_count": 0, "uuid": "0a3c46ee1cb7339de31608ba32c25192d91196ad"}, "author": "WMN_PGoodwin", "url": "http://www.devonlive.com/what-was-in-the-queen-s-speech/story-30402697-detail/story.html", "ord_in_thread": 0, "title": "WMN_PGoodwin commented Trump visit, fair schools funding and all the highlights of the...", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "john maloney", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "bill", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}, {"name": "damian green", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "crewe", "sentiment": "none"}, {"name": "westminster", "sentiment": "none"}, {"name": "grenfell tower", "sentiment": "none"}, {"name": "prince charles", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north devon district hospital", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "london bridge", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "european economic community", "sentiment": "none"}, {"name": "democratic unionist party", "sentiment": "none"}, {"name": "armed forces", "sentiment": "none"}, {"name": "state", "sentiment": "none"}, {"name": "exeter university", "sentiment": "none"}, {"name": "queen's speech", "sentiment": "none"}, {"name": "parliament trump", "sentiment": "none"}, {"name": "dup", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "state opening of parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Trump visit, fair schools funding and all the highlights of the Queen's speech By WMN_PGoodwin | Posted: June 21, 2017 5 COMMENTS SHARES The Queen and Prince Charles at the state opening of Parliament Trump visit, fair schools funding and all the highlights of the Queen's speech X \nCopy link to paste in your message / Comments (5) \nTheresa May has torn up much of the Conservative manifesto to deliver a legislative timetable for the next two years dominated by preparations for Brexit. \nOf 27 Bills and draft bills unveiled in her first Queen's Speech, eight are devoted to the complex process of withdrawal from the EU. \nThis will include a Repeal Bill to overturn the 1972 Act which took Britain into the European Economic Community and separate Bills on customs, trade, immigration, fisheries, agriculture, nuclear safeguards and the international sanctions regime. \nIn the wake of the Grenfell Tower fire and a string of terror attacks, the Prime Minister also announced plans for a civil disaster taskforce and a new commission for countering extremism, as well as a review of counter-terror strategy and the creation of an independent public advocate to act on behalf of bereaved families. \nBut flagship manifesto policies which find no place in the Government agenda included the scrapping of universal free school lunches, means-testing of the winter fuel payment and the reform of social care funding which opponents branded a \"dementia tax\". Meanwhile, there was no mention of the promised free vote on fox hunting. \nMilitary families in Devon were given a boost with plans try to attract more women into the Armed Forces by offering flexible working patterns to fit in with family life. \nProposals included in the Armed Forces (Flexible Working) Bill include part-time service and special arrangements to ensure individuals are not deployed too far away from home. \nRead more: Armed Forces Day in Plymouth 2017 - All the aircraft and attractions lined up for this summer \nPersonnel returning from maternity, parental or adoption leave will be offered \"more options to support an easier transition back into duty\". \nThe measures were announced at a time when the full-time trained strength of the regular forces stands at 138,350 – well short of the 144,200 target for 2020. \nThe armed forces have a target to increase the proportion of female personnel from the current 10.2% to 15% by 2020. \nThe new bill is designed to make good on a promise in the Conservative manifesto to \"attract and retain the best men and women for our armed forces, including by engaging them on a flexible basis\". \nRead more: Are landowners planning to crop-dust Dartmoor with a controlled herbicide? \nSpeculation that Donald Trump's state visit to the UK may be ditched was fuelled by its absence from the Queen's nine-minute address. \nBut Downing Street confirmed that the invitation to Mr Trump stands and said it did not feature because a date is yet to be fixed. \nAlso unveiled were Bills to extend the HS2 high-speed rail link to Crewe, permit the development of driverless cars, spaceports and commercial satellites, cut whiplash insurance claims, protect victims of domestic abuse and ban letting fees for private rented homes. \nAlthough the tally of bills is typical for a Queen's Speech, critics said that aside from Brexit it presented only a lightweight agenda to cover two years, rather than the usual one. \nFollowing her failure to reach agreement with the Democratic Unionist Party (DUP) on a deal to shore up her minority administration, Mrs May is the first PM in decades to be faced by doubts over whether she can get her legislative programme through Parliament. \nConservative sources said talks with the DUP were \"ongoing\" after the Northern Irish party warned its support cannot be \"taken for granted\". But First Secretary of State Damian Green acknowledged that it may not be possible to reach a deal in time for the Commons vote on the Queen's Speech package on June 29. \nFollowing the negative response to plans in the Tory manifesto to make pensioners pay for social care by selling their homes after they died, the speech promised only a consultation on proposals which will be brought forward to improve social care. \nPlans to extend grammar schools are reined in, with a promise only to work with Parliament to bring forward proposals for school improvement \"that can command a majority\". \nThere is no bill to impose the energy price cap promised in the manifesto, but ministers will \"consider the best way\" to protect gas and electricity consumers on the worst-value tariffs, whether by legislation or action by regulators. \nJohn Maloney, associate professor of economics at Exeter University, said there were few surprises in the speech. \n\"All the things we expected to be dropped, such as a ban on fox hunting and grammar schools were left out though we cannot be sure they won't be brought forward later,\" he added. \n\"The bits that Labour won't like were that nothing was said about spending more on health and education. \n\"It is going to be an interesting Parliament – hung parliaments and those with small majorities always are, \n\"The Government will need to be careful but I think they will be in power for the next five years, though not necessarily with Theresa May as Prime Minister. \n\"No-one can bring them down except the DUP They would need to lose seven seats in by-elections.\" \nThe State Opening of Parliament, delayed by two days because of confusion caused by the inconclusive result of the June 8 election, took place without some of the traditional ceremony, with the Queen arriving by car rather than carriage and wearing a blue dress and hat rather than her robes and state crown. \nCentrepiece of Mrs May's programme was the Repeal Bill which will transfer relevant EU laws on to the UK statute book at the moment of Brexit in March 2019, with the aim of delivering \"a smooth and orderly transition\" and avoiding uncertainty for businesses and individuals. \nThe Bill creates powers for Parliament to use secondary legislation to make what are expected to be a huge number of technical amendments to EU rules and regulations to ensure they continue to operate appropriately within UK law. It will pave the way for Parliament eventually to repeal or amend unwanted EU laws after Brexit. \nIn an apparent sign of recognition that she must seek a broad consensus for any Brexit deal, Mrs May said getting EU withdrawal right will mean securing \"a deal which delivers the result of last year's referendum and does so in a way that commands maximum public support\". \nRead more: How will changes at North Devon District Hospital affect you? \nThe speech confirmed plans for a public inquiry into the Grenfell Tower tragedy. \nA new strategy for resilience in major disasters could include a Civil Disaster Reaction Taskforce to help at times of emergency, and an independent advocate will support those affected and help them at inquests. \nWarning of an \"unprecedented\" threat from terrorism in the wake of attacks at Westminster, Manchester and London Bridge, Mrs May announced a review of counter-terrorism strategy to make sure police and security services have \"all the powers they need to protect our country\". \nThe new Commission for Countering Extremism will be given the task of supporting the Government in \"stamping out extremist ideology in all its forms\". ", "external_links": [], "published": "2017-06-21T20:47:00.000+03:00", "crawled": "2017-06-21T17:27:28.001+03:00", "highlightTitle": ""}