{"organizations": [], "uuid": "6928ca36b32842f39dafc79b57b0e358e67cd70a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article13225143.ece/ALTERNATES/s1200/asr_Stephan-Mord.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/special-features/track-record-shows-bond-dickinson-13225060", "country": "GB", "domain_rank": 21960, "title": "A track record that shows Bond Dickinson supports its clients' projects from the start to the finish", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-23T19:30:00.000+03:00", "replies_count": 0, "uuid": "6928ca36b32842f39dafc79b57b0e358e67cd70a"}, "author": "Anne Southby", "url": "http://www.chroniclelive.co.uk/special-features/track-record-shows-bond-dickinson-13225060", "ord_in_thread": 0, "title": "A track record that shows Bond Dickinson supports its clients' projects from the start to the finish", "locations": [], "entities": {"persons": [{"name": "bond dickinson", "sentiment": "positive"}, {"name": "stefan mordue", "sentiment": "none"}, {"name": "womble carlyle", "sentiment": "none"}, {"name": "womble bond dickinson", "sentiment": "none"}, {"name": "redeker sellner dahs", "sentiment": "none"}, {"name": "simon lewis", "sentiment": "none"}, {"name": "simon rowland", "sentiment": "none"}], "locations": [{"name": "new ogden centre", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "bristol", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "leeds", "sentiment": "none"}, {"name": "technology and construction court", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "university of durham", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "nbs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Advertorial A track record that shows Bond Dickinson supports its clients' projects from the start to the finish Simon Lewis, head of the construction and engineering team, explains how the company is there every step of the way Share Outstanding Achievement Winner: Stefan Mordue was presented with his award by Simon Lewis Share Get daily   Thank you for subscribing!   \nAs long-time supporters of Constructing Excellence North East, I was delighted to hand the Outstanding Achievement Award on behalf of Bond Dickinson to Stefan Mordue from NBS. \nWe were pleased to see such a high level of industry excellence demonstrated by all entrants at the awards and to see how the construction industry in the North East has grown and developed over the years – despite all the difficulties and challenges faced (and continuing to be faced) over the last few years, including the recession, skills shortages and the much talked about Brexit. \nWe now have one of the largest full service construction and engineering legal teams in the sector, covering transactional and disputes and insurance advice. \nDay in and day out, we do all we can to support our clients’ projects from start to finish. From advising on strategies for procurement and contract structure, to drafting and negotiating contract terms in close liaison with our clients. We also help our clients push their project documents over the line. \nOur track record speaks for itself – in fact Simon Rowland advised the University of Durham on its New Ogden Centre for Fundamental Physics, which won overall Project of the Year award on the evening. \nWe also rigorously defend our clients, in mediation, adjudication and court rooms. \nFor example, earlier this year we successfully defended a structural engineer in a five day trial at the Technology and Construction Court where we acted for both the structural engineer and their professional indemnity insurers. \nOur other successes in that court also include successfully recovering damages of approximately £13m for another client. \nIt’s tough in construction, we know. We are highly aware of the wider issues faced by our clients and the industry, for example having recently given talks or written on ethics in construction (including the Modern Slavery Act, the Bribery Act, blacklisting, illegal working in construction, and tax fraud), and on how to minimise the risks of using new technologies by checking your professional indemnity policy terms, and on Building Information Modelling (BIM). \nAs a national firm we can draw on the knowledge and experience of colleagues with specialist sector knowledge including insurance, manufacturing, real estate, infrastructure and energy working in collaboration to provide the best possible service. \nBecause, from our point of view, it is important for our lawyers to also provide and demonstrate excellence to our clients – in an industry where constructing excellence is essential. \nBond Dickinson has seven offices across the UK in locations including Newcastle, Bristol, Leeds and London. \nWe recently approved a transatlantic combination with US firm Womble Carlyle to create Womble Bond Dickinson. Effective from October 2017, Womble Bond Dickinson will have more than 420 partners and 1,000 lawyers across eight offices in the UK and 15 offices in the US. \nThe combination will put Womble Bond Dickinson in the UK’s top 20 and in the top 80 in the US listings with combined revenues in excess of £340million or US$410million. We also have a strategic alliance with German law firm Redeker Sellner Dahs. Like us on Facebook", "external_links": [], "published": "2017-06-23T19:30:00.000+03:00", "crawled": "2017-06-23T15:20:24.003+03:00", "highlightTitle": ""}