{"organizations": [], "uuid": "ec21bb1ae8114c2df916ae615e0f42b8f3959b34", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13128070.ece/ALTERNATES/s1200/Horncastle-Farm-comes-with-306-acres-of-farmland-and-22-acres-of-managed-woodland.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/commercial-property/horncastle-farm-goes-sale-155m-13127935", "country": "GB", "domain_rank": 21960, "title": "Horncastle Farm goes on sale for £1.55m in Northumberland village", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-02T20:00:00.000+03:00", "replies_count": 0, "uuid": "ec21bb1ae8114c2df916ae615e0f42b8f3959b34"}, "author": "Jonathon Manning", "url": "http://www.chroniclelive.co.uk/business/commercial-property/horncastle-farm-goes-sale-155m-13127935", "ord_in_thread": 0, "title": "Horncastle Farm goes on sale for £1.55m in Northumberland village", "locations": [], "entities": {"persons": [{"name": "horncastle", "sentiment": "none"}], "locations": [{"name": "northumberland", "sentiment": "none"}, {"name": "kirkwhelpington", "sentiment": "none"}, {"name": "north west", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "morpeth", "sentiment": "none"}, {"name": "northumberland county show  will parker", "sentiment": "none"}], "organizations": [{"name": "horncastle farm", "sentiment": "negative"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Horncastle Farm goes on sale for £1.55m in Northumberland village The sale of the farm near Morpeth includes 13 fields, 22 acres of managed woodland, a five-bedroom house and a cottage Share Horncastle Farm comes with 306 acres of farmland and 22 acres of managed woodland (Photo: Unknown) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nThe rare chance to develop a 330-acre farm in Northumberland has come up at a time when large farmsteads are in short supply. \nBased in Kirkwhelpington, west of Morpeth , Horncastle Farm comprises of 306 acres of pasture, meadow and arable land split across 13 fields, as well as 22 acres of managed woodland. \nAlong with the land, Horncastle has a large five-bedroom farmhouse, a separate cottage and a range of traditional and modern farm buildings. \nThe farm is being sold for £1.55m by H&H Land and Property’s Durham office, which expects to see a lot of interest in the farm, which is ripe for investment and development. \nAs well as being suitable for traditional farming, Horncastle offers stabling and storage buildings. The buildings are in need of refurbishment but could be developed into holiday cottages or residential units. Read More North farmers win top prize at the Northumberland County Show \nWill Parker, selling agent at H&H Land and Property, said: “This is a tremendous chance for someone to create a superb mixed farming enterprise within a 330 acre ring fence. \n“In addition there is plenty of opportunity for the development of the farm buildings subject to the necessary consents. \n“Currently the market is still favouring the seller. \n“There is a lack of supply which is resulting in a large share of farm sales completing privately and never reaching the open market. So, taking into account the scope that Horncastle Farm provides, from both a development and investment perspective, we are expecting a considerable amount of interest.” Horncastle Farm comes with 306 acres of farmland and 22 acres of managed woodland (Photo: Unknown) \nThe property is being sold at a time when there has been a limited supply of large farmsteads in the area. \nMany other properties currently on the market are smallholdings or equestrian properties. \nH&H Land & property added that, from a seller’s point of view, now was a good time to buy as farm prices were continuing to hold despite economic uncertainties such as the forthcoming election and Brexit. \nViewings of the property, which will be available from November 10, can be made by contacting H&H Land and Property’s Durham office. \nThe firm is one of the largest chartered surveyors and specialist rural advisors in the region. Its clients aer spread across southern Scotland, the North West and the North East. Like us on Facebook", "external_links": [], "published": "2017-06-02T20:00:00.000+03:00", "crawled": "2017-06-02T15:24:50.010+03:00", "highlightTitle": ""}