{"organizations": [], "uuid": "ca83703c9bece9bf3b19a8b23b06c05abd7a443d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30417916/16064902.jpg", "site_section": "http://www.westernmorningnews.co.uk/politics.rss", "section_title": "Devon Live Politics RSS feed", "url": "http://www.devonlive.com/major-teignmouth-flood-defence-project-won-t-be-finished-until-september/story-30417916-detail/story.html", "country": "GB", "title": "Major Teignmouth flood defence project won't be finished until...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-30T18:08:00.000+03:00", "replies_count": 0, "uuid": "ca83703c9bece9bf3b19a8b23b06c05abd7a443d"}, "author": "DanielClark", "url": "http://www.devonlive.com/major-teignmouth-flood-defence-project-won-t-be-finished-until-september/story-30417916-detail/story.html", "ord_in_thread": 0, "title": "Major Teignmouth flood defence project won't be finished until...", "locations": [], "entities": {"persons": [{"name": "ju", "sentiment": "none"}, {"name": "cllr humphrey clemens", "sentiment": "none"}, {"name": "colin firth", "sentiment": "none"}], "locations": [{"name": "brunswick street", "sentiment": "none"}], "organizations": [{"name": "teignbridge council", "sentiment": "none"}, {"name": "environment agency", "sentiment": "none"}, {"name": "tms", "sentiment": "none"}, {"name": "teignmouth maritime services ltd", "sentiment": "none"}, {"name": "teignbridge district council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Major Teignmouth flood defence project won't be finished until September   30, 2017 0 COMMENTS SHARES Comments (0) \nVital flood defence works in Teignmouth will carry on throughout the summer after additional essential repair work was identified to tackle erosion under the sea wall. The £1.3million project to carry out essential repairs and renewal works to the sea defence structure at The Point which would protect 400 homes from flooding was due to be complete in July. \nBut Teignbridge Council has needed to reschedule the end date of the vital works to deal with voids found underneath the structure and ensure its ongoing integrity. \nNow the £1.3million project won't be complete until September as additional essential repair work is needed to tackle erosion under the sea wall. Read more Film called The Mercy shot at Teignmouth starring Colin Firth due... \nCllr Humphrey Clemens, Teignbridge District Council's executive member for coastal services, said: “We understand that the extra time this will take may cause disruption over the summer period and we apologise for any inconvenience caused by the delay. However, keeping the community safe is our priority and it is imperative for the future of this part of Teignmouth that the defence work is done now to reduce the flooding risk in the future. It's a good job it's been found now so we can deal with it and make the sea wall more robust. \n“Despite the many challenges faced, we continue to work with TMS to complete the repairs quickly and car parking spaces are being released as work is completed. We would also like to thank residents and businesses for their patience so far and hope they understand the importance of getting this done now.\" \nThe £1.3million flood defence scheme started in February and focuses on the repair, renewal and strengthening of the sea defence structure at The Point. Read more Crime crackdown zone in Dawlish 'has stopped anti-social... \nWork is being carried out by local firm Teignmouth Maritime Services Ltd (TMS) and a lot of progress has been made so far. Work has involved putting 230m of steel sheet piles from the lighthouse to the Point with a new concrete capping beam and slab helping to strengthen the wall. \nPreliminary investigations before work started showed there were voids and as work has progressed, detailed investigations have provided a much clearer picture of their severity. \nTeignbridge and TMS are now carrying out works to stabilise the sea wall by filling the voids with structural concrete and anchor steel sheet piles that ensure it is able to resist the wave forces it is subjected to all year round. Read more Teignbridge Council asks residents: 'Are you happy with what we... \nThis has been made even more challenging because engineers are having to drill through a secondary set of steel sheet piles that are up to 6metres deep under the wall before they can install a capping beam and slab that further reinforce it. \nParts of The Point car park have been used for stockpiling materials and onsite facilities. Sections have now been released back into use for parking with two-thirds of the 251-space car park now free for residents and visitors to use with more spaces being released as work continues. \nSigns are in the car park show people the nearest parking alternatives are at Brunswick Street, The Quay and Eastcliff. More details are at www.teignbridge.gov.uk/parking Read more Hard and Soft Brexit are meaningless - we need a good Brexit:... \nVoids are caused by sea water washing out fill material from behind the wall, and has probably been happening over a number of years. A similar void was repaired when it opened up on Teignmouth's promenade after a major storm in December 2015. \nThe cost of the project has been funded by the Government through the flood defence grant in aid administered by the Environment Agency. The budget contained a contingency in case additional works were required.", "external_links": [], "published": "2017-06-30T18:08:00.000+03:00", "crawled": "2017-06-30T20:48:07.021+03:00", "highlightTitle": ""}