{"organizations": [], "uuid": "3cc9aee0effa49b4ef38272cd0c3586d5426702a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13026737.ece/ALTERNATES/s1200/Coventry-City-v-Oxford-United-EFL-Checkatrade-Trophy-Final.jpg", "site_section": "http://www.thejournal.co.uk/sport/?service=rss", "section_title": "nechronicle - Sport", "url": "http://www.chroniclelive.co.uk/sport/football/football-news/newcastle-united-entered-under-21-13263498", "country": "GB", "domain_rank": 21960, "title": "Why have Newcastle United entered an Under-21 team into the Checkatrade Trophy for 2017/18?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-30T18:00:00.000+03:00", "replies_count": 0, "uuid": "3cc9aee0effa49b4ef38272cd0c3586d5426702a"}, "author": "Chris Waugh", "url": "http://www.chroniclelive.co.uk/sport/football/football-news/newcastle-united-entered-under-21-13263498", "ord_in_thread": 0, "title": "Why have Newcastle United entered an Under-21 team into the Checkatrade Trophy for 2017/18?", "locations": [], "entities": {"persons": [{"name": "macaulay gillesphey", "sentiment": "none"}, {"name": "chris waugh", "sentiment": "none"}, {"name": "florian lejeune", "sentiment": "none"}, {"name": "johnstone", "sentiment": "none"}, {"name": "ivan toney", "sentiment": "none"}, {"name": "rafa benitez", "sentiment": "none"}, {"name": "nathan ake", "sentiment": "none"}], "locations": [{"name": "wembley", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}], "organizations": [{"name": "newcastle united", "sentiment": "negative"}, {"name": "newcastle united fc    newcastle united", "sentiment": "neutral"}, {"name": "united", "sentiment": "none"}, {"name": "efl", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "coventry city", "sentiment": "none"}, {"name": "premier league", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "magpies", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get Newcastle United FC   Thank you for subscribing! Could not subscribe, try again later Invalid Email \nNewcastle United will field an Under-21 side in the Checkatrade Trophy for the first time in 2017/18. \nLast season, the Magpies received a belated offer to enter a youth side to take part in the newly revamped competition. \nTraditionally, the EFL Trophy - as it is officially known - was comprised of just League One and League Two sides, but last term Premier League and Championship clubs with Category One academy status were offered the opportunity to field an Under-21 team. \nThe changes proved controversial, with traditionalists firmly opposed to having so-called ‘B sides’ play in a competition which offers EFL clubs the opportunity to play at Wembley, should they reach the final, and also to win something. \nHowever, after some reforms were voted through last month, Premier League and Championship teams have again been offered the opportunity to take part - and 16, including Newcastle, have accepted the offer. \nHere, NUFC Writer Chris Waugh explores what the Checkatrade Trophy is - and why the Magpies have accepted the opportunity this year, despite declining the offer last term... What is the Checkatrade Trophy? \nOfficially the EFL Trophy, this competition was formerly the Johnstone’s Paint Trophy and used to only involve League One and League Two clubs. However, last season 16 Premier League and Championship clubs with Category One academy status were invited to join. The final takes place at Wembley, and was won last term by Coventry City. Each participating club receives a fee of £20,000, plus various win bonuses - including £100,000 for lifting the trophy. Read More How the 'Brexit effect' on sterling means Florian Lejeune will cost £1.2m more than a year ago Why did Newcastle decline the invitation last season? \nThe Magpies received a belated invitation last season - given that they were then a Championship side - after some Premier League clubs rejected the opportunity. In fact, rather bizarrely, the club confirmed during a Fans Forum last August that they first learned of their invite via a news bulletin on Sky Sports. By the time the opportunity arose in late-July, United had already allowed the likes of Ivan Toney and Macaulay Gillesphey to leave on loan. As a result, Rafa Benitez’s Magpies did not believe they had the resources capable of entering a side in the EFL Cup having already decided it would be better for the development of some of their youngsters for them to gain first-team experience elsewhere. Another reason why some clubs opted against entering teams was that some of the games clashed with international fixtures, and many of the club’s youngsters would have been unavailable for that reason. So why have they accepted it now? \nNow that Newcastle are a top-flight club again, they were in the first batch of invitees this time around given that there are fewer than 16 Premier League sides with Category One academy status. What’s more, last year United stressed that they supported the “principle” of fielding under-21 sides in the tournament, even though they declined to do so in 2016/17. They made it clear that they would not be opposed to entering a team in the future. From this season onwards the EFL has also confirmed that there will be greater flexibility of fixture dates to allow teams to schedule games outside of international weeks. Read More Rafa rates Nathan Ake - but £20m for a 22-year-old would blow a hole in Newcastle's summer budget What is the format of the competition? \nThere is a group stage which involves 16 pools of four teams, determined by geographical location in order to reduce travel time for clubs and their supporters, each of which contains one under-21 side. Invited under-21 teams will play all of their group games away from home. Clubs are awarded three points for a win and one for a draw. However, in the event of a drawn game after 90 minutes, a penalty shootout is held to determine the victorious team, who receive an extra point. Two clubs qualify from each group for a regionalised round two, where pool winners play at home against a second-placed team from another group. Round three is also regionalised, before the quarter-final stage onwards is drawn without geographical restriction. During all of the knock-out rounds except the final - all of which are single legs - if the scores are level after 90 minutes then penalties will decide the winner. In the final, there will be both extra-time and then penalties if necessary if the scores are level after 90 minutes. Like us on Facebook", "external_links": [], "published": "2017-06-30T18:00:00.000+03:00", "crawled": "2017-06-30T18:17:08.001+03:00", "highlightTitle": ""}