{"organizations": [], "uuid": "399c197e2894c8b61ccc7a84a4b7f81d202fd9fc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article13159573.ece/ALTERNATES/s1200/newcasle.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/labour-dominate-newcastle-corbyn-defies-13159507", "country": "GB", "domain_rank": 21960, "title": "Labour dominate in Newcastle as Corbyn defies expectations in General Election 2017", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-09T09:14:00.000+03:00", "replies_count": 0, "uuid": "399c197e2894c8b61ccc7a84a4b7f81d202fd9fc"}, "author": "Keiran Southern", "url": "http://www.chroniclelive.co.uk/news/north-east-news/labour-dominate-newcastle-corbyn-defies-13159507", "ord_in_thread": 0, "title": "Labour dominate in Newcastle as Corbyn defies expectations in General Election 2017", "locations": [], "entities": {"persons": [{"name": "corbyn", "sentiment": "negative"}, {"name": "nick brown", "sentiment": "negative"}, {"name": "brown", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "catherine mckinnell", "sentiment": "none"}, {"name": "mr brown", "sentiment": "none"}, {"name": "onwurah", "sentiment": "none"}, {"name": "mckinnell", "sentiment": "none"}, {"name": "chi onwurah", "sentiment": "none"}], "locations": [{"name": "newcastle", "sentiment": "none"}, {"name": "newcastle east", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "general election 2017 news labour", "sentiment": "negative"}, {"name": "newcastle north", "sentiment": "none"}, {"name": "conservatives", "sentiment": "none"}, {"name": "newcastle central", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Labour dominate in Newcastle as Corbyn defies expectations in General Election 2017 Nick Brown, Chi Onwurah and Catherine McKinnell were all returned to Parliament by voters on a night of joy for the Labour party Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nLabour once again dominated in Newcastle as exit polls showed the party looked set to defy expectations nationally. \nNick Brown, Chi Onwurah and Catherine McKinnell were all returned to Parliament on a night of celebration for the city’s Labour candidates. \nMr Brown, who was standing in the Newcastle East seat, received \n28,127 votes, a huge increase on the 19,378 votes he received in 2015. \nNewcastle Central MP Ms Onwurah was re-elected with 24,071 votes, an increase on 2015’s 19,301. \nAnd Ms McKinnell will once again represent Newcastle North , winning 26,729 votes, up on the 20,689 from the previous General Election. Labour once again dominated in Newcastle \nAcross the city there was a big rise in voter turnout, with 69% of voters hitting the polls compared to 62% in 2015. \nNationally, exit polls indicated the Labour party had performed better than expected and the Conservatives had failed to increase their majority. \nMr Brown, who was first elected to the Newcastle East seat in 1983, said: “It really is quite exceptional. I am delighted and very proud that people I have represented for so long continue to put their trust in me. This is going to be a very, very difficult parliament because of Brexit. \n“So I feel the responsibility and will do my best to live up to the trust that is placed in me.” Read More General Election 2017 North East results in full: How North East constituencies voted \nSpeaking shortly after an exit poll had predicted the Labour party would perform much better nationally than expected, chief whip Mr Brown said: “Labour’s manifesto definitely had a resonance with Labour voters and former Labour voters. People were saying this is more like the Labour Party we used to believe in. And alongside that Jeremy Corbyn had a first rate campaign. \n“People are warming to him and they are just not buying all the assaults from our opponents.” \nMs McKinnell, who has held her seat since 2010, said: “I am really delighted with the result tonight. I am honoured and humbled by the number of voters in Newcastle North who put their trust in me again. It is so important to listen to the voters - what they need and what they want us to deliver. That is the message I am taking away. \n“Voters here have responded well to our message of hope and change and that we can deliver a better life for people in Newcastle and better chances.” Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nMs Onwurah’s Newcastle Central seat was the first to be declared across the country, beating Sunderland, who traditionally declare first. \nMs Onwurah said: “It’s fantastic. I am so proud to be the MP for Newcastle Central again. I am so grateful to the people of this great city. Our positive message in investing in people, business and infrastructure and a growing economy clearly struck a chord with people. \n“That sends a really positive message to the world that Britain is looking forward. \n“Whatever the final result, the people of this country, people young and old, will not allow a government which governs for the privileged few. They have clearly said we need a government that governs for the few.” \nSpeaking on Newcastle being the first to declare, Ms Onwurah added: “What matters is that democracy worked and people voted. But I would be lying if I said I was not very proud to be the first MP elected.” Read More", "external_links": [], "published": "2017-06-09T09:14:00.000+03:00", "crawled": "2017-06-09T04:41:37.002+03:00", "highlightTitle": ""}