{"organizations": [], "uuid": "127bf71b3408b58e84d6490315b66f53f80214cb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30387765/16042391.jpg", "site_section": "", "section_title": "", "url": "http://www.devonlive.com/luxury-devon-yacht-firm-enjoys-massive-brexit-boom/story-30387765-detail/story.html", "country": "GB", "title": "Luxury Devon yacht firm enjoys massive Brexit boom | Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-14T00:13:00.000+03:00", "replies_count": 0, "uuid": "127bf71b3408b58e84d6490315b66f53f80214cb"}, "author": "", "url": "http://www.devonlive.com/luxury-devon-yacht-firm-enjoys-massive-brexit-boom/story-30387765-detail/story.html", "ord_in_thread": 0, "title": "Luxury Devon yacht firm enjoys massive Brexit boom | Devon Live", "locations": [], "entities": {"persons": [{"name": "adrian bratt", "sentiment": "none"}, {"name": "graham maxa", "sentiment": "none"}, {"name": "paul mackenzie", "sentiment": "none"}, {"name": "haslam", "sentiment": "none"}, {"name": "ian balmforth", "sentiment": "none"}, {"name": "kiran jay haslam", "sentiment": "none"}, {"name": "chris gates", "sentiment": "none"}, {"name": "antony sheriff", "sentiment": "none"}], "locations": [{"name": "devon live luxury devon", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}, {"name": "stonehouse", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "sterling luxury devon", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "princess yachts", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "southampton boat show", "sentiment": "none"}, {"name": "mclaren automotive", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Luxury Devon yacht firm enjoys massive Brexit boom By WMN_PGoodwin | Posted: June 13, 2017 0 COMMENTS SHARES Princess Yachts has benefited from a weak Sterling Luxury Devon yacht firm enjoys massive Brexit boom X \nCopy link to paste in your message / \nDevon based Princess Yachts is to take on another 100 workers after overseas sales went into overdrive following the last year's EU referendum, leading to a £480million order-book. \nThe company saw exports surge from the day after the June 23 ballot. \nThe immediate, and sustained, fall in the value of sterling caused phones to become \"red hot\" as foreign customers sought to save up to £3million on the most expensive vessels. \nIt means Princess Yachts, based in Stonehouse, in Plymouth, needed to recruit more staff , reversing a decline in numbers at the start of 2016. \nAnd the company is still seeking workers and is about to embark on a recruitment drive which will take the workforce to 2,500 across its Plymouth sites. \nThat means taking on 100 staff, skilled labour including engineers and carpenters. \nREAD NEXT: There are thousands of jobs available in Devon - your next one could be here \nThe firm is also targeting a return to profit after it has been in the red since making a £11.3million loss in 2014. \nBut bosses are still worried about the ramifications of Brexit, and are already seeing mounting inflation eat into the firm's profit margin. \n\"On the day after the referendum the phone was red hot for the first couple of hours,\" said Kiran Jay Haslam (above), Princess Yachts' marketing director. \"Anyone purchasing a Princess Yacht in a currency other than sterling wanted that yacht NOW. \n\"They could get a 17 per cent discount because of the fall in sterling.\" \nHe said the largest Princess boat, at 40-metres in length, costs about £16.8million, but with everything else included, such as fuel, it would hit about £20million. \nBut the drop in sterling meant it could be bought for £17million, all-in. \n\"A considerable saving,\" Mr Haslam said. \"And that has motivated a turnaround in sales.\" \nHe explained that, with every boat built to order, customers are effectively buying a manufacturing \"slot\" in which the boat will be made. \nIt means the firm's order book, which had never previously topped £180million, now stands at £460million. \nSlots are now booked up right through 2018 and, for some models, into 2019. \n\"From a manufacturing perspective we are at maximum capacity,\" said Mr Haslam. \n\"We should be able to produce 220 to 240 boats this year, 2017. \n\"The plan is to get to 280 in the next cycle with a three-year target of 300 a year by 2020. \n\"That's a challenge given the mix of what we do. \n\"We were making smaller boats but M Class super-yachts can take 100 men a year to make one product. \n\"So in the past three and a half months we have recruited more than 150 people and we are now recruiting 100 more. \n\"A lot of them are people we laid off the year before when we had to downsize and reduce the workforce. \n\"But now we've done an about face.\" \nBut Mr Haslam stressed attracting skilled workers can be a challenge for Plymouth. \n\"It's the South West,\" he said. \"We are dealing with a relatively limited draw from further afield.\" \nThe firm has always boasted that its underlying business is strong, but in early 2016 it was badly affected by factors including an unfavourable euro/sterling exchange rate, recession in target markets, political upheaval in the Middle East and Russia, a slowdown in the Chinese economy, and even the 2014 storms which battered the South West. \nNow, however, its biggest threat is Brexit uncertainty and mounting inflation for imported materials – the other impact of the sterling slide. \nMr Haslam said Princess Yachts is an EU regulated manufacturer, which controls the materials it uses. \nIt is also unique because it manufactures each boat, from start to finish, in Plymouth. \nThe hike in inflation means the cost of just one engine, for example, has jumped from £1million to £1.2million. \nThe company is spending about £14million a month on materials now. \nWith the firm moving 5,000 sub-assemblies daily, and a million components between sites annually, it means it is looking at how it can maintain profits. \n\"We can't just put prices up,\" said Mr Haslam. \"We can increase marginally but we can't take away the benefit customers see now, which is due to the strength of their currency. \n\"We have been looking at our manufacturing processes and have been careful about how we purchase materials. \n\"And advances in technology are going to rewrite the entire approach to efficiency. \n\"We are looking at doing things from a technical perspective that have not been done by a manufacturer before.\" \nBut he stressed: \"The big plan is a return to profitability. We have been in the red for the past two years. \n\"This year the main focus is a return to the black. That will be for next year, 2018. \n\"But it is absolutely achievable. All the signs are in the right direction.\" \nMr Haslam said the firm has an \"exciting development programme\" with new boats about to hit the market. \nThe new Princess 55 will be launched at Southampton Boat Show later in 2017 and Mr Haslam said: \"We are bringing five new products to market this year, and seven to market next year.\" \nIn January 2016, Antony Sheriff, the Swiss-born, American-Italian former managing director of McLaren Automotive, became Princess Yachts' new chairman. \nHis appointment has been followed by the arrival of other senior executives including Paul MacKenzie, as development director, Ian Balmforth, as operations director, and Adrian Bratt, as company secretary and general counsel. \nGraham Maxa is chief finance officer, and, along with Mr Haslam, the board contains managing director Chris Gates. \nMr Haslam said the firm remains proud of its importance to the Plymouth economy, which extends to its extensive supply chain. \n\"What makes us unique and special is our approach to manufacturing,\" Mr Haslam said. \"Our average employee is 41 years old, with 11 years' service. \n\"Some have spent more than 20 years working at Princess Yachts. We have grandfathers, fathers and sons working on some assemblies. \n\"That's why we have \"Crafted in Plymouth\" on our logo.\" \nRETURN to DevonLive homepage ", "external_links": [], "published": "2017-06-14T00:13:00.000+03:00", "crawled": "2017-06-13T20:56:10.001+03:00", "highlightTitle": ""}