{"organizations": [], "uuid": "fce98563f64cf576a3c05f02dc138225e9f7f3e9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article13159326.ece/ALTERNATES/s1200/IBP_NEC_080617election_18JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/mp-catherine-mckinnell-defies-jeremy-13260381", "country": "GB", "domain_rank": 21960, "title": "MP Catherine McKinnell defies Jeremy Corbyn to back 'soft' Brexit and Single Market membership", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-29T23:00:00.000+03:00", "replies_count": 0, "uuid": "fce98563f64cf576a3c05f02dc138225e9f7f3e9"}, "author": "Jonathan Walker", "url": "http://www.chroniclelive.co.uk/news/north-east-news/mp-catherine-mckinnell-defies-jeremy-13260381", "ord_in_thread": 0, "title": "MP Catherine McKinnell defies Jeremy Corbyn to back 'soft' Brexit and Single Market membership", "locations": [], "entities": {"persons": [{"name": "catherine mckinnell", "sentiment": "negative"}, {"name": "jeremy corbyn", "sentiment": "negative"}, {"name": "chuka umunna", "sentiment": "none"}, {"name": "andy slaughter", "sentiment": "none"}, {"name": "chukka", "sentiment": "none"}, {"name": "catherine west", "sentiment": "none"}, {"name": "daniel zeichner", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "mckinnell", "sentiment": "none"}, {"name": "ruth cadbury", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "wales", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}], "organizations": [{"name": "customs union", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}, {"name": "newcastle north", "sentiment": "none"}, {"name": "snp", "sentiment": "none"}, {"name": "shadow transport", "sentiment": "none"}, {"name": "conservative", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "dup", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}, {"name": "green party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News MP Catherine McKinnell defies Jeremy Corbyn to back 'soft' Brexit and Single Market membership Newcastle MP Catherine McKinnell was one of 49 Labour rebels to back staying in the EU Single Market despite orders from Jeremy Corbyn not to Share Labour candidate for Newcastle North, Catherine McKinnell wins (Photo: Newcastle Chronicle) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email \nNorth East MP Catherine McKinnell was one of 49 rebel Labour MPs who defied orders from party leader Jeremy Corbyn and voted for a “soft” version of Brexit which includes staying in the single market. \nThe Labour leader ordered his MPs NOT to back proposals to stay in the single market, which allows businesses in the UK to export goods to the EU without restriction, and for EU firms to sell their products here. \nAnd he acted swiftly to punish rebels by sacking three shadow ministers from jobs in his front bench after they went ahead and supported the proposal anyway. Another resigned before they could be sacked. \nThere is little Mr Corbyn can do to backbench Labour MPs such as Ms McKinnell who disobeyed him. Labour Leader Jeremy Corbyn (Photo: Getty Images Europe) \nMr Corbyn ordered his MPs to abstain on an amendment to the Queen’s Speech, when the Government set out its plans for the next two years, proposed by rebel Labour MP Chuka Umunna. \nIt included plans to stay in the single market, ensure the UK would not withdraw from the EU without a deal, give Parliament a vote on the final arrangements with the EU and to stay in the Customs Union, which would ensure products can be moved between the UK and EU without long delays at borders. \nThe 49 Labour MPs who voted in favour of the amendment included Ms McKinnell, Labour MP for Newcastle North. \nShe said after the vote: “I’ve always been clear that I accept the result of last year’s referendum. However, I have been equally clear that I cannot support a hard Brexit which will make the North East poorer, and I believe at this stage of the negotiations we must have the option of staying in the single market and Customs Union at least on the table. The Union flag and the EU flag flying (Photo: PA) \n“Failure to secure the best deal possible could have a hugely damaging effect on our region’s economy and therefore people’s jobs and living standards.” \nMPs from the SNP, Liberal Democrats, Welsh party Plaid Cymru and the Green Party also supported the amendment. Read More \nBut it was defeated by 101 votes in favour and 322 votes against, after Conservative and DUP MPs voted against it. \nMost Labour MPs obeyed the order to abstain. \nThere has been speculation that some young voters backed Labour in the June 8 general election because they oppose the “hard Brexit” proposed by Conservative Prime Minister Theresa May, which includes leaving the Single Market and attempting to negotiate a new trade deal instead. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now \nHowever, Labour’s election manifesto also said a Labour government would leave the single market. \nIn theory, leaving the EU but remaining in the Single Market might only be possible if the UK agreed to continue to allow freedom of movement between the UK and EU countries rather than imposing immigration controls on people from the EU. This is something that would be the subject of negotiations. \nOther Labour rebels included Shadow Transport minister Daniel Zeichner - who then resigned from Jeremy Corbyn’s front bench in protest at the party’s stance. Read More \nAnd a number of other Labour front benchers also backed Mr Chukka’s proposals. They included Shadow Housing Ministers Ruth Cadbury and Andy Slaughter, and Shadow Foreign Office Minister Catherine West. \nMr Corbyn moves swiftly to assert his authority by sacking them. \nDebates on the Queen’s Speech have now come to an end, and the House of Commons voted down every amendment put forward by the Labour leadership. The main motion backing the speech itself was approved by 323 votes to 309, following six days of debate. \nTheresa May’s Government had to compromise to avoid facing potential defeat on the right of women from Northern Ireland, where abortion is illegal, to receive a taxpayer-funded abortion from the NHS if they travel to England and Wales. The Government avoided this by agreeing to fund free access to abortions in England for women arriving from Northern Ireland. Like us on Facebook", "external_links": [], "published": "2017-06-29T23:00:00.000+03:00", "crawled": "2017-06-30T00:08:01.003+03:00", "highlightTitle": ""}