{"organizations": [], "uuid": "c36c27bd3f77a21622ce201bfe5685f16e3ff507", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13260688.ece/ALTERNATES/s1200/SGP_NEC_290617AWARDS42JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/farming/northumberland-national-park-chief-wants-13264732", "country": "GB", "domain_rank": 21960, "title": "Northumberland National Park chief wants 'vision' for region's countryside", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-30T17:49:00.000+03:00", "replies_count": 0, "uuid": "c36c27bd3f77a21622ce201bfe5685f16e3ff507"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/farming/northumberland-national-park-chief-wants-13264732", "ord_in_thread": 0, "title": "Northumberland National Park chief wants 'vision' for region's countryside", "locations": [], "entities": {"persons": [{"name": "tony gates", "sentiment": "negative"}, {"name": "hadrian", "sentiment": "none"}, {"name": "greenlee lough", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "northumberland national park", "sentiment": "none"}, {"name": "cardiff", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "edinburgh", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}], "organizations": [{"name": "northumberland national park authority", "sentiment": "none"}, {"name": "post office", "sentiment": "none"}, {"name": "journal", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Northumberland National Park chief wants 'vision' for region's countryside Tony Gates spoke to the North East Rural Awards to call for a positive vision for rural communities Share Tony Gates, Chief executive of Northumberland national park authority (Photo: Newcastle Chronicle) Share Get business updates   Thank you for subscribing!   \nNorthumberland National Park chief executive Tony Gates spoke this week at the North East Rural Awards, organised by The Journal. In this abridged version of his speech, he outlines his vision for the future of the rural economy. \nMany of us who live in and work with rural communities talk about the problems and challenges that we face. \nThat our rural towns and villages have poor public transport links; that our closest doctor’s surgery is a 30-minute drive away; that the local Post Office is only open two hours a day; that our primary school is under threat of closure; that rising fuel and energy prices means that we are worst hit than most; that our roads are full of pot holes and never sufficiently gritted in the winter; that our broadband is so creaky that we could practically write a script in the time it takes an episode of Doctor Who to download to our laptop; that the village pub has gone, or even worse, has gone all gastro and is full of tourists. \nJust for a moment, we should think about how we could look at the pieces differently. Rural areas define much of what our country is, and what it is not – the green yang of the countryside balancing the grey yin of the urban areas, perhaps. People walking at Hadrian's Wall, Northumberland (Photo: National Trust Images/Joe Cornish) \nBoth are necessary in their different ways, and both are vital to the overall health, wealth and vitality of the nation. \nFor those of us who consider ourselves champions for rural areas, let us be just that; can we collectively shuffle the pieces so that we present a positive new view of the countryside? Can we develop a rural vision that has as much cohesive strength, ka-pow and downright va-va-va-voom as any Newcastle, Edinburgh, Manchester, Cardiff, Birmingham or London? \nI believe there is an argument that says people find it easier to invest in opportunities and vision. But at the moment I really do think we lack a cohesive rural vision. It’s time for that to change. \nWhat unique opportunities do rural areas offer that could help us create this new rural vision? Here are just some of the pieces - a few ingredients if you will - that I believe could help to shape our new rural vision. \nHealth, perhaps our number one personal and national priority. Rural areas have the potential to offer multiple opportunities to combat some of today’s most pressing health concerns such as obesity, mental and physical health and well-being, and ageing-related illnesses. \nFor me, it’s not just a question of how long a life is, but what the quality of that life is. Rural areas present the chance for everyone to improve their health, whether it is simply through consuming good quality local food or through using the countryside for sport, recreation, or leisure. Greenlee Lough in Northumberland National Park (Photo: Handout) \nOr how about our natural and cultural resources? We are blessed here in the North East with an abundance of cultural heritage, from the language, music and dialects to our poetry, songs, textiles and crafts. \nOr what about what is called “natural capital”? That’s the name given to the services our rural areas carry out for all of us rural and urban dwellers alike, simply by being there. It means things like preventing and minimising flooding, the maintenance of the vital balance of flora and fauna that keeps our earth, air and water healthy, and - of course - our rare and threatened habitats and species, each one of which is an essential piece in the puzzle. \nEven for fortunate rural dwellers, these natural and cultural resources add colour to our lives as well as presenting opportunities for our overall well being. Imagine then for a moment a life where you did not have the opportunity to experience such benefits. \nAnd what about education, training and research? Northumberland National Park Authority is on the cusp of opening the country’s first dedicated national landscape discovery centre, The Sill. \nWe believe that the countryside offers people of all ages and backgrounds the ideal learning laboratory, and we are hoping to make this experience available to at least 100,000 of people from 0-99 years of age every year. And a big part of what The Sill is going to offer is the chance to enhance social interaction and cohesion across communities. \nIn my native Northern Ireland, I used to say that the rural environment was the biggest ‘neutral venue’ we had and that it was vastly under used as a resource for bringing people together. Well, I think I could say the same for the North East now too. I firmly believe that empowering and facilitating social cohesion among disparate communities is a major part of the package of what will make our new rural vision work. Ancient stones in Northumberland National Park \nAnd finally, of course, it would be remiss of me not to mention the rural economy. In many ways, the rural economy is all of the above and then some more, a unique patchwork of agriculture, tourism, forestry, arts, creative industries, culture, public services and private enterprise – sometimes all at the same time, by the same family on the same farm. \nOur rural economy thrives when we invest our time and resources into it and when we value the fruits its bears. I think one thing that we all as rural dwellers need to keep uppermost in our minds is that countryside works when the countryside works. \nThese are living landscapes and changes are inevitable over time. Perhaps the biggest boost we can collectively give to our rural vision is to positively embrace the changes that enhance our life chances and that enable the landscapes that we love to keep on living into this generation and the next and the one beyond. \nChange does not have to mean that we lose what is special or dear to us – we have the knowledge and ability, and we should have learned the lessons from past mistakes to ensure that this does not and indeed must not happen. Read More County Durham farmer wins national prize for land management \nI am not a child any more (although I know my wife and kids would beg to differ) and I do not pretend to have all of the pieces at my disposal. But what I do believe is missing is the vision for our rural areas, and how we all, both urban and rural citizens, can play our part in fitting together the rural shapes to create something better than the sum of the parts. \nI have talked about some of the elements for a new rural vision, and now perhaps we need to think about how we should begin to take the next steps. We can expect a level of help perhaps in terms of support from local and national government, but we certainly cannot expect government to fund or provide them all. And nor should we – if we can create the shape and the vision, surely we can also find a way to drive the creation? \nMaybe we can start by looking at what challenges we face as a wider society and then assessing how rural areas can contribute. I would like to propose that we take an asset based approach. That we look at what assets exist in our rural area, identify how they can contribute to the wider well-being of society and invest and exploit them appropriately. \nThe land use pilots undertaken in Scotland in the last few years can provide a good example here. They suggest that by taking a holistic approach to the threat of flooding, for example, that we can design patterns of land use and land management across a whole river catchment that can address the causes of the problem, rather than applying a sticking plaster wherever and whenever the problem occurs. We know this approach can work yet we don’t see it being applied consistently, if at all. \nI would like to propose that we need a national vision for our rural areas that embraces such an approach, and not simply the current short-sighted and short-term lines of argument which more or less say ‘what can we save after Brexit’. Surely we can do better than that. A national vision in which local areas are empowered to identify their own opportunities and priorities and to help create and solve their own part of the puzzle. \nI’m going to end as I started - by asking you all a really simple question: \nWill you join with me in calling for the creation a new rural vision from all of the marvellous pieces that we have at our disposal? Like us on Facebook", "external_links": [], "published": "2017-06-30T17:49:00.000+03:00", "crawled": "2017-06-30T18:30:21.015+03:00", "highlightTitle": ""}