{"organizations": [], "uuid": "96170b68958571d2cd15ea37d4000ff8f717c2ff", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30380735/16037001.jpg", "site_section": "http://www.middevongazette.co.uk/politics.rss", "section_title": "Devon Live Politics RSS feed", "url": "http://www.devonlive.com/geoffrey-cox-wins-torridge-and-west-devon-for-a-fourth-time-full-report/story-30380735-detail/story.html", "country": "GB", "title": "Geoffrey Cox wins Torridge and West Devon for a fourth time -...", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-09T14:17:00.000+03:00", "replies_count": 0, "uuid": "96170b68958571d2cd15ea37d4000ff8f717c2ff"}, "author": "JoeBulmer", "url": "http://www.devonlive.com/geoffrey-cox-wins-torridge-and-west-devon-for-a-fourth-time-full-report/story-30380735-detail/story.html", "ord_in_thread": 0, "title": "Geoffrey Cox wins Torridge and West Devon for a fourth time -...", "locations": [], "entities": {"persons": [{"name": "torridge", "sentiment": "none"}, {"name": "jun", "sentiment": "none"}, {"name": "geoffrey cox", "sentiment": "none"}, {"name": "vince barry", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "robin julian", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "mr cox", "sentiment": "none"}, {"name": "david chalmers", "sentiment": "none"}, {"name": "luke pollard", "sentiment": "none"}, {"name": "cox", "sentiment": "none"}, {"name": "chris jordan", "sentiment": "none"}], "locations": [{"name": "west devon", "sentiment": "none"}, {"name": "torrington", "sentiment": "none"}, {"name": "torridge", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "langtree parish hall", "sentiment": "none"}], "organizations": [{"name": "torridge district council", "sentiment": "none"}, {"name": "torridge", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "green party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Geoffrey Cox wins Torridge and West Devon for a fourth time - full report By JoeBulmer   3 COMMENTS SHARES Comments (3) \nTorridge and West Devon turned out in force yesterday to elect Conservative Geoffrey Cox for a fourth time with a bigger share of the vote than ever before. \nMr Cox was elected as MP for Torridge and West Devon with 33,612 votes in a race which saw the highest turnout since 1997. \nAccording to Torridge District Council, the authority which oversees the election, 59,616 people voted, a turnout of 74%. \nREAD NEXT: Everything that happened in Devon on General Election night 2017 \nMr Cox beat second place candidate Vince Barry, Labour, by 20,686 votes. \nThe result were announced at around 5.30am today at the election count at Langtree Parish Hall near Torrington. \nIn his acceptance speech he said: \"I'm enormously privileged to be elected for the fourth time as member of parliament for Torridge and West Devon and although I can't see all those who did the hard work may I thank each and every one of you for everything you've done this evening. \n\"I know it's an awfully long day, tea and coffee might be nice next time so I'm told. I'm extremely grateful to everyone who has contributed to making this exercise in democracy so smooth and so harmonious. \n\"May I also congratulate my opponents the Liberal Democrats, Labour, Robin Julian the independent and Chris Jordan of the Green Party. It was a hard fought fight and I'm very grateful for the spirit in which they fought it. \n\"So ladies and gentlemen at five o'clock in the morning you all deserve your breakfast so I will say no more other than to thank you again and to say I'm deeply honoured to be a member of parliament again.\" \nREAD NEXT: Devon's new Labour MP - Who is Luke Pollard? \nLabour's Vince Barry achieved Labour's greatest ever number of votes in Torridge and West Devon which is traditionally a Conservative constituency with Liberal Democrats seen squarely as the second party. \nSpeaking after Mr Cox was declared the winner he said: \"Locally I'm overwhelmed by the level of support I have received and as far as I can tell that support has helped me get Labour's best ever result in this constituency. \n\"I think we've shown Labour can reach out to rural communities. People here are angry at being left behind. \n\"The tories just aren't addressing the problem of rural poverty. This election was a fatal mistake by Theresa May.\" \nThird place man Liberal Democrat David Chalmers garnered 10,526 votes. \nSpeaking before the declaration he said: \"I see that the result is a rejection of Mrs May's extreme Brexit and that is a really good result. She was claiming a mandate to go forward and the country has basically said no. \n\"The result we are seeing is probably the result we should have had two years ago, so we're likely to have a government or parliament with no single party having an overall majority and that was what was expected two years ago and that's what we've got now because the country is completely split on this issue. \n\"What came to the fore was that she didn't want to play on Brexit, she was asking people to give her a blank cheque but we didn't know what she was going to do with it and then during the campaign other issues like schools, housing, the NHS, social care, all of these things came to the fore, it basically threw her off course.\" \nGreen Party candidate Chris Jordan received 1,622 votes and independent candidate Robin Julian got 794 votes.", "external_links": [], "published": "2017-06-09T14:17:00.000+03:00", "crawled": "2017-06-09T10:45:05.000+03:00", "highlightTitle": ""}