{"organizations": [], "uuid": "2e8f99f504e6597a0a2daf3ec6b1a5a82f254feb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article13157882.ece/ALTERNATES/s1200/British-Voters-Go-To-The-Polls-In-The-2017-General-Election.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/business-opinion/whoever-wins-election-its-time-13157887", "country": "GB", "domain_rank": 21960, "title": "Whoever wins the election, it's time for the North East to solve some of our own problems", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-09T01:00:00.000+03:00", "replies_count": 0, "uuid": "2e8f99f504e6597a0a2daf3ec6b1a5a82f254feb"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-opinion/whoever-wins-election-its-time-13157887", "ord_in_thread": 0, "title": "Whoever wins the election, it's time for the North East to solve some of our own problems", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "none"}, {"name": "graeme whitfield", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "county durham", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "saltburn-by-the-sea", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "cabinet", "sentiment": "none"}, {"name": "middlesbrough", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "whitehall", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Opinion Whoever wins the election, it's time for the North East to solve some of our own problems Journal business editor Graeme Whitfield doubts whether the next Government will do much for the North East Share Business Opinion A woman reacts as she meets a friend outside a polling station on June 8, 2017 in Saltburn-by-the-Sea, United Kingdom (Photo: Getty Images Europe)   \nI am writing this column on polling day, knowing that by the time the majority of people read it, they will know the election result . \nThe last time I had this ‘writing-it-Thursday, getting-read-Friday’ dilemmas was before the EU referendum , when I genuinely didn’t know what the outcome would be. I can’t see into the future any more now than I could back then, but I can probably take a bit of a punt this time round. \nBy Friday morning we will, in all likelihood, have a Conservative government , despite a campaign that made incompetence its overarching value system. And whoever gets in, I’m willing to bet a fairly substantial sum that there won’t be any North East representation in the Cabinet. \nIt is 20 years ago since a County Durham MP became Prime Minister and had another three North East MPs in his first Cabinet (while others joined in the subsequent years of the Labour Government.) We can debate all night whether that made any difference to the region but one thing is sure and that is that we will wait in vain for any special favours from whoever wins on June 9. Read More Brexit? The Unravelling Olympics is the main theme for this General Election \nDoes this matter? Of course it does: we have high levels of deprivation and unemployment, recent political decisions will do us great harm and whichever party is in power should do something to change that. \nBut equally it is somewhat liberating to say: to hell with Whitehall, let’s solve our own problems. \nThere are some issues facing the region - and its infrastructure is the obvious one - that can only be solved by the Government. \nBut when I think about the other economic challenges looming for this region, I know that we can take action ourselves to make things better. \nKey to this might be a change in our collective mindset. As a man a lot wiser than me often says, London tends to think of the North East as a problem to be solved rather than an asset whose potential is yet to be unlocked. Many of us in this region are just as likely to think in this manner (and, yep, I’m as guilty as anyone). Read More This is the Sunderland vs Middlesbrough election: both sides are awful, but which is worse? \nNo-one should let Theresa May and her band of happy Brexiteers off the hook as they drive us towards disaster and treat us like fools as they do so. \nBut improving the skills and aspirations of our young people, raising the productivity of our companies, creating more and better jobs are all things that will make lives in this region better and are all within our collective grasp to do something about. \nTake the weekend off, by all means, but shall we say Monday to get cracking? \nGraeme Whitfield is business editor of The Journal Like us on Facebook", "external_links": [], "published": "2017-06-09T01:00:00.000+03:00", "crawled": "2017-06-08T20:32:59.015+03:00", "highlightTitle": ""}