{"organizations": [], "uuid": "0e65207efe52282086770f1167317616a3ea5702", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article13154531.ece/ALTERNATES/s1200/pollingday.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/news/north-east-news/uk-election-2017-results-live-13151185", "country": "GB", "domain_rank": 21960, "title": "UK Election 2017 results LIVE: Theresa May to form government with support from DUP despite election disaster", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-10T00:45:00.000+03:00", "replies_count": 0, "uuid": "0e65207efe52282086770f1167317616a3ea5702"}, "author": "Kathryn Riddell", "url": "http://www.chroniclelive.co.uk/news/north-east-news/uk-election-2017-results-live-13151185", "ord_in_thread": 0, "title": "UK Election 2017 results LIVE: Theresa May to form government with support from DUP despite election disaster", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "lily allen", "sentiment": "negative"}, {"name": "tom eden", "sentiment": "negative"}, {"name": "mr farage", "sentiment": "none"}, {"name": "paul nuttall", "sentiment": "none"}, {"name": "julie elliott", "sentiment": "none"}, {"name": "catherine mckinnell", "sentiment": "none"}, {"name": "kevan jones", "sentiment": "none"}, {"name": "sharon hodgson", "sentiment": "none"}, {"name": "phil wilson", "sentiment": "none"}, {"name": "nick brown", "sentiment": "none"}, {"name": "tom eden mcdonnell", "sentiment": "none"}, {"name": "ian lavery", "sentiment": "none"}, {"name": "osborne", "sentiment": "none"}, {"name": "laura pidcock", "sentiment": "none"}, {"name": "mary glindon", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}, {"name": "ross smith", "sentiment": "none"}, {"name": "stephen hepburn", "sentiment": "none"}, {"name": "john mcdonnell", "sentiment": "none"}, {"name": "nigel farage", "sentiment": "none"}, {"name": "frances o’grady", "sentiment": "none"}, {"name": "jarrow", "sentiment": "none"}, {"name": "emma lewell-buck", "sentiment": "none"}, {"name": "chi onwurah", "sentiment": "none"}, {"name": "george osborne", "sentiment": "none"}, {"name": "tom eden corbyn", "sentiment": "none"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "alan campbell", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "nuttall", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "sedgefield", "sentiment": "none"}, {"name": "lincolnshire", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "stoke-on-trent", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "north tyneside", "sentiment": "none"}, {"name": "north west durham", "sentiment": "none"}, {"name": "boston", "sentiment": "none"}], "organizations": [{"name": "dup", "sentiment": "negative"}, {"name": "tuc", "sentiment": "none"}, {"name": "north east england chamber of commerce", "sentiment": "none"}, {"name": "newcastle east", "sentiment": "none"}, {"name": "newcastle central", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "daily mirror", "sentiment": "none"}, {"name": "lbc", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "sunderland west", "sentiment": "none"}, {"name": "newcastle north", "sentiment": "none"}, {"name": "durham north", "sentiment": "none"}, {"name": "sunderland central", "sentiment": "none"}, {"name": "conservative", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Tom Eden 'Bad Friday Agreement' \nIn a gift to headline writers, Lily Allen has tweeted he take on a potential Theresa May - DUP deal: \nThere’s also surely something to work with with May-DUP...MayDUP..Maydup..madeup... UKIP Paul Nuttall comments on resignation \nMr Nuttall told a news conference: \n“It is clear that Ukip requires a new focus, new ideas and a new energy - and it is there amongst out ranks. \n“I think, regardless of the score last night, I have laid the foundations for the future in this General Election campaign but it will be for someone else to build on those.” (Photo: Getty Images Europe) \nAsked about a future role for former leader Nigel Farage, Mr Nuttall said: \n“If Nigel Farage wants to come back, I would be more than happy to do a job swap. I’ll take his slot on LBC and he can come back as leader of Ukip.” \nEarlier, Mr Farage said he did not blame Mr Nuttall for the party’s poor showing. \nAsked on LBC radio about the prospects of a comeback, he said: “Whether leading or playing a prominent role is perhaps a different question.” \nMr Nuttall failed in his bid to win a Commons seat on Thursday, finishing a distant third in Brexit heartland Boston and Skegness behind the Tories. \nIt was the Ukip leader’s sixth attempt to get into Parliament, having finished second behind Labour at the Stoke-on-Trent Central by-election earlier this year. \nThe party was hoping to make gains in the Lincolnshire seat, which yielded one of the highest votes for Leave in last year’s EU referendum. \nBut Mr Nuttall saw Ukip’s share of the vote slide 26.1% to 3,308 votes, while Labour increased its vote by 8.5% to 10,699 and the Tories by 19.8% to 27,271. \nThe decline in the Ukip vote was seen across the country, with the party’s vote share down to around 2% nationally, splitting between Labour and the Conservatives. \nAsked what next, Mr Nuttall replied: “What now for me? Holiday. Or if that bar is open, a pint...” BREAKING KEY EVENT Ukip's Paul Nuttall resigns \nThe Eurosceptic party had been hoping to make gains in Thursday’s poll, with Mr Nuttall running a campaign pledging to “ensure there is no backsliding on Brexit”. \nBut after Ukip failed to gain a single seat in Westminster - and with Mr Nuttall coming third in Boston and Skegness - he opted to leave his position, telling reporters: “A new era must begin with a new leader.” \nHe said he had left the foundations for the new leader to build on and ensured that the party was “still on the pitch”. \nAnd he insisted Ukip was “more relevant than ever” and would play the role in the coming months of the “guard dogs of Brexit”. 10:33 May's authority 'shredded' — Osborne \nFormer chancellor George Osborne said Mrs May’s authority was “shredded”, and that the public “managed to deliver the none-of-the-above verdict” in the election. (Photo: Andrew Matthews/PA Wire) \nPressed on whether Mrs May should resign, he said: \n“Ultimately that’s a decision for her,” but added: “Personally I don’t see how she can survive for the long term, now whether she thinks she should be at the helm for the coming period, as Britain begins its Brexit negotiations, that’s got to be a judgment for her and the Conservative parliamentary party which I’m not a member of. \n“But I don’t think anyone seriously thinks Theresa May is going to be leading the Conservatives into the next general election.” \nMr Osborne said the party had made a “profound mistake” in leaving “the centre ground” in a way that “put off urban, metropolitan, professional voters”. 10:27 KEY EVENT Theresa May to visit the Queen \nIt sounds like Theresa May will attempt to form either a minority government or a coalition to ensure the Tories remain in power: 10:26 Tom Eden 'Businesses need certainty and stability' \nCommenting on the election Ross Smith, director of policy, North East England Chamber of Commerce said: \n“Businesses need certainty and stability. This election has produced neither of these. \n“It is now of the utmost importance that the big decisions crucial to our economic success are not ducked or disregarded in political horse trading \n“Businesses have barely been considered in the election campaign and issues such as job creation and economic growth are of the utmost importance to people across our region. Any incoming Government needs to put this squarely in the centre of its agenda.” 10:06 Tom Eden Corbyn's first post-election interview \nThe Conservatives have lost the election and should stand aside for a Labour minority government, according to Jeremy Corbyn, who declared: “We are ready to serve this country.” \n“I think it’s pretty clear who won this election,” he said at Labour’s headquarters in central London. \n“We are ready to do everything we can to put our programme into operation. There isn’t a parliamentary majority for anybody at the present time, the party that has lost in this election is the Conservative Party, the arguments the Conservative Party put forward in this election have lost.“I think we need a change.” \nMr Corbyn said he would not make any coalition deals or pacts but would instead put forward Labour’s own programme for government. 09:52 KEY EVENT All the North East results \nAll the North East seats have now declared their results and all the region’s MPs have been elected. \nHere’s a guide to every seat — just click on your constituency for full details about votes cast, candidates and turnout: Jarrow constituency results - Jarrow was a Labour HOLD with Stephen Hepburn retaining seat, turnout 66.3% Newcastle Central constituency results - Newcastle central was a Labour HOLD with Chi Onwurah retaining seat, turnout 66.7% Newcastle East constituency results - Newcastle East was a Labour HOLD with Nick Brown retaining seat, turnout 66.8% Newcastle North constituency results - Newcastle North was a Labour HOLD with Catherine McKinnell retaining seat, turnout 72.8% North Durham constituency results - Durham North was a Labour HOLD with Kevan Jones retaining seat, turnout 64.6% North Tyneside constituency results - North Tyneside was a Labour HOLD with Mary Glindon retaining seat, turnout 65.7% North West Durham constituency results - North West Durham was a Labour HOLD with Laura Pidcock retaining seat, turnout 66.5% Sedgefield constituency results - Sedgefield was a Labour HOLD with Phil Wilson retaining seat, turnout 65.1% South Shields constituency results - South Shields was a Labour HOLD with Emma Lewell-Buck retaining seat, turnout 64.2% Sunderland Central constituency results - Sunderland central was a Labour HOLD with Julie Elliott retaining seat, turnout 62% Tynemouth constituency results - Tynemouth was a Labour HOLD with Alan Campbell retaining seat, turnout 73.4% Wansbeck constituency results - Wansbeck was a Labour HOLD with Ian Lavery retaining seat, turnout 68.3% Washington and Sunderland West constituency results - Washington was a Labour HOLD with Sharon Hodgson retaining seat, turnout 60.3% Share", "external_links": [], "published": "2017-06-10T00:45:00.000+03:00", "crawled": "2017-06-09T20:22:32.003+03:00", "highlightTitle": ""}