{"organizations": [], "uuid": "611a5684fa84924b17ecc4ebd754ce7e4ad3d519", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/30380666/16036927.jpg", "site_section": "http://www.thisisleicestershire.co.uk/specialolympics/rss.html?chid=181121", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/what-is-a-hung-parliament-what-happens-when-nobody-wins/story-30380666-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "Hayley_Watson published What is a hung parliament? This is what happens when nobody wins", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-09T12:35:00.000+03:00", "replies_count": 0, "uuid": "611a5684fa84924b17ecc4ebd754ce7e4ad3d519"}, "author": "Hayley_Watson", "url": "http://www.leicestermercury.co.uk/what-is-a-hung-parliament-what-happens-when-nobody-wins/story-30380666-detail/story.html", "ord_in_thread": 0, "title": "Hayley_Watson published What is a hung parliament? This is what happens when nobody wins", "locations": [], "entities": {"persons": [{"name": "hayley_watson    with the genera", "sentiment": "neutral"}, {"name": "nick clegg", "sentiment": "none"}, {"name": "ramsay macdonald", "sentiment": "none"}, {"name": "stanley baldwin", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "plaid cymru", "sentiment": "none"}, {"name": "tory ted heath", "sentiment": "none"}, {"name": "harold wilson", "sentiment": "none"}], "locations": [{"name": "downing street", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}], "organizations": [{"name": "house of commons", "sentiment": "none"}, {"name": "sdlp", "sentiment": "none"}, {"name": "snp", "sentiment": "none"}, {"name": "control of parliament", "sentiment": "none"}, {"name": "vince cable", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "tories", "sentiment": "none"}, {"name": "queen's speech", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "sinn fein", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "What is a hung parliament? This is what happens when nobody wins By Hayley_Watson   0 COMMENTS SHARES \nWith the general election results in full swing, it has been confirmed that no party is going to win the overall majority needed to win outright. \nThat means that we have a result of a hung parliament. \nBut what exactly does a hung parliament involve? \nRead more: View the results for the 2017 general election here \n326 seats are needed for a majority win. \nThe Conservatives have fallen short of this number - despite the polls predicting a landslide win for the party. \nSo what will this mean, and how will it change the aftermath of the election? What is a hung parliament? \nA hung parliament is reached when no party has an overall majority, which means more seats than all the other parties put together. \nThere are 650 seats in the House of Commons, so an overall majority would mean winning 326 . \nBut in reality it's said to be 323 because Northern Ireland's Sinn Fein MPs don't attend Parliament. \nWithout at least 323 seats, the government won't be able to pass laws if all the other MPs stand against them. \nThese laws include the Queen's Speech , when the government declares its plans for the next year. \nIt's due on June 19 , and there'll be a crisis if it's voted down. Has it happened before? \nYes - this happened back in 2010 , which is why the Tories and Lib Dems formed a coalition. \nBefore that the last hung parliament was in 1974 , when Tory Ted Heath just edged out Labour's Harold Wilson. \nThe government only lasted eight months and there had to be a fresh election. \nBritain has also had hung parliaments in 1929 and 1910 . How will it get worked out? \nOne way or another, the parties have to group together so they have enough votes to pass laws. \nThis took a few days in 2010, as the Lib Dems talked to the Tories and Labour before thrashing out a deal with the Conservatives. \nThat experience is fresh in the memory for all the parties concerned. The Lib Dems suffered disastrous election results in 2015 after five years in Government. \nAnd with Theresa May returning to the \" coalition of chaos \" scare tactics which appeared two years ago it is understandable parties are wary of aligning themselves too closely with rivals. \nSo what are the options? How talks could be on a knife edge \nControl of Parliament could be on a knife-edge if the exit poll is correct. \nThe Tories (314), UUP (2) and DUP (6) together would win 324 seat s - two short of an overall majority. \nBut Labour (266), the SNP (34), Lib Dems (14), Plaid Cymru (3), Greens (1) and SDLP (3) would be on 321 seats. \nThings were not clear what would happen if Labour was the smallest party in a hung parliament . Coalition \nThis is the most stable system and it's what happened in 2010. \nIt means including a smaller party in the government and turning its senior members into ministers, like Vince Cable or Nick Clegg. \nAll parties have been talking down the prospect of any formal coalition during the 2017 campaign. Confidence and supply \nThis is less formal than a coalition - and that means it's also less stable. \n'Confidence' means a smaller party supports the government in a vote of no confidence which would boot it out of power. \n'Supply' means a smaller party supplies the government with money by voting for, or abstaining on, the budget every year. \nBut on other votes the government would have less power, so the PM could remain in Number 10 despite losing on key issues. Vote-by-vote \nThis is an even looser arrangement - so it's one of the most unstable. \nIt means a government relying on a smaller party's support for some laws but not for others. \nSo if the SNP backed Labour, it might vote for laws where the parties see eye-to-eye like the NHS but not on major issues like the budget . \nIn the past, that would've been enough to make a government collapse and force a second election . \nBut thanks to a 2011 law all Parliaments are fixed for 5 years - although two years on from the last election, we've all seen how effectively that has worked out. \nSo it does provide a bit more stability, but there are still two ways an election can be called before the end of a five year term. \nThe first is a vote of no confidence , which would be bad PR for a ruling party to back; while the second is if two-thirds of MPs back an early election , which is what happened after Theresa May called a snap election . \nThat means - in theory - there could be a deadlock where the PM is in Downing Street despite not being able to pass their budgets. Minority government \nHere's the most high risk option. \nLabour or the Tories could decide to go it alone and hope their rivals won't risk the country by voting down the Queen's Speech. \nThat is the option Labour appears to favour if they are the largest party but do not have an overall majority. \nMany smaller parties are left-wing, so they'd rather support Labour than the Tories. \nThe history isn't good though. Tory Prime Minister Stanley Baldwin's 1924 King's Speech was defeated by 72 votes. \nHe resigned the next morning and Ramsay MacDonald formed the first Labour government, but that only lasted nine months. Second election \nIf every option fails - there will be a second election. \nIt would probably take place before Christmas, and it would cost quite a packet. \nNever mind all the uncertainty in the economy and what we do about Brexit negotiations in the meantime - there's the cost of all those mailouts, TV adverts, polling stations and ballot papers to think about. \nThe 2010 general election cost a staggering £113million, and that's just public money. \nMillions more were spent by the parties themselves - £39million in the 2015 election. \nBut hey, we haven't had enough votes in the last three years.", "external_links": [], "published": "2017-06-09T12:35:00.000+03:00", "crawled": "2017-06-09T08:47:34.000+03:00", "highlightTitle": ""}