{"organizations": [], "uuid": "5edbd861e4f7876ac0c581f25483490e35155808", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "http://www.devonlive.com/images/localworld/ugc-images/276269/Article/images/30365982/16025873.jpg", "site_section": "http://www.middevongazette.co.uk/news.rss", "section_title": "Devon Live news RSS feed", "url": "http://www.devonlive.com/let-s-get-the-working-class-in-there-comment/story-30365982-detail/story.html", "country": "GB", "title": "Let's get the working class in there: comment", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-06-01T16:30:00.000+03:00", "replies_count": 0, "uuid": "5edbd861e4f7876ac0c581f25483490e35155808"}, "author": "anitamerritt", "url": "http://www.devonlive.com/let-s-get-the-working-class-in-there-comment/story-30365982-detail/story.html", "ord_in_thread": 0, "title": "Let's get the working class in there: comment", "locations": [], "entities": {"persons": [{"name": "richard monk", "sentiment": "none"}, {"name": "jeremy", "sentiment": "none"}, {"name": "devon live", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "ben bradshaw", "sentiment": "none"}, {"name": "richard", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "great britain", "sentiment": "none"}, {"name": "fore street", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "saltcity", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "saltcity - exeter", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "tories", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Comments (0) \nRichard Monk is the owner of Saltcity - Exeter's first and last remaining surf shop . Last year he celebrated his 26th anniversary in business . Located in Fore Street, Saltcity has outlasted competition from both high street chains and other independents. \nThere have been plenty of highs and lows along the way, and you will get to hear about them and Richard's new adventures in his new monthly Devon Live column told in his very own, and sometimes unique, words. \nSo here we are again. The ones that \"run the show\" have decided to hold a snap election and let US choose who WE want to guide us through uncertain waters. Did someone say uncertain waters? I know all about them because I have sailed that river, got the badge and indeedy the t-shirt. \nThe big questions are then who do we believe and who are we gonna vote for? Here we go with all the manifestos being thrown out like a carrots in front of donkeys in an attempt to entice us into believing that THEY are going to be the best thing since sliced bread. Read next: Shocking dashcam video shows terrifying near miss on road in East Devon \nBut, like you, I have heard it a before. No one ever does what we – the normal people – want them to do. They promise us the earth then let us down and you wonder why you voted for them in the first place? \nThis year I'm trying to be pretty open minded, but it's like choosing between the plague and the black death, but i have been watching from them from the beginning until now. \nPersonally, what I've taken notice of, from what I've heard, seen and spoken about, peeps are confused, and all over the country I should imagine.They don't know who to vote for, a bit like Brexit really. Should we stay in or jump ship? \nIn the Brexit vote I chose to remain, but we left and now we just need to get on with it as I've said before. It's defo not in anybody's interests for it all not to work nicely and what Europe need to remember is that in 1945, when Europe and ourselves were on our knees after six years of hell on earth, who was it who helped rebuild Europe from all that devastation, and gave those countries the platform which they stand on today? And who helped rebuild ourselves also during this period? Errmm, nope it's gone. \nSo why don't those politicians all just work together for the best of everyone's interests, not just ours, but the whole of Europe's. Instead of looking back at 1973 when Great Britain joined the EU, look back a bit further to 1945, lest we forget and all that, and let's show the rest of the world how we can still work together. God knows the world needs to see as much unity as possible at the moment. \nUntil then the question still remains who deserves my vote in the general election? There's Mrs May; I like her a bit, but the Tories also have a tendency to lie. Their track record isn't that good in my eyes, but so far she seems to be doing a fine job. Mrs M has done exactly what she said on the tin. She seems, cool, collected and focused on the job in hand, but already I'm starting to hear the same old same old which we have all heard before. \nWhen it comes to health, I think the NHS is something we should be very proud of. Why not, if you're born in the UK and if you have a British passport, you get the benefits of the NHS. If not, you pay a fair amount according to your income, and this money goes directly into the NHS which it helps fund. It seems pretty simpletons to me, but what do I know? \nLooking at Labour, I have always liked what Mr Corbyn has said. He sounds proper working class to me; He's been arrested, drank a beer or two, and I reckon we need a bit of that. We could do with some real folk with a clear understanding of what the general oik, like me, wants. \nTo be honest, as time goes on, I like more what I hear and it seems to me over the past few weeks that more and more of my generation, and a little older and a little younger are wanting to believe that this man might deliver. It's quite funny how the old establishment are, it seems, quite clearly frightened by this man and portray him through the media how rubbish he will be. \nWe also need someone who listens, like Exeter's very own former MP Ben Bradshaw. I have had several dealings with Mr B over the years and there was a time I'd only ever seen politicians on the telly, but something arose in me head and with the modern age of technology, I messaged Exeter's very own Mr B on one occasion, about all this apparent help that was on offer for small businesses, or the lack of it during the recession. \nI needed help because it was going backwards at a rate of knots and it wasn't my fault. I didn't cause the recession and make the sun do a runner to Europe. (I hope though the sun comes back and isn't in a wig because we've left the European Union). \nQuite frankly I couldn't find one bit of help. Every time I went somewhere for help the door wasn't even there in the first place for me to open. But low and behold Mr B jumped up to the mark and replied pretty darn quick to my email. \nThe next thing I know I've got a letter with 'House of Commons' written on it sent to me Salty door. This happened several times over the course of a few years and every time I asked Mr B for this and that, he did what he could. He even ended up being a good sport and came in and got a Saltcity t-shirt; Red, of course. Read more: 'I'm not saying they should have let me off scot-free, but £14,000 is daylight robbery': comment \nThe other question we've got to ask ourselves is should I vote or not? In the past I went through a phase where I didn't vote because they all talked the talk, but no one ever walked the walk, so why vote for any of them? Then I could sit there and say, 'Told you so'. Although they say you have no right to moan if you never voted, blah blah blah, of course you do. We're British and we're gonna moan regardless. \nThen I started voting for the Greens because I thought they might be able to save me planet. But as you get older you do become more political and this, for the second time in a year, is a really big deal. \nThis could be just what we need to make a difference, break from the norm, and have a complete change in direction. Have we really found somebody who talks and thinks like us? From what I have seen and the questions I have asked, it could be we're hearing what we want to hear. \nLet's get the working class in there, innit. I think I know who I'm gonna vote for, but I can't tell them, can I Jeremy?", "external_links": [], "published": "2017-06-01T16:30:00.000+03:00", "crawled": "2017-06-01T13:58:19.002+03:00", "highlightTitle": ""}