{"organizations": ["Labour", "EU"], "uuid": "b7e8fd541d1a15bc978636e78394e04c7b883cb2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/29529265/14916900.jpg", "site_section": "http://www.thisisleicestershire.co.uk/weathernews/rss.html?chid=182806", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/brexit-fears-over-35m-regeneration-of-leicester-s-rundown-waterside-area/story-29529265-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "danjmartin published Brexit risk row over £35m regeneration of Leicester's...", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "danjmartin published Brexit risk row over £35m regeneration of Leicester's...", "spam_score": 0.0, "site_type": "news", "published": "2016-07-19T18:31:00.000+03:00", "replies_count": 0, "uuid": "b7e8fd541d1a15bc978636e78394e04c7b883cb2"}, "author": "danjmartin", "url": "http://www.leicestermercury.co.uk/brexit-fears-over-35m-regeneration-of-leicester-s-rundown-waterside-area/story-29529265-detail/story.html", "ord_in_thread": 0, "title": "danjmartin published Brexit risk row over £35m regeneration of Leicester's...", "locations": ["Leicester", "River Soar around Bath Lane", "Donisthorpe", "Bede Park", "Leicestershire", "Brexit", "Great Central Railway", "Frog Island"], "entities": {"persons": [{"name": "peter soulsby", "sentiment": "none"}, {"name": "john lewis", "sentiment": "none"}, {"name": "peter", "sentiment": "none"}, {"name": "nigel porter", "sentiment": "none"}, {"name": "coun porter", "sentiment": "none"}, {"name": "porter", "sentiment": "none"}], "locations": [{"name": "leicester", "sentiment": "none"}, {"name": "river soar around bath lane", "sentiment": "none"}, {"name": "donisthorpe", "sentiment": "none"}, {"name": "bede park", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "great central railway", "sentiment": "none"}, {"name": "frog island", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["Peter Soulsby", "John Lewis", "Peter", "Nigel Porter", "Coun Porter", "Porter"], "text": "Brexit risk row over £35m regeneration of Leicester's rundown Waterside area By danjmartin | Posted: July 19, 2016 0 COMMENTS SHARES Brexit risk row over £35m regeneration of Leicester's rundown Waterside...   \nLeicester mayor Sir Peter Soulsby has accused his rivals of 'talking up the risks and talking down the city' over fears about the effect of Brexit on multi-million plans to regenerate the run-down Waterside area. \nThe city council is spearheading a major drive to revamp the largely derelict industrial area on the banks of the River Soar around Bath Lane and Frog Island. \nSome £35 million of council and Government cash will be spent acquiring land in the area which will then be sold to a picked developer who will build 2,500 homes, 500,000 square feet of office space in a move that could ultimately create 3,000 jobs. \nThe first phase of the scheme was approved at a recent council meeting but not before Liberal Democrat councillor Nigel Porter said he was worried last month's EU referendum result would spook private developers and deter them from investing on the back of the council's contribution. \nRead more: Thousands of Leicester and Leicestershire parents fined for not sending children to schools \nIn response the Labour mayor rounded on the Lib Dems' record of opposing seemingly risky schemes that had ended in success such as The Shires redevelopment and the building of the National Space Centre and the King Power Stadium. \nBut Coun Porter warned the authority would have to put in a considerable amount of cash up front without any guarantees. \nHe said: \"My concern is that we will take the lead but after the result of the referendum there won't be anyone following us. \n\"Since the referendum there are property development funds that have closed their doors to investors. \n\"There was a report saying how badly affected the property market has become and major house builder have seen their share value drop by 40 per cent.\" \nHe added: \"I am not saying the scheme should not go ahead but there will be a great deal of risk in it. \n\"My concern is this is the wrong time. \n\"Maybe a few months ago things might have looked rosy but circumstances have changes. \n\"We need to see who has actually signed on the dotted line.\" \nSir Peter said there had been considerable enthusiasm from developers but added: \"It will only happen if we put our resources behind it. \n\"It does require the council to literally prepare the ground for the developers to come in. \n\"It is already beginning to reap benefits.\" \nHe said the council-led redevelopment of the old Donisthorpe factory as offices had already lead to a £30 million investment in nearby housing and another developer proposing to redevelop the Great Central Railway viaduct with offices shops and a hotel. \nHe added: \"What councillor Porter is doing is talking up the risks and talking down the city. \n\"A few of us have heard this before from the Liberal Democrats in the city. \n\"That is precisely what they did with the National Space Centre. \n\"They said it was too risky.\"Who would want to visit a space centre in Leicester, they said? \n\"Why are we moving a depot - a perfectly good depot - to release the land. \n\"Why couldn't we just leave it behind and avoid the risk? \n\"If we had done that we would have a depot there and some redundant settlement tanks. \n\"We certainly wouldn't have had the space centre. \n\"They said the same when we propose a compulsory purchase order for the Shires? \n\"Far too much of a risk, they said. \n\"Who wanted extra shops in Leicester?\" \nThe mayor said that had subsequently led to the Highcross development with John Lewis, the Showcase cinema and 'the buzz from the investment that came from it.' \nHe said the Lib Dems had also opposed the City Challenge scheme to regenerate the old railway yard which is now Bede Park and its surrounding housing and offices. \nHe said: \"If we had listened to the Liberal Democrats we wouldn't have had the King Power Stadium either. \n\"Well they were wrong then, they have been proved wrong by the subsequent jobs and investment and, they are wrong now.\"", "external_links": [], "published": "2016-07-19T18:31:00.000+03:00", "crawled": "2016-07-19T19:22:33.992+03:00", "highlightTitle": ""}