{"organizations": ["European Union", "Deloitte", "EY ITEM Club", "Ernst", "Bank of England", "Deloitte CFO", "EY", "Monetary Policy Committee"], "uuid": "038c89e6d110e511224d1e2ee0e273fd8840cfcb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article11624024.ece/ALTERNATES/s1200/JS56466196.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/economy-heading-challenging-time-after-11621753", "country": "GB", "domain_rank": 21960, "title": "Economy is heading for a 'challenging' time after referendum, forecasters say", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Economy is heading for a 'challenging' time after referendum, forecasters say", "spam_score": 0.0, "site_type": "news", "published": "2016-07-18T02:00:00.000+03:00", "replies_count": 0, "uuid": "038c89e6d110e511224d1e2ee0e273fd8840cfcb"}, "author": "Graeme Whitfield", "url": "http://www.chroniclelive.co.uk/business/business-news/economy-heading-challenging-time-after-11621753", "ord_in_thread": 0, "title": "Economy is heading for a 'challenging' time after referendum, forecasters say", "locations": ["Britain", "US", "North East", "EU", "UK", "Newcastle"], "entities": {"persons": [{"name": "andy haldane", "sentiment": "none"}, {"name": "young", "sentiment": "none"}, {"name": "deloitte", "sentiment": "none"}, {"name": "peter spencer", "sentiment": "none"}, {"name": "haldane", "sentiment": "none"}, {"name": "david sproul", "sentiment": "none"}, {"name": "mark hatton", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}], "organizations": [{"name": "european union", "sentiment": "none"}, {"name": "deloitte", "sentiment": "none"}, {"name": "ey item club", "sentiment": "none"}, {"name": "ernst", "sentiment": "none"}, {"name": "bank of england", "sentiment": "none"}, {"name": "deloitte cfo", "sentiment": "none"}, {"name": "ey", "sentiment": "none"}, {"name": "monetary policy committee", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["Andy Haldane", "Young", "Deloitte", "Peter Spencer", "Haldane", "David Sproul", "Mark Hatton"], "text": "Economy is heading for a 'challenging' time after referendum, forecasters say 00:00, 18 Jul 2016 Reports from accountancy giants EY and Deloitte warn of loss of confidence among businesses   Mark Hatton, from Ernst and Young, in Newcastle \nThe UK economy is heading for a “challenging” time with action needed to offset issues caused by the decision to leave the EU , according to two leading economic forecasts. \nThe ITEM Club summer forecast from accountancy group EY said the post-referendum economy will take a very different path to the one expected three months ago, with a drop in confidence affecting both consumer spending and business investment. \nThe drop in confidence was also reported in the Deloitte CFO survey, which found ‘significant downturns in corporate optimism and risk appetite’ among the chief financial officers of the UK’s largest companies. \nEY said the slump in the pound will cushion some of those problems by boosting exports, but this will not be enough to prevent a “significant deterioration in the UK’s growth outlook”. \nThe EY ITEM Club is forecasting GDP growth of 1.9% this year, down from the 2.3% it predicted in April, and expects growth of just 0.4% in 2017 (down from 2.6%) and 1.4% in 2018 (down from 2.4%). \nPeter Spencer, chief economic advisor to the EY ITEM Club, comments: “The economy is set to suffer a severe loss of momentum in the second half of this year. Heightened uncertainty is likely to hold back business investment, while consumer spending will be restrained by a weaker jobs market and higher inflation. \n“Longer-term, the UK may have to adjust to a permanent reduction in the size of the economy, compared to the trend that seemed possible prior to the vote. But amongst the gloom, the weaker pound provides one silver lining to exporters, particularly those selling to the US and emerging markets.” David Sproul, Deloitte \nThe EY forecasts come after Bank of England chief economist Andy Haldane said that unemployment could rise, the economy might slow down and the housing market could be hit following Britain’s decision to quit the European Union. \nMr Haldane said that consumer confidence could also be dented in the fallout over the referendum vote and that a “monetary response” to the economic uncertainty caused by the Brexit vote needs to be delivered in August. \nExperts are expecting a cut in interest rates from 0.5% to 0.25% and potentially an extension of quantitative easing next month after rates were unexpectedly held at 0.5% last Thursday. \nThe EY ITEM Club report forecasts that the Monetary Policy Committee will then cut interest rates to zero by November but says that inflation is likely to rise above 2% by the end of this year, averaging 2.5% in 2017, before slowing to 1.6% in 2018. \nThe forecast also sees unemployment rising from 5% currently to 7.1% by the end of 2019. \nMark Hatton, North East senior partner at EY, said the economy was facing a “challenging” few years but there were still some positives to cling to. \nHe said: “Undoubtedly the next couple of years will be challenging for the UK economy. The UK government will need to quickly introduce measures to help offset Brexit blues, support the economy and continue to attract foreign investment. \n“While investors value the UK’s access to the single market, we shouldn’t lose sight that they also rate the UK’s quality of life, diversity and culture, education, stability of social climate, telecommunications, and labour skills highly. These underlying fundamentals have not changed. \n“The focus now needs to be on making sure that the UK negotiates the right trade deals that will allow access to key markets. There are numerous opportunities for the economy to remain not only open for business but also attractive, competitive and connected.” \nThe Deloitte survey found that man CFOs are shifting to defensive balance sheet strategies and becoming more cautious of all forms of spending. \n95% of the CFOs surveyed said the level of uncertainty facing their business is above normal, high or very high, up from 83% in Q1 and returning to levels last seen in the Euro crisis in 2012. \nDavid Sproul, senior partner and chief executive of Deloitte, said: “The outcome of the EU referendum has triggered a sharp, negative response from the corporate sector. \n“This survey was conducted immediately after the referendum, against a backdrop of historical political upheaval and financial uncertainty. The faster-than-expected appointment of a new Prime Minister removes one source of uncertainty, now the Government must set out its vision for the UK’s future relationship with the EU to provide further stability and reassurance.”", "external_links": [], "published": "2016-07-18T02:00:00.000+03:00", "crawled": "2016-07-18T02:19:19.109+03:00", "highlightTitle": ""}