{"organizations": ["Virgin Money", "European Union", "Robert Gibson Newcastle"], "uuid": "dd5dd6de6a35aa23d1145d07c1a1830a10ea0a8f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article7832415.ece/ALTERNATES/s1200/JS33297188.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/virgin-money-confident-wake-brexit-11664660", "country": "GB", "domain_rank": 21960, "title": "Virgin Money confident in wake of Brexit vote as bank posts 53% profit rise", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Virgin Money confident in wake of Brexit vote as bank posts 53% profit rise", "spam_score": 0.0, "site_type": "news", "published": "2016-07-26T14:21:00.000+03:00", "replies_count": 0, "uuid": "dd5dd6de6a35aa23d1145d07c1a1830a10ea0a8f"}, "author": "Robert Gibson", "url": "http://www.chroniclelive.co.uk/business/business-news/virgin-money-confident-wake-brexit-11664660", "ord_in_thread": 0, "title": "Virgin Money confident in wake of Brexit vote as bank posts 53% profit rise", "locations": ["Brexit", "Britain", "Northern Rock", "EU"], "entities": {"persons": [{"name": "jayne-anne gadhia", "sentiment": "none"}, {"name": "scott heppell/pa wire virgin money", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "northern rock", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}], "organizations": [{"name": "virgin money", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "robert gibson newcastle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["Jayne-Anne Gadhia", "Scott Heppell/PA Wire Virgin Money"], "text": "Virgin Money confident in wake of Brexit vote as bank posts 53% profit rise 12:21, 26 Jul 2016 12:22, 26 Jul 2016 By Robert Gibson Newcastle firm says it is in a strong position to deal with uncertainty as it is a low risk retail bank without 'legacy conduct issues'   Scott Heppell/PA Wire Virgin Money took over Northern Rock following the 2007 banking crash \nVirgin Money says it is well equipped to deal with post-referendum uncertainty after reporting its strongest results since acquiring Northern Rock in 2011. \nIn the six months ended June 30, the Newcastle-headquartered company saw underlying profit before tax increase by 53% year-on-year to £101.8m. \nDuring the period, mortgage balances grew 9% to £27.7bn, while gross mortgage lending rose 19% to £4.3bn and net lending 29% to £2.2bn. Credit card balances, meanwhile, rose 31% to £2.1bn, with arrears remaining considerably lower than the industry average. \nMortgage book arrears held at low levels, with loans over three months in arrears of 0.16% compared with the industry average of 1.04%. \nThe company said it was prepared for interest rates to stay low for longer after Britain’s vote to leave the European Union , which could put pressure on banks’ financial performance and net interest margins. \nIt acknowledged expert opinions that the Brexit vote could create significant uncertainty for the economy, heightening the potential risk of a slowdown in the housing market and a rise in unemployment. \nVirgin Money’s executive focus would therefore be on determining the appropriate short and medium-term strategy to protect capital and deliver appropriate returns in a weaker economic environment. \nChief executive Jayne-Anne Gadhia, however, said: “Since the vote to leave the EU we have experienced continued strong customer demand and no evidence of changes in customer behaviour. \n“Virgin Money is in a strong position to deal with a period of post-referendum uncertainty as a low risk retail bank with a high-quality asset base and unburdened by legacy conduct issues.” \nShe added that the business had enjoyed an “excellent” first half and looked to the future with confidence. \n“We continued to grow the business strongly and have delivered a 53% increase in underlying profit as a result of our increased share of the mortgage market and the continued success of our credit card business,” she said. \n“I am particularly pleased that more customers than ever before would recommend Virgin Money to their friends and family with our overall Net Promoter Score increasing to +28 in the first half of the year. \n“After taking into consideration our strong performance in the first half of the year and the prospects for the company, we are pleased to announce that the Board has declared an interim dividend of 1.6 pence per share in respect of the half-year. \n“We remain on track to achieve our target of £3bn of high quality credit card balances by the end of 2017 and remain focused on maintaining the high-quality of our mortgage business. \n“We look to the future with confidence and will continue to drive our customer-focused strategy of growth, quality and returns.”", "external_links": [], "published": "2016-07-26T14:21:00.000+03:00", "crawled": "2016-07-26T14:50:36.373+03:00", "highlightTitle": ""}