{"organizations": ["Tory", "Labour", "European Union", "Newcastle United of Spaniard", "EU", "Newcastle", "UKIP"], "uuid": "e4e5223ecc8e92069b2a549cccfed01195abad49", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.liverpoolecho.co.uk/incoming/article11518598.ece/ALTERNATES/s1200/JS93368008.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/how-nigel-farages-party-fruitcakes-11565970", "country": "GB", "domain_rank": 21960, "title": "How Nigel Farage's party of 'fruitcakes' and 'racists' flourished in the North East", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "How Nigel Farage's party of 'fruitcakes' and 'racists' flourished in the North East", "spam_score": 0.0, "site_type": "news", "published": "2016-07-04T19:10:00.000+03:00", "replies_count": 0, "uuid": "e4e5223ecc8e92069b2a549cccfed01195abad49"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/how-nigel-farages-party-fruitcakes-11565970", "ord_in_thread": 0, "title": "How Nigel Farage's party of 'fruitcakes' and 'racists' flourished in the North East", "locations": ["Sage Gateshead", "North East", "South Shields", "Durham", "Gateshead", "UK"], "entities": {"persons": [{"name": "nigel farage", "sentiment": "none"}, {"name": "rafa benitez", "sentiment": "none"}, {"name": "david cameron", "sentiment": "none"}, {"name": "farage", "sentiment": "none"}, {"name": "jonathan arnott", "sentiment": "none"}, {"name": "roger knapman", "sentiment": "none"}, {"name": "cameron", "sentiment": "none"}, {"name": "tyne theatre", "sentiment": "none"}], "locations": [{"name": "sage gateshead", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "south shields", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "tory", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "newcastle united of spaniard", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["Nigel Farage", "Rafa Benitez", "David Cameron", "Farage", "Jonathan Arnott", "Roger Knapman", "Cameron", "Tyne Theatre"], "text": "How Nigel Farage's party of 'fruitcakes' and 'racists' flourished in the North East 17:10, 4 Jul 2016 When Nigel Farage took over as leader of UKIP 10 years ago the party barely registered in the region Shares The video will start in 8 s Cancel Click to play Tap to play The Live Event you are trying to watch is either unavailable or has not started Please refresh this page in your browser to reload this live event video \nWhen Nigel Farage became UKIP leader in 2006, the party registered barely a blip on the political Richter scale. \nNow, 10 years on he has quit having helped turn that blip into an earthquake which has reduced the previous political establishment to rubble, not least in the North East. \nIn 2005, a year before he became leader with Roger Knapman in the hot seat, the party registered just over 600,000 votes nationally at the general election. \nIn the North East you would have been hard pressed to find a UKIP candidate, the party then being categories as a southern based disenchanted right fringe of the Tory party. \nYet by 2014 it topped the poll at the European elections registering 4m votes and winning 24 seats - including one in the North East - more than any other party. \nFor a party whose reason for being was to get out of the European Union , it was quite a statement of intent from the UK public. \nIn 2006 David Cameron, then Tory party leader, said in a radio interview: “UKIP is sort of a bunch of ... fruitcakes and loonies and closet racists, mostly.” \nNine years later but as prime minister, Cameron, fearing his party would haemorrhage votes to UKIP, made a manifesto promise in the run up to 2015 general election to hold an EU referendum if the Tory party won. Nigel Farage on stage at the Sage, Gateshead \nYet UKIP still polled 3.8m votes, 12.7% of the turn out. \nIn the North East it came third, just behind Labour and the Tories, and in 11 out of the region’s 29 constituencies, the party came second. \nIt revealed how much support it was gaining from those classed as traditional Labour supporters. \nAs a result the real surprise of the EU referendum vote was that people were surprised Leave won at all. \nSupport was at its strongest in the traditional Labour heartlands, not least the North East where 58% voted for Brexit. \nOriginally seen as a threat to the Tory party, his anti Establishment posturing and views on immigration struck a chord. \nFarage has been a frequent visitor to the North East over the years and, like elsewhere in the country, has proved a divisive figure. \nFor all those appalled by his right wing political views, there are those who see him as having the finger on the pulse of working people. Nigel Farage visiting South Shields before the by-election 30 April 2013 \nHe’s been pictured drinking pints in South Shields, having a stroll round Durham city centre, arriving on the Leave battlebus in the run up to the referendum, where he spoke at a rally held at the Sage Gateshead. \nAt a meeting of the Grassroots Out group at Newcastle’s Tyne Theatre, he took a populist approach to a question about stricter immigration controls, linking it to the employment by Newcastle United of Spaniard Rafa Benitez as its new manager. \nIf he had the necessary skills to meet the role, of course he could get the job in Leave’s brave new world laughed Farage. \nDespite the party’s growth in popularity, the feeling is not many people in the region could name another UKIP member, apart from perhaps its North East MEP Jonathan Arnott. \nLove him or loathe him and his policies, he will be a hard act to follow.", "external_links": [], "published": "2016-07-04T19:10:00.000+03:00", "crawled": "2016-07-04T19:36:55.660+03:00", "highlightTitle": ""}