{"organizations": ["European Union", "National Farmers' Union", "EU", "NFU", "Owen Humphreys/PA Wire Farmers", "National Farmers’ Union"], "uuid": "e5eed47678129a74bf45b2c15a6ee30884b66ccf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article11572461.ece/ALTERNATES/s1200/JS76920609.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/farming/bid-farmers-overturn-pesticide-ban-11572401", "country": "GB", "domain_rank": 21960, "title": "Bid by farmers to overturn pesticide ban is rejected", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Bid by farmers to overturn pesticide ban is rejected", "spam_score": 0.0, "site_type": "news", "published": "2016-07-05T19:56:00.000+03:00", "replies_count": 0, "uuid": "e5eed47678129a74bf45b2c15a6ee30884b66ccf"}, "author": "Agency Staff", "url": "http://www.chroniclelive.co.uk/business/farming/bid-farmers-overturn-pesticide-ban-11572401", "ord_in_thread": 0, "title": "Bid by farmers to overturn pesticide ban is rejected", "locations": ["Earth", "England"], "entities": {"persons": [{"name": "guy smith", "sentiment": "none"}, {"name": "dave timms", "sentiment": "none"}], "locations": [{"name": "earth", "sentiment": "none"}, {"name": "england", "sentiment": "none"}], "organizations": [{"name": "european union", "sentiment": "none"}, {"name": "national farmers' union", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "nfu", "sentiment": "none"}, {"name": "owen humphreys/pa wire farmers", "sentiment": "none"}, {"name": "national farmers’ union", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["Guy Smith", "Dave Timms"], "text": "Bid by farmers to overturn pesticide ban is rejected 17:56, 5 Jul 2016 17:57, 5 Jul 2016 By Agency Staff National Farmers' Union loses out in bid to get emergency use of neonicotinoids on oilseed rape crops Shares Get business news by email Owen Humphreys/PA Wire Farmers had called for bans on pesticides to be overturned \nNew applications by farmers to use pesticides banned over concerns about their impacts on bees have been turned down. \nThe Government has turned down two “emergency” requests by the National Farmers’ Union (NFU) to use pesticides known as neonicotinoids to prevent cabbage stem flea beetle infestation on 120,000 hectares, or around a fifth of England’s oilseed rape crop. \nThe pesticides have been banned by the European Union for crops such as oilseed rape, amid concerns over harmful impacts on bees, such as damaging their ability to forage and navigate, and colony growth. \nBut emergency use can be approved for limited and controlled circumstances where the problem cannot be dealt with in any other way. \nThe Government turned down the latest applications, which come after a failed bid by the NFU for use of the pesticides for a third of the oil seed crop in England, on the advice of their Expert Committee on Pesticides. NFU Vice President Guy Smith \nThe committee said there was still insufficient information to ensure the chemicals, a coating applied to the seed and taken up by the plant, would only be used in areas where there is the biggest threat to the plants from the beetles. \nAnd it warned that there was not “adequate assurance that the use would be controlled in an appropriate fashion”. \nEnvironment campaigners said the failure of the applications was “great news for bees and other wildlife”. \nFriends of the Earth bee campaigner Dave Timms said: “The NFU risks damaging public trust in British farming with its repeated attempts to get these dangerous pesticides back into our fields - instead they should concentrate on promoting bee-friendly ways to control crop pests. \n“The Government must do all it can to safeguard our under-threat pollinators. \n“This should include maintaining the current ban on bee-harming pesticides - and committing to upholding and enforcing EU nature protection rules, which are now at risk as we plan our Brexit.” \nNFU vice president Guy Smith said: “This will be a bitter blow for farmers at a time when oilseed rape is one of the few arable crops with a good, positive margin. This decision will also be bad news for bees as bees like oilseed rape for early forage in April and May. Without healthy rape crops, bees do not do as well.”", "external_links": [], "published": "2016-07-05T19:56:00.000+03:00", "crawled": "2016-07-05T23:13:46.864+03:00", "highlightTitle": ""}