{"organizations": ["Sunderland City Council", "Northern Powerhouse", "Newcastle City Council", "EU", "NECA"], "uuid": "ca3ecef6fb35f3af112f7b06962a030bc797d644", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article10348810.ece/ALTERNATES/s1200/JS75068230.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/devolution-deal-shelved-following-brexit-11565733", "country": "GB", "domain_rank": 21960, "title": "Devolution deal shelved following Brexit uncertainty as North East leaders demand reassurances", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Devolution deal shelved following Brexit uncertainty as North East leaders demand reassurances", "spam_score": 0.0, "site_type": "news", "published": "2016-07-04T19:45:00.000+03:00", "replies_count": 0, "uuid": "ca3ecef6fb35f3af112f7b06962a030bc797d644"}, "author": "Dan O'Donoghue", "url": "http://www.chroniclelive.co.uk/news/north-east-news/devolution-deal-shelved-following-brexit-11565733", "ord_in_thread": 0, "title": "Devolution deal shelved following Brexit uncertainty as North East leaders demand reassurances", "locations": ["North East", "North Tyneside", "NECA", "EU", "UK"], "entities": {"persons": [{"name": "nick forbes", "sentiment": "none"}, {"name": "norma redfearn", "sentiment": "none"}, {"name": "paul watson", "sentiment": "none"}, {"name": "james wharton", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "george osborne", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "north tyneside", "sentiment": "none"}, {"name": "neca", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "sunderland city council", "sentiment": "none"}, {"name": "northern powerhouse", "sentiment": "none"}, {"name": "newcastle city council", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "neca", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["Nick Forbes", "Norma Redfearn", "Paul Watson", "James Wharton", "Brexit", "George Osborne"], "text": "Devolution deal shelved following Brexit uncertainty as North East leaders demand reassurances 17:45, 4 Jul 2016 North East leaders have decided to postpone any moves on the devolution agreement until a new prime minister and chancellor are in place Shares Get daily news by email Chancellor George Osborne signs the Devolution agreement for the North East \nProposals which could release billions of pounds in funding for the North East have been put on hold until the UK has a new leader. \nLeaders of the region’s seven councils chose to freeze discussions over devolution for the North East on Monday pending further assurances over funding in the aftermath of the EU referendum result. \nThe agreement guarantees £30m a year for the region to spend – in addition to being given control of a £3.4bn pool of investment cash. \nThe North East would also get new powers covering employment and skills, transport and planning and business activity – all intended to drive economic growth. \nNorth East Combined Authority leaders were unconvinced by Northern Powerhouse minister James Wharton’s claims on Friday that Brexit would strengthen devolution and not threaten it. Leaders unanimously voted to shelve the plan until a new prime minister and chancellor were in place. \nCouncillor Paul Watson, chairman of NECA and leader of Sunderland City Council , said: “It is important to make clear that we have not resigned one inch from the devolution agenda, but at this time given the Brexit vote and the uncertainty around who will be the new prime minister and chancellor we need assurances before we commit.” \nNewcastle City Council leader Nick Forbes was scathing in his criticism of the chancellor - who he said did “not give a jot” about the North East. Video loading Click to play Tap to play The Live Event you are trying to watch is either unavailable or has not started Please refresh this page in your browser to reload this live event video \nHe added: “The referendum result has turned the world on its head, the reason why EU funding is so significant for this region is that we have done far better out of the EU than we have out of central government in terms of investment. \n“That is why assurances are critical as we move forward, we know the likelihood is that the public finances will be weakened over the next few years, we know that the chancellor has abandoned his fiscal target- for six years he has imposed austerity and has now just abandoned it because he thinks he won’t meet it by 2020. \n“All the pain we have had to go through has been entirely unnecessary and politically motivated by a Tory chancellor who does not give a jot about this region.” \nHe added: “Frankly it appears ludicrous that we would push forward with the agreement without reassurances, otherwise we would simply be taking the region forward without resources or capacity and that is not acceptable.” \nCouncillor Norma Redfearn, mayor of North Tyneside, added: “We need to know that what we agreed at the outset is what we will receive. We are not against devolution, but at the end of the day we owe it to the people and businesses who have come on board. We need assurances before we go forward.” \nNECA agreed to write to the Government requesting that the deal signed with the chancellor in October last year is honoured in full before committing further. More on the North's devolution deal", "external_links": [], "published": "2016-07-04T19:45:00.000+03:00", "crawled": "2016-07-04T20:35:06.977+03:00", "highlightTitle": ""}