{"organizations": ["UKIP", "Labour", "European Parliament", "European Union"], "uuid": "01a5c69175ceb9629133f96faed757b287c7b4e6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article11562850.ece/ALTERNATES/s1200/JS93721514.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/nigel-farage-quits-ukip-leader-11562732", "country": "GB", "domain_rank": 21960, "title": "Nigel Farage quits as UKIP leader after Brexit win, saying: 'I want my life back'", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Nigel Farage quits as UKIP leader after Brexit win, saying: 'I want my life back'", "spam_score": 0.0, "site_type": "news", "published": "2016-07-04T13:27:00.000+03:00", "replies_count": 0, "uuid": "01a5c69175ceb9629133f96faed757b287c7b4e6"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/nigel-farage-quits-ukip-leader-11562732", "ord_in_thread": 0, "title": "Nigel Farage quits as UKIP leader after Brexit win, saying: 'I want my life back'", "locations": ["EU", "London"], "entities": {"persons": [{"name": "brexit", "sentiment": "none"}, {"name": "nigel farage", "sentiment": "none"}, {"name": "farage", "sentiment": "none"}, {"name": "nigel", "sentiment": "none"}, {"name": "jonathan arnott", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "ukip", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "european parliament", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["Brexit", "Nigel Farage", "Farage", "Nigel", "Jonathan Arnott"], "text": "The video will start in 8 s Cancel Click to play Tap to play The Live Event you are trying to watch is either unavailable or has not started Please refresh this page in your browser to reload this live event video \nUKIP leader Nigel Farage has announced he will step down as head of the party in the wake of the Brexit vote. \nHe said at a London press conference on Monday: “During the referendum I said I wanted my country back... now I want my life back.” \nFarage quit the role following the May 2015 general election after not being elected as an MP. \nHowever, he soon changed his mind and returned to the job. Farage said this would not happen this time. \nIn his statement, he said: “I have decided to stand aside as leader of UKIP. Dan Kitwood/Getty Images Nigel Farage \n“The victory for the Leave side in the referendum means that my political ambition has been achieved. I came into this struggle from business because I wanted us to be a self-governing nation, not to become a career politician. \n“UKIP is in a good position and will continue, with my full support to attract a significant vote. Whilst we will now leave the European Union, the terms of our withdrawal are unclear. \n“If there is too much backsliding by the Government and with the Labour party detached from many of its voters then UKIP ’s best days may be yet to come.” \nIt seems Farage did not share his intention to quit with some of his fellow Members of the European Parliament and UKIP party colleagues. \nNorth East MEP for UKIP, Jonathan Arnott, said he only became aware of his resignation on Monday morning, but paid warm tribute to his outgoing boss. Jonathan Arnott MEP \nHe said: “I could say many things about Nigel Farage, as I’m sure we all could. But I’ll point out the two most obvious in my view. \n“Nigel is the greatest orator of our time. His public speaking ability, his timing and delivery, and the sheer passion whenever he speaks, are second to none. \n“We have just won a referendum to leave the European Union . When I first joined UKIP in 2001, that seemed like a pipe dream which might never be realised. We would not have had a referendum at all, were it not for the effort and industry of Nigel Farage.” \nHe added: “I look forward to working with whoever is elected as the next leader of UKIP, as we seek to overcome these challenges. \n“Whilst I am sure that all of us in UKIP are saddened at the loss of Nigel as leader, we must not fall at this hurdle: onwards and upwards.” More on the EU Referendum", "external_links": [], "published": "2016-07-04T13:27:00.000+03:00", "crawled": "2016-07-04T18:29:27.072+03:00", "highlightTitle": ""}