{"organizations": ["Broxtowe", "Leicester Mercury", "Small Business", "European Union", "Midlands Engine", "Northern Powerhouse", "EU", "Nottingham Trent University"], "uuid": "98e15a63bc94f0b869aa243869ada415204b0413", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/29473858/14781329.jpg", "site_section": "http://www.thisisleicestershire.co.uk/generalelection2010/rss.html?chid=182803", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/mp-anna-soubry-calls-for-investment-in-skills/story-29473858-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "Leicester Mercury published MP Anna Soubry calls for investment in skills", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "Leicester Mercury published MP Anna Soubry calls for investment in skills", "spam_score": 0.0, "site_type": "news", "published": "2016-07-04T15:31:00.000+03:00", "replies_count": 0, "uuid": "98e15a63bc94f0b869aa243869ada415204b0413"}, "author": "Leicester Mercury", "url": "http://www.leicestermercury.co.uk/mp-anna-soubry-calls-for-investment-in-skills/story-29473858-detail/story.html", "ord_in_thread": 0, "title": "Leicester Mercury published MP Anna Soubry calls for investment in skills", "locations": ["Midlands Engine", "Ashfield", "EU", "Midlands"], "entities": {"persons": [{"name": "anna soubry", "sentiment": "none"}, {"name": "soubry", "sentiment": "none"}, {"name": "gemma toulson", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "midlands engine", "sentiment": "none"}, {"name": "ashfield", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "midlands", "sentiment": "none"}], "organizations": [{"name": "broxtowe", "sentiment": "none"}, {"name": "leicester mercury", "sentiment": "none"}, {"name": "small business", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "midlands engine", "sentiment": "none"}, {"name": "northern powerhouse", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "nottingham trent university", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["Anna Soubry", "Soubry", "Gemma Toulson", "Brexit"], "text": "Comments (0) \nBroxtowe MP Anna Soubry has called for investment in skills to ensure young people in the Midlands are not left behind and do not feel disaffected in the wake of the Brexit vote, writes Gemma Toulson . \nSpeaking at the inaugural Midlands Engine business conference held today at Nottingham Trent University, the Minister for Small Business said she believes many of those who voted for Brexit did so \"as a protest\" because they feel \"left behind\" by society. \nThe Midlands Engine is an initiative which is billed as the Midlands' answer to the Northern Powerhouse and is a collaboration between businesses and the public sector. Its aim is to boost productivity, attract inward investment, increase connectivity and build a regional tourism offer with the overall aim of creating 300,000 jobs across the Midlands within the next 15 years and boosting the national economy by £34 billion. \nMs Soubry said: \"I think it's incredibly important that as a society and a region we recognise that don't have the young people with the skills level they need to have. Yes, we have got fabulous, excellent universities. We have some great further education colleges and we have some outstanding schools. But frankly, we are not doing enough. In this region we have got to do something about a situation we that we shall resolve no longer to tolerate. \n\"I am not going to go over what has happened with the referendum. People from all classes and all backgrounds voted for us to leave the European Union. I don't want people misinterpreting what I am saying. \n\"I am not going to talk about my constituency, I am going to talk about a bordering constituency – Ashfield. \n\"Nearly 70 per cent of the people in Ashfield voted to leave the European Union. They have never ever voted in the numbers that they did any election. Seventy percent people turned out in Ashfield, and almost 70 percent for Brexit. \n\"I leave you with that statistic and now make this comment. It is a fact that a large number of the most deprived, underprivileged, disconnected, disaffected people in our country voted to leave the EU. Forgive me. I don't think they voted to leave the EU. \n\"They were actually saying to people like me and many people in this audience today: 'I am disaffected, I feel nobody cares about me and I am going to make this vote as a protest about the fact that I feel left behind by this society'. Many of those people do not have the advantages that many of us have enjoyed and they haven't got the skills that any of us and our children have. And that is no longer acceptable in our country. \n\"I think that coming out of all of this, and as part of the Midlands Engine, must be a huge social justice agenda and let us lead that way by ensuring that make at our heart of all of the great work that we do, a determination that no youngster anywhere in the Midlands will ever again be left behind. \n\"Each and every one of them will have the opportunity to make more of their lives than their parents and their grandparents before them, so that they have the opportunity to get skills and to get good jobs in the modern world. If we do that we will have achieved a huge improvement which will then spin out to improve everybody's lives throughout our great region.\"", "external_links": [], "published": "2016-07-04T15:31:00.000+03:00", "crawled": "2016-07-04T17:03:10.543+03:00", "highlightTitle": ""}