{"organizations": ["Newcastle Building Society", "Stockton Borough Council", "European Union", "Lawrenson & Grebby Photography LLP Newcastle Building Society"], "uuid": "97cdc7615a511e4e7e6d96030e49c6ea8f1f1d9c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i4.chroniclelive.co.uk/incoming/article10977356.ece/ALTERNATES/s1200/JS84016384.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/newcastle-building-society-doubles-half-11668797", "country": "GB", "domain_rank": 21960, "title": "Newcastle Building Society doubles half-year profits to £3.5m", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Newcastle Building Society doubles half-year profits to £3.5m", "spam_score": 0.0, "site_type": "news", "published": "2016-07-27T13:59:00.000+03:00", "replies_count": 0, "uuid": "97cdc7615a511e4e7e6d96030e49c6ea8f1f1d9c"}, "author": "Coreena Ford", "url": "http://www.chroniclelive.co.uk/business/business-news/newcastle-building-society-doubles-half-11668797", "ord_in_thread": 0, "title": "Newcastle Building Society doubles half-year profits to £3.5m", "locations": ["North East", "Trinity Square", "Gateshead", "Yarm", "Newcastle", "North Shields"], "entities": {"persons": [{"name": "haigh", "sentiment": "none"}, {"name": "andrew haigh", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "trinity square", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "yarm", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "north shields", "sentiment": "none"}], "organizations": [{"name": "newcastle building society", "sentiment": "none"}, {"name": "stockton borough council", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "lawrenson & grebby photography llp newcastle building society", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["Haigh", "Andrew Haigh"], "text": "The society launched a £10m investment programme at the start of the year, and is filling 100 jobs as part of the plans Shares Get business news by email Lawrenson & Grebby Photography LLP Newcastle Building Society chief executive Andrew Haigh \nNewcastle Building Society is in talks with local authorities which could see branches open in public buildings following a successful team-up with a North East council. \nThe society – the region’s largest – is six months into a £10m investment programme to improve customer services, including changes to its branch network which will see some locations closed and others being upgraded. \nSo far, a new branch has opened in Gateshead’s Trinity Square, a North Shields branch has been refurbished and two financial advice centres have opened in Newcastle, one incorporated in a new flagship branch at the head office. \nWithin weeks a new branch will open in the newly-refurbished Yarm library, following a unique partnership with Stockton Borough Council. \nChief executive Andrew Haigh said the move into the library could lead to similar partnerships. \nHe said: “We are particularly excited about the impending launch of a new branch in Yarm which is being progressed through an innovative partnership with Stockton Borough Council and will be located in the newly refurbished Yarm library. \n“It’s done two things – it’s supported the library services and also brings the Newcastle Building Society brand back into Yarm and the library. The building society are working together to bring much a improved service to customers and we’re not aware of any other initiative like it. \n“The society is in talks with other local authorities but we can’t reveal which as yet. \n“It’s something we would like to do if we could see other opportunities. There are a couple of ideas that may well come to fruition, and we could take that idea and work with other organisations.” Read More Newcastle Building Society to open new branch in Gateshead \nMr Haigh’s comments come as the Newcastle-headquartered society report a boost in half-year pre-tax profits to £3.5m, as it continues to invest in new products and improved services for customers. \nHalf-year results for the six months ended June 30 show the society has more than doubled the £1.5m pre-tax profit it recorded over the same period in 2015. \nThe firm also reported healthy lending volumes with an increase in the value of its gross residential lending, from £148m to £255m in the first half of 2016. \nIts current £10m investment programme, in which it is changing the way it delivers its service to customers with improvements to its branch network, telephone and digital offering, and operational infrastructure, included the creation of around 100 jobs. \nSo far, more than 50 positions have already been filled in its mortgage, IT, HR, risk and customer service departmens, and the rest of the roles are available in a “broad mix” of IT, customer service and marketing roles. \nMr Haigh said that, post-Brexit and through its investments for customers and staff, the society was keen to continue its strong relationships with customers, to show it is a steady ship. \nMr Haigh said: “We are a straightforward building society from the North East that puts our customers at the heart of our business, providing a great range of mortgage and savings products and trusted financial advice. \n“We’ve been doing this for generations of customers, for more than 150 years and it’s what we will continue to do. \n“While we have seen a more volatile economic backdrop over the first half of 2016, which became more pronounced following the vote to leave the European Union, this won’t impact our commitment to providing our customers with the products, services and advice they need. \n“We’ve had the initial announcement on Brexit and there will be periods where people are uncertain and we want to be a steady presense that people can turn to. \n“It is at times like this that customers want to know that their money is safe, they can get a mortgage to buy a home, and that advice is available to help them navigate the stormy seas.” \nA new Community Saver account has also been launched that will help provide ongoing financial support in the form of grants made available to charities and community groups located in or around the communities served by its 27-strong branch network.", "external_links": [], "published": "2016-07-27T13:59:00.000+03:00", "crawled": "2016-07-27T14:25:00.941+03:00", "highlightTitle": ""}