{"organizations": ["Newcastle", "EDL", "Northumbria Police and Community Relations Group", "Pegida", "Wear Racial Equality Council", "Commonwealth", "EU", "English Defence League"], "uuid": "a4401dc37ddd232d9bb2738d3aec0e55efd48927", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article10460999.ece/ALTERNATES/s1200/JS65895006.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "nechronicle - News", "url": "http://www.chroniclelive.co.uk/news/north-east-news/how-post-brexit-racial-tensions-11596394", "country": "GB", "domain_rank": 21960, "title": "How post Brexit racial tensions are being dealt with in Newcastle", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "How post Brexit racial tensions are being dealt with in Newcastle", "spam_score": 0.0, "site_type": "news", "published": "2016-07-11T20:30:00.000+03:00", "replies_count": 0, "uuid": "a4401dc37ddd232d9bb2738d3aec0e55efd48927"}, "author": "Mike Kelly", "url": "http://www.chroniclelive.co.uk/news/north-east-news/how-post-brexit-racial-tensions-11596394", "ord_in_thread": 0, "title": "How post Brexit racial tensions are being dealt with in Newcastle", "locations": ["Britain", "Pakistan", "Buckingham Palace", "Bengal", "Northumbria", "England", "EU", "UK", "Uganda", "Newcastle", "India", "North East", "Tyneside", "Bangladesh"], "entities": {"persons": [{"name": "tyne", "sentiment": "none"}, {"name": "shukla", "sentiment": "none"}, {"name": "anthony", "sentiment": "none"}, {"name": "hari shukla", "sentiment": "none"}, {"name": "stanley", "sentiment": "none"}, {"name": "stanley bailey", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "pakistan", "sentiment": "none"}, {"name": "buckingham palace", "sentiment": "none"}, {"name": "bengal", "sentiment": "none"}, {"name": "northumbria", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "uganda", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "india", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "tyneside", "sentiment": "none"}, {"name": "bangladesh", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "none"}, {"name": "edl", "sentiment": "none"}, {"name": "northumbria police and community relations group", "sentiment": "none"}, {"name": "pegida", "sentiment": "none"}, {"name": "wear racial equality council", "sentiment": "none"}, {"name": "commonwealth", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "english defence league", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["Tyne", "Shukla", "Anthony", "Hari Shukla", "Stanley", "Stanley Bailey"], "text": "How post Brexit racial tensions are being dealt with in Newcastle 18:30, 11 Jul 2016 Veteran race relations campaigner Hari Shukla talks of how lessons learned over 40 years in Newcastle are helping the region stay calm Shares The video will start in 8 s Cancel Click to play Tap to play The Live Event you are trying to watch is either unavailable or has not started Please refresh this page in your browser to reload this live event video \nThe UK has something to learn from the North East if it wants to deal with the post Brexit racial tensions, according to Hari Shukla . \nNewcastle’s veteran race relations campaigner, who has received a CBE for his work, is now in his 80s - but his powers of persuasion are still both formidable and indefatigable. \nIn the wake of the recent EU referendum vote in which Britain chose to ‘Leave’, there has been a series of racist incidents across the country, including the North East, which has seen many despair of England. \nDr Shukla, who has seen it all before, is not one to give up on his adoptive country. \nHe wants to highlight the hard work that has gone into race relations in the last 40 years in Newcastle and portray it as a beacon of hope in what has turned into dark times since the June 23 vote. \nDr Shukla said: “At the centre of the recent European referendum was the question of immigration, revealing race relations are a thorny issue. \n“Lots of people who come from outside our country make a contribution. There is no tension in Newcastle and people are very kind here. Then I stop and ask - how did this happen?” Hari Shukla \nWhile it is not quite true there are no tensions in Newcastle, compared to what’s happening in some parts of the rest of the country, it’s fair to say it would have been a whole lot worse had it not been for the work of Dr Shukla alongside the local authorities, police and local communities. \nAnd the lessons they have learned are perhaps lessons that should be learned elsewhere. \nDr Shukla was appointed Director of the Tyne and Wear Racial Equality Council in 1974 . \nBack then it was Asians like Dr Shukla who the right wing vilified as opposed to the east Europeans of and Muslims of today. \nThe major influx of Asians - from countries like India, Pakistan, Bengal and Bangladesh - came in the 1950s as British passport holders. \nThe biggest leap in numbers came between 1961 and 1971, when for example, Britain’s Indian population doubled. \nThen the 1971 Immigration Act came into force, meaning Commonwealth immigrants had to face the same restrictions as any other person applying to live and work in Britain, and numbers dwindled. Read More How many race hate crimes have taken place in Tyneside since Brexit vote? \nDr Shukla, who was born in Uganda in 1933 before coming to England, said: “Before I came here the community and Northumbria police were at loggerheads, each blaming the other. Nothing was happening.” \nThe leaders of the various ethnic communities held a meeting with then Chief Constable Sir Stanley Bailey and his officers. \nDr Shukla said it was a lively meeting, each side saying the other was to blame for a failure to communicate. \nAt the end of the meeting Sir Stanley told his officers and the community leaders to go away and separately draw up a list of complaints and issues they wanted to be addressed for them to move forward. \nThe ethnic community felt the police did not understand the problems they faced, the police said they weren’t being told about the problems in the first place and were generally met with a wall of silence. \nThe problem of course was communication - or lack of it - and misunderstandings on both sides. \nThe upshot was the formation of the Northumbria Police and Community Relations Group which forged a direct link between the various communities and the Chief Constable and his officers, a link that continues to this day. \nAnd there was a lot of misunderstanding about what a multicultural society was, its role in Britain and whether the best way forward was through assimilation or integration. Anthony Devlin/PA Wire Dr Hari Shukla from Newcastle upon Tyne is made a CBE (Commander of the Order of the British Empire) by the Princess Royal at Buckingham Palace \nDr Shukla preferred integration. He explained: “Assimilation is when you give up your values and traditions after you came into the UK and do what others do. \n“With integration you retain your values and share with each other. That is what makes us richer.” \nHe added: “Our multicultural society developed step by step. \n“Once we brought communities together we established a working relationship with local authorities in Tyne and Wear, Northumbria police. Our relationship with the police is the best in the country. It started with Sir Stanley Bailey. \n“Everybody is valued and has something to contribute. There are 140 different nationalities in Newcastle. \n“It’s very important in education, social services, housing we all work together. \n“When issues are raised it is important they are listened to.” \nAnd he said the police are quick to act when there is a perceived threat, for example recent protests by the English Defence League and in February last year when the European extreme right wing group Pegida held its first UK demonstration in Newcastle. \nDr Shukla said: “When EDL and outsiders who are against ethnic minority communities come here, when this kind of thing happens, police assure us that everyone will be safe and carry on with your work. \n“There is this trust and it’s taken quite a lot of time to get this trust and this word is very important.” \nAnd since the referendum vote there’s been a lot of phone calls and meetings, the local community wanting to be proactive not reactive. \nDr Shukla said: “I don’t have a single day free. I’m on lots of committees, helping to support keeping everyone together.” \nAnd as for what the rest of the country can do about dealing with racial tensions, he added: “They will have to learn the lessons of our experience. \n“You can’t leave them on their own, we have to integrate them to become party of the community.” More on the EU Referendum", "external_links": [], "published": "2016-07-11T20:30:00.000+03:00", "crawled": "2016-07-11T21:17:18.421+03:00", "highlightTitle": ""}