{"organizations": ["LEP", "European Union", "SMD Ltd.", "EU"], "uuid": "8f1c4abda530d0d3f5f37202fa011d403b05d156", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article11261409.ece/ALTERNATES/s1200/JS81445377.jpg", "site_section": "http://www.thejournal.co.uk/business/?service=rss", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-opinion/north-east-lep-seeking-government-11670169", "country": "GB", "domain_rank": 21960, "title": "North East LEP is seeking Government assurances on Euro funding", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "North East LEP is seeking Government assurances on Euro funding", "spam_score": 0.0, "site_type": "news", "published": "2016-07-27T20:30:00.000+03:00", "replies_count": 0, "uuid": "8f1c4abda530d0d3f5f37202fa011d403b05d156"}, "author": "Evening Chronicle", "url": "http://www.chroniclelive.co.uk/business/business-opinion/north-east-lep-seeking-government-11670169", "ord_in_thread": 0, "title": "North East LEP is seeking Government assurances on Euro funding", "locations": ["North East", "Wallsend  Brexit", "Brexit", "UK", "EU", "Europe"], "entities": {"persons": [{"name": "andrew hodgson", "sentiment": "none"}, {"name": "jeremie", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "wallsend  brexit", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}], "organizations": [{"name": "lep", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "smd ltd.", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["Andrew Hodgson", "Jeremie"], "text": "North East LEP is seeking Government assurances on Euro funding 18:30, 27 Jul 2016 Andrew Hodgson, chair of the North East LEP, says certainty over future funding would demonstrate real confidence in the region Shares Get business news by email Andrew Hodgson of SMD Ltd. in Wallsend \nBrexit and its impact on European Union structural funding will be more keenly felt in the North East than any other region. \nWe have an outstanding track record of securing substantial investment from Europe and investing it wisely to drive our economic growth. \nWhile I can’t give cast iron guarantees about future EU funding, I think it’s important to outline where we are currently at and what the North East LEP is doing to press Government for assurances so we can plan ahead for a future without EU investment. \nThe North East LEP area has £90m of its total £437m EU funding allocation committed to projects planned to run until 2020. \nWe also have £104m worth of projects in the pipeline, put forward to Government for approval before the referendum vote. \nThere are big numbers attached to these schemes. In total, they will assist more than 7,400 businesses, support almost 30,000 people into work and help upskill people in work. \nSo far the Government has stated that it is ‘business as usual’ for contracted projects. However, for the £104m of pipeline projects, the assurance of being able to secure EU funding is uncertain. \nThere are two important issues that we are seeking urgent Government assurance on. \nWe have had verbal commitment – albeit from ministers no longer there – and quite strong public comments that the Government is committed to replacing the quantum of support that the North East currently has from the EU. \nThere have been more mixed signals since the referendum, however, about whether they will honour the full amount. \nWe have not had unequivocal certainty from Government. That is fuelling economic uncertainty and we need a commitment quickly that they will underwrite the full amount. \nIf the Government does commit to match the EU funding being lost, then that brings us to a second issue. \nCan the Government commit to an absolute timing mechanism that triggers as soon as the EU funds stop? \nThat would allow our partners match funding the big structural projects to be able to develop their business cases and plan ahead with greater certainty for the longer term. \nThe future of the £120m Jeremie 2 fund is another hugely important issue for the North East. \nEuropean money makes up half of the fund which we worked hard to keep in the region for the exclusive support of North East small and medium-sized businesses. \nWe are seeking assurance that there will not be a negative impact on Jeremie 2 due to Brexit. In parallel, we are also exploring alternative ways to deliver similar support if that scenario arises. \nA substantial amount of regional funding comes from the UK, through the Regional and Local Growth Funds and Enterprise Zones. \nWe handed our final submission for Local Growth Fund 3 to Government this week. We have put forward a very ambitious list of projects for the North East. \nA really positive signal from Government would be a positive response to our Local Growth Fund bid – that would demonstrate real confidence in our economic future. \nAndrew Hodgson is chair of the North East LEP", "external_links": [], "published": "2016-07-27T20:30:00.000+03:00", "crawled": "2016-07-27T21:09:44.134+03:00", "highlightTitle": ""}