{"organizations": ["Newcastle", "Engie", "RWE", "Newcastle University", "Siemens Professor of Energy Systems", "Northern Powergrid", "Fifth Carbon Budget"], "uuid": "bfd350ccccf65169cd10db424fc2244380215c11", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i1.chroniclelive.co.uk/incoming/article11641673.ece/ALTERNATES/s1200/phil.jpg", "site_section": "http://www.thejournal.co.uk/business/?service=rss", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/newcastle-professor-says-uk-could-11640743", "country": "GB", "domain_rank": 21960, "title": "Newcastle professor says UK could produce 100% of its energy from renewable sources", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Newcastle professor says UK could produce 100% of its energy from renewable sources", "spam_score": 0.0, "site_type": "news", "published": "2016-07-20T20:30:00.000+03:00", "replies_count": 0, "uuid": "bfd350ccccf65169cd10db424fc2244380215c11"}, "author": "Peter McCusker", "url": "http://www.chroniclelive.co.uk/business/business-news/newcastle-professor-says-uk-could-11640743", "ord_in_thread": 0, "title": "Newcastle professor says UK could produce 100% of its energy from renewable sources", "locations": ["UK", "Hartlepool", "North East", "Germany"], "entities": {"persons": [{"name": "brexit", "sentiment": "none"}, {"name": "phil taylor", "sentiment": "none"}, {"name": "peter mccusker", "sentiment": "none"}, {"name": "taylor", "sentiment": "none"}, {"name": "prof taylor", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "hartlepool", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "none"}, {"name": "engie", "sentiment": "none"}, {"name": "rwe", "sentiment": "none"}, {"name": "newcastle university", "sentiment": "none"}, {"name": "siemens professor of energy systems", "sentiment": "none"}, {"name": "northern powergrid", "sentiment": "none"}, {"name": "fifth carbon budget", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["Brexit", "Phil Taylor", "Peter McCusker", "Taylor", "Prof Taylor"], "text": "Newcastle professor says UK could produce 100% of its energy from renewable sources 18:30, 20 Jul 2016 By Peter McCusker Newcastle University energy expert Prof Phil Taylor says the UK can be at the forefront of the decarbonisation of the energy system Shares Get business news by email Newcastle University's Prof. Phil Taylor, Director of NIRes, Professor of Electrical Power Systems \nOne of the North East’s leading academics says the massive changes on how we make and use energy are paving the way for the transition to a 100% renewable electricity system. Peter McCusker reports. \n“WE need to build a new energy system to support the transition from fossil fuels to low carbon sources”, says Prof Phil Taylor Siemens Professor of Energy Systems at Newcastle University. \nRather than the old ‘fit and forget’ model of large fossil-fuel generating power stations transmitting electricity to homes and businesses through a network of pylons and wires the new system will be ‘smart’. \n“In the years to come every household appliance will have its own IP address linking it to the internet and allowing it be controlled from an app on our smart phones,” he said. \nThis so-called ‘internet of things’ will allow us, and the network operator, to tailor demand to accommodate the unreliability of renewable energy. \n“If the wind isn’t blowing or the sun isn’t shining then we may be asked to use less electricity and our pre-programmed appliances will react as instructed,” explained Prof Taylor. \nIf this all sounds a bit Big Brother-like Prof Taylor quickly moved to assure energy users it doesn’t mean switching of the TV during Coronation Street or Match of the Day. \n“Just moving the time we use a washing machine, or switching off the fridge for a few minutes can substantially reduce the strain on the grid. \n“This type of flexibility on the demand side of the domestic and commercial system can have major savings in energy use.” \nHe then outlined an example where all 20m homes in the UK switched off the equivalent of one bar on an electric fire. This would equate to 2GW of electricity which is greater than the capacity of Hartlepool nuclear power station, or equivalent to the additional capacity needed by the National Grid on a cold winter’s night. \nNewcastle University is currently working with a transmission company on a smart-plug trial which has seen 250 homes in the North East adopt wi-fi enabled household plugs in a trial designed to evaluate smart electricity possibilities. \n“Some estimate that by 2025 a household which is operating smartly in the way it uses its electricity could be saving £150 a year,” said Prof Taylor. \n“Then there are all of the laptops and smart phones that may be getting charged and could be switched off; the possibility of creating a new energy system in which demand-side response measures play a key role are huge,” he continued. \nAs well as demand-side response there are a further two key ingredients to this new energy system transition; continental interconnectors and abundant storage, while all these measures are set to cost a lot of money with some estimated the total bill at over £30bn. \n“We cannot pretend that this low carbon transition will not come at a cost. There will have to be massive investment in energy storage, new interconnectors and smart meters. \n“This will have to be recovered from somewhere; whether it be taxation or energy bills, or both.” \nProf Taylor expressed concerns that Brexit will impact on this low-carbon transition by reducing the appetite for investment in new continental electricity interconnectors. \n“More interconnectors are vital; if the wind is blowing, there is inadequate storage, low UK demand and we cannot export it to the continent, then we will effectively have to throw it away.” \nProf Taylor, who has previously argued that poorer families should have subsidised energy bills, said pushing ahead with this green transition has to be a priority for the UK. \nHe said that despite a series of policy U-turns by the Conservatives he was heartened by its recent decision to ratify with the Fifth Carbon Budget which ties the UK into stringent carbon reduction targets. \nHe continued: “If we don’t do it now then it will cost even more 20 years down the line. \n“By starting now we can become the world leaders in innovation, it will be less damaging to the environment - reducing the risk of thinks like flooding - and it will end up being cheaper over time.” \nAs well as changing the way we use energy in our businesses and homes this shake-up of the electricity system is set to lead to some major changes in the way the electricity system is designed and operated. \nIn Germany, which has travelled down the renewable road more quickly than any other country, its major energy utilities E.ON and RWE are struggling to balance their books. \nWith renewable power given primacy on the grid, many of their existing fossil fuel baseload plants are no longer profitable, while French energy utility company Engie recently acquired an 80% stake in the Californian battery storage company. \nIn the UK, the denationalisation programme of the 1980s created separate entities from power generators, to the National Grid, to transmission companies such as Northern Powergrid and the energy companies which bill us for our supplies. \nProf Taylor believes the needs of the new energy system will knit this structure back together. \n“The companies producing the wind, providing the transmission wires and those interfacing with consumers will start working more closely and we will see the system knitting back together. \n“A key focus of these new relationships will be jointly investing in the storage that will be required to support the renewable energy transition.” \nProf Taylor says this could lead to a growth in community-based energy companies, while all of these changes open the way for the decarbonisation of the power grid and provide an opportunity for ‘the UK to secure 100% of its electricity from renewable sources’. \nFollow Peter McCusker on Twitter @mccusker60 In the second part of the Prof Taylor interview next week we report on how Newcastle University’s new energy centre will help in the drive to decarbonise the whole energy system.", "external_links": [], "published": "2016-07-20T20:30:00.000+03:00", "crawled": "2016-07-20T21:24:16.161+03:00", "highlightTitle": ""}