{"organizations": ["EU", "NFU"], "uuid": "34ba2841b7fb17666fd99de63b9ca07b66cafdac", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i2.chroniclelive.co.uk/incoming/article11588077.ece/ALTERNATES/s1200/JS40888900.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "nechronicle - Home", "url": "http://www.chroniclelive.co.uk/business/farming/nfu-launches-countrys-largest-post-11587862", "country": "GB", "domain_rank": 21960, "title": "NFU launches country's largest post-Brexit farming consultation", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "NFU launches country's largest post-Brexit farming consultation", "spam_score": 0.0, "site_type": "news", "published": "2016-07-08T16:09:00.000+03:00", "replies_count": 0, "uuid": "34ba2841b7fb17666fd99de63b9ca07b66cafdac"}, "author": "Robert Gibson", "url": "http://www.chroniclelive.co.uk/business/farming/nfu-launches-countrys-largest-post-11587862", "ord_in_thread": 0, "title": "NFU launches country's largest post-Brexit farming consultation", "locations": ["Brexit", "EU", "UK"], "entities": {"persons": [{"name": "meurig raymond", "sentiment": "none"}, {"name": "minette batters", "sentiment": "none"}, {"name": "guy smith", "sentiment": "none"}, {"name": "phil hogan", "sentiment": "none"}, {"name": "hogan", "sentiment": "none"}, {"name": "raymond", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "nfu", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["Meurig Raymond", "Minette Batters", "Guy Smith", "Phil Hogan", "Hogan", "Raymond"], "text": "NFU launches country's largest post-Brexit farming consultation 14:09, 8 Jul 2016 EU Commissioner Phil Hogan has confirmed no changes will take place for the time being Shares Get business news by email Minette Batters, NFU deputy president \nThe NFU has kicked off the UK’s biggest consultation on what the British farming industry will look like outside the EU . \nKeen to grasp the earliest opportunity to engage with members on the issue, the organisation’s officeholder team discussed the impact of Brexit and took questions at the two-day Livestock 2016 event this week. \nA consultation focused on the future of farming in light of the ‘out’ vote will now run throughout the summer. \nNFU president Meurig Raymond said: “We’ve seen a seismic change in the political system in this country. \n“We’re left in uncharted waters, but we’re also left with an opportunity for the NFU and its members to engage with Government and shape a profitable and productive future for farming.” \nHe added that the NFU remained committed to listening to its members and making their views count. \nNFU Vice President Guy Smith said: “The future of trade agreements, access to labour, regulation and farm support is unclear. \n“But, in no uncertain terms, the NFU is committed to providing the vision of farming outside of the EU for Government to deliver, strengthened by the membership. \n“Farmers of all ages, of all sectors, must be part of this debate. \n“We have a unique opportunity to develop a domestic agricultural policy, a chance to shape this to fit our needs and ensure a positive future for our industry.” \nThe organisation’s deputy president Minette Batters, meanwhile, said the NFU had already set out its principles for “the bare bones of a domestic agricultural policy”. \nIt now needed farmers themselves to help it shape critical policy areas. \n“Brexit means food security in this country must now be a political priority,” she said. \n“I know that farmers in this country have excelled at producing food to exceptionally high standards, they are proud to lead the world on traceability and animal welfare. \n“So unsurprisingly there is huge global demand for Red Tractor food. \n“When the UK leaves the EU we are going to need the Government to be ambitious and innovative in ensuring farmers have access to the best possible trade agreements.” \nThe launch of the consultation follows confirmation from the EU Commissioner for Agriculture and Rural Development Phil Hogan the UK “would remain a full member of the EU” until Article 50 discussions are completed. \nIn a letter sent to Mr Raymond, the Commissioner also explained that farmers would “continue to have full access to the CAP support schemes and to the EU internal market”. \nThey would likewise have to comply with all existing EU legislation. \nMr Raymond said: “I appreciate Commissioner Hogan taking the time to provide this clarity during these uncertain times. \n“UK farmers welcome the fact it is ‘business as usual’ for the time being. Existing rules - and the penalties that come with failing to comply with them - will continue to apply for the foreseeable future. \n“Our focus now is on our leaders at home; we will be clarifying what we need under a new domestic farming policy and then discussing this nationally with our membership as part of the biggest farming consultation for a generation. \n“But we appreciate the commissioner’s support and will relay his message to our members loud and clear: business as usual.”", "external_links": [], "published": "2016-07-08T16:09:00.000+03:00", "crawled": "2016-07-08T17:00:26.193+03:00", "highlightTitle": ""}