{"organizations": ["Leicestershire", "Justice Select Committee", "Ministry of Justice", "Glen Parva Young Offenders Institution", "Prison Service"], "uuid": "6f59c901833143c6f204cf3fa788c22550cb70af", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "http://www.leicestermercury.co.uk/images/localworld/ugc-images/276308/Article/images/29533045/14920897.jpg", "site_section": "http://www.thisisleicestershire.co.uk/elections2009/rss.html?chid=181299", "section_title": "Leicester Mercury All Content Feed", "url": "http://www.leicestermercury.co.uk/glen/story-29533045-detail/story.html", "country": "GB", "domain_rank": 48128, "title": "danjmartin published Glen Parva YOI starts holding adult prisoners alongside young...", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "danjmartin published Glen Parva YOI starts holding adult prisoners alongside young...", "spam_score": 0.0, "site_type": "news", "published": "2016-07-20T15:42:00.000+03:00", "replies_count": 0, "uuid": "6f59c901833143c6f204cf3fa788c22550cb70af"}, "author": "danjmartin", "url": "http://www.leicestermercury.co.uk/glen/story-29533045-detail/story.html", "ord_in_thread": 0, "title": "danjmartin published Glen Parva YOI starts holding adult prisoners alongside young...", "locations": ["Leicester"], "entities": {"persons": [{"name": "glen parva yoi", "sentiment": "none"}, {"name": "costa", "sentiment": "none"}, {"name": "alberto costa", "sentiment": "none"}, {"name": "adam bent", "sentiment": "none"}, {"name": "alison clarke", "sentiment": "none"}, {"name": "glen parva", "sentiment": "none"}], "locations": [{"name": "leicester", "sentiment": "none"}], "organizations": [{"name": "leicestershire", "sentiment": "none"}, {"name": "justice select committee", "sentiment": "none"}, {"name": "ministry of justice", "sentiment": "none"}, {"name": "glen parva young offenders institution", "sentiment": "none"}, {"name": "prison service", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["Glen Parva YOI", "Costa", "Alberto Costa", "Adam Bent", "Alison Clarke", "Glen Parva"], "text": "Glen Parva YOI starts holding adult prisoners alongside young offenders By danjmartin | Posted: July 20, 2016 0 COMMENTS SHARES Glen Parva YOI starts holding adult prisoners alongside young offenders X \nCopy link to paste in your message / Comments (0) \nGlen Parva Young Offenders Institution has now started taking adult inmates. \nSince 1974 the prison has been used just for inmates aged 18 to 21 but last month the Ministry of Justice (MoJ) scrapped the age cap. \nIt says it took the measure because Glen Parva had a unused capacity to take 500 more prisoners due to a drop in the number of young offenders being incarcerated. \nGovernment officials say the move makes best use of the Prison Service estate. \nThe MoJ has however refused to say how many Category C adult prisoners have been moved into the jail. \nWhile it said that older and younger prisoners were not held in the same cell it did not give an explanation of whether they were mixed in the general population. \nRead more: Man appears in court accused of murdering Adam Bent in Braunstone Gate \nA Ministry of Justice spokeswoman said: \"We are committed to making best use of the prison estate, both to secure the best value for the taxpayer and to make sure that offenders are held in the premises best suited to rehabilitation and education. \n\"We have extensive experience in holding adults alongside young offenders, and they are always accommodated in separate cells. \"We will never compromise on the safety of staff or prisoners.\" \n\"he added: \"We continue to work closely alongside the prison to identify the number of vacant prisoner places which can be filled whilst operating a safe regime. \n\"As the number of young adult prisoners has fallen by around 40 per cent between 2010 and 2015, there is now more available capacity in the young adult estate.\" \nSouth Leicestershire MP Alberto Costa recently visited the prison. \nHe formerly worked as a Government lawyer and visited some 40 prisons. \nHe said: \"As part of my sitting on the Justice Select Committee I have been very keen in questioning the Ministry of Justice to ensure that Glen Parva has the sufficient resources to ensure the safety of the those inside the prison and the security of those outside. \n\"I particularly wanted to know what the staff ratios were going to be when the new adult inmates arrived. \n\"The governor, Alison Clarke, needs the resources to be able to manage the increased numbers. \n\"It is to be welcomed that the number of young adult prisoners is falling but if there is spare capacity I would imagine the Prison Service would want to use it all so I would think we are talking about hundreds rather than dozens of adult inmates. \n\"My constituents are used to having the prison there but they will want to know about changes happening.\" \nRead more: Brexit risk row over £35m regeneration of Leicester's rundown Waterside area \nLast year the Government ditched a controversial £85 million plan for a secure college at Glen Parva to house 320 youngsters aged 12 to 17. \nMr Costa said he understood Glen Parva was still under consideration as potential site for a new modern prison to replace ageing Victorian jails.", "external_links": [], "published": "2016-07-20T15:42:00.000+03:00", "crawled": "2016-07-20T16:39:33.900+03:00", "highlightTitle": ""}