{"organizations": ["Committee", "MPC", "Treasury", "Bank", "Aberdeen Asset Management", "Bank of England", "Agency Staff Bank of England", "Monetary Policy Committee"], "uuid": "23d5e50f1f107ff00ffc7c48603c9061e0ba5d5e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "http://i3.chroniclelive.co.uk/incoming/article11614267.ece/ALTERNATES/s1200/JS94597971.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "nechronicle - Business", "url": "http://www.chroniclelive.co.uk/business/business-news/interest-rates-stay-hold-cut-11614192", "country": "GB", "domain_rank": 21960, "title": "Interest rates stay on hold - but cut could be just around the corner", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "Interest rates stay on hold - but cut could be just around the corner", "spam_score": 0.0, "site_type": "news", "published": "2016-07-14T14:58:00.000+03:00", "replies_count": 0, "uuid": "23d5e50f1f107ff00ffc7c48603c9061e0ba5d5e"}, "author": "Agency Staff", "url": "http://www.chroniclelive.co.uk/business/business-news/interest-rates-stay-hold-cut-11614192", "ord_in_thread": 0, "title": "Interest rates stay on hold - but cut could be just around the corner", "locations": ["US", "England", "UK", "EU"], "entities": {"persons": [{"name": "anthony", "sentiment": "none"}, {"name": "mark carney", "sentiment": "none"}, {"name": "carney", "sentiment": "none"}, {"name": "paul diggle", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}], "organizations": [{"name": "committee", "sentiment": "none"}, {"name": "mpc", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}, {"name": "bank", "sentiment": "none"}, {"name": "aberdeen asset management", "sentiment": "none"}, {"name": "bank of england", "sentiment": "none"}, {"name": "agency staff bank of england", "sentiment": "none"}, {"name": "monetary policy committee", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": ["Anthony", "Mark Carney", "Carney", "Paul Diggle"], "text": "Interest rates stay on hold - but cut could be just around the corner 12:58, 14 Jul 2016 12:58, 14 Jul 2016 By Agency Staff Bank of England surprises commentators by keeping rates at 0.5%, but expected cut could be coming in August Shares Get   Anthony Devlin/PA Wire The Bank of England \nThe Bank of England held fire on delivering a post-Brexit vote boost for the economy as it kept interest rates on hold once more, but signalled that a cut may be on the cards next month. \nMinutes of the highly-anticipated decision by the Monetary Policy Committee (MPC) showed members voted 8-1 to leave rates at 0.5%, where they have been since March 2009. \nOne member - Gertjan Vlieghe - voted for an immediate cut to 0.25% amid signs that the EU referendum decision was already hitting parts of the economy, with growth set to come under further pressure. \nBut the minutes of the MPC meeting showed the economy had been resilient in the run-up to the vote, with the Bank now expecting second-quarter growth to pick up to around 0.5%, from 0.4% in the previous three months. \nMost policymakers wanted to wait until the Bank’s quarterly forecasts on August 4 before taking further action as banks and financial markets have also held up surprisingly well since the vote. \nConsumers may yet be in line for a further reduction in borrowing costs, though, with the minutes confirming “most members of the Committee expected monetary policy to be loosened in August”. \nBank governor Mark Carney has already said that, in his personal view, a rate cut was likely over the summer and has hinted at the possibility of firing up the printing presses to deliver more quantitative easing (QE) to shore up the economy. \nAll nine members of the MPC voted to keep QE on hold at £375bn this month, but the minutes showed rate-setters are looking at “various possible packages of measures”. \n“The exact extent of any additional stimulus would be based on the Committee’s updated forecast,” the Bank said. \nThe decision to hold rates comes despite intense speculation that the Bank would move to slash rates this month, with financial markets having priced in a cut to 0.25%. \nSterling jumped one cent against the dollar, rising from $1.32 to $1.33, almost 1%, after the no change vote. \nThe FTSE 100 Index tailed off slightly following the MPC announcement, edging down 5.9 points to 6664.3. \nEconomist Paul Diggle, of Aberdeen Asset Management, said: “The Bank of England has decided that patience is a virtue. \n“There’s going to be a bit of disappointment in financial markets. They had taken Carney’s earlier comments about easier monetary policy to heart and forgot his reputation for changing his mind. \n“But the next meeting is only three weeks away, and by then Carney and his colleagues will have a few extra post-referendum data points to digest as well as a new set of forecasts. The market should get its way then, with an interest rate cut likely and renewed quantitative easing possible.” \nThe Bank said it had taken some “reassurance” from signs that financial markets were weathering the Brexit vote. \nWhile the pound had plunged in value, hitting 31-year lows against the US dollar last week, equities had already surged past levels seen before the referendum. \nBanks and wholesale money markets were also holding up well, added the Bank. \n“The improved resilience of the core of the UK financial system and the flexibility of the regulatory framework, had allowed the impact of the referendum result to be dampened rather than amplified,” according to the minutes. \nBut the Bank said weakened property markets and recent figures suggesting consumer and business confidence had plunged in the wake of the Brexit vote fuelled its fears that risks from the Brexit vote had begun to “crystallise”. \nIt cautioned the “uncertainty flowing from the referendum result was likely to be negative for near-term activity”. \nBrexit jitters have seen a raft of property funds go into lockdown after investors rushed to pull out their money over fears of a collapse in real estate prices. \nThe Bank has already unveiled a series of measures to help limit the Brexit blow, relaxing banking rules to boost their lending firepower by up to £150bn and pledging to pump in at least £250bn if needed to calm markets in the immediate aftermath of the Brexit decision. \nIt is expected that the Bank and Treasury may also look to expand its Funding for Lending scheme offering banks cheap finance on the condition they lend more.", "external_links": [], "published": "2016-07-14T14:58:00.000+03:00", "crawled": "2016-07-14T15:29:23.999+03:00", "highlightTitle": ""}